{
  "url": "https://www.nasdaq.com/article/why-ardelyx-shares-are-sinking-today-cm1207438",
  "title": "Why Ardelyx Shares Are Sinking Today - Nasdaq.com",
  "text": [
    " What happened Shares of   Ardelyx    (NASDAQ: ARDX) were down 16.8% as of 11:42 a.m. EDT on Wednesday.   The drop came after   the biotech stock soared Tuesday    following its announcement of positive results from a late-stage   study evaluating its lead experimental drug candidate,   tenapanor. Ardelyx didn't announce any further news Wednesday, so the   most likely reason for the decline is that investors are taking   profits.   Image source: Getty Images.makeArticleAd();  So what High volatility comes with the territory when   investing in biotech stocks    , especially clinical-stage biotechs like Ardelyx. But in many   cases, the up-and-down swings don't really mean much. It's nearly   always best to focus on the reasons for buying (or not buying) a   stock in the first place, and ignore the short-term share price   fluctuations. The main reason to consider investing in Ardelyx is its   tenapanor. The results announced on Tuesday -- from a late-stage   study of the drug in combination with phosphate binders in   treating patients with chronic kidney disease (CKD) who are on   dialysis -- make its prospects for approval look brighter than   ever. Ardelyx reported that tenapanor easily met its primary   endpoint of reducing serum phosphorus by a statistically   significant level. The drug also met all of the study's secondary   endpoints. Ardelyx CEO Mike Raab said that he was \"thrilled with the   positive results\" from the Amplify study. While the executives of   biotechs usually try to spin clinical results in the best light   possible, Raab's enthusiasm appears justified. Hyperphosphatemia   (elevated phosphorus levels) is a serious condition in CKD   patients that impacts around 745,000 people worldwide. A new   therapy for it is much needed. Now what While the results from the Amplify study certainly present   good news for Ardelyx, the company still has more hurdles to   jump. The biotech expects to announce results from its second   late-stage study of tenapanor as a monotherapy in the fourth   quarter. If those results are also positive, Ardelyx plans   to file for U.S. approval for tenapanor as a monotherapy and as a   combination therapy with phosphate binders for treating   hyperphosphatemia.   10 stocks we like better than Ardelyx       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Ardelyx wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Keith Speights      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   Ardelyx    (NASDAQ: ARDX) were down 16.8% as of 11:42 a.m. EDT on Wednesday.   The drop came after   the biotech stock soared Tuesday    following its announcement of positive results from a late-stage   study evaluating its lead experimental drug candidate,   tenapanor.",
    "Ardelyx didn't announce any further news Wednesday, so the   most likely reason for the decline is that investors are taking   profits.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "High volatility comes with the territory when   investing in biotech stocks    , especially clinical-stage biotechs like Ardelyx. But in many   cases, the up-and-down swings don't really mean much. It's nearly   always best to focus on the reasons for buying (or not buying) a   stock in the first place, and ignore the short-term share price   fluctuations.",
    "The main reason to consider investing in Ardelyx is its   tenapanor. The results announced on Tuesday -- from a late-stage   study of the drug in combination with phosphate binders in   treating patients with chronic kidney disease (CKD) who are on   dialysis -- make its prospects for approval look brighter than   ever. Ardelyx reported that tenapanor easily met its primary   endpoint of reducing serum phosphorus by a statistically   significant level. The drug also met all of the study's secondary   endpoints.",
    "Ardelyx CEO Mike Raab said that he was \"thrilled with the   positive results\" from the Amplify study. While the executives of   biotechs usually try to spin clinical results in the best light   possible, Raab's enthusiasm appears justified. Hyperphosphatemia   (elevated phosphorus levels) is a serious condition in CKD   patients that impacts around 745,000 people worldwide. A new   therapy for it is much needed.",
    "While the results from the Amplify study certainly present   good news for Ardelyx, the company still has more hurdles to   jump. The biotech expects to announce results from its second   late-stage study of tenapanor as a monotherapy in the fourth   quarter. If those results are also positive, Ardelyx plans   to file for U.S. approval for tenapanor as a monotherapy and as a   combination therapy with phosphate binders for treating   hyperphosphatemia.",
    "  10 stocks we like better than Ardelyx       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Ardelyx wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Ardelyx       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Ardelyx wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Keith Speights      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 12:00:00"
}