{
  "url": "https://www.nasdaq.com/article/bank-of-america-bac-outpaces-stock-market-gains-what-you-should-know-cm1207629",
  "title": "Bank of America (BAC) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " In the latest trading session, Bank of America (BAC) closed at $27.49, marking a +1.63% move from the previous day. The stock outpaced the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%. Coming into today, shares of the nation's second-largest bank had lost 4.82% in the past month. In that same time, the Finance sector lost 2.42%, while the S&P 500 lost 0.68%. BAC will be looking to display strength as it nears its nex t earnings  release. In tha t report  , analysts expect BAC to post earnings of $0.68 per share. This would mark year-over-year growth of 3.03%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $22.14 billion, down 2.8% from the year-ago period. Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $2.82 per share and revenue of $91.03 billion. These totals would mark changes of +8.05% and -0.24%, respectively, from last year. Investors should also note any recent changes to analyst estimates for BAC. These revisions typically reflect the latest short-term business trends, which can change frequently. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.18% lower within the past month. BAC is currently a Zacks Rank #3 (Hold). Valuation is also important, so investors should note that BAC has a Forward P/E ratio of 9.58 right now. This valuation marks a discount compared to its industry's average Forward P/E of 10.43. Also, we should mention that BAC has a PEG ratio of 1.06. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Banks - Major Regional industry currently had an average PEG ratio of 1.27 as of yesterday's close. The Banks - Major Regional industry is part of the Finance sector. This industry currently has a Zacks Industry Rank of 204, which puts it in the bottom 21% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. To follow BAC in the coming trading sessions, be sure to utilize Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Bank of America Corporation (BAC): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "In the latest trading session, Bank of America (BAC) closed at $27.49, marking a +1.63% move from the previous day. The stock outpaced the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%.",
    "Coming into today, shares of the nation's second-largest bank had lost 4.82% in the past month. In that same time, the Finance sector lost 2.42%, while the S&P 500 lost 0.68%.",
    "BAC will be looking to display strength as it nears its nex t earnings  release. In tha t report  , analysts expect BAC to post earnings of $0.68 per share. This would mark year-over-year growth of 3.03%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $22.14 billion, down 2.8% from the year-ago period.",
    "Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $2.82 per share and revenue of $91.03 billion. These totals would mark changes of +8.05% and -0.24%, respectively, from last year.",
    "Investors should also note any recent changes to analyst estimates for BAC. These revisions typically reflect the latest short-term business trends, which can change frequently. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.",
    "Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.",
    "The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.18% lower within the past month. BAC is currently a Zacks Rank #3 (Hold).",
    "Valuation is also important, so investors should note that BAC has a Forward P/E ratio of 9.58 right now. This valuation marks a discount compared to its industry's average Forward P/E of 10.43.",
    "Also, we should mention that BAC has a PEG ratio of 1.06. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Banks - Major Regional industry currently had an average PEG ratio of 1.27 as of yesterday's close.",
    "The Banks - Major Regional industry is part of the Finance sector. This industry currently has a Zacks Industry Rank of 204, which puts it in the bottom 21% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "To follow BAC in the coming trading sessions, be sure to utilize Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:45:23"
}