{
  "url": "https://www.nasdaq.com/article/technology-sector-update-for-09032019-tufn-eml-phun-cm1206796",
  "title": "Technology Sector Update for 09/03/2019: TUFN, EML, PHUN - Nasdaq.com",
  "text": [
    "Top Technology Stocks:",
    "MSFT: -0.88%",
    "AAPL: -1.57%",
    "IBM: -0.89%",
    "CSCO: -0.45%",
    "GOOG: -0.26%",
    "Technology stocks were slipping in midday trading, with the shares of tech stocks in the S&P 500 down 1.2% in value and the Philadelphia Semiconductor Index also falling 2%.",
    "Among tech stocks moving on news:",
    "(+) Tufin ( TUFN  ) was gaining 1.3% after the network security company reported a smaller-than-expected loss in Q2. Non-GAAP net loss was $0.18 per share compared to a loss of $0.28 per share in the 2018 period, better than the consensus estimate of $0.20 loss per share in a Capital IQ survey.",
    "In other  stock news  :",
    "(+) The Eastern Company ( EML  ) was up 2% after acquiring Big 3 Precision Products and Big 3 Precision Mold Services from TVV Capital for $81.7 million.",
    "(+) MAM Software Group ( MAMS  ) was jumping 13.5% after it agreed to be acquired by Kerridge Commercial Systems in an all-cash transaction valued at about $154.2 million. Under the agreement, MAM stockholders will receive $12.12 per share in cash for each common share of the company, representing a 14% premium over the closing price on Aug. 30.",
    "(+) Phunware ( PHUN  ) was advancing 5% after it unveiled partnerships it said would implement its Multiscreen-as-a-Service (MaaS) platform at Buffalo Heights, a mixed-use real estate development in Houston.",
    "(+) Resonant ( RESN  ) was gaining 5% in value after it filed a registration statement for the sale of up to 1.2 million shares of common stock held by selling stockholders for a maximum offering price of up to $3.13 per share, or $3.7 million in aggregate.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-03 13:10:25"
}