{
  "url": "https://www.nasdaq.com/article/cuba-says-battling-acute-fuel-shortage-due-to-us-sanctions-20190911-00940",
  "title": "Cuba says battling acute fuel shortage due to U.S. sanctions - Nasdaq.com",
  "text": [
    "By Sarah Marsh and Nelson Acosta",
    "HAVANA, Sept 11 (Reuters) - Cuba must implement emergency measures to stave off an acute fuel shortage in September caused by the Trump administration's efforts to block oil shipments to the country, President Miguel Diaz-Canel said on Wednesday.",
    "The island will have to make do this month with the little fuel now available, plus supply from a ship that arrives on Saturday and another at the end of September, Diaz-Canel said in a roundtable discussion on state television.",
    "\"There may be tense situations in the distribution of some products and the provision of services to the population in the coming days,\" Diaz-Canel said.",
    "The aim was to avoid blackouts, he said, adding: \"If we have to do them ... they will not be as long nor as intense of those of the Special Period,\" a reference to the severe economic depression Cuba went through in the 1990s following the collapse of the Soviet Union.",
    "Cuba's centrally planned economy has faced a cash crunch since 2015 following a decline in the supply of oil from leftist ally Venezuela, forcing the government to adopt austerity measures.",
    "Since then, U.S. President Donald Trump's administration has tightened the decades-old embargo on Cuba in what it says is an attempt to get the Communist government to reform and drop support for Venezuela's embattled president, Nicolas Maduro.",
    "Some analysts say it is also eyeing the anti-Castro exile vote in the battleground state of Florida in next year's presidential election.",
    "\"I can assure you that we have a strategy to succeed and the Yankee administration will not achieve its aim of disheartening the Cuban people and much less vanquishing it,\" Diaz-Canel said.",
    "U.S measures have included new sanctions on vessels and firms involved in oil exports to the island.",
    "\"We have had to carry out constant negotiations to see how we manage to get fuel to the country, and the last ones ... did not work out,\" Diaz-Canel said.",
    "Economy Minister Alejandro Gil said in the roundtable the Cuban government was focusing this month on ensuring basic services to the population at the cost of lower economic productivity, which could mean investment projects would have to be paused for a few weeks.",
    "The government will explain the emergency measures in more detail on another roundtable discussion on state TV on Thursday evening.",
    "The president exhorted all Cubans to contribute to greater energy efficiency. Workers with state cars should offer rides to others and those who could work from home should do so.",
    "Diaz-Canel assured Cubans the crisis was not a return to the Special Period because the economy now had worldwide alliances and was more diversified.",
    "He said it now produced 40 percent of the country's fuel consumption and that tourism remained strong despite increased U.S. restrictions on travel to the island."
  ],
  "published_datetime": "2019-09-11 09:53:00"
}