{
  "url": "https://www.nasdaq.com/article/wednesday-sector-laggards-services-energy-cm1210657",
  "title": "Wednesday Sector Laggards: Services, Energy - Nasdaq.com",
  "text": [
    "In afternoon trading on Wednesday, Services stocks are the worst performing sector, not showing much of a gain. Within that group, Carmax Inc. (Symbol: KMX) and Wynn Resorts Ltd (Symbol: WYNN) are two large stocks that are lagging, showing a loss of 2.7% and 2.1%, respectively. Among the largest ETFs  , one ETF closely following services stocks is the iShares U.S. Consumer Services ETF (Symbol: IYC), which is up 0.2% on the day, and up 23.99% year-to-date. Carmax Inc., meanwhile, is up 35.45% year-to-date, and Wynn Resorts Ltd is up 18.50% year-to-date. Combined, KMX and WYNN make up approximately 0.8% of the underlying holdings of IYC. The next worst performing sector is the Energy sector, up 0.1%. Among large Energy stocks, Baker Hughes, A GE Company (Symbol: BHGE) and TechnipFMC plc (Symbol: FTI) are the most notable, showing a loss of 6.1% and 3.1%, respectively. One ETF closely tracking Energy stocks is the Energy Select Sector SPDR ETF ( XLE  ), which is down 0.1% in midday trading, and up 8.07% on a year-to-date basis. Baker Hughes, A GE Company, meanwhile, is up 7.77% year-to-date, and TechnipFMC plc is up 29.26% year-to-date. Combined, BHGE and FTI make up approximately 2.1% of the underlying holdings of XLE.    Comparing these stocks and ETFs on a trailing twelve month basis, below is a relative stock price performance chart, with each of the symbols shown in a different color as labeled in the legend at the bottom:  makeArticleAd();       Here's a snapshot of how the S&P 500 components within the various sectors are faring in afternoon trading on Wednesday. As you can see, eight sectors are up on the day, while none of the sectors are down.      25 Dividend Giants Widely Held By ETFs »  ",
    "The next worst performing sector is the Energy sector, up 0.1%. Among large Energy stocks, Baker Hughes, A GE Company (Symbol: BHGE) and TechnipFMC plc (Symbol: FTI) are the most notable, showing a loss of 6.1% and 3.1%, respectively. One ETF closely tracking Energy stocks is the Energy Select Sector SPDR ETF ( XLE  ), which is down 0.1% in midday trading, and up 8.07% on a year-to-date basis. Baker Hughes, A GE Company, meanwhile, is up 7.77% year-to-date, and TechnipFMC plc is up 29.26% year-to-date. Combined, BHGE and FTI make up approximately 2.1% of the underlying holdings of XLE.",
    "  25 Dividend Giants Widely Held By ETFs » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:35:49"
}