{
  "url": "https://www.nasdaq.com/article/nordea-names-former-handelsbanken-boss-as-new-ceo-20190905-00082",
  "title": "Nordea names former Handelsbanken boss as new CEO - Nasdaq.com",
  "text": [
    "By Tarmo Virki and Johannes Hellstrom",
    "STOCKHOLM/HELSINKI, Sept 5 (Reuters) - Finland's Nordea  on Thursday named Frank Vang-Jensen, head of personal banking at the Nordic region's biggest bank, as its new chief executive, who pledged to keep a close eye on costs at the group.",
    "Vang-Jensen, who has worked at Nordea since 2017, was a former chief executive at rival Handelsbanken  but was ousted abruptly from that role in 2016 after only 18 months in the job.",
    "Vang-Jensen will take over as Nordea and other banks across the Nordic region are facing pressure on profits, including from low interest rates and tough competition in mortgages and loans.",
    "Nordea reported weak second-quarter numbers in July and said it would review its financial targets in coming months.",
    "Danish rival Danske Bank , which has been involved in a money laundering scandal, also announced a top management change on Thursday, naming Commerzbank  executive Stephan Engels as its new finance chief. ",
    "EYES ON COSTS",
    "Vang-Jensen told a news conference Nordea would introduce new targets and a business plan after reporting the third-quarter results next month. He declined to comment on details, but said he would keep a close eye on costs.",
    "\"Striking the balance between cost and revenue will be one of my most important tasks,\" Vang-Jensen said.",
    "\"We operate in a extremely competitive environment. If our revenues go down our cost needs to go down more. If our revenues increase, we make sure our costs don't increase even more.\"",
    "Credit Suisse analysts' take on Vang-Jensen was: \"He is known for his focus on costs.\"",
    "Vang-Jensen's time at Handelsbanken ended with his sacking in an unusually brutal move for the normally staid Nordic banking sector. Handelsbanken's chairman said at the time the \"recruitment was a mistake\" and Vang-Jensen \"could not live up to the expectations.\"",
    "Vang-Jensen had worked to slim down Handelsbanken's operations and closed around 60 bank branches mainly in Sweden's biggest cities but also in the countryside, prompting protests from staff and some customers.",
    "\"He wanted to make real changes in the retail network which was not accepted by the bank,\" Danske analyst Andreas Hakansson said in a note.",
    "\"His willingness to do what was clearly needed there gives us comfort that he will also be prepared to make the necessary changes also at Nordea even if it will not be popular,\" the analyst said.",
    "Christer Gardell, co-founder and managing partner of activist fund Cevian Capital, Nordea's 6th largest shareholder with a 2.3% stake, welcomed the appointment but also piled pressure on the new CEO to boost financial performance.",
    "\"We look forward to a significantly higher pace in the work to dramatically improve the bank's profitability,\" he told Reuters.",
    "Shares in Nordea rose 3.9% to 5.84 euros in mid-morning trading."
  ],
  "published_datetime": "2019-09-05 02:29:00"
}