{
  "url": "https://www.nasdaq.com/article/what-happened-in-the-stock-market-today-cm1206971",
  "title": "What Happened in the Stock Market Today - Nasdaq.com",
  "text": [
    " Concerns about the effect of the trade war on the economy   deepened Tuesday after new tariffs went in place over the weekend   and a report showed that U.S. factory activity in August   contracted for the first time in three years. The   Dow Jones Industrial Average    (DJINDICES: ^DJI)  and the   S&P 500    (SNPINDEX: ^GSPC)  both fell, with trade-sensitive   industrial and technology stocks taking the biggest hits. Today's stock market  Data source: Yahoo! Finance. As for individual stocks, shares of    Medicines Company    (NASDAQ: MDCO) rose on news of a successful drug trial and those   of   Boston Beer    (NYSE: SAM)  declined in the wake of an analyst   downgrade.makeArticleAd();   Image source: Getty Images.  New cholesterol drug boosts Medicines Company Medicines Company presented details of a successful   pivotal clinical trial of inclisiran, the biopharma's new   cholesterol-lowering drug, and shares added to recent gains,   popping 10.4%. On average, the 1,617 patients in the study,   nearly all of which were already taking statins, achieved a 54%   reduction in LDL-C at day 510 of the study and a time-averaged   50% reduction from days 90 through 540. Inclisiran is the first of a new class of drugs called   small-interfering RNA, and has the advantage over existing   cholesterol-lowering drugs of being administered as an injection   only twice a year. The company is conducting two other phase 3   trials that are expected to read out in the third quarter,   followed by U.S. regulatory submission in Q4. Shares of Medicines Company   jumped 14%    last week when the   pharmaceutical company    announced that the trial was a success, and investors added to   those gains and boosted shares of partner   Alnylam Pharmaceuticals     after hearing new details today. Boston Beer faces competition in hard seltzer, but is   cannabis next? Shares of Boston Beer Company fell 6.2% to $411.10 after an   analyst downgraded the stock on concerns about competition   in the hard seltzer category. Kevin Grundy of Jeffries downgraded   Boston Beer from hold to underperform and lowered his target   price from $360 to $332. Grundy cited a Jeffries consumer survey   that indicated that seltzer drinkers have low brand loyalty and   that Boston Beer's Truly brand is mentioned in only 3% of social   media posts about hard seltzer. The   craft beer category    has changed a lot recently, turning into more of a local   phenomenon, with 1,000 new breweries popping up every year.   Boston Beer has become   more dependent on the hard seltzer category    to keep up its double-digit growth. The company has been   very successful    with this strategy to this point, saying in its most recent   conference call that growth of almost 17% was largely because of   Truly and Twisted Tea brands. In an interview with CNBC on Friday, CEO David Burwick noted   that while the company is investing heavily in hard seltzer, it's   watching developments in cannabis drinks closely, and said Boston   Beer will \"play ... some point down the road\" in the category   after it develops.   Offer from The Motley Fool: The 10 best stocks to buy     now            Motley Fool co-founders Tom and David Gardner have spent more     than a decade beating the market. In fact, the newsletter they     run,     Motley Fool Stock Advisor      , has quadrupled the S&P 500!* Tom and David just revealed their ten top stock picks for     investors to buy right now.  Click here to get access to the full       list!   *      Stock Advisor     returns as of June 1, 2019.     Jim Crumly      owns shares of ALNY. The Motley Fool owns shares of and     recommends ALNY and Boston Beer. The Motley Fool has a     disclosure policy      .  ",
    "Concerns about the effect of the trade war on the economy   deepened Tuesday after new tariffs went in place over the weekend   and a report showed that U.S. factory activity in August   contracted for the first time in three years. The   Dow Jones Industrial Average    (DJINDICES: ^DJI)  and the   S&P 500    (SNPINDEX: ^GSPC)  both fell, with trade-sensitive   industrial and technology stocks taking the biggest hits.",
    "Data source: Yahoo! Finance.",
    "As for individual stocks, shares of    Medicines Company    (NASDAQ: MDCO) rose on news of a successful drug trial and those   of   Boston Beer    (NYSE: SAM)  declined in the wake of an analyst   downgrade.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Medicines Company presented details of a successful   pivotal clinical trial of inclisiran, the biopharma's new   cholesterol-lowering drug, and shares added to recent gains,   popping 10.4%. On average, the 1,617 patients in the study,   nearly all of which were already taking statins, achieved a 54%   reduction in LDL-C at day 510 of the study and a time-averaged   50% reduction from days 90 through 540.",
    "Inclisiran is the first of a new class of drugs called   small-interfering RNA, and has the advantage over existing   cholesterol-lowering drugs of being administered as an injection   only twice a year. The company is conducting two other phase 3   trials that are expected to read out in the third quarter,   followed by U.S. regulatory submission in Q4.",
    "Shares of Medicines Company   jumped 14%    last week when the   pharmaceutical company    announced that the trial was a success, and investors added to   those gains and boosted shares of partner   Alnylam Pharmaceuticals     after hearing new details today.",
    "Shares of Boston Beer Company fell 6.2% to $411.10 after an   analyst downgraded the stock on concerns about competition   in the hard seltzer category. Kevin Grundy of Jeffries downgraded   Boston Beer from hold to underperform and lowered his target   price from $360 to $332. Grundy cited a Jeffries consumer survey   that indicated that seltzer drinkers have low brand loyalty and   that Boston Beer's Truly brand is mentioned in only 3% of social   media posts about hard seltzer.",
    "The   craft beer category    has changed a lot recently, turning into more of a local   phenomenon, with 1,000 new breweries popping up every year.   Boston Beer has become   more dependent on the hard seltzer category    to keep up its double-digit growth. The company has been   very successful    with this strategy to this point, saying in its most recent   conference call that growth of almost 17% was largely because of   Truly and Twisted Tea brands.",
    "In an interview with CNBC on Friday, CEO David Burwick noted   that while the company is investing heavily in hard seltzer, it's   watching developments in cannabis drinks closely, and said Boston   Beer will \"play ... some point down the road\" in the category   after it develops.",
    "  Offer from The Motley Fool: The 10 best stocks to buy     now            Motley Fool co-founders Tom and David Gardner have spent more     than a decade beating the market. In fact, the newsletter they     run,     Motley Fool Stock Advisor      , has quadrupled the S&P 500!* Tom and David just revealed their ten top stock picks for     investors to buy right now.  Click here to get access to the full       list!   *      Stock Advisor     returns as of June 1, 2019.  ",
    " Offer from The Motley Fool: The 10 best stocks to buy     now            Motley Fool co-founders Tom and David Gardner have spent more     than a decade beating the market. In fact, the newsletter they     run,     Motley Fool Stock Advisor      , has quadrupled the S&P 500!*",
    "Tom and David just revealed their ten top stock picks for     investors to buy right now.",
    " Click here to get access to the full       list! ",
    " *      Stock Advisor     returns as of June 1, 2019. ",
    "  Jim Crumly      owns shares of ALNY. The Motley Fool owns shares of and     recommends ALNY and Boston Beer. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:58:23"
}