{
  "url": "https://www.nasdaq.com/article/4-big-drugmakers-boasting-impressive-oncology-pipelines-cm1210445",
  "title": "4 Big Drugmakers Boasting Impressive Oncology Pipelines - Nasdaq.com",
  "text": [
    " There has been a significant uptick in demand for cancer drugs and subsequent growth of the cancer research market owing to the widespread occurrence of the disease.  Cancer is second only to heart disease when it comes to claiming lives. According to a report by the American Cancer Society, more than 1.76 million new cancer cases are expected to be diagnosed in 2019, which creates significant need for effective cancer medication. Allied Market Research estimates the global cancer drugs market to be worth more than $176 billion by 2025. The factors contributing to growth of the oncology/cancer drugs market are rapid progress of drugmakers' cancer pipelines and increase in the number of collaborations between pharmaceutical companies, which has lowered the cost burden, increased demand for personalized medicines and boosted demand in developing nations. Companies focused on making innovative cancer drugs are in great demand for buyouts. The traditional cancer treatments include surgery, radiation and chemotherapy. However, targeted therapy, immunotherapy, gene therapy, hormone therapy, precision medicine and other new novel therapies are slowly making their way into clinics to improve, supplement or replace traditional cancer treatments. Advances in new treatments have attracted investors' attention and made cancer a hot investing area lately. It goes without saying that all big pharma companies are working hard to bring innovative cancer treatments to market as well as expand the labels of their marketed oncology drugs to capture a share of this growing market. These pharma/biotech giants have significant financial resources at their disposal and have even collaborated to pool their resources and technology. Here we discuss four pharma giants, which possess the industry's strongest oncology pipeline portfolios.  AstraZeneca AZN  AstraZeneca is working on strengthening its oncology product portfolio and has several candidates in its pipeline. Oncology sales now comprise around 35% of total product sales for AstraZeneca. It has some high-profile cancer drugs in its portfolio like Tagrisso, Lynparza, Faslodex and Imfinzi, which are among its top medicines. AstraZeneca's cancer drugs are being studied in several label expansion studies, which can expand their eligible patient populations. It also has a few oncology candidates in its pipeline. Imfinzi, which is marketed for second line advanced bladder cancer and early stage lung cancer, is being evaluated for multiple cancers, either alone or in combination with other regimens. Lynparza, presently marketed for advanced ovarian cancer and breast cancer in partnership with Merck MRK  , is also in different studies for a range of tumor types including prostate, pancreatic and gastric cancers as well as earlier-line settings for ovarian cancer and breast cancer. Tagrisso is also being evaluated in earlier-line settings for lung cancer. Another new cancer drug in AstraZeneca's portfolio is Calquence (acalabrutinib), which is approved for previously treated mantle cell lymphoma. AstraZeneca expects to file regulatory applications for Calquence to get approval for the larger chronic lymphocytic leukemia indication (in frontline and in the relapsed/recurrent disease setting) later this year. Key oncology candidates in late-stage development include selumetinib (pediatric neurofibromatosis type 1) and savolitinib (non-small-cell lung carcinoma [NSCLC]). In April 2019, AstraZeneca acquired joint development and commercialization rights to an innovative antibody drug conjugate, trastuzumab deruxtecan from Japan's Daiichi Sankyo. A regulatory application seeking approval for trastuzumab deruxtecan in metastatic breast cancer is expected to be filed with the FDA in the second half of 2019.  Pfizer PFE  Pfizer gained FDA approval for four innovative cancer medicines in the last four months of 2018, which is likely to boost its oncology sales. These include Daurismo (glasdegib) for previously untreated AML, Lorbrena (lorlatinib) for second line non-small-cell lung cancer, Vizimpro (dacomitinib) for advanced NSCLC with EGFR activating mutations and Talzenna (talazoparib), an orally-available PARP inhibitor for advanced breast cancer. Two leukemia treatments - Besponsa for relapsed/refractory acute lymphoblastic leukemia and Mylotarg for newly diagnosed CD33-positive acute myeloid leukemia were approved in the United States in the third quarter of 2017. Meanwhile, Pfizer is also working on expanding the label of its key breast cancer drug Ibrance and prostate cancer drug, Xtandi. Pfizer's newest immunotherapy, Bavencio, though approved for two small indications currently, is being considered a significant future top-line driver for this New York-based pharma giant if it can gain label expansion approvals. Pfizer has 30 ongoing studies in the avelumab development program involving more than 9,000 patients across 15 tumor types. Importantly, Pfizer is gradually venturing into the oncology biosimilars space. Pfizer's biosimilar versions of Roche's cancer drugs Herceptin, Avastin and Rituxan were approved by the FDA in 2019. Biosimilar versions of Herceptin and Avastin are already approved in the EU while that of Rituxan is under review in the EU. Finally, the July acquisition of Array BioPharma for $11.4 billion has strengthened its cancer portfolio. Array launched its only commercial medicine, Braftovi plus Mektovi, as a treatment for BRAF-mutant melanoma, last year. The combination medicine is also being evaluated in label expansion studies for other cancer types including metastatic colorectal cancer with BRAF mutation.  Merck  Merck's oncology portfolio/pipeline, though revolving around just its revolutionary anti-PD-1 therapy, Keytruda, can be said to be one of the strongest in the industry. Keytruda is already approved for use in 20 cancer indications across 12 different tumor types in the United States. Keytruda is continuously growing and expanding into new indications and markets globally. Keytruda sales are gaining particularly from strong momentum in the indication of first-line lung cancer. In fact, the Keytruda development program is also progressing well and the drug is being studied for more than 30 types of cancer in more than 1000 studies, including more than 600 combination studies. Undoubtedly, Keytruda has strong future growth prospects based on increased utilization, approval for new indications and expectation of additional approvals worldwide. Meanwhile, Merck has profit sharing deals with AstraZeneca for Lynparza/selumetinib and Japan's Eisai for Lenvima for several types of cancer.  Bristol-Myers BMY  Bristol-Myers PD-1 inhibitor, Opdivo, has been performing impressively. The company is working on expanding the label of Opdivo further, alone or in combination therapies with Yervoy and other anti-cancer agents. Further, Bristol-Myers' cancer portfolio includes multiple myeloma drug, Empliciti and leukemia drug, Sprycel, which contribute significantly to the top line. In addition, Bristol-Myers is evaluating other immune system pathways for the treatment of cancer. These pathways may help the company bring to market potentially transformational immunotherapies - in combination or as monotherapy - to help fight different types of cancers. Most importantly its pending acquisition of Celgene for approximately $74 billion should boost its oncology franchise by adding blockbuster drugs like Revlimid and Pomalyst and several pipeline candidates across solid tumors and hematologic malignancies. While Merck and Bristol-Myers currently carry a Zacks Rank #2 (Buy), AstraZeneca has a Zacks Rank #3 (Hold). Pfizer holds a Zacks Rank of 4 (Sell). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  .   Others Not Far Behind  AbbVie's ABBV  key cancer drug and also what it calls a \"pipeline in a molecule\", Imbruvica, is currently approved for quite a few indications across different cancer types. Imbruvica has multi-billion dollar potential. Several studies on Imbruvica are ongoing to evaluate the drug alone or in combination in different patient segments. AbbVie is also studying another key cancer drug, Venclyxto/Venclexta to expand the label to address the broader relapsed/refractory chronic lymphocytic leukemia patient population, expand into earlier lines of therapy, and broaden into other hematologic malignancies like multiple myeloma and acute myeloid leukemia. Roche RHHBY  dominates the breast cancer space. There is strong demand for its HER2 franchise drugs like Herceptin, Perjeta and Kadcyla. Apart from its strong breast cancer franchise, Roche's oncology portfolio also boasts lung cancer drugs like Avastin, Tecentriq and Tarceva and hematology medicines like MabThera/Rituxan, Gazyva, and Venclexta.  Newly approved cancer medicines are Polivy Alcensa and Rozlytrek. Label expansion efforts are ongoing for almost all these cancer drugs. Swiss drugmaker Novartis' NVS  oncology portfolio was significantly boosted by the approval of breast cancer drug, Kisqali and CAR-T cell therapy Kymriah in 2017. Novartis also boasts many experimental cancer drugs in its R&D pipeline including a couple of biosimilar versions of popular cancer drugs.  Conclusion  Competition in the cancer market is fierce and not all pipeline candidates will be successful. However, pharma biggies have enough late-stage cancer programs in their portfolios and there are chances of quite a few rollouts in the coming years.   Large Cap Pharmaceuticals Industry 5YR %     Return        Large Cap Pharmaceuticals Industry 5YR %     Return    Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.  makeArticleAd();  Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   AbbVie Inc. (ABBV): Free Stock Analysis Report   Pfizer Inc. (PFE): Free Stock Analysis Report   Bristol-Myers Squibb Company (BMY): Free Stock Analysis Report   Novartis AG (NVS): Free Stock Analysis Report   AstraZeneca PLC (AZN): Free Stock Analysis Report   Roche Holding AG (RHHBY): Free Stock Analysis Report   Merck & Co., Inc. (MRK): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "There has been a significant uptick in demand for cancer drugs and subsequent growth of the cancer research market owing to the widespread occurrence of the disease. ",
    "Cancer is second only to heart disease when it comes to claiming lives. According to a report by the American Cancer Society, more than 1.76 million new cancer cases are expected to be diagnosed in 2019, which creates significant need for effective cancer medication.",
    "Allied Market Research estimates the global cancer drugs market to be worth more than $176 billion by 2025. The factors contributing to growth of the oncology/cancer drugs market are rapid progress of drugmakers' cancer pipelines and increase in the number of collaborations between pharmaceutical companies, which has lowered the cost burden, increased demand for personalized medicines and boosted demand in developing nations. Companies focused on making innovative cancer drugs are in great demand for buyouts.",
    "The traditional cancer treatments include surgery, radiation and chemotherapy. However, targeted therapy, immunotherapy, gene therapy, hormone therapy, precision medicine and other new novel therapies are slowly making their way into clinics to improve, supplement or replace traditional cancer treatments. Advances in new treatments have attracted investors' attention and made cancer a hot investing area lately.",
    "It goes without saying that all big pharma companies are working hard to bring innovative cancer treatments to market as well as expand the labels of their marketed oncology drugs to capture a share of this growing market. These pharma/biotech giants have significant financial resources at their disposal and have even collaborated to pool their resources and technology.",
    "Here we discuss four pharma giants, which possess the industry's strongest oncology pipeline portfolios.",
    " AstraZeneca AZN ",
    "AstraZeneca is working on strengthening its oncology product portfolio and has several candidates in its pipeline. Oncology sales now comprise around 35% of total product sales for AstraZeneca. It has some high-profile cancer drugs in its portfolio like Tagrisso, Lynparza, Faslodex and Imfinzi, which are among its top medicines.",
    "AstraZeneca's cancer drugs are being studied in several label expansion studies, which can expand their eligible patient populations. It also has a few oncology candidates in its pipeline.",
    "Imfinzi, which is marketed for second line advanced bladder cancer and early stage lung cancer, is being evaluated for multiple cancers, either alone or in combination with other regimens. Lynparza, presently marketed for advanced ovarian cancer and breast cancer in partnership with Merck MRK  , is also in different studies for a range of tumor types including prostate, pancreatic and gastric cancers as well as earlier-line settings for ovarian cancer and breast cancer. Tagrisso is also being evaluated in earlier-line settings for lung cancer. Another new cancer drug in AstraZeneca's portfolio is Calquence (acalabrutinib), which is approved for previously treated mantle cell lymphoma. AstraZeneca expects to file regulatory applications for Calquence to get approval for the larger chronic lymphocytic leukemia indication (in frontline and in the relapsed/recurrent disease setting) later this year.",
    "Key oncology candidates in late-stage development include selumetinib (pediatric neurofibromatosis type 1) and savolitinib (non-small-cell lung carcinoma [NSCLC]). In April 2019, AstraZeneca acquired joint development and commercialization rights to an innovative antibody drug conjugate, trastuzumab deruxtecan from Japan's Daiichi Sankyo. A regulatory application seeking approval for trastuzumab deruxtecan in metastatic breast cancer is expected to be filed with the FDA in the second half of 2019.",
    " Pfizer PFE ",
    "Pfizer gained FDA approval for four innovative cancer medicines in the last four months of 2018, which is likely to boost its oncology sales. These include Daurismo (glasdegib) for previously untreated AML, Lorbrena (lorlatinib) for second line non-small-cell lung cancer, Vizimpro (dacomitinib) for advanced NSCLC with EGFR activating mutations and Talzenna (talazoparib), an orally-available PARP inhibitor for advanced breast cancer.",
    "Two leukemia treatments - Besponsa for relapsed/refractory acute lymphoblastic leukemia and Mylotarg for newly diagnosed CD33-positive acute myeloid leukemia were approved in the United States in the third quarter of 2017.",
    "Meanwhile, Pfizer is also working on expanding the label of its key breast cancer drug Ibrance and prostate cancer drug, Xtandi.",
    "Pfizer's newest immunotherapy, Bavencio, though approved for two small indications currently, is being considered a significant future top-line driver for this New York-based pharma giant if it can gain label expansion approvals. Pfizer has 30 ongoing studies in the avelumab development program involving more than 9,000 patients across 15 tumor types.",
    "Importantly, Pfizer is gradually venturing into the oncology biosimilars space. Pfizer's biosimilar versions of Roche's cancer drugs Herceptin, Avastin and Rituxan were approved by the FDA in 2019. Biosimilar versions of Herceptin and Avastin are already approved in the EU while that of Rituxan is under review in the EU.",
    "Finally, the July acquisition of Array BioPharma for $11.4 billion has strengthened its cancer portfolio. Array launched its only commercial medicine, Braftovi plus Mektovi, as a treatment for BRAF-mutant melanoma, last year. The combination medicine is also being evaluated in label expansion studies for other cancer types including metastatic colorectal cancer with BRAF mutation.",
    " Merck ",
    "Merck's oncology portfolio/pipeline, though revolving around just its revolutionary anti-PD-1 therapy, Keytruda, can be said to be one of the strongest in the industry.",
    "Keytruda is already approved for use in 20 cancer indications across 12 different tumor types in the United States. Keytruda is continuously growing and expanding into new indications and markets globally. Keytruda sales are gaining particularly from strong momentum in the indication of first-line lung cancer. In fact, the Keytruda development program is also progressing well and the drug is being studied for more than 30 types of cancer in more than 1000 studies, including more than 600 combination studies. Undoubtedly, Keytruda has strong future growth prospects based on increased utilization, approval for new indications and expectation of additional approvals worldwide.",
    "Meanwhile, Merck has profit sharing deals with AstraZeneca for Lynparza/selumetinib and Japan's Eisai for Lenvima for several types of cancer.",
    " Bristol-Myers BMY ",
    "Bristol-Myers PD-1 inhibitor, Opdivo, has been performing impressively. The company is working on expanding the label of Opdivo further, alone or in combination therapies with Yervoy and other anti-cancer agents.",
    "Further, Bristol-Myers' cancer portfolio includes multiple myeloma drug, Empliciti and leukemia drug, Sprycel, which contribute significantly to the top line. In addition, Bristol-Myers is evaluating other immune system pathways for the treatment of cancer. These pathways may help the company bring to market potentially transformational immunotherapies - in combination or as monotherapy - to help fight different types of cancers.",
    "Most importantly its pending acquisition of Celgene for approximately $74 billion should boost its oncology franchise by adding blockbuster drugs like Revlimid and Pomalyst and several pipeline candidates across solid tumors and hematologic malignancies.",
    "While Merck and Bristol-Myers currently carry a Zacks Rank #2 (Buy), AstraZeneca has a Zacks Rank #3 (Hold). Pfizer holds a Zacks Rank of 4 (Sell).",
    "You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  . ",
    " Others Not Far Behind ",
    "AbbVie's ABBV  key cancer drug and also what it calls a \"pipeline in a molecule\", Imbruvica, is currently approved for quite a few indications across different cancer types. Imbruvica has multi-billion dollar potential. Several studies on Imbruvica are ongoing to evaluate the drug alone or in combination in different patient segments. AbbVie is also studying another key cancer drug, Venclyxto/Venclexta to expand the label to address the broader relapsed/refractory chronic lymphocytic leukemia patient population, expand into earlier lines of therapy, and broaden into other hematologic malignancies like multiple myeloma and acute myeloid leukemia.",
    "Roche RHHBY  dominates the breast cancer space. There is strong demand for its HER2 franchise drugs like Herceptin, Perjeta and Kadcyla. Apart from its strong breast cancer franchise, Roche's oncology portfolio also boasts lung cancer drugs like Avastin, Tecentriq and Tarceva and hematology medicines like MabThera/Rituxan, Gazyva, and Venclexta.  Newly approved cancer medicines are Polivy Alcensa and Rozlytrek. Label expansion efforts are ongoing for almost all these cancer drugs.",
    "Swiss drugmaker Novartis' NVS  oncology portfolio was significantly boosted by the approval of breast cancer drug, Kisqali and CAR-T cell therapy Kymriah in 2017. Novartis also boasts many experimental cancer drugs in its R&D pipeline including a couple of biosimilar versions of popular cancer drugs.",
    " Conclusion ",
    "Competition in the cancer market is fierce and not all pipeline candidates will be successful. However, pharma biggies have enough late-stage cancer programs in their portfolios and there are chances of quite a few rollouts in the coming years.",
    "  Large Cap Pharmaceuticals Industry 5YR %     Return        Large Cap Pharmaceuticals Industry 5YR %     Return  ",
    " Large Cap Pharmaceuticals Industry 5YR %     Return ",
    " Large Cap Pharmaceuticals Industry 5YR %     Return ",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.  makeArticleAd();  Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:32:00"
}