{
  "url": "https://www.nasdaq.com/article/why-michaels-shares-jumped-14-today-cm1208207",
  "title": "Why Michaels Shares Jumped 14% Today - Nasdaq.com",
  "text": [
    "Shares of The Michaels Companies (NASDAQ: MIK) rose as much as 14.5% on Thursday morning, driven by the Trump administration planning to meet with Chinese leaders for a new round of trade talks. By noon EDT, the arts and crafts retailer's stock had settled down to a 13.7% gain.",
    "Michaels' shares spiked as much as 27% higher on Wednesday thanks to a strong earnings report then lost most of that sizzle when the company's management used the earnings call to state that the upcoming batch of tariff increases in December would prove costly. If executed according to current plans, the so-called List 4 of tariffs on imports from China could add as much as $500 million to Michaels' cost of goods sold in 2020. That would be enough to swing from positive to negative earnings. Investors were spooked by this detailed revelation and took most of Wednesday's early gains off the table in a hurry .",
    "Today, the Trump administration is preparing to sit down with Chinese officials for another round of trade deal negotiations. The session is slated for early October, with the potential to block those harmful December tariffs from taking effect.",
    "Image source: Getty Images.",
    "Government spokespeople are looking for \"meaningful progress\" in October's trade talks, and Michaels investors would welcome a tariff-free future with open arms. Mitigating actions such as finding alternative suppliers outside China or negotiating lower prices from Chinese vendors can only do so much to stem the tide of rising costs, after all.",
    "So it makes sense to see the stock recovering some of the gains that were lost to trade tensions on Wednesday, even if there are no guarantees that the two governments will reach a tariff-free deal in October. Baby steps can make a significant difference, too.",
    "10 stocks we like better than The Michaels Companies\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and The Michaels Companies wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Anders Bylund has no position in any of the stocks mentioned. The Motley Fool recommends The Michaels Companies. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 12:43:00"
}