{
  "url": "https://www.nasdaq.com/article/is-energy-transfer-lp-et-stock-undervalued-right-now-cm1210350",
  "title": "Is Energy Transfer LP (ET) Stock Undervalued Right Now? - Nasdaq.com",
  "text": [
    " The proven Zacks Rank system focuses on earnings estimates and estimate revisions to find winning stocks. Nevertheless, we know that our readers all have their own perspectives, so we are always looking at the latest trends in value, growth, and momentum to find strong picks. Considering these trends, value investing is clearly one of the most preferred ways to find strong stocks in any type of market. Value investors use fundamental analysis and traditional valuation metrics to find stocks that they believe are being undervalued by the market at large. In addition to the Zacks Rank, investors looking for stocks with specific traits can utilize our Style Scores system. Of course, value investors will be most interested in the system's \"Value\" category. Stocks with \"A\" grades for Value and high Zacks Ranks are among the best value stocks available at any given moment. One company value investors might notice is Energy Transfer LP (ET). ET is currently sporting a Zacks Rank of #2 (Buy) and an A for Value. The stock holds a P/E ratio of 9.69, while its industry has an average P/E of 11.93. Over the last 12 months, ET's Forward P/E has been as high as 12.49 and as low as 7.47, with a median of 10.50. Another notable valuation metric for ET is its P/B ratio of 1.14. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. This company's current P/B looks solid when compared to its industry's average P/B of 1.83. ET's P/B has been as high as 1.33 and as low as 0.44, with a median of 1.19, over the past year. Value investors also use the P/S ratio. The P/S ratio is is calculated as price divided by sales. This is a popular metric because sales are harder to manipulate on an income statement, so they are often considered a better performance indicator. ET has a P/S ratio of 0.66. This compares to its industry's average P/S of 1.57. Finally, investors should note that ET has a P/CF ratio of 5.91. This metric takes into account a company's operating cash flow and can be used to find stocks that are undervalued based on their solid cash outlook. ET's current P/CF looks attractive when compared to its industry's average P/CF of 7.87. Within the past 12 months, ET's P/CF has been as high as 7.41 and as low as 2.64, with a median of 6.35. Value investors will likely look at more than just these metrics, but the above data helps show that Energy Transfer LP is likely undervalued currently. And when considering the strength of its earnings outlook, ET sticks out at as one of the market's strongest value stocks.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Energy Transfer LP (ET): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "The proven Zacks Rank system focuses on earnings estimates and estimate revisions to find winning stocks. Nevertheless, we know that our readers all have their own perspectives, so we are always looking at the latest trends in value, growth, and momentum to find strong picks.",
    "Considering these trends, value investing is clearly one of the most preferred ways to find strong stocks in any type of market. Value investors use fundamental analysis and traditional valuation metrics to find stocks that they believe are being undervalued by the market at large.",
    "In addition to the Zacks Rank, investors looking for stocks with specific traits can utilize our Style Scores system. Of course, value investors will be most interested in the system's \"Value\" category. Stocks with \"A\" grades for Value and high Zacks Ranks are among the best value stocks available at any given moment.",
    "One company value investors might notice is Energy Transfer LP (ET). ET is currently sporting a Zacks Rank of #2 (Buy) and an A for Value. The stock holds a P/E ratio of 9.69, while its industry has an average P/E of 11.93. Over the last 12 months, ET's Forward P/E has been as high as 12.49 and as low as 7.47, with a median of 10.50.",
    "Another notable valuation metric for ET is its P/B ratio of 1.14. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. This company's current P/B looks solid when compared to its industry's average P/B of 1.83. ET's P/B has been as high as 1.33 and as low as 0.44, with a median of 1.19, over the past year.",
    "Value investors also use the P/S ratio. The P/S ratio is is calculated as price divided by sales. This is a popular metric because sales are harder to manipulate on an income statement, so they are often considered a better performance indicator. ET has a P/S ratio of 0.66. This compares to its industry's average P/S of 1.57.",
    "Finally, investors should note that ET has a P/CF ratio of 5.91. This metric takes into account a company's operating cash flow and can be used to find stocks that are undervalued based on their solid cash outlook. ET's current P/CF looks attractive when compared to its industry's average P/CF of 7.87. Within the past 12 months, ET's P/CF has been as high as 7.41 and as low as 2.64, with a median of 6.35.",
    "Value investors will likely look at more than just these metrics, but the above data helps show that Energy Transfer LP is likely undervalued currently. And when considering the strength of its earnings outlook, ET sticks out at as one of the market's strongest value stocks.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:10:22"
}