{
  "url": "https://www.nasdaq.com/article/why-coty-stock-lost-13-in-august-cm1207090",
  "title": "Why Coty Stock Lost 13% in August - Nasdaq.com",
  "text": [
    " What happened  Coty    (NYSE: COTY) investors trailed the market last month as the stock   lost 13% compared to a 2% decrease in the   S&P 500    , according to data provided by      S&P Global Market Intelligence    . The reduction wasn't enough to knock Coty from its wider   growth pace, though, as shares remain higher by almost 40% so far   in 2019.   Image source: Getty Images.makeArticleAd();  So what August's drop came as investors adjusted their expectations   for the   consumer products    giant. Later in the month, Coty announced a 4% decline in organic   sales for the fiscal fourth quarter as net losses jumped due to   massive one-time impairment writedowns. Now what With its biggest divestment and restructuring moves behind it,   Coty is now looking toward a rebound plan that foresees a return   to revenue growth, strong profitability, and reduced leverage by   fiscal 2023. The fiscal 2020 year, which just began, represents   just the first steps in that direction as Coty works to respond   to shifting demand for makeup and other key consumer beauty   niches. The stock's increase so far in 2019 reflects optimism in   that recovery strategy, but now it is up to CEO Pierre Laubies   and his team to deliver on their bright projections.   10 stocks we like better than Coty (Class A)       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Coty (Class A) wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Demitrios Kalogeropoulos      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    " Coty    (NYSE: COTY) investors trailed the market last month as the stock   lost 13% compared to a 2% decrease in the   S&P 500    , according to data provided by      S&P Global Market Intelligence    .",
    "The reduction wasn't enough to knock Coty from its wider   growth pace, though, as shares remain higher by almost 40% so far   in 2019.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "August's drop came as investors adjusted their expectations   for the   consumer products    giant. Later in the month, Coty announced a 4% decline in organic   sales for the fiscal fourth quarter as net losses jumped due to   massive one-time impairment writedowns.",
    "With its biggest divestment and restructuring moves behind it,   Coty is now looking toward a rebound plan that foresees a return   to revenue growth, strong profitability, and reduced leverage by   fiscal 2023. The fiscal 2020 year, which just began, represents   just the first steps in that direction as Coty works to respond   to shifting demand for makeup and other key consumer beauty   niches. The stock's increase so far in 2019 reflects optimism in   that recovery strategy, but now it is up to CEO Pierre Laubies   and his team to deliver on their bright projections.",
    "  10 stocks we like better than Coty (Class A)       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Coty (Class A) wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Coty (Class A)       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Coty (Class A) wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Demitrios Kalogeropoulos      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:11:00"
}