{
  "url": "https://www.nasdaq.com/article/americans-are-clueless-about-social-securitys-filing-rules-data-shows-cm1207284",
  "title": "Americans Are Clueless About Social Security's Filing Rules, Data Shows - Nasdaq.com",
  "text": [
    " Millions of seniors rely on   Social Security    to cover their living costs, and today's workers will likely join   their ranks once they retire. But a big part of maximizing those   benefits is knowing when to file for them. Unfortunately, Americans are lacking some serious knowledge in   this regard. In a recent   GOBankingRates survey    , respondents across a wide range of ages were asked whether   seniors can start collecting Social Security as early as age 60   and as late as age 72. Around 39% of respondents said yes, that's   correct, while 37% said they had no idea. Only 24% knew that that   time frame was off by two years on each side of the filing   equation. If you're not aware of Social Security's filing rules, it's   imperative that you get schooled on that information. Otherwise,   you'll throw off your retirement planning and risk missing out on   income that could otherwise be yours.makeArticleAd();   Image source: Getty Images.  Filing for benefits: How it works Your Social Security benefits are calculated by applying a   formula to an inflation-adjusted average of your 35 highest years   of income. Once your monthly benefit amount is established,   you're entitled to it upon reaching   full retirement age    . That age is dependent on your year of birth, but it's somewhere   between 66 and 67. Meanwhile, you're allowed to file for Social Security   beginning at   age 62    -- but not at age 60. The only exception is if you're claiming   survivors benefits    based on what your deceased spouse collected. But you can't claim   your own benefits until age 62. That said, for each month you claim benefits ahead of full   retirement age, you'll reduce them by a certain percentage. The   maximum reduction you'll face by filing at age 62 is 25% if your   full retirement age is 66, and 30% if that age is 67. And   whatever hit you take on your benefits will remain in effect for   the rest of your life unless you manage to withdraw your Social   Security application within a year and also repay every dollar   you collected. Of course, if you file at a later age than 62, you'll face a   lower reduction. For example, if you choose to file at 65 and   your full retirement age is 66, you'll lose just 6.67% of your   benefits. If you file at 65 when you full retirement age is 67,   you'll lose 13.34%. On the flip side, you're allowed to delay benefits past full   retirement age. For each year you do, you'll   accrue credits    that boost your benefits by 8%. This incentive, however, is only   applicable until you turn 70. This means that if your full   retirement age is 67, the maximum increase you can snag is   24%. Furthermore, while the Social Security Administration won't   force you to take benefits at 70, there's no financial incentive   to wait past that point. In fact, if you wait until age 72 -- the   age referenced in the aforementioned survey -- you'll lose out on   18 months' worth of Social Security income. That's because the   agency will pay you up to six months' worth of retroactive   benefits, but not more. Know the rules Filing for Social Security at the right time can help ensure   that you make the most of those benefits in retirement. That's   why it's important to understand   how the program works    . If you're pretty much in the dark about Social Security, take   some time to learn more about it so that you can make the best   decisions for your golden years.   The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .   The Motley Fool has a     disclosure policy      .  ",
    "Millions of seniors rely on   Social Security    to cover their living costs, and today's workers will likely join   their ranks once they retire. But a big part of maximizing those   benefits is knowing when to file for them.",
    "Unfortunately, Americans are lacking some serious knowledge in   this regard. In a recent   GOBankingRates survey    , respondents across a wide range of ages were asked whether   seniors can start collecting Social Security as early as age 60   and as late as age 72. Around 39% of respondents said yes, that's   correct, while 37% said they had no idea. Only 24% knew that that   time frame was off by two years on each side of the filing   equation.",
    "If you're not aware of Social Security's filing rules, it's   imperative that you get schooled on that information. Otherwise,   you'll throw off your retirement planning and risk missing out on   income that could otherwise be yours.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Your Social Security benefits are calculated by applying a   formula to an inflation-adjusted average of your 35 highest years   of income. Once your monthly benefit amount is established,   you're entitled to it upon reaching   full retirement age    . That age is dependent on your year of birth, but it's somewhere   between 66 and 67.",
    "Meanwhile, you're allowed to file for Social Security   beginning at   age 62    -- but not at age 60. The only exception is if you're claiming   survivors benefits    based on what your deceased spouse collected. But you can't claim   your own benefits until age 62.",
    "That said, for each month you claim benefits ahead of full   retirement age, you'll reduce them by a certain percentage. The   maximum reduction you'll face by filing at age 62 is 25% if your   full retirement age is 66, and 30% if that age is 67. And   whatever hit you take on your benefits will remain in effect for   the rest of your life unless you manage to withdraw your Social   Security application within a year and also repay every dollar   you collected.",
    "Of course, if you file at a later age than 62, you'll face a   lower reduction. For example, if you choose to file at 65 and   your full retirement age is 66, you'll lose just 6.67% of your   benefits. If you file at 65 when you full retirement age is 67,   you'll lose 13.34%.",
    "On the flip side, you're allowed to delay benefits past full   retirement age. For each year you do, you'll   accrue credits    that boost your benefits by 8%. This incentive, however, is only   applicable until you turn 70. This means that if your full   retirement age is 67, the maximum increase you can snag is   24%.",
    "Furthermore, while the Social Security Administration won't   force you to take benefits at 70, there's no financial incentive   to wait past that point. In fact, if you wait until age 72 -- the   age referenced in the aforementioned survey -- you'll lose out on   18 months' worth of Social Security income. That's because the   agency will pay you up to six months' worth of retroactive   benefits, but not more.",
    "Filing for Social Security at the right time can help ensure   that you make the most of those benefits in retirement. That's   why it's important to understand   how the program works    . If you're pretty much in the dark about Social Security, take   some time to learn more about it so that you can make the best   decisions for your golden years.",
    "  The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      . ",
    " The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .",
    " The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:21:02"
}