{
  "url": "https://www.nasdaq.com/article/why-is-fidelity-national-fis-up-24-since-last-earnings-report-cm1208044",
  "title": "Why Is Fidelity National (FIS) Up 2.4% Since Last Earnings Report? - Nasdaq.com",
  "text": [
    " It has been about a month since the las t earnings  report for Fidelity National Information Services (FIS). Shares have added about 2.4% in that time frame, outperforming the S&P 500. Will the recent positive trend continue leading up to its next earnings release, or is Fidelity National due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important catalysts.  Fidelity National Q2 Earnings Match Estimates, Costs   Down  Fidelity's second-quarter 2019 adjusted earnings per share from continuing operations came in at $1.78, in line with the Zacks Consensus Estimate. Notably, the bottom line compares favorably with the year-ago figure of $1.23. Organic revenue growth, lower expenses and expanding margin were the key tailwinds. However, huge outstanding debt posed a headwind. Also, poor performance of Global Financial Solutions segment was a key concern.   On a GAAP basis, the company reported net earnings attributable to common stockholders of $154 million or 47 cents in the quarter compared with $212 million or 64 cents in the prior-year period.  Organic Revenues Increase, Expenses Down  GAAP revenues for the quarter came in at $2.11 billion, up slightly year over year. The figure was in line with the consensus estimate. Organic revenues went up nearly 5% in the quarter. Selling, general and administrative expenses came in at $317 million, down 6.5% year over year. Segment wise, GAAP revenues from Integrated Financial Solutions grew 5% to $1.18 billion, while the same from Global Financial Solutions declined 4% year over year to $865 million. Corporate/Other revenues slipped 18% from the prior-year quarter to $68 million. Adjusted earnings before interest, tax, depreciation and amortization (EBITDA) increased nearly 5% year over year to $794 million, while adjusted EBITDA margin expanded 170 basis points (bps) to 37.6%.  Balance Sheet & Cash Flow  As of Jun 30, 2019, cash and cash equivalents were $9.8 billion compared with $703 million on Dec 31, 2018. Debt outstanding was nearly $18.2 billion. Cash and cash equivalents, and debt were mainly driven by the U.S. and European-based debt financing related to the Worldpay transaction. In the second quarter, net cash provided by operations was $526 million and free cash flow was $413 million. Fidelity paid dividends worth $113 million in the reported quarter.  Combined (FIS and Worldpay as a combined entity)   Guidance   Third-Quarter 2019  Fidelity expects both non-GAAP and GAAP revenues between $2,775 million and $2,800 million. Adjusted earnings per share (Prior Method), excluding amortization of purchase accounting intangibles only, are expected in the band of $1.33-$1.37. Further, adjusted earnings per share (New Method), excluding all depreciation and amortization, are projected within $1.69-$1.72. Adjusted EBITDA is anticipated in the range of $1,145-$1,160 million. The company expects to incur net interest expense within $101-103 million. GAAP net earnings are likely to be within $75-$300 million, while earnings per share are estimated in the band of $0.14-$0.57. Effective tax rate is expected to be about 15%.  Fourth-Quarter 2019  Fidelity expects both non-GAAP and GAAP revenues between $3,285 million and $3,330 million. Adjusted earnings per share (Prior Method), excluding amortization of purchase accounting intangibles only, are expected in the band of $1.47-$1.53. Furthermore, adjusted earnings per share (New Method) - excluding all depreciation and amortization - are predicted in the $1.80-$1.84 range. Adjusted EBITDA is expected in the range of $1,470-$1,500 million. makeArticleAd();  Management anticipates to incur net interest expense within $113-115 million. GAAP net earnings are likely to be within $300-$510 million, while earnings per share are projected in the $0.48-$0.82 band. Effective tax rate is expected to be about 17%.  Mid-Term Outlook  The company expects to begin realizing revenue synergies from the WorldPay acquisition in the coming months, in turn accelerating organic revenue growth trends from approximately 6% on a pro-forma annualized basis in 2019 to 7% in 2020 and even higher in the future.   How Have Estimates Been Moving Since Then?  In the past month, investors have witnessed a downward trend in estimates review. The consensus estimate has shifted -27.26% due to these changes.  VGM Scores  Currently, Fidelity National has a nice Growth Score of B, though it is lagging a lot on the Momentum Score front with an F. Charting a somewhat similar path, the stock was allocated a grade of D on the value side, putting it in the bottom 40% for this investment strategy. Overall, the stock has an aggregate VGM Score of C. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Fidelity National has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Fidelity National Information Services, Inc. (FIS): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "It has been about a month since the las t earnings  report for Fidelity National Information Services (FIS). Shares have added about 2.4% in that time frame, outperforming the S&P 500.",
    "Will the recent positive trend continue leading up to its next earnings release, or is Fidelity National due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important catalysts.  Fidelity National Q2 Earnings Match Estimates, Costs   Down  Fidelity's second-quarter 2019 adjusted earnings per share from continuing operations came in at $1.78, in line with the Zacks Consensus Estimate. Notably, the bottom line compares favorably with the year-ago figure of $1.23. Organic revenue growth, lower expenses and expanding margin were the key tailwinds. However, huge outstanding debt posed a headwind. Also, poor performance of Global Financial Solutions segment was a key concern.   On a GAAP basis, the company reported net earnings attributable to common stockholders of $154 million or 47 cents in the quarter compared with $212 million or 64 cents in the prior-year period.  Organic Revenues Increase, Expenses Down  GAAP revenues for the quarter came in at $2.11 billion, up slightly year over year. The figure was in line with the consensus estimate. Organic revenues went up nearly 5% in the quarter. Selling, general and administrative expenses came in at $317 million, down 6.5% year over year. Segment wise, GAAP revenues from Integrated Financial Solutions grew 5% to $1.18 billion, while the same from Global Financial Solutions declined 4% year over year to $865 million. Corporate/Other revenues slipped 18% from the prior-year quarter to $68 million. Adjusted earnings before interest, tax, depreciation and amortization (EBITDA) increased nearly 5% year over year to $794 million, while adjusted EBITDA margin expanded 170 basis points (bps) to 37.6%.  Balance Sheet & Cash Flow  As of Jun 30, 2019, cash and cash equivalents were $9.8 billion compared with $703 million on Dec 31, 2018. Debt outstanding was nearly $18.2 billion. Cash and cash equivalents, and debt were mainly driven by the U.S. and European-based debt financing related to the Worldpay transaction. In the second quarter, net cash provided by operations was $526 million and free cash flow was $413 million. Fidelity paid dividends worth $113 million in the reported quarter.  Combined (FIS and Worldpay as a combined entity)   Guidance   Third-Quarter 2019  Fidelity expects both non-GAAP and GAAP revenues between $2,775 million and $2,800 million. Adjusted earnings per share (Prior Method), excluding amortization of purchase accounting intangibles only, are expected in the band of $1.33-$1.37. Further, adjusted earnings per share (New Method), excluding all depreciation and amortization, are projected within $1.69-$1.72. Adjusted EBITDA is anticipated in the range of $1,145-$1,160 million. The company expects to incur net interest expense within $101-103 million. GAAP net earnings are likely to be within $75-$300 million, while earnings per share are estimated in the band of $0.14-$0.57. Effective tax rate is expected to be about 15%.  Fourth-Quarter 2019  Fidelity expects both non-GAAP and GAAP revenues between $3,285 million and $3,330 million. Adjusted earnings per share (Prior Method), excluding amortization of purchase accounting intangibles only, are expected in the band of $1.47-$1.53. Furthermore, adjusted earnings per share (New Method) - excluding all depreciation and amortization - are predicted in the $1.80-$1.84 range. Adjusted EBITDA is expected in the range of $1,470-$1,500 million. makeArticleAd();  Management anticipates to incur net interest expense within $113-115 million. GAAP net earnings are likely to be within $300-$510 million, while earnings per share are projected in the $0.48-$0.82 band. Effective tax rate is expected to be about 17%.  Mid-Term Outlook  The company expects to begin realizing revenue synergies from the WorldPay acquisition in the coming months, in turn accelerating organic revenue growth trends from approximately 6% on a pro-forma annualized basis in 2019 to 7% in 2020 and even higher in the future. ",
    " Fidelity National Q2 Earnings Match Estimates, Costs   Down ",
    "Fidelity's second-quarter 2019 adjusted earnings per share from continuing operations came in at $1.78, in line with the Zacks Consensus Estimate. Notably, the bottom line compares favorably with the year-ago figure of $1.23.",
    "Organic revenue growth, lower expenses and expanding margin were the key tailwinds. However, huge outstanding debt posed a headwind. Also, poor performance of Global Financial Solutions segment was a key concern.   On a GAAP basis, the company reported net earnings attributable to common stockholders of $154 million or 47 cents in the quarter compared with $212 million or 64 cents in the prior-year period.",
    " Organic Revenues Increase, Expenses Down ",
    "GAAP revenues for the quarter came in at $2.11 billion, up slightly year over year. The figure was in line with the consensus estimate.",
    "Organic revenues went up nearly 5% in the quarter.",
    "Selling, general and administrative expenses came in at $317 million, down 6.5% year over year.",
    "Segment wise, GAAP revenues from Integrated Financial Solutions grew 5% to $1.18 billion, while the same from Global Financial Solutions declined 4% year over year to $865 million. Corporate/Other revenues slipped 18% from the prior-year quarter to $68 million.",
    "Adjusted earnings before interest, tax, depreciation and amortization (EBITDA) increased nearly 5% year over year to $794 million, while adjusted EBITDA margin expanded 170 basis points (bps) to 37.6%.",
    " Balance Sheet & Cash Flow ",
    "As of Jun 30, 2019, cash and cash equivalents were $9.8 billion compared with $703 million on Dec 31, 2018. Debt outstanding was nearly $18.2 billion. Cash and cash equivalents, and debt were mainly driven by the U.S. and European-based debt financing related to the Worldpay transaction.",
    "In the second quarter, net cash provided by operations was $526 million and free cash flow was $413 million.",
    "Fidelity paid dividends worth $113 million in the reported quarter.",
    " Combined (FIS and Worldpay as a combined entity)   Guidance ",
    " Third-Quarter 2019 ",
    "Fidelity expects both non-GAAP and GAAP revenues between $2,775 million and $2,800 million.",
    "Adjusted earnings per share (Prior Method), excluding amortization of purchase accounting intangibles only, are expected in the band of $1.33-$1.37. Further, adjusted earnings per share (New Method), excluding all depreciation and amortization, are projected within $1.69-$1.72.",
    "Adjusted EBITDA is anticipated in the range of $1,145-$1,160 million.",
    "The company expects to incur net interest expense within $101-103 million.",
    "GAAP net earnings are likely to be within $75-$300 million, while earnings per share are estimated in the band of $0.14-$0.57.",
    "Effective tax rate is expected to be about 15%.",
    " Fourth-Quarter 2019 ",
    "Fidelity expects both non-GAAP and GAAP revenues between $3,285 million and $3,330 million.",
    "Adjusted earnings per share (Prior Method), excluding amortization of purchase accounting intangibles only, are expected in the band of $1.47-$1.53. Furthermore, adjusted earnings per share (New Method) - excluding all depreciation and amortization - are predicted in the $1.80-$1.84 range.",
    "Adjusted EBITDA is expected in the range of $1,470-$1,500 million. makeArticleAd();  Management anticipates to incur net interest expense within $113-115 million.",
    "GAAP net earnings are likely to be within $300-$510 million, while earnings per share are projected in the $0.48-$0.82 band.",
    "Effective tax rate is expected to be about 17%.",
    " Mid-Term Outlook ",
    "The company expects to begin realizing revenue synergies from the WorldPay acquisition in the coming months, in turn accelerating organic revenue growth trends from approximately 6% on a pro-forma annualized basis in 2019 to 7% in 2020 and even higher in the future.",
    " How Have Estimates Been Moving Since Then? ",
    "In the past month, investors have witnessed a downward trend in estimates review. The consensus estimate has shifted -27.26% due to these changes.",
    " VGM Scores ",
    "Currently, Fidelity National has a nice Growth Score of B, though it is lagging a lot on the Momentum Score front with an F. Charting a somewhat similar path, the stock was allocated a grade of D on the value side, putting it in the bottom 40% for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of C. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Fidelity National has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:31:26"
}