{
  "url": "https://www.nasdaq.com/article/ireland-to-base-budget-on-assumption-of-no-deal-brexit-20190911-00517",
  "title": "Ireland to base budget on assumption of no deal Brexit - Nasdaq.com",
  "text": [
    "By Padraic Halpin and Conor Humphries",
    "DUBLIN, Sept 11 (Reuters) - Ireland will base next month's budget for 2020 on the assumption of a no-deal Brexit, setting aside funds for vulnerable sectors and allowing the state's finances to return to deficit, Finance Minister Paschal Donohoe said on Wednesday.",
    "Ireland presented two budget strategies for 2020 in June, a preferred option that would have seen its budget surplus grow if its neighbour leaves the EU in an orderly way, and a no-deal scenario forecasting a deficit to absorb the shock of such an outcome. ",
    "\"Given the uncertainty and lack of clarity regarding the timing and format that the UK's exit will take, preparing for a no-deal scenario is the most sensible approach,\" Donohoe told a news conference.",
    "\"This is therefore a budget that will be a safe budget, a careful budget. It will focus on ensuring that we have the resources we need at a time of change, to help our country get ready for a shock that may occur at the end of October or in a number of other scenarios across 2020.\"",
    "The shape of the budgetary package would have been broadly similar in either scenario at 2.8 billion euros -- 2.1 billion of which has already been pre-committed in areas including planned infrastructure spending and increased public sector pay.",
    "But instead of using the rest to fund increases in current spending and tax cuts, as in recent budgets, most of it will instead be targeted at the sectors most affected by potential severe disruption to trade between Ireland and Britain.",
    "With the economy forecast to flatline next year if Britain crashes out, rather than grow by 3.3% in an orderly withdrawal, Donohoe said in June that he would allow the public finances to run a deficit of between 0.5 and 1.5% of GDP in a no-deal.",
    "It would take three to four years for the exchequer to return to surplus, his department's forecasts showed, increasing borrowing at a time when it warned the national debt is still too high at around 100% of gross national income.",
    "That would mark a swift setback after Ireland posted its first budget surplus for a decade last year.",
    "The head of Ireland's independent fiscal watchdog said on Wednesday that planning on the basis of a no-deal Brexit was the most appropriate course. Others have said the cautious stance was wise regardless of the Brexit outcome, given the separate risk of Ireland's economy overheating.",
    "\"Even if a deal were to be agreed in the coming weeks, which we find unlikely, a prudent fiscal stance would be appropriate in the context of full capacity in the Irish economy,\" Goodbody Stockbrokers chief economist Dermot O'Leary said in a note.",
    "\"In this respect, Brexit may give some cover to bat away calls for additional spending.\""
  ],
  "published_datetime": "2019-09-11 09:47:00"
}