{
  "url": "https://www.nasdaq.com/article/thousands-of-yemenis-rally-in-aden-in-support-of-the-uae-20190905-00840",
  "title": "Thousands of Yemenis rally in Aden in support of the UAE - Nasdaq.com",
  "text": [
    "By Mohammed Mukhashaf",
    "ADEN, Sept 5 (Reuters) - Thousands of Yemenis marched in Aden on Thursday in support of the United Arab Emirates, which assists separatists who seized the southern city from the Saudi-backed government in a power struggle that has opened a new front in Yemen's war.",
    "The rally took place as Saudi Arabia, leader of an Arab coalition battling Yemen'sIran-aligned Houthis, hosts indirect talks between the two sides to end a standoff that has strained Riyadh's alliance with its main regional partner the UAE.",
    "But the separatists seek self-rule in the south and turned on the government in early August and captured Aden, its interim base. Southern fighters have clashed with government forces elsewhere in the south as they tried to extend their reach.",
    "March organisers said they wanted to show loyalty to the UAE, the second power in the coalition, which openly intervened to support the separatists by launching air strikes on government forces last week when they tried to recapture Aden, forcing them to withdraw.",
    "Men, women and children gathered in Aden's main al-Maalla street, waved Emirati flags and colours of the former South Yemen republic, which the separatist Southern Transitional Council (STC) aspires to revive.",
    "\"This is the least we can do for the UAE which has given everything to the people of South Yemen,\" said Hashem al-Morshidi, one of the demonstrators.",
    "Others carried banners expressing loyalty to the UAE or portraits of Abu Dhabi's leaders as large speakers blared Emirati music.",
    "Hadi's government has publicly asked the UAE to stop supporting separatist forces. Abu Dhabi has responded by criticising his government as weak and ineffective.",
    "INDIRECT TALKS",
    "The fight for Yemen's south threatens to further fragment the Arabian Peninsula nation and hamper United Nations efforts to end the conflict that has killed tens of thousands and pushed millions towards famine.",
    "Saudi Arabia has called for a summit to resolve the crisis to refocus the coalition on battling the Houthis, who hold Sanaa and most major urban centres. It has held indirect talks between STC leaders and Yemeni government officials for that purpose in the Red Sea port city of Jeddah this week. ",
    "\"I encourage the government and the STC to seize this opportunity and settle their differences through peaceful means,\" U.N. special envoy Martin Griffiths tweeted on Thursday.",
    "Hadi's government has said it would not participate in a summit unless the STC hands back Aden.",
    "\"We will not sit with the so-called STC at the table,\" Interior Minister Ahmed al-Mayssari said in an audio recording shared by government officials on Wednesday.",
    "\"If there must be dialogue it should be with the UAE ... it is the main party behind this conflict between us and the STC is only a political tool in their hands.\"",
    "The UAE in June scaled down its military presence in Yemen but maintains influence via tens of thousands of southern separatist fighters it has armed and trained.",
    "Abu Dhabi, which has called for a political solution to the standoff, said on Wednesday it was confident the Jeddah meeting would succeed. Yemeni sources have said that a summit could reshuffle Hadi's government to include the STC."
  ],
  "published_datetime": "2019-09-05 12:27:00"
}