{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-google-facebook-apple-amazon-and-microsoft-cm1210357",
  "title": "The Zacks Analyst Blog Highlights: Google, Facebook, Apple, Amazon and Microsoft - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 11, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Google GOOGL  , Facebook FB  , Apple AAPL  , Amazon AMZN  and Microsoft MSFT  .  Here are highlights from Monday's Analyst Blog:    Google Faces Another Antitrust Probe   Fifty state attorneys general are joining an investigation into Alphabet Inc. unit Google over possible antitrust violations. The bipartisan probe includes attorneys general from 48 states, the District of Columbia and Puerto Rico. California and Alabama are not involved in the probe, said Texas AG Ken Paxton at Monday's press conference; Google's dominance in the ad market and use of consumer data was also emphasized. Facebook is under state investigation for similar antitrust practices by the same group of attorneys general as well. Apple and Amazon, in addition to Google and Facebook, are also under federal investigation for potential antitrust violations. Are big technology companies using monopoly power to defend and extend their dominance over the U.S. digital marketplace? That is the big question being asked by state attorneys general as they ramp up their investigation into big tech companies' practices.  The Potential Case Against Google  Federal antitrust laws are broadly written, providing the government with the opportunity to freely apply the laws to the contemporary economic landscape. If a case does end up resulting from the federal or state level investigations, then it will take antitrust enforcement into new uncharted, digital age territory. Courts haven't seen a major monopolization case since the Department of Justice sued Microsoft two decades ago. Florida state attorney general, Ashley Moody, stated, \"Is something really free if we are increasingly giving over our privacy information? Is something really free if online ad prices go up based on one company's control.\" The argument is that Google has used its dominance in online search to solidify its position in online advertising. Google possesses unmatched data on publishers, advertisers, and what consumers search for. Another potential point against Google is that the company maintained its huge market share of online ad sales by excluding competing firms through contractual terms that make it harder for advertisers and publishers to work with other ad businesses that compete with Google. In 2016, Google started requiring that advertisers use its tools to buy ads in YouTube, which holds the largest audience for online videos. In 2017, the European Union concluded that Google biases its own search results in favor of Google offerings and slapped a $2.7 billion fine on the company. A recent study found that less than half of desktop and mobile Google searches result in the user landing on a non-Google website. The EU also imposed a $5 billion fine for Google requiring smartphone manufacturers using the Android operating system to pre-install Google's search app and its Chrome browser.  Moving Forward  Antitrust probes pose a direct threat to companies' business models. If the federal or state probes find evidence of anti-competitive behavior in Google's practices then the company would be compelled to make its algorithms friendlier to rival companies even if it is detrimental to its bottom line. The other companies, if found guilty, would also be forced to reconfigure their business models in ways that can possibly hinder their profitability. Google is now facing possible litigation on the state and federal front, which continue to pose headwinds for the company and shareholders. However, in the short-term, the company has had strong estimate revisions, giving it a Zacks Rank #2 (Buy).  More Stock News: This Is Bigger than the iPhone!  It could become the mother of all technological revolutions. Apple sold a mere 1 billion iPhones in 10 years but a new breakthrough is expected to generate more than 27 billion devices in just 3 years, creating a $1.7 trillion market. Zacks has just released a Special Report that spotlights this fast-emerging phenomenon and 6 tickers for taking advantage of it. If you don't buy now, you may kick yourself in 2020.   Click here for the 6 trades >>   Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Amazon.com, Inc. (AMZN): Free Stock Analysis Report   Facebook, Inc. (FB): Free Stock Analysis Report   Alphabet Inc. (GOOGL): Free Stock Analysis Report   Apple Inc. (AAPL): Free Stock Analysis Report   Microsoft Corporation (MSFT): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 11, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Google GOOGL  , Facebook FB  , Apple AAPL  , Amazon AMZN  and Microsoft MSFT  .",
    " Here are highlights from Monday's Analyst Blog: ",
    "  Google Faces Another Antitrust Probe  ",
    "Fifty state attorneys general are joining an investigation into Alphabet Inc. unit Google over possible antitrust violations. The bipartisan probe includes attorneys general from 48 states, the District of Columbia and Puerto Rico. California and Alabama are not involved in the probe, said Texas AG Ken Paxton at Monday's press conference; Google's dominance in the ad market and use of consumer data was also emphasized. Facebook is under state investigation for similar antitrust practices by the same group of attorneys general as well.",
    "Apple and Amazon, in addition to Google and Facebook, are also under federal investigation for potential antitrust violations. Are big technology companies using monopoly power to defend and extend their dominance over the U.S. digital marketplace? That is the big question being asked by state attorneys general as they ramp up their investigation into big tech companies' practices.",
    " The Potential Case Against Google ",
    "Federal antitrust laws are broadly written, providing the government with the opportunity to freely apply the laws to the contemporary economic landscape. If a case does end up resulting from the federal or state level investigations, then it will take antitrust enforcement into new uncharted, digital age territory. Courts haven't seen a major monopolization case since the Department of Justice sued Microsoft two decades ago.",
    "Florida state attorney general, Ashley Moody, stated, \"Is something really free if we are increasingly giving over our privacy information? Is something really free if online ad prices go up based on one company's control.\" The argument is that Google has used its dominance in online search to solidify its position in online advertising. Google possesses unmatched data on publishers, advertisers, and what consumers search for.",
    "Another potential point against Google is that the company maintained its huge market share of online ad sales by excluding competing firms through contractual terms that make it harder for advertisers and publishers to work with other ad businesses that compete with Google. In 2016, Google started requiring that advertisers use its tools to buy ads in YouTube, which holds the largest audience for online videos.",
    "In 2017, the European Union concluded that Google biases its own search results in favor of Google offerings and slapped a $2.7 billion fine on the company. A recent study found that less than half of desktop and mobile Google searches result in the user landing on a non-Google website. The EU also imposed a $5 billion fine for Google requiring smartphone manufacturers using the Android operating system to pre-install Google's search app and its Chrome browser.",
    " Moving Forward ",
    "Antitrust probes pose a direct threat to companies' business models. If the federal or state probes find evidence of anti-competitive behavior in Google's practices then the company would be compelled to make its algorithms friendlier to rival companies even if it is detrimental to its bottom line. The other companies, if found guilty, would also be forced to reconfigure their business models in ways that can possibly hinder their profitability.",
    "Google is now facing possible litigation on the state and federal front, which continue to pose headwinds for the company and shareholders. However, in the short-term, the company has had strong estimate revisions, giving it a Zacks Rank #2 (Buy).",
    " More Stock News: This Is Bigger than the iPhone! ",
    "It could become the mother of all technological revolutions. Apple sold a mere 1 billion iPhones in 10 years but a new breakthrough is expected to generate more than 27 billion devices in just 3 years, creating a $1.7 trillion market.",
    "Zacks has just released a Special Report that spotlights this fast-emerging phenomenon and 6 tickers for taking advantage of it. If you don't buy now, you may kick yourself in 2020.",
    "  Click here for the 6 trades >>  ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:09:00"
}