{
  "url": "https://www.nasdaq.com/article/dollar-flat-as-poor-us-factory-data-offset-trade-brexit-worries-20190903-01032",
  "title": "Dollar flat as poor U.S. factory data offset trade, Brexit worries - Nasdaq.com",
  "text": [
    "By Richard Leong",
    "NEW YORK, Sept 3 (Reuters) - The dollar was little changed on Tuesday against a basket of currencies, underpinned by safe-haven demand on worries about U.S.-China trade tensions and a chaotic British exit from the European Union.",
    "Initial strength that propelled the dollar to a more than two-year peak fadedfollowing a private report that showed the U.S. manufacturing sector in August recorded its first monthly contraction since 2016. ",
    "The steeper-than-expected decline in the factory activity index of the Institute for Supply Management touched off a rally in the U.S. bond market, sending benchmark 10-year yields  to their lowest levels since July 2016. ",
    "Bloomberg News reported that Chinese and U.S. officials were struggling to agree on a schedule for a round of trade negotiations that had been expected this month.",
    "UK Prime Minister Boris Johnson lost his working majority in Parliament when one of his Conservative lawmakers defected to the pro-European Union Liberal Democrats. ",
    "In late U.S. trading, the dollar index , which tracks the greenback against versus six major currencies, was up 0.05% at 98.964. Earlier, it hit 99.37, its highest level since May 2017.",
    "The euro stabilized after tumbling to a 28-month low against the dollar earlier Tuesday as investors priced in deeper negative interest rates for longer in the euro zone.",
    "Money markets have increased to more than 80% the probability that the European Central Bank will cut its benchmark rate by 20 basis points when it meets next week.",
    "The ECB benchmark rate now stands at minus 0.40% and the ECB has all but promised a monetary policy stimulus package as economic growth falters. Monday's PMI survey showed European manufacturing contracted for seven straight months.",
    "The euro  was little changed at  $1.0966, after hitting $1.0926 earlier, its lowest level since mid-May 2017. A break below the key $1.1000 level last week had sparked heavier sell-offs.",
    "The dollar weakened against the yen <JPY=EBS> and the Swiss franc <CHF=EBS> in the aftermath of the disappointing ISM manufacturing data. The greenback fell 0.2% to 106.045 yen and decreased 0.3% to 0.98745 franc.",
    "Sterling was last up 0.22% at $1.209 after falling to $1.1959, the lowest level since October 2016, when it plunged to $1.1491 in a flash crash. Against the euro, sterling rose to  90.7 pence, rebounding from a two-week low of 91.47 pence .",
    "========================================================",
    "Currency bid prices at 2:54PM (1854 GMT)"
  ],
  "published_datetime": "2019-09-03 15:09:00"
}