{
  "url": "https://www.nasdaq.com/article/disney-stock-driven-by-disney-presents-a-problem-for-investors-cm1210375",
  "title": "Disney Stock Driven By Disney+ Presents a Problem for Investors - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Disney (NYSE: DIS ) faces a new chapter in its history. The upcoming launch of Disney+ promises to bring back customers lost to cord-cutting. It could also help bolster DIS stock, an equity that's stagnated for years amid the decline of the Disney Channel.",
    "However, other areas of the company have struggled in recent weeks. Moreover, while Disney+ should quickly achieve a high degree of popularity, how revenue stacks up remains to be seen. Although Disney+ can revitalize its brand, it may fail to keep pushing Disney stock higher.",
    "InvestorPlace contributor Luke Lango believes that Disney stock trades on Disney+ (and presumably ESPN+ to a lesser extent). I agree with this hypothesis. DIS stagnated between 2015 and 2019 as subscribers abandoned both the Disney Channel and ESPN in droves in favor of streaming services.",
    "Hence, it stands to reason that when the company introduced Disney+, the stock again began to take off. However, as noted, I think the rise and the fall of DIS stock hinges on the promise of Disney+ streaming.",
    "To its credit, the managers of the Magic Kingdom have worked to mitigate this issue by adding Hulu Plus and a Hulu + Live TV bundle. They've also offered a long-term incentive to stay with Disney+ for three years. As an alternative to the current cost $6.99 per month - or $70 per year for an annual subscription - a three-year commitment will cut the overall cost to $141 over that period. That amounts to a subscription for less than $4 per month, a discount of almost 33%.",
    "Although Disney's pair of pluses - Disney+ and ESPN+ - could revive viewer numbers lost to cord-cutting, they still don't generate the sort of revenue once brought by their cable TV counterparts.",
    "Its incentives may prevent some customers from dropping Disney+ or Hulu Plus for services such as Netflix (NASDAQ: NFLX ), AT&T's (NYSE: T ) WarnerMedia or Amazon's (NASDAQ: AMZN ) Prime Video. However, they also serve as a tacit admission that from a revenue standpoint, the best years for sales are behind them.",
    "Worse, other areas of the company do not appear to have picked up the slack. August became a month the company would rather forget, as disappointing numbers from other parts of the company weighed on Disney stock.",
    "A rally to the mid-$140s per share level came to an abrupt halt following the Aug. 6 earnings report. The company missed estimates by a wide margin. Moreover, despite 32.9% revenue growth, it also missed estimates by $1.2 billion.",
    "The company blamed those misses on lower attendance at theme parks and the lack of visitors to Star Wars: Galaxy's Edge. The company also faces weakening NFL ratings on ESPN. Moreover, though Avengers: Endgame delivered for the company, Dark Phoenix has struggled to simply cover its costs.",
    "The overall financials also offer little incentive to buy DIS stock. Assuming Wall Street estimates hold, profit will fall by 18.9% this year. For fiscal 2020, they expect an increase of only 2.1%. With DIS trading at almost 23.4x forward earnings, Disney stock could become a tough sell for investors.",
    "Do not count on Disney+ to revive DIS stock. To be sure, I think the new streaming service will breathe new life into Disney Media Networks. Disney+ will include numerous iconic brands. With its reasonable cost made even cheaper by bundles, I expect the service to compete well.",
    "Unfortunately, it will not compensate for revenue lost due to the decline of the Disney Channel and lower subscriber numbers on ESPN. Moreover, other parts of the company - such as Disney Parks , Experiences, and Products - no longer appear poised to pick up the slack.",
    "As a result, analysts predict profit declines followed by negligible earnings growth into the foreseeable future. Under such conditions, I find it hard to imagine investors paying 23.4x forward earnings for lackluster growth.",
    "I would not encourage investors to bet against Disney. Its timeless brands should at least keep Disney stock from falling off a cliff. Still, until it can find a way to return to significant earnings increases, investors should not add to positions.",
    "As of this writing, Will Healy did not hold a position in any of the aforementioned stocks. You canfollow Will on Twitterat @HealyWriting .",
    "The post Disney Stock Driven By Disney+ Presents a Problem for Investors appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 06:35:14"
}