{
  "url": "https://www.nasdaq.com/article/tuesday-sector-laggards-industrial-technology-communications-cm1206851",
  "title": "Tuesday Sector Laggards: Industrial, Technology & Communications - Nasdaq.com",
  "text": [
    "In afternoon trading on Tuesday, Industrial stocks are the worst performing sector, showing a 1.8% loss. Within the sector, Wabtec Corp (Symbol: WAB) and Parker Hannifin Corp (Symbol: PH) are two of the day's laggards, showing a loss of 4.9% and 3.6%, respectively. Among industrial ETFs  , one ETF following the sector is the Industrial Select Sector SPDR ETF (Symbol: XLI), which is down 1.8% on the day, and up 16.73% year-to-date. Wabtec Corp, meanwhile, is down 5.75% year-to-date, and Parker Hannifin Corp is up 8.78% year-to-date. Combined, WAB and PH make up approximately 1.5% of the underlying holdings of XLI. The next worst performing sector is the Technology & Communications sector, showing a 1.5% loss. Among large Technology & Communications stocks, DXC Technology Co (Symbol: DXC) and Broadcom Inc (Symbol: AVGO) are the most notable, showing a loss of 4.6% and 3.9%, respectively. One ETF closely tracking Technology & Communications stocks is the Technology Select Sector SPDR ETF ( XLK  ), which is down 1.5% in midday trading, and up 27.26% on a year-to-date basis. DXC Technology Co, meanwhile, is down 40.00% year-to-date, and Broadcom Inc is up 8.95% year-to-date. Combined, DXC and AVGO make up approximately 2.2% of the underlying holdings of XLK.    Comparing these stocks and ETFs on a trailing twelve month basis, below is a relative stock price performance chart, with each of the symbols shown in a different color as labeled in the legend at the bottom:  makeArticleAd();       Here's a snapshot of how the S&P 500 components within the various sectors are faring in afternoon trading on Tuesday. As you can see, one sector is up on the day, while eight sectors are down.      25 Dividend Giants Widely Held By ETFs »  ",
    "The next worst performing sector is the Technology & Communications sector, showing a 1.5% loss. Among large Technology & Communications stocks, DXC Technology Co (Symbol: DXC) and Broadcom Inc (Symbol: AVGO) are the most notable, showing a loss of 4.6% and 3.9%, respectively. One ETF closely tracking Technology & Communications stocks is the Technology Select Sector SPDR ETF ( XLK  ), which is down 1.5% in midday trading, and up 27.26% on a year-to-date basis. DXC Technology Co, meanwhile, is down 40.00% year-to-date, and Broadcom Inc is up 8.95% year-to-date. Combined, DXC and AVGO make up approximately 2.2% of the underlying holdings of XLK.",
    "  25 Dividend Giants Widely Held By ETFs » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:56:14"
}