{
  "url": "https://www.nasdaq.com/article/sri-lanka-to-overshoot-2019-fiscal-deficit-target-despite-spending-cuts-20190903-00552",
  "title": "Sri Lanka to overshoot 2019 fiscal deficit target despite spending cuts - Nasdaq.com",
  "text": [
    "By Shihar Aneez",
    "COLOMBO, Sept 3 (Reuters) - Sri Lanka could overshoot its budget deficit target by much as 100 basis points this year, pushing its fiscal deficit to its highest in three years, as spending cuts have failed to offset shortfalls in revenues, three finance ministry officials said.",
    "Tight monetary and fiscal policies coupled with the impact of Easter Sunday bomb attacks have dented investor confidence in the island nation and led to sluggish growth, which is this year expected to be the lowest in nearly two decades.",
    "The finance ministry official, along with two other sources, said the revenue miss could push the fiscal deficit up to 5.4% in 2019, from the 4.4% target set by the government, in line with conditions tied to an International Monetary Fund (IMF) loan.",
    "The three government sources asked not to be identified as they are not authorized to discuss the matter with media.",
    "The jump in the fiscal deficit could strain Sri Lanka's deal with the IMF, which early this year extended a $1.5 billion loan facility for an extra year.",
    "As part of the loan deal, Sri Lanka had agreed to bring its deficit target to 3.5% of gross domestic product (GDP) by 2020. ",
    "\"We may have to discuss the latest situation with the IMF,\" said one of the officials. \"There is a clear reason for missing the (budget deficit) target.\"",
    "The tourism sector, the third-largest source of foreign currency for Sri Lanka, has been badly hit by the April 21 attacks by Islamist militants that killed more than 250 people. ",
    "The senior finance ministry official said the ability to cut spending any further has been constrained by the fact that the country is set to hold a presidential election later this year.",
    "\"We really want to cut spending more than 20%. But there has been a lot of opposition from the government for further spending cuts, given it's an election year,\" the official said.",
    "The central bank has eased its key monetary policy rate by 100 basis points in the four months through to August, to boost the economy, but private sector credit growth has yet to pick up."
  ],
  "published_datetime": "2019-09-03 08:21:00"
}