{
  "url": "https://www.nasdaq.com/article/is-domos-growth-already-grinding-to-a-halt-cm1210343",
  "title": "Is Domo's Growth Already Grinding to a Halt? - Nasdaq.com",
  "text": [
    "  Domo    (NASDAQ: DOMO) is a divisive stock for investors. The bulls were   impressed by the cloud analytics software provider's mobile-first   approach, its double-digit revenue growth, and its improving   margins. The bears claimed that it faced plenty of bigger   competitors and that it was burning through too much cash. The bulls initially seemed right, as Domo roughly doubled from   its   IPO price    to the low $40s between Sept. 2018 and March 2019. However,   Domo's subsequent drop -- which breached its IPO price -- favored   the bears. Domo's recent second-quarter report attracted even   more bears.   Image source: Getty Images.makeArticleAd();  The key facts Domo's platform lets executives manage their entire companies   via a suite of mobile analytics and data management tools.   Employees can also access that data to make business   decisions. Its expanding ecosystem includes an app-store, an AI platform   that crunches data and answers questions, collaboration services   for employees, a data warehouse, and media tools for marketing   campaigns. It serves over 1,500 organizations worldwide.   Here's how Domo's business fared over the past year.  YOY = Year-over-year. Source: Domo quarterly reports. Domo's 22% revenue growth in the second quarter met   analysts' expectations, but its 9% billings growth missed   expectations for high double-digit growth. Domo blamed that   slowdown on its pursuit of larger enterprise customers, which   throttled its billings growth from smaller customers. For the second quarter, Domo expects its revenue to rise just   11%-15% annually and for its billings to   decline    6%. For the full year, it expects its revenue to rise 18%-19%,   compared to its 31% growth last year. Those forecasts clearly   indicate that Domo's growth is peaking -- possibly   due to competition    from rivals like   Salesforce    (NYSE: CRM) and   Alphabet    's (NASDAQ: GOOG) (NASDAQ: GOOGL) Google. Salesforce recently acquired Domo's rival Tableau and   integrated its analytics tools into its market-leading CRM   (customer relationship management) platform. Google   also acquired Looker, another similar analytics platform,   and integrated its services into Google Cloud. Those bundles   could be much more appealing to the big enterprise customers   which Domo is pursuing.   Image source: Getty Images.  A sticky but unprofitable ecosystem On the bright side, Domo is retaining nearly 90% of its   customers, and most of its revenue still comes from its   higher-margin subscriptions. This indicates that its ecosystem is   sticky and it has plenty of opportunities to cross-sell new   services.  Source: Domo quarterly reports. Domo's operating margins are improving slightly as it curbs   its spending, but it still posted a loss of $31.2 million,   compared to a loss of $46.4 million a year earlier. On a non-GAAP   basis, which excludes its stock-based compensation and other   one-time charges, its net loss narrowed from $36.2 million to   $26.4 million. Domo expects to remain unprofitable in the third   quarter and for the full year. Meanwhile, its cash and equivalents plunged from $177 million   at the end of January to $97.9 million at the end of July. That   cash burn rate is alarming, and indicates that the company might   need to raise cash within a year via a secondary offering. It's cheap for a reason Domo's stock admittedly looks cheap at less than four times   next year's sales. Salesforce, by comparison, trades at over six   times next year's sales. But Domo is cheap for obvious reasons. Its growth is fading   quickly, it faces beefed up competitors like Salesforce and   Google, it's burning through too much cash, and it lacks a clear   path toward profitability. Domo is also cutting costs as the   competition heats up -- which could boost its margins but dull   its competitive edge. I'm not saying that Domo is doomed yet, but the stock could be   headed off a cliff if it doesn't get its revenue and billings   growth back on track.   10 stocks we like better than Domo, Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Domo, Inc. wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       Suzanne Frey, an executive at Alphabet, is a member of The     Motley Fool's board of directors.     Leo Sun      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Alphabet (A shares), Alphabet (C     shares), and Salesforce.com. The Motley Fool has the following     options: long January 2021 $100 calls on Salesforce.com. The     Motley Fool has a     disclosure policy      .  ",
    " Domo    (NASDAQ: DOMO) is a divisive stock for investors. The bulls were   impressed by the cloud analytics software provider's mobile-first   approach, its double-digit revenue growth, and its improving   margins. The bears claimed that it faced plenty of bigger   competitors and that it was burning through too much cash.",
    "The bulls initially seemed right, as Domo roughly doubled from   its   IPO price    to the low $40s between Sept. 2018 and March 2019. However,   Domo's subsequent drop -- which breached its IPO price -- favored   the bears. Domo's recent second-quarter report attracted even   more bears.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Domo's platform lets executives manage their entire companies   via a suite of mobile analytics and data management tools.   Employees can also access that data to make business   decisions.",
    "Its expanding ecosystem includes an app-store, an AI platform   that crunches data and answers questions, collaboration services   for employees, a data warehouse, and media tools for marketing   campaigns. It serves over 1,500 organizations worldwide.   Here's how Domo's business fared over the past year.",
    "YOY = Year-over-year. Source: Domo quarterly reports.",
    "Domo's 22% revenue growth in the second quarter met   analysts' expectations, but its 9% billings growth missed   expectations for high double-digit growth. Domo blamed that   slowdown on its pursuit of larger enterprise customers, which   throttled its billings growth from smaller customers.",
    "For the second quarter, Domo expects its revenue to rise just   11%-15% annually and for its billings to   decline    6%. For the full year, it expects its revenue to rise 18%-19%,   compared to its 31% growth last year. Those forecasts clearly   indicate that Domo's growth is peaking -- possibly   due to competition    from rivals like   Salesforce    (NYSE: CRM) and   Alphabet    's (NASDAQ: GOOG) (NASDAQ: GOOGL) Google.",
    "Salesforce recently acquired Domo's rival Tableau and   integrated its analytics tools into its market-leading CRM   (customer relationship management) platform. Google   also acquired Looker, another similar analytics platform,   and integrated its services into Google Cloud. Those bundles   could be much more appealing to the big enterprise customers   which Domo is pursuing.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "On the bright side, Domo is retaining nearly 90% of its   customers, and most of its revenue still comes from its   higher-margin subscriptions. This indicates that its ecosystem is   sticky and it has plenty of opportunities to cross-sell new   services.",
    "Source: Domo quarterly reports.",
    "Domo's operating margins are improving slightly as it curbs   its spending, but it still posted a loss of $31.2 million,   compared to a loss of $46.4 million a year earlier. On a non-GAAP   basis, which excludes its stock-based compensation and other   one-time charges, its net loss narrowed from $36.2 million to   $26.4 million. Domo expects to remain unprofitable in the third   quarter and for the full year.",
    "Meanwhile, its cash and equivalents plunged from $177 million   at the end of January to $97.9 million at the end of July. That   cash burn rate is alarming, and indicates that the company might   need to raise cash within a year via a secondary offering.",
    "Domo's stock admittedly looks cheap at less than four times   next year's sales. Salesforce, by comparison, trades at over six   times next year's sales.",
    "But Domo is cheap for obvious reasons. Its growth is fading   quickly, it faces beefed up competitors like Salesforce and   Google, it's burning through too much cash, and it lacks a clear   path toward profitability. Domo is also cutting costs as the   competition heats up -- which could boost its margins but dull   its competitive edge.",
    "I'm not saying that Domo is doomed yet, but the stock could be   headed off a cliff if it doesn't get its revenue and billings   growth back on track.",
    "  10 stocks we like better than Domo, Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Domo, Inc. wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Domo, Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Domo, Inc. wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " Suzanne Frey, an executive at Alphabet, is a member of The     Motley Fool's board of directors.     Leo Sun      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Alphabet (A shares), Alphabet (C     shares), and Salesforce.com. The Motley Fool has the following     options: long January 2021 $100 calls on Salesforce.com. The     Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:47:00"
}