{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-transdigm-keysight-bristol-myers-squibb-nrg-and-arconic-cm1207200",
  "title": "The Zacks Analyst Blog Highlights: TransDigm, Keysight, Bristol-Myers Squibb, NRG and Arconic - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 4, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: TransDigm Group Inc. TDG  , Keysight Technologies Inc. KEYS  , Bristol-Myers Squibb Co. BMY  , NRG Energy Inc. NRG  and Arconic Inc. ARNC  .  Here are highlights from Tuesday's Analyst Blog:    5 Top S&P 500 Stocks Soaring Despite Worst August in 4     Years   Wall Street just completed a disappointing August, which historically remains weak in stock market performance. However, this August dented investors' confidence a little bit more with heightened trade conflict between United States and China, global economic slowdown and various geopolitical unrests. However, despite the presence of severe volatility, a few stocks, within the broad-market S&P 500 Index, climbed in August.  Major Indexes Plummet in August  All three major stock indexes ---- the S&P 500, the Dow and the Nasdaq Composite ---- finished in negative territory in August. So far in 2019, August was the second month after May, when all three major stock indexes closed in the red. Notably, the S&P 500, the Dow and the Nasdaq Composite lost 1.8%, 1.7% and 2.6% in August, marking the worst-ever performance in August since 2015 for all the three indexes. These indexes posted four successive weekly losses starting from the last week of July to the third week of August. It was only in the fourth week of August that these indexes rallied on hopes of renewed trade talks between the United States and China.  Volatility Mars Stock Performance  After two consecutive months of bull run, volatility resurfaced on Wall Street from the beginning of August owing to a less-than-expected dovish monetary stance adopted by the Fed and President Trump's tweet expressing desire to impose a 10% tariff on a new set of Chinese goods worth $300 billion. Moreover, China started manipulating its currency by setting its mid-point to below 7 a U.S. dollar, a key psychological barrier, for the first time in more than a decade. Meanwhile, Eurozone continued to suffer from manufacturing wooed and several major emerging market central banks reduced the benchmark interest rate to steady their economies in order to combat a global economic slowdown. Meanwhile, the tariff war between the two largest trading nations of the world heightened on Aug 23 after China announced that it will impose 5% to 10% tariff on another $75 billion of U.S. goods in two tranches, on Sep 1 and Dec 15. Additionally, a 25% tariff on U.S. auto products and auto parts will be imposed effective Dec 15. In retaliation, President Donald Trump decided to raise tariff to 30% from the existing 25% on $250 billion Chinese goods. Moreover, he also raised the tariff from 10% to 15%, which is to be levied on an additional $300 billion of Chinese exports effective Sep 1. Additionally, several geopolitical crises such as the possibility of a no-deal Brexit in Britain, political turmoil in Italy, political unrest for democracy in Hong Kong and the ongoing oil conflict between the United States and China also jeopardized investors' confidence.  Treasury Yield Curve Inversion  All these negatives resulted in inversion of yields on 2-year and 10-year U.S. Treasury Notes on Aug 14, for the first time since December 2005. Thereafter, on Aug 28, yield on the 10-year Note plummeted below the psychological barrier of 1.5% to 1.45% and below the 2-year Note's yield of 1.5%. The spread registered its lowest level since 2007. Similarly, the yield on 30-year U.S. Treasury Note fell below its psychological barrier of 2% to as low as 1.907%. Meanwhile, the yield on short-term 3-month Treasury Bill stayed at 1.992%, reflecting inversion with the yields of mid-term 2-year, benchmark 10-year and long-term 30-year Notes. Several economists and financial experts consider this bond market phenomenon as a clear indication of an impending recession.  5 S&P 500 Stocks Surge in August  The recent concerns about a U.S.-China trade deal and consequently global economic slowdown have not stalled the entire market. We have been able to narrow down our search to five S&P 500 stocks, which have popped in the past month and still have upside left. All five stocks currently sport a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .  TransDigm Group Inc.  is a leading global designer, producer and supplier of highly engineered aircraft components for use on nearly all commercial and military aircraft in service today. It operates in three segments: Power & Control, Airframe and Non-aviation. The company has expected earnings growth of 1% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 5.8% over the last 30 days. TransDigm Group has jumped 12.3% in the past month.  Keysight Technologies Inc.   provides electronic design and test solutions to commercial communications, networking, aerospace, defense and government, automotive, energy, semiconductor and electronic industries in the Americas and the Asia Pacific. The company has expected earnings growth of 38.9% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 6.4% over the last 30 days. Keysight Technologies has climbed 8.1% in the past month.  Bristol-Myers Squibb Co.   discovers, develops, licenses, manufactures, markets, distributes and sells biopharmaceutical products worldwide. The company offers drugs in oncology, immunoscience, cardiovascular and fibrotic diseases. The company has expected earnings growth of 7.5% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 0.5% over the last 30 days. Bristol-Myers Squibb has soared 6.3% in the past month.  NRG Energy Inc.   is the leading integrated power company in the United States, built on the strength of their diverse competitive electric generation portfolio and leading retail electricity platform. It is involved in the producing, selling and delivering electricity and related products and services residential, industrial and commercial consumers. The company has expected earnings growth of 67.6% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 4.9% over the last 30 days. NRG Energy has surged 6% in the past month.  Arconic Inc.  is a global leader in multi-material, precision engineered products and solutions for a variety of industries. It operates in three segments: Engineered Products and Solutions, Global Rolled Products, and Transportation and Construction Solutions. The company has expected earnings growth of 50% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 8.5% over the last 30 days. Arconic has surged 6% in the past month.  The Hottest Tech Mega-Trend of All  Last year, it generated $8 billion in global revenues. By 2020, it's predicted to blast through the roof to $47 billion. Famed investor Mark Cuban says it will produce \"the world's first trillionaires,\" but that should still leave plenty of money for regular investors who make the right trades early.   See Zacks' 3 Best Stocks to Play This Trend     >>   Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  NRG Energy, Inc. (NRG): Free Stock Analysis Report   Bristol-Myers Squibb Company (BMY): Free Stock Analysis Report   Transdigm Group Incorporated (TDG): Free Stock Analysis Report   Keysight Technologies Inc. (KEYS): Free Stock Analysis Report   Arconic Inc. (ARNC): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 4, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: TransDigm Group Inc. TDG  , Keysight Technologies Inc. KEYS  , Bristol-Myers Squibb Co. BMY  , NRG Energy Inc. NRG  and Arconic Inc. ARNC  .",
    " Here are highlights from Tuesday's Analyst Blog: ",
    "  5 Top S&P 500 Stocks Soaring Despite Worst August in 4     Years  ",
    "Wall Street just completed a disappointing August, which historically remains weak in stock market performance. However, this August dented investors' confidence a little bit more with heightened trade conflict between United States and China, global economic slowdown and various geopolitical unrests.",
    "However, despite the presence of severe volatility, a few stocks, within the broad-market S&P 500 Index, climbed in August.",
    " Major Indexes Plummet in August ",
    "All three major stock indexes ---- the S&P 500, the Dow and the Nasdaq Composite ---- finished in negative territory in August. So far in 2019, August was the second month after May, when all three major stock indexes closed in the red.",
    "Notably, the S&P 500, the Dow and the Nasdaq Composite lost 1.8%, 1.7% and 2.6% in August, marking the worst-ever performance in August since 2015 for all the three indexes. These indexes posted four successive weekly losses starting from the last week of July to the third week of August. It was only in the fourth week of August that these indexes rallied on hopes of renewed trade talks between the United States and China.",
    " Volatility Mars Stock Performance ",
    "After two consecutive months of bull run, volatility resurfaced on Wall Street from the beginning of August owing to a less-than-expected dovish monetary stance adopted by the Fed and President Trump's tweet expressing desire to impose a 10% tariff on a new set of Chinese goods worth $300 billion.",
    "Moreover, China started manipulating its currency by setting its mid-point to below 7 a U.S. dollar, a key psychological barrier, for the first time in more than a decade. Meanwhile, Eurozone continued to suffer from manufacturing wooed and several major emerging market central banks reduced the benchmark interest rate to steady their economies in order to combat a global economic slowdown.",
    "Meanwhile, the tariff war between the two largest trading nations of the world heightened on Aug 23 after China announced that it will impose 5% to 10% tariff on another $75 billion of U.S. goods in two tranches, on Sep 1 and Dec 15. Additionally, a 25% tariff on U.S. auto products and auto parts will be imposed effective Dec 15.",
    "In retaliation, President Donald Trump decided to raise tariff to 30% from the existing 25% on $250 billion Chinese goods. Moreover, he also raised the tariff from 10% to 15%, which is to be levied on an additional $300 billion of Chinese exports effective Sep 1.",
    "Additionally, several geopolitical crises such as the possibility of a no-deal Brexit in Britain, political turmoil in Italy, political unrest for democracy in Hong Kong and the ongoing oil conflict between the United States and China also jeopardized investors' confidence.",
    " Treasury Yield Curve Inversion ",
    "All these negatives resulted in inversion of yields on 2-year and 10-year U.S. Treasury Notes on Aug 14, for the first time since December 2005. Thereafter, on Aug 28, yield on the 10-year Note plummeted below the psychological barrier of 1.5% to 1.45% and below the 2-year Note's yield of 1.5%. The spread registered its lowest level since 2007. Similarly, the yield on 30-year U.S. Treasury Note fell below its psychological barrier of 2% to as low as 1.907%.",
    "Meanwhile, the yield on short-term 3-month Treasury Bill stayed at 1.992%, reflecting inversion with the yields of mid-term 2-year, benchmark 10-year and long-term 30-year Notes. Several economists and financial experts consider this bond market phenomenon as a clear indication of an impending recession.",
    " 5 S&P 500 Stocks Surge in August ",
    "The recent concerns about a U.S.-China trade deal and consequently global economic slowdown have not stalled the entire market. We have been able to narrow down our search to five S&P 500 stocks, which have popped in the past month and still have upside left. All five stocks currently sport a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .",
    " TransDigm Group Inc.  is a leading global designer, producer and supplier of highly engineered aircraft components for use on nearly all commercial and military aircraft in service today. It operates in three segments: Power & Control, Airframe and Non-aviation.",
    "The company has expected earnings growth of 1% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 5.8% over the last 30 days. TransDigm Group has jumped 12.3% in the past month.",
    " Keysight Technologies Inc.   provides electronic design and test solutions to commercial communications, networking, aerospace, defense and government, automotive, energy, semiconductor and electronic industries in the Americas and the Asia Pacific.",
    "The company has expected earnings growth of 38.9% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 6.4% over the last 30 days. Keysight Technologies has climbed 8.1% in the past month.",
    " Bristol-Myers Squibb Co.   discovers, develops, licenses, manufactures, markets, distributes and sells biopharmaceutical products worldwide. The company offers drugs in oncology, immunoscience, cardiovascular and fibrotic diseases.",
    "The company has expected earnings growth of 7.5% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 0.5% over the last 30 days. Bristol-Myers Squibb has soared 6.3% in the past month.",
    " NRG Energy Inc.   is the leading integrated power company in the United States, built on the strength of their diverse competitive electric generation portfolio and leading retail electricity platform. It is involved in the producing, selling and delivering electricity and related products and services residential, industrial and commercial consumers.",
    "The company has expected earnings growth of 67.6% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 4.9% over the last 30 days. NRG Energy has surged 6% in the past month.",
    " Arconic Inc.  is a global leader in multi-material, precision engineered products and solutions for a variety of industries. It operates in three segments: Engineered Products and Solutions, Global Rolled Products, and Transportation and Construction Solutions.",
    "The company has expected earnings growth of 50% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 8.5% over the last 30 days. Arconic has surged 6% in the past month.",
    " The Hottest Tech Mega-Trend of All ",
    "Last year, it generated $8 billion in global revenues. By 2020, it's predicted to blast through the roof to $47 billion. Famed investor Mark Cuban says it will produce \"the world's first trillionaires,\" but that should still leave plenty of money for regular investors who make the right trades early.",
    "  See Zacks' 3 Best Stocks to Play This Trend     >>  ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:19:00"
}