{
  "url": "https://www.nasdaq.com/article/glass-lewis-ceo-steps-down-veterans-return-to-proxy-advisory-firm-20190911-00941",
  "title": "Glass Lewis CEO steps down, veterans return to proxy advisory firm - Nasdaq.com",
  "text": [
    "By Svea Herbst-Bayliss",
    "Sept 11 (Reuters) - Proxy advisory firm Glass Lewis & Co said Katherine \"KT\" Rabin would step down as CEO after a dozen years at the helm and that two former senior executives would return to lead the firm.",
    "Glass Lewis, the privately held company that shapes the outcome of major corporate ballots, announced Rabin's resignation in a press release many hours after Reuters first reported that she will be leaving the position.",
    "Kevin Cameron, who co-founded the firm, is returning as executive chair and Carrie Busch, who had run the firm's research department, is coming back as president.",
    "Gordon Seymour, a lawyer and well-known corporate governance expert, will be joining as special counsel for public policy.",
    "Rabin's departure comes as Glass Lewis faces increasing competition from rival Institutional Shareholder Services Inc (ISS), as well as heightened regulatory oversight by the U.S. Securities and Exchange Commission (SEC).",
    "Rabin will no longer run day-to-day operations but will remain involved with the firm by joining its Research Advisory Council, Glass Lewis said.",
    "Cameron, who had served as Glass Lewis' president until 2007, will be responsible for managing the company's executive team. He said he is happy to return and lead the team \"as we embark on our next phase of growth.\"",
    "Glass Lewis advises shareholders on how to vote on corporate governance issues such as pay, deals and directors. The San Francisco-based firm distributes its research to more than 1,300 institutional clients, including the bulk of the world's biggest pension plans and asset managers.",
    "It employs roughly 400 people around the world and Rabin notified them on Wednesday of the leadership changes.",
    "Rabin joined Glass Lewis in 2003, shortly after the firm was founded, and has served as its chief executive for the last 12 years. During her tenure, Glass Lewis grew as the proxy advisory industry's second largest player after ISS, guiding how shareholder votes representing trillions of dollars worth of shares are cast.",
    "However unlike ISS, Glass Lewis did not expand in areas such as consulting services for investors.",
    "Glass Lewis is owned by Canadian pension funds Ontario Teachers' Pension Plan and Alberta Investment Management Corp.",
    "Last month, the SEC issued new guidance that aims to clarify how investors and advisory firms that cast ballots on their behalf should vote in corporate elections on issues like pay and diversity.",
    "The guidance, which expands previous 2014 guidance on shareholder voting in corporate ballots, addresses some of the grievances U.S. corporations have long had about so-called proxy advisers, such as mistakes in reports the advisers issue on specific companies and conflicts of interest in their business models."
  ],
  "published_datetime": "2019-09-11 09:50:00"
}