{
  "url": "https://www.nasdaq.com/article/uschina-trade-concessions-lift-em-assets-eyes-on-turkish-rate-decision-20190912-00176",
  "title": "U.S.-China trade concessions lift EM assets; Eyes on Turkish rate decision - Nasdaq.com",
  "text": [
    "By Agamoni Ghosh",
    "Sept 12 (Reuters) - Emerging market assets rose on Thursday as investors took heart from tariff concessions made by the United States and China, while bracing for the likely next wave of monetary easing from central banks including those in the euro zone and Turkey.",
    "U.S. President Donald Trump on Wednesday welcomed China's decision to exempt some U.S. anti-cancer drugs and other goods from its tariffs and announced a short delay to scheduled tariff hikes on billions of dollars worth of Chinese goods. ",
    "Asian indices led the way, with China's blue-chip index  climbing more than 1% to end the week higher ahead of a market holiday on Friday. Markets in South Korea were shut for a public holiday.",
    "The Hang Seng index  lagged its Asian peers to end 0.2% lower as Hong Kong stock exchange shares  fell 3% as investors cast doubt on the merits of its $39 billion takeover approach to London Stock Exchange Plc (LSE) . ",
    "South Africa's JTOPI index  jumped 1%, helped by a nearly 4% rise in drugmaker Aspen Pharmacare Holdings as the company said it aimed to reduce debt levels from next year and even deferred dividend payables in 2020. ",
    "CENTRAL BANK WATCH",
    "Emerging market currencies scaled a six-week peak against a fairly tepid dollar, with China's yuan  rising 0.4%, but investors were squarely focused on central bank meetings.",
    "While the Malaysian central bank held its key interest rate at 3% on Thursday, its Turkish counterpart is likely to proceed with another super-sized rate cut later in the day, following a 425 basis points cut last month. ",
    "Reuters polls forecast that the main policy rate - currently at 19.75% - will be slashed to 16% by year-end as President Tayyip Erdogan looks to achieve an economic growth target of 5% in 2020. The lira  was flat, lagging the broader market.",
    "Investors will also be watching the European Central Bank's decision where apart from an expected cut in key interest rates, expectations of a fiscal stimulus package are rife.",
    "\"Emerging markets have already in some part reacted to what's going to happen in Europe, as we have seen a number of  rate cuts already including those in India and Russia,\" said Alon Ozer, chief investment officer at Omnia Family Wealth, in Miami, Florida.",
    "\"I think the EM central bankers took that cue long before seeing that bond markets have been screaming about significant economic problems around the world.\"",
    "For GRAPHIC on emerging market FX performance 2019.",
    "For GRAPHIC on MSCI emerging index performance 2019.",
    "For TOP NEWS across emerging markets "
  ],
  "published_datetime": "2019-09-12 05:29:00"
}