{
  "url": "https://www.nasdaq.com/article/over-100-london-investment-firms-get-eu-licences-for-brexit-hubs-20190905-00866",
  "title": "Over 100 London investment firms get EU licences for Brexit hubs - Nasdaq.com",
  "text": [
    "By Huw Jones",
    "LONDON, Sept 5 (Reuters) - More than one hundred asset managers, trading platforms and investment firms in London have so far obtained licences to run new hubs in the European Union after Brexit, a top EU regulator said on Thursday.",
    "Licences are granted by national regulators but the European Securities and Markets Authority (ESMA) ensures they don't offer sweeteners to UK-based firms that want a base to serve EU clients after Britain leaves the bloc, currently scheduled for Oct. 31.",
    "\"There have also been some that are relocating by beefing up their existing entities in the EU27.\"",
    "London is Europe's biggest financial centre, but the CME  has transferred trading in European government bonds and repos from London to its new hub in Amsterdam. The London Stock Exchange  has moved trading in European government bonds to its Milan base.",
    "CBOE  will offer trading in EU shares at its new Amsterdam hub from October to replicate its London unit, with rival exchange Aquis  set to follow suit at a new Paris unit.",
    "Maijoor said such preparations for Brexit were largely an issue for the private sector.",
    "Paris-based ESMA directly authorises and supervises credit rating agencies and trade repositories in the EU.",
    "\"There we have seen good progress on getting prepared for the risk of a no-deal Brexit,\" Maijoor said.",
    "The likelihood of a no-deal Brexit began to recede this week as Britain's parliament approves a law to stop this from happening.",
    "There has been concern in the funds industry that a no-deal Brexit would threaten a long-standing global practice known as delegation, whereby asset managers outside the EU can pick stocks for funds listed in the bloc.",
    "Asset managers in London worried they would be under pressure to move to the EU.",
    "\"The EU27 do support the possibility for delegation because it's a generic way for global capital markets to work,\" Maijoor said.",
    "\"On the other hand, it must not undermine the possibility to have a fully-fledged entity in the EU27 and not a shell company, and an entity that can be supervised.\"",
    "ESMA, national regulators and Britain'sFinancial Conduct Authority have already signed cooperation agreements in the event of a no-deal Brexit, he added.",
    "Fragmentation in Europe's capital market is inevitable to some extent because Britain is leaving the bloc and its common system of supervision and rules.",
    "\"Leaving the single market and starting a new separate regulatory framework is fragmenting markets,\" Maijoor said."
  ],
  "published_datetime": "2019-09-05 01:00:00"
}