{
  "url": "https://www.nasdaq.com/article/eu-row-with-bern-shortterm-gain-longterm-pain-for-swiss-stock-exchange-20190905-00911",
  "title": "EU row with Bern: short-term gain, long-term pain for Swiss stock exchange - Nasdaq.com",
  "text": [
    "By Josephine Mason",
    "LONDON, Sept 5 (Reuters) - A trade dispute between Bern and Brussels has boosted revenue and volumes for Swiss stock exchange SIX, but may eventually hurt investment in Switzerland's financial markets, SIX's Chief Executive Officer Jos Dijsselhof said on Thursday.",
    "Swiss stock volumes have soared after a ban on trading on European Union platforms forced market participants onto the domestic exchange, handing Switzerland an early victory in its protracted row with Brussels.",
    "Before the ban, 70% of Zurich-listed shares worth $1.2 trillion traded on the domestic market and the remainder in the EU. Now it's almost 100% in Switzerland, Dijsselhof said in an interview with Reuters.",
    "\"In the short run, I'm quite happy. I have a bit more volume and revenue. In the long run I don't think it's good,\" he said.",
    "\"I think for a proper investment climate, for investors to have best execution, you need to have multiple places to execute. If you don't have that in the long run, it's not good for the market.\"",
    "Exchange data showed SIX's turnover in August jumped 51% year on year and 38% in July. ",
    "For Brussels, Dijsselhof said the dispute had backfired.",
    "\"The EU government thought 'we create a tool to hold Switzerland hostage so that we can push Switzerland to move forward on this framework agreement',\" he said.",
    "\"And it's not worked. We now have all the volume.\"",
    "There are few signs a deal over the stalled treaty will be struck this year with the EU, which is also struggling to forge a new relationship with departing member Britain. ",
    "Separately, SIX is working on a new digital trading platform - the SIX Digital Exchange (SDX) - that will use blockchain technology to speed up trading.",
    "Dijsselhof said the exchange was working with major global banks on the best applications for the platform, with Citibank, JP Morgan Chase and Credit Suisse all allocating teams to help develop a use for it.",
    "He expects to have worked out a prototype product by the end of the year and then to build up the market for it in 2020.",
    "\"The infrastructure will be cheaper, you won't need collateral, you won't have the credit risk, you won't need a clearing house. There are huge advantages to moving existing products on it,\" he said.",
    "The banks may eventually invest in the platform, he added.",
    "\"Technically it's there. Now we need to get a market. To create a market, we need to align with customers to see where are the opportunities,\" Dijsselhof said.",
    "The Swiss regulator is working closely with the exchange to create legislation on how to oversee the new platform, he said."
  ],
  "published_datetime": "2019-09-05 01:50:00"
}