{
  "url": "https://www.nasdaq.com/article/validea-james-p-oshaughnessy-strategy-daily-upgrade-report-9122019-cm1210838",
  "title": "Validea James P. O'Shaughnessy Strategy Daily Upgrade Report - 9/12/2019 - Nasdaq.com",
  "text": [
    "The following are today's upgrades for Validea's Growth/Value Investor  model based on the published strategy of James P. O'Shaughnessy  . This two strategy approach offers a large-cap value model and a growth approach that looks for persisten t earnings  growth and strong relative strength.",
    " DOLLAR GENERAL CORP. ( DG  )  is a large-cap growth stock in the Retail (Department & Discount) industry. The rating according to our strategy based on James P. O'Shaughnessy changed from 50% to 100% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    " Company Description:  Dollar General Corporation is a discount retailer. The Company offers a selection of merchandise, including consumables, seasonal, home products and apparel. The Company's consumables category includes paper and cleaning products (such as paper towels, bath tissue, and other home cleaning supplies); packaged food (such as cereals, spices, sugar and flour); perishables (such as milk, beer and wine); snacks (such as candy, cookies, and carbonated beverages); health and beauty (such as over-the-counter medicines and personal care products); pet (pet supplies and pet food), and tobacco products. Its seasonal products include decorations, toys, batteries, stationery, prepaid phones and accessories, and home office supplies. Its home products include cookware, craft supplies and kitchen, and bed and bath soft goods. Its apparel products include casual everyday apparel for infants, toddlers, girls, boys, women and men, as well as socks, underwear, disposable diapers, shoes and accessories.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here ",
    " AAR CORP. ( AIR  )  is a small-cap growth stock in the Aerospace & Defense industry. The rating according to our strategy based on James P. O'Shaughnessy changed from 75% to 100% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    " Company Description:  AAR CORP. (AAR) is a provider of services and products to the commercial aviation and government and defense markets. The Company operates in two segments: Aviation Services, which consists of supply chain and maintenance, repair and overhaul ( MRO  ) activities, and Expeditionary Services, which includes airlift and mobility activities. Its services and products include aviation supply chain and parts support programs; MRO of aircraft and landing gear; design and manufacture of specialized pallets, shelters and containers; expeditionary airlift services; aircraft modifications, and aircraft and engine sales and leasing. It serves commercial, defense and governmental aircraft fleet operators, original equipment manufacturers and independent service providers around the world. Its landing gear overhaul facility is in Miami, Florida, where it repairs and overhauls landing gear, brakes and actuators for various types of commercial and military aircraft.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here ",
    " MORGAN STANLEY ( MS  )  is a large-cap value stock in the Investment Services industry. The rating according to our strategy based on James P. O'Shaughnessy changed from 80% to 100% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    " Company Description:  Morgan Stanley is a financial holding company. The Company's segments include Institutional Securities, Wealth Management and Investment Management. The Company's Institutional Securities business segment provides investment banking, sales and trading, and other services to corporations, governments, financial institutions and high-to-ultra high net worth clients. The Company's Wealth Management business segment provides an array of financial services and solutions to individual investors and small-to-medium sized businesses and institutions covering brokerage and investment advisory services, market-making activities in fixed income securities, financial and wealth planning services, annuity and insurance products, credit and other lending products, banking and retirement plan services. The Company's Investment Management business segment provides a range of investment strategies and products.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here ",
    " VSE CORPORATION ( VSEC  )  is a small-cap value stock in the Business Services industry. The rating according to our strategy based on James P. O'Shaughnessy changed from 75% to 100% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    " Company Description:  VSE Corporation is a services and supply chain management company. The Company's segments include Supply Chain Management Group, Aviation Group and Federal Services Group. The Company provides logistics and distribution services for legacy systems and equipment and professional and technical services to the United States Government, including the United States Department of Defense (DoD), the United States Postal Service (USPS), federal civilian agencies, and commercial and other customers. The Company's service offerings include supply chain and inventory management services; vehicle fleet sustainment programs; vehicle fleet parts supply and distribution; maintenance, repair, and operations ( MRO  ) of aircraft engines and engine components; aircraft engine parts supply and distribution; engineering support for military vehicles; military equipment refurbishment and modification, and ship MRO and follow-on technical support.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here ",
    " SYNNEX CORPORATION (SNX)  is a mid-cap value stock in the Computer Hardware industry. The rating according to our strategy based on James P. O'Shaughnessy changed from 75% to 100% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    " Company Description:  Synnex Corporation is a business process services company. The Company provides a range of distribution, logistics and integration services for the technology industry and providing outsourced services focused on customer engagement strategy. The Company operates in two segments: Technology Solutions and Concentrix. The Company's Technology Solutions segment distributes peripherals, information technology (IT) systems, including data center server and storage solutions, system components, software, networking/communications/security equipment, and consumer electronics (CE) and complementary products. Within its Technology Solutions segment, the Company also provides systems design and integration solutions. The Company's Concentrix segment offers a portfolio of solutions and end-to-end business services focused on customer engagement strategy, process optimization, technology innovation, front and back-office automation and business transformation.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here ",
    "Since its inception, Validea's strategy based on James P. O'Shaughnessy has returned 273.16% vs. 201.88% for the S&P 500. For more details on this strategy, click here ",
    " About James P. O'Shaughnessy  : Research guru and money manager James O'Shaughnessy forced many professional and amateur investors alike to rethink their investment beliefs when he published his 1996 bestseller, What Works on Wall Street. O'Shaughnessy back-tested 44 years of  stock market data  from the comprehensive Standard & Poor's Compustat database to find out which quantitative strategies have worked over the years and which haven't. To the surprise of many, he concluded that price/earnings ratios aren't the best indicator of a stock's value, and that small-company stocks, contrary to popular wisdom, don't as a group have an edge on large-company stocks. Today O'Shaughnessy is the Chief Investment Officer of O'Shaughnessy Asset Management.",
    " About Validea  : Validea is an  investment research  service that follows the published strategies of investment legends. Validea offers both stock analysis and model portfolios based on gurus who have outperformed the market over the long-term, including Warren Buffett, Benjamin Graham, Peter Lynch and Martin Zweig. For more information about Validea, click here ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 03:50:42"
}