{
  "url": "https://www.nasdaq.com/article/domo-domo-to-report-q2-earnings-whats-in-the-cards-cm1206638",
  "title": "Domo (DOMO) to Report Q2 Earnings: What's in the Cards? - Nasdaq.com",
  "text": [
    "  Domo DOMO  is set to report second-quarter fiscal 2020 results on Sep 5.  makeArticleAd();  In the las t report  ed quarter, the company posted a non-GAAP loss of $1.08 per share that narrowed significantly from a loss of $28.48 reported in the year-ago quarter and the Zacks Consensus Estimate of a loss of $1.28.    Revenues of $41 million were in line with the consensus mark and grew 27.7% year over year. Subscription revenues, which represented 84.3% of total revenues, increased 29%.    For the second quarter, Domo expects revenues between $41 million and $42 million. Non-GAAP net loss is expected between 98 cents and $1.02 per share.     The Zacks Consensus Estimate for second-quarter earnings is pegged at a loss of $1, while the same for revenues stands at $41.2 million.     Domo, Inc. Price and EPS Surprise        Domo, Inc. price-eps-surprise    |   Domo, Inc. Quote     Let's see how things are shaping up for this announcement.   Factors to Watch    Domo's expanding clientele, particularly enterprise customers, is expected to drive the top line in the to-be-reported quarter.    At the end of the first quarter, the company's customer base exceeded 1,800. Domo had 458 enterprise customers, up 19% year over year. Moreover, enterprise revenues grew 33%.    Additionally, the company's expanding service offerings based on a solid partner base are a key catalyst. Domo's partner base is also expanding and now includes Amazon Web Services (AWS), Google, Azure, LinkedIn, Box, Cooper, Octane and Zendesk ZEN  .    During the second quarter, the company announced the availability of Domo for AWS. It also inked a partnership with Zendesk to help customers manage their IoT solutions efficiently. Per the agreement, Domo and Zendesk launched the Zendesk Customer Success for IoT App, which is built on the Domo IoT Cloud, to enable end-to-end management of data from device to end-user.    Moreover, Domo continued to win accolades in the to-be-reported quarter. The company was ranked #1 by Dresner Advisory Services' 2019 Self Service Business Intelligence (BI) Market Study. Further, it received higher customer ratings in the 2019 Gartner report.    The awards reflect Domo's growing popularity in the business intelligence and analytics market. This is expected to have driven user base in the second quarter. Moreover, the company expects operating expenses to have declined in the quarter, thereby boosting profitability.   What Our Model Says    According to the Zacks model, a company with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) along with a positive Earnings ESP  has a good chance of beating estimates. The Sell-rated stocks (Zacks Rank #4 or 5) are best avoided.    Domo has a Zacks Rank #3 and an Earnings ESP of 0.00%. You can uncover the best stocks to buy or sell, before they're reported, with our Earnings ESP Filter  .   Stocks to Consider    Here are a couple of companies, which, per our model, have the right combination of elements to post an earnings beat this quarter:    CrowdStrike Holdings CRWD  has an Earnings ESP of +24.02% and a Zacks Rank #3. You can see  the complete list of today's Zacks #1 Rank stocks here  .    Oracle ORCL  has an Earnings ESP of +0.10% and a Zacks Rank #3.    Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Zendesk, Inc. (ZEN): Free Stock Analysis Report   Oracle Corporation (ORCL): Free Stock Analysis Report   CrowdStrike Holdings Inc. (CRWD): Free Stock Analysis Report   Domo, Inc. (DOMO): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Domo DOMO  is set to report second-quarter fiscal 2020 results on Sep 5.  makeArticleAd();  In the las t report  ed quarter, the company posted a non-GAAP loss of $1.08 per share that narrowed significantly from a loss of $28.48 reported in the year-ago quarter and the Zacks Consensus Estimate of a loss of $1.28.    Revenues of $41 million were in line with the consensus mark and grew 27.7% year over year. Subscription revenues, which represented 84.3% of total revenues, increased 29%.    For the second quarter, Domo expects revenues between $41 million and $42 million. Non-GAAP net loss is expected between 98 cents and $1.02 per share.     The Zacks Consensus Estimate for second-quarter earnings is pegged at a loss of $1, while the same for revenues stands at $41.2 million.  ",
    "  Domo, Inc. Price and EPS Surprise        Domo, Inc. price-eps-surprise    |   Domo, Inc. Quote  ",
    " Domo, Inc. Price and EPS Surprise ",
    " Domo, Inc. price-eps-surprise    |   Domo, Inc. Quote ",
    "Let's see how things are shaping up for this announcement.   Factors to Watch    Domo's expanding clientele, particularly enterprise customers, is expected to drive the top line in the to-be-reported quarter.    At the end of the first quarter, the company's customer base exceeded 1,800. Domo had 458 enterprise customers, up 19% year over year. Moreover, enterprise revenues grew 33%.    Additionally, the company's expanding service offerings based on a solid partner base are a key catalyst. Domo's partner base is also expanding and now includes Amazon Web Services (AWS), Google, Azure, LinkedIn, Box, Cooper, Octane and Zendesk ZEN  .    During the second quarter, the company announced the availability of Domo for AWS. It also inked a partnership with Zendesk to help customers manage their IoT solutions efficiently. Per the agreement, Domo and Zendesk launched the Zendesk Customer Success for IoT App, which is built on the Domo IoT Cloud, to enable end-to-end management of data from device to end-user.    Moreover, Domo continued to win accolades in the to-be-reported quarter. The company was ranked #1 by Dresner Advisory Services' 2019 Self Service Business Intelligence (BI) Market Study. Further, it received higher customer ratings in the 2019 Gartner report.    The awards reflect Domo's growing popularity in the business intelligence and analytics market. This is expected to have driven user base in the second quarter. Moreover, the company expects operating expenses to have declined in the quarter, thereby boosting profitability.   What Our Model Says    According to the Zacks model, a company with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) along with a positive Earnings ESP  has a good chance of beating estimates. The Sell-rated stocks (Zacks Rank #4 or 5) are best avoided.    Domo has a Zacks Rank #3 and an Earnings ESP of 0.00%. You can uncover the best stocks to buy or sell, before they're reported, with our Earnings ESP Filter  .   Stocks to Consider    Here are a couple of companies, which, per our model, have the right combination of elements to post an earnings beat this quarter:    CrowdStrike Holdings CRWD  has an Earnings ESP of +24.02% and a Zacks Rank #3. You can see  the complete list of today's Zacks #1 Rank stocks here  .    Oracle ORCL  has an Earnings ESP of +0.10% and a Zacks Rank #3.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:37:00"
}