{
  "url": "https://www.nasdaq.com/article/this-just-in-tripadvisor-stock-upgraded-cm1207430",
  "title": "This Just In: TripAdvisor Stock Upgraded - Nasdaq.com",
  "text": [
    "  Every day, Wall Street analysts upgrade some stocks,     downgrade others, and \"initiate coverage\" on a few more. But do     these analysts even know what they're talking about? Today,     we're taking one high-profile Wall Street pick and putting it     under the microscope...  Travel research website operator   TripAdvisor    (NASDAQ: TRIP) reported disappointing   fiscal Q2 earnings    last month, and the share price has continued to   weaken    ever since. TripAdvisor stock is now down a total of 14% since earnings   came out, and the numbers are even worse than that already   sounds. \"Over the past 6 months, TRIP has underperformed [the   S&P 500    ] by ~33%,\" as investment bank UBS points out today in a note on   StreetInsider.com    .makeArticleAd(); And yet,   thanks    to this dramatic decline in stock price, UBS now believes that   the odds of TripAdvisor outperforming in the future have   improved. Here's what you need to know.   Image source: Getty Images.  What TripAdvisor said Before we get into the upgrade proper, it's worth taking a few   minutes to consider just what TripAdvisor said last month to   spark the post-earnings stock slump (and accelerate the slide   experienced over the last six months). As my fellow Fool.com contributor   Dan Caplinger    explained last month, TripAdvisor is in the midst of a major site   revamp, retooling its business from one focused almost   exclusively on providing travel reviews to one that can \"capture   more of the business that it now refers out to its partners\" (and   thus reward its shareholders with a greater portion of those   profits). The results so far, however, have been mixed.   Sales are growing     in the company's top priority of experiences and dining   (selling services that customers can book while on vacation), but   revenue declined in the hotels, media, and platform segment   (where TripAdvisor records click-based ad sales for its   partners). Overall, adjusted profits continued to increase, up about 10%   year over year, and adjusted pre-tax profits are expected to keep   growing in the double digits. Problem was, TripAdvisor said that   it might not be able to grow at the 15%-ish rate posted in this   year's first half, and it's probably that warning of near-term   slowing growth that spooked investors. What UBS had to say about that And yet, it's the underperformance in TripAdvisor shares that   arose from these investor fears, argues UBS, that makes the stock   look relatively more attractive today: \"On the back of that   underperformance, we upgrade TRIP from Sell to Neutral and see   the shares as having a more balanced risk/reward from current   levels,\" said the analyst, even as it cut its price target to   $40. Granted, UBS does caution that \"management commentary on   forward margin structure\" is still key to whether investors will   warm back up to the stock. And it's true that from one   perspective, shares still look pricey at a trailing P/E ratio of   38. Still, when valued on free cash flow, TripAdvisor stock looks   like it could actually be approaching bargain territory -- or   even have arrived there. Consider that over the past 12 months, the company has   generated positive free cash flow of $340 million -- more than   twice its reported income. When you compare this cash profit to   TripAdvisor's $5.2 billion market capitalization (adjusting for   its nearly $800 million in net cash on the balance sheet), the   stock actually costs only about 13 times trailing free cash flow.   I have to say that this is a pretty attractive valuation for a   company that says it's going to grow its profits in the double   digits this year. The upshot for investors Indeed, the longer-term valuation on TripAdvisor shares could   be even better than this. According to      S&P Global Market Intelligence    , the consensus among analysts who follow the company is tha   t earnings    over the next five years could grow at better than 15% annually   -- and in the medium term, the valuation looks better still. From $0.81 per share earned in 2018, analysts forecast that   TripAdvisor could grow its earnings to $1.61 by 2021 -- roughly   doubling its profit in just three years, with continued strong   growth expected in the years beyond 2021. Based on all these numbers, I have to agree with UBS that with   TripAdvisor valued at a mere 13 times free cash flow, the odds   are now shifting to favor an investment in the stock. In fact, if   you ask me, it may already be cheap enough to buy.   10 stocks we like better than TripAdvisor       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and TripAdvisor wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Rich Smith      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends TripAdvisor. The Motley Fool has     a     disclosure policy      .  ",
    " Every day, Wall Street analysts upgrade some stocks,     downgrade others, and \"initiate coverage\" on a few more. But do     these analysts even know what they're talking about? Today,     we're taking one high-profile Wall Street pick and putting it     under the microscope... ",
    "Travel research website operator   TripAdvisor    (NASDAQ: TRIP) reported disappointing   fiscal Q2 earnings    last month, and the share price has continued to   weaken    ever since.",
    "TripAdvisor stock is now down a total of 14% since earnings   came out, and the numbers are even worse than that already   sounds. \"Over the past 6 months, TRIP has underperformed [the   S&P 500    ] by ~33%,\" as investment bank UBS points out today in a note on   StreetInsider.com    .",
    "And yet,   thanks    to this dramatic decline in stock price, UBS now believes that   the odds of TripAdvisor outperforming in the future have   improved. Here's what you need to know.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Before we get into the upgrade proper, it's worth taking a few   minutes to consider just what TripAdvisor said last month to   spark the post-earnings stock slump (and accelerate the slide   experienced over the last six months).",
    "As my fellow Fool.com contributor   Dan Caplinger    explained last month, TripAdvisor is in the midst of a major site   revamp, retooling its business from one focused almost   exclusively on providing travel reviews to one that can \"capture   more of the business that it now refers out to its partners\" (and   thus reward its shareholders with a greater portion of those   profits).",
    "The results so far, however, have been mixed.   Sales are growing     in the company's top priority of experiences and dining   (selling services that customers can book while on vacation), but   revenue declined in the hotels, media, and platform segment   (where TripAdvisor records click-based ad sales for its   partners).",
    "Overall, adjusted profits continued to increase, up about 10%   year over year, and adjusted pre-tax profits are expected to keep   growing in the double digits. Problem was, TripAdvisor said that   it might not be able to grow at the 15%-ish rate posted in this   year's first half, and it's probably that warning of near-term   slowing growth that spooked investors.",
    "And yet, it's the underperformance in TripAdvisor shares that   arose from these investor fears, argues UBS, that makes the stock   look relatively more attractive today: \"On the back of that   underperformance, we upgrade TRIP from Sell to Neutral and see   the shares as having a more balanced risk/reward from current   levels,\" said the analyst, even as it cut its price target to   $40.",
    "Granted, UBS does caution that \"management commentary on   forward margin structure\" is still key to whether investors will   warm back up to the stock. And it's true that from one   perspective, shares still look pricey at a trailing P/E ratio of   38. Still, when valued on free cash flow, TripAdvisor stock looks   like it could actually be approaching bargain territory -- or   even have arrived there.",
    "Consider that over the past 12 months, the company has   generated positive free cash flow of $340 million -- more than   twice its reported income. When you compare this cash profit to   TripAdvisor's $5.2 billion market capitalization (adjusting for   its nearly $800 million in net cash on the balance sheet), the   stock actually costs only about 13 times trailing free cash flow.   I have to say that this is a pretty attractive valuation for a   company that says it's going to grow its profits in the double   digits this year.",
    "Indeed, the longer-term valuation on TripAdvisor shares could   be even better than this. According to      S&P Global Market Intelligence    , the consensus among analysts who follow the company is tha   t earnings    over the next five years could grow at better than 15% annually   -- and in the medium term, the valuation looks better still.",
    "From $0.81 per share earned in 2018, analysts forecast that   TripAdvisor could grow its earnings to $1.61 by 2021 -- roughly   doubling its profit in just three years, with continued strong   growth expected in the years beyond 2021.",
    "Based on all these numbers, I have to agree with UBS that with   TripAdvisor valued at a mere 13 times free cash flow, the odds   are now shifting to favor an investment in the stock. In fact, if   you ask me, it may already be cheap enough to buy.",
    "  10 stocks we like better than TripAdvisor       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and TripAdvisor wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than TripAdvisor       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and TripAdvisor wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Rich Smith      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends TripAdvisor. The Motley Fool has     a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 12:17:47"
}