{
  "url": "https://www.nasdaq.com/article/us-stockswall-street-advances-as-china-extends-trade-olive-branch-20190911-00673",
  "title": "US STOCKS-Wall Street advances as China extends trade olive branch - Nasdaq.com",
  "text": [
    " (For a live blog on the U.S. stock market, click LIVE/ ortype LIVE/ in a news window)",
    "* Apple leads indexes higher ",
    "* China exempts 16 types of U.S. goods from tariffs",
    "* Indexes up: Dow 0.52%, S&P 500 0.45%, Nasdaq 0.79%  (Updates to late afternoon, changes dateline, byline)",
    "By Stephen Culp",
    "NEW YORK, Sept 11 (Reuters) - Wall Street was pushed higheron Wednesday by tariff-sensitive technology and industrialshares after China extended an olive branch ahead of nextmonth's trade negotiations with the United States. ",
    "Apple IncAAPL.O led the charge, buoying all three majorstock averages the day after it unveiled its latest iPhoneupgrade and announced the launch date of its Apple TV+ streamingservice. Its shares gained 2.6%, lifting the company's valueabove the $1 trillion mark.",
    "The blue-chip Dow was on course for its sixth straight dailyadvance. ",
    "China announced tariff exemptions for a basket of U.S.goods, a move viewed by many investors as a show of good faithjust days ahead of planned talks aimed at resolving thelong-running trade war, which has rattled markets and bruisedworld economies. urn:newsml:reuters.com:*:nL3N2621DV",
    "However, a senior White House adviser urged investors to bepatient in an effort to curb expectations for the trade talksscheduled to take place next month in Washington. urn:newsml:reuters.com:*:nL2N2611SF",
    "\"There's an element of improved trade optimism,\" said ChuckCarlson,  chief executive at Horizon Investment Services inHammond, Indiana. \"But the bigger element is what we've seenover the last few days where investors are more willing to putmore money into the value side of the equation.\"",
    "\"To see value (stocks) having some nice days speaks to thisidea of improving breadth in the market,\" Carlson added.  ",
    "In a series of morning tweets, President Donald Trump calledon the U.S. Federal Reserve to slash interest rates intonegative territory, a move typically seen as a last-ditch effortrevive sluggish economies. urn:newsml:reuters.com:*:nL2N26208B",
    "\"It's been this raging friction between Trump and the Fed,\"said Mark Luschini, chief investment strategist at JanneyMontgomery Scott in Philadelphia. \"At the moment the market ...still believes the Fed's going to act independently and notallow itself to be politicized regardless of what Trump may besaying or tweeting.\"",
    "Markets still expect the Fed to cut interest rates by 25basis points at the conclusion of its monetary policy meetingnext week.",
    "U.S. Treasury yields rose for the third straight sessionahead of the European Central Bank's (ECB) meeting. urn:newsml:reuters.com:*:nL2N2620FK",
    "The Dow Jones Industrial Average .DJI rose 139.52 points,or 0.52%, to 27,048.95, the S&P 500 .SPX gained 13.42 points,or 0.45%, to 2,992.81 and the Nasdaq Composite .IXIC added63.58 points, or 0.79%, to 8,147.73.",
    "Of the 11 major sectors in the S&P 500, all but energy .SPNY and real estate .SPLRCR were in the black.",
    "Chipmaker Micron Technology IncMU.O rose 2.0% afterLongbow Research upgraded the stock to \"buy.\" urn:newsml:reuters.com:*:nL3N2622HJ",
    "The Philadelphia SE Semiconductor Index .SOX was up 1.1%.",
    "Oilfield services firm Baker Hughes A GE CoBHGE.N saw thebiggest percentage drop in the S&P 500, falling 6.1%, followingnews that parent General ElectricGE.N would sell $3 billionin Baker Hughes shares, resulting in a loss of GE's majoritystake. urn:newsml:reuters.com:*:nL3N2613UN",
    "Positive trade news sent shares of Boeing CoBA.N 3.4%higher, providing the biggest boost to the Dow. The planemakeris the largest U.S. exporter by dollar value. ",
    "Advancing issues outnumbered declining ones on the NYSE by a2.18-to-1 ratio; on Nasdaq, a 2.75-to-1 ratio favored advancers.",
    "The S&P 500 posted 22 new 52-week highs and no new lows; theNasdaq Composite recorded 47 new highs and 11 new lows.  ",
    " (Reporting by Stephen Culp; additional reporting by SineadCarew) ((stephen.culp@thomsonreuters.com; 646-223-6076;))"
  ],
  "published_datetime": "2019-09-11 02:27:00"
}