{
  "url": "https://www.nasdaq.com/article/eu-to-help-its-firms-workers-farmers-in-case-of-nodeal-brexit--doc-20190903-01206",
  "title": "EU to help its firms, workers, farmers in case of no-deal Brexit - doc - Nasdaq.com",
  "text": [
    "By Jan Strupczewski",
    "BRUSSELS, Sept 3 (Reuters) - The European Commission on Wednesday will propose financial help for European Union businesses, workers and farmers if Britain crashes out of the bloc without any agreement, a document seen by Reuters said.",
    "British members of parliament on Tuesday triggered a vote that could allow them to stop Prime minister Boris Johnson pursuing a \"no-deal\" Brexit, a challenge that the government warned would prompt the prime minister to seek an election on Oct. 14.",
    "On Wednesday, the EU executive arm will propose, as part of the EU's preparation for the worst \"no-deal\" scenario, using the European Solidarity Fund, normally used to help victims of natural disasters in the EU, to cushion the financial blow for some EU countries most exposed to trade with Britain.",
    "The Commission also wants to use the European Globalisation Adjustment Fund, created to help EU workers who lose jobs due to globalisation, to be used for those dismissed after a \"no-deal\" crashing out, the document said.",
    "The Commission, which is in charge of managing Britain's already twice-delayed exit from the bloc, will also propose to use all existing instruments for market support and direct financial support to EU farmers to the mitigate worst impacts of a no-deal on food markets.",
    "The EU's state aid rules, regulating how governments can help companies, \"offered flexible solutions for national support measures\" for smaller EU companies with large exposure to Britain, in case of a no-deal, it said.",
    "The Commission will say that it was still working with Ireland to find a way to avoid building a physical border on the island of Ireland and at the same time protect the EU single market under a no-deal scenario.",
    "But it also said that the only way to do that was to use the existing solution of the \"Irish backstop\" in the withdrawal agreement negotiated with the EU by Britain's previous government, and thrice since rejected the British parliament.",
    "The Commission will reiterate that a divorce between Britain and the EU without a deal would have a serious negative economic impact on both, but much greater on Britain. Nor would there be any transition period for economies to prepare and adjust.",
    "The Commission will say that if London were to choose the no-deal option, the EU would only be ready to discuss future ties with Britain once it addressed the issue of the rights of EU citizens who arrived in Britain before Brexit. These are now regulated by the withdrawal agreement rejected by British MPs.",
    "The United Kingdom would also have to honour its financial obligations to the EU, and preserve the Good Friday Agreement that brought peace to the island of Ireland after decades of sectarian violence.",
    "Britain would also have to preserve the integrity of the EU single market, the Commission will say. Both issues have been dealt with in the rejected divorce agreement.",
    "To facilitate expert advice and coordination among EU governments in case of a no-deal Brexit, the Commission will set up a call centre and a hotline telephone number available in all 27 EU countries and all EU languages."
  ],
  "published_datetime": "2019-09-03 16:19:00"
}