{
  "url": "https://www.nasdaq.com/article/concho-resources-to-sell-new-mexico-assets-for-925-mln-20190903-00330",
  "title": "Concho Resources to sell New Mexico assets for $925 mln - Nasdaq.com",
  "text": [
    "By Shanti S Nair",
    "Sept 3 (Reuters) - U.S. oil and gas producer Concho Resources Inc  said on Tuesday it would sell a portion of its New Mexico assets for $925 million to KKR-backed Spur Energy Partners LLC and plans to use the money to lower its debt and buyback shares.",
    "The deal is the latest in the sector as oil and gas producers have been divesting non-core assets amid investor pressure to shore up their cash reserves for buybacks and dividends.",
    "The company, the top oil producer in New Mexico, also said in a post earnings conference call in August that it did not plan to allocate capital to the assets for the next five years.",
    "MUFG Securities Americas analyst Michael McAllister said while the sale isn't a \"game changer\" for Concho, it was a good deal as the company wasn't going to put much money into its New Mexico assets for a few years.",
    "The assets, a narrow strip of about 100,000 gross acres bordering Concho's operations in the Delaware basin, produce about 25,000 barrels of oil equivalent per day (boepd), the company said in a statement.",
    "Analysts at Capital One Securities said the offer price was \"solid\", adding that such non-core property sales would help the lower the company's cash operating expense, currently at $9.83 per barrel of oil equivalent.",
    "The proceeds from the deal will be used to pay down debt and initiate the share repurchase program of up to $1.5 billion, the company said. ",
    "However, analysts at SunTrust Robinson Humphrey said Concho would need to show clear progress in its targeted cost goals before \"truly regaining credibility with the Street\" and questioned if the sale was the optimal longer term strategy.",
    "The company's stock has already fallen more than 25% since it missed profit estimates for the third time in a row on July 31, leading to several brokerage cutting their price targets.",
    "Shares of Concho were down 2.4% at $71.44 amid a broader sell off in energy stocks as oil prices tumbled on rising OPEC and Russian oil output as well as the protracted U.S.-China trade dispute.",
    "RBC Richardson Barr served as financial adviser to Concho on the sale, expected to close in November."
  ],
  "published_datetime": "2019-09-03 07:35:00"
}