{
  "url": "https://www.nasdaq.com/article/brazil-court-rules-uber-drivers-are-freelancers-not-employees-20190904-01169",
  "title": "Brazil court rules Uber drivers are freelancers, not employees - Nasdaq.com",
  "text": [
    "BRASILIA, Sept 4 (Reuters) - A Brazilian high court has ruled that Uber  drivers are not employees of the mobile ride-hailing company, a decision that bolsters its business model in its second-largest market.",
    "The ruling by Superior Court of Justice, known as STJ, Brazil's second-highest court, was taken last week and published on Wednesday. It was the first time a Brazilian superior court has ruled on the issue, setting an interpretation likely to influence future court decisions related to similar apps.",
    "\"The app's drivers have no hierarchical relation with the Uber company because their services are provided now and then, with no pre-established timetable and they do not have a fixed salary,\" according to the unanimous ruling.",
    "Similar debates have raged in other Uber markets, including Britain, where courts have found that drivers are employees, and the United States, where a California court made it harder for Uber and other technology platforms to argue their drivers are independent contractors. ",
    "The court added that technological tools now available allow for new forms of economic interaction in which the drivers act as individual business people not employed by the owner of the platform.",
    "The case arrived at the STJ after a driver sued Uber in  Minas Gerais state, seeking damages for lost income after the ride hailing company closed his account with it.",
    "One local court said the case was a labor relations issue, indicating that he was an Uber employee, but a second court tasked specifically with handling labor cases took the opposite point of view, a decision now upheld by the superior court.",
    "Uber welcomed the decisions and said in a statement that it upheld labor court rulings in more that 250 cases that there is no labor relation between its \"partner drivers\" and the company.",
    "\"The decision reaffirms that they are individual micro-entrepreneurs who use the platforms to carry out their economic activity,\" Uber said."
  ],
  "published_datetime": "2019-09-04 06:28:00"
}