{
  "url": "https://www.nasdaq.com/article/dont-blink-or-youll-miss-vertexs-next-move-and-its-bound-to-be-a-good-one-cm1207666",
  "title": "Don’t Blink or You’ll Miss Vertex’s Next Move, And It’s Bound to Be a Good One - Nasdaq.com",
  "text": [
    " Some pundits advise against pharma, at least for the short   term. Business Standard describes pharma vehicles as laggards   over the past year, with an average return of only 1.74% and   returns of 4.9% compounded annually over the past five years. It would seem, however, that   Vertex Pharmaceuticals    (NASDAQ: VRTX) is paying no attention to such invectives. As if   in defiance, the company's moves over recent weeks and months   could be likened to a surgical chess game designed to silence its   critics. If you haven't been paying attention, here are the   developments on the Vertex vortex.   Image Source: Getty ImagesmakeArticleAd();   Strategic acquisitions, partnerships, and lucrative     licenses  The onslaught began in earnest in January when the company   made a deal that focused on gene editing with Arbor   Biotechnologies. Then, in May, the company announced a   partnership to further pursue protein degradation with Kymera   Therapeutics. Kymera will invest $70 million upfront for a   four-year research and development collaboration targeting   serious diseases. As part of the agreement, Kymera will perform   the research activities, but Vertex can license the program and   stands to benefit from a package of milestones that could total   more than $1 billion. In June, Vertex invested $420 million to further explore the   muscular dystrophy space. A deal was expanded with   CRISPR Therapeutics    for $175 million, and $245 million was used to acquire Exonics   and its gene-editing pipeline.  A cure for type 1 diabetes could be a long     haul  Most notably, in early September, Vertex acquired Semma   Therapeutics for   $950 million    . This news caused waves as it marks the company's first forays   into finding a cure for type 1 diabetes. This serious disease is   inadequately controlled by existing therapies, and there is a   huge demand for treatment. O.K. So, we know that it's very early to get too excited about   a potential winner on the type 1 diabetes front for Vertex;   Vertex has not yet even begun clinical studies. But the company   is wise enough not to rely on just one move in its overall   strategy. The company has many irons in many fires, all of which   are staying hot. Vertex has been a leader in   cystic fibrosis    drugs and has a triple-drug combo that is likely to see FDA   approval in March next year. The company is also advancing an   experimental AATD drug VX-814 into a phase 2 clinical study for   patients with two Z mutations. Data should also come next year.   The company is also involved in early stage studies for its   therapies targeting beta-thalassemia, sickle cell disease, and   rare kidney disease APOL1-mediated focal segmental   glomerulosclerosis (FSGS). Can Vertex sustain its bold and risky onslaught? A stock   buyback seems to indicate so.  Stoked confidence and stock buybacks  With barely any room to breathe, on July 31, Vertex's   pocketbook was further emptied by an announcement for a $500   million stock buyback - a sure sign that the company feels its   stock is undervalued despite considerable spending and   investment. A look at the financials would seem to support   Vertex's musings. The company has a strong debt-to-equity ratio at 0.12, which   compares well with competitors   Illumina Inc.    at 0.42 and   Alexion Pharmaceuticals Inc    . at 0.26. The company has projected EPS growth of 12.28%   compared to 10.81% and clear capability of meeting stockholder   payouts with a current ratio of 3.74 versus the industry average   of 5.4. Zacks ranks the stock a buy and ranks it third out of 16   in the biotech sector. The lates   t earnings    report in late July showed quarterly earnings of $1.26 per share,   which beat the Zacks Consensus Estimate of $1.03 per share, and   compares to earnings of $0.94 per share a year ago. Also, the   company has exceeded EPS estimates each time for the past four   quarters and has done the same for revenues. Vertex posted   revenues of $941.29 million for the quarter ended June 2019,   surpassing the Zacks Consensus Estimate by 6.52%. Year-ago   revenues were $752.16 million. With numbers like these, if you feel like dipping your toes in   the fast-flowing biotech waters or watching a stellar game of   chess among fierce biotech players, Vertex might be a good   bet.   10 stocks we like better than Vertex     Pharmaceuticals       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Vertex Pharmaceuticals     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Caroline Banton      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Illumina. The Motley Fool owns     shares of CRISPR Therapeutics. The Motley Fool recommends     Vertex Pharmaceuticals. The Motley Fool has a     disclosure policy      .  ",
    "Some pundits advise against pharma, at least for the short   term. Business Standard describes pharma vehicles as laggards   over the past year, with an average return of only 1.74% and   returns of 4.9% compounded annually over the past five years.",
    "It would seem, however, that   Vertex Pharmaceuticals    (NASDAQ: VRTX) is paying no attention to such invectives. As if   in defiance, the company's moves over recent weeks and months   could be likened to a surgical chess game designed to silence its   critics. If you haven't been paying attention, here are the   developments on the Vertex vortex.",
    "  Image Source: Getty ImagesmakeArticleAd(); ",
    "Image Source: Getty Images",
    "The onslaught began in earnest in January when the company   made a deal that focused on gene editing with Arbor   Biotechnologies. Then, in May, the company announced a   partnership to further pursue protein degradation with Kymera   Therapeutics. Kymera will invest $70 million upfront for a   four-year research and development collaboration targeting   serious diseases. As part of the agreement, Kymera will perform   the research activities, but Vertex can license the program and   stands to benefit from a package of milestones that could total   more than $1 billion.",
    "In June, Vertex invested $420 million to further explore the   muscular dystrophy space. A deal was expanded with   CRISPR Therapeutics    for $175 million, and $245 million was used to acquire Exonics   and its gene-editing pipeline.",
    "Most notably, in early September, Vertex acquired Semma   Therapeutics for   $950 million    . This news caused waves as it marks the company's first forays   into finding a cure for type 1 diabetes. This serious disease is   inadequately controlled by existing therapies, and there is a   huge demand for treatment.",
    "O.K. So, we know that it's very early to get too excited about   a potential winner on the type 1 diabetes front for Vertex;   Vertex has not yet even begun clinical studies. But the company   is wise enough not to rely on just one move in its overall   strategy. The company has many irons in many fires, all of which   are staying hot.",
    "Vertex has been a leader in   cystic fibrosis    drugs and has a triple-drug combo that is likely to see FDA   approval in March next year. The company is also advancing an   experimental AATD drug VX-814 into a phase 2 clinical study for   patients with two Z mutations. Data should also come next year.   The company is also involved in early stage studies for its   therapies targeting beta-thalassemia, sickle cell disease, and   rare kidney disease APOL1-mediated focal segmental   glomerulosclerosis (FSGS).",
    "Can Vertex sustain its bold and risky onslaught? A stock   buyback seems to indicate so.",
    "With barely any room to breathe, on July 31, Vertex's   pocketbook was further emptied by an announcement for a $500   million stock buyback - a sure sign that the company feels its   stock is undervalued despite considerable spending and   investment. A look at the financials would seem to support   Vertex's musings.",
    "The company has a strong debt-to-equity ratio at 0.12, which   compares well with competitors   Illumina Inc.    at 0.42 and   Alexion Pharmaceuticals Inc    . at 0.26. The company has projected EPS growth of 12.28%   compared to 10.81% and clear capability of meeting stockholder   payouts with a current ratio of 3.74 versus the industry average   of 5.4. Zacks ranks the stock a buy and ranks it third out of 16   in the biotech sector.",
    "The lates   t earnings    report in late July showed quarterly earnings of $1.26 per share,   which beat the Zacks Consensus Estimate of $1.03 per share, and   compares to earnings of $0.94 per share a year ago. Also, the   company has exceeded EPS estimates each time for the past four   quarters and has done the same for revenues. Vertex posted   revenues of $941.29 million for the quarter ended June 2019,   surpassing the Zacks Consensus Estimate by 6.52%. Year-ago   revenues were $752.16 million.",
    "With numbers like these, if you feel like dipping your toes in   the fast-flowing biotech waters or watching a stellar game of   chess among fierce biotech players, Vertex might be a good   bet.",
    "  10 stocks we like better than Vertex     Pharmaceuticals       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Vertex Pharmaceuticals     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Vertex     Pharmaceuticals       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Vertex Pharmaceuticals     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Caroline Banton      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Illumina. The Motley Fool owns     shares of CRISPR Therapeutics. The Motley Fool recommends     Vertex Pharmaceuticals. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:39:00"
}