{
  "url": "https://www.nasdaq.com/article/will-world-of-warcraft-classic-rejuvenate-activision-blizzards-stock-cm1206869",
  "title": "Will \"World of Warcraft: Classic\" Rejuvenate Activision Blizzard's Stock? - Nasdaq.com",
  "text": [
    "The advent of free-to-play titles like PlayerUnknown's Battlegrounds(PUBG) and Fortnite: Battle Royale led to uncertain times for the video game industry, with veteran players and newcomers alike flocking to games in the new battle royale genre. No company has felt that migration more keenly than Activision Blizzard (NASDAQ: ATVI) . After hitting all-time highs just over a year ago, its stock went on to lose more than half its value (though it's currently down by about 39%) a slide that pushed the company into value stock territory .",
    "Last week, Activision released World of Warcraft: Classic , a reboot of a fan-favorite version of the online fantasy role-playing game to commemorate the title's 15th anniversary. Its reception among gamers has been nothing short of phenomenal, and that enthusiastic response has given investors a much-needed boost of confidence that the worst may be over for the video game publisher.",
    "Image source: Activision Blizzard.",
    "The relaunch of the popular 2006 version of the game, Drums of War , was released to subscribers on Aug. 26, and nostalgic gamers flocked to the site, overwhelming servers, resulting in hours-long waits to log in.",
    "World of Warcraft: Classic set a launch day record for the number of concurrent viewers on Twitch, the Amazon.com  platform where video game aficionados watch other gamers play via live-stream. On that first day, more than 6.1 million unique viewers tuned in, with as many as 1.1 million watching the proceedings at the same time.",
    "These are clear indications that the game is going far better than Activision Blizzard had hoped for, which bodes well for the company's future.",
    "One of Activision's more telling metrics recently has been monthly active users (MAUs), which have generally trended downward over the past couple of years. After peaking to close out 2017, MAUs in the company's Blizzard and Activision segments combined have fallen by more than 27%, though they managed a slight rebound toward the end of last year.",
    "The falling user base has resulted in lackluster revenues. In the company's most recent quarter , total monthly active users fell to 327 million -- their lowest level in more than three years -- and revenue slid 15% year over year.",
    "Piper Jaffray analyst Michael Olson chimed in on the impact of the successful game release. \"So far, it appears interest is really strong,\" he wrote. \" World of Warcraft Classic is another piece of incremental revenue to layer into late 2019 and into 2020 that could result in accelerating revenue growth for Activision Blizzard.\"",
    "Because the game is subscriber-based, attracting new players significantly impacts its incremental revenue and profitability. If the company adds several million World of Warcraft players due to interest generated by the Classic release, it would boost Activision's bottom line results significantly.",
    "Earlier this year, Activision Blizzard embarked on a massive restructuring aimed at reinvigorating player engagement in the company's key titles. It revealed plans to expand the number of developers on its most important franchises by 20%, which will result in more up-front releases, in-game content, and mobile and geographic expansion.",
    "World of Warcraft is one of those key titles, and Activision has additional plans for the game's anniversary celebration, including limited-time bonuses, commemorative in-game achievement opportunities, and more. The company says further announcements about those will be made in the coming weeks.",
    "Activision previously warned investors that one byproduct of the restructuring would be that new content would be released on a slower schedule in 2019 than it was in previous years, which would weigh on the company's financial results for a time.",
    "That said, investors might be willing to give the game publisher some additional leeway if it becomes clear that the company's focus on its key titles is beginning to bear fruit. If the reception of World of Warcraft: Classic is any indication of what's to come, Activision is off to a good start, and may be on the road to recovery.",
    "10 stocks we like better than Activision Blizzard\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Activision Blizzard wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "John Mackey, CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Danny Vena owns shares of Activision Blizzard and AMZN and has the following options: long January 2021 $22.50 calls on Activision Blizzard. The Motley Fool owns shares of and recommends Activision Blizzard and AMZN. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:00:00"
}