{
  "url": "https://www.nasdaq.com/article/tesla-tsla-wins-10-tax-exemption-on-chinas-vehicle-sales-cm1207283",
  "title": "Tesla (TSLA) Wins 10% Tax Exemption on China's Vehicle Sales - Nasdaq.com",
  "text": [
    " It seems that Elon Musk's charisma during his recent two-day tour to China has paid off well, as Tesla, Inc. TSLA  won exemption from 10% purchase tax on vehicle sales in China. Reportedly, the tax break was announced the same day Tesla's enigmatic leader Musk met Chinese Transport Minister Li Xiaopeng. The tax reprieve to one of America's high-profile company comes as a pleasant surprise amid the escalating U.S.-Sino trade war tiff, wherein Beijing plans to impose 25% tariff on U.S. cars and 5% on auto parts, effective Dec 15, 2019. The exemption is designed to benefit electric cars, primarily those manufactured in China. According to CNN Business, 34 carmakers were on the exemption list. This mainly applies to cars made by joint ventures between Chinese and foreign firms, like Daimler AG DDAIF  and Toyota Motor TM  . The only foreign manufacturer that was granted an exemption on its own was Tesla. The tax break will lower the price that customers have to pay for Model 3, Model S or Model X Tesla cars. On an average, the exemption will reduce the cost of buying new Tesla car by 99,000 yuan. Amid the tit-for-tat tariff   fight between the United States and China, along with a decline in the yuan, Tesla had already lifted vehicle prices in China last Friday. The U.S. auto giant is reportedly mulling to hike prices again in December, if China follows through its plans to reimpose 25% tariff on U.S. cars and 5% on auto parts, which it had discontinued in April. While Tesla has ambitious plans to start production in China, it currently depends on California to produce vehicles for the world's largest car market. Tesla plans to start production in the country, once it completes the Gigafactory 3 plant's construction in Shanghai. This will be Tesla's first factory outside the United States and marks the first time China has allowed a foreign carmaker to set up a facility without a local partner.  Zacks Rank and A Key Pick  Tesla, which currently carries a Zacks Rank #4 (Sell), reported wider-than-expected loss in the last quarterly release. The firm faces numerous headwinds, including high expenses and production constraints. A better-ranked stock in the same  industry   is Fox Factory holding Corp. FOXF  , which has a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Tesla, Inc. (TSLA): Free Stock Analysis Report   Fox Factory Holding Corp. (FOXF): Free Stock Analysis Report   Daimler AG (DDAIF): Free Stock Analysis Report   Toyota Motor Corporation (TM): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "It seems that Elon Musk's charisma during his recent two-day tour to China has paid off well, as Tesla, Inc. TSLA  won exemption from 10% purchase tax on vehicle sales in China. Reportedly, the tax break was announced the same day Tesla's enigmatic leader Musk met Chinese Transport Minister Li Xiaopeng. The tax reprieve to one of America's high-profile company comes as a pleasant surprise amid the escalating U.S.-Sino trade war tiff, wherein Beijing plans to impose 25% tariff on U.S. cars and 5% on auto parts, effective Dec 15, 2019.",
    "The exemption is designed to benefit electric cars, primarily those manufactured in China. According to CNN Business, 34 carmakers were on the exemption list. This mainly applies to cars made by joint ventures between Chinese and foreign firms, like Daimler AG DDAIF  and Toyota Motor TM  . The only foreign manufacturer that was granted an exemption on its own was Tesla.",
    "The tax break will lower the price that customers have to pay for Model 3, Model S or Model X Tesla cars. On an average, the exemption will reduce the cost of buying new Tesla car by 99,000 yuan.",
    "Amid the tit-for-tat tariff   fight between the United States and China, along with a decline in the yuan, Tesla had already lifted vehicle prices in China last Friday. The U.S. auto giant is reportedly mulling to hike prices again in December, if China follows through its plans to reimpose 25% tariff on U.S. cars and 5% on auto parts, which it had discontinued in April.",
    "While Tesla has ambitious plans to start production in China, it currently depends on California to produce vehicles for the world's largest car market. Tesla plans to start production in the country, once it completes the Gigafactory 3 plant's construction in Shanghai. This will be Tesla's first factory outside the United States and marks the first time China has allowed a foreign carmaker to set up a facility without a local partner.",
    " Zacks Rank and A Key Pick ",
    "Tesla, which currently carries a Zacks Rank #4 (Sell), reported wider-than-expected loss in the last quarterly release. The firm faces numerous headwinds, including high expenses and production constraints.",
    "A better-ranked stock in the same  industry   is Fox Factory holding Corp. FOXF  , which has a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:22:00"
}