{
  "url": "https://www.nasdaq.com/article/why-nordstrom-stock-was-gaining-today-cm1208168",
  "title": "Why Nordstrom Stock Was Gaining Today - Nasdaq.com",
  "text": [
    "  What happened  Shares of   Nordstrom    (NYSE: JWN) were moving higher today, rising in tandem with the   broader market and the retail sector on news that the U.S. and   China had scheduled trade talks for early October. There was no direct news out on the high-end retailer, but the   stock was up 6.2% nonetheless as of 10:50 a.m. EDT, since it's   proven to be one of the   retail stocks    that are more sensitive to tariff-related news. At the same time,   the   S&P 500    was up 1.4%, and the   SPDR S&P Retail ETF    (NYSEMKT: XRT) had gained 3.4%.   A mock-up of the new Nordstrom store in New York. Image     source: Nordstrom.makeArticleAd();   So what  Retail stocks, including Nordstrom, have been whipped back and   forth by developments in trade talks between the U.S. and China   as the news seems to change every week. Today, it was a positive   development, though any shift in the relationship has almost   always been fleeting. China said this morning that it would send trade   representatives to Washington in early October to hold high-level   trade talks after a successful phone call between officials from   the two countries. The news offers investors hope of a thaw in trade relations   even as the U.S. placed 15% tariffs on one group of Chinese goods   at the beginning of this month and plans to raise existing   tariffs from 25% to 30% on Oct. 1.  Now what  The announcement is lifting Nordstrom stock, and at this   point, the company can use all the help it can get. The stock has   been battered as sales have suddenly slowed and growth has   reversed, a sign that the retailer may be succumbing to the same   forces in the changing sector that have buffeted its department   store peers. As a high-end retailer, Nordstrom would be more sensitive to a   recession, which an inflamed trade war could cause, than some of   its downmarket competitors. The company is also opening its   flagship women's store    in New York next month, expected to be its biggest by sales   volume, and a downturn could spoil that highly anticipated   opening. Like most U.S. retailers, Nordstrom also imports a substantial   percentage of its merchandise from China. While a resolution to the trade war alone won't save the   company, increasing tariffs are only going to make its chances at   a recovery more difficult. Today's news is nothing worth   celebrating, but for now, it's a step in the right direction for   Nordstrom investors.   10 stocks we like better than Nordstrom       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Nordstrom wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Jeremy Bowman      owns shares of Nordstrom. The Motley Fool recommends Nordstrom.     The Motley Fool has a     disclosure policy      .  ",
    "Shares of   Nordstrom    (NYSE: JWN) were moving higher today, rising in tandem with the   broader market and the retail sector on news that the U.S. and   China had scheduled trade talks for early October.",
    "There was no direct news out on the high-end retailer, but the   stock was up 6.2% nonetheless as of 10:50 a.m. EDT, since it's   proven to be one of the   retail stocks    that are more sensitive to tariff-related news. At the same time,   the   S&P 500    was up 1.4%, and the   SPDR S&P Retail ETF    (NYSEMKT: XRT) had gained 3.4%.",
    "  A mock-up of the new Nordstrom store in New York. Image     source: Nordstrom.makeArticleAd(); ",
    "A mock-up of the new Nordstrom store in New York. Image     source: Nordstrom.",
    "Retail stocks, including Nordstrom, have been whipped back and   forth by developments in trade talks between the U.S. and China   as the news seems to change every week. Today, it was a positive   development, though any shift in the relationship has almost   always been fleeting.",
    "China said this morning that it would send trade   representatives to Washington in early October to hold high-level   trade talks after a successful phone call between officials from   the two countries.",
    "The news offers investors hope of a thaw in trade relations   even as the U.S. placed 15% tariffs on one group of Chinese goods   at the beginning of this month and plans to raise existing   tariffs from 25% to 30% on Oct. 1.",
    "The announcement is lifting Nordstrom stock, and at this   point, the company can use all the help it can get. The stock has   been battered as sales have suddenly slowed and growth has   reversed, a sign that the retailer may be succumbing to the same   forces in the changing sector that have buffeted its department   store peers.",
    "As a high-end retailer, Nordstrom would be more sensitive to a   recession, which an inflamed trade war could cause, than some of   its downmarket competitors. The company is also opening its   flagship women's store    in New York next month, expected to be its biggest by sales   volume, and a downturn could spoil that highly anticipated   opening.",
    "Like most U.S. retailers, Nordstrom also imports a substantial   percentage of its merchandise from China.",
    "While a resolution to the trade war alone won't save the   company, increasing tariffs are only going to make its chances at   a recovery more difficult. Today's news is nothing worth   celebrating, but for now, it's a step in the right direction for   Nordstrom investors.",
    "  10 stocks we like better than Nordstrom       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Nordstrom wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Nordstrom       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Nordstrom wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Jeremy Bowman      owns shares of Nordstrom. The Motley Fool recommends Nordstrom.     The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:38:00"
}