{
  "url": "https://www.nasdaq.com/article/rwe-raises-possibility-of-selling-4-bln-euro-eon-stake-after-asset-swap-20190911-00623",
  "title": "RWE raises possibility of selling 4 bln euro E.ON stake after asset swap - Nasdaq.com",
  "text": [
    "By Vera Eckert",
    "MUNICH, Sept 11 (Reuters) - German utility RWE  could look into selling the 16.7% stake in E.ON  it will acquire after an asset swap with its rival which will restructure Germany's energy industry, RWE's chief financial officer said.",
    "CFO Markus Krebber told Reuters that the windfall from any future sale of the stake, which analysts value at up to 4 billion euros ($4.4 billion), would be invested in remaining businesses focused on renewables, remaining fossil fuels and energy trading.",
    "\"We will look carefully into our market positions in each country and how to strengthen these, and we have financial flexibility,\" Krebber said during a conference in Munich.",
    "RWE is currently focused on coal-fired power plants but Germany has vowed to phase out nuclear and coal energy and is pushing for renewables.",
    "To be successful in renewable energy it was important to be diversified across regions and technologies, Krebber said.",
    "The pending deal entails carving up RWE subsidiary Innogy  and transforming RWE into Europe's third biggest renewable operator.",
    "RWE could look at making small renewable acquisitions in some of the countries it operates in, Krebber said.",
    "\"Don't expect giant transactions, but we want to grow in renewables and that wish entails keeping such options open,\" he said, declining to specify targets.",
    "RWE through the deal will bring installed renewable capacity to 9 gigawatts (GW) with an especially strong offshore wind portfolio which it plans to expand in core and overseas markets.",
    "It will become the number two in offshore wind globally and operate Europe's fourth biggest gas plant fleet.",
    "It plans to spend 1.5 billion euros a year to grow its portfolio, it has said.",
    "RWE expects by the end-of-year or early 2020 to complete a compensation deal it is negotiating with the government for closing coal-fired generation plants, Krebber said.",
    "He wants 1.2-1.5 billion euros per GW of closed capacity, in order to account for payments to affected workers and renaturising land in coal mining and burning regions.",
    "\"It is not about making a profit but to be reimbursed for increased expenses...,\" he said.",
    "RWE expects to have to shut 3 GW up to 2023 and shed 2,700 workers.",
    "Krebber reiterated RWE will hold on to a 25.1% stake in high-voltage power transmission grid Amprion.",
    "Two people familiar with the matter said on Tuesday that Amprion is evaluating options to bring in fresh funds to finance necessary spending on the networks.",
    "($1 = 0.9097 euros)"
  ],
  "published_datetime": "2019-09-11 12:00:00"
}