{
  "url": "https://www.nasdaq.com/article/heres-why-you-should-hold-regency-centers-reg-stock-now-cm1207956",
  "title": "Here's Why You Should Hold Regency Centers (REG) Stock Now - Nasdaq.com",
  "text": [
    "  Regency Centers Corp.  's REG  has a high-quality portfolio of shopping centers, located in favorable trade areas. The company's focus on grocery-anchored shopping centers, which are usually necessity driven, offer ample prospects to generate steady cash flows and drive long-term growth. Nevertheless, the company is not immune to the turbulent retail real estate space.  makeArticleAd();  Regency has a considerable experience in the retail real estate industry and has developed several retail real estate projects over the years. In fact, the company's $1 billion of development and redevelopment starts, over the last five years, are leading to significant value creation. Additionally, backed by its capabilities, the company expects to deliver $1.25-$1.50 billion in developments and redevelopments at attractive returns, over the next five years. Also, with 80% of its properties being anchored by leading grocers, the company has solid scope to generate steady cash flows.    Moreover, large pool of unencumbered assets and good relationships with lenders is a driving factor for the company. Its debt-maturity profile is well laddered with limited near-term maturities. The company also enjoys substantial liquidity and capacity, with $1.25 billion line of credit.    However, the retail real estate market is witnessing a shift in retail shopping from the brick-and-mortar stores to Internet sales. Particularly, the recent efforts of online retailers to go deeper into the grocery business have emerged as a concern for this REIT that focuses on building a premium portfolio of grocery-anchored shopping centers. Store closures and bankruptcies are becoming rampant.    The company has maintained its same-property NOI growth in the range of 2-2.5%, which is below its 3% strategic objective. This can be attributed to near-term headwinds associated with Sears locations, as well as a muted contribution from redevelopments in 2019.    Also, at the end of second-quarter 2019, the company had 23 properties in development or redevelopment, indicating estimated net project costs of approximately $474 million. Although increase in development and redevelopment projects pipeline is encouraging, it exposes the company to various risks such as rising construction costs, entitlement delays and lease-ups. Further, such initiatives involve significant upfront costs and dampen the margin until the properties get established.    Amid these, shares of Regency have lost 2.1% over the past three months as against the 0.9% rise of the industry  . The Zacks Consensus Estimate for current-year funds from operations (FFO) per share has been revised marginally downward to $3.84 in the past 30 days. Currently, the stock holds a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .        Key Picks    SITE Centers Corp. SITC  has been witnessing upward FFO estimate revisions for 2019, for the past 60 days. Moreover, this Zacks #2 Ranked (Buy) company has appreciated 28%, year to date.    KLEPIERRE SA's KLPEF  2019 earnings estimate has been revised marginally upward, over the past 60 days. Further, the company's shares have gained 1.5% in the year-to-date period. At present, it carries a Zacks Rank of 2.    Brixmor Property Group Inc.'s BRX  ongoing-year FFO estimate moved north in 60 days' time.  Additionally, the stock has appreciated 29.6%, so far this year. It currently holds a Zacks Rank of 2.     Note: FFO, a widely used metric to gauge the performance of REITs, is obtained after adding depreciation and amortization and other non-cash expenses to net income.   It's Illegal in 42 States, But Investors Will Make Billions Legally    In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.    That's twice as much as they spend on marijuana, legally or otherwise.    Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.   See these 5 \"sin stocks\" now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Regency Centers Corporation (REG): Free Stock Analysis Report   Brixmor Property Group Inc. (BRX): Free Stock Analysis Report   KLEPIERRE SA (KLPEF): Free Stock Analysis Report   SITE CENTERS CORP. (SITC): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Regency Centers Corp.  's REG  has a high-quality portfolio of shopping centers, located in favorable trade areas. The company's focus on grocery-anchored shopping centers, which are usually necessity driven, offer ample prospects to generate steady cash flows and drive long-term growth. Nevertheless, the company is not immune to the turbulent retail real estate space.  makeArticleAd();  Regency has a considerable experience in the retail real estate industry and has developed several retail real estate projects over the years. In fact, the company's $1 billion of development and redevelopment starts, over the last five years, are leading to significant value creation. Additionally, backed by its capabilities, the company expects to deliver $1.25-$1.50 billion in developments and redevelopments at attractive returns, over the next five years. Also, with 80% of its properties being anchored by leading grocers, the company has solid scope to generate steady cash flows.    Moreover, large pool of unencumbered assets and good relationships with lenders is a driving factor for the company. Its debt-maturity profile is well laddered with limited near-term maturities. The company also enjoys substantial liquidity and capacity, with $1.25 billion line of credit.    However, the retail real estate market is witnessing a shift in retail shopping from the brick-and-mortar stores to Internet sales. Particularly, the recent efforts of online retailers to go deeper into the grocery business have emerged as a concern for this REIT that focuses on building a premium portfolio of grocery-anchored shopping centers. Store closures and bankruptcies are becoming rampant.    The company has maintained its same-property NOI growth in the range of 2-2.5%, which is below its 3% strategic objective. This can be attributed to near-term headwinds associated with Sears locations, as well as a muted contribution from redevelopments in 2019.    Also, at the end of second-quarter 2019, the company had 23 properties in development or redevelopment, indicating estimated net project costs of approximately $474 million. Although increase in development and redevelopment projects pipeline is encouraging, it exposes the company to various risks such as rising construction costs, entitlement delays and lease-ups. Further, such initiatives involve significant upfront costs and dampen the margin until the properties get established.    Amid these, shares of Regency have lost 2.1% over the past three months as against the 0.9% rise of the industry  . The Zacks Consensus Estimate for current-year funds from operations (FFO) per share has been revised marginally downward to $3.84 in the past 30 days. Currently, the stock holds a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .      ",
    " Key Picks    SITE Centers Corp. SITC  has been witnessing upward FFO estimate revisions for 2019, for the past 60 days. Moreover, this Zacks #2 Ranked (Buy) company has appreciated 28%, year to date.    KLEPIERRE SA's KLPEF  2019 earnings estimate has been revised marginally upward, over the past 60 days. Further, the company's shares have gained 1.5% in the year-to-date period. At present, it carries a Zacks Rank of 2.    Brixmor Property Group Inc.'s BRX  ongoing-year FFO estimate moved north in 60 days' time.  Additionally, the stock has appreciated 29.6%, so far this year. It currently holds a Zacks Rank of 2.     Note: FFO, a widely used metric to gauge the performance of REITs, is obtained after adding depreciation and amortization and other non-cash expenses to net income.   It's Illegal in 42 States, But Investors Will Make Billions Legally    In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.    That's twice as much as they spend on marijuana, legally or otherwise.    Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "  See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:23:00"
}