{
  "url": "https://www.nasdaq.com/article/did-the-fda-just-signal-smooth-sailing-ahead-for-aimmune-therapeutics-cm1210824",
  "title": "Did the FDA Just Signal Smooth Sailing Ahead For Aimmune Therapeutics? - Nasdaq.com",
  "text": [
    "  Aimmune Therapeutics    (NASDAQ: AIMT) has for a long time been desensitizing people with   severe peanut allergies to their nemesis with AR101. In a   nutshell, U.S. regulators recently gave the candidate, to be   named Palforzia, a big push toward marketing approval and   blockbuster sales. This does not mean peanut butter and jelly sandwiches are   returning to our nation's schools, but it has made this   biotech stock    significantly more attractive. Here's what a complicated   briefing document    from the Food and Drug Administration (FDA) means for Aimmunne   shareholders, and what it doesn't mean.   Image source: Getty Images.makeArticleAd();  What's happening? On Friday, Sept. 13, 2019, the Food and Drug Administration   will bring together a group of independent physicians to talk   about Palforzia, formerly AR101. On Wednesday, Sept. 11, 2019,   the FDA finally released briefing documents that outline the   agency's concerns with Aimmune's application and they didn't   contain anything surprising. The FDA doesn't call together an advisory committee for every   new drug application that crosses its desks, but anything   different and controversial usually results in a meeting. Are you serious? I know it's hard to believe, but more than a few drugmakers   have misled investors about their communications with the FDA.   For example, the agency often suggests running a larger or longer   clinical trial before applying, and investors never hear about   it. Briefing documents for advisory committee meetings are usually   the first time investors learn about problems and expectations   the FDA made clear to the company long ago. Surprises, or at   least confirmations of suspicions, are common enough that a lack   of revelations was enough to send Aimmune   stock surging    .   Image source: Getty Images.  Why you shouldn't get too excited yet There's still a chance the advisory committee won't vote in   favor of approving Aimmune's application in its present form.   During the dose-escalation period of the pivotal study supporting   Palforzia's application, 6.1% of those given the peanut allergen   capsules experienced a reaction that required epinephrine use,   compared to 3.1% of the patients in the placebo group. The   separation grew during the maintenance period as the reaction   rate in the placebo group fell to 1.7% while the active arm   remained steady at 6.1%. Either the patients in the active arm felt invincible and   started eating with reckless abandon, or they continued reacting   strongly to the desensitization treatment despite months of   exposure. The briefing document also noted side-effects of   ingesting the allergen that they're allergic to led 14.3% of   adults to drop out early. Why Palforzia should be all right While there's an argument to be made that the risks associated   with Palforzia outweigh its protective benefit, it's important to   remember that food allergies affect 4% to 8% of children and 1%   and 2% of adults. Peanut allergy makes up the majority of all   severe food reactions, and there aren't any FDA approved   solutions yet. There are millions of people that could end up hospitalized or   worse after accidentally ingesting half a peanut, and it looks   like Aimmune's drug can safely reduce that risk for many, but   certainly not all of them.   Image source: Getty Images.  Most likely scenario Unless the advisory committee takes issue with something   unexpected, a positive recommendation for approval seems likely.   The FDA doesn't have to follow the committee's advice, but it   probably will with some caveats. Don't be surprised if the FDA grants Palforzia a   conditional    approval based on available data, and requires a long-term   outcome study for confirmation and full approval. There's also a   good chance the FDA will ask Aimmune to produce a risk evaluation   and mitigation strategy (REMS) before an approval. REMS are   hardly dealbreakers, but asking doctors to jump through extra   hoops in order to prescribe a drug doesn't make it any easier to   sell. A buy now? Following its recent bump, Aimmune's   market cap    has soared to $1.6 billion, which isn't a lot for a company with   a potential blockbuster this close to the finish line. Achieving   $1 billion in annual sales is still quite a long shot for Aimmune   if it tries to launch this drug on its own, and a lack of   interest so far from deep-pocketed partners suggests industry   insiders haven't seen anything compelling. Although smooth sailing to approval from the FDA seems likely,   it's way too early to predict a highly successful new drug   launch. Friday's advisory committee meeting should shine some   light on what kinds of restrictions Palforzia's   drug label    will include. Palforzia's the only candidate Aimmune has in late-stage   development, and the next drug coming through the pipeline, AR202   recently entered a   phase 2    egg allergy trial. If Palforzia isn't a commercial success, it   will be a long time before the company even has a chance to   produce another revenue stream. It's probably best to wait and   see which way the wind blows after Friday's advisory committee   meeting before making any decisions you could quickly regret.   10 stocks we like better than Aimmune     Therapeutics       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Aimmune Therapeutics     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Cory Renauer      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    " Aimmune Therapeutics    (NASDAQ: AIMT) has for a long time been desensitizing people with   severe peanut allergies to their nemesis with AR101. In a   nutshell, U.S. regulators recently gave the candidate, to be   named Palforzia, a big push toward marketing approval and   blockbuster sales.",
    "This does not mean peanut butter and jelly sandwiches are   returning to our nation's schools, but it has made this   biotech stock    significantly more attractive. Here's what a complicated   briefing document    from the Food and Drug Administration (FDA) means for Aimmunne   shareholders, and what it doesn't mean.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "On Friday, Sept. 13, 2019, the Food and Drug Administration   will bring together a group of independent physicians to talk   about Palforzia, formerly AR101. On Wednesday, Sept. 11, 2019,   the FDA finally released briefing documents that outline the   agency's concerns with Aimmune's application and they didn't   contain anything surprising.",
    "The FDA doesn't call together an advisory committee for every   new drug application that crosses its desks, but anything   different and controversial usually results in a meeting.",
    "I know it's hard to believe, but more than a few drugmakers   have misled investors about their communications with the FDA.   For example, the agency often suggests running a larger or longer   clinical trial before applying, and investors never hear about   it.",
    "Briefing documents for advisory committee meetings are usually   the first time investors learn about problems and expectations   the FDA made clear to the company long ago. Surprises, or at   least confirmations of suspicions, are common enough that a lack   of revelations was enough to send Aimmune   stock surging    .",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "There's still a chance the advisory committee won't vote in   favor of approving Aimmune's application in its present form.   During the dose-escalation period of the pivotal study supporting   Palforzia's application, 6.1% of those given the peanut allergen   capsules experienced a reaction that required epinephrine use,   compared to 3.1% of the patients in the placebo group. The   separation grew during the maintenance period as the reaction   rate in the placebo group fell to 1.7% while the active arm   remained steady at 6.1%.",
    "Either the patients in the active arm felt invincible and   started eating with reckless abandon, or they continued reacting   strongly to the desensitization treatment despite months of   exposure. The briefing document also noted side-effects of   ingesting the allergen that they're allergic to led 14.3% of   adults to drop out early.",
    "While there's an argument to be made that the risks associated   with Palforzia outweigh its protective benefit, it's important to   remember that food allergies affect 4% to 8% of children and 1%   and 2% of adults. Peanut allergy makes up the majority of all   severe food reactions, and there aren't any FDA approved   solutions yet.",
    "There are millions of people that could end up hospitalized or   worse after accidentally ingesting half a peanut, and it looks   like Aimmune's drug can safely reduce that risk for many, but   certainly not all of them.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Unless the advisory committee takes issue with something   unexpected, a positive recommendation for approval seems likely.   The FDA doesn't have to follow the committee's advice, but it   probably will with some caveats.",
    "Don't be surprised if the FDA grants Palforzia a   conditional    approval based on available data, and requires a long-term   outcome study for confirmation and full approval. There's also a   good chance the FDA will ask Aimmune to produce a risk evaluation   and mitigation strategy (REMS) before an approval. REMS are   hardly dealbreakers, but asking doctors to jump through extra   hoops in order to prescribe a drug doesn't make it any easier to   sell.",
    "Following its recent bump, Aimmune's   market cap    has soared to $1.6 billion, which isn't a lot for a company with   a potential blockbuster this close to the finish line. Achieving   $1 billion in annual sales is still quite a long shot for Aimmune   if it tries to launch this drug on its own, and a lack of   interest so far from deep-pocketed partners suggests industry   insiders haven't seen anything compelling.",
    "Although smooth sailing to approval from the FDA seems likely,   it's way too early to predict a highly successful new drug   launch. Friday's advisory committee meeting should shine some   light on what kinds of restrictions Palforzia's   drug label    will include.",
    "Palforzia's the only candidate Aimmune has in late-stage   development, and the next drug coming through the pipeline, AR202   recently entered a   phase 2    egg allergy trial. If Palforzia isn't a commercial success, it   will be a long time before the company even has a chance to   produce another revenue stream. It's probably best to wait and   see which way the wind blows after Friday's advisory committee   meeting before making any decisions you could quickly regret.",
    "  10 stocks we like better than Aimmune     Therapeutics       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Aimmune Therapeutics     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Aimmune     Therapeutics       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Aimmune Therapeutics     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Cory Renauer      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:01:00"
}