{
  "url": "https://www.nasdaq.com/article/explaineradvertising-execs-point-to-five-ways-google-stifles-business-20190911-00699",
  "title": "EXPLAINER-Advertising execs point to five ways Google stifles business - Nasdaq.com",
  "text": [
    "By Paresh Dave and Sheila  Dang",
    "SAN FRANCISCO/NEW YORK, Sept 11 (Reuters) - U.S. authorities investigating Alphabet Inc'sGoogle for anticompetitive behavior have recently begun probing the company's $116 billion-a-year advertising business.",
    "Attorneys general for 50 U.S. states and territories along with the U.S. Department of Justice appear to be acting on accusations from rivals, lawmakers and consumer advocacy groups that the biggest seller of online ads engages in unfair tactics. Google disputes its dominance. ",
    "Later, in response to this story, Google reiterated in that its services foster competition. ",
    "\"Our tools and platforms make it easy for advertisers and publishers of all sizes to choose whom they want to work with in this open, interconnected ad system,\" Google Vice President Sissie Hsiao wrote.",
    "Here are five common concerns about Google raised by 10 ad industry executives, most speaking on the condition of anonymity.",
    "SEARCH AND YOUTUBE",
    "About 80% of Google's ad revenue and most of its profits come from ads within Google search results, YouTube, Gmail and other internet services the company owns. Rivals say that Google controls these properties in a way that hinders advertising competition.",
    "For instance, the only technology system for buying ads on YouTube, the world's largest video streaming website, is Google's ad buying tool. Services such as Facebook Inc  maintain similar control, in part to limit too widely sharing users' data. But as YouTube increasingly dominates online video, rival tools for placing ads in video streams become less attractive to advertisers because they can only access smaller audiences.",
    "\"It's incredibly difficult to compete with the monopoly search and video sites,\" said Brian O'Kelley, founder and former CEO of ad tech company AppNexus, in an interview in June.",
    "ACQUISITIONS",
    "The remaining 20% of Google's ad revenue is from what is commonly referred to as its \"display business.\" Google boosted this operation by acquiring seller tools such as DoubleClick for $3.1 billion in 2008 and AdMob for $750 million in 2010 and then buyer services including Invite Media for a reported $81 million in 2010.",
    "The combination of deals gave Google unprecedented positioning in every facet of how ads end up on websites and smartphone apps around the world. Though U.S. regulators approved the deals, their worst-case predictions about Google being too powerful have come true, rivals say.",
    "To poach big customers from Google, smaller firms say they would need the cash to diversify their businesses and develop a complete suite of services. But drawing investment has been challenging because of the looming threats of Google and increased data privacy regulation.",
    "BUNDLING",
    "Google's variety of ad tools enable it to bundle them in a way that rivals say they cannot afford to match. For instance, websites and app owners, together known as publishers, over the years have become reliant on Google's DoubleClick ad serving tool. Nearly free to use for publishers, it is the only system of its kind that can receive real-time bids from Google's ads marketplace, known in the industry as AdX.",
    "The popular marketplace, which matches up ad buyers with publishers, is where Google collects high fees.",
    "Rivals said when using the Google ad-buying tool, advertisers get some key consumer data for free, early access to some purchasing options and potentially additional benefits if transacting through AdX. Google's packages for buyers and sellers to boost use of AdX are viewed as anticompetitive by rivals.",
    "\"The ubiquity of Google's ad server provides virtually total control over which ads are shown and monetized for the majority of the Internet,\" said Romain Job, chief strategy officer at competitor Smart AdServer. \"This control of the ad server is strategically critical to Google.\"",
    "LAST LOOK",
    "Google has allowed publishers using DoubleClick to sell ad space on various marketplaces, not just AdX. But for many years, Google's AdX widely held a special advantage: At the last second it could give its customers the opportunity to outbid competing advertisers trying to purchase through other, non-Google, marketplaces.",
    "This \"last look\" was one of several ways rivals allege Google favored itself. Google last week announced that the elimination of \"last look\" as part of move to a new sales system.",
    "But publishers and rivals still wonder whether Google may be using its vantage point over the whole ecosystem to keep prices down for advertisers and make itself outperform other marketplaces by analyzing their matchmaking strategies and copying them. Among specific concerns is that just being part of Google enables AdX to glean more information than rival exchanges about consumers, making AdX more attractive to advertisers.",
    "CHROME",
    "The newest area of concern is how Google may be using its Chrome internet browser, which has about 50% market share in the United States, to restrict most advertising systems, beside its own, from building profiles on consumers as they browse the web.",
    "The restrictions, many of which remain proposals subject to change, largely spare Google because consumers often sign into their Google accounts when using Chrome. That enables a form of tracking that it is not possible for ad tech firms that do not offer any services directly to users.",
    "Google has said its initiative is aimed at helping users curb tracking, as they demand greater privacy protections. Other browser makers have adopted more stringent restrictions, but Google has said its striving for a middle ground between violating users' privacy and violating antitrust rules."
  ],
  "published_datetime": "2019-09-11 03:23:00"
}