{
  "url": "https://www.nasdaq.com/article/7-best-fidelity-funds-for-2019-cm1206816",
  "title": "7 Best Fidelity Funds for 2019 - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "[Editor's note: This story was previously published in June 2019. It has since been updated and republished.]",
    "The best Fidelity funds for 2019 include a diversified set of mutual funds that can prepare your portfolio for volatility, rising interest rates and downside pressure on stocks. Fidelity offers dozens of actively-managed funds with above-average performance and below-average expense ratios.",
    "Fidelity also offers some of the lowest-cost index funds available in the mutual fund universe. This combination of choices makes Fidelity funds one of the best one-stop shops for mutual funds.",
    "Another distinction of Fidelity Investments is that some of its best funds concentrate on sectors, which may prove to be valuable for portfolio construction in 2019.",
    "So, if you're looking for the best mutual funds to own in 2019, you could build an entire portfolio for the year with these Fidelity funds.",
    "Expenses:  0.015%, or $1.50 for every $10,000 invested",
    "Formerly Fidelity Spartan 500 Index Investor Shares, the Fidelity 500 Index Fund (MUTF: FXAIX ) is a smart and extremely cheap way to get diversified access to large U.S. companies.",
    "FXAIX tracks the S&P 500 index, which includes stocks of over 500 of the largest U.S. companies like Apple (NASDAQ: AAPL ), Microsoft (NASDAQ: MSFT ), and Amazon (NASDAQ: AMZN ).",
    "While 2019 still may see more of the volatility and downside pressure on stocks like investors saw in the fourth quarter of 2018, FXAIX and similar S&P 500 index funds can be smart, core holdings for long-term investors.",
    "Expenses:  0.45%",
    "For your fixed income core holding in 2019, you'll need a low-cost, diversified total bond market fund like Fidelity Total Bond Fund (MUTF: FTBFX ).",
    "Although bond prices could see downside pressure from rising rates in 2019, a slowing economy can cause the Fed to continue to pause its rate-hike campaign.",
    "Two to three rate hikes are already priced in. If the Fed pauses after one or two rate hikes in 2019, long-term bonds will jump in price faster than short-term bonds.",
    "This uncertainty makes a diversified fund like FXAIX a wise fund to hold in 2019. The fund's portfolio covers the entire U.S. bond market.",
    "Expenses:  0.45%",
    "To help defend against interest rate risk in 2019, a smart complement to your core bond holding is Fidelity Short-Term Bond Fund (MUTF: FSHBX ).",
    "When interest rates are rising, bond funds that hold bonds with short average maturity tend to perform better than those with long average maturity. This is because demand for yesterday's lower-rate bonds decreases while demand for today's higher-rate bonds increases.",
    "Therefore, the longer the maturity, the greater the fall in price.",
    "FSHBX can either complement a core bond fund or it can potentially provide greater yields than money market funds.",
    "Expenses:  0.72%",
    "The health sector was a top performer in 2018 and its defensive qualities look to carry momentum through 2019.",
    "The best Fidelity fund to gain exposure to the health sector is  Fidelity Select Health Care Portfolio  (MUTF: FSPHX ). Since health sector funds make good defensive plays, FSPHX can provide downside protection should the market continue its downward trend during the year.",
    "The FSPHX portfolio has a healthy dose of biotech stocks, at about one-third allocation, and the remaining two-thirds is in other health sub-sectors like healthcare equipment, pharmaceuticals and managed care. Top holdings in FSPHX include UnitedHealth Group (NYSE: UNH ), Becton, Dickenson & Co (NYSE: BDX ), and Boston Scientific Corp (NYSE: BSX ).",
    "Expenses:  0.05%",
    "An inflationary environment in 2019 may prove to be good for Treasury inflation-protected securities, or TIPS, and funds that invest in them, such as  Fidelity Inflation-Protected Bond Index Fund  (MUTF: FIPDX ).",
    "Inflation remains relatively low but is expected to rise in 2019 and this environment is ripe for holding TIPS.",
    "An additional purpose for holding a TIPS funds is to diversify the fixed income portion of your portfolio.",
    "Therefore, TIPS funds may be smart holdings for both short-term and long-term investors.",
    "Expenses:  0.78%",
    "Stagflation in 2019 is increasingly looking like a real possible outcome making Fidelity Select Utilities Portfolio (MUTF: FSUTX ) a smart holding.",
    "A slowing economy and inflation combine to make stagflation, which can be a challenging environment for stocks. Sectors that can perform well relative to others in this environment include health, energy and utilities.",
    "The FSUTX portfolio consists of high-quality U.S. large-cap utilities like NextEra Energy (NYSE: NEE ), PG&E Corp (NYSE: PCG ) and Dominion Energy (NYSE: D ).",
    "Expenses:  0.77%",
    "Fidelity Select Consumer Staples Portfolio (MUTF: FDFAX ) a smart holding for the year, especially as volatility looms.",
    "Consumer staples, like the healthcare and utility sectors, can serve the dual purpose of protecting against stagflation in the economy and volatility in the stock market. 2019 could bring both scenarios, which could make consumer staples sector funds like FDFAX market leaders this year.",
    "In a stagnant economy and weakening market, consumer stocks such as the top holdings in FDFAX Coca-Cola (NYSE: KO ), Proctor & Gamble (NYSE: PG ), Philip Morris (NYSE: PM ) can outperform the broad market indices.",
    "As of this writing, Kent Thune did not personally hold a position in any of the aforementioned securities, although he holds FXAIX in some client accounts. His No. 1 holding is his privately held investment advisory firm in Hilton Head Island, S.C. Under no circumstances does this information represent a recommendation to buy or sell securities.",
    "The post 7 Best Fidelity Funds for 2019 appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:39:57"
}