{
  "url": "https://www.nasdaq.com/article/will-costco-cost-beat-estimates-again-in-its-next-earnings-report-cm1207292",
  "title": "Will Costco (COST) Beat Estimates Again in Its Next Earnings Report? - Nasdaq.com",
  "text": [
    " Have you been searching for a stock that might be well-positioned to maintain its earnings-beat streak in its upcoming report? It is worth considering Costco (COST), which belongs to the Zacks Retail - Discount Stores industry. This warehouse club operator has an established record of topping earnings estimates, especially when looking at the previous two reports. The company boasts an average surprise for the past two quarters of 11.82%. For the las t report  ed quarter, Costco came out with earnings of $1.89 per share versus the Zacks Consensus Estimate of $1.83 per share, representing a surprise of 3.28%. For the previous quarter, the company was expected to pos t earnings  of $1.67 per share and it actually produced earnings of $2.01 per share, delivering a surprise of 20.36%.  Price and EPS Surprise     For Costco, estimates have been trending higher, thanks in part to this earnings surprise history. And when you look at the stock's positive Zacks Earnings ESP  (Expected Surprise Prediction), it's a great indicator of a future earnings beat, especially when combined with its solid Zacks Rank. Our research shows that stocks with the combination of a positive Earnings ESP and a Zacks Rank #3 (Hold) or better produce a positive surprise nearly 70% of the time  . In other words, if you have 10 stocks with this combination, the number of stocks that beat the consensus estimate could be as high as seven. The Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a version of the Zacks Consensus whose definition is related to change. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier. Costco currently has an Earnings ESP of +0.62%, which suggests that analysts have recently become bullish on the company's earnings prospects. This positive Earnings ESP when combined with the stock's Zacks Rank #3 (Hold) indicates that another beat is possibly around the corner. We expect the company's nex t earnings report  to be released on October 3, 2019. When the Earnings ESP comes up negative, investors should note that this will reduce the predictive power of the metric. But, a negative value is not indicative of a stock's earnings miss. Many companies end up beating the consensus EPS estimate, but that may not be the sole basis for their stocks moving higher. On the other hand, some stocks may hold their ground even if they end up missing the consensus estimate. Because of this, it's really important to check a company's Earnings ESP ahead of its quarterly release to increase the odds of success. Make sure to utilize our Earnings ESP Filter  to uncover the best stocks to buy or sell before they've reported.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Costco Wholesale Corporation (COST): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Have you been searching for a stock that might be well-positioned to maintain its earnings-beat streak in its upcoming report? It is worth considering Costco (COST), which belongs to the Zacks Retail - Discount Stores industry.",
    "This warehouse club operator has an established record of topping earnings estimates, especially when looking at the previous two reports. The company boasts an average surprise for the past two quarters of 11.82%.",
    "For the las t report  ed quarter, Costco came out with earnings of $1.89 per share versus the Zacks Consensus Estimate of $1.83 per share, representing a surprise of 3.28%. For the previous quarter, the company was expected to pos t earnings  of $1.67 per share and it actually produced earnings of $2.01 per share, delivering a surprise of 20.36%.",
    " Price and EPS Surprise ",
    "For Costco, estimates have been trending higher, thanks in part to this earnings surprise history. And when you look at the stock's positive Zacks Earnings ESP  (Expected Surprise Prediction), it's a great indicator of a future earnings beat, especially when combined with its solid Zacks Rank.",
    "Our research shows that stocks with the combination of a positive Earnings ESP and a Zacks Rank #3 (Hold) or better produce a positive surprise nearly 70% of the time  . In other words, if you have 10 stocks with this combination, the number of stocks that beat the consensus estimate could be as high as seven.",
    "The Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a version of the Zacks Consensus whose definition is related to change. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.",
    "Costco currently has an Earnings ESP of +0.62%, which suggests that analysts have recently become bullish on the company's earnings prospects. This positive Earnings ESP when combined with the stock's Zacks Rank #3 (Hold) indicates that another beat is possibly around the corner. We expect the company's nex t earnings report  to be released on October 3, 2019.",
    "When the Earnings ESP comes up negative, investors should note that this will reduce the predictive power of the metric. But, a negative value is not indicative of a stock's earnings miss.",
    "Many companies end up beating the consensus EPS estimate, but that may not be the sole basis for their stocks moving higher. On the other hand, some stocks may hold their ground even if they end up missing the consensus estimate.",
    "Because of this, it's really important to check a company's Earnings ESP ahead of its quarterly release to increase the odds of success. Make sure to utilize our Earnings ESP Filter  to uncover the best stocks to buy or sell before they've reported.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:10:02"
}