{
  "url": "https://www.nasdaq.com/article/ios-code-snippets-suggest-apple-ar-headset-already-being-tested-cm1210629",
  "title": "iOS Code Snippets Suggest Apple AR Headset Already Being Tested - Nasdaq.com",
  "text": [
    "   Apple    has yet to officially acknowledge its work on an   augmented reality    (   AR    ) headset, but code snippets discovered in the latest version of   its mobile operating system suggest that employees may already be   testing the device.  Apple    didn't immediately respond to a request for comment. Tuesday afternoon, indie game developer Steve Troughton-Smith   tweeted    that he had discovered some curious mentions of the device in iOS   13: The latest version of Apple's mobile operating system   apparently already includes StarBoard, which is thought to be a   developer framework for AR apps that are designed to run on a   headset.makeArticleAd(); What's more, Troughton-Smith also discovered a mention of a   new gamepad meant to work with AR apps for headsets. \"The   controller profile has a clicky trackpad, a trigger button, and a   system (home?) button,\" he tweeted. And if that wasn't enough, Troughton-Smith also stumbled   across a text file that tells Apple employees how to test AR apps   if they don't have access to the headset.   The iOS 13 GM also comes with a readme file (!) for how       employees can run Stereo AR apps on an iPhone when you don't       have access to Apple's headset               pic.twitter.com/SeZEHW8p0S  - Steve Troughton-Smith (@stroughtonsmith)       September 10, 2019      These findings suggest that Apple's upcoming AR headset will   work similar to its Carplay technology, and effectively \"beam\"   apps from a mobile phone to the device. Developers will be able   to optimize their iOS apps for the device, and switch back and   forth between a head-mounted and a handheld mode to run both on   the headset and a mobile phone. Apple has reportedly been working on a headset that offers   access to both virtual and   augmented reality    . In March,   Apple analyst Ming-Chi Kuo estimated     that the company may start to produce its headset by Q4 of   this year, and then publicly introduce it in 2020. Some observers had predicted that the company may give us a   first peek at the device during this week's iPhone. In the end,   the AR headset   joined a number of other rumored products that   didn't make the cut.    More from Variety    Apple Watch 5, New iPad, but No AR Glasses:         What Apple Did and Didn't Announce at Its iPhone Event   Apple Introduces $699 iPhone 11, Higher-End         iPhone 11 Pro and 11 Pro Max   Apple Drops Trailer for Original Series         'See' With Jason Momoa (Watch)     ",
    " Apple    has yet to officially acknowledge its work on an   augmented reality    (   AR    ) headset, but code snippets discovered in the latest version of   its mobile operating system suggest that employees may already be   testing the device.",
    " Apple    didn't immediately respond to a request for comment.",
    "Tuesday afternoon, indie game developer Steve Troughton-Smith   tweeted    that he had discovered some curious mentions of the device in iOS   13: The latest version of Apple's mobile operating system   apparently already includes StarBoard, which is thought to be a   developer framework for AR apps that are designed to run on a   headset.",
    "What's more, Troughton-Smith also discovered a mention of a   new gamepad meant to work with AR apps for headsets. \"The   controller profile has a clicky trackpad, a trigger button, and a   system (home?) button,\" he tweeted.",
    "And if that wasn't enough, Troughton-Smith also stumbled   across a text file that tells Apple employees how to test AR apps   if they don't have access to the headset.",
    "  The iOS 13 GM also comes with a readme file (!) for how       employees can run Stereo AR apps on an iPhone when you don't       have access to Apple's headset               pic.twitter.com/SeZEHW8p0S  - Steve Troughton-Smith (@stroughtonsmith)       September 10, 2019     ",
    "The iOS 13 GM also comes with a readme file (!) for how       employees can run Stereo AR apps on an iPhone when you don't       have access to Apple's headset               pic.twitter.com/SeZEHW8p0S ",
    "- Steve Troughton-Smith (@stroughtonsmith)       September 10, 2019 ",
    "These findings suggest that Apple's upcoming AR headset will   work similar to its Carplay technology, and effectively \"beam\"   apps from a mobile phone to the device. Developers will be able   to optimize their iOS apps for the device, and switch back and   forth between a head-mounted and a handheld mode to run both on   the headset and a mobile phone.",
    "Apple has reportedly been working on a headset that offers   access to both virtual and   augmented reality    . In March,   Apple analyst Ming-Chi Kuo estimated     that the company may start to produce its headset by Q4 of   this year, and then publicly introduce it in 2020.",
    "Some observers had predicted that the company may give us a   first peek at the device during this week's iPhone. In the end,   the AR headset   joined a number of other rumored products that   didn't make the cut. ",
    "  More from Variety    Apple Watch 5, New iPad, but No AR Glasses:         What Apple Did and Didn't Announce at Its iPhone Event   Apple Introduces $699 iPhone 11, Higher-End         iPhone 11 Pro and 11 Pro Max   Apple Drops Trailer for Original Series         'See' With Jason Momoa (Watch)   ",
    " More from Variety ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:20:03"
}