{
  "url": "https://www.nasdaq.com/article/forexeuro-slides-after-ecb-cuts-rates-approves-new-bond-purchases-20190912-00422",
  "title": "FOREX-Euro slides after ECB cuts rates, approves new bond purchases - Nasdaq.com",
  "text": [
    "    * Euro heading towards 28-month low after ECB action",
    "* Trump's delay to scheduled tariff hike boosts markets",
    "* China's offshore yuan gains 0.5%, Aussie hits 6-wk high",
    "* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh (Updates after ECB announcement)",
    "By Tommy Wilkes",
    "LONDON, Sept 12 (Reuters) - The euro skidded below $1.10 onThursday after the European Central Bank cut interest rates andunexpectedly relaunched a quantitative easing programme as wellto boost the region's economy. ",
    "Investors had expected a rate cut at Thursday's meeting butthere was some uncertainty as to whether policymakers wouldrestart a QE programme after some ECB members expressed doubt inrecent weeks about the need to relaunch asset purchases. urn:newsml:reuters.com:*:nL5N2630ZT",
    "The euro, after initially rising, dropped sharply to as lowas $1.0955EUR=EBS , the day's low and down 0.5% on thesession, as investors digested news of the rate cut and relaunchof QE. The euro hit a 28-month low earlier this month of$1.0926.",
    "The single currency also weakened against the Swiss franc EURCHF=EBS and Japanese yen EURJPY=EBS .",
    "ECB President Mario Draghi gives his press conference at1230 GMT, where investors will be looking for signals of furtherrate cuts and whether policymakers plan to tweak their inflationtargeting framework. ",
    "Thursday's meeting was the first in a series of majorcentral bank events, with Federal Reserve and Bank of Japanmeetings next week. ",
    "Stephen Gallo, European Head of FX Strategy at BMO CapitalMarkets, said that if the ECB prepared the market forsignificant rate cuts ahead, \"that would be quite dovish, quitebearish\" for the euro.",
    "Euro/dollar overnight implied volatility had soared to itshighest since mid-2018 EURONO= in the run-up to Thursday'spolicy statement. ",
    "The dollar rose against a basket of currencies and was lastup 0.2% at 98.568 .DXY .",
    "RISK RALLY",
    "Elsewhere in forex markets, a rebound in risk sentimentsupported the Chinese yuan CNY= , Australian dollar AUD= ,export-driven currencies across Asia and emerging marketcurrencies .MIEM00000CUS .",
    "After a difficult August in which concerns about a globalrecession sparked a scramble into safer assets, markets haverallied this month, encouraged by easing trade tensions and byreceding fears of a no-deal Brexit for now.",
    "China on Wednesday exempted a basket of U.S. goods from itstariffs, while U.S. President Donald Trump said in a tweet hewould delay a scheduled tariff hike by two weeks in October. urn:newsml:reuters.com:*:nL3N2621DV",
    "The Aussie hit a six-week high of $0.6887AUD=D3 and theoffshore Chinese yuan rose as much as 0.5% CNH=EBS to athree-week high of 7.0737 per dollar. urn:newsml:reuters.com:*:nL3N2631KO",
    "The Japanese yen, the go-to safe haven currency for fearfulinvestors, fell to a six-week low against the dollar. The yenbreached the 108 mark in Asian trade and was last at 107.80 yenper dollar JPY=EBS . ",
    "It had hit a seven-month high of 104.46 last month.",
    "Sterling was little changed GBP=D3EURGBP=D3 . The poundrocketed to a six-week high against the dollar on Monday asinvestors welcomed the British parliament's move to block ano-deal Brexit on Oct. 31. ",
    "Despite the more positive mood in risk assets this week,analysts expressed caution about its sustainability. urn:newsml:reuters.com:*:nL5N2631XG",
    "\"The bigger picture is one of a very tense geopoliticalenvironment that is unlikely to be rectified quickly,\" BMO'sGallo said.",
    "\n<^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\nChina's offshore yuan vs dollar   https://tmsnrt.rs/2AbkJJF\n    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^> (Editing by Hugh Lawson/Gareth Jones/Susan Fenton) ((thomas.wilkes@thomsonreuters.com))"
  ],
  "published_datetime": "2019-09-12 08:15:00"
}