{
  "url": "https://www.nasdaq.com/article/bitcoins-total-share-of-crypto-market-now-highest-since-march-2017-cm1206485",
  "title": "Bitcoin’s Total Share of Crypto Market Now Highest Since March 2017 - Nasdaq.com",
  "text": [
    "Bitcoin (BTC) is flashing green at press time, while its share   of the crypto   currency market    has reached at 30-month highs above 70 percent.",
    "As of writing, the cryptocurrency is trading at $10,350 on   Bitstamp - up 6 percent on a 24-hour basis - after hitting   an eight-day high of $10,506 earlier today. At that level, BTC   was up 12.7 percent from the one-month low of $9,320 hit on Aug.   29.",
    "Over the last nine weeks, BTC has consistently found takers in   the range of $9,000-$10,000. The resulting recovery rallies,   however, ended up creating lower highs - a sign of bull market   exhaustion - as seen in the chart below.",
    " Related: Bitcoin Averts Bearish Trend Change But Stalls     Beneath Key Price Average ",
    "The question now is whether the latest recovery from   sub-$10,000 levels will invalidate the bearish lower-highs setup   with a move above $10,956.",
    "The gains seen in the last four days look sustainable and   could be extended further, as BTC's dominance rate - the   cryptocurrency's share of the total crypto market - has jumped to   70.10 percent, the highest level since March 2017, according to      CoinMarketCap    .",
    "The gauge stood at 69 percent on Aug. 29, when BTC's price   slipped to one-month lows below $9,400.",
    " Related: Top 10 Cryptocurrencies Now Trading Below     200-Day Price Averages ",
    "Many observers consider price gains sustainable if they are   backed by a rise in the dominance rate,   as discussed    last month. The shift indicates money is being poured into BTC   for the long haul and not to fund purchases of alternative   cryptocurrencies.",
    "Trading volumes, however, tell another story, and suggest the   recovery seen in the last four days could be short-lived.",
    "The green bars (buying volumes) seen in the last four days on   the hourly chart (above left) are smaller compared to the red   bars (selling volumes) seen during bitcoin's drop to one-month   lows on Aug.29.",
    "Buying volumes only ticked up slightly in the 60 minutes to   21:00 UTC yesterday. During that time frame, BTC rose from   $10,200 to $10,470. Further,  Sunday's green bar (above   right) is significantly smaller than those observed during   previous breakouts above $10,000 (marked by arrows).",
    "Put simply, the price bounce seen in the last four days lacks   substance and a pullback, possibly to $9,750. could be in the   offing in the next day or two.",
    "The outlook as per the daily chart would turn bullish if   prices print a UTC close above $10,956 on high buying volumes.   That would open the doors to $12,000.",
    "The bitcoin bulls have failed four times in the last 10 weeks   to secure a weekly close (Sunday, UTC) above $12,000. Meanwhile,   the sellers have failed persistently failed to keep prices below   $9,500.",
    "A downside break looks likely, as key indicators have turned   bearish, including a bearish crossover of 5- and 10-week   moving averages.",
    "The moving average convergence divergence (MACD) histogram has   also dropped below zero for the first time since February, while   the Chaikin money flow, which incorporates both prices and   trading volumes, has slipped to a 4.5-month low of 0.10, a sign   of weakening bullish pressures.",
    "  Disclosure:       The author holds no cryptocurrency assets at the     time of writing. ",
    "  Bitcoin       image via Shutterstock; charts by     Trading     View  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 07:00:11"
}