{
  "url": "https://www.nasdaq.com/article/goldman-sachs-says-these-3-strong-buy-stocks-are-primed-for-growth-cm1207778",
  "title": "Goldman Sachs Says These 3 'Strong Buy' Stocks Are Primed For Growth - Nasdaq.com",
  "text": [
    "When investors are looking for fresh investment ideas, recent recommendations from Wall Street analysts can underscore compelling investment opportunities. This is where Goldman Sachs comes in.",
    "The firm just issued recommendations on 3 stocks, highlighting each based on its strong long-term growth prospects. Each of these stocks also boasts substantial support from the Street with a “Strong Buy” analyst consensus, based on TipRanks' Stock Screener. This consensus is generated from the last three months’ worth of ratings from all other analysts.",
    "Let’s take a closer look at the firm’s picks.",
    "Goldman Sachs’ James Schneider believes MasterCard is on track to see even more growth on top of the 48% year-to-date gain it has already achieved. Despite the fact that its $284 billion market cap falls below Visa’s (V) $401 billion, Schneider argues that MA has a lot going for it.",
    "With the company reporting on July 30 that gross dollar volume, the dollar value of transactions processed, gained 8% in its second quarter, MA appears to be well-positioned in terms of both its new and old electronic payment technologies.",
    "The cashless payments company stands to benefit from the shift towards digitized money. In July, MA announced that it’s partnering with Evolve Bank & Trust to create a frictionless payment system where employers can pay gig workers with an interest-free loan for service in almost real-time.",
    "Not to mention it also finalized its acquisition of Transfast that same month, giving MA the ability to disperse payments across bank accounts, mobile wallets and cards through a single API, and agreed to buy payments platform Nets for €2.85 billion on August 6 to add capacity for growth in the European market.  ",
    "“We are driving growth in our core products with key wins around the globe, and our recent acquisitions, such as Transfast, and new partnerships, like P27 in the Nordics, will help us address our customers’ evolving payments needs, particularly in the areas of real-time account-to-account and cross-border payments,” CEO Ajay Banga stated.",
    "All of these factors played into Schneider’s recommendation. As a result, the five-star analyst reiterated his Buy rating on September 3.",
    "The rest of the Street is on the same page. With 15 Buy ratings vs 1 Hold received in the last three months, the consensus among analysts is that MA is a ‘Strong Buy’. Its $310 average price target suggests 8% upside potential.",
    "The online furniture retailer is another Goldman Sachs analyst Heath Terry’s pick as most poised to outperform its peers.",
    " The five-star analyst describes the company as being “a leader in the online movement of household goods as it used its technology and scale to build a destination for furniture and home goods shopping over the past 16 years.”",
    "While Wayfair reported on August 1 that its Q2 net loss widened from the year-ago quarter, it should be noted that its active user base for its direct retail business now totals 17.8 million, more than 39% higher than it was a year ago. It also doesn’t hurt that orders delivered increased 42% year-over-year and the average order value was slightly higher than in the year-ago period.",
    "Management points out that part of the loss was due to its heavy investment in expanding its reach internationally.",
    "While Terry notes that the $300 billion U.S. home category is underpenetrated as it only makes up about 13% of sales online because of higher price points, risk of damage and potentially expensive delivery, he argues that the company is already on the right track thanks to its merchandising, breadth and depth of supply.",
    "Based on all of the above factors, the analyst initiated coverage with a Buy rating and set a $145 price target. This price target demonstrates Terry’s confidence that shares can surge 23% in the next twelve months.",
    "Wall Street remains firmly bullish on Wayfair. The stock boasts a ‘Strong Buy’ analyst consensus and a $159 average price target, suggesting 34% upside potential.",
    "Myovant is a biotech company that develops treatments for conditions affecting women and prostate cancer, with clinical programs for uterine fibroids (noncancerous growths of the uterus), prostate cancer and endometriosis.",
    "Endometriosis affects about one in ten women in their reproductive years, or approximately 176 million women globally, and is known for causing debilitating pain particularly during menstruation as well as infertility. The company is hoping to give women a more effective treatment option with its drug, Relugolix.  ",
    "MYOV just completed patient recruitment for SPIRIT 2, the first of two Phase III replicate trials evaluating Relugolix combination therapy in patients with pain caused by endometriosis. If the drug is approved, it will be the second gonadotropin releasing hormone (GnRH) antagonist on the market for endometriosis.",
    "Adding to the good news, the company announced on July 23 that its second Phase III trial of once-daily Relugolix combination therapy demonstrated positive results when used to treat uterine fibroids. The drug was generally well-tolerated and successful in reducing pain, with these results enabling MYOV to submit a new drug application (NDA) to the FDA by the end of this year.",
    "While there was some concern regarding Relugolix's placebo-adjusted response rate, Goldman Sachs’ Paul Choi tells investors that an overreaction over data has provided a solid entry-point. He adds, “The market has excessively discounted Myovant's prospects as our key opinion leader checks indicate no concerns about the response rate data and enthusiasm for another treatment option for endometriosis and uterine fibroid.”",
    "As a result, the analyst initiated coverage with a Buy and set a $20 price target on August 28. While noting that biotech stocks carry risk based on the fact that one negative catalyst such as poor study results can cause shares to sink, Choi thinks MYOV has the potential to gain 144% over the next twelve months.",
    "With 3 Buy ratings and no Holds or Sells being assigned in the last three months, MYOV has a ‘Strong Buy’ Street consensus. Its average price target of $23 indicates 181% upside potential.",
    "Find analysts’ favorite stocks with the Top Analysts’ Stocks tool ",
    "By Maya Sasson for TipRanks.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:33:13"
}