{
  "url": "https://www.nasdaq.com/article/china-stimulus-splurge-would-hurt-rating-20190903-00933",
  "title": "China stimulus splurge would hurt rating - Nasdaq.com",
  "text": [
    "By Marc Jones",
    "LONDON, Sept 2 (Reuters) - A credit-fuelled stimulus splurge could hurt China's credit rating more than the immediate hit from U.S. trade tariffs, S&P Global's main analyst for the country says.",
    "S&P last cut China's rating a couple of years ago, but it has been almost a year since its last formal review of the world's number two economy and a lot has happened since.",
    "Beijing has been trying to offset the damage with various forms of stimulus, but S&P's primary sovereign analyst for China, Kim Eng Tan, said there was a risk it ends up going too far with the efforts.",
    "\"If we have an abrupt shock of some sort then I think the government might start running for the more immediate kinds of economic support,\" Tan said.",
    "\"That in our view will mean the banks will have to start lending quite quickly and that would be negative for the government's rating.\"",
    "S&P currently rates China at A+ with a stable outlook. That is the same as both Moody's and Fitch. But it can often be the first of the three main agencies to move which means its imminent review will be closely watched.",
    "Tan gave no hint of whether a change might be coming. Much depends how much the credit metrics weaken and anyway China's financial system has ample liquidity, so it is unlikely a deterioration would be so bad a straight out cut is needed.",
    "\"I would expect that we would typically flag it with a negative outlook before we changed the rating,\" Tan said.",
    "One reason why the Chinese government may revert to pushing banks to ramp up lending again would be if there was a sharp rise in job losses, which then had the potential to cause domestic angst.",
    "It is all of course interlinked with the U.S. trade rift, though. Two years ago no one expected the situation to reach such an extreme level. Things aren't going to suddenly improve,  Eng acknowledged, but at the same time, more tariffs are not the big risk for China's rating.",
    "Total exports - services plus goods - out of China account for less than 20 percent of GDP, S&P estimates. The United States is only around half of that.",
    "\"I would not expect U.S. tariffs by themselves to cause the Chinese economy to weaken so much that we have to lower the rating\".",
    "\"The overall impact will not be so big that China cannot stabilise itself. The question is how they stabilise and that goes back to my first comment - if they use credit then the risks are higher for the rating,\" Tan said."
  ],
  "published_datetime": "2019-09-03 11:51:00"
}