{
  "url": "https://www.nasdaq.com/article/tanzania-lawmakers-protest-against-expulsion-from-parliament-of-critic-of-president-20190903-00825",
  "title": "Tanzania lawmakers protest against expulsion from parliament of critic of president - Nasdaq.com",
  "text": [
    "DAR ES SALAAM, Sept 3 (Reuters) - Opposition lawmakers in Tanzania on Tuesday boycotted the swearing in of a ruling party lawmaker who replaced a fierce critic of the president following his expulsion from parliament.",
    "Tundu Lissu, who survived an assassination attempt in September 2017 when he was shot 16 times by unknown gunmen, was dismissed from parliament in June over absenteeism and ethical issues.",
    "Parliamentary chief whip of the main opposition party CHADEMA, Lissu was initially treated for his wounds in Kenya but since January 2018 has been recuperating in Belgium. ",
    "A vocal opponent of President John Magufuli, Lissu was arrested on several occasions and charged with incitement before the gun attack in broad daylight in 2017.",
    "A former British colony of 57 million people, Tanzania has long been regarded as one of Africa's most stable democracies.",
    "But critics accuse Magufuli's government of cracking down on dissent. His administration has suspended some newspapers, arrested opposition leaders and restricted political rallies. The government has rejected the criticism.",
    "Lissu's expulsion could further weaken the opposition's voice in parliament, where the ruling party enjoys a commanding majority with about 75 percent of all seats, analysts say.",
    "\"How could we be part of the oath while Lissu has been unfairly expelled from parliament? Everybody knows that he is currently still receiving medical treatment,\" opposition MP Esther Bulaya, who joined other CHADEMA lawmakers to boycott the brief swearing-in ceremony of the new ruling party member of parliament, told Reuters.",
    "\"It's very cruel ... this raises questions if authorities are really interested in having a multi-party democracy in place in our country,\" Bulaya said by phone from Tanzania's capital Dodoma where the national assembly meets.",
    "National assembly speaker Job Ndugai has defended the decision to remove Lissu from his seat, saying he breached parliamentary procedures.",
    "Lissu has filed a case in Tanzania's commercial capital Dar es Salaam to challenge his expulsion.",
    "His lawyers lost a bid on Monday for a court injunction to block the swearing in of the ruling party MP who took his former seat, but the court is expected to rule next week over the legality of his expulsion.",
    "Magufuli condemned Lissu's attempted assassination in 2017 and called for a swift investigation. No suspects have been arrested. Local media reported that Lissu vowed to return to Tanzania this week to resume his political activities.",
    "Some analysts see Lissu as a possible front-runner to become the main opposition presidential candidate in next year's general election to challenge Magufuli's bid for a second and final term in office."
  ],
  "published_datetime": "2019-09-03 09:45:00"
}