{
  "url": "https://www.nasdaq.com/article/rising-us-dollar-mutes-metals-moves-and-puts-pressures-on-global-markets-cm1207496",
  "title": "Rising Us Dollar Mutes Metals Moves And Puts Pressures On Global Markets - Nasdaq.com",
  "text": [
    "The current levels of the US Dollar Index , above 99, clearly illustrates how the shifting landscape of the global economies has changed.  Prior to 2014/2015, when a minor currency/market crisis hit China and capital controls were installed in China to help reduce capital outflows, the US Dollar Index average price range was between 73 and 90.  Of course, the US Dollar Index weakened in 2008-09 and rotated within this range after 2010 - settling near 80 near the beginning of 2014. Before we get into the details, be sure to opt-in to my Free Market Forecast and Trade Ideas Newsletter",
    "So, this impressive rally in the US Dollar throughout the 2015-2016 US Presidential election cycle, as well as the continued rally since the lows near December 2018, is not something that we can simply chalk up to normal price rotation.  Something dramatic has shifted in the global market s since 2015/2016 and the new trend is US Dollar strength.",
    "We believe the recent rallies in Gold and Silver related to this US Dollar strength are something every trader should consider relative to the real perspective of the global markets.  Gold and Silver have become extremely expensive in certain foreign markets because of currency price levels and the stronger US Dollar typically mutes price rallies in precious metals.  Therefore, the combination of a strong US Dollar and a rising metals price suggests \"this time is different\".",
    "The reality is that no matter what happens in the US Dollar or other foreign currencies, Gold and Silver are in very high demand as investors continue to pour assets into precious metals - which have quickly become one of the best-performing assets for 2019 and very likely for 2020 and beyond.",
    "This Daily US Dollar Index chart highlights the strength of the US Dollar over the past 6+ months.  The ability of the US Dollar to continue to trade above 96~97 and push higher towards the 99 ~ 100 level shows the very high demand for US Dollars throughout the globe and the strength of the US Dollar in comparison to much weaker foreign currencies.  With the expectation of a weakening global economy, trade issues, negative interest rates, and bankrupt nations watching their futures spiral completely out of control, investors are naturally seeking out the strongest, safest assets - and are not seeking the highest potential returns.  This is a shift to safety.",
    "We believe that gold is about to launch into a new upside leg once it breaches our Fibonacci Price Amplitude Arc resistance level near 1550.  The new upside target is $1625 or higher - where $1700+ could be the real upside objective for Gold.  If the US dollar rotated a bit lower after setting the new highs near 99, Gold could explode to the upside on moderate US Dollar weakness.",
    "This Weekly chart of the Gold to Silver ratio highlights what we believe will be the next upside price leg for Gold over the next 6+ months.  We believe the true upside for Gold is 25 to 30% from current levels.  That puts our upside target near $2000 to $2100 near the end of 2019.  If that is the case, and silver continues to rally faster than Gold, then Silver could easily rally 30 to 50% from current levels.",
    "If gold does what we believe is possible over the next 6+ months, then Silver will likely target the $26 price level fairly quickly, then push even higher and attempt to reach levels above $31 to $40 before the end of 2019.  We believe the strength of the US Dollar will continue and the rally in metals will continue as the shifting environment of the global markets continues to drive investors into safety.",
    "This could be the \"once in a lifetime\" trade fore those of you that followed our research.  We've been warning about this move for many years and have clearly illustrated the breakout opportunities in both Gold and Silver related to the US Dollar and foreign currencies over the past 12+ months.",
    "You still have time to get into both the Gold and Silver trade if you believe our analysis is correct.  This move will likely continue for many months into the future - well into and past the 2020 US presidential election event.  The markets wait for no man or woman.  This shift in the global markets is different than 2008-09.  The reason it is different should be clearly evident in the strength of the US Dollar and the early shift in the precious metals markets that didn't happen in 2008-09.  Something is spooking global investors into metals and we believe we know what it is - the mature credit cycle rooted in foreign market credit/debt exposure/liability.",
    "It is our opinion that the falling foreign currencies and lower economic expectations are related to the fact that global foreign markets took advantage of the cheap US Dollar between 2010 and 2014, borrowed like fools and leveraged their economies to the max while never expecting the economic shift to happen quite like this.  Now, with credit and debt piled up in the expensive US Dollar, weak economic and trade data and outlooks and further concern originating from the \"grey/shadow banking sector\" - we believe the dance has already begun and investors know the tune.  Run into safety - run into Gold/Silver and the US Dollar.",
    "We believe our super-cycle research  and other proprietary modeling systems  are suggesting that price weakness will dominate the markets for the next few months. Ride my coattails as I navigate these financial market and build wealth while others lose nearly everything they own during the next financial crisis and recession.",
    "Chris Vermeulenwww.TheTechnicalTraders.com",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:40:04"
}