{
  "url": "https://www.nasdaq.com/article/wall-street-bogged-down-by-trade-growth-concerns-20190903-01009",
  "title": "Wall Street bogged down by trade, growth concerns - Nasdaq.com",
  "text": [
    "By Sinéad Carew",
    "NEW YORK, Sept 3 (Reuters) - U.S. stocks fell on Tuesday after the United States and China imposed new tariffs on each other and data showed U.S. factory activity shrank in August for the first time since 2016, renewing growth fears.",
    "Investors fled riskier assets as the latest face-off gnawed at any hopes for a resolution to the long-running U.S.-China trade war, which has rattled markets for months and weighed on world economies. ",
    "The uncertain outlook also pushed the benchmark 10-year U.S. Treasury yield  to its lowest level since July 2016 as bonds were in demand.",
    "\"Sentiment was already poor to start the day and then the weaker-than-expected manufacturing data just added fuel to the fire,\" said Dave Mazza, managing director and head of product at asset management firm Direxion in New York.",
    "\"We now have confirmation that the escalation in the trade war has spilled over to U.S. manufacturing just as it has to manufacturing around the globe,\" he added.",
    "At 2:55PM ET, the Dow Jones Industrial Average  fell 336.92 points, or 1.28%, to 26,066.36, the S&P 500  lost 26.73 points, or 0.91%, to 2,899.73 and the Nasdaq Composite  dropped 105.76 points, or 1.33%, to 7,857.13.",
    "Earlier in the day data showed British construction companies last month suffered the sharpest drop in new orders since the financial crisis due to jitters about Brexit. ",
    "\"It's not just tariffs. Tariffs are the main thing but there are other areas of unknown which tend to be a bad thing for stocks. People like certainty,\" said JJ Kinahan, chief market strategist at TD Ameritrade in Chicago.    ",
    " Trade-sensitive industrials  fell 1.8%, the biggest percentage loser among the S&P 11 major sectors. Technology stocks  fell 1.5%, weighed down by chipmakers, which have large revenue exposure to China. The Philadelphia Semiconductor index  dropped 2.2%.",
    "Boeing Co shares , tumbled 3%, weighing on the Dow, after the Federal Aviation Administration said on Friday a global panel of experts will need a few more weeks to finish its review of the company's 737 MAX certification. ",
    "U.S. casino operators felt the brunt of slowing economic growth in China as gambling hub Macau posted weak August casino revenue. Shares of Las Vegas Sands Corp , Wynn Resorts Ltd  and MGM Resorts International  fell between 2% and almost 5%. ",
    "Among the few gainers were the defensive utilities , real estate  and consumer staples  sectors.",
    "Declining issues outnumbered advancing ones on the NYSE by a 1.90-to-1 ratio; on Nasdaq, a 2.74-to-1 ratio favored decliners.",
    "The S&P 500 posted 37 new 52-week highs and 9 new lows; the Nasdaq Composite recorded 45 new highs and 125 new lows.      "
  ],
  "published_datetime": "2019-09-03 14:56:00"
}