{
  "url": "https://www.nasdaq.com/article/why-wayfair-stock-plunged-14-in-august-cm1207525",
  "title": "Why Wayfair Stock Plunged 14% in August - Nasdaq.com",
  "text": [
    " What happened Shares of   Wayfair    (NYSE: W) lost 14% last month, according to data provided by   S&P Global Market Intelligence    . When the online home goods retailer announced its   second-quarter earnings in early August, the numbers showed   continued robust revenue growth    . The company beat analysts' consensus estimate on the top   line, with direct retail net revenue up 42% year over year.   In addition, its non-   GAAP    net loss of $1.35 per share matched analysts'   expectations. However, the company's third-quarter outlook forecast that   revenue growth will decelerate to a percentage in the mid-30s.   Given that shareholders have gotten used to growth in the   40%-plus range, market participants didn't like that prediction,   and shares tumbled from their high valuation level.   IMAGE SOURCE: GETTY IMAGES.makeArticleAd();  So what Management asserts that it's not concerned about the predicted   deceleration. CEO Niraj Shah said it's \"the outcome of doing   dozens and dozens of ambitious things.\" What he meant is   that they are constantly tweaking areas of the business, such as   the recent launch of a new app design. Shah said, \"When you do   that you reset some of the customer consideration cycle for a   portion of your customers.\" Shah also talked about the potential impact of tariffs,   stating, \"Our business model is more resilient than that of a   traditional retailer by being a platform.\" But he explained that   trade conflicts can disrupt supply chains in the short term, as   suppliers change how they price their products to mitigate higher   costs. Now what No matter what happens in the short term with respect to   tariffs and the economy, management is focused on the long term.   Wayfair continues to operate at a loss as it invests in building   out its logistics network. The company's CastleGate   warehouse facilities are crucial to meeting the tremendous demand   the company is experiencing. More importantly, Wayfair's expanded   logistics capabilities should translate into lower costs and   higher profitability over time, as Shah explained:  Our CastleGate penetration in the U.S. continues to trend     upward due to robust levels of growth. At the current pace,     this means that the actual dollars flowing through CastleGate     for both large and small parcel are doubling year over year. We     believe we are well prepared to meet the increased demand and     that we have architected our logistics network to move steadily     toward lower cost and faster delivery times as it scales.  Wayfair's stock price is going to be volatile simply because   management operates on a different time scale than Wall Street.   The company is being managed to   maximize profit down the road    , not next quarter. More spending in the $600 billion home   goods market continues to shift online, which should allow   Wayfair to maintain its momentum and remain a   compelling growth opportunity for investors    .   10 stocks we like better than Wayfair       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Wayfair wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        John Ballard      owns shares of Wayfair. The Motley Fool owns shares of and     recommends Wayfair. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   Wayfair    (NYSE: W) lost 14% last month, according to data provided by   S&P Global Market Intelligence    . When the online home goods retailer announced its   second-quarter earnings in early August, the numbers showed   continued robust revenue growth    . The company beat analysts' consensus estimate on the top   line, with direct retail net revenue up 42% year over year.   In addition, its non-   GAAP    net loss of $1.35 per share matched analysts'   expectations.",
    "However, the company's third-quarter outlook forecast that   revenue growth will decelerate to a percentage in the mid-30s.   Given that shareholders have gotten used to growth in the   40%-plus range, market participants didn't like that prediction,   and shares tumbled from their high valuation level.",
    "  IMAGE SOURCE: GETTY IMAGES.makeArticleAd(); ",
    "IMAGE SOURCE: GETTY IMAGES.",
    "Management asserts that it's not concerned about the predicted   deceleration. CEO Niraj Shah said it's \"the outcome of doing   dozens and dozens of ambitious things.\" What he meant is   that they are constantly tweaking areas of the business, such as   the recent launch of a new app design. Shah said, \"When you do   that you reset some of the customer consideration cycle for a   portion of your customers.\"",
    "Shah also talked about the potential impact of tariffs,   stating, \"Our business model is more resilient than that of a   traditional retailer by being a platform.\" But he explained that   trade conflicts can disrupt supply chains in the short term, as   suppliers change how they price their products to mitigate higher   costs.",
    "No matter what happens in the short term with respect to   tariffs and the economy, management is focused on the long term.   Wayfair continues to operate at a loss as it invests in building   out its logistics network. The company's CastleGate   warehouse facilities are crucial to meeting the tremendous demand   the company is experiencing. More importantly, Wayfair's expanded   logistics capabilities should translate into lower costs and   higher profitability over time, as Shah explained:",
    "Our CastleGate penetration in the U.S. continues to trend     upward due to robust levels of growth. At the current pace,     this means that the actual dollars flowing through CastleGate     for both large and small parcel are doubling year over year. We     believe we are well prepared to meet the increased demand and     that we have architected our logistics network to move steadily     toward lower cost and faster delivery times as it scales.",
    "Wayfair's stock price is going to be volatile simply because   management operates on a different time scale than Wall Street.   The company is being managed to   maximize profit down the road    , not next quarter. More spending in the $600 billion home   goods market continues to shift online, which should allow   Wayfair to maintain its momentum and remain a   compelling growth opportunity for investors    .",
    "  10 stocks we like better than Wayfair       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Wayfair wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Wayfair       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Wayfair wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  John Ballard      owns shares of Wayfair. The Motley Fool owns shares of and     recommends Wayfair. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 03:11:00"
}