{
  "url": "https://www.nasdaq.com/article/does-it-ever-pay-to-tell-your-boss-youre-job-hunting-cm1210076",
  "title": "Does It Ever Pay to Tell Your Boss You're Job Hunting? - Nasdaq.com",
  "text": [
    " Maybe you've asked for a   raise    repeatedly at work, but have been denied due to budgetary   constraints. Or maybe you've been itching for a   promotion    to further your career, but a position just hasn't opened up. No matter the circumstances, there may come a point when it no   longer makes sense to stay in your current role. And if that's   the case, you'll no doubt be gearing up to keep your job search a   secret from those around you. But in some circumstances, it could   actually pay to loop your boss in on the situation, even though   conventional wisdom generally dictates otherwise.  How well do you know your boss?  At first glance, telling your boss you're job hunting may seem   like the world's worst possible idea. After all, if your manager   reacts poorly to that news, he or she might immediately move to   have you terminated, leaving you without a paycheck while you   search for a different role.makeArticleAd();   IMAGE SOURCE: GETTY IMAGES.  But if you have a strong enough relationship with your boss   and know your manager well enough to gauge his or her reaction,   sharing that information may not be such a bad idea. If your boss   has always been in your corner and clearly understands your   frustrations with your job at present, then he or she may be   overwhelmingly supportive in your choice to look elsewhere. And   that could benefit both of you. For example, most people who search for jobs while already   employed tend to do so   on the sly    . As such, they're often forced to concoct stories about medical   appointments, home repairs, or other excuses that explain why   they're coming in late or leaving early. On the other hand, if   you're honest with your boss about what you're doing, there won't   be any need to lie. As such, you'll have less stress, and your   boss will know exactly when you will and won't be available. Another thing: Giving your boss a heads-up that you're looking   to leave might actually improve your relationship. If you don't   let on about your job search until you've gotten an offer and are   ready to submit your   two weeks' notice    , your manager will only have that much time to find someone to   serve as a replacement for you. But if you loop your boss in   earlier on, he or she can begin putting out feelers for new   candidates or start subtly training other team members to take   over your responsibilities. And having that option is something   your manager will no doubt appreciate. Finally, if you're embarking on a job search because your   current employer refuses to budge on certain items, telling your   boss might prompt him or her to push your management team for   change in order to keep you. And if that's an option you're   interested in pursuing, it's a good one to have. Clearly, there's much to be gained by telling your boss you're   looking for a new job -- but only if your relationship is solid   and you're inclined to believe that your manager won't react   poorly to the news. If you're not sure whether to share that   information with your boss, err on the side of keeping it to   yourself. The last thing you want to do is lose your job before   you're ready, thereby adding pressure to a search that otherwise   could've been conducted at your own pace and without stress.   The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .   The Motley Fool has a     disclosure policy      .  ",
    "Maybe you've asked for a   raise    repeatedly at work, but have been denied due to budgetary   constraints. Or maybe you've been itching for a   promotion    to further your career, but a position just hasn't opened up.",
    "No matter the circumstances, there may come a point when it no   longer makes sense to stay in your current role. And if that's   the case, you'll no doubt be gearing up to keep your job search a   secret from those around you. But in some circumstances, it could   actually pay to loop your boss in on the situation, even though   conventional wisdom generally dictates otherwise.",
    "At first glance, telling your boss you're job hunting may seem   like the world's worst possible idea. After all, if your manager   reacts poorly to that news, he or she might immediately move to   have you terminated, leaving you without a paycheck while you   search for a different role.",
    "  IMAGE SOURCE: GETTY IMAGES. ",
    "IMAGE SOURCE: GETTY IMAGES.",
    "But if you have a strong enough relationship with your boss   and know your manager well enough to gauge his or her reaction,   sharing that information may not be such a bad idea. If your boss   has always been in your corner and clearly understands your   frustrations with your job at present, then he or she may be   overwhelmingly supportive in your choice to look elsewhere. And   that could benefit both of you.",
    "For example, most people who search for jobs while already   employed tend to do so   on the sly    . As such, they're often forced to concoct stories about medical   appointments, home repairs, or other excuses that explain why   they're coming in late or leaving early. On the other hand, if   you're honest with your boss about what you're doing, there won't   be any need to lie. As such, you'll have less stress, and your   boss will know exactly when you will and won't be available.",
    "Another thing: Giving your boss a heads-up that you're looking   to leave might actually improve your relationship. If you don't   let on about your job search until you've gotten an offer and are   ready to submit your   two weeks' notice    , your manager will only have that much time to find someone to   serve as a replacement for you. But if you loop your boss in   earlier on, he or she can begin putting out feelers for new   candidates or start subtly training other team members to take   over your responsibilities. And having that option is something   your manager will no doubt appreciate.",
    "Finally, if you're embarking on a job search because your   current employer refuses to budge on certain items, telling your   boss might prompt him or her to push your management team for   change in order to keep you. And if that's an option you're   interested in pursuing, it's a good one to have.",
    "Clearly, there's much to be gained by telling your boss you're   looking for a new job -- but only if your relationship is solid   and you're inclined to believe that your manager won't react   poorly to the news. If you're not sure whether to share that   information with your boss, err on the side of keeping it to   yourself. The last thing you want to do is lose your job before   you're ready, thereby adding pressure to a search that otherwise   could've been conducted at your own pace and without stress.",
    "  The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      . ",
    " The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .",
    " The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 06:48:00"
}