{
  "url": "https://www.nasdaq.com/article/turkeys-erdogan-says-plans-5-growth-rate-in-2020-20190905-00039",
  "title": "Turkey's Erdogan says plans 5% growth rate in 2020 - Nasdaq.com",
  "text": [
    "ISTANBUL, Sept 5 (Reuters) - President Tayyip Erdogan said Turkey would plan for economic growth of 5% in 2020 and expected interest rates to fall further, speaking after data this week showed the economy contracted 1.5% year-on-year in the second quarter.",
    "Turkey's economy is looking to shake off a recession brought on by 2018's currency crisis. The second quarter contraction was less than a forecast of 2% in a Reuters poll, which also predicted zero growth this year as a whole. ",
    "\"I am giving a growth level for 2020, we will focus on that.  We will definitely plan a growth rate of 5%,\" Erdogan said in a speech on Wednesday evening.",
    "\"I have an allergy against interest rates. I am against high interest rates,\" Erdogan said, adding that interest rates had started to fall.",
    "The central bank slashed its key interest rate by a more-than-expected 425 basis points to 19.75% in July to spur a recession-hit economy. ",
    "The rate cut was a first step away from the emergency stance adopted during last year's currency crisis, when the lira weakened almost 30% against the dollar. ",
    "\"With the fall in interest rates (there) is a drop in inflation... Now the policy rate will fall further,\" he said. Erdogan has often expressed the unorthodox view that inflation will come down when interest rates are lowered.",
    "\"I believe that, because the central bank management has displayed its understanding on this subject,\" he added.",
    "The central bank's governor was sacked in July, with Erdogan saying he had failed to follow the government's policy instructions. He was replaced by his former deputy Murat Uysal before July's rate cut decision. ",
    "Data on Tuesday showed annual inflation fell slightly more than expected to 15.01% in August, likely paving the way for another interest rate cut as soon as next week. ",
    "The central bank will hold its next monetary policy committee meeting on Sept. 12."
  ],
  "published_datetime": "2019-09-05 01:51:00"
}