{
  "url": "https://www.nasdaq.com/article/how-royal-gold-rgld-stock-stands-out-in-a-strong-industry-cm1207415",
  "title": "How Royal Gold (RGLD) Stock Stands Out in a Strong Industry - Nasdaq.com",
  "text": [
    " One stock that might be an intriguing choice for investors right now is Royal Gold, Inc. RGLD  . This is because this security in the Mining - Gold space is seeing solid earnings estimate revision activity, and is in great company from a Zacks Industry Rank perspective. This is important because, often times, a rising tide will lift all boats in an industry, as there can be broad trends taking place in a segment that are boosting securities across the board. This is arguably taking place in the Mining - Gold space as it currently has a Zacks Industry Rank of 9 out of more than 250 industries, suggesting it is well-positioned from this perspective, especially when compared to other segments out there. Meanwhile, Royal Gold is actually looking pretty good on its own too. The firm has seen solid earnings estimate revision activity over the past month, suggesting analysts are becoming a bit more bullish on the firm's prospects in both the short and long term.  Royal Gold, Inc. Price and Consensus       Royal Gold, Inc. price-consensus-chart    |   Royal Gold, Inc. Quote   In fact, over the past month, current quarter estimates have risen from 56 cents per share to 61 cents per share, while current year estimates have risen from $2.25 per share to $2.53 per share. This has helped RGLD to earn a Zacks Rank #1 (Strong Buy), further underscoring the company's solid position. You can see    the complete list of today's Zacks #1 Rank stocks here    . So, if you are looking for a decent pick in a strong industry, consider Royal Gold. Not only is its industry currently in the top third, but it is seeing solid estimate revisions as of late, suggesting it could be a very interesting choice for investors seeking a name in this great industry segment.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Royal Gold, Inc. (RGLD): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "One stock that might be an intriguing choice for investors right now is Royal Gold, Inc. RGLD  . This is because this security in the Mining - Gold space is seeing solid earnings estimate revision activity, and is in great company from a Zacks Industry Rank perspective.",
    "This is important because, often times, a rising tide will lift all boats in an industry, as there can be broad trends taking place in a segment that are boosting securities across the board. This is arguably taking place in the Mining - Gold space as it currently has a Zacks Industry Rank of 9 out of more than 250 industries, suggesting it is well-positioned from this perspective, especially when compared to other segments out there.",
    "Meanwhile, Royal Gold is actually looking pretty good on its own too. The firm has seen solid earnings estimate revision activity over the past month, suggesting analysts are becoming a bit more bullish on the firm's prospects in both the short and long term.",
    " Royal Gold, Inc. Price and Consensus       Royal Gold, Inc. price-consensus-chart    |   Royal Gold, Inc. Quote  ",
    " Royal Gold, Inc. price-consensus-chart    |   Royal Gold, Inc. Quote ",
    "In fact, over the past month, current quarter estimates have risen from 56 cents per share to 61 cents per share, while current year estimates have risen from $2.25 per share to $2.53 per share. This has helped RGLD to earn a Zacks Rank #1 (Strong Buy), further underscoring the company's solid position. You can see    the complete list of today's Zacks #1 Rank stocks here    .",
    "So, if you are looking for a decent pick in a strong industry, consider Royal Gold. Not only is its industry currently in the top third, but it is seeing solid estimate revisions as of late, suggesting it could be a very interesting choice for investors seeking a name in this great industry segment.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:39:00"
}