{
  "url": "https://www.nasdaq.com/article/why-netapp-stock-fell-178-last-month-cm1210389",
  "title": "Why NetApp Stock Fell 17.8% Last Month - Nasdaq.com",
  "text": [
    " What happened Shares of   NetApp    (NASDAQ: NTAP) shed 17.8% of their value in August, according to   data from      S&P Global Market Intelligence    . The stock tumbled after the enterprise data services company   cut its first-quarter sales and profit outlook and lowered its   full-year sales growth guidance. Management cited macroeconomic   factors (including the trade standoff between the U.S. and China)   as contributing to reduced customer demand.          Data source:      NTAP     by   YCharts. makeArticleAd(); NetApp published preliminary first-quarter results on Aug. 1,   and the company reported that sales for the period were likely to   come in between $1.22 and $1.23 billion -- down significantly   from initial guidance for revenue between $1.315 billion to   $1.465 billion. Management also slashed the target on non-   GAAP    (adjusted) earnings per share to between $0.55 and $0.60 --   down from the previous guidance for earnings per share between   $0.78 and $0.86.   Image source: Getty Images.  So what While the company had stated in May that it expected sales for   the year to grow at the low end of the mid-single-digit range,   NetApp's preliminary first-quarter results arrived with news that   annual revenue is poised to fall between 5% and 10%. By the time that NetApp actually reported its first-quarter   results on Aug. 14, expectations had been lowered and the stock   posted little movement. Revenue for the period came in at $1.24   billion, down 15.6% year over year. Non-GAAP (adjusted) earnings   per share for the quarter came in at $0.65, significantly ahead   of the average analyst estimate -- but also down 37.5% from   adjusted earnings of $1.04 in the prior-year period. Now what NetApp stock has regained some ground in September. The   company's share price is up 13.4% in the month's trading so far,   and appears to have benefited from executive vice president   and chief financial officer Ron Pasek's presentation at the Citi   Global Technology Conference on Sept. 5.      Data source:      NTAP     by   YCharts.  NetApp managemen   t report    s that the company is still seeing strong customer enthusiasm for   the business's hybrid-cloud data services. Pasek outlined some of   the macroeconomic headwinds the business is facing and   highlighted growth opportunities for the company in on-premise   flash storage, private cloud, and cloud data services. NetApp stock trades at roughly 13 times this year's expected   earnings and has a   dividend yield    of 3%.   10 stocks we like better than NetApp       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and NetApp wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Keith Noonan      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   NetApp    (NASDAQ: NTAP) shed 17.8% of their value in August, according to   data from      S&P Global Market Intelligence    . The stock tumbled after the enterprise data services company   cut its first-quarter sales and profit outlook and lowered its   full-year sales growth guidance. Management cited macroeconomic   factors (including the trade standoff between the U.S. and China)   as contributing to reduced customer demand.",
    "Data source:      NTAP     by   YCharts. ",
    "NetApp published preliminary first-quarter results on Aug. 1,   and the company reported that sales for the period were likely to   come in between $1.22 and $1.23 billion -- down significantly   from initial guidance for revenue between $1.315 billion to   $1.465 billion. Management also slashed the target on non-   GAAP    (adjusted) earnings per share to between $0.55 and $0.60 --   down from the previous guidance for earnings per share between   $0.78 and $0.86.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "While the company had stated in May that it expected sales for   the year to grow at the low end of the mid-single-digit range,   NetApp's preliminary first-quarter results arrived with news that   annual revenue is poised to fall between 5% and 10%.",
    "By the time that NetApp actually reported its first-quarter   results on Aug. 14, expectations had been lowered and the stock   posted little movement. Revenue for the period came in at $1.24   billion, down 15.6% year over year. Non-GAAP (adjusted) earnings   per share for the quarter came in at $0.65, significantly ahead   of the average analyst estimate -- but also down 37.5% from   adjusted earnings of $1.04 in the prior-year period.",
    "NetApp stock has regained some ground in September. The   company's share price is up 13.4% in the month's trading so far,   and appears to have benefited from executive vice president   and chief financial officer Ron Pasek's presentation at the Citi   Global Technology Conference on Sept. 5.",
    "Data source:      NTAP     by   YCharts. ",
    "NetApp managemen   t report    s that the company is still seeing strong customer enthusiasm for   the business's hybrid-cloud data services. Pasek outlined some of   the macroeconomic headwinds the business is facing and   highlighted growth opportunities for the company in on-premise   flash storage, private cloud, and cloud data services.",
    "NetApp stock trades at roughly 13 times this year's expected   earnings and has a   dividend yield    of 3%.",
    "  10 stocks we like better than NetApp       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and NetApp wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than NetApp       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and NetApp wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Keith Noonan      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:07:00"
}