{
  "url": "https://www.nasdaq.com/article/danske-bank-hires-finance-chief-from-commerzbank-in-shakeup-20190905-00106",
  "title": "Danske Bank hires finance chief from Commerzbank in shake-up - Nasdaq.com",
  "text": [
    "By Jacob Gronholt-Pedersen",
    "COPENHAGEN, Sept 5 (Reuters) - Danske Bank  named Stephan Engels from Commerzbank  as its finance chief on Thursday, in an ongoing overhaul by the Danish lender's new boss to restore trust after its involvement in a damaging money laundering scandal.",
    "Danske is under investigation in the United States and several other countries for payments totalling 200 billion euros  ($223 billion) through its small Estonian branch, many of which the bank said were suspicious.",
    "However, the appointment of Engels follows a string of appointments from big international banks including chief compliance officer Philippe Vollot, who came from Deutsche Bank.",
    "For Commerzbank, the unexpected departure of Engels, its long-time chief financial officer, comes as the German bank is in the middle of a review of its strategy following this year's failed merger talks with Deutsche Bank .",
    "Commerzbank, Germany's second-largest bank behind Deutsche, is looking at possible staff cuts and closing some branches, sources have told Reuters.",
    "Danske Chief Executive Chris Vogelzang, who joined Denmark's largest bank on June 1, sacked former interim CEO Jesper Nielsen that month after thousands of Danish customers were overcharged for an investment product, in his first attempt to draw a line and regain trust from both customers and investors. ",
    "Shares in Danske are down some 65% since the money laundering scandal began to unfold in July 2017, rocking investor confidence and prompting investigations around the world. Danske shares rose nearly 3% on Thursday.",
    "Danske also said on Thursday that Berit Behring, who oversees the bank's Swedish operations, will take over as new head of wealth management from Jacob Aarup-Andersen, who the country's financial regulator blocked from taking the CEO role on the grounds of having insufficient experience. ",
    "Andersen will take up the position as CFO until Engels joins the bank in April next year, and will the move to a position as head of Danish banking activities, Danske said.",
    "The bank also said it is looking to replace Jim Ditmore, who will step down as chief operating officer.",
    "Also on Thursday, Finland's Nordea  named Danish Frank Vang-Jensen, head of personal banking at the Nordic region's biggest bank, as its new chief executive. ",
    "($1 = 0.8973 euros)"
  ],
  "published_datetime": "2019-09-05 03:35:00"
}