{
  "url": "https://www.nasdaq.com/article/a-world-searching-for-a-recession-cm1207286",
  "title": "A World Searching for a Recession - Nasdaq.com",
  "text": [
    "It's hard to go past the US ISM manufacturing print, as the recent regional manufacturing data points had given us a belief that the national print would at least be in the expansion. However, that wasn't the case and the reality of the index dropping to 49.1 - the first contraction since August 2016 - is that the idea of the US economy is the shining light and an island onto its own has been questioned.",
    "We know manufacturing is highly cyclical, but we can see that every sub-component in the index is below the 50 expansion/contraction level, and that is a worry. Just take a look at the correlation with the Goldman Sachs current activity indicator, with manufacturing PMI data a major contributor to the read.",
    "The 'recession' word has crept into the narrative yet again, and one way I can visualise this is to search using Google Trends for keywords. Or, I can look at the story count on Bloomberg. Here I have scanned for the story count for 'recession' (white) and 'currency war' (orange). It seems Bloomberg editorial has been putting pen to paper and focusing on the currency war angle, which is a reflection of readers interest.",
    "Of course, the aforementioned news flow has benefited the usual suspects, gold, silver, JPY, implied volatility (the VIX index closed at 19.66%), rates and bonds - it's all one big correlated trade. With small-caps underperforming once again (the Russell 2000/US2000 closed -1.5%) and the S&P 500 is eyeing a re-test of 2900. Asian equities are holding in ok, and while the ASX 200 is lower by 0.8%, the Hang Seng and Nikkei 225 are flat.",
    "I would also add that overnight we heard from St Louis Fed President James Bullard, who changed his call to a 50bp cut (from 25bp) in the September FOMC meeting and as a result we've seen buying across the fed fund futures curve - with the market now pricing a 25% chance of 50bp cut. This has taken US 2-year Treasury's -5bp lower to 1.44%, with small selling in the USD.",
    "Take a look at high-grade copper. If copper has a PhD in economics, then maybe this is telling us a message.",
    "The USD index (USDX) has failed to close above trend resistance, and for those trading EURUSD (given the EUR contributes a 57% weight to the USDX basket), we've seen a pronounced pin bar reversal on the daily, and a higher high through today's trade would be interesting given the love for the USD. We react to price moves.",
    "One key aspect will the upcoming Fed speaker fest. The highlight will be NY Fed President John Williams, who some will recall was so dovish in the lead-up to the August FOMC meeting, that the NY Fed had to put out a statement shortly after his speech, to walk back his view. Clearly, the market will be looking to see how he sees the world and whether his communication with the market improves.",
    "It does feel to me as though there is further USD upside, at least in the short-term, and aside from the manufacturing data and woeful University of Michigan consumer confidence report last week, we are yet to see fragility feed into CB consumer confidence report (red line), consumption statistics or service sector reads. One suspects this will presumably be more affected should cracks emerge in labour market reads. It makes this week's US ISM services and payrolls report just that bit more important and expect markets to be sensitive to these reads.",
    "As mentioned, there has been some love for precious metals, and there has been a focus away from gold (to an extent) towards silver. If this hasn't come across your radar, take a look at the daily chart of silver (USD denominated), it's flying.",
    "Just look at the gold/silver ratio, it's getting chopped up, and that is usually a bullish sign for precious metals.",
    "Staying in FX, we've seen a renewed bid in the AUD, largely as a result of a less dovish-than-feared RBA meeting, but todays Q2 GDP print, while in-line with estimates at 0.5% QoQ has seen a further position adjustment from AUD shorts. AUDCAD has had a strong move, putting in a sizeable bullish outside day reversal, with price eyeing a move into the 0.9050 and the top of the trading range it's formed since late July.",
    "Consider we have the Bank of Canada meeting tonight (00:00aest), and while the market puts a 6% chance of a cut, CAD traders will feed off the tone (and the level of flexibility reserved for a cut in the October meeting. One to watch.",
    "Of course, GBP has been well traded with better GBP buyers emerging, notably on the run below 1.2020. Even though there has been a small bid in the sterling, I don't think it necessarily surprised that parliament passed a motion facilitating an extension of the Brexit timetable, which should be formally approved on Wednesday and will then require the blessing of the EU. There is much to write on the subject, but the thought turns to a snap election called for 14 October and whether Corbyn accepts this challenge or refuses, with the view to battle a GE early in 2020.",
    "The US session keyed off with a Trump tweet and yet another defiant message that gave us no indication the respective Xi-Trump camps are anywhere near to forging a deal. But the tweet set a risk-off tone in markets, and this was then given additional tailwind by a shocker of an ISM manufacturing print in the US, but also in Canada.",
    "It's hard to go past the US ISM manufacturing print, as the recent regional manufacturing data points had given us a belief that the national print would at least be in expansion. However, that wasn't the case and the reality of the index dropping to 49.1 - the first contraction since August 2016 - is that the idea of the US economy is the shining light and an island onto its own has been questioned.",
    "We know manufacturing is highly cyclical, but we can see that every sub-component in the index is below the 50 expansion/contraction level, and that is a worry. Just take a look at the correlation with the Goldman Sachs current activity indicator, with manufacturing PMI data a major contributor to the read.",
    "The 'recession' word has crept into the narrative yet again, and one way I can visualise this is to search using Google Trends for keywords. Or, I can look at the story count on Bloomberg. Here I have scanned for the story count for 'recession' (white) and 'currency war' (orange). It seems Bloomberg editorial has been putting pen to paper and focusing on the currency war angle, which is a reflection of readers interest.",
    "Of course, the aforementioned news flow has benefited the usual suspects, gold, silver, JPY, implied volatility (the VIX index closed at 19.66%), rates and bonds - it's all one big correlated trade. With small-caps underperforming once again (the Russell 2000/US2000 closed -1.5%) and the S&P 500 is eyeing a re-test of 2900. Asian equities are holding in ok, and while the ASX 200 is lower by 0.8%, the Hang Seng and Nikkei 225 are flat.",
    "I would also add that overnight we heard from St Louis Fed President James Bullard, who changed his call to a 50bp cut (from 25bp) in the September FOMC meeting and as a result we've seen buying across the fed fund futures curve - with the market now pricing a 25% chance of 50bp cut. This has taken US 2-year Treasury's -5bp lower to 1.44%, with small selling in the USD.",
    "Take a look at high-grade copper. If copper has a PhD in economics, then maybe this is telling us a message.",
    "The USD index (USDX) has failed to close above trend resistance, and for those trading EURUSD (given the EUR contributes a 57% weight to the USDX basket), we've seen a pronounced pin bar reversal on the daily, and a higher high through today's trade would be interesting given the love for the USD. We react to price moves.",
    "One key aspect will the upcoming Fed speaker fest. The highlight will be NY Fed President John Williams, who some will recall was so dovish in the lead-up to the August FOMC meeting, that the NY Fed had to put out a statement shortly after his speech, to walk back his view. Clearly, the market will be looking to see how he sees the world and whether his communication with the market improves.",
    "It does feel to me as though there is further USD upside, at least in the short-term, and aside from the manufacturing data and woeful University of Michigan consumer confidence report last week, we are yet to see fragility feed into CB consumer confidence report (red line), consumption statistics or service sector reads. One suspects this will presumably be more affected should cracks emerge in labour market reads. It makes this week's US ISM services and payrolls report just that bit more important and expect markets to be sensitive to these reads.",
    "As mentioned, there has been some love for precious metals, and there has been a focus away from gold (to an extent) towards silver. If this hasn't come across your radar, take a look at the daily chart of silver (USD denominated), it's flying.",
    "Just look at the gold/silver ratio, it's getting chopped up, and that is usually a bullish sign for precious metals.",
    "Staying in FX, we've seen a renewed bid in the AUD, largely as a result of a less dovish-than-feared RBA meeting, but todays Q2 GDP print, while in-line with estimates at 0.5% QoQ has seen a further position adjustment from AUD shorts. AUDCAD has had a strong move, putting in a sizeable bullish outside day reversal, with price eyeing a move into the 0.9050 and the top of the trading range it's formed since late July.",
    "Consider we have the Bank of Canada meeting tonight (00:00aest), and while the market puts a 6% chance of a cut, CAD traders will feed off the tone (and the level of flexibility reserved for a cut in the October meeting. One to watch.",
    "Of course, GBP has been well traded with better GBP buyers emerging, notably on the run below 1.2020. Even though there has been a small bid in the sterling, I don't think it necessarily surprised that parliament passed a motion facilitating an extension of the Brexit timetable, which should be formally approved on Wednesday and will then require the blessing of the EU. There is much to write on the subject, but the thought turns to a snap election called for 14 October and whether Corbyn accepts this challenge or refuses, with the view to battle a GE early in 2020.",
    "Sign up here for my Daily Fix or Start trading now",
    "Chris Weston, Head of Research at Pepperstone.",
    " (Read Our Pepperstone Review )",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:50:28"
}