{
  "url": "https://www.nasdaq.com/article/brazils-upcoming-soy-corn-crops-at-risk-amid-historically-dry-weather-20190911-00908",
  "title": "Brazil's upcoming soy, corn crops at risk amid historically dry weather - Nasdaq.com",
  "text": [
    "By Karen Braun",
    "(The opinions expressed here are those of the author, a market analyst for Reuters.)",
    "FORT COLLINS, Colo., Sept 11 (Reuters) - Brazil's soybean sowing season for the 2019-20 harvest is officially under way, but there might not be too many planters out in the fields just yet as conditions are extremely dry.",
    "Farmers in the top soybean and corn producing state in the country's Center-West, Mato Grosso, cannot start planting soybeans until Sunday. But down south, No. 2 grower Parana's soybean planting window opened on Wednesday. ",
    "Brazil is the world's top exporter of soybeans, and most of those shipments go to China, the largest buyer. Beijing has been keeping an extra close watch on Brazil's soybean market ever since the U.S.-China trade war began last year.",
    "But the timely sowing of soybeans in Brazil may be even more important for the second-crop corn, or safrinha, which is planted immediately after the beans are harvested. More than 70% of Brazil's total corn is safrinha and it is primarily used for export, while the first-crop corn is consumed domestically.",
    "Brazil's safrinha corn competes directly with the United States for export competition, and the recent record Brazilian harvest priced the U.S. product out of the global market. Brazil's corn exports hit record levels in the last two months, while U.S. shipments slid to six-year lows for the period. ",
    "But a late start to the soybean sowing season already places pressure on the second corn crop, especially in northern growing regions such as Mato Grosso, which have distinct wet and dry seasons. Mato Grosso's dry season typically begins in late May, but the safrinha harvest kicks off closer to July, so there is often no room for delays.",
    "BAD LUCK WEATHER",
    "The seasonal weather patterns in Mato Grosso typically mean that its soybean crop, which is planted starting in September and harvested starting in January, is less susceptible to drought-related losses. Parana and other southern growing areas do not have such reliable seasonal rainfall patterns, so they may be just as likely to have problems with soybeans or corn.",
    "The country's prime growing areas are starting the season in a significant hole. In Mato Grosso's crop-heavy northern region, soil moisture at the end of August stood at the lowest levels in at least 20 years. It was also 6% lighter than the same period in 2015, which was the start of one of Brazil's driest growing seasons.",
    "Precipitation from June through August, the driest months in Mato Grosso, totaled just 13 mm 0.5 inch, tied with 2010 as the lowest in at least 20 years (graphic).",
    "The dry trend is likely to continue in September as weather models midday Wednesday suggested the next measurable rain may not come until Sept. 24, and those totals are light. Well above-normal temperatures are also likely to persist until then (graphic).",
    "August 2018 soil moisture in Parana was lower than in August 2019 as southern Brazil and Argentina were still battered by historic drought a year ago. But adequate rains in September and the subsequent months restored moisture in Parana. Farmers went on to harvest a bumper second corn crop, but the soybean yields were very disappointing.",
    "Aside from last year, end-of-August soil moisture in Parana was the lowest since 2006, and like Mato Grosso, the rainfall forecast is sparse and temperatures will be warm for at least the next 10 days. June through August precipitation in the state was the lightest in at least 20 years at just 108 mm 4.25 inches, and that total is down 60% from the recent five-year average for the period (graphic).",
    "\n(graphic)\n",
    "BAD CROPS? NOT ALWAYS",
    "Market participants operate on the notion that Brazil's corn and soybean yields have the best prospects when soybeans are planted and harvested early, meaning that the safrinha corn can be planted early. They are not wrong on this, but there are some exceptions. There are also instances where super-dry planting periods recovered to produce above-trend crops (graphic).",
    "In Mato Grosso, both the 2014 and 2015 planting campaigns were among the slowest in recent memory. October through December rainfall was record low and temperatures were very hot in 2015. Rainfall in the same period in 2014 was second-lowest on record but 21% larger than in 2015, and temperatures were milder.",
    "Soybean yields in Mato Grosso were 2% below the long-term trend in 2014-15 but 12% below in 2015-16. The state's safrinha yields were 29% below trend in 2015-16 but 11% above trend in 2014-15, proving that weather can turn around mid-season.",
    "It is also interesting to note that 2015-16 featured a record strong El Niño, which is when the waters in the equatorial Pacific Ocean are warmer than normal. The previous year had featured a weak El Niño pattern, the same expectations that forecasters have for the last couple months of 2019 into early 2020.",
    "There are more examples of seemingly contradictory yield results in Mato Grosso and other states based on weather patterns, making the outcomes difficult to predict, even in the most extreme of cases. But just like crops elsewhere in the world, the bottom line is that trouble lurks if precipitation is insufficient and temperatures are too warm during the most critical periods of development, meaning the story will still take several more months to unfold.",
    "\nGraphic- June through August rainfall in North Mato Grosso, Brazil",
    "\nGraphic- Precipitation forecast for Mato Grosso, Brazil, September 11",
    "\nGraphic- Precipitation forecast for Parana, Brazil, September 11",
    "\nGraphic- June through August rainfall in Parana, Brazil",
    "\nGraphic- Soybean planting progress in Mato Grosso, Brazil"
  ],
  "published_datetime": "2019-09-11 08:00:00"
}