{
  "url": "https://www.nasdaq.com/article/the-ecbs-announcement-could-boost-adobe-cm1210637",
  "title": "The ECB’s Announcement Could Boost Adobe - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "The back and forth in the current market could be caused by several different issues. Besides trade and falling profits, one important concern is psychological - investors are worried about a repeat of the 2018 bear market that kicked off this same time last year.",
    "We aren't usually much for \"seasonality\" or seasonal investing, but fears of a third or fourth quarter decline probably still have traders temporarily on edge. As a result, we want to earn income on our long stock position in Adobe (NASDAQ: ADBE ), which we've been managing since our ADBE August 9th $302.50 Put Write expired in the money.",
    "Rather than branch out into new positions on new stocks, we can sell a covered call on ADBE and collect income while we wait for the rest of the market to settle.",
    "A renewed rally in the major indexes would likely push ADBE higher, but the European Central Bank's (ECB) announcement on Thursday is our focus right now. The chair of the ECB will host a press conference following the central bank's interest rate decision this Thursday.",
    "Any signs the ECB will step the in to market with more stimulus should help ADBE find support now that it has broken below $280. The ECB's announcement could even send ADBE's price slightly higher in the short term.",
    "While it may sound odd to suggest the ECB will affect ADBE's short-term prospects, the health of the European Union is very important to ADBE's growth rates.",
    "ADBE provides software services to businesses all over the world, and any relief for the European economy could stimulate business growth. If the ECB announces new rounds of easing, business spending could pick up, and ADBE could see subscription growth.",
    "That growth would benefit our long stock position in both the short and long term, and it's one of the reasons we think now is a good time to trade on ADBE.",
    "Like most tech stocks, ADBE has been stuck in a tight range. Trade and interest rate volatility have kept new buyers from stepping into the stock, pushing the stock lower.",
    "While that isn't great for our long stock position, it does present us a good opportunity to sell covered calls against ADBE for more income.",
    "ADBE made lower highs throughout August, and its next down-trending resistance level is at around $290. Since we are selling a covered call, we want to choose a strike price that ADBE is unlikely to cross.",
    "We think that, even with the potential boost from easing in Europe, ADBE will stay below the $290 in the short term. If it does, we can sell another covered call for more income while we wait for ADBE to rise above $302.50, the original price we purchased it for.",
    "To find out which ADBE covered calls we're selling-and to get access to our full portfolio of income-generating trades- sign up for a risk-free trial of Strategic Trader today .",
    "InvestorPlace advisers John Jagerson and S. Wade Hansen, both Chartered Market Technician (CMT) designees, are co-founders of LearningMarkets.com, as well as the co-editors of  Strategic Trader .",
    "The post The ECB's Announcement Could Boost Adobe appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:11:10"
}