{
  "url": "https://www.nasdaq.com/article/exxonmobil-to-divest-gom-assets-to-repsol-for-around-1b-cm1210575",
  "title": "ExxonMobil to Divest GoM Assets to Repsol for Around $1B - Nasdaq.com",
  "text": [
    "  Exxon Mobil Corporation XOM  is expected to sell some of its deep-water Gulf of Mexico (GoM) assets to Spanish integrated energy company Repsol, S.A. REPYY  , per Reuters. The divestment is expected to fetch ExxonMobil up to $1 billion. Notably, ExxonMobil - which was recently dropped from the S&P 500 Index's top 10 companies, ending a nine-decade-long streak - had expressed interest to divest some of the operated and non-operated assets in the region last October. The deal with Repsol requires approval from ExxonMobil's partners in the related projects, who may have preferential rights to acquire the assets. While buying out the assets would increase Repsol's footprint in the area, it will help ExxonMobil with its divestment plans. The company intends to generate $15 billion in cash through 2025 by selling assets. This might include the divestment of stakes in oil and natural gas resources in U.K. North Sea after more than 50 years of presence in the region.  Divestment Rationale  The company always looks for better opportunities. The divestment of GoM assets will likely enable it to focus on prolific upstream prospects globally, given a number of major projects coming online over the next few years. Markedly, the largest publicly-traded energy company made 13 offshore oil discoveries in Guyana, where it intends to focus more. Moreover, the company made the world's third biggest natural gas discovery in the last two years in the Glaucus-1 well, located off the coast of Cyprus. The new discovery may comprise 5-8 trillion cubic feet of natural gas resource. Notably, in a bid to address transport constraints and pump out five times more oil from the Permian through 2025, ExxonMobil is investing billions in the basin's midstream infrastructure. In addition to allowing it to focus on better opportunities, the divestments might enable the company to return cash to its shareholders through a long-awaited share buyback program.  Price Performance  The company has gained 5.7% year to date against the 2.2% decline of the industry  it belongs to.     Zacks Rank & Stocks to Consider  Currently, ExxonMobil has a Zacks Rank #3 (Hold). Some better-ranked players in the energy space are National Oilwell Varco, Inc. NOV  and NuStar Energy L.P. NS  , each holding a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  .  National Oilwell's 2019 earnings per share are expected to rise 100% year over year. NuStar Energy's third-quarter 2019 earnings per share are expected to gain more than 107% year over year.  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana. Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  NuStar Energy L.P. (NS): Free Stock Analysis Report   National Oilwell Varco, Inc. (NOV): Free Stock Analysis Report   Exxon Mobil Corporation (XOM): Free Stock Analysis Report   Repsol SA (REPYY): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Exxon Mobil Corporation XOM  is expected to sell some of its deep-water Gulf of Mexico (GoM) assets to Spanish integrated energy company Repsol, S.A. REPYY  , per Reuters. The divestment is expected to fetch ExxonMobil up to $1 billion.",
    "Notably, ExxonMobil - which was recently dropped from the S&P 500 Index's top 10 companies, ending a nine-decade-long streak - had expressed interest to divest some of the operated and non-operated assets in the region last October. The deal with Repsol requires approval from ExxonMobil's partners in the related projects, who may have preferential rights to acquire the assets. While buying out the assets would increase Repsol's footprint in the area, it will help ExxonMobil with its divestment plans.",
    "The company intends to generate $15 billion in cash through 2025 by selling assets. This might include the divestment of stakes in oil and natural gas resources in U.K. North Sea after more than 50 years of presence in the region.",
    " Divestment Rationale ",
    "The company always looks for better opportunities. The divestment of GoM assets will likely enable it to focus on prolific upstream prospects globally, given a number of major projects coming online over the next few years.",
    "Markedly, the largest publicly-traded energy company made 13 offshore oil discoveries in Guyana, where it intends to focus more. Moreover, the company made the world's third biggest natural gas discovery in the last two years in the Glaucus-1 well, located off the coast of Cyprus. The new discovery may comprise 5-8 trillion cubic feet of natural gas resource. Notably, in a bid to address transport constraints and pump out five times more oil from the Permian through 2025, ExxonMobil is investing billions in the basin's midstream infrastructure.",
    "In addition to allowing it to focus on better opportunities, the divestments might enable the company to return cash to its shareholders through a long-awaited share buyback program.",
    " Price Performance ",
    "The company has gained 5.7% year to date against the 2.2% decline of the industry  it belongs to.",
    " Zacks Rank & Stocks to Consider ",
    "Currently, ExxonMobil has a Zacks Rank #3 (Hold). Some better-ranked players in the energy space are National Oilwell Varco, Inc. NOV  and NuStar Energy L.P. NS  , each holding a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  . ",
    "National Oilwell's 2019 earnings per share are expected to rise 100% year over year.",
    "NuStar Energy's third-quarter 2019 earnings per share are expected to gain more than 107% year over year.",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:16:00"
}