{
  "url": "https://www.nasdaq.com/article/indias-crashing-vehicle-sales-have-yet-to-burn-crude-oil-imports-20190905-00059",
  "title": "India's crashing vehicle sales have yet to burn crude oil imports - Nasdaq.com",
  "text": [
    "By Clyde Russell",
    "(The opinions expressed here are those of the author, a columnist for Reuters.)",
    "LAUNCESTON, Australia, Sept 5 (Reuters) - India's car manufacturers are in deep strife with slumping sales amid a broader slowdown in economic growth, but one element missing in the bearish narrative is a matching drop in crude oil imports.",
    "India's passenger vehicle sales are likely to have dropped for a tenth consecutive month in August, with commercial vehicle sales also experiencing a slump.",
    "August sales data from India's top six car makers, including Suzuki Motor Corp's  and Toyota Motor Corp's  local businesses, shows that passenger vehicle sales plunged 34% from the same month in 2018. These six manufacturers make up more than 90% share of the market. ",
    "Data from Tata Motors  and Mahindra & Mahindra , which together account for about two-thirds of the commercial vehicles market, show that sales of trucks, an indicator of economic activity, fell by almost 40% in August.",
    "While crude oil imports are down this year in India, the decline hasn't been anywhere near as dramatic as for vehicle sales.",
    "In the first seven months of the year, crude imports were 4.55 million barrels per day (bpd), down 1.3% from the 4.61 million bpd for the same period in 2018, according to data from shipping and industry sources. ",
    "Final figures aren't yet available for August, but Refinitiv vessel-tracking data suggests that a small increase from July's imports is likely.",
    "It's also worth noting that India's crude imports are likely to have been somewhat crimped in recent months by the impact of U.S. sanctions on Iran.",
    "U.S. waivers to eight purchasers of Iranian crude, including India, expired at the start of May, resulting in India importing no cargoes from the Islamic Republic in both June and July.",
    "This is a dramatic shift from 2018, when India's crude imports from Iran were 611,800 bpd in the first seven months of the year, but only 191,600 bpd in the same period this year.",
    "While India has increased imports from Iraq, Saudi Arabia and the United States among others, the disruption from having to cease purchases from Iran may well have made imports lower than they otherwise would have been in recent months.",
    "FUEL DEMAND",
    "It's also not the case that Indian refiners have been exporting more refined fuels such as diesel and gasoline, with product exports actually rising in July to 5.07 million tonnes from June's 4.69 million, although they were down slightly from 5.34 million in July 2018. ",
    "Despite the poor vehicle sales, India's fuel demand also appears to be holding up, with domestic sales rising 3.3% in July to 17.58 million tonnes from the same month a year ago. ",
    "This was the biggest percentage increase since January this year and was led by increases in sales of diesel and gasoline, as well as bitumen.",
    "The relatively stable crude import and domestic fuel sales data appears to be inconsistent with the weak automotive sector and slowing economic growth, with gross domestic product dropping to a six-year low of 5.0% year-on-year in the second quarter.",
    "It's possible that there is a lag between the crashing vehicle sales, slower economic growth and fuel demand, meaning the impact has yet to show up in crude import figures.",
    "This suggests that one of the engines of global crude oil demand growth is likely to splutter in coming months, a further bearish signal for prices.",
    "However, it will also be worth monitoring to see if India's government acts on calls from the automotive sector for tax cuts in order to stimulate demand.",
    "But even if the government does act to stimulate demand, it may take some time to work, meaning the risks for India's crude oil demand are biased to the downside in coming months."
  ],
  "published_datetime": "2019-09-05 02:17:00"
}