{
  "url": "https://www.nasdaq.com/article/5-dow-jones-industrial-average-stocks-selling-off-hard-cm1207484",
  "title": "5 Dow Jones Industrial Average Stocks Selling Off Hard - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Stocks are on a slide in the beginning of the month of September, rattled by the imposition of new tariffs by the U.S. and China as well as a drop in manufacturing activity into contractionary territory. The bulls have had things all their way in recent weeks, thanks to a rate cut by the Federal Reserve and President Donald Trump's constant teasing that a trade deal with China could still happen soon.",
    "But that's changing now. Here are five Dow Jones Industrial Average components that are under pressure:",
    "Shares of American Express (NYSE: AXP ) are dropping to test critical support from the August lows as a violation of the 200-day moving average looks likely. Just a retest would be worth a loss of a little more than 4% from here. The company will next report results on Oct. 18 before the bell. Analysts are looking for earnings of $2.03 per share on revenues of nearly $11 billion.",
    "Boeing (NYSE: BA ) shares have fallen back below their 200-day moving average after stalling at overhead resistance set between $360-$380 on reports the re-certification of the 737 MAX could take longer than previously believed. The company will next report results on Oct. 23 before the bell. Analysts are looking for earnings of $5.12 per share on revenues of $28.4 billion.",
    "Shares of Cisco Systems (NASDAQ: CSCO ) look ready to break down out of a month-long consolidation pattern with a return to levels not seen since early February - capping a decline of more than 20% from the highs reached in the middle of July. The company will next report results on Nov. 13 after the close. Analysts are looking for earnings of 81 cents per share on revenues of $13.1 billion.",
    "Chevron (NYSE: CVX ) shares look vulnerable to a breakdown out of a multi-month consolidation range going back to February as the 200-day moving average looks like it's unable to hold. This caps a sideways range that has been in play since early 2018 and will likely give way to another test of the 200-week moving average, which would be worth a loss of more than 10% from here. The company will next report results on Nov. 1 before the bell. Analysts are looking for earnings of $1.89 per share on revenues of $41.2 billion.",
    "Shares of 3M (NYSE: MMM ) continue to languish below their 50-day and 200-day moving averages, capping a decline of more than 25% from the highs hit back in April. Shares have been under pressure amid earnings headwinds, including slowdowns in its industrial segment (especially automotive) and healthcare. The company will next report results on Oct. 24 before the bell. Analysts are looking for earnings of $2.55 per share on revenues of $8.3 billion.",
    "The post 5 Dow Jones Industrial Average Stocks Selling Off Hard appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:46:26"
}