{
  "url": "https://www.nasdaq.com/article/factors-you-need-to-know-ahead-of-caseys-casy-q1-earnings-cm1207329",
  "title": "Factors You Need to Know Ahead of Casey's (CASY) Q1 Earnings - Nasdaq.com",
  "text": [
    "  Casey's General Stores, Inc. CASY  is likely to register improvement in the bottom line when i t report  s first-quarter fiscal 2020 numbers. Notably, this operator of convenience stores had reported solid earnings and comfortably surpassed the Zacks Consensus Estimate in the preceding four quarters. In the trailing four quarters, the company outperformed the Zacks Consensus Estimate by average of 30.3%. In the last reported quarter, the company delivered positive earnings surprise of 61.9%. In the to-be-reported quarter, the Zacks Consensus Estimate for earnings is currently pegged at $1.99, suggesting an improvement of 4.7% from the year-ago quarter's reported figure. We note that the Zacks Consensus Estimate has remained unchanged in the past 30 days. The Zacks Consensus Estimate for revenues is pegged at $2,608 million, indicating an improvement of about 0.8% from the year-ago period. We note that the top and the bottom line had increased 4.3% and 33.3%, respectively, in the last reported quarter.  Factors Likely to Drive Results  Casey's remains on track with its value creation plan to improve sales. This includes new fleet card program, price and product optimization, loyalty program, digital engagements comprising mobile app and online ordering capabilities, cost containment efforts and capital reallocation plan. However, the company is grappling with soft fuel gallons same-store sales. Fuel gallons same-store sales decreased 2.8% during the fourth quarter of fiscal 2019 against growth of 2% witnessed in the year-ago quarter. The company witnessed fuel gallons same-store sales decline of 3.4% in the third quarter. We also remain concerned about higher operating expenses, which rose 9.6% during the fourth quarter of fiscal 2019. This follows an increase of 5.7% during the preceding quarter. Certainly, any increase in operating expenses may weigh on margins. Further, any rise in wholesale fuel costs and higher input costs remain concerns.   Caseys General Stores, Inc. Price, Consensus and EPS     Surprise          Caseys General Stores, Inc.   price-consensus-eps-surprise-chart    |   Caseys General Stores, Inc. Quote    What our Model Says?  Our proven model does not show that Casey's is likely to beat estimates this quarter. A stock needs to have - a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) as well as a positive Earnings ESP  - for this to happen. You can uncover the best stocks to buy or sell before they're reported with our Earnings ESP Filter  . Though Casey's has a Zacks Rank #1, its Earnings ESP of 0.00% makes surprise prediction difficult.  Stocks Poised to Beat Earnings Estimates  Here are some companies you may consider as our model shows that these have the right combination of elements to pos t earnings  beat. Zumiez ZUMZ  has an Earnings ESP of +12.50% and a Zacks Rank #2. You can see  the complete list of today's Zacks #1 Rank stocks   here   . General Mills GIS  has an Earnings ESP of +0.37% and a Zacks Rank #2. Costco COST  has an Earnings ESP of +0.62% and a Zacks Rank #3.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  General Mills, Inc. (GIS): Free Stock Analysis Report   Zumiez Inc. (ZUMZ): Free Stock Analysis Report   Caseys General Stores, Inc. (CASY): Free Stock Analysis Report   Costco Wholesale Corporation (COST): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Casey's General Stores, Inc. CASY  is likely to register improvement in the bottom line when i t report  s first-quarter fiscal 2020 numbers. Notably, this operator of convenience stores had reported solid earnings and comfortably surpassed the Zacks Consensus Estimate in the preceding four quarters.",
    "In the trailing four quarters, the company outperformed the Zacks Consensus Estimate by average of 30.3%. In the last reported quarter, the company delivered positive earnings surprise of 61.9%.",
    "In the to-be-reported quarter, the Zacks Consensus Estimate for earnings is currently pegged at $1.99, suggesting an improvement of 4.7% from the year-ago quarter's reported figure. We note that the Zacks Consensus Estimate has remained unchanged in the past 30 days. The Zacks Consensus Estimate for revenues is pegged at $2,608 million, indicating an improvement of about 0.8% from the year-ago period. We note that the top and the bottom line had increased 4.3% and 33.3%, respectively, in the last reported quarter.",
    " Factors Likely to Drive Results ",
    "Casey's remains on track with its value creation plan to improve sales. This includes new fleet card program, price and product optimization, loyalty program, digital engagements comprising mobile app and online ordering capabilities, cost containment efforts and capital reallocation plan.",
    "However, the company is grappling with soft fuel gallons same-store sales. Fuel gallons same-store sales decreased 2.8% during the fourth quarter of fiscal 2019 against growth of 2% witnessed in the year-ago quarter. The company witnessed fuel gallons same-store sales decline of 3.4% in the third quarter.",
    "We also remain concerned about higher operating expenses, which rose 9.6% during the fourth quarter of fiscal 2019. This follows an increase of 5.7% during the preceding quarter. Certainly, any increase in operating expenses may weigh on margins. Further, any rise in wholesale fuel costs and higher input costs remain concerns.",
    "  Caseys General Stores, Inc. Price, Consensus and EPS     Surprise          Caseys General Stores, Inc.   price-consensus-eps-surprise-chart    |   Caseys General Stores, Inc. Quote  ",
    " Caseys General Stores, Inc. Price, Consensus and EPS     Surprise ",
    " Caseys General Stores, Inc.   price-consensus-eps-surprise-chart    |   Caseys General Stores, Inc. Quote ",
    " What our Model Says? ",
    "Our proven model does not show that Casey's is likely to beat estimates this quarter. A stock needs to have - a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) as well as a positive Earnings ESP  - for this to happen. You can uncover the best stocks to buy or sell before they're reported with our Earnings ESP Filter  .",
    "Though Casey's has a Zacks Rank #1, its Earnings ESP of 0.00% makes surprise prediction difficult.",
    " Stocks Poised to Beat Earnings Estimates ",
    "Here are some companies you may consider as our model shows that these have the right combination of elements to pos t earnings  beat.",
    "Zumiez ZUMZ  has an Earnings ESP of +12.50% and a Zacks Rank #2. You can see  the complete list of today's Zacks #1 Rank stocks   here   .",
    "General Mills GIS  has an Earnings ESP of +0.37% and a Zacks Rank #2.",
    "Costco COST  has an Earnings ESP of +0.62% and a Zacks Rank #3.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:38:00"
}