{
  "url": "https://www.nasdaq.com/article/european-shares-steady-ahead-of-ecb-meeting-20190912-00130",
  "title": "European shares steady ahead of ECB meeting - Nasdaq.com",
  "text": [
    "By Susan Mathew and Sagarika Jaisinghani",
    "Sept 12 (Reuters) - European shares were steady on Thursday after hitting a six-week high earlier in the session on further signs of detente between the United States and China over trade.",
    "Focus was on the European Central Bank's monetary policy decision due at 1145 GMT, with investors widely expecting another round of stimulus to prop up an ailing euro zone economy.",
    "That rally was led by commodity-linked stocks  and luxury goods , which derive most of their demand from China. MET/LIRONORE/",
    "After Beijing decided to exempt some U.S. goods from additional tariffs on Wednesday, Washington reciprocated by announcing a short delay to scheduled tariff increases on billions worth of Chinese goods.",
    "Optimism about a de-escalation in the economically damaging Sino-U.S. trade war and expectations of monetary stimulus from the ECB have led major European indices to track higher this week. Euro zone stocks  were up 0.2%.",
    "The ECB is expected to cut its deposit rate by at least 10 basis points at a time when the euro zone's biggest economy - Germany - might be slipping towards recession. ",
    "The Ifo institute on Thursday cut its 2019 growth forecast for Germany and said a recession would hit Europe's largest economy in the third quarter. ",
    "\"No matter what package we get today, the effectiveness is going to be tiny in comparison to what other measures could be taken by non-central bank authorities,\" said Oanda analyst Craig Erlam. ",
    "\"In Germany, for example, a fiscal stimulus would be far more effective because the economy is so negatively impacted by a slowdown in global trade.\"",
    "Pressure has mounted for central banks to take steps to stem a slowdown in global growth. The U.S. Federal Reserve is also expected to cut interest rates again at its meeting next week.",
    "Banks  - one of the main beneficiaries of an investor pivot into value stocks earlier this week - were trading slightly in the red.",
    "In corporate news, Anheuser-Busch InBev  was the biggest boost to the STOXX 600 after the company said it would again explore an initial public offering in Hong Kong for its Asia Pacific unit two months after cancelling the planned listing. ",
    "Conversely, transportation firm Alstom fell after French conglomerate Bouygues  halved its stake in the company. "
  ],
  "published_datetime": "2019-09-12 05:03:00"
}