{
  "url": "https://www.nasdaq.com/article/feds-bullard-says-aggressive-step-needed-to-align-fed-with-markets-insure-against-trade-war-20190903-01203",
  "title": "Fed's Bullard says \"aggressive\" step needed to align Fed with markets, insure against trade war - Nasdaq.com",
  "text": [
    "ST. LOUIS, Sept 3 (Reuters) - The U.S. Federal Reserve should cut interest rates by half a percentage point at its meeting in two weeks to get ahead of both financial market expectations for a rate cut and a global trade war that has become a broader \"reckoning\" over how the world economy is organized, St. Louis Federal Reserve President James Bullard said in an interview on Tuesday.",
    "Global investors have sent bond yields plummeting in recent weeks to record lows, leaving the Fed's overnight policy rate seemingly out of line, Bullard said.",
    "Economic data on Tuesday meanwhile showed the U.S. manufacturing sector had contracted for the first time in three years amid slowing global economic growth and as China and the U.S. ratchet up tariffs on each other.",
    "\"We are too high,\" Bullard said of Fed interest rates, noting that the central bank's current target policy rate of between 2% and 2.25% was higher than the current yield of all U.S. Treasury securities. Typically the Fed's rate should form a baseline for the determination of other rates, but even the 30- year bond has dipped below 2%.",
    "U.S. stocks slid on Tuesday, and benchmark Treasury yields hit their lowest in three years, as investors fretted that the drawn-out trade war was taking an increasing toll on the U.S. and global economy. European stocks also were down while safe-haven gold rallied.",
    "RESPECTING THE SIGNAL",
    "While central bankers often say they don't let financial markets dictate policy, \"in this situation I would respect the market signal,\" Bullard said. \"We should have a robust debate about moving 50 basis points at this meeting...It'd be better in my mind to go ahead and get realigned right now,\" rather than moving only a quarter point in September and again in October.",
    "\"Why do that? Why not just get to the right point today?\"",
    "Bullard's comments are the bluntest to date by a current voter on Fed policy endorsing deeper rate cuts in response to the wave of uncertainty touched off by rising tariffs, the sometimes whipsaw economic policy developments of recent months, and weak U.S. inflation.",
    "Though the recommendation comes close to the sort of action President Donald Trump has demanded of the Fed, which he has accused of sabotaging his economic plans, Bullard's position is rooted in a dim view of where the trade debate is heading.",
    "\"This is an unraveling of the trade liberalization process that has been going on since World War Two\" and it could take \"a long time\" to sort out, Bullard said. \"To put it in a nutshell, politicians generally speaking do not want free trade,\" and in the case of the United States and China may see political advantage in appearing tough.",
    "\"The incentives are not all that great for either side to come to a deal.\"",
    "The Fed is widely expected to cut rates at its Sept. 17-18 meeting - investors see a quarter point reduction as likely, with one or two more to follow over the course of the year - but the decision is not clear cut.",
    "Some current voters on the Fed's rate-setting committee see no need to lower interest rates with unemployment also at a record low and the economy continuing to grow.",
    "In recent remarks Fed Chair Jerome Powell has indicated he is open to lowering rates again, but has not hinted at any particular timing or pace for doing so.                               "
  ],
  "published_datetime": "2019-09-03 16:33:00"
}