{
  "url": "https://www.nasdaq.com/article/us-manufacturing-shrinks-10year-yield-hits-threeyear-low-20190903-01031",
  "title": "U.S. manufacturing shrinks, 10-year yield hits three-year low - Nasdaq.com",
  "text": [
    "By Kate Duguid",
    "NEW YORK, Sept 3 (Reuters) - U.S. Treasury yields fell on Tuesday, with the benchmark 10-year yield hitting its lowest since July 2016, after U.S. manufacturing data showed the first contraction since 2016 on worries about a weakening global economy and U.S.-China trade tensions.",
    "The Institute for Supply Management (ISM) said its index of national factory activity decreased in August to 49.1, the lowest since January 2016. A reading below 50 indicates contraction in manufacturing, which accounts for about 12% of the U.S. economy. Last month marked the first time since August 2016 that the index broke below the 50 threshold. ",
    "Concerns about the economy, which is in its longest expansion ever, were also exacerbated by other data on Tuesday showing construction spending barely rising in July. The economy's waning fortunes have been blamed on the White House's year-long trade war with China.",
    "President Donald Trump said on Tuesday trade talks with China were going well, but he warned that he would be \"tougher\" if the discussions dragged on past the 2020 U.S. election and he won a second term. ",
    "Across maturities, yields fell. The 10-year yield  fell as low as 1.4290% and was last down 3.7 basis points to 1.4691%. The two-year yield  was 4.2 basis points lower at 1.4640%. The fall was greater in shorter-dated maturities, enough to steepen the yield curve out of inversion. The spread between two- and 10-year yields  was last at 0.20 basis points.",
    "The ISM report was \"yet another piece of data showing a weaker manufacturing sector. That's the story,\" said Michael Pond, head of global inflation-linked research at Barclays.",
    "\"To the extent that manufacturing remains weak, that increases the potential chance for a recession down the road. That means lower yields and lower inflation expectations.\"",
    "The 30-year Treasury yield  fell to 1.9612%, near the historic low of 1.9050% hit on Aug. 28. The 30-year interest swap rate fell to a record low of 1.4762% on Tuesday after closing at 1.54% on Friday."
  ],
  "published_datetime": "2019-09-03 15:27:00"
}