{
  "url": "https://www.nasdaq.com/article/cimarex-xec-down-63-since-last-earnings-report-can-it-rebound-cm1207340",
  "title": "Cimarex (XEC) Down 6.3% Since Last Earnings Report: Can It Rebound? - Nasdaq.com",
  "text": [
    " It has been about a month since the las t earnings  report for Cimarex Energy (XEC). Shares have lost about 6.3% in that time frame, underperforming the S&P 500. Will the recent negative trend continue leading up to its next earnings release, or is Cimarex due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important catalysts.  Cimarex Q2 Earnings Miss Estimates on Lower Gas &   Liquid Prices  Cimarex Energy reported second-quarter 2019 earnings per share of 82 cents, missing the Zacks Consensus Estimate of $1.20 and declining from the year-ago quarter's $1.59. Total revenues of $546 million lagged the Zacks Consensus Estimate of $600 million and declined from the year-ago quarter's $556 million.   The weak June quarter results can be attributed to lower price realizations from natural gas and liquids.  Operational Highlights  In the quarter under review, total production averaged 274.8 thousand barrels of oil equivalent (MBOE) per day, up 30% year over year on considerably higher activities in the Permian Basin. Oil volumes rose 35.3% to 83.4 thousand barrels per day (MBbls/d) on a year-over-year basis. Moreover, natural gas production increased 23.4% year over year to 665.8 MMcf/d. Natural gas liquids (NGL) volumes jumped 34.3% to 80.4 MBbls/d. With realized prices for natural gas plunging almost 70% to 50 cents per thousand cubic feet, the same for crude oil and NGL fell 11.1% and 41.3% year over year to $54.24 per barrel and $13.08 per barrel, respectively.          Through the June quarter, this upstream energy player brought online 110 gross wells.    Financial Condition  As of Jun 30, 2019, the company had cash and cash equivalents of $19.4 million. Net long-term debt was almost $2 billion, which represents a debt-to-capitalization ratio of almost 33.9%. Cimarex's cash flow from operating activities, adjusted, totaled $336.4 million, down from $349.5 million in the prior-year quarter. The company spent almost $325 million on exploration and development in the June quarter.   Guidance  Cimarex projects total daily production for the September quarter of 2019 in the range of 265-279 MBoE. The company also issued its projections of daily oil equivalent productions for 2019 in the band of 263-272 MBoE. For 2019, the company continues to project capital spending between $1.4 billion and $1.5 billion on exploration & development activities.   How Have Estimates Been Moving Since Then?  It turns out, estimates review have trended downward during the past month. The consensus estimate has shifted -11.34% due to these changes.  VGM Scores  Currently, Cimarex has an average Growth Score of C, though it is lagging a lot on the Momentum Score front with an F. However, the stock was allocated a grade of A on the value side, putting it in the top quintile for this investment strategy. Overall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Cimarex has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Cimarex Energy Co (XEC): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "It has been about a month since the las t earnings  report for Cimarex Energy (XEC). Shares have lost about 6.3% in that time frame, underperforming the S&P 500.",
    "Will the recent negative trend continue leading up to its next earnings release, or is Cimarex due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important catalysts.  Cimarex Q2 Earnings Miss Estimates on Lower Gas &   Liquid Prices  Cimarex Energy reported second-quarter 2019 earnings per share of 82 cents, missing the Zacks Consensus Estimate of $1.20 and declining from the year-ago quarter's $1.59. Total revenues of $546 million lagged the Zacks Consensus Estimate of $600 million and declined from the year-ago quarter's $556 million.   The weak June quarter results can be attributed to lower price realizations from natural gas and liquids.  Operational Highlights  In the quarter under review, total production averaged 274.8 thousand barrels of oil equivalent (MBOE) per day, up 30% year over year on considerably higher activities in the Permian Basin. Oil volumes rose 35.3% to 83.4 thousand barrels per day (MBbls/d) on a year-over-year basis. Moreover, natural gas production increased 23.4% year over year to 665.8 MMcf/d. Natural gas liquids (NGL) volumes jumped 34.3% to 80.4 MBbls/d. With realized prices for natural gas plunging almost 70% to 50 cents per thousand cubic feet, the same for crude oil and NGL fell 11.1% and 41.3% year over year to $54.24 per barrel and $13.08 per barrel, respectively.          Through the June quarter, this upstream energy player brought online 110 gross wells.    Financial Condition  As of Jun 30, 2019, the company had cash and cash equivalents of $19.4 million. Net long-term debt was almost $2 billion, which represents a debt-to-capitalization ratio of almost 33.9%. Cimarex's cash flow from operating activities, adjusted, totaled $336.4 million, down from $349.5 million in the prior-year quarter. The company spent almost $325 million on exploration and development in the June quarter.   Guidance  Cimarex projects total daily production for the September quarter of 2019 in the range of 265-279 MBoE. The company also issued its projections of daily oil equivalent productions for 2019 in the band of 263-272 MBoE. For 2019, the company continues to project capital spending between $1.4 billion and $1.5 billion on exploration & development activities. ",
    " Cimarex Q2 Earnings Miss Estimates on Lower Gas &   Liquid Prices ",
    "Cimarex Energy reported second-quarter 2019 earnings per share of 82 cents, missing the Zacks Consensus Estimate of $1.20 and declining from the year-ago quarter's $1.59.",
    "Total revenues of $546 million lagged the Zacks Consensus Estimate of $600 million and declined from the year-ago quarter's $556 million.  ",
    "The weak June quarter results can be attributed to lower price realizations from natural gas and liquids.",
    " Operational Highlights ",
    "In the quarter under review, total production averaged 274.8 thousand barrels of oil equivalent (MBOE) per day, up 30% year over year on considerably higher activities in the Permian Basin.",
    "Oil volumes rose 35.3% to 83.4 thousand barrels per day (MBbls/d) on a year-over-year basis. Moreover, natural gas production increased 23.4% year over year to 665.8 MMcf/d. Natural gas liquids (NGL) volumes jumped 34.3% to 80.4 MBbls/d.",
    "With realized prices for natural gas plunging almost 70% to 50 cents per thousand cubic feet, the same for crude oil and NGL fell 11.1% and 41.3% year over year to $54.24 per barrel and $13.08 per barrel, respectively.         ",
    "Through the June quarter, this upstream energy player brought online 110 gross wells.  ",
    " Financial Condition ",
    "As of Jun 30, 2019, the company had cash and cash equivalents of $19.4 million. Net long-term debt was almost $2 billion, which represents a debt-to-capitalization ratio of almost 33.9%.",
    "Cimarex's cash flow from operating activities, adjusted, totaled $336.4 million, down from $349.5 million in the prior-year quarter. The company spent almost $325 million on exploration and development in the June quarter. ",
    " Guidance ",
    "Cimarex projects total daily production for the September quarter of 2019 in the range of 265-279 MBoE. The company also issued its projections of daily oil equivalent productions for 2019 in the band of 263-272 MBoE.",
    "For 2019, the company continues to project capital spending between $1.4 billion and $1.5 billion on exploration & development activities.",
    " How Have Estimates Been Moving Since Then? ",
    "It turns out, estimates review have trended downward during the past month. The consensus estimate has shifted -11.34% due to these changes.",
    " VGM Scores ",
    "Currently, Cimarex has an average Growth Score of C, though it is lagging a lot on the Momentum Score front with an F. However, the stock was allocated a grade of A on the value side, putting it in the top quintile for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Cimarex has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:43"
}