{
  "url": "https://www.nasdaq.com/article/heres-why-nektar-therapeutics-plummeted-38-in-august-cm1207510",
  "title": "Here's Why Nektar Therapeutics Plummeted 38% in August - Nasdaq.com",
  "text": [
    " What happened Shares of   Nektar Therapeutics    (NASDAQ: NKTR) dropped 38% in August, according to data provided   by      S&P Global Market Intelligence    , after the biotech   disclosed    manufacturing issues with two batches of bempegaldesleukin   (bempeg), a cancer treatment that it's developing with   Bristol-Myers Squibb    (NYSE: BMY) . So what While manufacturing issues are a serious problem, the   disclosure could end up being a minor issue for the company:   The batches that had problems had lower clinical benefit;       that's to be expected if they're inferior product, but it       also means the actual average efficacy from the potent drug       is higher than previously reported.makeArticleAd();   The batches with issues aren't being used in pivotal       trials, the ones the Food and Drug Administration (FDA)       reviews as a basis for approval.   Surely the FDA won't be happy about the manufacturing       issues, but Nektar Therapeutics has \"developed a       comprehensive control strategy\" to prevent manufacturing       issues in the future, and it has submitted it to the agency       in collaboration with Bristol-Myers Squibb.   The biggest unknown issue comes from the partnership with   Bristol-Myers Squibb and whether its pharma partner will commit   to additional studies combining bempeg with Bristol's Opdivo, a   decision that might not come until October.   Image source: Getty Images.  Now what Given the   plethora of biotech companies    available to invest in, it's understandable that investors might   be a little tepid about Nektar Therapeutics' missteps. But the   issues don't seem to have compromised the integrity of the data   to be used for approval, and the biotech appears to have a handle   on the situation. The future of the collaboration with Bristol-Myers is   certainly an unknown, but Bristol-Myers   paid so much    for the rights to bempeg that it seems unlikely it would give   them up. And even if Bristol-Myers did, Opdivo, which targets   PD-1, is in a class of drugs with plenty of competition, so   Nektar could likely find another partner to team up with.   10 stocks we like better than Nektar     Therapeutics       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Nektar Therapeutics     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Brian Orelli      and The Motley Fool have no position in any of the stocks     mentioned. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   Nektar Therapeutics    (NASDAQ: NKTR) dropped 38% in August, according to data provided   by      S&P Global Market Intelligence    , after the biotech   disclosed    manufacturing issues with two batches of bempegaldesleukin   (bempeg), a cancer treatment that it's developing with   Bristol-Myers Squibb    (NYSE: BMY) .",
    "While manufacturing issues are a serious problem, the   disclosure could end up being a minor issue for the company:",
    "The batches that had problems had lower clinical benefit;       that's to be expected if they're inferior product, but it       also means the actual average efficacy from the potent drug       is higher than previously reported.",
    "The batches with issues aren't being used in pivotal       trials, the ones the Food and Drug Administration (FDA)       reviews as a basis for approval.",
    "Surely the FDA won't be happy about the manufacturing       issues, but Nektar Therapeutics has \"developed a       comprehensive control strategy\" to prevent manufacturing       issues in the future, and it has submitted it to the agency       in collaboration with Bristol-Myers Squibb.",
    "The biggest unknown issue comes from the partnership with   Bristol-Myers Squibb and whether its pharma partner will commit   to additional studies combining bempeg with Bristol's Opdivo, a   decision that might not come until October.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Given the   plethora of biotech companies    available to invest in, it's understandable that investors might   be a little tepid about Nektar Therapeutics' missteps. But the   issues don't seem to have compromised the integrity of the data   to be used for approval, and the biotech appears to have a handle   on the situation.",
    "The future of the collaboration with Bristol-Myers is   certainly an unknown, but Bristol-Myers   paid so much    for the rights to bempeg that it seems unlikely it would give   them up. And even if Bristol-Myers did, Opdivo, which targets   PD-1, is in a class of drugs with plenty of competition, so   Nektar could likely find another partner to team up with.",
    "  10 stocks we like better than Nektar     Therapeutics       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Nektar Therapeutics     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Nektar     Therapeutics       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Nektar Therapeutics     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Brian Orelli      and The Motley Fool have no position in any of the stocks     mentioned. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 03:14:00"
}