{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-jj-eli-lilly-bristol-myers-roche-and-abbvie-cm1206589",
  "title": "The Zacks Analyst Blog Highlights: J&J, Eli Lilly, Bristol-Myers, Roche and AbbVie - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 3, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: J&J JNJ  , Eli Lilly LLY  , Bristol-Myers BMY  , Roche RHHBY  and AbbVie ABBV  .  Here are highlights from Friday's Analyst Blog:    Pharma Stock Roundup: JNJ, LLY, BMY & More   This week, J&J received an unfavorable ruling in the litigation related to abuse of its opioid-based drugs. The FDA granted approval to Lilly's psoriasis injection for active ankylosing spondylitis (AS) while the European Commission approved Bristol-Myers' multiple myeloma drug, Empliciti and Roche's PD-L1 inhibitor, Tecentriq in combination use for an expanded patient population.   Recap of the Week's Most Important Stories     Oklahoma Judge Rules Against J&J in Opioid Lawsuit:   J&J was ordered by a district court in Oklahoma  to pay $572 million to the state of Oklahoma in connection with a lawsuit filed by the latter. The lawsuit claimed that J&J was one of the several companies whose opioid-based drugs - Duragesic, Nucynta and Nucynta ER - were responsible for fueling the state's opioid epidemic. However, the fine was much lower than Oklahoma state's demand of $17 billion to be paid over 30 years by J&J. The company has decided to appeal against the ruling. The company is confident that its drugs were not responsible for the opioid crisis in the state and the ruling is inconsistent with the available facts and law. There are still a number of opioid-related lawsuits pending with about 1900 suits consolidated at the federal level in the state of Ohio, with trial set to begin in October this year.   FDA Approves Lilly's Taltz for Ankylosing Spondylitis:   Lilly gained FDA approval for its psoriasis injection Taltz  for its third indication - active ankylosing spondylitis (AS). A type of spondyloarthritis, AS affects the pelvic joints and spine that can cause severe back pain. The approval was based on data from two phase III studies, COAST-V and COAST-W. Taltz is presently marketed for treating moderate-to-severe plaque psoriasis and active psoriatic arthritis. Lilly's Olumiant  (baricitinib) met the primary endpoint in a phase III BREEZE-AD7 study, evaluating it in a new indication - moderate-to-severe atopic dermatitis (AD), a type of eczema. Lilly is conducting five studies on baricitinib under the AD program and BREEZE-AD7 is the third study to be completed this year. BREEZE-AD1 and BREEZE-AD2 were the other two studies wherein baricitinib 4 mg and 2 mg both met the primary endpoint. Top-line data from the remaining two studies are expected to be presented later this year or early next year.   EU Approval for Expanded Label of Bristol-Myers & Roche's   Cancer Medicines:   The European Commission granted approval for label expansion of Bristol-Myers's multiple myeloma drug, Empliciti  . The drug is now approved in the EU for use in combination with Celgene's Pomalyst (pomalidomide) and low-dose dexamethasone for the treatment of patients with relapsed/refractory multiple myeloma (r/rMM) in second- or later-line settings. Empliciti was approved for this combination use in the United States in November last year The regulatory agency also gave approval to Roche's Tecentriq  in combination with Celgene's Abraxane for the treatment of adults with PD-L1-positive, metastatic triple-negative breast cancer - a difficult-to-treat cancer. The drug was approved for the same combination use by the FDA, on an accelerated basis, in March this year. The approval was based on encouraging data from the phase III IMpassion130 study.   AbbVie Ends Rova-T Program:   AbbVie discontinued development of its cancer candidate rovalpituzumab tesirine or Rova-T as the third study on the candidate, MERU, also failed. The MERU study was evaluating Rova-T as a first-line maintenance therapy for advanced small-cell lung cancer (SCLC) compared to placebo. Interim data from the study demonstrated no survival benefit for patients treated with Rova-T. The lack of survival benefit led the Independent Data Monitoring Committee to recommend terminating MERU. Rova-T was added to AbbVie's portfolio, following the $5.8 billion acquisition of Stemcentrx in June 2016. In December, AbbVie stopped enrollment in a pivotal phase III study -TAHOE - evaluating Rova-T in second-line SCLC. In March 2018, Rova-T fell short of expectations in a phase II TRINITY study evaluating it in third-line or later SCLC. The failure of TRINITY and the halt on TAHOE had already raised skepticism on Rova-T's potential. Discontinuation of the candidate has now broughtinto question the viability of the Stemcentrx deal.   Bristol-Myers Expects Celgene Acquisition to Close by   Year-End:   Bristol-Myers moved a step closer toward the closure of its pending acquisition of Celgene this week as the latter signed a deal with Amgen to divest global commercial rights to its blockbuster psoriasis drug, Otezla  . Amgen will pay $13.4 billion in cash for the same to Celgene. Back in June, Bristol-Myers had announced plans to divest Otezla to be able to close the acquisition of Celgene on a timely basis in light of concerns expressed by the U.S. Federal Trade Commission (FTC). The sale of Otezla should now make it easier for Bristol-Myers to get FTC's approval and will also fund a part of its massive $74 billion cost of buying Celgene. So, the deal looks like a win-win for Bristol-Myers, which expects the merger to close by the end of this year. Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Roche Holding AG (RHHBY): Free Stock Analysis Report   Johnson & Johnson (JNJ): Free Stock Analysis Report   Eli Lilly and Company (LLY): Free Stock Analysis Report   Bristol-Myers Squibb Company (BMY): Free Stock Analysis Report   AbbVie Inc. (ABBV): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 3, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: J&J JNJ  , Eli Lilly LLY  , Bristol-Myers BMY  , Roche RHHBY  and AbbVie ABBV  .",
    " Here are highlights from Friday's Analyst Blog: ",
    "  Pharma Stock Roundup: JNJ, LLY, BMY & More  ",
    "This week, J&J received an unfavorable ruling in the litigation related to abuse of its opioid-based drugs. The FDA granted approval to Lilly's psoriasis injection for active ankylosing spondylitis (AS) while the European Commission approved Bristol-Myers' multiple myeloma drug, Empliciti and Roche's PD-L1 inhibitor, Tecentriq in combination use for an expanded patient population.",
    "  Recap of the Week's Most Important Stories  ",
    "  Oklahoma Judge Rules Against J&J in Opioid Lawsuit:   J&J was ordered by a district court in Oklahoma  to pay $572 million to the state of Oklahoma in connection with a lawsuit filed by the latter. The lawsuit claimed that J&J was one of the several companies whose opioid-based drugs - Duragesic, Nucynta and Nucynta ER - were responsible for fueling the state's opioid epidemic.",
    "However, the fine was much lower than Oklahoma state's demand of $17 billion to be paid over 30 years by J&J. The company has decided to appeal against the ruling. The company is confident that its drugs were not responsible for the opioid crisis in the state and the ruling is inconsistent with the available facts and law. There are still a number of opioid-related lawsuits pending with about 1900 suits consolidated at the federal level in the state of Ohio, with trial set to begin in October this year.",
    "  FDA Approves Lilly's Taltz for Ankylosing Spondylitis:   Lilly gained FDA approval for its psoriasis injection Taltz  for its third indication - active ankylosing spondylitis (AS). A type of spondyloarthritis, AS affects the pelvic joints and spine that can cause severe back pain. The approval was based on data from two phase III studies, COAST-V and COAST-W. Taltz is presently marketed for treating moderate-to-severe plaque psoriasis and active psoriatic arthritis.",
    "Lilly's Olumiant  (baricitinib) met the primary endpoint in a phase III BREEZE-AD7 study, evaluating it in a new indication - moderate-to-severe atopic dermatitis (AD), a type of eczema. Lilly is conducting five studies on baricitinib under the AD program and BREEZE-AD7 is the third study to be completed this year. BREEZE-AD1 and BREEZE-AD2 were the other two studies wherein baricitinib 4 mg and 2 mg both met the primary endpoint. Top-line data from the remaining two studies are expected to be presented later this year or early next year.",
    "  EU Approval for Expanded Label of Bristol-Myers & Roche's   Cancer Medicines:   The European Commission granted approval for label expansion of Bristol-Myers's multiple myeloma drug, Empliciti  . The drug is now approved in the EU for use in combination with Celgene's Pomalyst (pomalidomide) and low-dose dexamethasone for the treatment of patients with relapsed/refractory multiple myeloma (r/rMM) in second- or later-line settings. Empliciti was approved for this combination use in the United States in November last year",
    "The regulatory agency also gave approval to Roche's Tecentriq  in combination with Celgene's Abraxane for the treatment of adults with PD-L1-positive, metastatic triple-negative breast cancer - a difficult-to-treat cancer. The drug was approved for the same combination use by the FDA, on an accelerated basis, in March this year. The approval was based on encouraging data from the phase III IMpassion130 study.",
    "  AbbVie Ends Rova-T Program:   AbbVie discontinued development of its cancer candidate rovalpituzumab tesirine or Rova-T as the third study on the candidate, MERU, also failed. The MERU study was evaluating Rova-T as a first-line maintenance therapy for advanced small-cell lung cancer (SCLC) compared to placebo. Interim data from the study demonstrated no survival benefit for patients treated with Rova-T. The lack of survival benefit led the Independent Data Monitoring Committee to recommend terminating MERU. Rova-T was added to AbbVie's portfolio, following the $5.8 billion acquisition of Stemcentrx in June 2016.",
    "In December, AbbVie stopped enrollment in a pivotal phase III study -TAHOE - evaluating Rova-T in second-line SCLC. In March 2018, Rova-T fell short of expectations in a phase II TRINITY study evaluating it in third-line or later SCLC. The failure of TRINITY and the halt on TAHOE had already raised skepticism on Rova-T's potential. Discontinuation of the candidate has now broughtinto question the viability of the Stemcentrx deal.",
    "  Bristol-Myers Expects Celgene Acquisition to Close by   Year-End:   Bristol-Myers moved a step closer toward the closure of its pending acquisition of Celgene this week as the latter signed a deal with Amgen to divest global commercial rights to its blockbuster psoriasis drug, Otezla  . Amgen will pay $13.4 billion in cash for the same to Celgene. Back in June, Bristol-Myers had announced plans to divest Otezla to be able to close the acquisition of Celgene on a timely basis in light of concerns expressed by the U.S. Federal Trade Commission (FTC). The sale of Otezla should now make it easier for Bristol-Myers to get FTC's approval and will also fund a part of its massive $74 billion cost of buying Celgene. So, the deal looks like a win-win for Bristol-Myers, which expects the merger to close by the end of this year.",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:21:00"
}