{
  "url": "https://www.nasdaq.com/article/better-buy-scotts-miracle-gro-vs-innovative-industrial-properties-cm1207664",
  "title": "Better Buy: Scotts Miracle-Gro vs. Innovative Industrial Properties - Nasdaq.com",
  "text": [
    "  Marijuana is expected to be a huge growth   business    , with some on Wall Street projecting that legal pot sales could   eventually reach   a massive $166 billion a year    . If that forecast proves anywhere close to accurate, there could   be a lot of upside for both marijuana companies and the companies   that provide them with vital products and services. Which is   exactly where   Scotts Miracle-Gro    (NYSE: SMG) and   Innovative Industrial Properties    (NYSE: IIPR) come in. If you can't stomach the idea of owning a   marijuana stock, then these two industry suppliers are worth a   close look. Picking between the two, meanwhile, is getting more   difficult. What they do for marijuana growers Scotts operates primarily in the lawn care sector -- a slow   and boring business. However, a few years ago it decided to   branch out into the hydroponic space to take advantage of the   increasing legalization of marijuana. The subsidiary it launched   to cater to cannabis growers, Hawthorne Gardening Company, has   been growing quickly, and now accounts for around 20% of Scotts'   sales. So far, most of that growth has been driven by   acquisitions. However, managemen   t report    ed that in the company's fiscal third quarter, Hawthorne's   organic sales growth would have been nearly 50%, factoring out a   big acquisition made in mid-2018. That's impressive.   Image source: Getty ImagesmakeArticleAd();  Innovative Industrial Properties is a   real estate investment trust    (REIT) that owns grow houses in which marijuana companies   operate. So it provides places for the producers to grow their   cannabis, but its business is more nuanced than that. It has been   able to expand by acquiring facilities from marijuana companies,   then renting them back to the grower under long-term leases. This   provides liquidity to the growers that they can use to expand   their businesses, so it's a win/win situation. Innovative   increases the scale of its portfolio while simultaneously   supporting the cannabis industry's long-term growth. What if the marijuana sector doesn't grow as predicted? The first thing to note about Scotts is that its business   remains mostly focused on lawn care. That's the foundation on   which the company is building out its Hawthorne subsidiary. On   the one hand, that reduces the company's growth opportunity,   since the bottom-line impact of the fast-growing hydroponics unit   is diluted by the slower-moving lawn care operation. However,   there's also some safety in that diversification. If legal   marijuana doesn't turn out to be as big a deal as Wall Street is   expecting, Scotts will still have a stable business to fall back   on. Innovative Industrial Properties is all-in on the marijuana   niche. If its lessees start to close up shop, it will have a   problem. That said, it currently has, basically, 100% occupancy,   so it's in pretty good shape today. And, in a worst-case   scenario, the physical properties it owns could be repurposed.   Grow houses are specialized, so the time and costs involved in   those sorts of transitions would be an issue. However, Innovative   does have a fallback position if it needs one, though it might   not get the same rents as it does from its current tenants. A tougher call Although Scotts has a sizable legacy business to backstop its   hydroponics investments, it built Hawthorne through acquisitions.   That required the company to take on a lot of debt. At the end of   fiscal 2018, long-term debt made up 90% of the capital structure   -- a   balance sheet    statistic that should trouble even the most aggressive investor.   But over the next three quarters, Scotts got that number down to   66% -- still on the high side, but not unreasonable. And the   swift improvement shows that management is well aware of the need   to address its leverage issue. (For context, it sold a stake in a   joint venture and put the cash toward debt reduction.) As a   result of its efforts, Scotts stock is much more attractive than   it was just a year ago, though truly conservative investors   should probably still avoid it.          SMG    data by   YCharts  Innovative, meanwhile, has gone the opposite direction to some   degree. At first, the REIT focused on equity sales to fund its   growth, which left it with a pristine balance sheet. That,   however, wasn't a sustainable approach (or a desirable one, for   that matter) and the company has now started to issue debt. The   new notes it issued have pushed debt to roughly 33% of the   capital structure. That's not unreasonable at all and the REIT   could easily handle much more. However, investors need to keep an eye on the company's growth   efforts. If it overextends itself by acquiring too many assets   too quickly or starts to overpay for assets, it could end up   destroying shareholder value. Debt is the rocket fuel that could   allow management to make those blunders, especially in a sector   that's being heavily hyped on Wall Street. So while there's no   need to be afraid of owning Innovative today, there are reasons   to worry that management might get sucked in by the hype around   its industry. Which way to go? At this point, for investors who are seeking portfolio   exposure to the legal cannabis sector, but who prefer not to get   it by owning actual pot stocks, Innovative looks like the better   option. It is more focused on the space, has a strong balance   sheet, and could reposition its assets if lessees vacate its   properties. That said, investors are clearly aware of its   success, and have bid the stock up significantly over the past   year. Scotts shares have advanced, too, but not nearly to the   same degree. That might make the stock appear more desirable to   some, but remember that while its leverage situation has   improved, it remains a notable issue. Still, given its   strengthened financial position, investors looking to hedge their   bets on pot might want to take a second look at Scotts. Conservative investors, however, should probably avoid the   marijuana space altogether. If history is any guide, the rosy   predictions being made on Wall Street today may not come to pass.   The   massive share price declines some big-name pot   stocks    experienced this year only serve to highlight the real risk that   the market may have gotten irrationally excited about the profit   potential of the legal cannabis sector.   10 stocks we like better than Innovative Industrial     Properties       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Innovative Industrial     Properties wasn't one of them! That's right -- they think these     10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Reuben Gregg Brewer      has no position in any of the stocks mentioned. The Motley Fool     recommends Innovative Industrial Properties. The Motley Fool     has a     disclosure policy      .  ",
    " Marijuana is expected to be a huge growth   business    , with some on Wall Street projecting that legal pot sales could   eventually reach   a massive $166 billion a year    . If that forecast proves anywhere close to accurate, there could   be a lot of upside for both marijuana companies and the companies   that provide them with vital products and services. Which is   exactly where   Scotts Miracle-Gro    (NYSE: SMG) and   Innovative Industrial Properties    (NYSE: IIPR) come in. If you can't stomach the idea of owning a   marijuana stock, then these two industry suppliers are worth a   close look. Picking between the two, meanwhile, is getting more   difficult.",
    "Scotts operates primarily in the lawn care sector -- a slow   and boring business. However, a few years ago it decided to   branch out into the hydroponic space to take advantage of the   increasing legalization of marijuana. The subsidiary it launched   to cater to cannabis growers, Hawthorne Gardening Company, has   been growing quickly, and now accounts for around 20% of Scotts'   sales. So far, most of that growth has been driven by   acquisitions. However, managemen   t report    ed that in the company's fiscal third quarter, Hawthorne's   organic sales growth would have been nearly 50%, factoring out a   big acquisition made in mid-2018. That's impressive.",
    "  Image source: Getty ImagesmakeArticleAd(); ",
    "Image source: Getty Images",
    "Innovative Industrial Properties is a   real estate investment trust    (REIT) that owns grow houses in which marijuana companies   operate. So it provides places for the producers to grow their   cannabis, but its business is more nuanced than that. It has been   able to expand by acquiring facilities from marijuana companies,   then renting them back to the grower under long-term leases. This   provides liquidity to the growers that they can use to expand   their businesses, so it's a win/win situation. Innovative   increases the scale of its portfolio while simultaneously   supporting the cannabis industry's long-term growth.",
    "The first thing to note about Scotts is that its business   remains mostly focused on lawn care. That's the foundation on   which the company is building out its Hawthorne subsidiary. On   the one hand, that reduces the company's growth opportunity,   since the bottom-line impact of the fast-growing hydroponics unit   is diluted by the slower-moving lawn care operation. However,   there's also some safety in that diversification. If legal   marijuana doesn't turn out to be as big a deal as Wall Street is   expecting, Scotts will still have a stable business to fall back   on.",
    "Innovative Industrial Properties is all-in on the marijuana   niche. If its lessees start to close up shop, it will have a   problem. That said, it currently has, basically, 100% occupancy,   so it's in pretty good shape today. And, in a worst-case   scenario, the physical properties it owns could be repurposed.   Grow houses are specialized, so the time and costs involved in   those sorts of transitions would be an issue. However, Innovative   does have a fallback position if it needs one, though it might   not get the same rents as it does from its current tenants.",
    "Although Scotts has a sizable legacy business to backstop its   hydroponics investments, it built Hawthorne through acquisitions.   That required the company to take on a lot of debt. At the end of   fiscal 2018, long-term debt made up 90% of the capital structure   -- a   balance sheet    statistic that should trouble even the most aggressive investor.   But over the next three quarters, Scotts got that number down to   66% -- still on the high side, but not unreasonable. And the   swift improvement shows that management is well aware of the need   to address its leverage issue. (For context, it sold a stake in a   joint venture and put the cash toward debt reduction.) As a   result of its efforts, Scotts stock is much more attractive than   it was just a year ago, though truly conservative investors   should probably still avoid it.",
    "    SMG    data by   YCharts ",
    "Innovative, meanwhile, has gone the opposite direction to some   degree. At first, the REIT focused on equity sales to fund its   growth, which left it with a pristine balance sheet. That,   however, wasn't a sustainable approach (or a desirable one, for   that matter) and the company has now started to issue debt. The   new notes it issued have pushed debt to roughly 33% of the   capital structure. That's not unreasonable at all and the REIT   could easily handle much more.",
    "However, investors need to keep an eye on the company's growth   efforts. If it overextends itself by acquiring too many assets   too quickly or starts to overpay for assets, it could end up   destroying shareholder value. Debt is the rocket fuel that could   allow management to make those blunders, especially in a sector   that's being heavily hyped on Wall Street. So while there's no   need to be afraid of owning Innovative today, there are reasons   to worry that management might get sucked in by the hype around   its industry.",
    "At this point, for investors who are seeking portfolio   exposure to the legal cannabis sector, but who prefer not to get   it by owning actual pot stocks, Innovative looks like the better   option. It is more focused on the space, has a strong balance   sheet, and could reposition its assets if lessees vacate its   properties. That said, investors are clearly aware of its   success, and have bid the stock up significantly over the past   year. Scotts shares have advanced, too, but not nearly to the   same degree. That might make the stock appear more desirable to   some, but remember that while its leverage situation has   improved, it remains a notable issue. Still, given its   strengthened financial position, investors looking to hedge their   bets on pot might want to take a second look at Scotts.",
    "Conservative investors, however, should probably avoid the   marijuana space altogether. If history is any guide, the rosy   predictions being made on Wall Street today may not come to pass.   The   massive share price declines some big-name pot   stocks    experienced this year only serve to highlight the real risk that   the market may have gotten irrationally excited about the profit   potential of the legal cannabis sector.",
    "  10 stocks we like better than Innovative Industrial     Properties       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Innovative Industrial     Properties wasn't one of them! That's right -- they think these     10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Innovative Industrial     Properties       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Innovative Industrial     Properties wasn't one of them! That's right -- they think these     10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Reuben Gregg Brewer      has no position in any of the stocks mentioned. The Motley Fool     recommends Innovative Industrial Properties. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:18:00"
}