{
  "url": "https://www.nasdaq.com/article/can-tesla-supercharge-stock-gains-after-vanity-fair-article-cm1207456",
  "title": "Can Tesla Supercharge Stock Gains After ‘Vanity Fair’ Article? - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Tesla (NASDAQ: TSLA ) cannot catch a break.",
    "Just when it got past a difficult earnings report and the resulting controversies had begun to calm down, an article in Vanity Fair resurfaced doubts surrounding the battery and auto company.",
    "Although Tesla continues to revolutionize both transportation and energy, investors may need to pay heed to the negatives in deciding whether to pull the trigger on Tesla stock.",
    "Before earnings, I speculated that TSLA could move higher if the company met or exceeded expectations.",
    "That did not happen.",
    "Tesla stock missed earnings estimates by 72 cents per share and also fell short on revenue. With that, TSLA plunged. Since the earnings miss, it has steadily moved downward. Today it trades at about $225 per share.",
    "In fairness, Tesla remained quiet for most of August. If anything, one might have seen the news since the earnings miss as somewhat encouraging.",
    "For one, Tesla will receive an exemption from a tax on most foreign car makers within China. The factory the company is building in Shanghai continues to move forward. Secondly, TSLA announced it would sell insurance on its vehicles . Available just in California for now, this would lower ownership costs and bring Tesla recurring revenue.",
    "David Marino-Nachison of Barron's made an interesting point about the lack of news coverage surrounding the automaker lately. Over the year, Tesla's eccentric CEO Elon Musk has stoked controversy with errant tweets or provocative statements to the media. Since the earnings report, that had calmed down.",
    "However, just as that story came out, InvestorPlace'sWayne Duggan pointed to a piece in Vanity Fair that has again called into question the leadership style of Musk. According to the article, his bailout of SolarCity has some of his worst critics calling him a \"con artist.\" Duggan sees Musk as a guy who promises the impossible and sometimes fails to meet those very high expectations. Whatever the truth, the debate itself casts doubt upon TSLA.",
    "Going by its financials, I like TSLA stock. Yes, the forward price-to-earnings ratio of about 57.4 appears high. However, with growth predicted to average 114.3% per year over the next five years, that seems like a bargain.",
    "Still, if the Vanity Fair article is even somewhat accurate, we cannot assume that things are as they seem. As Duggan points out, both Tesla and Musk's SpaceX firm invested in SolarCity. He also mentions the problems at the Buffalo, New York factory. So-called \"Gigafactory 2\" is the manufacturing site of Tesla's Solar Roof . Duggan also highlights Walmart's (NYSE:WMT) lawsuit against Tesla, the result of panel fires in stores and warehouses.",
    "In fairness, other parts of the company fare better. Tesla became the top luxury car brand in the U.S. in the second quarter of 2019. It also ranked fourth in overall sales. Tesla came in just above General Motors' (NYSE: GM ) Buick and right below Toyota's (NYSE: TM ) luxury brand, Lexus. Moreover, Zimbabwe has turned to Tesla batteries to power the nation's mobile phone network.",
    "However, studies show that negative headlines draw more attention than positive news. This reality could make investors wary of buying TSLA at anything but a discount.",
    "The negatives surrounding TSLA appear poised to drive the stock in the near term. Given the forecasted growth and the promise of the technology, I can understand why investors willingly paid a premium for this equity. From a purely financial standpoint, paying under 60 times forward earnings for triple-digit, long-term profit growth looks like a huge bargain.",
    "Moreover, the Tesla battery has expanded the art of the possible. TSLA has succeeded in an area where numerous others have failed - building a commercially viable electric car. As mentioned before, it also brings power to areas of the world without a reliable supply of electricity.",
    "However, as people like the company's namesake, Nikola Tesla have demonstrated, with genius often comes eccentricity. Unfortunately for investors, \"eccentric\" looks like a generous description for Tesla as of late. Investors are right to call the company into question over SolarCity and the failure of the Solar Roof. Such shortcomings will at least amount to a reputation hit. Uncertainty in the overall market will only add to those doubts.",
    "Tesla may well deliver on its promise to change energy as we know it. But with an inability to always deliver on its promises, traders should hold out for a deeper discount or avoid TSLA altogether.",
    "As of this writing, Will Healy did not hold a position in any of the aforementioned stocks. You canfollow Will on Twitterat @HealyWriting .",
    "The post Can Tesla Supercharge Stock Gains After 'Vanity Fair' Article? appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:59:29"
}