{
  "url": "https://www.nasdaq.com/article/smartsheet-inc-smar-q2-2020-earnings-call-transcript-cm1207650",
  "title": "Smartsheet Inc (SMAR) Q2 2020 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   Smartsheet Inc    (NYSE: SMAR)        Q2 2020 Earnings Call       Sep 4, 2019 ,   4:30 p.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Good afternoon. My name is Chris and I'll be your conference   operator today. At this time, I would like to welcome everyone to   the Smartsheet Second Quarter Fiscal 2020 Earnings Conference   Call. All lines have been placed on mute to prevent any   background noise. After the speakers' remarks, there will be a   question-and-answer session. [Operator Instructions] Thank you.   I'll now turn the conference over to Aaron Turner, Head of   Investor Relations.  Aaron Turner    --   Head of Investor Relations  Thank you, Chris. Good afternoon and welcome, everyone to   Smartsheet second quarter of fiscal year 2020       earnings call    . We will be discussing the results announced in our press   release issued after the market closed today. With me today are   Smartsheet CEO, Mark Mader; our CFO, Jennifer Ceran; our Chief   Product Officer, Gene Farrell, will also be available during the   Q&A. Today's call is being webcast and will also be available   for replay on our Investor Relations website at   investors.smartsheet.com. There is a slide presentation that   accompanies Jennifer's prepared remarks, which can be viewed in   the Events section of our Investor Relations website. During this call, we will make forward-looking statements   within the meaning of the federal securities laws. We have based   these forward-looking statements largely on our current   expectations of -- and projections about future events and   financial trends. These forward-looking statements are subject to   a number of risks and other factors including, but not limited   to, those described in our SEC filings available on our Investor   Relations website and on SEC website at www.sec.gov. Although we believe that the expectations reflected in the   forward-looking statements are reasonable, our actual results may   differ materially and adversely. All forward-looking statements   made during this call are based on information available to us as   of today, and we do not assume any obligation to update these   statements as a result of new information or future events except   as required by law. In addition to US GAAP financials, we will discuss certain   non-GAAP financial measures. Reconciliation to the most directly   comparable US GAAP measure is available in the presentation that   accompanies this call, which can also be found on our Investor   Relations website. With that, let me turn the call over to Mark.  Mark Mader    --   Chief Executive Officer  Thanks, Aaron. Good afternoon, everyone, and thank you for   joining us for today's call. We delivered another strong quarter   by executing our strategy of providing high value solutions for   enterprises, expanding Smartsheet's presence in new and existing   customers, and driving international growth. Our platform,   designed to accelerate individual and enterprise achievement,   enable teams and businesses of all sizes to move faster, address   significant challenges and drive innovation. We posted revenue of $64.6 million in Q2, representing   year-over-year growth of 53% and our annualized average contract   value, or ACV, per domain-based customer grew 48% year-over-year   to $2,972. The total number of all Smartsheet users across paid   in collaborators is now over $5.4 million. Expansion within our   base during the quarter included 46 companies increasing their   annual recurring revenue, or ARR, by more than $50,000 and 13   customers increasing their ARR by more than $100,000. Notable expansions occurred at customers such as Olympus   Corporation, a global leader in electronics and optics, U-Haul,   the moving equipment and storage rental company and VCCP, a   global creative and marketing firm serving some of the world's   largest brands. Many of those expansions were driven by a record   750 unique customers that bought one or more capability-based   products in Q2, with July seeing record bookings for our   Accelerator offerings. In conversations with customers this quarter, I was repeatedly   reminded of Smartsheet's mission-critical role in their   businesses from tracking clinical trials intended to eradicate   global diseases, to managing the remodeling and reopening of   hundreds of restaurants globally, I heard how Smartsheet is   driving high value automation and workflow consistency in areas   such as project management, research and development, healthcare   and media. For example, Syngenta, a Swiss-based biotech company, wanted   to connect workers at research labs, testing farms and product   manufacturing facilities in more than 90 countries to ensure   rapid and accurate decision making and reporting across the   organization. With Smartsheet, research and field teams now use   mobile devices and tablets to share information and images   quickly, allowing for real-time decisions about the next stages   of their agricultural experiments, more frequen   t report    ing of observed safety issues and increased transparency of   information from the field to corporate leaders. Providence Medical Group, a healthcare organization with 60   clinics throughout Oregon and Southern Washington, leverages   Smartsheet to intake document and track clinic managers at the   stations of compliance with constantly evolving medical practices   and mandated patient care requirements. Smartsheet's cross   platform accessibility enables caregivers to input and access   information from any device in any clinic location. And Crain Communications, a multi-industry publishing   conglomerate sought to implement a centralized work execution   platform across its 24 brands, including Ad Age, Autoweek and   regional business publications. By provisioning Smartsheet and   implementing our control center and dynamic new products, Crain   is able to build scalable, automated workflows that reduce time   to market and duplicative work, and increase visibility for both   internal stakeholders and third-party vendors. Fueling these team and organizational achievements and   Smartsheet wins is a strong pipeline of product innovation. We're   making significant investments focused on delivering a platform   and the infrastructure required to support that platform that   anyone can use to move faster, meet challenges and achieve more.   For example, the latest enhancements to our automated workflows   enable users to automate multiple actions and scenarios in a   single workflow. This includes the ability to automate approvals   with multiple stakeholders or to create a recurring workflow   using a time-based schedule. By enabling users to automate more   sophisticated work processes, Smartsheet helps organizations save   time and maintain data consistency. In mid-August, we announced that Smartsheet Gov had received   full FedRAMP authorization. Now that we are authorized in the   FedRAMP marketplace, we look forward to the chance to expand the   use of Smartsheet among federal employees as they seek to   modernize workflows and processes, drive the effectiveness and   pace of intra and inter-agency collaboration, and to deliver   better experiences for citizens. We look forward to unveiling   additional product offerings at our third annual ENGAGE global   customer conference, September 30th through October 3rd, with   registrations on track to outpace last year's total of 2,500   ENGAGE'19 is set to be even bigger and better. And we look   forward to seeing many of you there. Before I turn it over to Jenny, I want to share a few thoughts   on our national advertising campaign that we kicked off this   morning, with a full page ad in the print edition of The Wall   Street Journal. As you see the ads in the coming months across   many different channels, you'll note that we are heavily focused   on a message of achievement for both individuals and for   companies of all sizes. It's time that the world hears about all   that Smartsheet has to offer, and I look forward to us telling   that story more broadly. To close, I'm pleased with our performance thus far in fiscal   year '20 and remain ever mindful of the degree to which we are an   important part of our customers' businesses. Thank you to the   Smartsheet team for your support of our customers and of one   another. Thanks also to our customers, partners and shareholders   for your confidence in our service and in the future of our   business. Jenny?  Jennifer Ceran    --   Chief Financial Officer  Thank you, Mark, and welcome, everyone. As Mark mentioned, our   second quarter revenue came in at $64.6 million, up 53% versus a   year ago. Billings came in at $79.5 million, up 52% versus year   ago. Our dollar-based net retention rate was 134% and our average   ACV per domain-based customer grew 48% year-over-year. We also   added approximately 1,900 net new logos, a little over a third of   which we obtained via the 10000ft acquisition, to end the quarter   with over 82,000 domain-based customers. Second quarter non-GAAP   operating loss was $10.8 million as we continue to make   investments in our platform and go-to-market capabilities and   non-GAAP net loss per share was $0.08. Operating cash flow was negative $2.7 million and free cash   flow was negative $7.3 million. And we ended the quarter with   cash and short-term investments of $561 million, which includes   $380 million from our equity raise in June. Let me dive more into the revenue for the quarter. Of our   $64.6 million in total revenue, subscription revenue was $58.3   million, a 56% increase versus a year ago. Services revenue came   in at $6.3 million, up 29% versus a year ago and represented 10%   of total revenue. The services revenue growth rate was tempered   by the lapping of a large consulting engagement in Q2 of last   year and by our ongoing sales accelerators, which attach with a   lower services component. Let me move on to metrics. We continue to see strong growth in   our larger customers. 7,673 customers now pay us $5,000 or more   per year. 635 now pay us $50,000 or more per year and 226 now pay   us $100,000 or more per year. These customer segments grew   year-over-year by 55%, 113%, and 128% respectively and now   represent approximately 70%, 31% and 20% of total ACV. As mentioned earlier, our average ACV per domain-based   customer increased to $2,972 for the quarter and our dollar-based   net retention rate was 134% consistent with the prior quarter and   3 percentage points above the same quarter a year ago. Next, I'll provide color on the rest of our income statement   and a few highlights from our balance sheet. Unless otherwise   stated, all references to our expenses and operating results are   on a non-GAAP basis and are reconciled to our GAAP results in the   earnings release and presentation that was posted before the   call. In the second quarter, overall gross margin was 82%.   Subscription gross margin was 88%, flat with the prior and year   ago quarters. As we make incremental investments in our   infrastructure and migrate more of our services to the public   cloud, we expect our overall gross margin to come down toward our   long-term target overall margins of 78% to 80%. Professional   services margin was 31%, which was in line with prior   quarters. Turning to operating expenses. General and administrative   costs in the second quarter were $9.5 million, representing 15%   of total revenue. 1 percentage point below the prior quarter and   2 points below the year ago quarter as we began to show scale.   Research and development was $18.9 million or 29% of total   revenue, a decrease of 3 percentage points from the prior quarter   and 2 percentage points from the year ago quarter as we realize   some scale and saw increased capitalization of internal use   software. We continue to invest on our product capabilities and added a   record number of new developers to the team this quarter.   Finally, sales and marketing expense was $35.7 million or 55% of   revenue versus 59% of revenue in the prior quarter and 54% in the   year ago quarter. We expect our sales and marketing as a   percentage of total revenue to increase in the back half of this   year as we hold our third annual ENGAGE conference in October,   launch a brand advertising campaign and add more reps to support   our global expansion plans. Turning to operating loss and free cash flow. Operating loss   was $10.8 million, representing a negative operating margin of   17%. Approximately 70% of our total expenses were headcount   related and we ended the quarter with over 1,350 employees. Free   cash flow was negative $7.3 million, which includes capex spend,   capitalized internal use software and principal payments on   leases, totaling 7% of revenue. Now turning to billings. Our second quarter billings were   $79.5 million, up 52% versus a year ago. Approximately 90% of our   subscription billings were annual, with 9% monthly. Quarterly and   multi-year billings represented about 1% of the total. I'll now provide our guidance for the third quarter and the   full year fiscal year 2020. For the third quarter, we expect   total revenue of $69 million to $70 million, representing   year-over-year growth of 47% to 49%. We expect non-GAAP operating   loss to come in between $23 million and $22 million and non-GAAP   net loss per share to be between $0.19 and $0.18 based on   weighted average shares outstanding of $116.5 million. We also   expect our free cash flow in Q3 to be up to negative $4 million.   Both our operating loss and free cash flow reflect expenses   related to our ENGAGE conference, brand advertising and market   expansion plans. For the full fiscal year, we expect total revenue to be in the   range of $265 million to $268 million, representing growth of 49%   to 51%. We expect non-GAAP operating loss to be between $70   million and $66 million and non-GAAP net loss per share of   between $0.58 and $0.54 for the year based on approximately 112.5   million weighted average shares outstanding. We expect billings to be in the range of $320 million to $324   million for the full fiscal year, representing growth of 48% to   50% versus last year. And for modeling purposes, please assume   historical trends for quarterly billings for the remaining   quarters. Regarding free cash flow, our success extending   Smartsheet's presence into new markets such as the UK has given   us the confidence to invest faster in our international expansion   and accelerate our migration to the public cloud. Accordingly, we   are increasing our full year free cash flow guidance by negative   $5 million to a total of negative $25 million for the year. With that, we will now turn it back to the operator to take   your questions. Questions and Answers:  Operator  [Operator Instructions] Your first question is from Bhavan   Suri with William Blair. Your line is open.  Bhavan Suri    --   William Blair -- Analyst  Hey, guys. Thanks for taking my question and nice job. The   dollar retention rate is just amazing. I guess I want to touch   maybe first for Mark here, you look at these accelerators and   those capability-based solutions are contributing nicely to the   results, I guess, help us understand how customers decide to   adopt these and then are you seeing new customers land with these   solutions or is it something that's adopted by more advanced   [Indecipherable] customers for some time? And I got a quick   follow-up.  Mark Mader    --   Chief Executive Officer  Hey, Bhavan. I think the Accelerators are really serving --   serving a nice role in helping people understand how to deploy   Smartsheet to solve something that matters within their business.   So when you look at the seven Accelerators we have, these are   common issues that we see, challenge that we see across business,   and rather than choosing a platform, which requires configuration   to achieve an outcome, they can choose something which is more   turnkey, where they can say, we want to take an M&A   accelerator or we want to do a joint selling accelerator, and   it's a great way to on-board. Now, as I've said in prior calls, whether they choose to   deploy the accelerator or go with a non-accelerator-based   approach that education in that grounding has served as very well   to get people onside. When we look at whether it's influencing   new and expansion business, we have sold accelerators into both   given the distribution of our sales reps being overweighted to   expansion, clearly that group has an advantage because we have   many more quota-carrying reps there. But we are starting to see   signal where the new business reps are feeling comfortable when   presenting those.  Bhavan Suri    --   William Blair -- Analyst  Great. That's really helpful. Then a quick follow-up for   Jenny. Jenny, given sort of the mix of the business globally. I'd   love to understand. If you saw any currency impact this quarter   and if you could quantify what that was in the numbers and what   you might have modeled into guidance, given sort of we've seen   some pretty big currency moves globally. Thank you.  Jennifer Ceran    --   Chief Financial Officer  Yeah. Hey, Bhavan. So currency is still relatively small for   us compared to some other companies. We bill -- roughly 7% of our   subscription billings are in non-US dollars. If you look at the   impact, however, in Q2 because there has been a relatively big   move, we did see a headwind of roughly $300,000 on our billings   because we invoice at the current spot rate and that's basically   what goes into our billings number. On the revenue side, it was minimal impact just because of how   we allocate revenue throughout the year. And it's based on an   historical rate. One of the things we did notice, though, on   dollar net retention rate, we did see a little bit of a headwind   there and it wasn't anything to have significant impact, but   several basis points based on the fact that the math is creating   a headwind there.  Bhavan Suri    --   William Blair -- Analyst  Got it. Helpful. Thank you, guys. Nice job. Thanks for taking   my questions.  Mark Mader    --   Chief Executive Officer  Thank you.  Operator  Your next question comes from John DiFucci with Jefferies.   Your line is open.  John DiFucci    --   Jefferies -- Analyst  Thank you. I'm sorry. I was having some telephone technology   issues there. So hopefully you hit these issues -- but these   questions. I guess, to follow-up on both Bhavan's questions,   first on the international business, I think last quarter, Jenny,   you said you had 11 salespeople in the UK. Can you give us any   other -- any other data on international and how that's doing   either as far as your presence there or even I'm not -- did get   cut off a couple of times, but if you've given the revenue that's   come from international that be great too.  Jennifer Ceran    --   Chief Financial Officer  Right. Well, so we started the year with 15 folks in the UK   and we now have 30, and nearly half of them are quota-carrying   reps. And we are planning to invest more in the UK this year   because for the first half of the year in terms of our internal   targets, the UK team has exceeded those expectations. So we feel   really good about their performance to date and investing more in   that business.  John DiFucci    --   Jefferies -- Analyst  Okay, great. Okay. And -- have you given -- did you say   anything about what kind of contribution realizing you had in   international business prior to even putting people in the UK?   But can you -- did you give that information about how much   business came internationally this quarter?  Jennifer Ceran    --   Chief Financial Officer  21% of our revenue this quarter was from international.  John DiFucci    --   Jefferies -- Analyst  Okay, OK, great. And I guess just on the -- on the   accelerators and maybe, Gene, if you can talk to this, or Mark,   this sounds really interesting, right. And it sounds like it's   actually spurring business even if the accelerators have been   bought. But -- so should we continue to see you're at seven now?   I think Mark said should we continue to see other areas? Is there   anything, any other accelerators you can talk about that are on   the come? I'm not sure if you want to pre-announce them, but   maybe talk about some areas that might be interesting?  Gene Farrell    --   Chief Product Officer  Yeah, hi, John. Thanks for the question. Yeah, as you stated,   we have seven today. We continue to develop new accelerators   based on where we see customer signal. And my team would shoot me   if I gave away the announcements that we're likely willing to --   we're going to be planning to make at the ENGAGE conference at   the end of the month. But I would tell you that we continue to   look at areas where we think we can bring customers more out of   the box solutions to solve meaningful problems for their   business. And I think that we'll talk about after the ENGAGE   conference.  John DiFucci    --   Jefferies -- Analyst  Okay. We can -- we can wait a month and look forward to it.   And nice job here. It's -- it's great to see a company actually   continue at the same kind of momentum that you've been at now for   just over a year. So thanks.  Gene Farrell    --   Chief Product Officer  Thanks. John.  Operator  Your next question is from Stan Zlotsky with Morgan Stanley.   Your line is open.  Stan Zlotsky    --   Morgan Stanley -- Analyst  Hey, guys. Thank you so much for taking my question. And   again, nice job on the quarter. So from my end, looking at it   certainly sounds like accelerators are doing very well. How are   you thinking about accelerators and what kind of contribution   that could have to your financials as we go into the back half of   the year and in as much as accelerators having amazing adoption,   how do you think about what that does to your pro services growth   as we go back out to this year and potentially into next year?   And I have a quick follow-up.  Jennifer Ceran    --   Chief Financial Officer  Yeah, OK. Hi, Stan. This is Jenny. Well, with respect to the   second part of your question, in terms of our pro services   growth, we guided 9% to 11% in Q1, we were at 10% in Q2 and I   would continue with that guidance. There's no change. Pro   services is still really important to us. It's just priced   differently than it was a year ago. Then with respect to the   first question around accelerators and their contribution, we're   seeing our capabilities based products increase as a percentage   of total subscription revenue. So last quarter it was 9%. This   quarter it was 10%. And you know, as we create new solutions in   this area, I would expect that we could see that trend   continue.  Stan Zlotsky    --   Morgan Stanley -- Analyst  Got it. Thank you. And just a quick follow-up. What was the   inorganic contribution in the quarter from the acquisition of   10000ft?  Jennifer Ceran    --   Chief Financial Officer  Yeah. We're not breaking out 10000ft as it's really not   material to the overall results. But what I can remind you of is   last quarter we said that we expected 10000ft to generate $2   million of revenue and $4 million in billings for the full year,   so over three quarters. And I would tell you that, they're   performing well and they kind of met our expectations for the   quarter.  Stan Zlotsky    --   Morgan Stanley -- Analyst  Okay, perfect. Thank you so much.  Operator  Your next question is from Richard Davis with Canaccord. Your   line is open.  Richard Davis    --   Canaccord -- Analyst  Hey, thanks. Mark, you're kind of a student of the evolution   of markets and things like that. And I'm wondering, I know we're   right at the foothills in this space, but are you -- have you   seen any evidence inside some of your companies where they may   have had multiple vendors beyond that using Excel? And you guys   have kind of found those vendors out or are we even -- or is that   just so far lay as it like years before that's really an issue.   I'm just trying to think about how this market's evolving and   stuff because as you know, there's other companies in different   swim lanes, and I'm just trying to thinking about these Venn   diagrams. Thanks.  Mark Mader    --   Chief Executive Officer  Hi, Richard. What I'm -- what I'm hearing from -- I had a   really interesting conversation with the CEO week before last and   he was on a mission to help his large scale mega cap company go   from 13 providers in one category down to three. So the charter   wasn't to -- to jettison or bounce out 12 of the 13, but to try   and get efficiencies by being a little bit more choice full. So I   would say, what did it surprise me to learn that one of our   largest customers had over 4,000 apps they had deployed. That did   surprise me. That's a lot of apps. And I do think people's intent   is to really put energy behind the ones that are working best for   them. I think in terms of the flight to sort of find a single   that works for everything in every category. That's not what   we're seeing today. So I think because the user preferences and   desires and needs are being incorporated into buy decisions and   renewal decisions, there's a very healthy balance right now   between the business units and IT. But I do think that over time,   people's intent is to -- is to not have sprawl. But again, I   don't think the pendulum is going to swing back to having a   single provider within each category for these large   companies.  Richard Davis    --   Canaccord -- Analyst  Got it. Thank you very much.  Mark Mader    --   Chief Executive Officer  Yeah.  Operator  Your next question is from Terry Tillman with SunTrust. Your   line is open.  Terry Tillman    --   SunTrust -- Analyst  Hey, Mark, Jenny and Aaron, sorry for a horrible cold here,   but I guess the first question just relates to, it sounds like   sales and marketing investments are ramping in the second half,   maybe even more than we expected. I think part of it like   advertising, I know you have a new CMO, but maybe you could   pinpoint some of the other areas where there's incremental   investment. And then how do we -- when we're talking to   investors, what are some of the proof points of ROI you would see   next year, which I'm assuming that's when you'd see benefits,   whether it's just net new customers or 100,000 K [Phonetic] per   your customers, just a little bit more about the investment and   then how we watch the metrics around that. And I had a follow-up.   Thank you.  Mark Mader    --   Chief Executive Officer  Thanks, Terry. I'll take the first half of that and Jenny will   take the second. In terms of the investments that are   incremental, we knew when we brought Anna into our team that we   were going to be deploying campaign dollars in the second half of   this year. What we have been pleased to see is how our team are   composite in the UK has come together and clarity around   quota-carrying reps, customer success, support how that whole   group is gelling. We now want to pull our Asia-Pac investment   forward and we feel like we're organizationally ready to do   that. Heading into the year, we had really anticipated that not   hitting in FY '20. So I think one of the things that's slightly   different about how we're going to approach that than what we did   in the UK, I would say we were more -- we approached the UK in a   more phased manner. First we said we were going to have a sales   leader, then some quota-carrying reps, and over the course of   quite a few months, we built that composite. We now have   confidence in what the structure looks like and we're going to be   more assertive in getting that group in place quickly. Jenny?  Jennifer Ceran    --   Chief Financial Officer  Yeah. And with respect to sales and marketing kind of in the   back half, if you kind of look at what happened last year between   Q2 and Q3 saw a jump up in sales and marketing and that was   driven heavily by our ENGAGE conference. Several million of   incremental investment there. On top of that, we've got expansion   into these international markets, we've got brand advertising. So   I think the increase in sales and marketing as a percentage of   revenue into Q3 will be more pronounced than what you saw a year   ago. And in terms of return on our investments, we continue to   monitor LTV to CAC payback, magic number, and we look at these   every quarter. And right now we still feel really good about it   and we still feel like there's room to make incremental   investments.  Terry Tillman    --   SunTrust -- Analyst  Okay. And I technically view that as just one question, even   though it's two parts. Could I ask a second question, a   follow-up.  Mark Mader    --   Chief Executive Officer  Yeah, sure, Terry.  Terry Tillman    --   SunTrust -- Analyst  Right. I don't know why I asked you if I could ask you a   question. So anyways, Jenny, you gave a perspective on billing.   You also had a couple of years now this great ENGAGE conference.   What I'm curious about is, what are you baking into in terms of   potential sales activity? I know part of it's education,   networking, etc. And just kind of unleash all the new innovation,   but as you've done this a couple years in a row, like how much   are you banking on actually getting a lot of new sales activity   coming out of it? Thank you.  Jennifer Ceran    --   Chief Financial Officer  Well, it's definitely a lead generation opportunity we get to   engage with customers, there's business that's done, and so we   factor, our best estimates of what that might look like for Q3   and Q4. Without going into too much detail of what it is, when we   do feel like there's a good return from ENGAGE.  Operator  Your next question comes from Ittai Kidron with Oppenheimer.   Your line is open.  Ittai Kidron    --   Oppenheimer -- Analyst  Hi, guys. Good quarter. I guess a couple for me. First, Mark,   I guess I'm trying to kind of look at the pattern of -- of your   results over the past few quarters and can't help seeing that the   magnitude of the beat over the top range of your guidance is   shrinking and shrinking from one quarter to another. And under   the assumption that the methodology by which you give guidance   does not change, what is changing in that business? Or perhaps   maybe you could talk about what you are not happy with during the   quarter.  Mark Mader    --   Chief Executive Officer  Yeah, I think it's over the course of 13 years, Ittai. If   you'd wake me up at 2:00 in the morning, I would say I want most   things sooner than we get them right on almost all dimensions. So   this will be a nice, long answer for you. So we did two   acquisitions in the first half of the year. The team -- the way   in which those teams, those team members have folded into our   community has been really strong. I would have loved to have on a   product integration side had those day one. So you do the   acquisition the next day, you come in the office and the parts   are fully integrated and we're excited about showing our customer   base at ENGAGE some of the progress on that front, but that is   something where as we go to market, we want to have sort of a   hand in glove, unified offering across all those dimensions. So that is one that we're pushing on very hard. And only until   you embark on that work, do you really understand what's   entailed. And we believe that details matter. So the difference   between shipping something out to market quickly and putting jazz   hands around and telling customers to buy something that's not   ready. That's not how we run our business. So that's one very   specific thing, which as we look at additional acquisitions over   time, we're going to apply those learnings and further refine our   models. FedRAMP is another one. We had given multiple progress   reports in pas   t quarterly   report    s. I would have loved that to have been a 90-day process. We are   one of the fastest companies ever through that process in just   about a year. That seems like an eternity to me. And now we have   earned the right to engage on RFP processes with federal   agencies. I will probably and be disappointed with the length of   time it takes to execute those. But again, these are   opportunities, right? So those are two concrete things, which I   would say represent new opportunities that simply needs some time   to bake. And unfortunately, I don't get to control all the   variables there, but I'm very excited about both of those   fronts.  Ittai Kidron    --   Oppenheimer -- Analyst  Excellent. And then as a follow-up, Jenny, you've talked about   how you expect the gross margins to kind of drift down over time.   But what is it that really we need to see from a revenue   standpoint or some sort of scale standpoint that will actually   make you get there? Because you seem to be doing far better than   your long-term target for a long time and you're holding it quite   steady.  Jennifer Ceran    --   Chief Financial Officer  Yeah, I think that relates predominantly to the timing of our   migration to the cloud, and as we mentioned on the call that we   are accelerating that migration. Originally we were thinking 18   months and now we're thinking more like six months. So to the   extent that happens faster, you should expect our subscription   gross margin to tick down percentage.  Ittai Kidron    --   Oppenheimer -- Analyst  Just to clarify that, are you all -- are you already in that   process or you'll start it in six months? I'm a bit confused.  Jennifer Ceran    --   Chief Financial Officer  We've already started it, but we re taking a much slower   process and now we have decided we're going to accelerate that.   And so we'll start seeing more cloud-based expenses versus the   depreciation that we have on equipment. There could be some   overlap which will bring that down a bit.  Ittai Kidron    --   Oppenheimer -- Analyst  Got it. Okay. Thank you very much. Good luck, guys.  Gene Farrell    --   Chief Product Officer  Thanks.  Jennifer Ceran    --   Chief Financial Officer  Thanks.  Mark Mader    --   Chief Executive Officer  Thank you.  Operator  Your next question is from Scott Berg with Needham. Your line   is open.  Scott Berg    --   Needham -- Analyst  Hi, everyone. Congrats on a good quarter. Mark, I wanted to   expand on the FedRAMP opportunity to start, I guess. Can you   remind us how much of your business comes from federal in general   right now. My guess is really, really small, but how should we   view this opportunity in terms of what your longer term   opportunity looks like here?  Mark Mader    --   Chief Executive Officer  Yeah, I think what I first thought over the years from people   who've sold into the agencies is that, there is no formulaic   playbook that works for all companies equally. So I am in many   respects an experiential learner and where we're starting on this   process now. We do have, I would say, a very, very small   percentage of our revenue today, low, low, low single digits   comes from this world today. The degree to which people make   decisions on somewhat of a tactical temporary authorization to   operate approach is different than a full on agency RFP process.   We have not gone through that process yet to closer. So as we   understand that, we will have a greater sense for the magnitude   of the opportunity. What we do know is that agencies have real   needs. What we do know is that it's a very small number of   vendors who are authorized to sell to them. So I like that   dynamic, but until we start posting wins and we start seeing   agencies successfully utilizing our product, it's -- there's   really no evidence to draw from.  Scott Berg    --   Needham -- Analyst  Got it. Helpful. Then a quick follow-up for Jenny on free cash   flow. I get the additional investments this year given the   success. How much [Indecipherable] '21. I believe you've   discussed being roughly cash flow neutral for the year at fiscal   '21. Are you still holding that expectation? True, or does that   maybe change?  Jennifer Ceran    --   Chief Financial Officer  Well, to your point, we are very mindful of our path to   profitability. But at the same time, we're looking at, growth   opportunities that are pretty significant and investments that we   may want to make related to those. So we're finishing off this   year. We've still got another five months to go. We're kicking   off our planning process kind of as we speak right now. And I'll   give everyone an update when we guide for the next year, in a   couple quarters.  Scott Berg    --   Needham -- Analyst  Got it. Thanks again. Congrats on a good quarter.  Mark Mader    --   Chief Executive Officer  Thanks.  Operator  Your next question is from Mark Murphy with JPMorgan. Your   line is open.  Pinjalim Bora    --   JPMorgan -- Analyst  Hey, guys. This is Pinjalim on behalf of Mark. Thanks for   taking our questions and congrats on the quarter. Going back to   the tepid [Phonetic] capability based offerings, could you talk   about the uptick of Control Center and Dynamic View? How those   are doing? And then those two along with accelerators, where do   you see the most opportunity among those three? And the third   part of that lovely question is what is the average ASP that   you're realizing from these products today?  Mark Mader    --   Chief Executive Officer  You packed a lot in there. So control center dynamic view and   data uploader are three areas in addition to Excel -- are the   three -- are the three premium products in addition to   accelerator is it kind of make up the bundle of most of the   demand is? I would actually tell you that all of those are quite   healthy. Data uploader has probably been the one that's the   fastest growing for us. And while we don't -- we don't breakout   ASP for each of our -- for our premium-based offerings, I would   tell you that it varies pretty widely across that portfolio.   Based on the size of the -- the size of that solution we're   building for the customer.  Pinjalim Bora    --   JPMorgan -- Analyst  Okay. And is it fair to say that a control center may be being   the oldest is the largest among those all of us?  Mark Mader    --   Chief Executive Officer  Yes. Yeah, control center has been around and it's the largest   of -- it represents the largest revenue of that group.  Pinjalim Bora    --   JPMorgan -- Analyst  Understood. Okay. And Jenny the dollar-based net retention   obviously has been holding up pretty steadily. That's great to   see. Is there any improvement in gross retention or churn to be   called out there?  Jennifer Ceran    --   Chief Financial Officer  Yeah. So last quarter I mentioned that our lost rate was above   9%, but rounded down to 9%. This quarter it's below 9%, but it   rounds up to 9% still. So we have 40 basis point improvement in   total loss rate for the quarter.  Pinjalim Bora    --   JPMorgan -- Analyst  Excellent. Thank you so much.  Operator  Your next question is from Alex Zukin with RBC. Your line is   open.  Alex Zukin    --   RBC -- Analyst  Hi guys, thanks for taking my question and congrats on a solid   report. I guess maybe just first on the dollar-based net   expansion metric, another great posting at 134%. What's the right   way to think about that for the back half of this year? Is this   kind of the right balance? Do you see it ticking up? Or is it at   the right range at this point?  Jennifer Ceran    --   Chief Financial Officer  Yeah. Hey, Alex. Look, nice to be working with you again. On   the net retention rate, we are modeling high-20s by the end of   the fiscal year. So high-120 percentages. We don't typically   bring it up, that would be very aggressive on and very -- but it   is we're very happy with the number.  Alex Zukin    --   RBC -- Analyst  Perfect. And then maybe for Mark. Can you -- it seems like   you've got a lot of growth opportunities ahead of you and your   investing ahead of that growth. So maybe can you stack rank by   maybe your enthusiasm level or where you see the lowest hanging   fruit between the UK, APAC and federal. And where do you feel   like you're still under investing from that perspective?  Mark Mader    --   Chief Executive Officer  One thing I like to remind our employees is low hanging fruit   still needs to be picked, and when it's falling on the ground,   it's typically rotted. So each of these things takes effort. And   I think the thing that we're organizationally focused on right   now, there are such a plethora of things to pursue, but the   things you pursue hardly do those really, really well? So the UK,   we learn some lessons in terms of what we're going to be applying   to our next region. We will be deploying people differently to   the next region. The team did a heroic effort in the UK holding   it together as we face people in and out. And it's -- it's again,   we're going to apply that. So I think it is in terms of excitement, I get excited about   things that we learn and apply more effectively next time around.   I talked about that in the context of acquisitions. I'm talking   about in the context of new territory presence. And the federal   is no different, right. So as we go to deploying our sales   professions who are dedicated to that space as we learn how to   best respond to inquiries, how to respond to authentic inquiries   versus increase where they're just sort of kicking the tires, we   will learn from that as well. The things that I'm most excited about, at the core of it,   we're a software company. We build stuff. We build stuff that   people should love and I am fired up for ENGAGE. I'm fired up   that we're going to be bringing stuff to market that is   differentiated. So, I mean, it's one thing to talk about, are you   better than someone else? Do you need to look a little different   than someone else? Do they like the sound of your offering   better? No. If you have stuff that is not possible elsewhere,   that is a very concrete thing to talk about with people in a   sales call. I love those things. So as we think about our   roadmap, it's not just improving certain things. Getting into new   markets, it brings stuff to market for which there is a need that   other people don't have. I love that unions. So that's my number   one. Hopefully you come ENGAGE, you can learn about some of   it.  Alex Zukin    --   RBC -- Analyst  Thank you, guys. Appreciate it.  Mark Mader    --   Chief Executive Officer  Thanks.  Operator  Your next question is from Steve Koenig. with Wedbush   Securities. Your line is open.  Steve Koenig    --   Wedbush Securities -- Analyst  Hi, Smartsheet. Thanks for taking my question. So one quick   one and one follow-up. When -- your subscription revenue hardly   decelerated at all. Very impressive results. You did mention you   had the hard ProServe comp, and we don't really care about   ProServe revenue. It's an enabler. It's not a strategic driver of   the business. But -- but it does get mixed up, mixed in when   people look at headline results. So I'm curious on how should   people kind of think about or model out ProServe, are you looking   at that to decelerate in the future at a greater pace? It is not   as important to you all, you know. What is that? What is that   revenue enable for you?  Jennifer Ceran    --   Chief Financial Officer  Yeah, so on -- my expectation or our expectation rather is   that services revenue will continue to be a very important part   of our business. And we're guiding the year to 9% to 11%. So   won't necessarily decelerate more. I think if you adjust within   your modeling take somewhere between 9% to 11% of your total   revenue, that will be consistent with what we're looking at   internal with our business.  Mark Mader    --   Chief Executive Officer  I think one thing to add that, that when we think about   professional services, it's one part configuration and deployment   assistance. Another part is training and enablement. And that   part of services is alive and well. We're adding capacity to all   aspects of professional services. And I don't think we don't   foresee a slowdown on that type of investment at all from our   customers.  Steve Koenig    --   Wedbush Securities -- Analyst  Got it. Thanks, I appreciate that. And apologies if I'm   duplicating a question, I did get on the call late, but the one   follow-up. I would have would be your domain-based customer   acquisition activity was very good even on an organic basis.   Maybe could you comment a little bit on what drove that and how   we should think about that going forward?  Jennifer Ceran    --   Chief Financial Officer  Well, I mean, it's the same motions that we've been doing   every quarter. We just saw a few more domains this quarter join   on sign up for Smartsheet. And we're going to continue to invest   in awareness of our product and hope that we will continue to see   growth in that front.  Steve Koenig    --   Wedbush Securities -- Analyst  Terrific. Great. Well, thanks and congrats on a good   quarter.  Mark Mader    --   Chief Executive Officer  Thank you.  Gene Farrell    --   Chief Product Officer  Thanks.  Operator  Our last question is from Stephen McWilliams with Stephens,   Inc. Your line is open.  Stephen McWilliams    --   Stephens, Inc. -- Analyst  Hi, guys, thanks for squeezing me in. On your data point that   750 unique customers bought one or more capability products in   the quarter. How should we think about this? Maybe on a   year-over-year basis or compare to prior quarter?  Jennifer Ceran    --   Chief Financial Officer  Well, certainly, it's more. I don't have the exact data point   from a year ago. But you think about accelerators have been   around for about a year now. Dynamic View has been around for   about a year now. Prior to that, we had key control center and   just a few other things. So it's definitely up.  Mark Mader    --   Chief Executive Officer  Yeah, I think as we look at the penetration of capabilities   based price into our customer base that now exceeds 80,000. Very   -- we need to be reminded that a very small percentage of our   customers have bought them to date. So as we think about how we   package them, how we bundle them, how we price them, what we   develop next. We think it's still, again, very early innings on   this front. But we were pleased to see that know we have evidence   now of some customers buying multiple capabilities from us. So,   we apply those learnings and hopefully we again see that pattern   as being an important complement to the standard license.  Aaron Turner    --   Head of Investor Relations  And Ryan, this is Aaron. The only thing I would add is for   data points, in Q4, we referenced 700 unique customers buying   capabilities, one or more in the quarter and this quarter we're   reporting 750. So if you're looking for concrete data points,   those are the ones I would point to.  Stephen McWilliams    --   Stephens, Inc. -- Analyst  Perfect. And then previously mentioned 90% of your product   roadmap comes from customer feedback. What things are customers   asking for? Maybe you're seeing any particular interest from a   particular industry. And have there been any recent enhancements   from an AI standpoint on the platform.  Mark Mader    --   Chief Executive Officer  Yes. So I would say, so we still base 90% of our roadmap on   customer feedback and we have a number of different mechanisms we   use to drive that. And that's critically important. I would say   that we don't see there a lot of very specific use cases that   kind of create any kind of central tendency. We see really broad   use of smart sheet across a number of different functions and   industries. What we do find though is customers are looking for   things that make the platform do more work for them, whether   that's things like automation, which we've invested in pretty   aggressively, things that make it easier to get real time   insights into what's happening in work [Indecipherable] within   their organizations. So dashboards are growing very rapidly and   are kind of a key area of value. And then you'll see some things   that we're going to be announcing in ENGAGE, some capabilities   that we think are differentiated and really addressing some   customer needs that we've been hearing for a while. And so I say   I think it's fairly broad based. And then I forgot the last part   of your question was the last.  Stephen McWilliams    --   Stephens, Inc. -- Analyst  Just...  Mark Mader    --   Chief Executive Officer  I'm sorry. Thank you. I was reminded, AI, yes, I would say   that we believe that AI and ML are going to be important   underpinnings to where many or almost most end user applications   are going to be over the next 10 years. And so we are continuing   to invest in building our AI capabilities and you'll start to see   some of our user capabilities powered by AI, things like how we   prioritize notifications for users, how we suggest ways for users   to configure their work that will just make it easier in many   cases. We'll do it. We'll actually perform those configurations   for them. And so I'd say we're still super early. That technology   is still really emerging. And so but we're very committed to   ensuring that we're leveraging those technologies to make our   platform better for customers.  Stephen McWilliams    --   Stephens, Inc. -- Analyst  Perfect. Thanks for the detail. And thanks much for taking my   question.  Mark Mader    --   Chief Executive Officer  Great, Thanks.  Operator  This does conclude the Q&A period. I will now turn it back   to Aaron Turner for any closing remarks.  Aaron Turner    --   Head of Investor Relations  Well, thank you all for joining us today. We look forward to   speaking with you again next quarter and hopefully seeing many of   you at ENGAGE.  Operator  [Operator Closing Remarks]  Duration: 48 minutes  Call participants:  Aaron Turner    --   Head of Investor Relations   Mark Mader    --   Chief Executive Officer   Jennifer Ceran    --   Chief Financial Officer   Gene Farrell    --   Chief Product Officer   Bhavan Suri    --   William Blair -- Analyst   John DiFucci    --   Jefferies -- Analyst   Stan Zlotsky    --   Morgan Stanley -- Analyst   Richard Davis    --   Canaccord -- Analyst   Terry Tillman    --   SunTrust -- Analyst   Ittai Kidron    --   Oppenheimer -- Analyst   Scott Berg    --   Needham -- Analyst   Pinjalim Bora    --   JPMorgan -- Analyst   Alex Zukin    --   RBC -- Analyst   Steve Koenig    --   Wedbush Securities -- Analyst   Stephen McWilliams    --   Stephens, Inc. -- Analyst   More SMAR analysis   All earnings call transcripts        10 stocks we like better than Smartsheet   Inc.     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Smartsheet   Inc. wasn't one of them! That's right -- they think   these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     owns shares of Smartsheet Inc. The Motley Fool has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " Smartsheet Inc    (NYSE: SMAR)        Q2 2020 Earnings Call       Sep 4, 2019 ,   4:30 p.m. ET ",
    " Operator ",
    "Good afternoon. My name is Chris and I'll be your conference   operator today. At this time, I would like to welcome everyone to   the Smartsheet Second Quarter Fiscal 2020 Earnings Conference   Call. All lines have been placed on mute to prevent any   background noise. After the speakers' remarks, there will be a   question-and-answer session. [Operator Instructions] Thank you.   I'll now turn the conference over to Aaron Turner, Head of   Investor Relations.",
    " Aaron Turner    --   Head of Investor Relations ",
    "Thank you, Chris. Good afternoon and welcome, everyone to   Smartsheet second quarter of fiscal year 2020       earnings call    . We will be discussing the results announced in our press   release issued after the market closed today. With me today are   Smartsheet CEO, Mark Mader; our CFO, Jennifer Ceran; our Chief   Product Officer, Gene Farrell, will also be available during the   Q&A. Today's call is being webcast and will also be available   for replay on our Investor Relations website at   investors.smartsheet.com. There is a slide presentation that   accompanies Jennifer's prepared remarks, which can be viewed in   the Events section of our Investor Relations website.",
    "During this call, we will make forward-looking statements   within the meaning of the federal securities laws. We have based   these forward-looking statements largely on our current   expectations of -- and projections about future events and   financial trends. These forward-looking statements are subject to   a number of risks and other factors including, but not limited   to, those described in our SEC filings available on our Investor   Relations website and on SEC website at www.sec.gov.",
    "Although we believe that the expectations reflected in the   forward-looking statements are reasonable, our actual results may   differ materially and adversely. All forward-looking statements   made during this call are based on information available to us as   of today, and we do not assume any obligation to update these   statements as a result of new information or future events except   as required by law.",
    "In addition to US GAAP financials, we will discuss certain   non-GAAP financial measures. Reconciliation to the most directly   comparable US GAAP measure is available in the presentation that   accompanies this call, which can also be found on our Investor   Relations website.",
    "With that, let me turn the call over to Mark.",
    " Mark Mader    --   Chief Executive Officer ",
    "Thanks, Aaron. Good afternoon, everyone, and thank you for   joining us for today's call. We delivered another strong quarter   by executing our strategy of providing high value solutions for   enterprises, expanding Smartsheet's presence in new and existing   customers, and driving international growth. Our platform,   designed to accelerate individual and enterprise achievement,   enable teams and businesses of all sizes to move faster, address   significant challenges and drive innovation.",
    "We posted revenue of $64.6 million in Q2, representing   year-over-year growth of 53% and our annualized average contract   value, or ACV, per domain-based customer grew 48% year-over-year   to $2,972. The total number of all Smartsheet users across paid   in collaborators is now over $5.4 million. Expansion within our   base during the quarter included 46 companies increasing their   annual recurring revenue, or ARR, by more than $50,000 and 13   customers increasing their ARR by more than $100,000.",
    "Notable expansions occurred at customers such as Olympus   Corporation, a global leader in electronics and optics, U-Haul,   the moving equipment and storage rental company and VCCP, a   global creative and marketing firm serving some of the world's   largest brands. Many of those expansions were driven by a record   750 unique customers that bought one or more capability-based   products in Q2, with July seeing record bookings for our   Accelerator offerings.",
    "In conversations with customers this quarter, I was repeatedly   reminded of Smartsheet's mission-critical role in their   businesses from tracking clinical trials intended to eradicate   global diseases, to managing the remodeling and reopening of   hundreds of restaurants globally, I heard how Smartsheet is   driving high value automation and workflow consistency in areas   such as project management, research and development, healthcare   and media.",
    "For example, Syngenta, a Swiss-based biotech company, wanted   to connect workers at research labs, testing farms and product   manufacturing facilities in more than 90 countries to ensure   rapid and accurate decision making and reporting across the   organization. With Smartsheet, research and field teams now use   mobile devices and tablets to share information and images   quickly, allowing for real-time decisions about the next stages   of their agricultural experiments, more frequen   t report    ing of observed safety issues and increased transparency of   information from the field to corporate leaders.",
    "Providence Medical Group, a healthcare organization with 60   clinics throughout Oregon and Southern Washington, leverages   Smartsheet to intake document and track clinic managers at the   stations of compliance with constantly evolving medical practices   and mandated patient care requirements. Smartsheet's cross   platform accessibility enables caregivers to input and access   information from any device in any clinic location.",
    "And Crain Communications, a multi-industry publishing   conglomerate sought to implement a centralized work execution   platform across its 24 brands, including Ad Age, Autoweek and   regional business publications. By provisioning Smartsheet and   implementing our control center and dynamic new products, Crain   is able to build scalable, automated workflows that reduce time   to market and duplicative work, and increase visibility for both   internal stakeholders and third-party vendors.",
    "Fueling these team and organizational achievements and   Smartsheet wins is a strong pipeline of product innovation. We're   making significant investments focused on delivering a platform   and the infrastructure required to support that platform that   anyone can use to move faster, meet challenges and achieve more.   For example, the latest enhancements to our automated workflows   enable users to automate multiple actions and scenarios in a   single workflow. This includes the ability to automate approvals   with multiple stakeholders or to create a recurring workflow   using a time-based schedule. By enabling users to automate more   sophisticated work processes, Smartsheet helps organizations save   time and maintain data consistency.",
    "In mid-August, we announced that Smartsheet Gov had received   full FedRAMP authorization. Now that we are authorized in the   FedRAMP marketplace, we look forward to the chance to expand the   use of Smartsheet among federal employees as they seek to   modernize workflows and processes, drive the effectiveness and   pace of intra and inter-agency collaboration, and to deliver   better experiences for citizens. We look forward to unveiling   additional product offerings at our third annual ENGAGE global   customer conference, September 30th through October 3rd, with   registrations on track to outpace last year's total of 2,500   ENGAGE'19 is set to be even bigger and better. And we look   forward to seeing many of you there.",
    "Before I turn it over to Jenny, I want to share a few thoughts   on our national advertising campaign that we kicked off this   morning, with a full page ad in the print edition of The Wall   Street Journal. As you see the ads in the coming months across   many different channels, you'll note that we are heavily focused   on a message of achievement for both individuals and for   companies of all sizes. It's time that the world hears about all   that Smartsheet has to offer, and I look forward to us telling   that story more broadly.",
    "To close, I'm pleased with our performance thus far in fiscal   year '20 and remain ever mindful of the degree to which we are an   important part of our customers' businesses. Thank you to the   Smartsheet team for your support of our customers and of one   another. Thanks also to our customers, partners and shareholders   for your confidence in our service and in the future of our   business. Jenny?",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "Thank you, Mark, and welcome, everyone. As Mark mentioned, our   second quarter revenue came in at $64.6 million, up 53% versus a   year ago. Billings came in at $79.5 million, up 52% versus year   ago. Our dollar-based net retention rate was 134% and our average   ACV per domain-based customer grew 48% year-over-year. We also   added approximately 1,900 net new logos, a little over a third of   which we obtained via the 10000ft acquisition, to end the quarter   with over 82,000 domain-based customers. Second quarter non-GAAP   operating loss was $10.8 million as we continue to make   investments in our platform and go-to-market capabilities and   non-GAAP net loss per share was $0.08.",
    "Operating cash flow was negative $2.7 million and free cash   flow was negative $7.3 million. And we ended the quarter with   cash and short-term investments of $561 million, which includes   $380 million from our equity raise in June.",
    "Let me dive more into the revenue for the quarter. Of our   $64.6 million in total revenue, subscription revenue was $58.3   million, a 56% increase versus a year ago. Services revenue came   in at $6.3 million, up 29% versus a year ago and represented 10%   of total revenue. The services revenue growth rate was tempered   by the lapping of a large consulting engagement in Q2 of last   year and by our ongoing sales accelerators, which attach with a   lower services component.",
    "Let me move on to metrics. We continue to see strong growth in   our larger customers. 7,673 customers now pay us $5,000 or more   per year. 635 now pay us $50,000 or more per year and 226 now pay   us $100,000 or more per year. These customer segments grew   year-over-year by 55%, 113%, and 128% respectively and now   represent approximately 70%, 31% and 20% of total ACV.",
    "As mentioned earlier, our average ACV per domain-based   customer increased to $2,972 for the quarter and our dollar-based   net retention rate was 134% consistent with the prior quarter and   3 percentage points above the same quarter a year ago.",
    "Next, I'll provide color on the rest of our income statement   and a few highlights from our balance sheet. Unless otherwise   stated, all references to our expenses and operating results are   on a non-GAAP basis and are reconciled to our GAAP results in the   earnings release and presentation that was posted before the   call.",
    "In the second quarter, overall gross margin was 82%.   Subscription gross margin was 88%, flat with the prior and year   ago quarters. As we make incremental investments in our   infrastructure and migrate more of our services to the public   cloud, we expect our overall gross margin to come down toward our   long-term target overall margins of 78% to 80%. Professional   services margin was 31%, which was in line with prior   quarters.",
    "Turning to operating expenses. General and administrative   costs in the second quarter were $9.5 million, representing 15%   of total revenue. 1 percentage point below the prior quarter and   2 points below the year ago quarter as we began to show scale.   Research and development was $18.9 million or 29% of total   revenue, a decrease of 3 percentage points from the prior quarter   and 2 percentage points from the year ago quarter as we realize   some scale and saw increased capitalization of internal use   software.",
    "We continue to invest on our product capabilities and added a   record number of new developers to the team this quarter.   Finally, sales and marketing expense was $35.7 million or 55% of   revenue versus 59% of revenue in the prior quarter and 54% in the   year ago quarter. We expect our sales and marketing as a   percentage of total revenue to increase in the back half of this   year as we hold our third annual ENGAGE conference in October,   launch a brand advertising campaign and add more reps to support   our global expansion plans.",
    "Turning to operating loss and free cash flow. Operating loss   was $10.8 million, representing a negative operating margin of   17%. Approximately 70% of our total expenses were headcount   related and we ended the quarter with over 1,350 employees. Free   cash flow was negative $7.3 million, which includes capex spend,   capitalized internal use software and principal payments on   leases, totaling 7% of revenue.",
    "Now turning to billings. Our second quarter billings were   $79.5 million, up 52% versus a year ago. Approximately 90% of our   subscription billings were annual, with 9% monthly. Quarterly and   multi-year billings represented about 1% of the total.",
    "I'll now provide our guidance for the third quarter and the   full year fiscal year 2020. For the third quarter, we expect   total revenue of $69 million to $70 million, representing   year-over-year growth of 47% to 49%. We expect non-GAAP operating   loss to come in between $23 million and $22 million and non-GAAP   net loss per share to be between $0.19 and $0.18 based on   weighted average shares outstanding of $116.5 million. We also   expect our free cash flow in Q3 to be up to negative $4 million.   Both our operating loss and free cash flow reflect expenses   related to our ENGAGE conference, brand advertising and market   expansion plans.",
    "For the full fiscal year, we expect total revenue to be in the   range of $265 million to $268 million, representing growth of 49%   to 51%. We expect non-GAAP operating loss to be between $70   million and $66 million and non-GAAP net loss per share of   between $0.58 and $0.54 for the year based on approximately 112.5   million weighted average shares outstanding.",
    "We expect billings to be in the range of $320 million to $324   million for the full fiscal year, representing growth of 48% to   50% versus last year. And for modeling purposes, please assume   historical trends for quarterly billings for the remaining   quarters. Regarding free cash flow, our success extending   Smartsheet's presence into new markets such as the UK has given   us the confidence to invest faster in our international expansion   and accelerate our migration to the public cloud. Accordingly, we   are increasing our full year free cash flow guidance by negative   $5 million to a total of negative $25 million for the year.",
    "With that, we will now turn it back to the operator to take   your questions.",
    " Operator ",
    "[Operator Instructions] Your first question is from Bhavan   Suri with William Blair. Your line is open.",
    " Bhavan Suri    --   William Blair -- Analyst ",
    "Hey, guys. Thanks for taking my question and nice job. The   dollar retention rate is just amazing. I guess I want to touch   maybe first for Mark here, you look at these accelerators and   those capability-based solutions are contributing nicely to the   results, I guess, help us understand how customers decide to   adopt these and then are you seeing new customers land with these   solutions or is it something that's adopted by more advanced   [Indecipherable] customers for some time? And I got a quick   follow-up.",
    " Mark Mader    --   Chief Executive Officer ",
    "Hey, Bhavan. I think the Accelerators are really serving --   serving a nice role in helping people understand how to deploy   Smartsheet to solve something that matters within their business.   So when you look at the seven Accelerators we have, these are   common issues that we see, challenge that we see across business,   and rather than choosing a platform, which requires configuration   to achieve an outcome, they can choose something which is more   turnkey, where they can say, we want to take an M&A   accelerator or we want to do a joint selling accelerator, and   it's a great way to on-board.",
    "Now, as I've said in prior calls, whether they choose to   deploy the accelerator or go with a non-accelerator-based   approach that education in that grounding has served as very well   to get people onside. When we look at whether it's influencing   new and expansion business, we have sold accelerators into both   given the distribution of our sales reps being overweighted to   expansion, clearly that group has an advantage because we have   many more quota-carrying reps there. But we are starting to see   signal where the new business reps are feeling comfortable when   presenting those.",
    " Bhavan Suri    --   William Blair -- Analyst ",
    "Great. That's really helpful. Then a quick follow-up for   Jenny. Jenny, given sort of the mix of the business globally. I'd   love to understand. If you saw any currency impact this quarter   and if you could quantify what that was in the numbers and what   you might have modeled into guidance, given sort of we've seen   some pretty big currency moves globally. Thank you.",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "Yeah. Hey, Bhavan. So currency is still relatively small for   us compared to some other companies. We bill -- roughly 7% of our   subscription billings are in non-US dollars. If you look at the   impact, however, in Q2 because there has been a relatively big   move, we did see a headwind of roughly $300,000 on our billings   because we invoice at the current spot rate and that's basically   what goes into our billings number.",
    "On the revenue side, it was minimal impact just because of how   we allocate revenue throughout the year. And it's based on an   historical rate. One of the things we did notice, though, on   dollar net retention rate, we did see a little bit of a headwind   there and it wasn't anything to have significant impact, but   several basis points based on the fact that the math is creating   a headwind there.",
    " Bhavan Suri    --   William Blair -- Analyst ",
    "Got it. Helpful. Thank you, guys. Nice job. Thanks for taking   my questions.",
    " Mark Mader    --   Chief Executive Officer ",
    "Thank you.",
    " Operator ",
    "Your next question comes from John DiFucci with Jefferies.   Your line is open.",
    " John DiFucci    --   Jefferies -- Analyst ",
    "Thank you. I'm sorry. I was having some telephone technology   issues there. So hopefully you hit these issues -- but these   questions. I guess, to follow-up on both Bhavan's questions,   first on the international business, I think last quarter, Jenny,   you said you had 11 salespeople in the UK. Can you give us any   other -- any other data on international and how that's doing   either as far as your presence there or even I'm not -- did get   cut off a couple of times, but if you've given the revenue that's   come from international that be great too.",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "Right. Well, so we started the year with 15 folks in the UK   and we now have 30, and nearly half of them are quota-carrying   reps. And we are planning to invest more in the UK this year   because for the first half of the year in terms of our internal   targets, the UK team has exceeded those expectations. So we feel   really good about their performance to date and investing more in   that business.",
    " John DiFucci    --   Jefferies -- Analyst ",
    "Okay, great. Okay. And -- have you given -- did you say   anything about what kind of contribution realizing you had in   international business prior to even putting people in the UK?   But can you -- did you give that information about how much   business came internationally this quarter?",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "21% of our revenue this quarter was from international.",
    " John DiFucci    --   Jefferies -- Analyst ",
    "Okay, OK, great. And I guess just on the -- on the   accelerators and maybe, Gene, if you can talk to this, or Mark,   this sounds really interesting, right. And it sounds like it's   actually spurring business even if the accelerators have been   bought. But -- so should we continue to see you're at seven now?   I think Mark said should we continue to see other areas? Is there   anything, any other accelerators you can talk about that are on   the come? I'm not sure if you want to pre-announce them, but   maybe talk about some areas that might be interesting?",
    " Gene Farrell    --   Chief Product Officer ",
    "Yeah, hi, John. Thanks for the question. Yeah, as you stated,   we have seven today. We continue to develop new accelerators   based on where we see customer signal. And my team would shoot me   if I gave away the announcements that we're likely willing to --   we're going to be planning to make at the ENGAGE conference at   the end of the month. But I would tell you that we continue to   look at areas where we think we can bring customers more out of   the box solutions to solve meaningful problems for their   business. And I think that we'll talk about after the ENGAGE   conference.",
    " John DiFucci    --   Jefferies -- Analyst ",
    "Okay. We can -- we can wait a month and look forward to it.   And nice job here. It's -- it's great to see a company actually   continue at the same kind of momentum that you've been at now for   just over a year. So thanks.",
    " Gene Farrell    --   Chief Product Officer ",
    "Thanks. John.",
    " Operator ",
    "Your next question is from Stan Zlotsky with Morgan Stanley.   Your line is open.",
    " Stan Zlotsky    --   Morgan Stanley -- Analyst ",
    "Hey, guys. Thank you so much for taking my question. And   again, nice job on the quarter. So from my end, looking at it   certainly sounds like accelerators are doing very well. How are   you thinking about accelerators and what kind of contribution   that could have to your financials as we go into the back half of   the year and in as much as accelerators having amazing adoption,   how do you think about what that does to your pro services growth   as we go back out to this year and potentially into next year?   And I have a quick follow-up.",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "Yeah, OK. Hi, Stan. This is Jenny. Well, with respect to the   second part of your question, in terms of our pro services   growth, we guided 9% to 11% in Q1, we were at 10% in Q2 and I   would continue with that guidance. There's no change. Pro   services is still really important to us. It's just priced   differently than it was a year ago. Then with respect to the   first question around accelerators and their contribution, we're   seeing our capabilities based products increase as a percentage   of total subscription revenue. So last quarter it was 9%. This   quarter it was 10%. And you know, as we create new solutions in   this area, I would expect that we could see that trend   continue.",
    " Stan Zlotsky    --   Morgan Stanley -- Analyst ",
    "Got it. Thank you. And just a quick follow-up. What was the   inorganic contribution in the quarter from the acquisition of   10000ft?",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "Yeah. We're not breaking out 10000ft as it's really not   material to the overall results. But what I can remind you of is   last quarter we said that we expected 10000ft to generate $2   million of revenue and $4 million in billings for the full year,   so over three quarters. And I would tell you that, they're   performing well and they kind of met our expectations for the   quarter.",
    " Stan Zlotsky    --   Morgan Stanley -- Analyst ",
    "Okay, perfect. Thank you so much.",
    " Operator ",
    "Your next question is from Richard Davis with Canaccord. Your   line is open.",
    " Richard Davis    --   Canaccord -- Analyst ",
    "Hey, thanks. Mark, you're kind of a student of the evolution   of markets and things like that. And I'm wondering, I know we're   right at the foothills in this space, but are you -- have you   seen any evidence inside some of your companies where they may   have had multiple vendors beyond that using Excel? And you guys   have kind of found those vendors out or are we even -- or is that   just so far lay as it like years before that's really an issue.   I'm just trying to think about how this market's evolving and   stuff because as you know, there's other companies in different   swim lanes, and I'm just trying to thinking about these Venn   diagrams. Thanks.",
    " Mark Mader    --   Chief Executive Officer ",
    "Hi, Richard. What I'm -- what I'm hearing from -- I had a   really interesting conversation with the CEO week before last and   he was on a mission to help his large scale mega cap company go   from 13 providers in one category down to three. So the charter   wasn't to -- to jettison or bounce out 12 of the 13, but to try   and get efficiencies by being a little bit more choice full. So I   would say, what did it surprise me to learn that one of our   largest customers had over 4,000 apps they had deployed. That did   surprise me. That's a lot of apps. And I do think people's intent   is to really put energy behind the ones that are working best for   them. I think in terms of the flight to sort of find a single   that works for everything in every category. That's not what   we're seeing today. So I think because the user preferences and   desires and needs are being incorporated into buy decisions and   renewal decisions, there's a very healthy balance right now   between the business units and IT. But I do think that over time,   people's intent is to -- is to not have sprawl. But again, I   don't think the pendulum is going to swing back to having a   single provider within each category for these large   companies.",
    " Richard Davis    --   Canaccord -- Analyst ",
    "Got it. Thank you very much.",
    " Mark Mader    --   Chief Executive Officer ",
    "Yeah.",
    " Operator ",
    "Your next question is from Terry Tillman with SunTrust. Your   line is open.",
    " Terry Tillman    --   SunTrust -- Analyst ",
    "Hey, Mark, Jenny and Aaron, sorry for a horrible cold here,   but I guess the first question just relates to, it sounds like   sales and marketing investments are ramping in the second half,   maybe even more than we expected. I think part of it like   advertising, I know you have a new CMO, but maybe you could   pinpoint some of the other areas where there's incremental   investment. And then how do we -- when we're talking to   investors, what are some of the proof points of ROI you would see   next year, which I'm assuming that's when you'd see benefits,   whether it's just net new customers or 100,000 K [Phonetic] per   your customers, just a little bit more about the investment and   then how we watch the metrics around that. And I had a follow-up.   Thank you.",
    " Mark Mader    --   Chief Executive Officer ",
    "Thanks, Terry. I'll take the first half of that and Jenny will   take the second. In terms of the investments that are   incremental, we knew when we brought Anna into our team that we   were going to be deploying campaign dollars in the second half of   this year. What we have been pleased to see is how our team are   composite in the UK has come together and clarity around   quota-carrying reps, customer success, support how that whole   group is gelling. We now want to pull our Asia-Pac investment   forward and we feel like we're organizationally ready to do   that.",
    "Heading into the year, we had really anticipated that not   hitting in FY '20. So I think one of the things that's slightly   different about how we're going to approach that than what we did   in the UK, I would say we were more -- we approached the UK in a   more phased manner. First we said we were going to have a sales   leader, then some quota-carrying reps, and over the course of   quite a few months, we built that composite. We now have   confidence in what the structure looks like and we're going to be   more assertive in getting that group in place quickly. Jenny?",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "Yeah. And with respect to sales and marketing kind of in the   back half, if you kind of look at what happened last year between   Q2 and Q3 saw a jump up in sales and marketing and that was   driven heavily by our ENGAGE conference. Several million of   incremental investment there. On top of that, we've got expansion   into these international markets, we've got brand advertising. So   I think the increase in sales and marketing as a percentage of   revenue into Q3 will be more pronounced than what you saw a year   ago.",
    "And in terms of return on our investments, we continue to   monitor LTV to CAC payback, magic number, and we look at these   every quarter. And right now we still feel really good about it   and we still feel like there's room to make incremental   investments.",
    " Terry Tillman    --   SunTrust -- Analyst ",
    "Okay. And I technically view that as just one question, even   though it's two parts. Could I ask a second question, a   follow-up.",
    " Mark Mader    --   Chief Executive Officer ",
    "Yeah, sure, Terry.",
    " Terry Tillman    --   SunTrust -- Analyst ",
    "Right. I don't know why I asked you if I could ask you a   question. So anyways, Jenny, you gave a perspective on billing.   You also had a couple of years now this great ENGAGE conference.   What I'm curious about is, what are you baking into in terms of   potential sales activity? I know part of it's education,   networking, etc. And just kind of unleash all the new innovation,   but as you've done this a couple years in a row, like how much   are you banking on actually getting a lot of new sales activity   coming out of it? Thank you.",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "Well, it's definitely a lead generation opportunity we get to   engage with customers, there's business that's done, and so we   factor, our best estimates of what that might look like for Q3   and Q4. Without going into too much detail of what it is, when we   do feel like there's a good return from ENGAGE.",
    " Operator ",
    "Your next question comes from Ittai Kidron with Oppenheimer.   Your line is open.",
    " Ittai Kidron    --   Oppenheimer -- Analyst ",
    "Hi, guys. Good quarter. I guess a couple for me. First, Mark,   I guess I'm trying to kind of look at the pattern of -- of your   results over the past few quarters and can't help seeing that the   magnitude of the beat over the top range of your guidance is   shrinking and shrinking from one quarter to another. And under   the assumption that the methodology by which you give guidance   does not change, what is changing in that business? Or perhaps   maybe you could talk about what you are not happy with during the   quarter.",
    " Mark Mader    --   Chief Executive Officer ",
    "Yeah, I think it's over the course of 13 years, Ittai. If   you'd wake me up at 2:00 in the morning, I would say I want most   things sooner than we get them right on almost all dimensions. So   this will be a nice, long answer for you. So we did two   acquisitions in the first half of the year. The team -- the way   in which those teams, those team members have folded into our   community has been really strong. I would have loved to have on a   product integration side had those day one. So you do the   acquisition the next day, you come in the office and the parts   are fully integrated and we're excited about showing our customer   base at ENGAGE some of the progress on that front, but that is   something where as we go to market, we want to have sort of a   hand in glove, unified offering across all those dimensions.",
    "So that is one that we're pushing on very hard. And only until   you embark on that work, do you really understand what's   entailed. And we believe that details matter. So the difference   between shipping something out to market quickly and putting jazz   hands around and telling customers to buy something that's not   ready. That's not how we run our business. So that's one very   specific thing, which as we look at additional acquisitions over   time, we're going to apply those learnings and further refine our   models. FedRAMP is another one. We had given multiple progress   reports in pas   t quarterly   report    s. I would have loved that to have been a 90-day process. We are   one of the fastest companies ever through that process in just   about a year. That seems like an eternity to me. And now we have   earned the right to engage on RFP processes with federal   agencies. I will probably and be disappointed with the length of   time it takes to execute those. But again, these are   opportunities, right? So those are two concrete things, which I   would say represent new opportunities that simply needs some time   to bake. And unfortunately, I don't get to control all the   variables there, but I'm very excited about both of those   fronts.",
    " Ittai Kidron    --   Oppenheimer -- Analyst ",
    "Excellent. And then as a follow-up, Jenny, you've talked about   how you expect the gross margins to kind of drift down over time.   But what is it that really we need to see from a revenue   standpoint or some sort of scale standpoint that will actually   make you get there? Because you seem to be doing far better than   your long-term target for a long time and you're holding it quite   steady.",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "Yeah, I think that relates predominantly to the timing of our   migration to the cloud, and as we mentioned on the call that we   are accelerating that migration. Originally we were thinking 18   months and now we're thinking more like six months. So to the   extent that happens faster, you should expect our subscription   gross margin to tick down percentage.",
    " Ittai Kidron    --   Oppenheimer -- Analyst ",
    "Just to clarify that, are you all -- are you already in that   process or you'll start it in six months? I'm a bit confused.",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "We've already started it, but we re taking a much slower   process and now we have decided we're going to accelerate that.   And so we'll start seeing more cloud-based expenses versus the   depreciation that we have on equipment. There could be some   overlap which will bring that down a bit.",
    " Ittai Kidron    --   Oppenheimer -- Analyst ",
    "Got it. Okay. Thank you very much. Good luck, guys.",
    " Gene Farrell    --   Chief Product Officer ",
    "Thanks.",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "Thanks.",
    " Mark Mader    --   Chief Executive Officer ",
    "Thank you.",
    " Operator ",
    "Your next question is from Scott Berg with Needham. Your line   is open.",
    " Scott Berg    --   Needham -- Analyst ",
    "Hi, everyone. Congrats on a good quarter. Mark, I wanted to   expand on the FedRAMP opportunity to start, I guess. Can you   remind us how much of your business comes from federal in general   right now. My guess is really, really small, but how should we   view this opportunity in terms of what your longer term   opportunity looks like here?",
    " Mark Mader    --   Chief Executive Officer ",
    "Yeah, I think what I first thought over the years from people   who've sold into the agencies is that, there is no formulaic   playbook that works for all companies equally. So I am in many   respects an experiential learner and where we're starting on this   process now. We do have, I would say, a very, very small   percentage of our revenue today, low, low, low single digits   comes from this world today. The degree to which people make   decisions on somewhat of a tactical temporary authorization to   operate approach is different than a full on agency RFP process.   We have not gone through that process yet to closer. So as we   understand that, we will have a greater sense for the magnitude   of the opportunity. What we do know is that agencies have real   needs. What we do know is that it's a very small number of   vendors who are authorized to sell to them. So I like that   dynamic, but until we start posting wins and we start seeing   agencies successfully utilizing our product, it's -- there's   really no evidence to draw from.",
    " Scott Berg    --   Needham -- Analyst ",
    "Got it. Helpful. Then a quick follow-up for Jenny on free cash   flow. I get the additional investments this year given the   success. How much [Indecipherable] '21. I believe you've   discussed being roughly cash flow neutral for the year at fiscal   '21. Are you still holding that expectation? True, or does that   maybe change?",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "Well, to your point, we are very mindful of our path to   profitability. But at the same time, we're looking at, growth   opportunities that are pretty significant and investments that we   may want to make related to those. So we're finishing off this   year. We've still got another five months to go. We're kicking   off our planning process kind of as we speak right now. And I'll   give everyone an update when we guide for the next year, in a   couple quarters.",
    " Scott Berg    --   Needham -- Analyst ",
    "Got it. Thanks again. Congrats on a good quarter.",
    " Mark Mader    --   Chief Executive Officer ",
    "Thanks.",
    " Operator ",
    "Your next question is from Mark Murphy with JPMorgan. Your   line is open.",
    " Pinjalim Bora    --   JPMorgan -- Analyst ",
    "Hey, guys. This is Pinjalim on behalf of Mark. Thanks for   taking our questions and congrats on the quarter. Going back to   the tepid [Phonetic] capability based offerings, could you talk   about the uptick of Control Center and Dynamic View? How those   are doing? And then those two along with accelerators, where do   you see the most opportunity among those three? And the third   part of that lovely question is what is the average ASP that   you're realizing from these products today?",
    " Mark Mader    --   Chief Executive Officer ",
    "You packed a lot in there. So control center dynamic view and   data uploader are three areas in addition to Excel -- are the   three -- are the three premium products in addition to   accelerator is it kind of make up the bundle of most of the   demand is? I would actually tell you that all of those are quite   healthy. Data uploader has probably been the one that's the   fastest growing for us. And while we don't -- we don't breakout   ASP for each of our -- for our premium-based offerings, I would   tell you that it varies pretty widely across that portfolio.   Based on the size of the -- the size of that solution we're   building for the customer.",
    " Pinjalim Bora    --   JPMorgan -- Analyst ",
    "Okay. And is it fair to say that a control center may be being   the oldest is the largest among those all of us?",
    " Mark Mader    --   Chief Executive Officer ",
    "Yes. Yeah, control center has been around and it's the largest   of -- it represents the largest revenue of that group.",
    " Pinjalim Bora    --   JPMorgan -- Analyst ",
    "Understood. Okay. And Jenny the dollar-based net retention   obviously has been holding up pretty steadily. That's great to   see. Is there any improvement in gross retention or churn to be   called out there?",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "Yeah. So last quarter I mentioned that our lost rate was above   9%, but rounded down to 9%. This quarter it's below 9%, but it   rounds up to 9% still. So we have 40 basis point improvement in   total loss rate for the quarter.",
    " Pinjalim Bora    --   JPMorgan -- Analyst ",
    "Excellent. Thank you so much.",
    " Operator ",
    "Your next question is from Alex Zukin with RBC. Your line is   open.",
    " Alex Zukin    --   RBC -- Analyst ",
    "Hi guys, thanks for taking my question and congrats on a solid   report. I guess maybe just first on the dollar-based net   expansion metric, another great posting at 134%. What's the right   way to think about that for the back half of this year? Is this   kind of the right balance? Do you see it ticking up? Or is it at   the right range at this point?",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "Yeah. Hey, Alex. Look, nice to be working with you again. On   the net retention rate, we are modeling high-20s by the end of   the fiscal year. So high-120 percentages. We don't typically   bring it up, that would be very aggressive on and very -- but it   is we're very happy with the number.",
    " Alex Zukin    --   RBC -- Analyst ",
    "Perfect. And then maybe for Mark. Can you -- it seems like   you've got a lot of growth opportunities ahead of you and your   investing ahead of that growth. So maybe can you stack rank by   maybe your enthusiasm level or where you see the lowest hanging   fruit between the UK, APAC and federal. And where do you feel   like you're still under investing from that perspective?",
    " Mark Mader    --   Chief Executive Officer ",
    "One thing I like to remind our employees is low hanging fruit   still needs to be picked, and when it's falling on the ground,   it's typically rotted. So each of these things takes effort. And   I think the thing that we're organizationally focused on right   now, there are such a plethora of things to pursue, but the   things you pursue hardly do those really, really well? So the UK,   we learn some lessons in terms of what we're going to be applying   to our next region. We will be deploying people differently to   the next region. The team did a heroic effort in the UK holding   it together as we face people in and out. And it's -- it's again,   we're going to apply that.",
    "So I think it is in terms of excitement, I get excited about   things that we learn and apply more effectively next time around.   I talked about that in the context of acquisitions. I'm talking   about in the context of new territory presence. And the federal   is no different, right. So as we go to deploying our sales   professions who are dedicated to that space as we learn how to   best respond to inquiries, how to respond to authentic inquiries   versus increase where they're just sort of kicking the tires, we   will learn from that as well.",
    "The things that I'm most excited about, at the core of it,   we're a software company. We build stuff. We build stuff that   people should love and I am fired up for ENGAGE. I'm fired up   that we're going to be bringing stuff to market that is   differentiated. So, I mean, it's one thing to talk about, are you   better than someone else? Do you need to look a little different   than someone else? Do they like the sound of your offering   better? No. If you have stuff that is not possible elsewhere,   that is a very concrete thing to talk about with people in a   sales call. I love those things. So as we think about our   roadmap, it's not just improving certain things. Getting into new   markets, it brings stuff to market for which there is a need that   other people don't have. I love that unions. So that's my number   one. Hopefully you come ENGAGE, you can learn about some of   it.",
    " Alex Zukin    --   RBC -- Analyst ",
    "Thank you, guys. Appreciate it.",
    " Mark Mader    --   Chief Executive Officer ",
    "Thanks.",
    " Operator ",
    "Your next question is from Steve Koenig. with Wedbush   Securities. Your line is open.",
    " Steve Koenig    --   Wedbush Securities -- Analyst ",
    "Hi, Smartsheet. Thanks for taking my question. So one quick   one and one follow-up. When -- your subscription revenue hardly   decelerated at all. Very impressive results. You did mention you   had the hard ProServe comp, and we don't really care about   ProServe revenue. It's an enabler. It's not a strategic driver of   the business. But -- but it does get mixed up, mixed in when   people look at headline results. So I'm curious on how should   people kind of think about or model out ProServe, are you looking   at that to decelerate in the future at a greater pace? It is not   as important to you all, you know. What is that? What is that   revenue enable for you?",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "Yeah, so on -- my expectation or our expectation rather is   that services revenue will continue to be a very important part   of our business. And we're guiding the year to 9% to 11%. So   won't necessarily decelerate more. I think if you adjust within   your modeling take somewhere between 9% to 11% of your total   revenue, that will be consistent with what we're looking at   internal with our business.",
    " Mark Mader    --   Chief Executive Officer ",
    "I think one thing to add that, that when we think about   professional services, it's one part configuration and deployment   assistance. Another part is training and enablement. And that   part of services is alive and well. We're adding capacity to all   aspects of professional services. And I don't think we don't   foresee a slowdown on that type of investment at all from our   customers.",
    " Steve Koenig    --   Wedbush Securities -- Analyst ",
    "Got it. Thanks, I appreciate that. And apologies if I'm   duplicating a question, I did get on the call late, but the one   follow-up. I would have would be your domain-based customer   acquisition activity was very good even on an organic basis.   Maybe could you comment a little bit on what drove that and how   we should think about that going forward?",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "Well, I mean, it's the same motions that we've been doing   every quarter. We just saw a few more domains this quarter join   on sign up for Smartsheet. And we're going to continue to invest   in awareness of our product and hope that we will continue to see   growth in that front.",
    " Steve Koenig    --   Wedbush Securities -- Analyst ",
    "Terrific. Great. Well, thanks and congrats on a good   quarter.",
    " Mark Mader    --   Chief Executive Officer ",
    "Thank you.",
    " Gene Farrell    --   Chief Product Officer ",
    "Thanks.",
    " Operator ",
    "Our last question is from Stephen McWilliams with Stephens,   Inc. Your line is open.",
    " Stephen McWilliams    --   Stephens, Inc. -- Analyst ",
    "Hi, guys, thanks for squeezing me in. On your data point that   750 unique customers bought one or more capability products in   the quarter. How should we think about this? Maybe on a   year-over-year basis or compare to prior quarter?",
    " Jennifer Ceran    --   Chief Financial Officer ",
    "Well, certainly, it's more. I don't have the exact data point   from a year ago. But you think about accelerators have been   around for about a year now. Dynamic View has been around for   about a year now. Prior to that, we had key control center and   just a few other things. So it's definitely up.",
    " Mark Mader    --   Chief Executive Officer ",
    "Yeah, I think as we look at the penetration of capabilities   based price into our customer base that now exceeds 80,000. Very   -- we need to be reminded that a very small percentage of our   customers have bought them to date. So as we think about how we   package them, how we bundle them, how we price them, what we   develop next. We think it's still, again, very early innings on   this front. But we were pleased to see that know we have evidence   now of some customers buying multiple capabilities from us. So,   we apply those learnings and hopefully we again see that pattern   as being an important complement to the standard license.",
    " Aaron Turner    --   Head of Investor Relations ",
    "And Ryan, this is Aaron. The only thing I would add is for   data points, in Q4, we referenced 700 unique customers buying   capabilities, one or more in the quarter and this quarter we're   reporting 750. So if you're looking for concrete data points,   those are the ones I would point to.",
    " Stephen McWilliams    --   Stephens, Inc. -- Analyst ",
    "Perfect. And then previously mentioned 90% of your product   roadmap comes from customer feedback. What things are customers   asking for? Maybe you're seeing any particular interest from a   particular industry. And have there been any recent enhancements   from an AI standpoint on the platform.",
    " Mark Mader    --   Chief Executive Officer ",
    "Yes. So I would say, so we still base 90% of our roadmap on   customer feedback and we have a number of different mechanisms we   use to drive that. And that's critically important. I would say   that we don't see there a lot of very specific use cases that   kind of create any kind of central tendency. We see really broad   use of smart sheet across a number of different functions and   industries. What we do find though is customers are looking for   things that make the platform do more work for them, whether   that's things like automation, which we've invested in pretty   aggressively, things that make it easier to get real time   insights into what's happening in work [Indecipherable] within   their organizations. So dashboards are growing very rapidly and   are kind of a key area of value. And then you'll see some things   that we're going to be announcing in ENGAGE, some capabilities   that we think are differentiated and really addressing some   customer needs that we've been hearing for a while. And so I say   I think it's fairly broad based. And then I forgot the last part   of your question was the last.",
    " Stephen McWilliams    --   Stephens, Inc. -- Analyst ",
    "Just...",
    " Mark Mader    --   Chief Executive Officer ",
    "I'm sorry. Thank you. I was reminded, AI, yes, I would say   that we believe that AI and ML are going to be important   underpinnings to where many or almost most end user applications   are going to be over the next 10 years. And so we are continuing   to invest in building our AI capabilities and you'll start to see   some of our user capabilities powered by AI, things like how we   prioritize notifications for users, how we suggest ways for users   to configure their work that will just make it easier in many   cases. We'll do it. We'll actually perform those configurations   for them. And so I'd say we're still super early. That technology   is still really emerging. And so but we're very committed to   ensuring that we're leveraging those technologies to make our   platform better for customers.",
    " Stephen McWilliams    --   Stephens, Inc. -- Analyst ",
    "Perfect. Thanks for the detail. And thanks much for taking my   question.",
    " Mark Mader    --   Chief Executive Officer ",
    "Great, Thanks.",
    " Operator ",
    "This does conclude the Q&A period. I will now turn it back   to Aaron Turner for any closing remarks.",
    " Aaron Turner    --   Head of Investor Relations ",
    "Well, thank you all for joining us today. We look forward to   speaking with you again next quarter and hopefully seeing many of   you at ENGAGE.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 48 minutes ",
    " Aaron Turner    --   Head of Investor Relations ",
    " Mark Mader    --   Chief Executive Officer ",
    " Jennifer Ceran    --   Chief Financial Officer ",
    " Gene Farrell    --   Chief Product Officer ",
    " Bhavan Suri    --   William Blair -- Analyst ",
    " John DiFucci    --   Jefferies -- Analyst ",
    " Stan Zlotsky    --   Morgan Stanley -- Analyst ",
    " Richard Davis    --   Canaccord -- Analyst ",
    " Terry Tillman    --   SunTrust -- Analyst ",
    " Ittai Kidron    --   Oppenheimer -- Analyst ",
    " Scott Berg    --   Needham -- Analyst ",
    " Pinjalim Bora    --   JPMorgan -- Analyst ",
    " Alex Zukin    --   RBC -- Analyst ",
    " Steve Koenig    --   Wedbush Securities -- Analyst ",
    " Stephen McWilliams    --   Stephens, Inc. -- Analyst ",
    " More SMAR analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than Smartsheet   Inc.     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Smartsheet   Inc. wasn't one of them! That's right -- they think   these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     owns shares of Smartsheet Inc. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:23:33"
}