{
  "url": "https://www.nasdaq.com/article/doordash-spreads-beyond-north-america-with-australia-launch-20190903-01151",
  "title": "DoorDash spreads beyond North America with Australia launch - Nasdaq.com",
  "text": [
    "SYDNEY, Sept 4 (Reuters) - Meal delivery service DoorDash Inc said it will begin taking orders in the Australian city of Melbourne on Wednesday, its first foray outside North America, adding to the competition in the country's home-delivery service market.",
    "The biggest U.S. food delivery company will take on Uber Technologies Inc'sUber Eats, Just Eats Plc's  Menulog and Britain's Deliveroo just as the Australian food delivery market shows signs of slowing after years of rapid growth, according to official figures.",
    "Doordash said in a statement it would sell deliveries from thousands of restaurants in the central business district and inner suburbs of Australia's second-largest city with plans to expand to the rest of the world's No. 14 economy by the end of 2020.",
    "With cheaper real estate than Sydney, Uber has routinely launched new offerings in the city, while several Chinese and Singapore-owned dockless bicycle rental companies have picked Melbourne to start in Australia.",
    "\"We dove deep into the Australian market and quickly realised two things; restaurants want more from their delivery partners, and not all Melburnians have access to the selection that they should expect,\" said DoorDash General Manager, Australia, Thomas Stephens, in a statement.",
    "San Francisco-based DoorDash, whose investors include Japanese holding conglomerate SoftBank (9984.T), Sequoia Capital and Charles River Ventures, was founded in 2013 by Stanford students Andy Fang, Stanley Tang, Tony Xu and Evan Moore.",
    "Last month, the company raised $250 million in a new round of funding co-led by Coatue Management and DST Global, valuing the company at $4 billion.",
    "The food delivery market makes money by pairing restaurants with private delivery drivers on a smartphone app, for a fee.",
    "The market in Australia has become crowded fast, with Just Eat taking a hefty writedown on its Menulog brand in 2017, two years after buying it, while German-owned Foodora closed its Australian operation in 2018 after three years."
  ],
  "published_datetime": "2019-09-03 16:00:00"
}