{
  "url": "https://www.nasdaq.com/article/asrt-vs-zts-which-stock-should-value-investors-buy-now-cm1207171",
  "title": "ASRT vs. ZTS: Which Stock Should Value Investors Buy Now? - Nasdaq.com",
  "text": [
    " Investors with an interest in Medical - Drugs stocks have likely encountered both Assertio (ASRT) and Zoetis (ZTS). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look. The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The Zacks Rank is a proven strategy that targets companies with positive earnings estimate revision trends, while our Style Scores work to grade companies based on specific traits. Assertio and Zoetis are both sporting a Zacks Rank of # 2 (Buy) right now. Investors should feel comfortable knowing that both of these stocks have an improving earnings outlook since the Zacks Rank favors companies that have witnessed positive analyst estimate revisions. However, value investors will care about much more than just this. Value investors also try to analyze a wide range of traditional figures and metrics to help determine whether a company is undervalued at its current share price levels. The Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P/E ratio, P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value. ASRT currently has a forward P/E ratio of 1.48, while ZTS has a forward P/E of 35.69. We also note that ASRT has a PEG ratio of 0.07. This figure is similar to the commonly-used P/E ratio, with the PEG ratio also factoring in a company's expected earnings growth rate. ZTS currently has a PEG ratio of 3.22. Another notable valuation metric for ASRT is its P/B ratio of 0.43. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, ZTS has a P/B of 25.22. These metrics, and several others, help ASRT earn a Value grade of A, while ZTS has been given a Value grade of C. Both ASRT and ZTS are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that ASRT is the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  ASSERTIO THERAPEUTICS, INC (ASRT): Free Stock Analysis Report   Zoetis Inc. (ZTS): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors with an interest in Medical - Drugs stocks have likely encountered both Assertio (ASRT) and Zoetis (ZTS). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look.",
    "The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The Zacks Rank is a proven strategy that targets companies with positive earnings estimate revision trends, while our Style Scores work to grade companies based on specific traits.",
    "Assertio and Zoetis are both sporting a Zacks Rank of # 2 (Buy) right now. Investors should feel comfortable knowing that both of these stocks have an improving earnings outlook since the Zacks Rank favors companies that have witnessed positive analyst estimate revisions. However, value investors will care about much more than just this.",
    "Value investors also try to analyze a wide range of traditional figures and metrics to help determine whether a company is undervalued at its current share price levels.",
    "The Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P/E ratio, P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value.",
    "ASRT currently has a forward P/E ratio of 1.48, while ZTS has a forward P/E of 35.69. We also note that ASRT has a PEG ratio of 0.07. This figure is similar to the commonly-used P/E ratio, with the PEG ratio also factoring in a company's expected earnings growth rate. ZTS currently has a PEG ratio of 3.22.",
    "Another notable valuation metric for ASRT is its P/B ratio of 0.43. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, ZTS has a P/B of 25.22.",
    "These metrics, and several others, help ASRT earn a Value grade of A, while ZTS has been given a Value grade of C.",
    "Both ASRT and ZTS are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that ASRT is the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:12"
}