{
  "url": "https://www.nasdaq.com/article/uk-government-publishes-nodeal-brexit-scenarios-predicting-disorder-20190912-00136",
  "title": "UK government publishes no-deal Brexit scenarios predicting disorder - Nasdaq.com",
  "text": [
    "By Paul Sandle",
    "LONDON, Sept 12 (Reuters) - A 'no-deal' Brexit could snarl cross-Channel trade routes, disrupting supplies of medicines and fresh food while protests spread across Britain, according to a worst-case scenario reluctantly released by the government on Wednesday.",
    "The \"Operation Yellowhammer\" assumptions, prepared six weeks ago just days after Boris Johnson became prime minister, form the basis of government no-deal planning.",
    "The document said public and business readiness for a no-deal exit was likely be low, in part because of political confusion in the run-up to Brexit. Trucks could initially have to wait up to two and a half days to cross the English Channel.",
    "\"Certain types of fresh food supply will decrease,\" it said. \"There is a risk that panic buying will cause or exacerbate food supply disruption.... Protests and counter-protests will take place across the UK.\"",
    "Johnson says Britain will leave on time, with or without a deal. Opposition lawmakers who seized the parliamentary agenda last week have passed a law ordering him to seek a delay unless he agrees a deal with the EU to head off chaos.",
    "Parliament has since been suspended, with courts giving divided rulings about whether Johnson had the right to do so. Johnson says he wants an urgent general election to resolve the impasse. His opponents say they will let him call an election only once the threat of a no-deal exit is taken off the table.",
    "The government said the Operation Yellowhammer document published on Wednesday revealed a worst-case scenario only, and that it had to prepare for all contingencies. Michael Gove, the cabinet minister responsible for no-deal preparations, said the assumptions in the five-page document were being reviewed. ",
    "The opposition Labour Party said the documents confirmed the severe risks of a no-deal Brexit, and demanded that the suspended parliament be recalled \"to scrutinise these documents and take all steps necessary to stop no deal\".",
    "DISRUPTION",
    "According to the document, the flow of traffic across the English channel could be reduced by as much as 60% on the first day. The worst disruption could last for up to three months.",
    "Traffic queues could affect fuel deliveries, disrupting supplies in London and south-east England, and panic buying could cause shortages in other parts of the country, it said.",
    "Cross-border financial services would be affected as would  information-sharing between police and security services.",
    "In releasing the document, Gove was acceding to a request from lawmakers. He refused a separate request to make public the advice of government advisers about the suspension of parliament.",
    "A Scottish court ruled on Wednesday that the suspension was unlawful, prompting calls for lawmakers to return to work. A separate court in England has ruled that judges do not have the power to question Johnson's decision. The cases go to the Supreme Court for a final ruling next week.",
    "Leaving the EU with a deal would allow Britain to maintain its existing trading relationship during a transition period while it hammers out a new relationship with the bloc.",
    "Without such a deal, opponents say, the world's fifth largest economy would become subject to an array of trade restrictions with a suddenness that has no precedent.",
    "Supporters say there may be some disruption but it would not be too severe, and Britain would benefit in the longer term."
  ],
  "published_datetime": "2019-09-12 05:13:00"
}