{
  "url": "https://www.nasdaq.com/article/5-money-moves-every-college-grad-needs-to-make-asap-cm1206948",
  "title": "5 Money Moves Every College Grad Needs to Make ASAP - Nasdaq.com",
  "text": [
    "   Adult life brings new financial responsibilities, and you   need to be prepared for them.  Graduating from college brings significant financial and lifestyle changes, and it's easy to feel overwhelmed. While you're trying to adjust to your new life in the workforce, you must also start paying back your student loans  and planning for your future. It's a lot to tackle at once, and many young college graduates don't know where to begin. Everyone's financial goals and budgets will vary, but there are five key things that every college graduate -- no matter their field or salary -- should do to start their adult lives off on the right foot.   Image source: Getty ImagesmakeArticleAd();  1. Start an emergency fund An emergency fund  is meant to help you cover unexpected expenses, like a medical emergency, replacing a broken home appliance, a job loss, or filing an insurance claim. Without one of these funds, you may have to charge these expenses to a credit card, or risk falling behind on your payments. Once you've gotten into a debt cycle, it's difficult to get out again, so it is worth putting some money aside now to cushion yourself against unexpected payments. Your emergency fund should contain three to six months' worth of living expenses. If you have any extra cash left over after paying your basic living expenses each month, put it here first. Once you've built up your emergency fund to an acceptable level, you can begin saving for your other financial goals. Don't forget to replenish your emergency fund if you ever need to draw upon it. And as your expenses increase, increase your emergency fund as well. 2. Set up a student loan repayment plan Private student loans may require you to pay a set amount each month, but federal student loans offer several repayment plans  , some of which are income-driven, so that you can pay less when your income is lower, and more when your income is higher. Consult with your loan servicer if you're not sure which student loan repayment plan is right for you. If you have multiple student loans, think about consolidating them  into a single loan so that you only have one monthly payment instead of several. Those planning to pursue public service  , military, or teacher loan forgiveness  should make sure they understand the rules of these programs, including acceptable repayment plans, documentation requirements, and qualifying employment. Failing to follow these rules to the letter could disqualify you from the program, or force you to wait longer for the government to forgive your remaining loans. 3. Create a budget Your monthly budget should cover your basic living expenses, including housing, utilities, insurance, transportation, and groceries. You should also include any subscriptions you pay for, as well as your student loan payments. If you have any other loans -- like a car loan -- include those as well. Once you've recorded your living expenses and your income, you must decide what to do with the money that's left over. You should put some toward an emergency fund, some toward discretionary purchases like dining out, and some toward retirement or other future savings goals. As your income increases, reevaluate your budget, and always raise your savings amount before spending more on discretionary purchases to help keep yourself on track for your financial goals. 4. Get a credit card Many millennials have chosen to forego credit cards because they don't want to risk running up credit card debt. There are other ways you can build your credit history, but credit cards are one of the easiest. You may have already had a student credit card  in college. If so, consider upgrading to a better rewards credit card  once you've landed your first job. Those without a credit history may struggle to get a credit card on their own. If you have a parent or a friend with an established credit history, they could make you an authorized user on their card. Assuming they're a responsible payer, this will help both of your credit scores. Or you can choose a secured credit card  . The credit limit is usually only a few hundred dollars on these cards, and they often require you to pay a matching security deposit. But regular, on-time payments on this card can help improve your credit score over time. 5. Open a retirement account Your earlier retirement contributions matter much more than your later ones because the money has longer to sit in your account and grow. By starting early, you can reduce the amount you need to save per month in order to hit your target amount. Your employer may offer a 401(k), and this is a good place to begin, especially if your company matches some of your contributions. Or you could open an IRA on your own. Set up automated payments if you can so that you don't have to worry about remembering to transfer the money. Your employer should do this automatically if you're enrolled in the 401(k). It takes a while to adjust to the new financial demands of adult life, but if you take the five above steps soon after graduation, you'll find the rest of it easier to manage. Savings account rates are skyrocketing -- Earn 23x your bank Many people are missing out on guaranteed returns as their money languishes in a big bank savings account earning next to no interest. Our picks of the best online savings accounts  can earn you more than 25x the national average savings account rate. Click here  to uncover the best-in-class picks that landed a spot on our shortlist of the best savings accounts for 2019.  The Motley Fool owns and recommends MasterCard and Visa, and recommends American Express. We're firm believers in the Golden Rule. If we wouldn't recommend an offer to a close family member, we wouldn't recommend it on The Ascent either. Our number one goal is helping people find the best offers to improve their finances. That is why editorial opinions are ours alone and have not been previously reviewed, approved, or endorsed by included advertisers. Editorial content from The Ascent is separate from The Motley Fool editorial content and is created by a different analyst team.",
    "  Adult life brings new financial responsibilities, and you   need to be prepared for them. ",
    "Graduating from college brings significant financial and lifestyle changes, and it's easy to feel overwhelmed. While you're trying to adjust to your new life in the workforce, you must also start paying back your student loans  and planning for your future. It's a lot to tackle at once, and many young college graduates don't know where to begin. Everyone's financial goals and budgets will vary, but there are five key things that every college graduate -- no matter their field or salary -- should do to start their adult lives off on the right foot.",
    "  Image source: Getty ImagesmakeArticleAd(); ",
    "Image source: Getty Images",
    "An emergency fund  is meant to help you cover unexpected expenses, like a medical emergency, replacing a broken home appliance, a job loss, or filing an insurance claim. Without one of these funds, you may have to charge these expenses to a credit card, or risk falling behind on your payments. Once you've gotten into a debt cycle, it's difficult to get out again, so it is worth putting some money aside now to cushion yourself against unexpected payments.",
    "Your emergency fund should contain three to six months' worth of living expenses. If you have any extra cash left over after paying your basic living expenses each month, put it here first. Once you've built up your emergency fund to an acceptable level, you can begin saving for your other financial goals. Don't forget to replenish your emergency fund if you ever need to draw upon it. And as your expenses increase, increase your emergency fund as well.",
    "Private student loans may require you to pay a set amount each month, but federal student loans offer several repayment plans  , some of which are income-driven, so that you can pay less when your income is lower, and more when your income is higher. Consult with your loan servicer if you're not sure which student loan repayment plan is right for you. If you have multiple student loans, think about consolidating them  into a single loan so that you only have one monthly payment instead of several.",
    "Those planning to pursue public service  , military, or teacher loan forgiveness  should make sure they understand the rules of these programs, including acceptable repayment plans, documentation requirements, and qualifying employment. Failing to follow these rules to the letter could disqualify you from the program, or force you to wait longer for the government to forgive your remaining loans.",
    "Your monthly budget should cover your basic living expenses, including housing, utilities, insurance, transportation, and groceries. You should also include any subscriptions you pay for, as well as your student loan payments. If you have any other loans -- like a car loan -- include those as well.",
    "Once you've recorded your living expenses and your income, you must decide what to do with the money that's left over. You should put some toward an emergency fund, some toward discretionary purchases like dining out, and some toward retirement or other future savings goals. As your income increases, reevaluate your budget, and always raise your savings amount before spending more on discretionary purchases to help keep yourself on track for your financial goals.",
    "Many millennials have chosen to forego credit cards because they don't want to risk running up credit card debt. There are other ways you can build your credit history, but credit cards are one of the easiest. You may have already had a student credit card  in college. If so, consider upgrading to a better rewards credit card  once you've landed your first job.",
    "Those without a credit history may struggle to get a credit card on their own. If you have a parent or a friend with an established credit history, they could make you an authorized user on their card. Assuming they're a responsible payer, this will help both of your credit scores. Or you can choose a secured credit card  . The credit limit is usually only a few hundred dollars on these cards, and they often require you to pay a matching security deposit. But regular, on-time payments on this card can help improve your credit score over time.",
    "Your earlier retirement contributions matter much more than your later ones because the money has longer to sit in your account and grow. By starting early, you can reduce the amount you need to save per month in order to hit your target amount.",
    "Your employer may offer a 401(k), and this is a good place to begin, especially if your company matches some of your contributions. Or you could open an IRA on your own. Set up automated payments if you can so that you don't have to worry about remembering to transfer the money. Your employer should do this automatically if you're enrolled in the 401(k).",
    "It takes a while to adjust to the new financial demands of adult life, but if you take the five above steps soon after graduation, you'll find the rest of it easier to manage.",
    "Many people are missing out on guaranteed returns as their money languishes in a big bank savings account earning next to no interest. Our picks of the best online savings accounts  can earn you more than 25x the national average savings account rate. Click here  to uncover the best-in-class picks that landed a spot on our shortlist of the best savings accounts for 2019.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:00:00"
}