{
  "url": "https://www.nasdaq.com/article/7-dividend-etfs-to-own-for-the-next-30-years-cm1207551",
  "title": "7 Dividend ETFs to Own for the Next 30 Years - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Yes, seven exchange traded funds (ETFs) is a lot to own, so you don't need to own each and every fund that will be highlighted here. However, with 10-year Treasury yields currently residing around 1.50%, dividend ETFs have now have added allure.",
    "As seasoned investors know, dividends, particularly when reinvested over a long-term time frame, say 30 years, can play pivotal roles in boosting investor outcomes . In fact, over a span such as three decades, it is probable that those reinvested payouts will account for close to or as much of an investor's total returns as will appreciation in the underlying security.",
    "Other data points speak to the efficacy of dividend ETFs right here, right now. While many market observers are obsessing over the inverted yield curve , there's another yield scenario to monitor: the S&P 500 dividend yield moving above the yields on 10- and 30-year bonds. That usually bodes well for stocks.",
    "\"Even though the ominous implication from the current inverted 2-year/10-year yield curve scenario has generated concern among investors, history offers a bit of encouragement,\" said CFRA Research . \"Since WWII, whenever the S&P 500's month-end yield exceeded the yield of the 10-year note, the S&P 500 was higher 12 months later by an average 22% and gained in price in 74% of all 31 observations.\"",
    "With those considerations in mind, here are some of the best dividend ETFs for long-term investors to consider.",
    "Expense ratio: 0.28%",
    "The WisdomTree U.S. Quality Dividend Growth Fund (NASDAQ: DGRW ) is one dividend ETF that checks many, if not all of the boxes investors look for with dividend ETFs that are slated to be core, long-term holdings .",
    "While DGRW is a dividend growth strategy, it does not focus on superficial metrics, such as dividend increase streaks. If it did that, it likely would not have a 22% weight to the technology sector, one of the largest weights to that group among any domestic dividend ETF. Microsoft (NASDAQ: MSFT ) and Apple (NASDAQ: AAPL ) combine for 10.3% of DGRW's weight.",
    "I'll try to boil this dividend ETF's methodology down into simple terms: the foundation underlying DGRW looks for traits that could be signals of a company's ability to continue paying AND raising dividends. So a company's past dividend history is less important here than its potential trajectory going forward.",
    "\"The current balanced make-up between strong profitability metrics and discounted relative valuations for WTDGI, largely achieved by avoiding the more expensive non-dividend payers, gives us confidence in the merits of this approach for a core U.S. equity allocation going forward,\" said WisdomTree .",
    "Expense ratio: 0.35%",
    "The ProShares S&P 500 Dividend Aristocrats ETF  (CBOE: NOBL ) is one of the dividend ETFs investors should consider if they want overt dedication to dividend increase streaks. NOBL follow the S&P 500 Dividend Aristocrats Index, which only includes stocks that have boosted payouts for 25 consecutive years.",
    "That's exclusive territory because even with some new additions to the fold earlier this year, NOBL holds just 57 stocks with a weighted average market value of $78.59 billion. The emphasis on increase streaks is nice, but what's really alluring about NOBL is its ability to be less volatile and perform less poorly when broader markets decline, something the dividend ETF has proven adept at in its almost six years on the market .",
    "Plus, NOBL isn't a high-yield, making it appealing for long-term investors looking to avoid financially strained companies.",
    "\"The richest dividend yields can point to firms with weak or declining profits, which could threaten the sustainability of the dividend and, more importantly, the price of the stock,\" according to Morningstar . \"Aggressively chasing yield can also increase exposure to value investment style risk, as the highest-yielding stocks tend to be deep-value names. When value stocks are out of favor, that tilt can hurt performance.\"",
    "Expense ratio: 0.25%",
    "The international counterpart to the wildly popular Vanguard Dividend Appreciation ETF (NYSEARCA: VIG ) , the VanguardInternational Dividend Appreciation ETF (NASDAQ: VIGI ) is a fine idea for investors looking for an international dividend ETF. And that is something income investors should do because there are some solid ex-US dividend growth markets and there are plenty of markets outside the U.S. with higher yields than are found on the S&P 500.",
    "\"This low-cost fund prioritizes dividend growth over yield, which emphasizes highly profitable firms that should hold up better than most during market downturns and offer attractive long-term returns,\" said Morningstar in a recent note .",
    "VIGI has a dividend increase requirement of seven years, which can be somewhat limiting in the international arena and the fund mixes developed and emerging markets exposure, though it tilts heavily to the former.",
    "Expense ratio: 0.38%",
    "Small caps are often an underappreciated part of the dividend story, but the WisdomTree U.S. SmallCap Quality Dividend Growth Fund (NASDAQ: DGRS ) can help investors gain a refreshed view of garnering income from smaller companies.",
    "DGRS is the small-cap counterpart to the aforementioned DGRW and uses a similar methodology to its large-cap counterpart. That emphasis on quality is particularly important at a time when many small-cap companies are taking on increasing debt, prompting concerns that small caps could lead another market decline.",
    "This dividend ETF would not be immune from such a scenario, but it would likely be less volatile and perform less poorly because while many small-cap companies aren't profitable, many DGRS components are.",
    "\"The growth factor ranking is based on long-term earnings growth expectations, while the quality factor ranking is based on three-year historical averages for return on equity and return on assets,\" according to WisdomTree .",
    "Expense ratio: 0.38%",
    "For investors seeking a mid-cap dividend ETF, the original is a winning bet over the long-term and the WisdomTree U.S. MidCap Dividend Fund (NYSEARCA: DON ) is the original in this category. DON has a nifty distribution yield of 3.28%, far superior to what investors will find on traditional large- and small-cap benchmarks.",
    "DON's underlying index is \"dividend weighted annually to reflect the proportionate share of the aggregate cash dividends each component company is projected to pay in the coming year, based on the most recently declared dividend per share,\" according to WisdomTree .",
    "DON does an admirable job of mixing cyclical and defensive sectors as the consumer discretionary, real estate, industrial and financial services sectors combine for combine for over 58% of DON's weight. Like the other WisdomTree dividend ETFs highlighted here (DGRW, DGRS), DON pays a monthly dividend for an even steadier income stream.",
    "Expense ratio: 0.35%",
    "An oft-overlooked name in the dividend ETF conversation, the VictoryShares Dividend Accelerator ETF  (NASDAQ: VSDA ) takes a unique approach to generating equity income. VSDA is a dividend growth fund, not a high-yield play.",
    "VSDA \"offers exposure to large-cap U.S. stocks, that feature not only a history of increasing dividends, but which also possess the highest probability of future dividend growth. It seeks to provide exposure to dividend growth, rather than yielding, offering a potential diversification benefit to high dividend yielding alternatives, particularly in a rising rate environment,\" according to Victory Capital Management .",
    "Up 23.15% year-to-date, good for one of the best performances among dividend ETFs, VSDA allocates 25.53% of its weight to industrial stocks while technology and the two consumer sectors combine for nearly half the funds weight. VSDA's performance and methodology could and probably should lead to this ETF shedding its anonymous existence in the future.",
    "Expense ratio: 0.37%",
    "The FlexShares Quality Dividend ETF  (NYSEARCA: QDF ) emphasizes quality, which is pivotal in identifying securities with the potential for long-term dividend growth. QDF's methodology features a dividend quality scoring system aimed at identifying companies with strong balance sheets. That methodology also mixes yield and dividend growth scoring, giving QDF a yield of 2.70%, which is decent by today's standards.",
    "\"This fund won't offer the highest yield in the category, but its yield has consistently topped that of the Russell 1000 Value Index. From its inception in December 2012 through March 2019, this fund's yield averaged 3.6%, about 40% higher than the yield of the Russell 1000 Value Index,\" according to Morningstar .",
    "Additionally, QDF employs a management efficiency scoring system in an effort to highlight management teams that are committed to maintaining sound balance sheets and doling shareholder rewards.",
    "This dividend ETF doesn't grab a lot of headlines, but it has $1.6 billion in assets under management and its foundation is highly suitable for long-term investors. QDF is nearly seven years old and has regularly topped large-cap domestic value funds over that time.",
    "Todd Shriber owns shares of DGRW.",
    "The post 7 Dividend ETFs to Own for the Next 30 Years appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 12:05:31"
}