{
  "url": "https://www.nasdaq.com/article/technology-sector-update-for-09052019-cldrdsgxdsgtoqtt-cm1208188",
  "title": "Technology Sector Update for 09/05/2019: CLDR,DSGX,DSG.TO,QTT - Nasdaq.com",
  "text": [
    "Top Tech Stocks",
    "MSFT +1.31%",
    "AAPL +1.34%",
    "IBM +3.37%",
    "CSCO +2.37%",
    "GOOG +2.36%",
    "Technology stocks were roaring higher again on Thursday, with the shares of tech stocks in the S&P 500 advancing almost 1.8% while the Philadelphia Semiconductor Index was rising more than 2.9%.",
    "Among technology stocks moving on news:",
    "(+) Cloudera ( CLDR  ) was climbing more than 13% after the data analytics and management company late Wednesday reported a smaller-than-expected Q2 net loss and above-consensus quarterly revenue in addition to announcing its purchase of selected assets from Arcadia Data in a bid to accelerate time-to-insight for Cloudera customers. Financial details of the proposed transaction were not disclosed.",
    "In other sector news:",
    "(+) Descartes Systems Group ( DSGX  ) rose 14% on Thursday after the Canadian logistics software firm reported Q2 net income of $0.10 per share, slipping from an $0.11 per share profit during the same quarter last year but beating the Capital IQ consensus by $0.02 per share. Revenue rose 20% over year-ago levels to $80.5 million, also exceeding the $80.3 million Street view.",
    "(-) Qutoutiao ( QTT  ) dropped 8.2% after the Chinese mobile content aggregator reported a Q2 non-GAAP net loss of RMB1.95 per American depositary share, expanding on an RMB1.61 per ADS adjusted loss during the same quarter last year and missing the Capital IQ consensus expecting an RMB1.69 per ADS non-GAAP loss.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-05 01:23:03"
}