{
  "url": "https://www.nasdaq.com/article/a-foolish-take-will-augmented-and-virtual-reality-shopping-take-off-cm1206882",
  "title": "A Foolish Take: Will Augmented and Virtual Reality Shopping Take Off? - Nasdaq.com",
  "text": [
    "Shopping has changed considerably since the late 1990s, when online marketplaces first started luring shoppers away from brick-and-mortar stores. Mobile apps succeeded traditional websites, and retailers that didn't roll with the punches were left behind.",
    "The online shopping market is still evolving, and many retailers are already experimenting with next-generation technology platforms like smart speakers, subscription services, and even augmented reality (AR) and virtual reality (VR) shopping apps.",
    "AR/VR shopping sounds futuristic, but a recent GfK survey found that 68% of respondents recognized the technology and 5% regularly shop through AR/VR apps. However, that adoption rate remains lower than smart speakers or subscription services.",
    "Data source: GfK. Chart by author.",
    "Several retailers offer AR and VR apps for smartphones. Amazon (NASDAQ: AMZN) and IKEA have apps that allow users to project furniture and home decor into rooms, LVMH 's Sephora lets users test digital makeup, and Gap 's customers can try on clothes in a virtual dressing room.",
    "Amazon and Walmart  are even developing VR shopping experiences, but it's unclear when those apps will arrive. This market remains a niche one, but better smartphone cameras, cheaper VR headsets, and lighter AR glasses could all drive its long-term growth.",
    "Offer from The Motley Fool: The 10 best stocks to buy now Motley Fool co-founders Tom and David Gardner have spent more than a decade beating the market. In fact, the newsletter they run, Motley Fool Stock Advisor , has quadrupled the S&P 500!*",
    "Tom and David just revealed their ten top stock picks for investors to buy right now.",
    "Click here to get access to the full list!",
    "* Stock Advisor returns as of June 1, 2019.",
    "John Mackey, CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Leo Sun owns shares of Amazon and LVMUY. The Motley Fool owns shares of and recommends Amazon. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:00:00"
}