{
  "url": "https://www.nasdaq.com/article/ex-dividend-reminder-israel-chemicals-south-jersey-industries-and-ppl-cm1207794",
  "title": "Ex-Dividend Reminder: Israel Chemicals, South Jersey Industries and PPL - Nasdaq.com",
  "text": [
    "Looking at the universe of stocks we cover at Dividend Channel  , on 9/9/19, Israel Chemicals Ltd (Symbol: ICL), South Jersey Industries, Inc. (Symbol: SJI), and PPL Corp (Symbol: PPL) will all trade ex-dividend for their respective upcoming dividends. Israel Chemicals Ltd will pay its quarterly dividend of $0.057 on 9/24/19, South Jersey Industries, Inc. will pay its quarterly dividend of $0.2875 on 10/2/19, and PPL Corp will pay its quarterly dividend of $0.4125 on 10/1/19. As a percentage of ICL's recent stock price of $4.51, this dividend works out to approximately 1.26%, so look for shares of Israel Chemicals Ltd to trade 1.26% lower - all else being equal - when ICL shares open for trading on 9/9/19. Similarly, investors should look for SJI to open 0.88% lower in price and for PPL to open 1.39% lower, all else being equal.    Below are dividend history charts for ICL, SJI, and PPL, showing historical dividends prior to the most recent ones declared.   Israel Chemicals Ltd (Symbol: ICL)  :   makeArticleAd();    South Jersey Industries, Inc. (Symbol: SJI)  :        PPL Corp (Symbol: PPL)  :         In general, dividends are not always predictable, following the ups and downs of company profits over time. Therefore, a good first due diligence step in forming an expectation of annual yield going forward, is looking at the history above, for a sense of stability over time. This can help in judging whether the most recen t dividends  from these companies are likely to continue. If they do continue, the current estimated yields on annualized basis would be 5.06% for Israel Chemicals Ltd, 3.51% for South Jersey Industries, Inc., and 5.56% for PPL Corp.    In Thursday trading, Israel Chemicals Ltd shares are currently trading flat, South Jersey Industries, Inc. shares are off about 0.2%, and PPL Corp shares are trading flat on the day.   Click here to learn which 25 S.A.F.E. dividend   stocks should be on your radar screen »  ",
    "  Click here to learn which 25 S.A.F.E. dividend   stocks should be on your radar screen » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:02:58"
}