{
  "url": "https://www.nasdaq.com/article/nmrk-vs-invh-which-stock-should-value-investors-buy-now-cm1210429",
  "title": "NMRK vs. INVH: Which Stock Should Value Investors Buy Now? - Nasdaq.com",
  "text": [
    " Investors with an interest in Real Estate - Operations stocks have likely encountered both Newmark Group (NMRK) and Invitation Home (INVH). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look. The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The Zacks Rank is a proven strategy that targets companies with positive earnings estimate revision trends, while our Style Scores work to grade companies based on specific traits. Both Newmark Group and Invitation Home have a Zacks Rank of # 2 (Buy) right now. This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that these stocks have improving earnings outlooks. However, value investors will care about much more than just this. Value investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels. Our Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use. NMRK currently has a forward P/E ratio of 5.86, while INVH has a forward P/E of 22.10. We also note that NMRK has a PEG ratio of 0.68. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. INVH currently has a PEG ratio of 2.96. Another notable valuation metric for NMRK is its P/B ratio of 1.68. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, INVH has a P/B of 1.87. These are just a few of the metrics contributing to NMRK's Value grade of A and INVH's Value grade of D. Both NMRK and INVH are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that NMRK is the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Newmark Group, Inc. (NMRK): Free Stock Analysis Report   Invitation Home Inc. (INVH): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors with an interest in Real Estate - Operations stocks have likely encountered both Newmark Group (NMRK) and Invitation Home (INVH). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look.",
    "The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The Zacks Rank is a proven strategy that targets companies with positive earnings estimate revision trends, while our Style Scores work to grade companies based on specific traits.",
    "Both Newmark Group and Invitation Home have a Zacks Rank of # 2 (Buy) right now. This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that these stocks have improving earnings outlooks. However, value investors will care about much more than just this.",
    "Value investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels.",
    "Our Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use.",
    "NMRK currently has a forward P/E ratio of 5.86, while INVH has a forward P/E of 22.10. We also note that NMRK has a PEG ratio of 0.68. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. INVH currently has a PEG ratio of 2.96.",
    "Another notable valuation metric for NMRK is its P/B ratio of 1.68. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, INVH has a P/B of 1.87.",
    "These are just a few of the metrics contributing to NMRK's Value grade of A and INVH's Value grade of D.",
    "Both NMRK and INVH are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that NMRK is the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:40:19"
}