{
  "url": "https://www.nasdaq.com/article/notable-tuesday-option-activity-ups-mlm-eri-cm1206909",
  "title": "Notable Tuesday Option Activity: UPS, MLM, ERI - Nasdaq.com",
  "text": [
    "Among the underlying components of the Russell 3000 index, we saw noteworthy  options trading  volume today in United Parcel Service Inc (Symbol: UPS), where a total of 13,380 contracts have traded so far, representing approximately 1.3 million underlying shares. That amounts to about 44.7% of UPS's average daily trading volume over the past month of 3.0 million shares. Particularly high volume was seen for the $130 strike call option expiring January 17, 2020  , with 2,128 contracts trading so far today, representing approximately 212,800 underlying shares of UPS. Below is a chart showing UPS's trailing twelve month trading history, with the $130 strike highlighted in orange:       makeArticleAd();    Martin Marietta Materials, Inc. (Symbol: MLM) options are showing a volume of 2,258 contracts thus far today. That number of contracts represents approximately 225,800 underlying shares, working out to a sizeable 43.5% of MLM's average daily trading volume over the past month, of 519,605 shares. Especially high volume was seen for the $220 strike put option expiring September 20, 2019  , with 575 contracts trading so far today, representing approximately 57,500 underlying shares of MLM. Below is a chart showing MLM's trailing twelve month trading history, with the $220 strike highlighted in orange:       And Eldorado Resorts Inc (Symbol: ERI) saw options trading volume of 6,084 contracts, representing approximately 608,400 underlying shares or approximately 43.2% of ERI's average daily trading volume over the past month, of 1.4 million shares. Especially high volume was seen for the $35 strike put option expiring January 17, 2020  , with 2,536 contracts trading so far today, representing approximately 253,600 underlying shares of ERI. Below is a chart showing ERI's trailing twelve month trading history, with the $35 strike highlighted in orange:         For the various different available expirations for UPS options  , MLM options  , or ERI options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 15:28:22"
}