{
  "url": "https://www.nasdaq.com/article/why-oil-stocks-got-crushed-in-august-cm1207253",
  "title": "Why Oil Stocks Got Crushed in August - Nasdaq.com",
  "text": [
    "  What happened  Shares of most   energy companies    tumbled in August, including those of leading U.S. oil and gas   producers   ConocoPhillips    (NYSE: COP) ,   Continental Resources    (NYSE: CLR) , and   EOG Resources    (NYSE: EOG) . All three lost more than 10% of their value last   month, according to data provided by      S&P Global Market Intelligence    . Fueling their sell-off was a combination of lower crude    oil   prices    and lackluster second-quarter earnings reports.  So what  Oil prices slumped about 6% last month, which pushed the U.S.   oil benchmark down to around $55 a barrel. Several issues weighed   on the oil market, including weak global economic data and rising   oil inventory levels. That sparked concerns that oil-demand   growth would slow, which could cause another oversupply.   Image source: Getty Images.makeArticleAd();  The decline in oil prices hit Continental Resources' stock the   hardest, as it cratered 21% on the month. That's because the   company needs $60 oil to fuel its five-year plan, which would see   it produce $5 billion in free cash flow by 2023. The company   intends on using that money to pay off more debt and repurchase   additional shares. Meanwhile, another factor weighing on Continental Resources'   stock last month was its   second-quarter report    as its earnings missed analysts' expectations by $0.02 per share.   The company also cut its drilling program in Oklahoma's   STACK shale play    from 19 rigs to 12. While that's primarily due to efficiency   gains, investors saw the activity decline as a sign of   weakness. EOG Resources' shares, meanwhile, lost about 13.5% of their   value last month. While oil prices were the main issue weighing   on EOG's stock, the company didn't help matters by reporting   slightly lower-than-expected   second-quarter earnings    . Cash flow, however, came in at a healthy $2.1 billion, which   was enough to cover the company's capital expenses and dividend   with about $350 million left over. EOG Resources is one of the few U.S. oil producers that can   generate free cash at $50 oil. With crude sliding back down   toward that level, however, investors worry that its free cash   flow machine could run out of fuel in the coming quarters. Finally, ConocoPhillips shed about 12% of its value last   month, costing its investors $7.6 billion of market value. Lower   oil prices were the primary issue weighing on shares of   ConocoPhillips in August since i   t report    ed its   second-quarter earnings    in late July. However, like EOG and Continental, it posted   lower-than-expected earnings in the quarter due to the volatility   in the oil market this year. ConocoPhillips has been trying to take advantage of this   situation by ramping up its share-buyback program, which it did   during the second quarter by repurchasing $1.2 billion in stock.   That was $500 million more than planned as it accelerated its   repurchases to take advantage of its slumping share price. Given   that its stock has continued to decline, ConocoPhillips could use   some of its $6.9 billion cash position to retire even more shares   this year.  Now what  August was another rough month for the oil market. Crude   prices gave back more of this year's gains because investors are   worried about a potential slowdown in demand growth. Those lower   prices will impact oil producer cash flows, which is weighing on   their valuations. However, on a more positive note, producers are continuing to   drive down costs so that they can produce more cash at lower   prices. That's giving them the funds to buy back their stock,   enabling them to take advantage of periods of weakness. This   strategy should help them create more value for investors in the   long run.   10 stocks we like better than ConocoPhillips       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and ConocoPhillips wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Matthew DiLallo      owns shares of ConocoPhillips. The Motley Fool has no position     in any of the stocks mentioned. The Motley Fool has a     disclosure policy      .  ",
    "Shares of most   energy companies    tumbled in August, including those of leading U.S. oil and gas   producers   ConocoPhillips    (NYSE: COP) ,   Continental Resources    (NYSE: CLR) , and   EOG Resources    (NYSE: EOG) . All three lost more than 10% of their value last   month, according to data provided by      S&P Global Market Intelligence    . Fueling their sell-off was a combination of lower crude    oil   prices    and lackluster second-quarter earnings reports.",
    "Oil prices slumped about 6% last month, which pushed the U.S.   oil benchmark down to around $55 a barrel. Several issues weighed   on the oil market, including weak global economic data and rising   oil inventory levels. That sparked concerns that oil-demand   growth would slow, which could cause another oversupply.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "The decline in oil prices hit Continental Resources' stock the   hardest, as it cratered 21% on the month. That's because the   company needs $60 oil to fuel its five-year plan, which would see   it produce $5 billion in free cash flow by 2023. The company   intends on using that money to pay off more debt and repurchase   additional shares.",
    "Meanwhile, another factor weighing on Continental Resources'   stock last month was its   second-quarter report    as its earnings missed analysts' expectations by $0.02 per share.   The company also cut its drilling program in Oklahoma's   STACK shale play    from 19 rigs to 12. While that's primarily due to efficiency   gains, investors saw the activity decline as a sign of   weakness.",
    "EOG Resources' shares, meanwhile, lost about 13.5% of their   value last month. While oil prices were the main issue weighing   on EOG's stock, the company didn't help matters by reporting   slightly lower-than-expected   second-quarter earnings    . Cash flow, however, came in at a healthy $2.1 billion, which   was enough to cover the company's capital expenses and dividend   with about $350 million left over.",
    "EOG Resources is one of the few U.S. oil producers that can   generate free cash at $50 oil. With crude sliding back down   toward that level, however, investors worry that its free cash   flow machine could run out of fuel in the coming quarters.",
    "Finally, ConocoPhillips shed about 12% of its value last   month, costing its investors $7.6 billion of market value. Lower   oil prices were the primary issue weighing on shares of   ConocoPhillips in August since i   t report    ed its   second-quarter earnings    in late July. However, like EOG and Continental, it posted   lower-than-expected earnings in the quarter due to the volatility   in the oil market this year.",
    "ConocoPhillips has been trying to take advantage of this   situation by ramping up its share-buyback program, which it did   during the second quarter by repurchasing $1.2 billion in stock.   That was $500 million more than planned as it accelerated its   repurchases to take advantage of its slumping share price. Given   that its stock has continued to decline, ConocoPhillips could use   some of its $6.9 billion cash position to retire even more shares   this year.",
    "August was another rough month for the oil market. Crude   prices gave back more of this year's gains because investors are   worried about a potential slowdown in demand growth. Those lower   prices will impact oil producer cash flows, which is weighing on   their valuations.",
    "However, on a more positive note, producers are continuing to   drive down costs so that they can produce more cash at lower   prices. That's giving them the funds to buy back their stock,   enabling them to take advantage of periods of weakness. This   strategy should help them create more value for investors in the   long run.",
    "  10 stocks we like better than ConocoPhillips       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and ConocoPhillips wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than ConocoPhillips       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and ConocoPhillips wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Matthew DiLallo      owns shares of ConocoPhillips. The Motley Fool has no position     in any of the stocks mentioned. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:13:00"
}