{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-solaredge-canadian-solar-and-enphase-energy-cm1207953",
  "title": "The Zacks Analyst Blog Highlights: SolarEdge, Canadian Solar and Enphase Energy - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 5, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: SolarEdge Technologies Inc. SEDG  , Canadian Solar Inc. CSIQ  and Enphase Energy Inc. ENPH  .  Here are highlights from Wednesday's Analyst   Blog:    U.S. Solar Costs Keep Dropping: 3 Stocks to Buy   Per a recen t report  on 2017 data released by the U.S. Energy Information Administration, annual capacity-weighted average construction costs for solar photovoltaic (PV) systems continued to decline for newly constructed utility-scale electric generators in the United States. Notably, average costs for solar PV generators declined 37% from 2013 to 2017. The contraction in input costs of the expanding U.S. solar  market should pique investors' interest. As it is, the solar market has witnessed splendid growth over the past year, when compared to the broader market. Its gain of 44.7% compares favorably with the S&P 500's fall of 0.2%.  What Led to the Drop in Costs?  Declining prices of crystalline silicon axis-based tracking panels has been the primary factor that led to the drop in cost of solar photovoltaics. Notably, crystalline silicon axis-based tracking panels witnessed their lowest average construction cost of $2,135 per kilowatt (kW) in 2017, with these panels accounting for more than half of the solar photovoltaic capacity added in 2017. It is imperative to mention here that over time, rapid advancement of technology has improved solar cell efficiency  in converting sunlight to usable solar energy. The enhanced conversion capacity has been a dominant factor behind the fall in construction cost of solar panels. To this end, the Massachusetts Institute of Technology (MIT) published a report last November which identified public and private research and development (R&D) and improvement in cell efficiency as the major factors resulting in a 99% reduction in solar module costs since 1980. Also, the setting up of much larger factories for manufacturing solar cells and modules over the last few years has boosted economies of scale in the solar market. Considering this, significant growth in manufacturing economies of scale  between 2001 and 2012 has been identified as another key reason behind the drop in costs of solar modules.  Will Costs Keep Declining?  Keeping the aforementioned factors in mind, cost of solar modules is likely to keep declining in the near future, leading to a further drop in the construction cost for solar PV generation. With consistent technology development, cell efficiency will continue to improve. Meanwhile, as corporate investments are on the rise in the U.S. solar space, the setting up of larger panel manufacturing factories is inevitable, thereby leading to expanded economies of scale. In line with this, Wood Mackenzie forecasts that spot prices of solar modules will fall from 30 cents per watt-DC to 18 cents per watt-DC over the next five years, suggesting a solid 40% decline. Such impressive projections add to the lure of solar stocks at the moment.  Our Picks  With the help of the Zacks Stock Screener  , we have identified three solar stocks that possess a favorable Zacks Rank and solid earnings surprise history. They are thus prudent investment choices.  SolarEdge Technologies Inc.  , a solar inverter solutions provider, has exceeded the Zacks Consensus Estimate for earnings in the past four quarters, with an average beat of 1.23%.  It currently sports a Zacks Rank #1 (Strong Buy). The company's shares gained a solid 61.8% in past one year. You can see  the complete list of today's Zacks #1 Rank stocks   here   .  Canadian Solar Inc.  , a solar module producer, has beaten the Zacks Consensus Estimate for earnings in the past four quarters, the average beat being 115.66%. It currently sports a Zacks Rank #1. The company's shares have gained a solid 59.6% in a year's time.  Enphase Energy Inc.  , a producer of solar inverters, has surpassed the Zacks Consensus Estimate for earnings in the past four quarters, the average beat being 16.28%. It currently carries a Zacks Rank #2 (Buy). The company's shares have gained a massive 466.4% in the past year.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>   Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Enphase Energy, Inc. (ENPH): Free Stock Analysis Report   Canadian Solar Inc. (CSIQ): Free Stock Analysis Report   SolarEdge Technologies, Inc. (SEDG): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 5, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: SolarEdge Technologies Inc. SEDG  , Canadian Solar Inc. CSIQ  and Enphase Energy Inc. ENPH  .",
    " Here are highlights from Wednesday's Analyst   Blog: ",
    "  U.S. Solar Costs Keep Dropping: 3 Stocks to Buy  ",
    "Per a recen t report  on 2017 data released by the U.S. Energy Information Administration, annual capacity-weighted average construction costs for solar photovoltaic (PV) systems continued to decline for newly constructed utility-scale electric generators in the United States. Notably, average costs for solar PV generators declined 37% from 2013 to 2017.",
    "The contraction in input costs of the expanding U.S. solar  market should pique investors' interest. As it is, the solar market has witnessed splendid growth over the past year, when compared to the broader market. Its gain of 44.7% compares favorably with the S&P 500's fall of 0.2%.",
    " What Led to the Drop in Costs? ",
    "Declining prices of crystalline silicon axis-based tracking panels has been the primary factor that led to the drop in cost of solar photovoltaics. Notably, crystalline silicon axis-based tracking panels witnessed their lowest average construction cost of $2,135 per kilowatt (kW) in 2017, with these panels accounting for more than half of the solar photovoltaic capacity added in 2017.",
    "It is imperative to mention here that over time, rapid advancement of technology has improved solar cell efficiency  in converting sunlight to usable solar energy. The enhanced conversion capacity has been a dominant factor behind the fall in construction cost of solar panels.",
    "To this end, the Massachusetts Institute of Technology (MIT) published a report last November which identified public and private research and development (R&D) and improvement in cell efficiency as the major factors resulting in a 99% reduction in solar module costs since 1980.",
    "Also, the setting up of much larger factories for manufacturing solar cells and modules over the last few years has boosted economies of scale in the solar market. Considering this, significant growth in manufacturing economies of scale  between 2001 and 2012 has been identified as another key reason behind the drop in costs of solar modules.",
    " Will Costs Keep Declining? ",
    "Keeping the aforementioned factors in mind, cost of solar modules is likely to keep declining in the near future, leading to a further drop in the construction cost for solar PV generation. With consistent technology development, cell efficiency will continue to improve. Meanwhile, as corporate investments are on the rise in the U.S. solar space, the setting up of larger panel manufacturing factories is inevitable, thereby leading to expanded economies of scale.",
    "In line with this, Wood Mackenzie forecasts that spot prices of solar modules will fall from 30 cents per watt-DC to 18 cents per watt-DC over the next five years, suggesting a solid 40% decline. Such impressive projections add to the lure of solar stocks at the moment.",
    " Our Picks ",
    "With the help of the Zacks Stock Screener  , we have identified three solar stocks that possess a favorable Zacks Rank and solid earnings surprise history. They are thus prudent investment choices.",
    " SolarEdge Technologies Inc.  , a solar inverter solutions provider, has exceeded the Zacks Consensus Estimate for earnings in the past four quarters, with an average beat of 1.23%.  It currently sports a Zacks Rank #1 (Strong Buy). The company's shares gained a solid 61.8% in past one year. You can see  the complete list of today's Zacks #1 Rank stocks   here   .",
    " Canadian Solar Inc.  , a solar module producer, has beaten the Zacks Consensus Estimate for earnings in the past four quarters, the average beat being 115.66%. It currently sports a Zacks Rank #1. The company's shares have gained a solid 59.6% in a year's time.",
    " Enphase Energy Inc.  , a producer of solar inverters, has surpassed the Zacks Consensus Estimate for earnings in the past four quarters, the average beat being 16.28%. It currently carries a Zacks Rank #2 (Buy). The company's shares have gained a massive 466.4% in the past year.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:25:00"
}