{
  "url": "https://www.nasdaq.com/article/eu-sets-up-tool-for-easier-conviction-of-jihadist-fighters-as-hundreds-may-return-20190905-00786",
  "title": "EU sets up tool for easier conviction of jihadist fighters as hundreds may return - Nasdaq.com",
  "text": [
    "By Francesco Guarascio",
    "BRUSSELS, Sept 5 (Reuters) - The European Union has set up a common counter-terrorism register, hoping to facilitate prosecutions and convictions of suspected militants and people returning home from fighting with Islamic State in Iraq and Syria, EU officials said on Thursday.",
    "The move is partly aimed at addressing concerns about the fate of hundreds of EU citizens who fought for Islamic State and are now detained in Iraq and Syria. Many of them could return to Europe and not face trial because of a lack of evidence against them, a factor that has contributed to unease in several EU countries over returning fighters.",
    "This is expected to help convict war criminals and other militants, who might otherwise face trials for a lesser crime or no trial at all because national investigations have failed to gather enough evidence against them.",
    "Because of parallel investigations in different EU states, militants could face lighter punishments if probes are not coordinated as \"nobody can be prosecuted for the same crime twice,\" noted Ladislav Hamran, who chairs Eurojust, the EU agency that will manage the database and is in charge of coordinating judicial investigations among EU states.",
    "The new tool could also help prevent new attacks in Europe, as prosecutors will have access to more information on suspects, Hamran told a news conference.",
    "The continent was hit by several attacks in recent years, including two major ones in Paris in November 2015 and in Brussels a few months later which killed dozens of people.",
    "The register will gather information on jihadists, political extremists and all sorts of radical militants. But its immediate use is likely to concern returning foreign fighters.",
    "The EU security commissioner Julian King told Reuters that at least 1,300 EU citizens, of which more than half are children, are held in Syria and Iraq.",
    "National authorities have for years been reluctant to share information about prosecutions, although cross-border cooperation has increased after the Paris attacks, Eurojust data shows.",
    "The EU anti-terrorist chief, Gilles de Kerchove, said the bloc was also trying to facilitate trials of suspects directly in Iraq.",
    "The new register is open only to EU states. Britain is due to leave the bloc on Oct. 31 and King said that if it left without a withdrawal agreement, it would not be able to access information in that database.",
    "Hamran also urged the setting up of secured, encrypted channels to transfer electronic evidence to mitigate risks from cyberattacks."
  ],
  "published_datetime": "2019-09-05 10:51:00"
}