{
  "url": "https://www.nasdaq.com/article/preciousgold-rises-on-growth-risks-concerns-as-spotlight-turns-to-ecb-20190912-00175",
  "title": "PRECIOUS-Gold rises on growth risks concerns as spotlight turns to ECB - Nasdaq.com",
  "text": [
    "    * ECB announcement expected at 1145 GMT",
    "* Investors also await U.S. Aug CPI at 1230 GMT",
    "* Palladium hits $1,600/oz, up for 4th session (New throughout, adds comments, updates prices)",
    "Sept 12 (Reuters) - Gold rose on Thursday, supported bylingering concerns for global growth, although an uptick infinancial markets on hopes of a thaw in U.S.-China tradetensions kept its gains in check.",
    "Spot gold XAU= was up 0.5% at $1,504.16 per ounce as of0946 GMT. U.S. gold futures GCcv1 rose 0.6% to $1,512.",
    "\"We have the ECB (European Central Bank) meeting coming uplater in the day and there are growing concerns they may not beable to deliver what the market is looking for in terms ofeconomic boost; in that case it will provide a bid to gold,\"Saxo Bank commodity strategist Ole Hansen said.",
    "\"The underlying demand continues to remain strong for gold,there is a sense in the market that traders don't want to missout on any renewed rally.\"",
    "Investors are looking to the ECB meeting to see how farpolicymakers will go to support a flagging economy, given therisks posed by Britain's planned exit from the European Union.",
    "The ECB is set to announce its rate decision at 1145 GMT,followed by the central bank's President Mario Draghi's newsconference at 1230 GMT.",
    "Markets are also awaiting consumer price index (CPI) datafrom the United States for August, which is expected toaccelerate by merely 0.1%, compared with 0.3% in July, accordingto a Reuters poll, amid hopes of an interest rate cut from theU.S. Federal Reserve at its meeting next week.",
    "Meanwhile, the United States on Wednesday agreed to delayincreasing tariffs on $250 billion worth of Chinese imports toOct. 15 from Oct. 1 \"as a gesture of good will\". urn:newsml:reuters.com:*:nW1N24C02J",
    "Positive signs on the trade front lifted risk sentiment,with world stocks advancing to their highest in six weeks. MKTS/GLOB",
    "\"The risk-on tone on the back of positive trade news hasdone little to dent interest in gold,\" MKS PAMP said in a note.",
    "\"However, the metal still trades sub $1,500 as ETF out-flowslook to have dried up for the time being following recentdeclines to holdings.\"",
    "Holdings of the SPDR Gold TrustGLD , the world's largestgold-backed exchange-traded fund (ETF), have fallen nearly 2% sofar this month. GOL/ETF",
    "Elsewhere, silver XAG= gained 0.8% to $18.23 per ounce,and platinum XPT= jumped 1% to $953.80. ",
    "Palladium XPD= climbed 1.7% to $1,598.31 after hitting atwo month high of $1,600.16 earlier in the session.  (Reporting by Brijesh Patel in Bengaluru;Editing by Alexander Smith ) ((Brijesh.Patel1@thomsonreuters.com; Within U.S. +1 651 8485832, Outside U.S. +91 8067493865; Reuters Messaging:Brijesh.Patel1.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-12 06:06:00"
}