{
  "url": "https://www.nasdaq.com/article/ctg-or-epam-which-is-the-better-value-stock-right-now-cm1210427",
  "title": "CTG or EPAM: Which Is the Better Value Stock Right Now? - Nasdaq.com",
  "text": [
    " Investors interested in stocks from the Computers - IT Services sector have probably already heard of Computer Task Group (CTG) and Epam (EPAM). But which of these two stocks is more attractive to value investors? We'll need to take a closer look to find out. Everyone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits. Computer Task Group and Epam are both sporting a Zacks Rank of # 2 (Buy) right now. This means that both companies have witnessed positive earnings estimate revisions, so investors should feel comfortable knowing that both of these stocks have an improving earnings outlook. But this is just one piece of the puzzle for value investors. Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels. The Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors. CTG currently has a forward P/E ratio of 14.77, while EPAM has a forward P/E of 33.29. We also note that CTG has a PEG ratio of 0.98. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. EPAM currently has a PEG ratio of 1.68. Another notable valuation metric for CTG is its P/B ratio of 1.12. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, EPAM has a P/B of 6.77. These are just a few of the metrics contributing to CTG's Value grade of B and EPAM's Value grade of D. Both CTG and EPAM are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that CTG is the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Computer Task Group, Incorporated (CTG): Free Stock Analysis Report   EPAM Systems, Inc. (EPAM): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors interested in stocks from the Computers - IT Services sector have probably already heard of Computer Task Group (CTG) and Epam (EPAM). But which of these two stocks is more attractive to value investors? We'll need to take a closer look to find out.",
    "Everyone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits.",
    "Computer Task Group and Epam are both sporting a Zacks Rank of # 2 (Buy) right now. This means that both companies have witnessed positive earnings estimate revisions, so investors should feel comfortable knowing that both of these stocks have an improving earnings outlook. But this is just one piece of the puzzle for value investors.",
    "Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels.",
    "The Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors.",
    "CTG currently has a forward P/E ratio of 14.77, while EPAM has a forward P/E of 33.29. We also note that CTG has a PEG ratio of 0.98. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. EPAM currently has a PEG ratio of 1.68.",
    "Another notable valuation metric for CTG is its P/B ratio of 1.12. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, EPAM has a P/B of 6.77.",
    "These are just a few of the metrics contributing to CTG's Value grade of B and EPAM's Value grade of D.",
    "Both CTG and EPAM are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that CTG is the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:40:20"
}