{
  "url": "https://www.nasdaq.com/article/global-equities-jump-treasury-yields-rise-after-us-and-china-agree-to-meet-in-october-cm1207681",
  "title": "Global Equities Jump, Treasury Yields Rise After US and China Agree to Meet in October - Nasdaq.com",
  "text": [
    "Thursday is shaping up to be a \"risk on\" day based on early indications. Dow futures are up nearly 300 points. Treasury yields are higher. Gold is weaker and the safe-haven Swiss Franc and Japanese Yen are declining. The catalyst behind all this price action is the news that China and the United States reached an agreement to meet in October for trade negotiations.",
    "Early Thursday evening, China's Ministry of Commerce announced that the leaders of the U.S. and Chinese trade talks held a phone call in the morning and agreed to meet in early October for another round of negotiations.",
    "Liu He, China's top negotiator on trade, spoke with U.S. Trade Representative Robert Lighthizer and Treasury Secretary Steven Mnuchin, the Commerce Ministry statement said, according to a CNBC translation of the Chinese-language text.",
    "In a statement to CNBC, a U.S. Trade Representative spokesperson confirmed the phone call, but not the October meeting.",
    "Beijing said the two sides agreed to hold another round of trade negotiations in Washington, D.C., at the beginning of next month, and consultations will be made in mid-September in preparation for the meeting, the statement said.",
    "\"Both sides agreed they should work together and take practical actions to create favorable conditions for the negotiations,\" according to a CNBC translation of the Chinese Ministry of Commerce statement.",
    "The USTR spokesperson only acknowledged that both countries \"agreed to hold meetings at the ministerial level in Washington in the coming weeks\" and their deputy-level meetings would take place in mid-September \"to lay the ground work for meaningful progress.\"",
    "Trade talks and a rate cut by the Federal Reserve is a bullish formula for stocks. Let's hope President Trump lays off the Twitter Send Button.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:46:24"
}