{
  "url": "https://www.nasdaq.com/article/heres-why-the-medicines-company-stock-soared-again-on-tuesday-cm1206976",
  "title": "Here's Why The Medicines Company Stock Soared Again on Tuesday - Nasdaq.com",
  "text": [
    " What happened Shares of   The Medicines Company    (NASDAQ: MDCO) , a biopharmaceutical company focused on lowering   cholesterol, are on the move again following yesterday's   presentation of the Orion-11 trial results.   Healthcare-minded investors    pleased with the details drove the stock 10.4% higher on   Tuesday. So what Last week, The Medicines Company   stock jumped    after the company announced positive results from Orion-11, the   first of three pivotal studies with inclisiran that the company   will present before the end of 2019. The Medicines Company kept a   lid on the details until yesterday's presentation at the European   Society of Cardiology's annual meeting, and investors are happy   with what they saw.   Image source: Getty Images.makeArticleAd();  Inclisiran is a twice-yearly injection for people with   stubbornly high levels of low-density lipoprotein cholesterol   (LDL-C). The Orion-11 study was looking for a significant   improvement to patients' LDL-C scores, and it succeeded on this   front. At the 510-day observation, inclisiran delivered   placebo-adjusted LDL-C reductions of 54% without any serious side   effects. Now what Later this year, The Medicines Company will present results   from Orion-9, a study with heterozygous familial   hypercholesterolemia patients. This group is frequently injected   with PCSK9 inhibitors, such as Repatha from   Amgen    (NASDAQ: AMGN) , every other week. We'll also see results from Orion-10, and they'll probably   look a lot like Orion-11 results. The Orion-11 trial enrolled   people throughout Europe with atherosclerotic cardiovascular   disease (ASCVD)   or    equivalent risk factors. Orion-10 is essentially the U.S. version   of Orion-11, with one slight difference: Orion-10 is full of   patients   with    ASCVD. It's still a little early, but investors can probably look   forward to more positive results this year and a new drug   application in 2020. Peak annual sales of inclisiran are expected   to top $2 billion, and signs The Medicines Company can make it   happen could drive the stock much higher down the line.   10 stocks we like better than The Medicines     Company       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and The Medicines Company     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Cory Renauer      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   The Medicines Company    (NASDAQ: MDCO) , a biopharmaceutical company focused on lowering   cholesterol, are on the move again following yesterday's   presentation of the Orion-11 trial results.   Healthcare-minded investors    pleased with the details drove the stock 10.4% higher on   Tuesday.",
    "Last week, The Medicines Company   stock jumped    after the company announced positive results from Orion-11, the   first of three pivotal studies with inclisiran that the company   will present before the end of 2019. The Medicines Company kept a   lid on the details until yesterday's presentation at the European   Society of Cardiology's annual meeting, and investors are happy   with what they saw.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Inclisiran is a twice-yearly injection for people with   stubbornly high levels of low-density lipoprotein cholesterol   (LDL-C). The Orion-11 study was looking for a significant   improvement to patients' LDL-C scores, and it succeeded on this   front. At the 510-day observation, inclisiran delivered   placebo-adjusted LDL-C reductions of 54% without any serious side   effects.",
    "Later this year, The Medicines Company will present results   from Orion-9, a study with heterozygous familial   hypercholesterolemia patients. This group is frequently injected   with PCSK9 inhibitors, such as Repatha from   Amgen    (NASDAQ: AMGN) , every other week.",
    "We'll also see results from Orion-10, and they'll probably   look a lot like Orion-11 results. The Orion-11 trial enrolled   people throughout Europe with atherosclerotic cardiovascular   disease (ASCVD)   or    equivalent risk factors. Orion-10 is essentially the U.S. version   of Orion-11, with one slight difference: Orion-10 is full of   patients   with    ASCVD.",
    "It's still a little early, but investors can probably look   forward to more positive results this year and a new drug   application in 2020. Peak annual sales of inclisiran are expected   to top $2 billion, and signs The Medicines Company can make it   happen could drive the stock much higher down the line.",
    "  10 stocks we like better than The Medicines     Company       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and The Medicines Company     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than The Medicines     Company       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and The Medicines Company     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Cory Renauer      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:35:00"
}