{
  "url": "https://www.nasdaq.com/article/at-home-group-inc-home-q2-2020-earnings-call-transcript-cm1207658",
  "title": "At Home Group Inc. (HOME) Q2 2020 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   At Home Group Inc.    (NYSE: HOME)        Q2 2020 Earnings Call       Sep 4, 2019 ,   4:30 p.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Greetings and welcome to At Home Second Quarter Fiscal 2020   Earnings Call. At this time, all participants are in a   listen-only mode. A question-and-answer session will follow the   formal presentation. [Operator Instructions] As a reminder, this   conference is being recorded. I'd now like to turn the conference over to your host Bethany   Perkins, Director of Investor Relations.  Bethany Perkins Johns    --   Director of Investor Relations  Thank you, Dana. Good morning, everyone, and thank you for   joining us today for At Home's second quarter of fiscal year 2020   earnings results conference call. On the today are Chairman and Chief Executive Officer, Lee   Bird; President and Chief Operating Officer, Peter Corsa; and   Chief Financial Officer, Jeff Knudson. After the team has made   their formal remarks, we will open the call to questions. Before we begin, I need to remind you that certain comments   made during this call may constitute forward-looking statements   and are made pursuant to, and within the meaning of, the Safe   Harbor provisions of the Private Securities Litigation Reform Act   of 1995. In particular, statements about our outlook and   assumptions for financial performance for fiscal years 2020 and   2021 and our long-term growth targets, as well as statements   about the markets in which we operate, expected new store   openings, real estate strategy, potential growth opportunities,   future capital expenditures, future cash flows and the expected   impact of tariffs are forward-looking statements. Such forward-looking statements are subject to both known and   unknown risks and uncertainties that could cause actual results   to differ materially from such statements. Those are referred to   in At Home's press release issued today and in filings that At   Home makes with the SEC. The forward-looking statements made   today are as of the date of this call and At Home does not   undertake any obligation to update any forward-looking   statements. Finally, the speakers may refer to certain adjusted or   non-GAAP financial measures on this call, such as adjusted   EBITDA, adjusted operating income, pro forma adjusted net income   and pro forma adjusted earnings per share, a reconciliation   schedule showing the GAAP versus non-GAAP financial measures is   available in At Home's press release issued today. If you do not   have a copy of today's press release, you may obtain one by   visiting the Investor Relations page of the website at   investor.athome.com. In addition, from time to time, At Home expects to provide   certain supplemental materials or presentations for investor   reference on the Investor Relations page of its website. I will now turn the call over to Lee. Lee?  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  Thank you, Bethany. Good afternoon, everyone, and thank you   for joining us to discuss our results for the second quarter of   fiscal 2020. When we last spoke in early June I shared that our first   quarter results were impacted by cold and wet weather that   continued into Q2. I'm pleased that we navigated the unseasonable   conditions in the first part of May and saw a two year trends and   our business rebound afterward, including our results for the   first two weeks of May, our Q2 comp store sales were modestly   positive. We also successfully expanded our store base during the   quarter, surpassing an important milestone by opening our 200   store. Our teams work diligently to sell through seasonal   inventory and we're making significant progress toward our fourth   quarter goal of inventory growth in line with sales. We remain   extremely pleased with the performance of our recently opened   second distribution center. And as expected, we'll see freight   efficiencies help offset its operating costs beginning in the   fourth quarter. Drilling further into Q2, we are pleased with sales of $342.3   million and a modest comp decrease of 0.4% were within our   expectation. We opened 13 new stores and drove strong sales   growth of nearly 19%, representing our 22 straight quarter of at   least high teens revenue growth. Comps in nearly every department   improved sequentially from Q1 to Q2. And outside our weather   impacted patio assortment, our reinvention in digital   merchandising efforts continued to drive growth. Gross margin was in line with our teams -- gross margin was in   line as our teams made significant progress clearing through   higher levels of patio and garden products as we described last   quarter. Our store teams made it easier for customers to shop by   consolidating clearance items within each department. Store level   and district level leadership teams emphasize markdown   compliance, cleanliness and sharper merchandising within the   stores. As a result, standards have improved alongside inventory   levels. Our targeted effort is to control shrink and execute   clean, accurate inventory counts have been very effective as   well. Overall, we narrowed inventory growth in Q2, while   positioning ourselves to support an exciting back half seasonal   assortment. And we're laser focused on rightsizing our inventory   by the end of fiscal 2020. During Q2, we put a substantial effort around our tariff   mitigation strategy. Trade negotiations with China are incredibly   fluid, but let me briefly recap our actions over the last year to   mitigate the dollar impact of Chinese tariffs. First, when   tariffs on list one, two, three went into effect last September   at 10%, we work closely with our product partners, took selective   price increases and absorbed the tariff with no material margin   impact. Next, as those items were elevated to a 25% tariff this   summer, we committed to sharing the incremental impact with our   product partner. We reaffirmed that as part of our eVLP strategy   we'll monitor the market and be slow and tactical in taking price   increases as an offset. We have seen market prices come up in Q2 and we have begun   surgically increasing certain prices as a result. Then, list four   tariffs were announced at 10%, this round is disproportionately   weighted to our seasonal items on list 4B, the majority of which   were already be in stores when most of the tariffs take effect in   December. Therefore, we do not expect list four tariffs to   materially impact our fiscal 2020 profitability. We are   proactively working on solutions for the non seasonal items   covered by list four. In recent months, our merchant teams have met with over 400   product partners to review tariff mitigation and country   diversification plans. And we asked our list four suppliers to   fully absorb the tariff impact. Our interactions have been   positive so far, and our partners brought creative and practical   solutions to help At Home remain a price leader and deliver   strong profitable growth. We also have made progress diversifying   outside of China by direct sourcing program, which has nearly   doubled in volume in the last 12 months and should exit this year   at 15% penetration will help us continue to diversify over the   next three years. We've also identified numerous supply chain   enhancements to help us manage tariff risk going forward.   Finally, we continue to monitor pricing trends, we'll take a   surgical -- and we'll take surgical pricing increases where   appropriate. We're still assessing the additional 5% tariff   increase announced less than two weeks ago, but we are confident   that the disciplined and comprehensive approach we have refined   over the last year will help us mitigate this dollar impact as   well. If you look to the future, we believe that as a low price   leader we are well positioned to take share in the market, while   softer industry traffic has continued to play a role in our   fiscal '20 performance, we are being very proactive in analyzing   our business and refining our playbook for the back half of the   year to drive offset. First, from a marketing standpoint, we are   reallocating our media mix in Q3 and Q4 to lean into digital   outreach and direct mail. These channels have been our most   efficient and successful at driving store traffic. All of our   digital programs, including social media, search and CRM drive   positive returns. With our Insider Perks loyalty program doubling   its membership in the last 12 months and reaching more than 5   million members by second anniversary, we continue to focus on   increasingly targeted messaging. Within our direct mail program, our Fall LookBook and Black   Friday mailers are reaching more households and we're increasing   our emphasis on recent movers. From a merchandising standpoint,   we recently rolled out a new program we call EDLP Plus, which is   intended to both highlight our already low product prices and   improve the sell through of our planned markdowns. We're bundling   our weekly flash buying deals into our existing twice annual   clearance into a new strategy. EDLP [Phonetic] Plus will feature   a longer and more category focused customer event, execute on a   rolling 12 month basis. This process enables store teams focus on   one department at a time, refreshing it and consolidating   markdowns before marketing the exciting event to our   customers. While it's still very early on, our pilot categories have   demonstrated improvements in both comp sales and clearance sell   through. In the medium term, we're also digging into   opportunities to further refine our business and drive comp store   growth, such as evaluating our mix of good, better and best   products, exploring price -- product price point analysis and   customer sensitivity. And elevating the quality in lower priced   items to increase our value proposition. We also recognize that   customers continue to shift dollars online. Therefore, we   continue to build our omnichannel capabilities that leverage our   200 plus stores across nearly 40 states. We're on track to roll   out our buy-online-pickup-in-store test in this Q4. And based on   the results, we could launch it in a broader group of stores by   the end of fiscal 2021. These and other initiatives are part of a   multi quarter journey to reaccelerate our comp performance and we   will update you on learnings and solutions as we generate further   insights. Our comp performance this year has been below our own   standards, but it motivates us to be better and do better. Our   commitment to generate long term shareholder value is unwavering.   At its core, we have a great business model. We grew from $364   million to nearly $1.2 billion in sales over six years, while   delivering very healthy profit margins at both the store and   consolidated levels. Our concept is highly differentiated with the customer value   proposition focused on the dual pillars of largest selection and   lowest prices. We showcase more than 50,000 unique and constantly   refreshing items in a big box format with over 70% of our   products being private label or exclusive to At Home and over 80%   of our net sales at full price. We offer unmatched breadth and   depth in a one stop self-help shopping experience that gives the   customer the opportunity to see, touch and feel the product. We   enable customers to easily mix and match and truly make their   house At Home. Utilizing our low cost structure, we're committed   to being the low price leader in the marketplace. The At Home   brand is only five years old and with only 17% unaided brand   awareness and a $65 average basket, the upside opportunity   remains significant. Our new stores have produced strong returns over the past six   years as well, and we continue to see significant whitespace   opportunities across the country. Our real estate strategy is   both flexible and opportunistic, enabling us to move into second   generation boxes, as well as new builds. Because of the ample   supply and low demand, on average, we pay $6 per square foot in   rent, which helps us deliver strong adjusted EBITDA margins. On   average, our new stores pay back in less than two years and   generate more than $2 million in first year store adjusted --   store level adjusted EBITDA. Our older stores are strong as   well. In Q2, stores older than three years delivered positive comps   above the chain average. Our pipeline of new stores remain as   attractive as ever. In fact, we've already approved all of our   locations for fiscal 2021. We have the potential to nearly triple   our existing footprint and the future is bright as we drive   toward our long term goal of 600 plus stores. With our long term   growth in mind, over the past three months we've been thoroughly   analyzing our business, benchmarking ourselves and our   performance and reflecting upon shareholder feedback. As a   result, we reasseded our growth rate. Going forward, our priority   is to balance store expansion and profitability alongside   leverage improvement and free cash flow. Compared to our existing long term target of high teens unit   growth rate, we will now target 10% store growth in each of the   next three years. Through that balanced approach, we expect to   strengthen our balance sheet and generate positive free cash   flow. The change will begin with fiscal 2021 and flow through the   rest of our financial targets, which Jeff will discuss in greater   detail. Our executive team and board of directors are tightly aligned   and moderating our store growth rate is the best way to improve   liquidity, reduce leverage, ensure consistent growth and   ultimately drive long term shareholder value. Our growth rate may   be changing, our growth strategy is not. We continue to have full   confidence in the strength of our business model and our long   term potential of at least 600 stores. With that, I'd like to turn the call over to our CFO, Jeff   Knudson, who will update you on our Q2 performance and our   outlook for Q3 and fiscal 2020. Jeff?  Jeffrey R. Knudson    --   Chief Financial Officer  Thank you, Lee. And good afternoon, everyone. As a reminder,   additional information is available in our earnings release,   which is posted to our Investor Relations website and which   includes reconciliations illustrating our non-GAAP results as if   the new lease accounting standard had been effective in fiscal   2019. Our discussion of adjusted metrics on the rest of this call   will be on a lease adjusted basis with fiscal 2019 results recast   to illustrate the standards impact. I would also refer you to   investor presentation we posted, which includes the updated   growth targets that I will discuss shortly. First, I'll address   our second quarter results. Our top line grew 18.7% to $342.3   million, which was in line with our guidance. Comparable store   sales decreases 0.4%, also within our expectations, given   unseasonably cold and wet weather at the beginning of May. On a   two year stack basis, comps of 2.4% accelerated during the   quarter and improved 230 basis points over Q1. Second quarter gross profit increased 3.1% to $100.4 million,   while gross margin rate decreased to 29.3%. Adjusting for the new   lease standard, gross margin decreased 360 basis points, at the   low end of our outlook. As expected, gross margin was impacted by   incremental markdowns, the operating costs of our second   distribution center, which opened earlier this year, increased   occupancy costs from sale leaseback transactions executed in the   last 12 months and fixed cost deleverage on lower year-over-year   sales growth. We have been executing additional markdowns in fiscal '20 to   sell through clearance products, and we are pleased with the   amount of patio and garden inventory we cleared during Q2. We   significantly reduced inventory growth from 44.1% in Q1 to 31.7%   in Q2. And we continued to expect sequential improvement in Q3.   We remain on track to have inventory growth in line with sales in   the fourth quarter. Adjusted SG&A of $75.4 million improved   50 basis points to 22% of net sales. We expect that a flat   adjusted SG&A rate heading into the quarter, but timing of   store labor cost drove favorability that will reverse in Q3. As a   result of these factors, we delivered a 6.8% adjusted operating   margin above our outlook of 6.2% to 6.6%. Q2 adjusted operating income declined to $23.2 million,   interest expense increased to $8.2 million due to increased   borrowings to support our growth and higher interest rates. We   recognize $3.2 million of income tax expense in the second   quarter with a 23.5% adjusted effective tax rate. In Q2 last   year, our adjusted effective tax rate of 9.1% included $3.8   million of tax benefit related to non IPO stock based awards. In   total, we are pleased to deliver $0.18 of pro forma adjusted EPS   in the second quarter of fiscal '20. From a liquidity standpoint,   we executed a $75 million accordion feature on our asset based   lending facility in June and ended the quarter with total   liquidity of $146.2 million. Looking to the back half of this year, we are reiterating our   EPS guidance for the full year, but expect to see a couple of   timing shifts between the quarters. As I mentioned earlier, we   shifted about $0.02 of store labor expense from Q2 into Q3 to   support the timing of freight processing and other store   projects. Based on the current sell through rates, we also   estimate that planned everyday markdowns representing about $0.02   of EPS drag will pull forward into Q3 from Q4. As we have previously shared, Q4 will generate the majority of   our fiscal '20 earnings per share due to timing dynamics around   the second DC's rollout, new store pre opening costs, non product   cost and gross margin and the lapping of significant tax benefits   from stock award exercises in the first three quarters of fiscal   '19. Drilling down to our third quarter guidance, we plan to open   12 gross and nine net new stores and generate $312 million to   $317 million in net sales, representing 17% to 19% growth   year-over-year. Our comp store sales outlook is down 2.5% to down   0.5%. Last year our 5.2% Q3 comp was the strongest of fiscal 2019   and included an estimated 120 basis point tailwind from lapping   hurricanes in the prior year. Adjusting for last year's hurricane   tailwind, on a two year basis our Q3 comp outlook is a positive   1.5% to 3.5%. We are assuming adjusted operating margins of 1.9%   to 2.4% or lease adjusted decline of roughly 400 basis points at   the midpoint. Our outlook incorporates 110 basis points of second   DC cost, the markdowns I mentioned earlier and fixed cost   deleverage, primarily in occupancy. To a lesser extent, we expect   margin headwinds from the higher freight rates and tariff impacts   we flagged last quarter and increased occupancy costs from sale   leaseback transactions. All in, we expect an adjusted net loss of $1.0 million to $2.5   million, assuming approximately 65 million shares outstanding,   our Q3 outlook calls for a pro forma adjusted loss of $0.01 to   $0.04 per share. For the full year, we are flowing through our Q2   top line results and the continued performance of our new and non   comp stores as we narrow our fiscal 2020 sales outlook. We now   expect net sales in a range of $1.373 billion to $1.388 billion,   still representing 18% to 19% growth. Our updated full year comp store sales outlook of down 1.5% to   a positive 0.5% incorporates current trends, as well as a range   of outcomes for Q4. Our guidance implies an acceleration in the   two year comp stat trends from the first half to the second half   of the year due to weather improvements, our refined marketing   spend and our EDLP Plus initiative. That said, we are pleased to   reaffirm our outlook for gross margin, adjusted operating margin   and pro forma adjusted EPS. We continue to expect adjusted   operating margins of 6.6% to 6.9% in fiscal 2020, which   incorporate 80 to 90 basis points of net margin headwind from the   second DC, along with the impact of markdowns, higher freight   rates, some fixed cost deleverage and tariffs that have been   announced to date. We are lowering our fiscal '20 interest expense outlook to   $32.5 million due to reduced interest rates. We expect a slightly   higher adjusted effective tax rate at 23.5% and a slightly lower   diluted share count of approximately 65 million shares. With   adjusted net income of $44 million to $48 million, our pro forma   adjusted EPS outlook of $0.67 to $0.74 remains unchanged. Our   fiscal 2020 net capital outlook is $65 million lower to reflect   an additional sale leaseback transaction that we expect to   execute this fall, as well as a reduction in capital spend for   planned fiscal 2021 openings. We continue to pursue efforts to   reduce our capital outlay and improve our free cash flow profile   by exploring build-to-suit and buy-to-suit financing   alternatives, executing on capital reductions in our second   generation sites through value engineering, strategic procurement   and a refined market-by-market approach, while also focusing on   working capital improvements. As Lee touched upon in his opening remarks, after a thorough   analysis of our strategic priorities, we are refining our vision   with a heightened focus on delivering positive free cash flow   next year. As a result, we plan to moderate our new store growth   rate to 10% in each of the next three years to enable us to   improve the balance of new store growth and profitability on the   one hand, with free cash flow and reduced leverage on the other.   A reduced growth rate has that added benefit of mitigating the   cannibalization that is a byproduct of our opportunistic real   estate model and creating bandwidth for our teams to lean into   critical organic initiatives, including the omnichannel   opportunities, direct sourcing penetration and enhancing our   marketing and loyalty programs. Our revised top and bottom line growth targets for fiscal '21   through '23 are as follows. New store growth of 10% and same   store sales growth of 1% to 2%, translating to overall net sales   growth of low double digits and adjusted EPS growth in the low to   mid teens. Enabled by these new assumptions, we are establishing   targets for our balance sheet for the first time as a public   company. I shared earlier this year that we plan to be free cash   flow neutral in fiscal 2021. We now plan to drive positive free   cash flow in fiscal '21 and beyond. We also expect sequential   annual improvement in our adjusted leverage ratio with an   ultimate target of less than two and a half times. We feel that emphasizing free cash flow, enhancing our   liquidity and strengthen our balance sheet has enabled by our   lower growth rate are key to supporting our initiatives and   driving consistent shareholder returns over the long term. The   depth of our pipeline, strong productivity of our new and older   stores and the strategic opportunities we have in both   merchandising and marketing continue to give us confidence in our   business model and a longer term potential for 600 plus   stores. With that, I'll now turn it back over to Lee for his final   remarks.  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  Thank you, Jeff. In summary, our business model is strong and   we are well positioned to capture market share and capitalize on   a significant whitespace opportunity. In the near term, we're   refining our marketing approach and leaning into growth   initiatives like our newly introduced EDLP Plus strategy to   reaccelerate comps and continue to grow total sales. The health   of our inventory continues to improve and we're excited about the   roll out of our buy-online-pickup-in-store test this year to   better enable us to meet our customer's needs, no matter how they   shop. I'd like to thank our team members for their continued hard   work and dedication to these initiatives as we grow our business.   Our focus isn't on delivering value for our team members, our   customers and ultimately our shareholders. Looking beyond fiscal   2020, we are confident that these growth initiatives, along with   a stronger balance sheet between store growth -- stronger balance   between store growth, profitability and free cash flow generation   are the right path forward to generating that long term value.   We're excited about the future for At home and look forward to   updating you on our progress in future quarters. Dana, please open the line for the questions. Questions and Answers:  Operator  At this time, we'll be conducting a question-and-answer   session. [Operator Instructions] Our first question comes from   the line of Bradley Thomas with KeyBanc Capital Markets. Please   proceed with your question.  Bradley Thomas    --   KeyBanc Capital Markets -- Analyst  Good afternoon and thanks for taking my question. I was hoping   we could just first talk about some of the recent trends that   you've seen in the business, you addressed this a bit in the   prepared remarks, Lee, but just curious how your assessment of   the state of the industry and the pace of your operations has   evolved as you reflect on another quarter that the industry   continues to experience some weakness here?  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  Sure, Brad. What I would say is, the marketplace feels   choppier, but that's the same as we saw in Q1. So no change from   what we experienced in Q1. The sector is seeing traffic   challenges, down 4% in Q2 and which was down 5% in Q1. So what   we're focused on is, what we can control. We're determined to get   our business back in shape and so we've been put a discerning eye   on our business. We've been working on offsets, we've adjusted,   as I mentioned, our marketing mix, we outlined and executed   already outlining and rolling out a EDLP Plus approach to   highlight the great prices we already have, because we are an   everyday low price leader. And also to get better sell through on   our clearing. We focus on inventory management, we're making   progress there and we've been investing in omnichannel and we're   excited about the launch of that in Q4. And as you noticed -- you may have noticed, we've maintained   the midpoint of our FY '20 sales outlook, which means our non   comp stores and our new stores are outperforming, which says   that, we're continuing to drive share and performing with these   new stores. And we are targeting positive comps to start in Q4   this year.  Bradley Thomas    --   KeyBanc Capital Markets -- Analyst  That's helpful. And then, I want to ask a follow up about the   decision to slow the pace of growth. Very clear what you're   trying to expect out of this. But I was hoping you can give a   little more color around how we should think about what the capex   levels may be next year with this slower pace of growth? And what   potential benefits, if any, we may see to margins next year,   given all the slower pace of growth?  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  Sure, Brad. I'll start and Jeff will finish on that. We've   been analyzing our business and we've spent a lot of time   benchmarking our peers. How the high growth retailers set up   their business for a sustained growth and profitability, which is   our intention as well and we've also been listening and talking   to investors. And we clearly see from our benchmarking that   investors and more importantly, from our peer group, we're seeing   that a more balanced approach is the approach for sustainable   high growth retailers. And so by focusing on not only growth and   profitability, which we have strong profitability, even in our   worst year, we've got great profit margins. We need to balance   that with delivering -- being free cash flow positive to pay and   fund that growth and reduce our leverage to deliver long term   shareholder value. And so that's what we've done by moderating   our growth, the capital impact is -- Jeff, you want to cover   this.  Jeffrey R. Knudson    --   Chief Financial Officer  Yeah. So you obviously saw a change in our fiscal '20 capex   guidance, there was a gross reduction of $65 million on the net   side with $50 million in sale leaseback and then pulling out $15   million as it relates to the fiscal '21 vintage. As it relates to   next year, we still do have a strong pipeline, we have over 15   stores that are currently owned. So we will be able to continue   our sale leaseback cadence as we move into next year. And as we   get further into this year, we'll provide more specifics on the   capex guidance for fiscal '21. As it relates to the operating   margins, there's obviously a lot of dynamics in play as it   relates to fiscal '21, we do have some tailwinds next year as it   relates to lower markdowns. We'll start to see efficiencies from   the second distribution center, as well as direct sourcing. But   obviously, with the tariff wrap and the elevated tariffs that   were just announced a week and a half ago, we also had some   freight rate impacts as well as the sale leaseback. So, as it   relates to fiscal '21 margins, the tariff situation is very fluid   right now. We're still working, as Lee said in his prepared   remarks, to mitigate the dollar impact of those tariffs. And as   that plays out over the next couple of weeks and months, we'll   get back to you later in the year with specifics round next year   margins.  Bradley Thomas    --   KeyBanc Capital Markets -- Analyst  That's helpful. Thank you very much.  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  Thanks, Brad.  Operator  Our next question comes from the line of John Heinbockel with   Guggenheim Securities. Please proceed with your question.  John Heinbockel    --   Guggenheim Securities -- Analyst  So, Lee, let me start with EDLP Plus. Is the current RUG   [phonetic] event an example of that? And then, when you think   about the execution of it, the idea that, I don't know, how many   times a year, but I don't know, multiple times a year and,   obviously, every quarter a category will be highlighted and   promoted for several weeks at a time? Is that the idea behind the   execution? And then is it sort of the reason that EDLP doesn't   kind of work as well in this space, because it just happens to be   a promotional space and you need to do that to generate customer   interest?  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  John, the EDLP Plus approach is a double down on everyday low   price, so it's not a departure from that, it give us credit for   what we already do, but also to enhance an emphasis around events   to highlight those categories themselves. So we started with our   home org event in the beginning of August, so this started back   in the beginning of August. So we did home org and we did   furniture and those were targeted events highlighting full priced   items, our flash findes and then also identifying and showing our   clearance department. They were preceded by department cleanups   for those departments. So our teams cleaned off the department,   made sure everything was priced appropriately, easy to shop and   then we had the organization event, then we had the furniture   event, now we have the RUG event. And the RUG event actually   matches up to an approach we're using now when you have retail --   retail sale time period, so think about Labor Day in fourth of   July and Memorial Day and Presidents Day those are highly   promotional. Those will be timed, we're going to be -- we're   going to lean a little bit into the promotion side, but not   change our model, but just highlight that. And then that'll be   for a short period time and then we'll roll back into the next   event as well. So that's going to be our model, you'll see that.   We're pleased with the performance against that on full price   selling, which is our primary emphasis and clearance of our   markdowns. We like that, but it's not a departure of the model, it's   actually just allowing us to actually freshen the store over   time. And you'll see starting in January the next level of this.   So we are piloting, refining it, getting it better and by -- once   you get out of Christmas, we'll be able to add another level of   EDLP plus and an in-store experience that'll show even stronger   the highlight of these product categories.  John Heinbockel    --   Guggenheim Securities -- Analyst  Okay. Thanks. And then just long term sort of to tag on the   last question. When you look at the three year target, I don't   think, at least I always thought because next year is an extra   week and you get the recapture rate of some of this year's cost   pressures. The three year is not meant to be -- it's meant to be   a target, it's not meant to be a sort of an algo for each year.   Next year, I assume, would differ from that a bit. And then if I   think about your leverage target, it looks to me like you   probably need over that three year period to pay down somewhere   $2 million the 250 million of debt, again, it depends how fast   you grow EBITDA but that sort of -- $200 million plus, Jeff, is   that fair? Is that a fair target?  Jeffrey R. Knudson    --   Chief Financial Officer  Yeah. It's close John. That's right.  John Heinbockel    --   Guggenheim Securities -- Analyst  Okay.  Jeffrey R. Knudson    --   Chief Financial Officer  But on the on the target...  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  The targets, we didn't think about those, so those -- we did   not factor in the 53 week next year, John, into those targets,   those are on a 52 week comparable basis. And we have thought   about those, as you know, longer term targets, but each year   operating within those parameters as well.  John Heinbockel    --   Guggenheim Securities -- Analyst  Okay. Thank you.  Jeffrey R. Knudson    --   Chief Financial Officer  Thanks, John.  Operator  Our next question comes from the line of Daniel Hofkin with   William Blair. Please proceed with your question.  Daniel Hofkin    --   William Blair -- Analyst  Good afternoon. I apologize if you answered this already, but   just as it relates to the tariff impact, which you talked about   is being not much for the list 4B for this year, given when   you'll have the product in. But can you characterize that for   next year? What that's likely to be based on what you know now?   And then I have a follow up question.  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  Yeah. From a tariff standpoint what we've said is, basically   list one, two, three obviously had 25 basis points baked into our   back half for those for less one, two, three at the 25% because   remember, our inventory turns slowly. And so it doesn't take it   through the turn of the inventory. List four is more weighted   toward seasonal product which -- that'll be in the stores   already, so we don't expect a material impact on FY '20. Now from   an FY '21, we've been working very closely with our supply   partners. We actually had -- we've met with 300 of our product   partners, not only in the US where we brought our top 100   suppliers in, but then we went to China, we went to Vietnam and   India and met with our product partners and product partners   summits and required them to come to those meetings, prepared to   discuss creative and practical solutions to offset these tariffs.   Now, this is obviously before the 5% incremental increase on top   of the 10% that we knew in list four. But they came back with   great plan, we've been working through those plans, we've also   told them that they had to eat list four, the cost of less four.   But then we've been -- so we've been working on a very   disciplined approach to mitigate the impact of our tariff. And I   would say, right now, it's too soon to give FY '21 margin   percent, but we're confident the EPS growth have outpacing sales   growth next year and that's incorporated the impact of those   tariffs going forward.  Daniel Hofkin    --   William Blair -- Analyst  Okay. And then, as it relates to your comments before on the   question earlier about the overall environment. It's not really   clear that the consumer is spending last or spending less on   value. So it implies that there's some more competition. I'm just   curious where you think that's coming from and what -- how this   sort of the EDLP Plus strategy, how you think that will help more   going forward?  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  Sure. I would say that the promotional environment and the   competition is no different really than what we saw in Q1. So   it's not different, remember, it is different than it was a year   ago. So it's more promotional. And I would say, what we've found   too is that, we are -- we're not a high, low player. So we've   realized that since the marketplace is promotional we're not   getting credit for the low prices we already have. So this EDLP   plus program is really more to highlight the prices we have in   the store, both out of store and in-store more clearly to our   customer to be clear on our website, how our prices are lower   than the competition and expect to be lower than the competition.   And so, what we're trying to do is, highlight categories, be   clear about the price and then when there is a clearance customer   out there, to be a little bit more open and transparent in   inviting to our customer to go buy the clearance. We make it too   hard for them to find a clearance in our stores, we're trying to   make it easier for them to find it, buy it so we can sell through   faster. And that's how we're going to approach it. That allows us   to continue to have 80% of our sales at full price. That allows   us to be profitable and continue to grow and take share because,   by the way, the marketplace may be choppy, but we are taking   share. When we're growing 18%, 19% in a quarter where the   marketplace is going backwards, we're a share taker.  Daniel Hofkin    --   William Blair -- Analyst  And where do you feel like -- Okay. So understood regarding   that, but will you be reducing your price's during sort of in a   pulsed way in line with when others run promotions, companies   that are not on an EDLP or that are more on a high, low type of   system?  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  No, I think what we're going to do is -- what we always do is,   we -- our prices are below other people's sales prices, they just   don't see it sometimes, they're not noticing it because there's a   lot of noise out there about the promotion or the ad and they   don't spend the time to go look at ours. And we don't make it   clear to them the value that we offer. So we're trying to make   sure our prices are sharp, we are focused on making sure we are   the lowest priced out there. And then, but at times where it is   highly promotional, we may have an offering that's more   consistent to what they have, which we were doing before, but may   not have been timed at the same time that they were doing theirs.   Until, for example, our RUG event that we're having right now is   an event that we bought into, we bought volume for a RUGs to   expect a higher velocity selling period. To then highlight that   value, while other people are talking about their offer. We have   arms. It's not the first time we've done a RUG offer, but it's   the first time we're doing it over Labor Day to get credit, while   other people are promotional as well. So it's just to sync up   with the industry at the time there doing that. But it's not   changing our model, it's just getting credit for what we're   already doing.  Daniel Hofkin    --   William Blair -- Analyst  Okay. Thank you. Good luck.  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  Thank you.  Operator  [Operator Instructions] Our next question comes from the line   of Jonathan Matuszewski with Jefferies. Please proceed with your   question.  Jonathan Matuszewski    --   Jefferies -- Analyst  Great. Thanks for taking my questions. I guess just for the 3Q   guide, you said there is some soft industry traffic in 2Q. So   just curious kind of what your expectations are for 3Q? Are you   expecting industry traffic for the category to worsen, stay the   same or improve? And I guess, how have trends been shaping   quarter to date relative to your comp guidance range? Thanks.  Jeffrey R. Knudson    --   Chief Financial Officer  Yeah. Jonathan, when we think about our copm trends going into   Q3, remember we do have a tough compare our of 52 from last year   that has the 120 basis points from the hurricane in fiscal '18.   So on a two year stack basis, those trends are pretty consistent   with where we ran in Q2. If you look at the midpoint, and with   that how -- so we don't see any dramatic shifts from a traffic   standpoint or moving into Q3. When we look at those traffic   trends that Lee talked about, and the down 4% Q2 off of 5% in Q1,   I would say that we are outpacing the industry from a traffic   standpoint and when you exclude the cannibalization in past, we   are happy with where our traffic is trending right now.  Jonathan Matuszewski    --   Jefferies -- Analyst  Great. That's helpful. And then I guess just on the select   price increases, I know you mentioned you'd be doing them   surgically. If you could just elaborate there a bit they'd be   helpful? Anything you could share in terms of maybe just the   blended level of increases you're looking to take. I'm sure it   varies by category, but maybe just how much price you're looking   to pass on and how that level of increase compares relative to   what you're seeing the industry do. Thank you.  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  Sure. We comp shop every other week. Our teams has done their   Friday's comp shopping every other week, buy item to know what   the competition is doing from a price standpoint. So we're super   methodical about it. Our list one, two, three last year had no   meaningful financial impact on those price increases that we made   a surgical increases. We focus on the value proposition. We focus   on being the low price leader. We may see where there's an   opportunity to take price. We may decide to do it to monitor   where that price is. We may see where we actually need to   increase the quality to make sure the value is there. So we're   working on that. So we've been slow and very tactical to take   price. Some people have some questions around that approach after   Q1 with us, because we said we weren't going to take price just   yet, because I would tell you that goes against our model. We   need to be slow to take price because we need to be the low price   leader out there. And when we do take price, we do look at   offsetting margin dollar impact and the margin percent impact. So   -- and we -- and since Q1, the Q1 results were announced, we have   taken targeted price increases this past summer. But our goal   always is to maintain price leadership. And we're working with   our suppliers and we're using direct sourcing to continue to find   offsets in our supply chain to keep our prices low.  Jonathan Matuszewski    --   Jefferies -- Analyst  And I guess, that's helpful. Just a quick follow up for those   select price increases that you have taken, have you seen any   material unit degradation?  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  On the list one, two, three that we had starting last year, we   have not, we've been able to protect the revenue on that, but I   would say, it's too soon on the most recent price increases.   We're just gonna keep watching them.  Jonathan Matuszewski    --   Jefferies -- Analyst  Thank you.  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  Thanks, John.  Operator  Our next question comes from the line of Chuck Grom with   Gordon Haskett . Please proceed with your question.  Chuck Grom    --   Gordon Haskett -- Analyst  Good afternoon. Just on the second quarter gross margins.   Jeff, can you just unpack for us a little bit more granularity   the four negative factors that you called out? And then when we   look ahead to the third quarter, can you just hold our hands on   exactly what you're thinking the gross margin line?  Jeffrey R. Knudson    --   Chief Financial Officer  Sure. So on the Q2 gross margins, again, they were in line   with our expectations, we had 85 basis points unfavorably from   the second DC. 50 basis points on sale leaseback, deleverage   within our occupancy that came in as expected and the remainder   was from markdowns and fixed costs deleverage on occupancy.   Again, we were pleased with the amount of inventory we were able   to move with those markdowns and the operating margins when you   exclude the timing of the store labor came in, again, within our   guided range for Q2. Moving to the full year, again, we reiterated our full year   gross margin and operating margin outlook. There is some timing   element on those markdowns between Q4 and Q3, but our full year   outlook remains the same from the last call.  Chuck Grom    --   Gordon Haskett -- Analyst  Any color for the third quarter, specifically on the gross   margin line. I know, you gave an operating margin target. Just   wondering how you -- how we should get there in terms of those   components that you just laid out for the second quarter?  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  Yeah. Tt's it's predominantly within the gross margin. There's   a little bit of SG&A benefit in Q3, but the vast majority   ends the same drivers, we've been talking about you do have the   introduction of the tariff impact in Q3 that wasn't in Q2, that   we had talked about in the last call, but it's the second   distribution center, it's the markdowns and it's the sale   leaseback and occupancy deleverage on the lower sales growth is   really the drivers.  Chuck Grom    --   Gordon Haskett -- Analyst  Okay. That's helpful. And then when we think about next year,   it sounds like you're trying to set the table that some of the   the benefits you're going to see from cycling some of the   markdowns and distribution costs are going to be offset,   essentially by the tariff wrap. I mean, you probably don't want   to peg in operating margin target for next year, but should we   think about kind of flattish as what you guys are thinking of at   a preliminary rate at this point in time?  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  You know, Chuck, that's exactly why we didn't give an   operating margin. With the last tariff increases being announced   a week and a half ago and how we mitigate those, and again, we're   always trying to mitigate that dollar impact and not the rates   and how those dynamics are gonna play out between gross and   operating margins. We just need time to work through the process   that we've established over the last year to mitigate those   tariffs and we'll get back to you with more details on how we see   fiscal '21 margins playing out. But, again, I would reiterate   that we do feel good about the mid to low teens adjusted EPS   growth.  Chuck Grom    --   Gordon Haskett -- Analyst  Okay. Great. Thanks for the color.  Operator  Our next question comes from the line of Simeon Gutman with   Morgan Stanley. Please proceed with your question.  Simeon Gutman    --   Morgan Stanley -- Analyst  Hi, Lee. Hey, Jeff. I wanted to ask about the sales   environment. If you look back to last six or so quarters, they   mostly been bumpy, there's been some reasonable reasons why   weather -- not enough seasonal merchandise, we had some Black   Friday bumpiness. So in Q3, you have a tough compare, which   you're lapping, Q4 I think the implied mid points around are   flat. So I just want to step back and try to diagnose what's   changing. Is it business moving online, you had a backdrop that   has gotten weaker. I think merchandising may have gotten stale, I   don't know if you did go as far as say that, store conditions,   etc. Just so we can try to establish some chain of what's going   to get better as we move back into next year?  Jeffrey R. Knudson    --   Chief Financial Officer  Yeah. So I'll start with the implied comp for Q4 around. It's   slightly better than flat, Simeon, is where we are for Q4. We did   take with our Q2 results and the outlook for Q3 with that tougher   compare, we did take the full year down 50 basis points to the   prior guide of our full years down 1.5% to up 0.5%, that is   reflective of the current environment and the trends we're   seeing. We did say in the last call that we did see the two year   stack stabilizing as we move through the back half. When you look   at our Q2 results and then our Q3 guide, adjusted for the   hurricane impact that's in that two year stack, that's how it's   playing out and we have saw the weather impact in the first half   and -- to continue to drive traffic and improve our comp trends,   that's why we're going after the marketing initiatives that we   talked about, redirecting some of that spend as well as the time   that we've spent on the EDLP plus initiative. And then I'll let   Lee chime in.  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  Yeah. Simeon, for us, as you know, because you've been with us   now for -- not sure, over four or five years of talking about   this business and learning about this business and sharing back   and forth ideas. We've walked stores together. This is not a comp   store, it has never been a comp store. Now, obviously, we expect   of ourselves positive comps. So don't get me wrong, and we're not   pleased with our performance, I'm certainly not pleased with the   performance that we've delivered in Q1 and Q2. But I would tell   you, it's never been a comp story. We have new stores that come   in that are highly productive. They have no comp waterfall. So we   don't have that tailwind that other retailers have. We have to   get through it with blocking and tackling. And I actually have to   overcome the second year, which is a tougher year for us of a new   store. But I would say that -- and we've delivered positive comp   and we expect that of ourselves. The first half of this year was   a weather challenge and I would tell you now that we've been able   to stabilize our two year stacks. By the back half of the year,   those have come in toward this new guidance range of a one to two   comp. And that's we -- you should expect of us. And we're mindful   of the environment with that expectation as well, we've said it's   choppier, it was not choppy three years ago, four years ago. And   so now it's choppier, it's not necessarily about other factors   that you've mentioned, obviously, yes online is a factor, that's   been a factor for -- that's been in the business for six and a   half years. Obviously, we're working an online approach, we've   been doing that for four years now, we're now bringing our   buy-online-pickup- in-store, we've always said we're going to do   that e-commerce our way, which means let's do this profitably.   Other people don't. And so we're focused on that. And so we're   just mindful of our model, we're mindful of the environment, but   we expect positive comps, we expect positive comps for ourselves,   obviously, next year. And obviously, for the fourth quarter, the   midpoint of our Q4 expectation is a positive comp as well.  Chuck Grom    --   Gordon Haskett -- Analyst  And my follow up, just two parts, they'll be unrelated, do you   need to speed up or do you want to speed up online any quicker   than the rough timetable that we've talked about, I think it's   buy-online-pickup-in-store through at some point to the end of   next year. And then the unrelated part, just some of the   merchandising changes that you've -- the business has embarked   on, a new person helping with trend, product, display. Can you   just walk through them and what you're seeing thus far with some   of the changes you've made?  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  Yeah. I'm excited about those. Let me start first with your   first question around our omnichannel approach. As you know,   first and foremost, it's always about the customer. And for us,   we continue to get research from our customer where the vast   majority of all sales in this category are still done in physical   brick and mortar stores and they're looking for price, selection   and see, touch and feel and that's what we offer in our store   today. And we feel we've got a very compelling offering, our EDLP   plus approach will help highlight our already existing great   prices and our selection. And then be able to highlight   categories and sell. We do know that customers are increasing   their spend online over the past number of years and we've been   on a multiyear journey, we've been thoughtful about this, other   people rushed way too fast and blew up their business on that.   We're not going to do that. We had a demand where four years ago,   we put our products online, we put a recommendation engine in   about a year and a half ago, we put all their inventory online   buy store this spring. So all of our stores have visibility buy   store for their inventory. So you can exactly see the item you   want and how much is in each particular store near your home.   We've added partners through that platform to be ready for a   buy-online-pickup-in-store. We've added our OMX [Phonetic]   partner and a credit card partner as well, so that we're ready   for that to do this test in Q4. As we see that perform we intend to then roll that out to a   number of stores on a larger scale by the middle of next year, by   the end of next year, we should have that fully built. And then   we're using this store as the basis of our omni business. And so,   you should expect as we look at it, what's what's the next   capability is same day delivery from store, because our stores   are warehouses, over 200 of them. So how do we get that to the   customer on the same day? And then how do you ship from store?   From those existing warehouses, using those existing inventory   pools that should help our inventory turn faster and meet our   customer expectations. And so that should allow us to continue to   deliver low prices to our customer and if [Indecipherable]   returns while preserving the treasure hunt approach for our   customer and still delivering profitability. So we're very   thoughtful about it. We don't -- I don't feel like we need to   pick up the pace, because when you go faster, sometimes you don't   execute as well. And you know us to be thoughtful and we're going   to do that and deliver a good outcome. Now on the merchandising part, I'm excited about the changes   and enhancements we've made in merchandising. Chad Stauffer is   our chief marchant, he has been in the seat for now three months.   He and I are completely aligned on our approach to EDLP Plus.   He's been with the company for over a year. He joined us about 18   months ago and ran the everyday business and the progress we're   seeing in everyday business afforded us the confidence to promote   him into the chief merchant role. And now he's running the whole   thing. The EDLP Plus was actually his and Ashley Sheetz, our   chief marketing officers co-developed idea and they're the ones   co-executing this. And I think they're doing a brilliant job of   planning it and putting the plans in place, executing thoughtful   tests and enhancing that program throughout the back half of this   year to see the full experience by our Q1. We've added and   enhance our trend department. We have our new head of trend and   design has been at West down Anthropologie, we're thrilled that   Christian and his efforts, he's just brilliant and we love his   work and the way that he's thinking about how do we take our   archetypes to the next level. He'll be actually previewing all of   that with our board just next week with our approach. So I like where we're taking trend, we're taking those trend   insites to each and every one of our departments for making sure   that we build the assortment plan based on what we're seeing in   trend and make sure that we have the most current and appropriate   styles in our assortment. And then we take this comp shopping   every other week to make sure our prices reflect where we need to   be. And then on top of that, you should know that we're -- we've   been adding members of our team to the inventory side to merch   planning, to help us better buy and better plan our inventories.   So we're sharper and smarter on their inventory investment, so we   don't get into the situations that we've had historically around   inventory to become better and better as a retailer.  Simeon Gutman    --   Morgan Stanley -- Analyst  Thanks, Lee.  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  Thanks, Simeon.  Operator  Our next question comes from the line of Curtis Nagle with   Bank of America. Please proceed with your question.  Curtis Nagle    --   Bank of America -- Analyst  Good evening. Just a quick question on the changed   expectations on the lease back. So I think it was 75, now 125. I   guess what drove the changes, is that a pull forward from perhaps   next year or is it something else?  Jeffrey R. Knudson    --   Chief Financial Officer  No, I would think about it as a preliminary step or migrating   step to our build to suit and buy to suit model. These are   actually gonna be a handful of stores that are all recent fiscal   year '20 openings and an opportunity. Typically we would say we   expect [Indecipherable] 12 months of operating performance and we   were able to do a handful of stores that all have opened within   the last quarter, so -- and this is -- with our track record of   excellent sale leaseback. This will allow us to transition more   fully next year to our build to suit and buy to suits on our   ground up sites.  Curtis Nagle    --   Bank of America -- Analyst  Okay.  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  It reflects also, Curtis, just the confidence that our   partners on that side that we have in our business and also in   the stores themselves. They know our stores, they've owned a   number of them, we've worked with them for a number of years and   they feel comfortable to not wait the year. And we feel as well   comfortable not waiting the year, because our stores have been so   predictable right out of the gate.  Curtis Nagle    --   Bank of America -- Analyst  Okay. That makes sense. Thanks very much for the   clarification.  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  Thanks, Curtis.  Operator  Ladies and gentlemen, we have reached the end of the   question-and-answer session, and I would like to turn the call   back to Lee Bird for closing remarks.  Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer  All right. Well, thank you, everyone, for joining us this   afternoon. We're excited about the opportunities in front of us   and the long term growth ahead. And we look forward to talking to   you in the coming days and weeks. Take care.  Operator  [Operator Closing Remarks]  Duration: 59 minutes  Call participants:  Bethany Perkins Johns    --   Director of Investor Relations   Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer   Jeffrey R. Knudson    --   Chief Financial Officer   Bradley Thomas    --   KeyBanc Capital Markets -- Analyst   John Heinbockel    --   Guggenheim Securities -- Analyst   Daniel Hofkin    --   William Blair -- Analyst   Jonathan Matuszewski    --   Jefferies -- Analyst   Chuck Grom    --   Gordon Haskett -- Analyst   Simeon Gutman    --   Morgan Stanley -- Analyst   Curtis Nagle    --   Bank of America -- Analyst   More HOME analysis   All earnings call transcripts        10 stocks we like better than At Home Group   Inc.     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and At Home Group   Inc. wasn't one of them! That's right -- they think   these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " At Home Group Inc.    (NYSE: HOME)        Q2 2020 Earnings Call       Sep 4, 2019 ,   4:30 p.m. ET ",
    " Operator ",
    "Greetings and welcome to At Home Second Quarter Fiscal 2020   Earnings Call. At this time, all participants are in a   listen-only mode. A question-and-answer session will follow the   formal presentation. [Operator Instructions] As a reminder, this   conference is being recorded.",
    "I'd now like to turn the conference over to your host Bethany   Perkins, Director of Investor Relations.",
    " Bethany Perkins Johns    --   Director of Investor Relations ",
    "Thank you, Dana. Good morning, everyone, and thank you for   joining us today for At Home's second quarter of fiscal year 2020   earnings results conference call.",
    "On the today are Chairman and Chief Executive Officer, Lee   Bird; President and Chief Operating Officer, Peter Corsa; and   Chief Financial Officer, Jeff Knudson. After the team has made   their formal remarks, we will open the call to questions.",
    "Before we begin, I need to remind you that certain comments   made during this call may constitute forward-looking statements   and are made pursuant to, and within the meaning of, the Safe   Harbor provisions of the Private Securities Litigation Reform Act   of 1995. In particular, statements about our outlook and   assumptions for financial performance for fiscal years 2020 and   2021 and our long-term growth targets, as well as statements   about the markets in which we operate, expected new store   openings, real estate strategy, potential growth opportunities,   future capital expenditures, future cash flows and the expected   impact of tariffs are forward-looking statements.",
    "Such forward-looking statements are subject to both known and   unknown risks and uncertainties that could cause actual results   to differ materially from such statements. Those are referred to   in At Home's press release issued today and in filings that At   Home makes with the SEC. The forward-looking statements made   today are as of the date of this call and At Home does not   undertake any obligation to update any forward-looking   statements.",
    "Finally, the speakers may refer to certain adjusted or   non-GAAP financial measures on this call, such as adjusted   EBITDA, adjusted operating income, pro forma adjusted net income   and pro forma adjusted earnings per share, a reconciliation   schedule showing the GAAP versus non-GAAP financial measures is   available in At Home's press release issued today. If you do not   have a copy of today's press release, you may obtain one by   visiting the Investor Relations page of the website at   investor.athome.com.",
    "In addition, from time to time, At Home expects to provide   certain supplemental materials or presentations for investor   reference on the Investor Relations page of its website.",
    "I will now turn the call over to Lee. Lee?",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "Thank you, Bethany. Good afternoon, everyone, and thank you   for joining us to discuss our results for the second quarter of   fiscal 2020.",
    "When we last spoke in early June I shared that our first   quarter results were impacted by cold and wet weather that   continued into Q2. I'm pleased that we navigated the unseasonable   conditions in the first part of May and saw a two year trends and   our business rebound afterward, including our results for the   first two weeks of May, our Q2 comp store sales were modestly   positive. We also successfully expanded our store base during the   quarter, surpassing an important milestone by opening our 200   store. Our teams work diligently to sell through seasonal   inventory and we're making significant progress toward our fourth   quarter goal of inventory growth in line with sales. We remain   extremely pleased with the performance of our recently opened   second distribution center. And as expected, we'll see freight   efficiencies help offset its operating costs beginning in the   fourth quarter.",
    "Drilling further into Q2, we are pleased with sales of $342.3   million and a modest comp decrease of 0.4% were within our   expectation. We opened 13 new stores and drove strong sales   growth of nearly 19%, representing our 22 straight quarter of at   least high teens revenue growth. Comps in nearly every department   improved sequentially from Q1 to Q2. And outside our weather   impacted patio assortment, our reinvention in digital   merchandising efforts continued to drive growth.",
    "Gross margin was in line with our teams -- gross margin was in   line as our teams made significant progress clearing through   higher levels of patio and garden products as we described last   quarter. Our store teams made it easier for customers to shop by   consolidating clearance items within each department. Store level   and district level leadership teams emphasize markdown   compliance, cleanliness and sharper merchandising within the   stores. As a result, standards have improved alongside inventory   levels. Our targeted effort is to control shrink and execute   clean, accurate inventory counts have been very effective as   well. Overall, we narrowed inventory growth in Q2, while   positioning ourselves to support an exciting back half seasonal   assortment. And we're laser focused on rightsizing our inventory   by the end of fiscal 2020.",
    "During Q2, we put a substantial effort around our tariff   mitigation strategy. Trade negotiations with China are incredibly   fluid, but let me briefly recap our actions over the last year to   mitigate the dollar impact of Chinese tariffs. First, when   tariffs on list one, two, three went into effect last September   at 10%, we work closely with our product partners, took selective   price increases and absorbed the tariff with no material margin   impact. Next, as those items were elevated to a 25% tariff this   summer, we committed to sharing the incremental impact with our   product partner. We reaffirmed that as part of our eVLP strategy   we'll monitor the market and be slow and tactical in taking price   increases as an offset.",
    "We have seen market prices come up in Q2 and we have begun   surgically increasing certain prices as a result. Then, list four   tariffs were announced at 10%, this round is disproportionately   weighted to our seasonal items on list 4B, the majority of which   were already be in stores when most of the tariffs take effect in   December. Therefore, we do not expect list four tariffs to   materially impact our fiscal 2020 profitability. We are   proactively working on solutions for the non seasonal items   covered by list four.",
    "In recent months, our merchant teams have met with over 400   product partners to review tariff mitigation and country   diversification plans. And we asked our list four suppliers to   fully absorb the tariff impact. Our interactions have been   positive so far, and our partners brought creative and practical   solutions to help At Home remain a price leader and deliver   strong profitable growth. We also have made progress diversifying   outside of China by direct sourcing program, which has nearly   doubled in volume in the last 12 months and should exit this year   at 15% penetration will help us continue to diversify over the   next three years. We've also identified numerous supply chain   enhancements to help us manage tariff risk going forward.   Finally, we continue to monitor pricing trends, we'll take a   surgical -- and we'll take surgical pricing increases where   appropriate. We're still assessing the additional 5% tariff   increase announced less than two weeks ago, but we are confident   that the disciplined and comprehensive approach we have refined   over the last year will help us mitigate this dollar impact as   well.",
    "If you look to the future, we believe that as a low price   leader we are well positioned to take share in the market, while   softer industry traffic has continued to play a role in our   fiscal '20 performance, we are being very proactive in analyzing   our business and refining our playbook for the back half of the   year to drive offset. First, from a marketing standpoint, we are   reallocating our media mix in Q3 and Q4 to lean into digital   outreach and direct mail. These channels have been our most   efficient and successful at driving store traffic. All of our   digital programs, including social media, search and CRM drive   positive returns. With our Insider Perks loyalty program doubling   its membership in the last 12 months and reaching more than 5   million members by second anniversary, we continue to focus on   increasingly targeted messaging.",
    "Within our direct mail program, our Fall LookBook and Black   Friday mailers are reaching more households and we're increasing   our emphasis on recent movers. From a merchandising standpoint,   we recently rolled out a new program we call EDLP Plus, which is   intended to both highlight our already low product prices and   improve the sell through of our planned markdowns. We're bundling   our weekly flash buying deals into our existing twice annual   clearance into a new strategy. EDLP [Phonetic] Plus will feature   a longer and more category focused customer event, execute on a   rolling 12 month basis. This process enables store teams focus on   one department at a time, refreshing it and consolidating   markdowns before marketing the exciting event to our   customers.",
    "While it's still very early on, our pilot categories have   demonstrated improvements in both comp sales and clearance sell   through. In the medium term, we're also digging into   opportunities to further refine our business and drive comp store   growth, such as evaluating our mix of good, better and best   products, exploring price -- product price point analysis and   customer sensitivity. And elevating the quality in lower priced   items to increase our value proposition. We also recognize that   customers continue to shift dollars online. Therefore, we   continue to build our omnichannel capabilities that leverage our   200 plus stores across nearly 40 states. We're on track to roll   out our buy-online-pickup-in-store test in this Q4. And based on   the results, we could launch it in a broader group of stores by   the end of fiscal 2021. These and other initiatives are part of a   multi quarter journey to reaccelerate our comp performance and we   will update you on learnings and solutions as we generate further   insights.",
    "Our comp performance this year has been below our own   standards, but it motivates us to be better and do better. Our   commitment to generate long term shareholder value is unwavering.   At its core, we have a great business model. We grew from $364   million to nearly $1.2 billion in sales over six years, while   delivering very healthy profit margins at both the store and   consolidated levels.",
    "Our concept is highly differentiated with the customer value   proposition focused on the dual pillars of largest selection and   lowest prices. We showcase more than 50,000 unique and constantly   refreshing items in a big box format with over 70% of our   products being private label or exclusive to At Home and over 80%   of our net sales at full price. We offer unmatched breadth and   depth in a one stop self-help shopping experience that gives the   customer the opportunity to see, touch and feel the product. We   enable customers to easily mix and match and truly make their   house At Home. Utilizing our low cost structure, we're committed   to being the low price leader in the marketplace. The At Home   brand is only five years old and with only 17% unaided brand   awareness and a $65 average basket, the upside opportunity   remains significant.",
    "Our new stores have produced strong returns over the past six   years as well, and we continue to see significant whitespace   opportunities across the country. Our real estate strategy is   both flexible and opportunistic, enabling us to move into second   generation boxes, as well as new builds. Because of the ample   supply and low demand, on average, we pay $6 per square foot in   rent, which helps us deliver strong adjusted EBITDA margins. On   average, our new stores pay back in less than two years and   generate more than $2 million in first year store adjusted --   store level adjusted EBITDA. Our older stores are strong as   well.",
    "In Q2, stores older than three years delivered positive comps   above the chain average. Our pipeline of new stores remain as   attractive as ever. In fact, we've already approved all of our   locations for fiscal 2021. We have the potential to nearly triple   our existing footprint and the future is bright as we drive   toward our long term goal of 600 plus stores. With our long term   growth in mind, over the past three months we've been thoroughly   analyzing our business, benchmarking ourselves and our   performance and reflecting upon shareholder feedback. As a   result, we reasseded our growth rate. Going forward, our priority   is to balance store expansion and profitability alongside   leverage improvement and free cash flow.",
    "Compared to our existing long term target of high teens unit   growth rate, we will now target 10% store growth in each of the   next three years. Through that balanced approach, we expect to   strengthen our balance sheet and generate positive free cash   flow. The change will begin with fiscal 2021 and flow through the   rest of our financial targets, which Jeff will discuss in greater   detail.",
    "Our executive team and board of directors are tightly aligned   and moderating our store growth rate is the best way to improve   liquidity, reduce leverage, ensure consistent growth and   ultimately drive long term shareholder value. Our growth rate may   be changing, our growth strategy is not. We continue to have full   confidence in the strength of our business model and our long   term potential of at least 600 stores.",
    "With that, I'd like to turn the call over to our CFO, Jeff   Knudson, who will update you on our Q2 performance and our   outlook for Q3 and fiscal 2020. Jeff?",
    " Jeffrey R. Knudson    --   Chief Financial Officer ",
    "Thank you, Lee. And good afternoon, everyone. As a reminder,   additional information is available in our earnings release,   which is posted to our Investor Relations website and which   includes reconciliations illustrating our non-GAAP results as if   the new lease accounting standard had been effective in fiscal   2019.",
    "Our discussion of adjusted metrics on the rest of this call   will be on a lease adjusted basis with fiscal 2019 results recast   to illustrate the standards impact. I would also refer you to   investor presentation we posted, which includes the updated   growth targets that I will discuss shortly. First, I'll address   our second quarter results. Our top line grew 18.7% to $342.3   million, which was in line with our guidance. Comparable store   sales decreases 0.4%, also within our expectations, given   unseasonably cold and wet weather at the beginning of May. On a   two year stack basis, comps of 2.4% accelerated during the   quarter and improved 230 basis points over Q1.",
    "Second quarter gross profit increased 3.1% to $100.4 million,   while gross margin rate decreased to 29.3%. Adjusting for the new   lease standard, gross margin decreased 360 basis points, at the   low end of our outlook. As expected, gross margin was impacted by   incremental markdowns, the operating costs of our second   distribution center, which opened earlier this year, increased   occupancy costs from sale leaseback transactions executed in the   last 12 months and fixed cost deleverage on lower year-over-year   sales growth.",
    "We have been executing additional markdowns in fiscal '20 to   sell through clearance products, and we are pleased with the   amount of patio and garden inventory we cleared during Q2. We   significantly reduced inventory growth from 44.1% in Q1 to 31.7%   in Q2. And we continued to expect sequential improvement in Q3.   We remain on track to have inventory growth in line with sales in   the fourth quarter. Adjusted SG&A of $75.4 million improved   50 basis points to 22% of net sales. We expect that a flat   adjusted SG&A rate heading into the quarter, but timing of   store labor cost drove favorability that will reverse in Q3. As a   result of these factors, we delivered a 6.8% adjusted operating   margin above our outlook of 6.2% to 6.6%.",
    "Q2 adjusted operating income declined to $23.2 million,   interest expense increased to $8.2 million due to increased   borrowings to support our growth and higher interest rates. We   recognize $3.2 million of income tax expense in the second   quarter with a 23.5% adjusted effective tax rate. In Q2 last   year, our adjusted effective tax rate of 9.1% included $3.8   million of tax benefit related to non IPO stock based awards. In   total, we are pleased to deliver $0.18 of pro forma adjusted EPS   in the second quarter of fiscal '20. From a liquidity standpoint,   we executed a $75 million accordion feature on our asset based   lending facility in June and ended the quarter with total   liquidity of $146.2 million.",
    "Looking to the back half of this year, we are reiterating our   EPS guidance for the full year, but expect to see a couple of   timing shifts between the quarters. As I mentioned earlier, we   shifted about $0.02 of store labor expense from Q2 into Q3 to   support the timing of freight processing and other store   projects. Based on the current sell through rates, we also   estimate that planned everyday markdowns representing about $0.02   of EPS drag will pull forward into Q3 from Q4.",
    "As we have previously shared, Q4 will generate the majority of   our fiscal '20 earnings per share due to timing dynamics around   the second DC's rollout, new store pre opening costs, non product   cost and gross margin and the lapping of significant tax benefits   from stock award exercises in the first three quarters of fiscal   '19.",
    "Drilling down to our third quarter guidance, we plan to open   12 gross and nine net new stores and generate $312 million to   $317 million in net sales, representing 17% to 19% growth   year-over-year. Our comp store sales outlook is down 2.5% to down   0.5%. Last year our 5.2% Q3 comp was the strongest of fiscal 2019   and included an estimated 120 basis point tailwind from lapping   hurricanes in the prior year. Adjusting for last year's hurricane   tailwind, on a two year basis our Q3 comp outlook is a positive   1.5% to 3.5%. We are assuming adjusted operating margins of 1.9%   to 2.4% or lease adjusted decline of roughly 400 basis points at   the midpoint. Our outlook incorporates 110 basis points of second   DC cost, the markdowns I mentioned earlier and fixed cost   deleverage, primarily in occupancy. To a lesser extent, we expect   margin headwinds from the higher freight rates and tariff impacts   we flagged last quarter and increased occupancy costs from sale   leaseback transactions.",
    "All in, we expect an adjusted net loss of $1.0 million to $2.5   million, assuming approximately 65 million shares outstanding,   our Q3 outlook calls for a pro forma adjusted loss of $0.01 to   $0.04 per share. For the full year, we are flowing through our Q2   top line results and the continued performance of our new and non   comp stores as we narrow our fiscal 2020 sales outlook. We now   expect net sales in a range of $1.373 billion to $1.388 billion,   still representing 18% to 19% growth.",
    "Our updated full year comp store sales outlook of down 1.5% to   a positive 0.5% incorporates current trends, as well as a range   of outcomes for Q4. Our guidance implies an acceleration in the   two year comp stat trends from the first half to the second half   of the year due to weather improvements, our refined marketing   spend and our EDLP Plus initiative. That said, we are pleased to   reaffirm our outlook for gross margin, adjusted operating margin   and pro forma adjusted EPS. We continue to expect adjusted   operating margins of 6.6% to 6.9% in fiscal 2020, which   incorporate 80 to 90 basis points of net margin headwind from the   second DC, along with the impact of markdowns, higher freight   rates, some fixed cost deleverage and tariffs that have been   announced to date.",
    "We are lowering our fiscal '20 interest expense outlook to   $32.5 million due to reduced interest rates. We expect a slightly   higher adjusted effective tax rate at 23.5% and a slightly lower   diluted share count of approximately 65 million shares. With   adjusted net income of $44 million to $48 million, our pro forma   adjusted EPS outlook of $0.67 to $0.74 remains unchanged. Our   fiscal 2020 net capital outlook is $65 million lower to reflect   an additional sale leaseback transaction that we expect to   execute this fall, as well as a reduction in capital spend for   planned fiscal 2021 openings. We continue to pursue efforts to   reduce our capital outlay and improve our free cash flow profile   by exploring build-to-suit and buy-to-suit financing   alternatives, executing on capital reductions in our second   generation sites through value engineering, strategic procurement   and a refined market-by-market approach, while also focusing on   working capital improvements.",
    "As Lee touched upon in his opening remarks, after a thorough   analysis of our strategic priorities, we are refining our vision   with a heightened focus on delivering positive free cash flow   next year. As a result, we plan to moderate our new store growth   rate to 10% in each of the next three years to enable us to   improve the balance of new store growth and profitability on the   one hand, with free cash flow and reduced leverage on the other.   A reduced growth rate has that added benefit of mitigating the   cannibalization that is a byproduct of our opportunistic real   estate model and creating bandwidth for our teams to lean into   critical organic initiatives, including the omnichannel   opportunities, direct sourcing penetration and enhancing our   marketing and loyalty programs.",
    "Our revised top and bottom line growth targets for fiscal '21   through '23 are as follows. New store growth of 10% and same   store sales growth of 1% to 2%, translating to overall net sales   growth of low double digits and adjusted EPS growth in the low to   mid teens. Enabled by these new assumptions, we are establishing   targets for our balance sheet for the first time as a public   company. I shared earlier this year that we plan to be free cash   flow neutral in fiscal 2021. We now plan to drive positive free   cash flow in fiscal '21 and beyond. We also expect sequential   annual improvement in our adjusted leverage ratio with an   ultimate target of less than two and a half times.",
    "We feel that emphasizing free cash flow, enhancing our   liquidity and strengthen our balance sheet has enabled by our   lower growth rate are key to supporting our initiatives and   driving consistent shareholder returns over the long term. The   depth of our pipeline, strong productivity of our new and older   stores and the strategic opportunities we have in both   merchandising and marketing continue to give us confidence in our   business model and a longer term potential for 600 plus   stores.",
    "With that, I'll now turn it back over to Lee for his final   remarks.",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "Thank you, Jeff. In summary, our business model is strong and   we are well positioned to capture market share and capitalize on   a significant whitespace opportunity. In the near term, we're   refining our marketing approach and leaning into growth   initiatives like our newly introduced EDLP Plus strategy to   reaccelerate comps and continue to grow total sales. The health   of our inventory continues to improve and we're excited about the   roll out of our buy-online-pickup-in-store test this year to   better enable us to meet our customer's needs, no matter how they   shop.",
    "I'd like to thank our team members for their continued hard   work and dedication to these initiatives as we grow our business.   Our focus isn't on delivering value for our team members, our   customers and ultimately our shareholders. Looking beyond fiscal   2020, we are confident that these growth initiatives, along with   a stronger balance sheet between store growth -- stronger balance   between store growth, profitability and free cash flow generation   are the right path forward to generating that long term value.   We're excited about the future for At home and look forward to   updating you on our progress in future quarters.",
    "Dana, please open the line for the questions.",
    " Operator ",
    "At this time, we'll be conducting a question-and-answer   session. [Operator Instructions] Our first question comes from   the line of Bradley Thomas with KeyBanc Capital Markets. Please   proceed with your question.",
    " Bradley Thomas    --   KeyBanc Capital Markets -- Analyst ",
    "Good afternoon and thanks for taking my question. I was hoping   we could just first talk about some of the recent trends that   you've seen in the business, you addressed this a bit in the   prepared remarks, Lee, but just curious how your assessment of   the state of the industry and the pace of your operations has   evolved as you reflect on another quarter that the industry   continues to experience some weakness here?",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "Sure, Brad. What I would say is, the marketplace feels   choppier, but that's the same as we saw in Q1. So no change from   what we experienced in Q1. The sector is seeing traffic   challenges, down 4% in Q2 and which was down 5% in Q1. So what   we're focused on is, what we can control. We're determined to get   our business back in shape and so we've been put a discerning eye   on our business. We've been working on offsets, we've adjusted,   as I mentioned, our marketing mix, we outlined and executed   already outlining and rolling out a EDLP Plus approach to   highlight the great prices we already have, because we are an   everyday low price leader. And also to get better sell through on   our clearing. We focus on inventory management, we're making   progress there and we've been investing in omnichannel and we're   excited about the launch of that in Q4.",
    "And as you noticed -- you may have noticed, we've maintained   the midpoint of our FY '20 sales outlook, which means our non   comp stores and our new stores are outperforming, which says   that, we're continuing to drive share and performing with these   new stores. And we are targeting positive comps to start in Q4   this year.",
    " Bradley Thomas    --   KeyBanc Capital Markets -- Analyst ",
    "That's helpful. And then, I want to ask a follow up about the   decision to slow the pace of growth. Very clear what you're   trying to expect out of this. But I was hoping you can give a   little more color around how we should think about what the capex   levels may be next year with this slower pace of growth? And what   potential benefits, if any, we may see to margins next year,   given all the slower pace of growth?",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "Sure, Brad. I'll start and Jeff will finish on that. We've   been analyzing our business and we've spent a lot of time   benchmarking our peers. How the high growth retailers set up   their business for a sustained growth and profitability, which is   our intention as well and we've also been listening and talking   to investors. And we clearly see from our benchmarking that   investors and more importantly, from our peer group, we're seeing   that a more balanced approach is the approach for sustainable   high growth retailers. And so by focusing on not only growth and   profitability, which we have strong profitability, even in our   worst year, we've got great profit margins. We need to balance   that with delivering -- being free cash flow positive to pay and   fund that growth and reduce our leverage to deliver long term   shareholder value. And so that's what we've done by moderating   our growth, the capital impact is -- Jeff, you want to cover   this.",
    " Jeffrey R. Knudson    --   Chief Financial Officer ",
    "Yeah. So you obviously saw a change in our fiscal '20 capex   guidance, there was a gross reduction of $65 million on the net   side with $50 million in sale leaseback and then pulling out $15   million as it relates to the fiscal '21 vintage. As it relates to   next year, we still do have a strong pipeline, we have over 15   stores that are currently owned. So we will be able to continue   our sale leaseback cadence as we move into next year. And as we   get further into this year, we'll provide more specifics on the   capex guidance for fiscal '21. As it relates to the operating   margins, there's obviously a lot of dynamics in play as it   relates to fiscal '21, we do have some tailwinds next year as it   relates to lower markdowns. We'll start to see efficiencies from   the second distribution center, as well as direct sourcing. But   obviously, with the tariff wrap and the elevated tariffs that   were just announced a week and a half ago, we also had some   freight rate impacts as well as the sale leaseback. So, as it   relates to fiscal '21 margins, the tariff situation is very fluid   right now. We're still working, as Lee said in his prepared   remarks, to mitigate the dollar impact of those tariffs. And as   that plays out over the next couple of weeks and months, we'll   get back to you later in the year with specifics round next year   margins.",
    " Bradley Thomas    --   KeyBanc Capital Markets -- Analyst ",
    "That's helpful. Thank you very much.",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "Thanks, Brad.",
    " Operator ",
    "Our next question comes from the line of John Heinbockel with   Guggenheim Securities. Please proceed with your question.",
    " John Heinbockel    --   Guggenheim Securities -- Analyst ",
    "So, Lee, let me start with EDLP Plus. Is the current RUG   [phonetic] event an example of that? And then, when you think   about the execution of it, the idea that, I don't know, how many   times a year, but I don't know, multiple times a year and,   obviously, every quarter a category will be highlighted and   promoted for several weeks at a time? Is that the idea behind the   execution? And then is it sort of the reason that EDLP doesn't   kind of work as well in this space, because it just happens to be   a promotional space and you need to do that to generate customer   interest?",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "John, the EDLP Plus approach is a double down on everyday low   price, so it's not a departure from that, it give us credit for   what we already do, but also to enhance an emphasis around events   to highlight those categories themselves. So we started with our   home org event in the beginning of August, so this started back   in the beginning of August. So we did home org and we did   furniture and those were targeted events highlighting full priced   items, our flash findes and then also identifying and showing our   clearance department. They were preceded by department cleanups   for those departments. So our teams cleaned off the department,   made sure everything was priced appropriately, easy to shop and   then we had the organization event, then we had the furniture   event, now we have the RUG event. And the RUG event actually   matches up to an approach we're using now when you have retail --   retail sale time period, so think about Labor Day in fourth of   July and Memorial Day and Presidents Day those are highly   promotional. Those will be timed, we're going to be -- we're   going to lean a little bit into the promotion side, but not   change our model, but just highlight that. And then that'll be   for a short period time and then we'll roll back into the next   event as well. So that's going to be our model, you'll see that.   We're pleased with the performance against that on full price   selling, which is our primary emphasis and clearance of our   markdowns.",
    "We like that, but it's not a departure of the model, it's   actually just allowing us to actually freshen the store over   time. And you'll see starting in January the next level of this.   So we are piloting, refining it, getting it better and by -- once   you get out of Christmas, we'll be able to add another level of   EDLP plus and an in-store experience that'll show even stronger   the highlight of these product categories.",
    " John Heinbockel    --   Guggenheim Securities -- Analyst ",
    "Okay. Thanks. And then just long term sort of to tag on the   last question. When you look at the three year target, I don't   think, at least I always thought because next year is an extra   week and you get the recapture rate of some of this year's cost   pressures. The three year is not meant to be -- it's meant to be   a target, it's not meant to be a sort of an algo for each year.   Next year, I assume, would differ from that a bit. And then if I   think about your leverage target, it looks to me like you   probably need over that three year period to pay down somewhere   $2 million the 250 million of debt, again, it depends how fast   you grow EBITDA but that sort of -- $200 million plus, Jeff, is   that fair? Is that a fair target?",
    " Jeffrey R. Knudson    --   Chief Financial Officer ",
    "Yeah. It's close John. That's right.",
    " John Heinbockel    --   Guggenheim Securities -- Analyst ",
    "Okay.",
    " Jeffrey R. Knudson    --   Chief Financial Officer ",
    "But on the on the target...",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "The targets, we didn't think about those, so those -- we did   not factor in the 53 week next year, John, into those targets,   those are on a 52 week comparable basis. And we have thought   about those, as you know, longer term targets, but each year   operating within those parameters as well.",
    " John Heinbockel    --   Guggenheim Securities -- Analyst ",
    "Okay. Thank you.",
    " Jeffrey R. Knudson    --   Chief Financial Officer ",
    "Thanks, John.",
    " Operator ",
    "Our next question comes from the line of Daniel Hofkin with   William Blair. Please proceed with your question.",
    " Daniel Hofkin    --   William Blair -- Analyst ",
    "Good afternoon. I apologize if you answered this already, but   just as it relates to the tariff impact, which you talked about   is being not much for the list 4B for this year, given when   you'll have the product in. But can you characterize that for   next year? What that's likely to be based on what you know now?   And then I have a follow up question.",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "Yeah. From a tariff standpoint what we've said is, basically   list one, two, three obviously had 25 basis points baked into our   back half for those for less one, two, three at the 25% because   remember, our inventory turns slowly. And so it doesn't take it   through the turn of the inventory. List four is more weighted   toward seasonal product which -- that'll be in the stores   already, so we don't expect a material impact on FY '20. Now from   an FY '21, we've been working very closely with our supply   partners. We actually had -- we've met with 300 of our product   partners, not only in the US where we brought our top 100   suppliers in, but then we went to China, we went to Vietnam and   India and met with our product partners and product partners   summits and required them to come to those meetings, prepared to   discuss creative and practical solutions to offset these tariffs.   Now, this is obviously before the 5% incremental increase on top   of the 10% that we knew in list four. But they came back with   great plan, we've been working through those plans, we've also   told them that they had to eat list four, the cost of less four.   But then we've been -- so we've been working on a very   disciplined approach to mitigate the impact of our tariff. And I   would say, right now, it's too soon to give FY '21 margin   percent, but we're confident the EPS growth have outpacing sales   growth next year and that's incorporated the impact of those   tariffs going forward.",
    " Daniel Hofkin    --   William Blair -- Analyst ",
    "Okay. And then, as it relates to your comments before on the   question earlier about the overall environment. It's not really   clear that the consumer is spending last or spending less on   value. So it implies that there's some more competition. I'm just   curious where you think that's coming from and what -- how this   sort of the EDLP Plus strategy, how you think that will help more   going forward?",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "Sure. I would say that the promotional environment and the   competition is no different really than what we saw in Q1. So   it's not different, remember, it is different than it was a year   ago. So it's more promotional. And I would say, what we've found   too is that, we are -- we're not a high, low player. So we've   realized that since the marketplace is promotional we're not   getting credit for the low prices we already have. So this EDLP   plus program is really more to highlight the prices we have in   the store, both out of store and in-store more clearly to our   customer to be clear on our website, how our prices are lower   than the competition and expect to be lower than the competition.   And so, what we're trying to do is, highlight categories, be   clear about the price and then when there is a clearance customer   out there, to be a little bit more open and transparent in   inviting to our customer to go buy the clearance. We make it too   hard for them to find a clearance in our stores, we're trying to   make it easier for them to find it, buy it so we can sell through   faster. And that's how we're going to approach it. That allows us   to continue to have 80% of our sales at full price. That allows   us to be profitable and continue to grow and take share because,   by the way, the marketplace may be choppy, but we are taking   share. When we're growing 18%, 19% in a quarter where the   marketplace is going backwards, we're a share taker.",
    " Daniel Hofkin    --   William Blair -- Analyst ",
    "And where do you feel like -- Okay. So understood regarding   that, but will you be reducing your price's during sort of in a   pulsed way in line with when others run promotions, companies   that are not on an EDLP or that are more on a high, low type of   system?",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "No, I think what we're going to do is -- what we always do is,   we -- our prices are below other people's sales prices, they just   don't see it sometimes, they're not noticing it because there's a   lot of noise out there about the promotion or the ad and they   don't spend the time to go look at ours. And we don't make it   clear to them the value that we offer. So we're trying to make   sure our prices are sharp, we are focused on making sure we are   the lowest priced out there. And then, but at times where it is   highly promotional, we may have an offering that's more   consistent to what they have, which we were doing before, but may   not have been timed at the same time that they were doing theirs.   Until, for example, our RUG event that we're having right now is   an event that we bought into, we bought volume for a RUGs to   expect a higher velocity selling period. To then highlight that   value, while other people are talking about their offer. We have   arms. It's not the first time we've done a RUG offer, but it's   the first time we're doing it over Labor Day to get credit, while   other people are promotional as well. So it's just to sync up   with the industry at the time there doing that. But it's not   changing our model, it's just getting credit for what we're   already doing.",
    " Daniel Hofkin    --   William Blair -- Analyst ",
    "Okay. Thank you. Good luck.",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "Thank you.",
    " Operator ",
    "[Operator Instructions] Our next question comes from the line   of Jonathan Matuszewski with Jefferies. Please proceed with your   question.",
    " Jonathan Matuszewski    --   Jefferies -- Analyst ",
    "Great. Thanks for taking my questions. I guess just for the 3Q   guide, you said there is some soft industry traffic in 2Q. So   just curious kind of what your expectations are for 3Q? Are you   expecting industry traffic for the category to worsen, stay the   same or improve? And I guess, how have trends been shaping   quarter to date relative to your comp guidance range? Thanks.",
    " Jeffrey R. Knudson    --   Chief Financial Officer ",
    "Yeah. Jonathan, when we think about our copm trends going into   Q3, remember we do have a tough compare our of 52 from last year   that has the 120 basis points from the hurricane in fiscal '18.   So on a two year stack basis, those trends are pretty consistent   with where we ran in Q2. If you look at the midpoint, and with   that how -- so we don't see any dramatic shifts from a traffic   standpoint or moving into Q3. When we look at those traffic   trends that Lee talked about, and the down 4% Q2 off of 5% in Q1,   I would say that we are outpacing the industry from a traffic   standpoint and when you exclude the cannibalization in past, we   are happy with where our traffic is trending right now.",
    " Jonathan Matuszewski    --   Jefferies -- Analyst ",
    "Great. That's helpful. And then I guess just on the select   price increases, I know you mentioned you'd be doing them   surgically. If you could just elaborate there a bit they'd be   helpful? Anything you could share in terms of maybe just the   blended level of increases you're looking to take. I'm sure it   varies by category, but maybe just how much price you're looking   to pass on and how that level of increase compares relative to   what you're seeing the industry do. Thank you.",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "Sure. We comp shop every other week. Our teams has done their   Friday's comp shopping every other week, buy item to know what   the competition is doing from a price standpoint. So we're super   methodical about it. Our list one, two, three last year had no   meaningful financial impact on those price increases that we made   a surgical increases. We focus on the value proposition. We focus   on being the low price leader. We may see where there's an   opportunity to take price. We may decide to do it to monitor   where that price is. We may see where we actually need to   increase the quality to make sure the value is there. So we're   working on that. So we've been slow and very tactical to take   price. Some people have some questions around that approach after   Q1 with us, because we said we weren't going to take price just   yet, because I would tell you that goes against our model. We   need to be slow to take price because we need to be the low price   leader out there. And when we do take price, we do look at   offsetting margin dollar impact and the margin percent impact. So   -- and we -- and since Q1, the Q1 results were announced, we have   taken targeted price increases this past summer. But our goal   always is to maintain price leadership. And we're working with   our suppliers and we're using direct sourcing to continue to find   offsets in our supply chain to keep our prices low.",
    " Jonathan Matuszewski    --   Jefferies -- Analyst ",
    "And I guess, that's helpful. Just a quick follow up for those   select price increases that you have taken, have you seen any   material unit degradation?",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "On the list one, two, three that we had starting last year, we   have not, we've been able to protect the revenue on that, but I   would say, it's too soon on the most recent price increases.   We're just gonna keep watching them.",
    " Jonathan Matuszewski    --   Jefferies -- Analyst ",
    "Thank you.",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "Thanks, John.",
    " Operator ",
    "Our next question comes from the line of Chuck Grom with   Gordon Haskett . Please proceed with your question.",
    " Chuck Grom    --   Gordon Haskett -- Analyst ",
    "Good afternoon. Just on the second quarter gross margins.   Jeff, can you just unpack for us a little bit more granularity   the four negative factors that you called out? And then when we   look ahead to the third quarter, can you just hold our hands on   exactly what you're thinking the gross margin line?",
    " Jeffrey R. Knudson    --   Chief Financial Officer ",
    "Sure. So on the Q2 gross margins, again, they were in line   with our expectations, we had 85 basis points unfavorably from   the second DC. 50 basis points on sale leaseback, deleverage   within our occupancy that came in as expected and the remainder   was from markdowns and fixed costs deleverage on occupancy.   Again, we were pleased with the amount of inventory we were able   to move with those markdowns and the operating margins when you   exclude the timing of the store labor came in, again, within our   guided range for Q2.",
    "Moving to the full year, again, we reiterated our full year   gross margin and operating margin outlook. There is some timing   element on those markdowns between Q4 and Q3, but our full year   outlook remains the same from the last call.",
    " Chuck Grom    --   Gordon Haskett -- Analyst ",
    "Any color for the third quarter, specifically on the gross   margin line. I know, you gave an operating margin target. Just   wondering how you -- how we should get there in terms of those   components that you just laid out for the second quarter?",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "Yeah. Tt's it's predominantly within the gross margin. There's   a little bit of SG&A benefit in Q3, but the vast majority   ends the same drivers, we've been talking about you do have the   introduction of the tariff impact in Q3 that wasn't in Q2, that   we had talked about in the last call, but it's the second   distribution center, it's the markdowns and it's the sale   leaseback and occupancy deleverage on the lower sales growth is   really the drivers.",
    " Chuck Grom    --   Gordon Haskett -- Analyst ",
    "Okay. That's helpful. And then when we think about next year,   it sounds like you're trying to set the table that some of the   the benefits you're going to see from cycling some of the   markdowns and distribution costs are going to be offset,   essentially by the tariff wrap. I mean, you probably don't want   to peg in operating margin target for next year, but should we   think about kind of flattish as what you guys are thinking of at   a preliminary rate at this point in time?",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "You know, Chuck, that's exactly why we didn't give an   operating margin. With the last tariff increases being announced   a week and a half ago and how we mitigate those, and again, we're   always trying to mitigate that dollar impact and not the rates   and how those dynamics are gonna play out between gross and   operating margins. We just need time to work through the process   that we've established over the last year to mitigate those   tariffs and we'll get back to you with more details on how we see   fiscal '21 margins playing out. But, again, I would reiterate   that we do feel good about the mid to low teens adjusted EPS   growth.",
    " Chuck Grom    --   Gordon Haskett -- Analyst ",
    "Okay. Great. Thanks for the color.",
    " Operator ",
    "Our next question comes from the line of Simeon Gutman with   Morgan Stanley. Please proceed with your question.",
    " Simeon Gutman    --   Morgan Stanley -- Analyst ",
    "Hi, Lee. Hey, Jeff. I wanted to ask about the sales   environment. If you look back to last six or so quarters, they   mostly been bumpy, there's been some reasonable reasons why   weather -- not enough seasonal merchandise, we had some Black   Friday bumpiness. So in Q3, you have a tough compare, which   you're lapping, Q4 I think the implied mid points around are   flat. So I just want to step back and try to diagnose what's   changing. Is it business moving online, you had a backdrop that   has gotten weaker. I think merchandising may have gotten stale, I   don't know if you did go as far as say that, store conditions,   etc. Just so we can try to establish some chain of what's going   to get better as we move back into next year?",
    " Jeffrey R. Knudson    --   Chief Financial Officer ",
    "Yeah. So I'll start with the implied comp for Q4 around. It's   slightly better than flat, Simeon, is where we are for Q4. We did   take with our Q2 results and the outlook for Q3 with that tougher   compare, we did take the full year down 50 basis points to the   prior guide of our full years down 1.5% to up 0.5%, that is   reflective of the current environment and the trends we're   seeing. We did say in the last call that we did see the two year   stack stabilizing as we move through the back half. When you look   at our Q2 results and then our Q3 guide, adjusted for the   hurricane impact that's in that two year stack, that's how it's   playing out and we have saw the weather impact in the first half   and -- to continue to drive traffic and improve our comp trends,   that's why we're going after the marketing initiatives that we   talked about, redirecting some of that spend as well as the time   that we've spent on the EDLP plus initiative. And then I'll let   Lee chime in.",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "Yeah. Simeon, for us, as you know, because you've been with us   now for -- not sure, over four or five years of talking about   this business and learning about this business and sharing back   and forth ideas. We've walked stores together. This is not a comp   store, it has never been a comp store. Now, obviously, we expect   of ourselves positive comps. So don't get me wrong, and we're not   pleased with our performance, I'm certainly not pleased with the   performance that we've delivered in Q1 and Q2. But I would tell   you, it's never been a comp story. We have new stores that come   in that are highly productive. They have no comp waterfall. So we   don't have that tailwind that other retailers have. We have to   get through it with blocking and tackling. And I actually have to   overcome the second year, which is a tougher year for us of a new   store. But I would say that -- and we've delivered positive comp   and we expect that of ourselves. The first half of this year was   a weather challenge and I would tell you now that we've been able   to stabilize our two year stacks. By the back half of the year,   those have come in toward this new guidance range of a one to two   comp. And that's we -- you should expect of us. And we're mindful   of the environment with that expectation as well, we've said it's   choppier, it was not choppy three years ago, four years ago. And   so now it's choppier, it's not necessarily about other factors   that you've mentioned, obviously, yes online is a factor, that's   been a factor for -- that's been in the business for six and a   half years. Obviously, we're working an online approach, we've   been doing that for four years now, we're now bringing our   buy-online-pickup- in-store, we've always said we're going to do   that e-commerce our way, which means let's do this profitably.   Other people don't. And so we're focused on that. And so we're   just mindful of our model, we're mindful of the environment, but   we expect positive comps, we expect positive comps for ourselves,   obviously, next year. And obviously, for the fourth quarter, the   midpoint of our Q4 expectation is a positive comp as well.",
    " Chuck Grom    --   Gordon Haskett -- Analyst ",
    "And my follow up, just two parts, they'll be unrelated, do you   need to speed up or do you want to speed up online any quicker   than the rough timetable that we've talked about, I think it's   buy-online-pickup-in-store through at some point to the end of   next year. And then the unrelated part, just some of the   merchandising changes that you've -- the business has embarked   on, a new person helping with trend, product, display. Can you   just walk through them and what you're seeing thus far with some   of the changes you've made?",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "Yeah. I'm excited about those. Let me start first with your   first question around our omnichannel approach. As you know,   first and foremost, it's always about the customer. And for us,   we continue to get research from our customer where the vast   majority of all sales in this category are still done in physical   brick and mortar stores and they're looking for price, selection   and see, touch and feel and that's what we offer in our store   today. And we feel we've got a very compelling offering, our EDLP   plus approach will help highlight our already existing great   prices and our selection. And then be able to highlight   categories and sell. We do know that customers are increasing   their spend online over the past number of years and we've been   on a multiyear journey, we've been thoughtful about this, other   people rushed way too fast and blew up their business on that.   We're not going to do that. We had a demand where four years ago,   we put our products online, we put a recommendation engine in   about a year and a half ago, we put all their inventory online   buy store this spring. So all of our stores have visibility buy   store for their inventory. So you can exactly see the item you   want and how much is in each particular store near your home.   We've added partners through that platform to be ready for a   buy-online-pickup-in-store. We've added our OMX [Phonetic]   partner and a credit card partner as well, so that we're ready   for that to do this test in Q4.",
    "As we see that perform we intend to then roll that out to a   number of stores on a larger scale by the middle of next year, by   the end of next year, we should have that fully built. And then   we're using this store as the basis of our omni business. And so,   you should expect as we look at it, what's what's the next   capability is same day delivery from store, because our stores   are warehouses, over 200 of them. So how do we get that to the   customer on the same day? And then how do you ship from store?   From those existing warehouses, using those existing inventory   pools that should help our inventory turn faster and meet our   customer expectations. And so that should allow us to continue to   deliver low prices to our customer and if [Indecipherable]   returns while preserving the treasure hunt approach for our   customer and still delivering profitability. So we're very   thoughtful about it. We don't -- I don't feel like we need to   pick up the pace, because when you go faster, sometimes you don't   execute as well. And you know us to be thoughtful and we're going   to do that and deliver a good outcome.",
    "Now on the merchandising part, I'm excited about the changes   and enhancements we've made in merchandising. Chad Stauffer is   our chief marchant, he has been in the seat for now three months.   He and I are completely aligned on our approach to EDLP Plus.   He's been with the company for over a year. He joined us about 18   months ago and ran the everyday business and the progress we're   seeing in everyday business afforded us the confidence to promote   him into the chief merchant role. And now he's running the whole   thing. The EDLP Plus was actually his and Ashley Sheetz, our   chief marketing officers co-developed idea and they're the ones   co-executing this. And I think they're doing a brilliant job of   planning it and putting the plans in place, executing thoughtful   tests and enhancing that program throughout the back half of this   year to see the full experience by our Q1. We've added and   enhance our trend department. We have our new head of trend and   design has been at West down Anthropologie, we're thrilled that   Christian and his efforts, he's just brilliant and we love his   work and the way that he's thinking about how do we take our   archetypes to the next level. He'll be actually previewing all of   that with our board just next week with our approach.",
    "So I like where we're taking trend, we're taking those trend   insites to each and every one of our departments for making sure   that we build the assortment plan based on what we're seeing in   trend and make sure that we have the most current and appropriate   styles in our assortment. And then we take this comp shopping   every other week to make sure our prices reflect where we need to   be. And then on top of that, you should know that we're -- we've   been adding members of our team to the inventory side to merch   planning, to help us better buy and better plan our inventories.   So we're sharper and smarter on their inventory investment, so we   don't get into the situations that we've had historically around   inventory to become better and better as a retailer.",
    " Simeon Gutman    --   Morgan Stanley -- Analyst ",
    "Thanks, Lee.",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "Thanks, Simeon.",
    " Operator ",
    "Our next question comes from the line of Curtis Nagle with   Bank of America. Please proceed with your question.",
    " Curtis Nagle    --   Bank of America -- Analyst ",
    "Good evening. Just a quick question on the changed   expectations on the lease back. So I think it was 75, now 125. I   guess what drove the changes, is that a pull forward from perhaps   next year or is it something else?",
    " Jeffrey R. Knudson    --   Chief Financial Officer ",
    "No, I would think about it as a preliminary step or migrating   step to our build to suit and buy to suit model. These are   actually gonna be a handful of stores that are all recent fiscal   year '20 openings and an opportunity. Typically we would say we   expect [Indecipherable] 12 months of operating performance and we   were able to do a handful of stores that all have opened within   the last quarter, so -- and this is -- with our track record of   excellent sale leaseback. This will allow us to transition more   fully next year to our build to suit and buy to suits on our   ground up sites.",
    " Curtis Nagle    --   Bank of America -- Analyst ",
    "Okay.",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "It reflects also, Curtis, just the confidence that our   partners on that side that we have in our business and also in   the stores themselves. They know our stores, they've owned a   number of them, we've worked with them for a number of years and   they feel comfortable to not wait the year. And we feel as well   comfortable not waiting the year, because our stores have been so   predictable right out of the gate.",
    " Curtis Nagle    --   Bank of America -- Analyst ",
    "Okay. That makes sense. Thanks very much for the   clarification.",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "Thanks, Curtis.",
    " Operator ",
    "Ladies and gentlemen, we have reached the end of the   question-and-answer session, and I would like to turn the call   back to Lee Bird for closing remarks.",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    "All right. Well, thank you, everyone, for joining us this   afternoon. We're excited about the opportunities in front of us   and the long term growth ahead. And we look forward to talking to   you in the coming days and weeks. Take care.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 59 minutes ",
    " Bethany Perkins Johns    --   Director of Investor Relations ",
    " Lewis L. Bird III    --   Chairman of the Board and Chief Executive Officer ",
    " Jeffrey R. Knudson    --   Chief Financial Officer ",
    " Bradley Thomas    --   KeyBanc Capital Markets -- Analyst ",
    " John Heinbockel    --   Guggenheim Securities -- Analyst ",
    " Daniel Hofkin    --   William Blair -- Analyst ",
    " Jonathan Matuszewski    --   Jefferies -- Analyst ",
    " Chuck Grom    --   Gordon Haskett -- Analyst ",
    " Simeon Gutman    --   Morgan Stanley -- Analyst ",
    " Curtis Nagle    --   Bank of America -- Analyst ",
    " More HOME analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than At Home Group   Inc.     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and At Home Group   Inc. wasn't one of them! That's right -- they think   these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:23:29"
}