{
  "url": "https://www.nasdaq.com/article/square-is-getting-a-lot-of-love-from-analysts-cm1207441",
  "title": "Square Is Getting a Lot of Love From Analysts - Nasdaq.com",
  "text": [
    " After its public debut in late 2015,   Square    (NYSE: SQ)  didn't take long to become something of a market   darling. The stock price soared 670% in just three short years,   as one of the top choices in the   war on cash    . Bears in the market eventually appeared and the stock lost   nearly half its value to   close out 2018    , though shares have since regained some of those losses. What caused the sell-off? A combination of insider stock sales   and the departure of CFO Sarah Friar   gave investors pause    . More recently, stock prices for the company behind the   eponymous Square card reader began to rebound, but then its   second-quarter earnings report    in late July put a damper on that. While the top and bottom lines   in the report exceeded expectations, management's lackluster   forecast sent the stock falling once again. These days, a number of analysts are saying the selling is   completely overdone and now is the time to buy Square.makeArticleAd();   Image source: Square.  Positive catalysts In August, Square recently made the decision to sell its   Caviar food-delivery service    for $410 million -- significantly higher than the $44.3 million i   t report    edly paid for the business. This gets the company out of a highly   competitive and low-margin market that wasn't part of its core   payments space. This week, MoffettNathanson analyst Lisa Ellis upgraded Square   to buy from neutral (hold), in response to \"a 24% sell-off in   Square stock over the past four weeks.\" Ellis is also encouraged   by the company's exit from what she describes as the \"fiercely   competitive food delivery market,\" allowing Square to dedicate   resources to its core business. \"The divestiture will free   up investment dollars for Square to pour into its core seller and   consumer businesses.\" Ellis also believes Square has a \"viable   long-term business model\" by positioning the Cash App as an   alternative to traditional checking accounts. Also this week, SunTrust Robinson Humphrey analyst Andrew   Jeffrey upgraded the stock to buy from hold, with an $80 price   target, because Square is investing heavily in point-of-sale card   readers geared toward \"large, inventory-intensive retailers where   we believe it currently competes poorly.\" Jeffrey went on to   point out that the robust growth from larger businesses is   \"highly concentrated among a relatively small number of   super-successful sellers,\" giving Square plenty of potential   growth. Jumping on the bandwagon Late last month, Deutsche Bank analyst Bryan Keane pounded the   table on Square, calling its \"recent stock weakness ... a good   buying opportunity. ... We don't believe there has been any   change to the company's robust fundamentals and long-term   outlook.\" One potential driver is Square's Cash App. Investors may not   fully appreciate the enormous potential from Square's   consumer-facing business, which competes directly with   PayPal    (NASDAQ: PYPL) wunderkind Venmo. Square Cash has grown more   quickly than many anticipated, and Keane believes it \"should   carry strong organic growth for the company over the next several   years.\"   Image source: Square.  The devil's in the details The sale of Caviar will allow Square to focus exclusively on   the two factors that will drive its future growth -- its   consumer-facing Cash App and the larger sellers fueling its   payments empire. On the company's   second-quarter conference call    , Square CEO Jack Dorsey pointed out, \"In just three years, Cash   App revenue grew from basically $0 to $135 million [this   quarter], excluding bitcoin.\" While small businesses accounted for the bulk of Square's   early success, larger sellers now supply the majority of its   growth. Mid-market sellers, or those with more than $0.5 million   in gross payment volume (GPV), are the largest cohort for Square,   making up more than half of the company's GPV, and are also   growing at the fastest clip, 45% year over year. The story's the thing Square's expansion has been nothing short of phenomenal over   the past several years, which has undoubtedly led to an   inevitable slowing of the company's breakneck growth rate. That   said, the payments specialist has a long runway ahead, and   investors would do well to remember that stock returns --   particularly during the early stages of a company's evolution --   will come in fits and starts. Failing to match Wall Street's expectations won't have any   impact on the company's long-term results. Square is doing just   fine -- and these analysts might be onto something.   10 stocks we like better than Square       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Square wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Danny Vena      owns shares of PayPal Holdings and Square. The Motley Fool owns     shares of and recommends PayPal Holdings and Square. The Motley     Fool has the following options: short September 2019 $70 puts     on Square and short October 2019 $97 calls on PayPal Holdings.     The Motley Fool has a     disclosure policy      .  ",
    "After its public debut in late 2015,   Square    (NYSE: SQ)  didn't take long to become something of a market   darling. The stock price soared 670% in just three short years,   as one of the top choices in the   war on cash    . Bears in the market eventually appeared and the stock lost   nearly half its value to   close out 2018    , though shares have since regained some of those losses.",
    "What caused the sell-off? A combination of insider stock sales   and the departure of CFO Sarah Friar   gave investors pause    . More recently, stock prices for the company behind the   eponymous Square card reader began to rebound, but then its   second-quarter earnings report    in late July put a damper on that. While the top and bottom lines   in the report exceeded expectations, management's lackluster   forecast sent the stock falling once again.",
    "These days, a number of analysts are saying the selling is   completely overdone and now is the time to buy Square.",
    "  Image source: Square. ",
    "Image source: Square.",
    "In August, Square recently made the decision to sell its   Caviar food-delivery service    for $410 million -- significantly higher than the $44.3 million i   t report    edly paid for the business. This gets the company out of a highly   competitive and low-margin market that wasn't part of its core   payments space.",
    "This week, MoffettNathanson analyst Lisa Ellis upgraded Square   to buy from neutral (hold), in response to \"a 24% sell-off in   Square stock over the past four weeks.\" Ellis is also encouraged   by the company's exit from what she describes as the \"fiercely   competitive food delivery market,\" allowing Square to dedicate   resources to its core business. \"The divestiture will free   up investment dollars for Square to pour into its core seller and   consumer businesses.\" Ellis also believes Square has a \"viable   long-term business model\" by positioning the Cash App as an   alternative to traditional checking accounts.",
    "Also this week, SunTrust Robinson Humphrey analyst Andrew   Jeffrey upgraded the stock to buy from hold, with an $80 price   target, because Square is investing heavily in point-of-sale card   readers geared toward \"large, inventory-intensive retailers where   we believe it currently competes poorly.\" Jeffrey went on to   point out that the robust growth from larger businesses is   \"highly concentrated among a relatively small number of   super-successful sellers,\" giving Square plenty of potential   growth.",
    "Late last month, Deutsche Bank analyst Bryan Keane pounded the   table on Square, calling its \"recent stock weakness ... a good   buying opportunity. ... We don't believe there has been any   change to the company's robust fundamentals and long-term   outlook.\"",
    "One potential driver is Square's Cash App. Investors may not   fully appreciate the enormous potential from Square's   consumer-facing business, which competes directly with   PayPal    (NASDAQ: PYPL) wunderkind Venmo. Square Cash has grown more   quickly than many anticipated, and Keane believes it \"should   carry strong organic growth for the company over the next several   years.\"",
    "  Image source: Square. ",
    "Image source: Square.",
    "The sale of Caviar will allow Square to focus exclusively on   the two factors that will drive its future growth -- its   consumer-facing Cash App and the larger sellers fueling its   payments empire.",
    "On the company's   second-quarter conference call    , Square CEO Jack Dorsey pointed out, \"In just three years, Cash   App revenue grew from basically $0 to $135 million [this   quarter], excluding bitcoin.\"",
    "While small businesses accounted for the bulk of Square's   early success, larger sellers now supply the majority of its   growth. Mid-market sellers, or those with more than $0.5 million   in gross payment volume (GPV), are the largest cohort for Square,   making up more than half of the company's GPV, and are also   growing at the fastest clip, 45% year over year.",
    "Square's expansion has been nothing short of phenomenal over   the past several years, which has undoubtedly led to an   inevitable slowing of the company's breakneck growth rate. That   said, the payments specialist has a long runway ahead, and   investors would do well to remember that stock returns --   particularly during the early stages of a company's evolution --   will come in fits and starts.",
    "Failing to match Wall Street's expectations won't have any   impact on the company's long-term results. Square is doing just   fine -- and these analysts might be onto something.",
    "  10 stocks we like better than Square       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Square wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Square       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Square wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Danny Vena      owns shares of PayPal Holdings and Square. The Motley Fool owns     shares of and recommends PayPal Holdings and Square. The Motley     Fool has the following options: short September 2019 $70 puts     on Square and short October 2019 $97 calls on PayPal Holdings.     The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:48:56"
}