{
  "url": "https://www.nasdaq.com/article/why-now-may-be-a-great-time-to-buy-baidu-cm1208156",
  "title": "Why Now May Be a Great Time to Buy Baidu - Nasdaq.com",
  "text": [
    "  Baidu    (NASDAQ: BIDU) could be one of the best bargains out there right   now. Although the stock has struggled this year, this could be a   great time to add it to your portfolio. Here's why. The stock is dirt cheap Baidu has fallen by more than 30% in 2019 after an   abysmal first quarter    when the report of its first loss since going public in 2005   spooked investors. As a result of the decline, the stock has   become an appealing value buy, trading at only 8 times its   earnings and a price-to-book multiple of only 1.5. Those numbers   would be considered low for bank stocks, let alone a   tech stock    like Baidu, which saw its sales grow by more than 20% last fiscal   year. Investors buying the stock at around $100 would be getting a   bargain, especially when you consider that just a year ago, it   was trading at more than double that price.makeArticleAd();   IMAGE SOURCE: BAIDU.  Back in the black       The bad news for Baidu is that the revenue growth has slowed   significantly this year. In Q2, sales were up just 1% and, in   U.S. dollars, were actually down from the previous year. However,   those figures still came in above analyst expectations. More   importantly, Baidu found its way back into the black with profits   up to $353 million for the quarter. While this was significantly   down from the prior year, the good news is that the company was   able to bounce back after a disappointing loss in Q1. Many more ways to grow Another big positive noted during the most recent quarter was   that activity on Baidu's app has been on the rise. Daily active   users on the mobile platform reached 188 million in June 2019, an   increase of 27% from the prior year. Growth metrics like that can   translate into a lot of improvement in the top line down the   road. Although it's a far cry from the      1.59 billion daily active users    who use   Facebook    , it gives you an idea of the significant amount of potential   growth opportunity Baidu still has in the Chinese market. As more users log on to the app and use Baidu's services,   there's more potential for the company to make money. Its voice   assistant, DuerOS, has been installed on more than 400 million   devices and has received more than 3.6 billion monthly queries   based on the company's most recent numbers. Often seen as Baidu's   version of Alexa, DuerOS's suite of software developer kits,   APIs, and turnkey solutions help manufacturers integrate Baidu's   voice platform into smart speakers, refrigerators, washing   machines, and more. It too could fuel a lot of growth for the   company in the future, especially as adoption rates continue to   climb. Bottom line Baidu may be struggling, but with a strong and growing user   base, all it needs is one big product to help generate sales   growth, and that could still prove to be DuerOS. There's still   lots of potential, especially in a country like China, where   Baidu has barely scratched the surface in terms of potential   users. It may take some time to see sales numbers improve, but given   the low price, there isn't a whole lot of risk here. If nothing   else, Baidu could offer investors a cheap way to diversify their   portfolios by tapping into a huge Chinese market.   10 stocks we like better than Baidu       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Baidu wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       Randi Zuckerberg, a former director of market development     and spokeswoman for Facebook and sister to its CEO, Mark     Zuckerberg, is a member of The Motley Fool's board of     directors.     David Jagielski      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Baidu and Facebook. The Motley     Fool has a     disclosure policy      .  ",
    " Baidu    (NASDAQ: BIDU) could be one of the best bargains out there right   now. Although the stock has struggled this year, this could be a   great time to add it to your portfolio. Here's why.",
    "Baidu has fallen by more than 30% in 2019 after an   abysmal first quarter    when the report of its first loss since going public in 2005   spooked investors. As a result of the decline, the stock has   become an appealing value buy, trading at only 8 times its   earnings and a price-to-book multiple of only 1.5. Those numbers   would be considered low for bank stocks, let alone a   tech stock    like Baidu, which saw its sales grow by more than 20% last fiscal   year.",
    "Investors buying the stock at around $100 would be getting a   bargain, especially when you consider that just a year ago, it   was trading at more than double that price.",
    "  IMAGE SOURCE: BAIDU. ",
    "IMAGE SOURCE: BAIDU.",
    "The bad news for Baidu is that the revenue growth has slowed   significantly this year. In Q2, sales were up just 1% and, in   U.S. dollars, were actually down from the previous year. However,   those figures still came in above analyst expectations. More   importantly, Baidu found its way back into the black with profits   up to $353 million for the quarter. While this was significantly   down from the prior year, the good news is that the company was   able to bounce back after a disappointing loss in Q1.",
    "Another big positive noted during the most recent quarter was   that activity on Baidu's app has been on the rise. Daily active   users on the mobile platform reached 188 million in June 2019, an   increase of 27% from the prior year. Growth metrics like that can   translate into a lot of improvement in the top line down the   road. Although it's a far cry from the      1.59 billion daily active users    who use   Facebook    , it gives you an idea of the significant amount of potential   growth opportunity Baidu still has in the Chinese market.",
    "As more users log on to the app and use Baidu's services,   there's more potential for the company to make money. Its voice   assistant, DuerOS, has been installed on more than 400 million   devices and has received more than 3.6 billion monthly queries   based on the company's most recent numbers. Often seen as Baidu's   version of Alexa, DuerOS's suite of software developer kits,   APIs, and turnkey solutions help manufacturers integrate Baidu's   voice platform into smart speakers, refrigerators, washing   machines, and more. It too could fuel a lot of growth for the   company in the future, especially as adoption rates continue to   climb.",
    "Baidu may be struggling, but with a strong and growing user   base, all it needs is one big product to help generate sales   growth, and that could still prove to be DuerOS. There's still   lots of potential, especially in a country like China, where   Baidu has barely scratched the surface in terms of potential   users.",
    "It may take some time to see sales numbers improve, but given   the low price, there isn't a whole lot of risk here. If nothing   else, Baidu could offer investors a cheap way to diversify their   portfolios by tapping into a huge Chinese market.",
    "  10 stocks we like better than Baidu       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Baidu wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Baidu       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Baidu wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " Randi Zuckerberg, a former director of market development     and spokeswoman for Facebook and sister to its CEO, Mark     Zuckerberg, is a member of The Motley Fool's board of     directors.     David Jagielski      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Baidu and Facebook. The Motley     Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 12:05:57"
}