{
  "url": "https://www.nasdaq.com/article/kilroy-realty-prices-senior-notes-at-99878-to-raise-4952m-cm1207225",
  "title": "Kilroy Realty Prices Senior Notes at 99.878%, To Raise $495.2M - Nasdaq.com",
  "text": [
    "  Kilroy Realty Corporation KRC  has announced the pricing of a public note offering through its operating partnership, Kilroy Realty, L.P. The offering of 3.050% senior notes, aggregating $500 million, has been priced at 99.878% of the principal amount. The securities, set to mature in 2030, will pay semi-annual interest on Feb 15 th   and Aug 15 th   of each year for the time period of Feb 15, 2020, through Feb 15, 2030. The notes offer a yield to maturity of 3.064%. The offering, anticipated to close on Sep 17, is conditional to the satisfaction of customary closing norms. Net proceeds from the offering, after deducting underwriting discount and the company's estimated expenses, will be roughly $495.2 million. This will likely be used for general corporate purposes, including funding of development projects, acquisition of land and properties as well as reducing outstanding debt balances under the operating partnership's term loan and revolving credit facility. The company intends to use the remaining proceeds in temporary investments such as marketable securities. Notably, by paying down its debt obligations, this offering is likely to provide financial flexibility to the company. In addition, it reflects the company's focus to address its financial obligations in an efficient way.  The current low interest-rate environment has encouraged a number of REITs to tap the debt market, recently. As for Kilroy Realty, the note offering will likely improve its liquidity profile, and provide it a strong footing to pursue strategic acquisitions and fund pending development projects. In fact, in its second-quarter earnings release, the company announced anticipated development spending of around $250-$300 million for 2019. Amid solid fundamentals of the West Coast real estate markets, Kilroy Realty's development plans seem apt.  Additionally, the record-length economic expansion cycle, steadily low-unemployment rates and modest wage improvement have fueled disciplined growth for the national office market as well as office landlords. Further, continued job creation in office-using sectors is driving leasing activity and absorption levels for Kilroy Realty. Hence, focus to strengthen its office portfolio through acquisitions and developments is a strategic fit. However, large lease expirations in the first half of the year have impacted cash net operating income (NOI). Although it is expected to improve in the upcoming quarters, management anticipates cash NOI to remain flat for full-year 2019.  Currently, Kilroy Realty carries a Zacks Rank #3 (Hold). Over the past three months, shares of the company have gained 2.8% as compared with the industry  's growth of 4.3%.      Top Picks  OUTFRONT Media Inc. OUT  currently sports a Zacks Rank of 1 (Strong Buy). The Zacks Consensus Estimate for 2019 funds from operations (FFO) per share has been revised marginally upward to $2.34 over the past month. You can see   the complete list of today's Zacks #1 Rank stocks here  .  Crown Castle International Corp. CCI  holds a Zacks Rank of 2 (Buy), at present. The Zacks Consensus Estimate for the current-year FFO per share remained unchanged at $5.92 in the past month. Extra Space Storage Inc EXR  is another Zacks #2 Ranked company, presently. The Zacks Consensus Estimate for the ongoing year's FFO per share has been revised marginally upward to $4.86 in a month's time. Note:  Anything related to earnings presented in this write-up represent funds from operations (FFO) - a widely used metric to gauge the performance of REITs.   Biggest Tech Breakthrough in a Generation makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Crown Castle International Corporation (CCI): Free Stock Analysis Report   Extra Space Storage Inc (EXR): Free Stock Analysis Report   Kilroy Realty Corporation (KRC): Free Stock Analysis Report   OUTFRONT Media Inc. (OUT): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Kilroy Realty Corporation KRC  has announced the pricing of a public note offering through its operating partnership, Kilroy Realty, L.P. The offering of 3.050% senior notes, aggregating $500 million, has been priced at 99.878% of the principal amount.",
    "The securities, set to mature in 2030, will pay semi-annual interest on Feb 15 th   and Aug 15 th   of each year for the time period of Feb 15, 2020, through Feb 15, 2030. The notes offer a yield to maturity of 3.064%. The offering, anticipated to close on Sep 17, is conditional to the satisfaction of customary closing norms.",
    "Net proceeds from the offering, after deducting underwriting discount and the company's estimated expenses, will be roughly $495.2 million. This will likely be used for general corporate purposes, including funding of development projects, acquisition of land and properties as well as reducing outstanding debt balances under the operating partnership's term loan and revolving credit facility. The company intends to use the remaining proceeds in temporary investments such as marketable securities.",
    "Notably, by paying down its debt obligations, this offering is likely to provide financial flexibility to the company. In addition, it reflects the company's focus to address its financial obligations in an efficient way. ",
    "The current low interest-rate environment has encouraged a number of REITs to tap the debt market, recently. As for Kilroy Realty, the note offering will likely improve its liquidity profile, and provide it a strong footing to pursue strategic acquisitions and fund pending development projects. In fact, in its second-quarter earnings release, the company announced anticipated development spending of around $250-$300 million for 2019. Amid solid fundamentals of the West Coast real estate markets, Kilroy Realty's development plans seem apt. ",
    "Additionally, the record-length economic expansion cycle, steadily low-unemployment rates and modest wage improvement have fueled disciplined growth for the national office market as well as office landlords. Further, continued job creation in office-using sectors is driving leasing activity and absorption levels for Kilroy Realty. Hence, focus to strengthen its office portfolio through acquisitions and developments is a strategic fit.",
    "However, large lease expirations in the first half of the year have impacted cash net operating income (NOI). Although it is expected to improve in the upcoming quarters, management anticipates cash NOI to remain flat for full-year 2019. ",
    "Currently, Kilroy Realty carries a Zacks Rank #3 (Hold). Over the past three months, shares of the company have gained 2.8% as compared with the industry  's growth of 4.3%.",
    "  Top Picks ",
    "OUTFRONT Media Inc. OUT  currently sports a Zacks Rank of 1 (Strong Buy). The Zacks Consensus Estimate for 2019 funds from operations (FFO) per share has been revised marginally upward to $2.34 over the past month. You can see   the complete list of today's Zacks #1 Rank stocks here  . ",
    "Crown Castle International Corp. CCI  holds a Zacks Rank of 2 (Buy), at present. The Zacks Consensus Estimate for the current-year FFO per share remained unchanged at $5.92 in the past month.",
    "Extra Space Storage Inc EXR  is another Zacks #2 Ranked company, presently. The Zacks Consensus Estimate for the ongoing year's FFO per share has been revised marginally upward to $4.86 in a month's time.",
    "Note:  Anything related to earnings presented in this write-up represent funds from operations (FFO) - a widely used metric to gauge the performance of REITs. ",
    " Biggest Tech Breakthrough in a Generation makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:01:00"
}