{
  "url": "https://www.nasdaq.com/article/were-up-220-on-my-favorite-utility-fund-cm1210692",
  "title": "We're Up 220% On My Favorite Utility Fund... - Nasdaq.com",
  "text": [
    " There aren't too many investments in existence that are truly   recession-proof. And even fewer are market-proof. U.S. government   bonds, especially Treasury inflation-protected securities (   TIPS    ) and zero-coupon bonds -- the hedges I discussed in   this article    -- come quite close to being both. Utilities, despite their reputation for being   recession-resistant investments, are not quite there in terms of   their portfolio-protection abilities. For one, demand for energy   isn't always steady. Because much of it comes from industrial   uses, when a recession hits, overall energy demand usually   declines. Furthermore, even a regulated-utility business model --   while making these stocks safer -- hardly guarantees growth.   Power companies have to contend with regulation, capital   expenditures, the costs of maintaining and upgrading our aging   infrastructure, the advent of renewable energy, and the   additional costs of providing enhanced cybersecurity. But they are indeed safer than much of the rest of the market.   Society needs these businesses to always operate, and so the   government strives to guarantee that regulated utilities have at   least some certainty in their businesses. This is achieved via   setting up a regulated return on investment for a regulated   utility. Because utilities are largely domestic businesses, their   results don't depend on currency fluctuations. This domestic   focus will likely make this sector a safe harbor if (and when)   the trade war, which seems to be heating up as we speak, emerges   as a real threat to the economy. Investors willing to invest in utilities have some options.   They can buy one -- or several -- stocks of related companies,   such as Dominion Energy (NYSE:   D    ), for example. They can also invest in a mutual fund or a low-cost   exchange-traded fund (ETF). One popular option is Utilities   Select Sector SPRD ETF (NYSE:   XLU    ), at roughly $11 billion in size. Or they can opt for a closed-end fund (   CEF    ), like Wells Fargo Utilities and High Income Fund (NYSE:   ERH    ) or   Reaves Utility Income Fund (NYSE:   UTG    )    . Both deliver yields much higher than the 3% yield of XLU. Coming from a small investment shop that specializes in   utilities, UTG is quite an interesting fund. Yielding roughly 6%   thanks to the use of leverage (only on about 20% of net assets),   it's also my favorite option of the group  My Favorite Utility Fund     For income investors looking to potentially buy this fund,   prepare to be surprised: UTG isn't simply a utility fund. This might be something that turns away some \"pure play\"   investors. I, however, like this feature of the fund. While it   has enough utility companies to be considered a sector closed-end   fund (and to generate income), the managers are not boxed into   having to invest 100% of all assets into this sector. Over time, the results of this investment policy have been   quite good. We cannot say anything about the future based purely   on the past, of course. But, with two leading managers having   been with the fund for decades, consistency of management is   there. I also like the composition of the fund's portfolio. While UTG   focuses on utility companies with the ability to grow at about   5%-7% annually, the fund also has a few telecommunication   companies -- including wireless ones, media companies,   transportation, and a small position in master limited   partnerships (MLPs) -- in its portfolio. The fund values research. Its experienced analysts focus their   efforts on bottom-up research -- they start with a company, not   with the market -- and identify those companies that can grow   their dividends. Portfolio managers then evaluate research   analysts' recommendations and determine whether or not -- and   when -- to buy (or sell) a stock. Here, market conditions can   become a factor. The fund's investments are constantly   re-evaluated. UTG does not have the highest levels of leverage among some of   the closed-end funds you'll find, but it's just enough to both   enhance returns and generate higher dividends, which are paid   monthly.  Action To Take     Reaves Utility Income Fund (NYSE:   UTG    ) is a still good choice for defensive-minded income investors.   That's why my colleague Nathan Slaughter continues to hold it in   the     Daily Paycheck      portfolio. In fact, since it was added in December 2009, between   a rising price and steadily reinvesting dividends,   readers are up by more than 220%    ... But by thinking ahead with a defensive mindset,   Daily Paycheck        subscribers are no longer anxious about retirement. The portfolio   generates more and more income every month, allowing our   followers to either keep growing their income -- or flick the   switch and start living a worry-free retirement. You don't have to be anxious, either. Overall, the portfolio   has been roughly 37% less volatile than the market. That   represents 37% more sleep-filled nights. If you'd like to learn more about the   Daily Paycheck    system,    click here     .   Related Articles   Why It Pays To Look For \"Picks And Shovels\"       Tech Stocks   We're Up 47% On This \"Weird\" Real Estate       Investment   How To Avoid Disaster -- And Rack Up More       Winners   ",
    "There aren't too many investments in existence that are truly   recession-proof. And even fewer are market-proof. U.S. government   bonds, especially Treasury inflation-protected securities (   TIPS    ) and zero-coupon bonds -- the hedges I discussed in   this article    -- come quite close to being both.",
    "Utilities, despite their reputation for being   recession-resistant investments, are not quite there in terms of   their portfolio-protection abilities. For one, demand for energy   isn't always steady. Because much of it comes from industrial   uses, when a recession hits, overall energy demand usually   declines. Furthermore, even a regulated-utility business model --   while making these stocks safer -- hardly guarantees growth.   Power companies have to contend with regulation, capital   expenditures, the costs of maintaining and upgrading our aging   infrastructure, the advent of renewable energy, and the   additional costs of providing enhanced cybersecurity.",
    "But they are indeed safer than much of the rest of the market.   Society needs these businesses to always operate, and so the   government strives to guarantee that regulated utilities have at   least some certainty in their businesses. This is achieved via   setting up a regulated return on investment for a regulated   utility.",
    "Because utilities are largely domestic businesses, their   results don't depend on currency fluctuations. This domestic   focus will likely make this sector a safe harbor if (and when)   the trade war, which seems to be heating up as we speak, emerges   as a real threat to the economy.",
    "Investors willing to invest in utilities have some options.   They can buy one -- or several -- stocks of related companies,   such as Dominion Energy (NYSE:   D    ), for example.",
    "They can also invest in a mutual fund or a low-cost   exchange-traded fund (ETF). One popular option is Utilities   Select Sector SPRD ETF (NYSE:   XLU    ), at roughly $11 billion in size.",
    "Or they can opt for a closed-end fund (   CEF    ), like Wells Fargo Utilities and High Income Fund (NYSE:   ERH    ) or   Reaves Utility Income Fund (NYSE:   UTG    )    . Both deliver yields much higher than the 3% yield of XLU.",
    "Coming from a small investment shop that specializes in   utilities, UTG is quite an interesting fund. Yielding roughly 6%   thanks to the use of leverage (only on about 20% of net assets),   it's also my favorite option of the group",
    " My Favorite Utility Fund     For income investors looking to potentially buy this fund,   prepare to be surprised: UTG isn't simply a utility fund.",
    "This might be something that turns away some \"pure play\"   investors. I, however, like this feature of the fund. While it   has enough utility companies to be considered a sector closed-end   fund (and to generate income), the managers are not boxed into   having to invest 100% of all assets into this sector.",
    "Over time, the results of this investment policy have been   quite good. We cannot say anything about the future based purely   on the past, of course. But, with two leading managers having   been with the fund for decades, consistency of management is   there.",
    "I also like the composition of the fund's portfolio. While UTG   focuses on utility companies with the ability to grow at about   5%-7% annually, the fund also has a few telecommunication   companies -- including wireless ones, media companies,   transportation, and a small position in master limited   partnerships (MLPs) -- in its portfolio.",
    "The fund values research. Its experienced analysts focus their   efforts on bottom-up research -- they start with a company, not   with the market -- and identify those companies that can grow   their dividends. Portfolio managers then evaluate research   analysts' recommendations and determine whether or not -- and   when -- to buy (or sell) a stock. Here, market conditions can   become a factor. The fund's investments are constantly   re-evaluated.",
    "UTG does not have the highest levels of leverage among some of   the closed-end funds you'll find, but it's just enough to both   enhance returns and generate higher dividends, which are paid   monthly.",
    " Action To Take     Reaves Utility Income Fund (NYSE:   UTG    ) is a still good choice for defensive-minded income investors.   That's why my colleague Nathan Slaughter continues to hold it in   the     Daily Paycheck      portfolio. In fact, since it was added in December 2009, between   a rising price and steadily reinvesting dividends,   readers are up by more than 220%    ...",
    "But by thinking ahead with a defensive mindset,   Daily Paycheck        subscribers are no longer anxious about retirement. The portfolio   generates more and more income every month, allowing our   followers to either keep growing their income -- or flick the   switch and start living a worry-free retirement.",
    "You don't have to be anxious, either. Overall, the portfolio   has been roughly 37% less volatile than the market. That   represents 37% more sleep-filled nights.",
    "If you'd like to learn more about the   Daily Paycheck    system,    click here     .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\n© Copyright 2001-2016 StreetAuthority, LLC. All Rights Reserved.\n"
  ],
  "published_datetime": "2019-09-11 03:30:00"
}