{
  "url": "https://www.nasdaq.com/article/chile-sees-peso-joining-heavyweight-cls-fx-system-in-2021--central-bank-chief-20190911-00637",
  "title": "Chile sees peso joining heavyweight CLS FX system in 2021 - central bank chief - Nasdaq.com",
  "text": [
    "By Marc Jones",
    "LONDON, Sept 11 (Reuters) - Chile's central bank expects the country's peso currency to be added to the heavyweight global CLS foreign exchange settlement system by 2021, its governor Mario Marcel said on Wednesday.",
    "CLS is owned by dozens of the world's largest commercial banks and has become a crucial piece of FX market infrastructure since its launch in 2002.",
    "The platform currently has 18 currencies, but only the Mexican peso from Latin America. Chile hopes joining it would bolster the Chilean peso's international standing and Santiago's hopes of becoming a regional finance centre.",
    "\"We are prepared to dedicate all the time and resources to it,\" Marcel told Reuters in an interview in London, pointing to 2021 as the expected joining date.",
    "CLS is seen as an advantage because it allows for real time settlement of international trades, which helps eliminate 'counter party risk'. It also reduces the need to hold so much liquidity because transactions are settled on a net basis.",
    "The last country to join was Hungary, in a process that took 2-1/2 years. To become a CLS member, local banks need to be in agreement and the central bank has to meet some key operational requirements, such as its own systems being live at the right times.",
    "That is tricky for Chile as one of the key times for international FX settlement comes in the middle of its night, meaning central bank staff may have to set up new night shifts.",
    "\"It is a very carefully crafted process but we already had a large mission from CLS in June. The feeling was with Chilean banks, with the financial institutions, that the outcome was extremely positive.\"",
    "\"It is already seven to eight months since we started, we are making good progress, but we know this is not something you rush,\" Marcel added."
  ],
  "published_datetime": "2019-09-11 01:10:00"
}