{
  "url": "https://www.nasdaq.com/article/weibo-expands-its-ecosystem-with-an-instagram-clone-cm1207595",
  "title": "Weibo Expands Its Ecosystem With an Instagram Clone - Nasdaq.com",
  "text": [
    "  Weibo    (NASDAQ: WB) this week launched Oasis, a new social media app   that resembles a hybrid between   Facebook    's (NASDAQ: FB) Instagram and   Pinterest    (NYSE: PINS) , to a limited group of test users. Like Instagram, Oasis lets users edit their photos and videos   with filters and promote their posts with hashtags. Like   Pinterest, users can browse posts based on interests -- such as   travel, fashion, and food -- and follow like-minded users. Oasis also resembles RED (known as Xiaohongshu in China),   another Instagram-like app that lets merchants directly sell   their products to users. RED hit 85 million monthly active users   (MAUs) in June, but allegations of fake reviews and merchants   peddling counterfeit goods caused the app to be pulled from   China's app stores in July and August.makeArticleAd();   Image source: Getty Images.  Oasis doesn't offer any integrated e-commerce functions yet,   but they'll likely be introduced after the app's test run.   Instagram, Pinterest, and RED all evolved into \"social shopping\"   platforms with shoppable posts, but Weibo's core social platform   -- which is often compared to   Twitter    -- still lacks native e-commerce features. Understanding Weibo's troubles Weibo, which was spun off from   Sina    in 2014, grew its MAUs by 13% annually to 486 million last   quarter. The platform continues to gain users because it's widely   used by top celebrities and brands in China. However, Weibo's revenue growth has slowed to a crawl over the   past year, as its core advertising business (86% of its   second-quarter revenue) hit a   brick wall:   YOY = Year over year. Data source: Quarterly reports. That's because many   companies in China    cut their advertising budgets as the economy slowed down.   Competition from other platforms (like ByteDance's TikTok and   Toutiao) and the escalating U.S.-China trade war exacerbated the   pain. Why Weibo needs Oasis China's e-commerce companies, however, have fared better.   Alibaba Group Holding    's (NYSE: BABA)    core commerce revenue soared 44%    annually last quarter, while   JD.com    's   total revenue rose 23%    -- marking its strongest growth in three quarters. This indicates   that Chinese consumers still have plenty of spending power. Meanwhile, the rise of RED highlights the surging demand for   social shopping experiences worldwide -- which is reflected in   the   growth of   Pinduoduo     , Alibaba's Taobao video streaming platform, and shoppable posts   on Instagram and Pinterest.   Weibo's Oasis. Image source: Weibo.  That's why it makes sense for Weibo to launch Oasis: to gain a   foothold in the social shopping market and diversify its revenue   away from online ads. Alibaba is already one of Weibo's top   stakeholders, so the e-commerce giant could potentially integrate   its marketplaces into Oasis. Weibo can also integrate its core network's live-video   streaming technologies -- which were bolstered by its acquisition   of Yizhibo in late 2018 -- into Oasis to host live shopping   videos. Weibo's live-video platform is already its second-largest   revenue stream after ads, but it generates most of its revenue by   letting users buy virtual gifts for their favorite   broadcasters. Many other live-video companies -- including   YY    and   Momo    -- use the same business model. Therefore, Oasis could   differentiate Weibo's live-video platform and diversify its   revenue away from virtual gifts. But let's not get ahead of ourselves... The initial reviews for Oasis are positive, and there are   plenty of ways for Weibo to monetize the platform. However, Weibo   hasn't actually said anything about adding e-commerce features   yet, so it likely wants to avoid RED's mistakes before diving   in. Oasis won't move the needle for Weibo anytime soon. But it   shows that the company knows it's too exposed to the fickle   advertising market, and it needs more exposure to China's   higher-growth e-commerce and live-video markets.   10 stocks we like better than Weibo       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Weibo wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       Randi Zuckerberg, a former director of market development     and spokeswoman for Facebook and sister to its CEO, Mark     Zuckerberg, is a member of The Motley Fool's board of     directors.     Leo Sun      owns shares of Facebook, JD, and SINA. The Motley Fool owns     shares of and recommends Facebook, JD, and      TWTR      . The Motley Fool owns shares of Pinterest. The Motley Fool     recommends MOMO, SINA, and Weibo. The Motley Fool has a     disclosure policy      .  ",
    " Weibo    (NASDAQ: WB) this week launched Oasis, a new social media app   that resembles a hybrid between   Facebook    's (NASDAQ: FB) Instagram and   Pinterest    (NYSE: PINS) , to a limited group of test users.",
    "Like Instagram, Oasis lets users edit their photos and videos   with filters and promote their posts with hashtags. Like   Pinterest, users can browse posts based on interests -- such as   travel, fashion, and food -- and follow like-minded users.",
    "Oasis also resembles RED (known as Xiaohongshu in China),   another Instagram-like app that lets merchants directly sell   their products to users. RED hit 85 million monthly active users   (MAUs) in June, but allegations of fake reviews and merchants   peddling counterfeit goods caused the app to be pulled from   China's app stores in July and August.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Oasis doesn't offer any integrated e-commerce functions yet,   but they'll likely be introduced after the app's test run.   Instagram, Pinterest, and RED all evolved into \"social shopping\"   platforms with shoppable posts, but Weibo's core social platform   -- which is often compared to   Twitter    -- still lacks native e-commerce features.",
    "Weibo, which was spun off from   Sina    in 2014, grew its MAUs by 13% annually to 486 million last   quarter. The platform continues to gain users because it's widely   used by top celebrities and brands in China.",
    "However, Weibo's revenue growth has slowed to a crawl over the   past year, as its core advertising business (86% of its   second-quarter revenue) hit a   brick wall: ",
    "YOY = Year over year. Data source: Quarterly reports.",
    "That's because many   companies in China    cut their advertising budgets as the economy slowed down.   Competition from other platforms (like ByteDance's TikTok and   Toutiao) and the escalating U.S.-China trade war exacerbated the   pain.",
    "China's e-commerce companies, however, have fared better.   Alibaba Group Holding    's (NYSE: BABA)    core commerce revenue soared 44%    annually last quarter, while   JD.com    's   total revenue rose 23%    -- marking its strongest growth in three quarters. This indicates   that Chinese consumers still have plenty of spending power.",
    "Meanwhile, the rise of RED highlights the surging demand for   social shopping experiences worldwide -- which is reflected in   the   growth of   Pinduoduo     , Alibaba's Taobao video streaming platform, and shoppable posts   on Instagram and Pinterest.",
    "  Weibo's Oasis. Image source: Weibo. ",
    "Weibo's Oasis. Image source: Weibo.",
    "That's why it makes sense for Weibo to launch Oasis: to gain a   foothold in the social shopping market and diversify its revenue   away from online ads. Alibaba is already one of Weibo's top   stakeholders, so the e-commerce giant could potentially integrate   its marketplaces into Oasis.",
    "Weibo can also integrate its core network's live-video   streaming technologies -- which were bolstered by its acquisition   of Yizhibo in late 2018 -- into Oasis to host live shopping   videos. Weibo's live-video platform is already its second-largest   revenue stream after ads, but it generates most of its revenue by   letting users buy virtual gifts for their favorite   broadcasters.",
    "Many other live-video companies -- including   YY    and   Momo    -- use the same business model. Therefore, Oasis could   differentiate Weibo's live-video platform and diversify its   revenue away from virtual gifts.",
    "The initial reviews for Oasis are positive, and there are   plenty of ways for Weibo to monetize the platform. However, Weibo   hasn't actually said anything about adding e-commerce features   yet, so it likely wants to avoid RED's mistakes before diving   in.",
    "Oasis won't move the needle for Weibo anytime soon. But it   shows that the company knows it's too exposed to the fickle   advertising market, and it needs more exposure to China's   higher-growth e-commerce and live-video markets.",
    "  10 stocks we like better than Weibo       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Weibo wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Weibo       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Weibo wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " Randi Zuckerberg, a former director of market development     and spokeswoman for Facebook and sister to its CEO, Mark     Zuckerberg, is a member of The Motley Fool's board of     directors.     Leo Sun      owns shares of Facebook, JD, and SINA. The Motley Fool owns     shares of and recommends Facebook, JD, and      TWTR      . The Motley Fool owns shares of Pinterest. The Motley Fool     recommends MOMO, SINA, and Weibo. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 06:05:00"
}