{
  "url": "https://www.nasdaq.com/article/millennials-are-swiping-right-on-these-attractive-money-habits-cm1207931",
  "title": "Millennials Are Swiping Right on These Attractive Money Habits - Nasdaq.com",
  "text": [
    "Millennials could get more dates with a few good money habits.",
    "Think about the traits people consider attractive. What comes to mind?",
    "You may have said physical beauty, stylish dress, and a charming personality. And those are all attractive traits. But good money habits are also an effective (and underrated) way to make yourself more appealing in the dating world.",
    "In our study on finances and relationships , we asked respondents what financial traits they found attractive in a potential romantic partner. It turns out that every generation has their own unique preferences. Here are the top five money habits that millennials find attractive.",
    "Image source: Getty Images",
    "Given that millennials are still in their twenties and thirties, it makes sense that they value setting financial goals more than any other money habit. 72% of millennials want a partner who does this.",
    "At this stage in life, most people haven't hit their peak in terms of their careers or personal success. That's understandable, and no one expects you to be at the top of the mountain yet. What's important is that you're pursuing financial goals, even if it's something as simple as saving a certain amount in your bank account every month.",
    "It shows that you have a desire to improve your situation. That's much more attractive than floating around aimlessly with the exact same life at 35 as you had at 25.",
    "Following a budget is basically #adulting101, and it's an attractive trait for multiple reasons:",
    "This trait was a close second: 71.5% wanted their romantic partner to have a budget.",
    "A full-time job is a good sign to potential romantic partners. It indicates stability, both from a personal and a financial perspective, and it's something 71% of millennials want in a partner.",
    "Your employment status isn't just important because it allows you to support yourself. It can also have a significant effect on your mental health. Studies have shown that unemployment can lead to much higher anxiety and stress levels , neither of which are appealing to romantic partners.",
    "If you have your own place and you don't need money from your parents to survive, you'll have a leg up on the competition in the dating world. 66.2% of millennials value financial independence in the people they date.",
    "This is one of those traits that isn't very common among millennials yet. In our research, we found that only 37% of millennials have achieved financial independence. The average millennial doesn't reach that point until the age of 31.",
    "Of course, the good news is that if you are financially independent, you'll stand out from your peers that much more.",
    "Your payment history is the most significant factor in determining your credit score . That's reason enough to take it seriously. But if you need more motivation, it's also a money habit that 65.8% of millennials like to see.",
    "Just like following a budget, paying your bills on time is a sign of financial responsibility. It's especially important for those looking for a long-term relationship because people get annoyed when their partner constant incurs late fees (especially if you combine your finances and you're both responsible for those fees).",
    "There's nothing particularly challenging about any of these attractive money habits.",
    "Anybody can set financial goals, follow a budget, and pay their bills on time; you just need to put in the effort. Finding full-time work and achieving financial independence can be more difficult, but they're also important steps in every young adult's life.",
    "Many people are missing out on guaranteed returns as their money languishes in a big bank savings account earning next to no interest. Our picks of the best online savings accounts can earn you more than 25x the national average savings account rate. Click here to uncover the best-in-class picks that landed a spot on our shortlist of the best savings accounts for 2019.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:00:00"
}