{
  "url": "https://www.nasdaq.com/article/5-cardinal-rules-of-smart-credit-card-use-cm1206787",
  "title": "5 Cardinal Rules of Smart Credit Card Use - Nasdaq.com",
  "text": [
    "Want to use your credit cards the right way? Here are five important rules you should never break.",
    "Credit cards can be a helpful tool, or they can get you into serious debt that will have a major adverse impact on your financial life. Although some people shy away from credit cards because they're afraid they'll end up too deeply in debt, this isn't always the best approach. Not using credit could mean missing out on important credit card benefits.",
    "Instead, it's a good idea to sign up for a credit card ASAP, and follow these five cardinal rules of smart credit card use.",
    "Image source: Getty Images",
    "Credit cards tend to charge very high interest rates, with some limited exceptions such as cards offering 0% APR promotions . If you don't repay your balance in full when your bill is due, the card company will charge interest. Typically, interest is based on your average daily balance, and it compounds daily. This means that the daily interest charge is added to what you owe, and that you pay interest on your interest.",
    "Paying off your balance to avoid interest charges is imperative if you're going to avoid wasting a ton of money. Although credit card companies charge minimum monthly payments that are equal to just a small percentage of the amount you owe, making only your minimum payments leaves you in debt for years, and adds hundreds or even thousands of dollars to the costs of your purchases. And, as soon as you let a balance start to grow, paying it off just becomes harder next month.",
    "Don't go down this path -- just follow the cardinal rule of paying your balance in full every time.",
    "Not only do you want to pay your bill in full, but you also want to pay it on time. Otherwise, you could hurt your payment history on your credi t report . Payment history is the most important factor that affects your credit -- and a single late payment could result in a reduction of more than 100 points from a good credit score.",
    "To avoid accidentally missing a payment because you forgot to make it, set up autopay to withdraw from your bank account the full amount due (but be sure that doing so won't put you at risk of overdrafting). That way, not only will you never miss a payment, but you'll also never end up carrying a balance you're paying interest on.",
    "When a credit card company gives you a line of credit, don't assume you can spend up to the credit limit without any problems. If you max out your card, you'll hurt your credit utilization ratio. This is the second most important component of your credit score, and it's determined by dividing the amount of credit you've used by your total credit available.",
    "To maintain your best possible credit score, your credit utilization ratio should be no more than 30% and should ideally be even lower. So, with a credit card that has a $1,000 limit, you'd want to charge no more than $300. If you go over this amount, you can expect your credit score to fall until you've paid off what you owe.",
    "If you have a credit card you aren't using any more, it may be tempting to close the account. Unfortunately, this could hurt your credit score in two ways. By closing the account, you lose access to the credit line, which affects your utilization ratio. And, you shorten the average age of your account history, where having a longer account history is better for your credit score.",
    "If the old card has a high annual fee, you may decide to close it anyway and take the hit to your credit score to avoid the cost. But before you do, try calling your creditor to see if they'd be willing to allow you to switch to a free card in their lineup of cards, and keep your card history in tact.",
    "Finally, the last cardinal rule of being a smart credit card user is to get as many rewards as you can. You can do this by choosing a rewards card that provides bonus points, miles, or cash back in the areas where you spend the most.",
    "If your spending is all over the place, this may mean opting for a card that offers a flat percentage cash back. Or you may prefer to use a card that provides extra rewards for gas and groceries.",
    "Of course, if you really want to maximize your rewards, consider using different cards for different purchases. You could have your general cash back card, for example, but also another card that gives you 5% rewards on dining out, that you only use when you go to restaurants.",
    "If you follow these five big rules for credit card use, your cards can help you to build credit, and reap generous rewards for your everyday spending. Credit cards will help your finances, rather than hinder your financial progress, and you'll be much better off for having used them.",
    "This may be the perfect cash back card ! That's because it packs in $1,148 of value. Cardholders can earn up to 5% cash back, double rewards in the first year, and avoid interest well into 2020. With such a deep bench of perks you'll wonder how this card packs in a $0 annual fee. Best yet, you can apply and get a decision in two minutes. Learn more with our in-depth review.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:00:00"
}