{
  "url": "https://www.nasdaq.com/article/why-amgen-stock-perked-up-last-month-cm1210370",
  "title": "Why Amgen Stock Perked Up Last Month - Nasdaq.com",
  "text": [
    " What happened  Biotech heavyweight Amgen    (NASDAQ: AMGN) saw its shares gain a healthy 12.2% over the   course of August, according to data from   S&P Global Market Intelligence    . What triggered this double-digit move higher? On Aug. 9, the U.S. District Court for the District of   New Jersey upheld the two patents protecting the   anti-inflammatory medicine Enbrel from biosimilar competition   until 2029.   Novartis    ' (NYSE: NVS) Sandoz division is attempting to invalidate the   patents in order to launch its Enbrel biosimilar, known as   Erelzi. Erelzi was approved three years ago by the Food and Drug   Administration (FDA), but it has yet to launch because it   infringes on those two key patents.   Image Source: Getty Images.makeArticleAd();  So what Enbrel has long been Amgen's best-selling medicine. So it's   not surprising that investors cheered this verdict last month.   Now, Novartis does reportedly plan on challenging the court's   ruling, but as things stand now, Amgen appears to have the upper   hand in this long-running legal battle. That's key because it   means Amgen's biggest cash cow should remain a key contributor to   the biotech's top line for years to come. Now what In addition to this major legal win, Amgen also acquired   Celgene    's anti-inflammatory medicine   Otezla for a whopping $13.4 billion    last month, and it recently reported encouraging trial results   for the novel anti-cancer treatment AMG 510 as well. With all   these positive developments, Amgen has significantly improved its   long-term outlook over the past few weeks. In fact, the biotech   is expected to post a noteworthy 9.9% increase in annual sales   next year, thanks largely to this Otezla acquisition. That being   the case, this blue-chip biotech stock arguably comes across as   an outstanding buy right now.   10 stocks we like better than Amgen       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amgen wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        George Budwell      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Celgene. The Motley Fool     recommends Amgen. The Motley Fool has a     disclosure policy      .  ",
    " Biotech heavyweight Amgen    (NASDAQ: AMGN) saw its shares gain a healthy 12.2% over the   course of August, according to data from   S&P Global Market Intelligence    . What triggered this double-digit move higher?",
    "On Aug. 9, the U.S. District Court for the District of   New Jersey upheld the two patents protecting the   anti-inflammatory medicine Enbrel from biosimilar competition   until 2029.   Novartis    ' (NYSE: NVS) Sandoz division is attempting to invalidate the   patents in order to launch its Enbrel biosimilar, known as   Erelzi. Erelzi was approved three years ago by the Food and Drug   Administration (FDA), but it has yet to launch because it   infringes on those two key patents.",
    "  Image Source: Getty Images.makeArticleAd(); ",
    "Image Source: Getty Images.",
    "Enbrel has long been Amgen's best-selling medicine. So it's   not surprising that investors cheered this verdict last month.   Now, Novartis does reportedly plan on challenging the court's   ruling, but as things stand now, Amgen appears to have the upper   hand in this long-running legal battle. That's key because it   means Amgen's biggest cash cow should remain a key contributor to   the biotech's top line for years to come.",
    "In addition to this major legal win, Amgen also acquired   Celgene    's anti-inflammatory medicine   Otezla for a whopping $13.4 billion    last month, and it recently reported encouraging trial results   for the novel anti-cancer treatment AMG 510 as well. With all   these positive developments, Amgen has significantly improved its   long-term outlook over the past few weeks. In fact, the biotech   is expected to post a noteworthy 9.9% increase in annual sales   next year, thanks largely to this Otezla acquisition. That being   the case, this blue-chip biotech stock arguably comes across as   an outstanding buy right now.",
    "  10 stocks we like better than Amgen       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amgen wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Amgen       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amgen wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  George Budwell      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Celgene. The Motley Fool     recommends Amgen. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:36:00"
}