{
  "url": "https://www.nasdaq.com/article/why-cresco-labs-could-be-an-underrated-stock-to-buy-today-cm1207644",
  "title": "Why Cresco Labs Could Be an Underrated Stock to Buy Today - Nasdaq.com",
  "text": [
    " There are a lot of   pot stocks    to choose from, and   Cresco Labs    (OTC: CRLBF) sometimes gets lost in the crowd. At a market cap of   less than $1 billion and trading volumes often below 300,000,   it's not a real attention-grabber. However, that could be a   missed opportunity for investors.  Operational in seven states and expanding        Chicago-based Cresco Labs has been steadily expanding its   reach across the country and is slowly becoming a large,   multistate operator. Last month, the company released its   latest quarterly results    , which showed tremendous sales growth, with revenues of $29.9   million rising by 253% from the $8.5 million in sales it   generated in the prior year. As good as that is, the company is going to get even bigger   once its acquisition of   Origin House    (OTC: ORHOF) goes through, which will give Cresco a large   distribution network to tap into in California. To help put it   into perspective, in its   most recent quarter    , Origin House's sales topped CA$21.4 million in just the   last three months. Its acquisition of Origin House is   expected to be completed before the end of this year. When it was   announced earlier this year, the all-stock deal was valued at   about CA$1.1 billion, making it the largest public company   acquisition to date in the U.S. cannabis industry.makeArticleAd();     IMAGE SOURCE: GETTY IMAGES.  In addition to a growing presence in California, Cresco is   also in the process of acquiring licenses in New York,   Massachusetts, and Florida that will expand its reach even   further. Michigan is another state it already has the green light   for, meaning that in total, Cresco will have a presence in 11   states across the country.  Seed-to-sale process control        One of the big advantages for Cresco is that it has control   over the entire process as the company has 23 production   facilities and 22 dispensaries across multiple states (including   acquisitions still pending approval). From cultivation to   the in-store experience, Cresco can provide customers with   consistent, high-quality products and services. It's something   that many other cannabis companies can't do because they   typically control only one part of the process. Cresco also makes an effort to educate users so that they are   making the best decisions possible. On   the   company's website,    the company has a substantial amount of information on various   different subjects, ranging from generic information to different   ways to consume cannabis as well as links related to medical   marijuana research and studies that have been done.  The business is already sustainable  Cresco is expanding without breaking the bank. Although it   posted a loss in its most recent quarter, if not for a hefty   income tax bill of $5.6 million, the company would have landed in   the black, as its pre-tax profits were $1.7 million. Operating income of $4.3 million was a significant increase of   170% from last year's tally of just $1.6 million. With its   calculated approach, Cresco has found a way to build and grow its   operations throughout the U.S. without spreading itself too thin.   Although Cresco did post a profit in 2018 with the help of   changes in fair value, with Origin House posting some significant   losses, it might not be as easy getting back to profitability   once that acquisition is complete.  Why Cresco is a solid buy today  Cresco's share price has risen more than 20% year-to-date, but   the stock is still fairly small at a market cap of just $1   billion, which is much smaller than other cannabis operators that   are not as strong financially. At a price-to-sales ratio of   less than 12, it's a fairly cheap buy compared to some of its   peers. However, as its revenues continue to rise, Cresco might   not be a cheap stock for much longer.   Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.         And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018. And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution. Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks. Simply click here to get the full story now.  Learn more     David Jagielski      has no position in any of the stocks mentioned. The Motley Fool     recommends Origin House. The Motley Fool has a     disclosure policy      .  ",
    "There are a lot of   pot stocks    to choose from, and   Cresco Labs    (OTC: CRLBF) sometimes gets lost in the crowd. At a market cap of   less than $1 billion and trading volumes often below 300,000,   it's not a real attention-grabber. However, that could be a   missed opportunity for investors.",
    "Chicago-based Cresco Labs has been steadily expanding its   reach across the country and is slowly becoming a large,   multistate operator. Last month, the company released its   latest quarterly results    , which showed tremendous sales growth, with revenues of $29.9   million rising by 253% from the $8.5 million in sales it   generated in the prior year.",
    "As good as that is, the company is going to get even bigger   once its acquisition of   Origin House    (OTC: ORHOF) goes through, which will give Cresco a large   distribution network to tap into in California. To help put it   into perspective, in its   most recent quarter    , Origin House's sales topped CA$21.4 million in just the   last three months. Its acquisition of Origin House is   expected to be completed before the end of this year. When it was   announced earlier this year, the all-stock deal was valued at   about CA$1.1 billion, making it the largest public company   acquisition to date in the U.S. cannabis industry.",
    "  IMAGE SOURCE: GETTY IMAGES. ",
    "IMAGE SOURCE: GETTY IMAGES.",
    "In addition to a growing presence in California, Cresco is   also in the process of acquiring licenses in New York,   Massachusetts, and Florida that will expand its reach even   further. Michigan is another state it already has the green light   for, meaning that in total, Cresco will have a presence in 11   states across the country.",
    "One of the big advantages for Cresco is that it has control   over the entire process as the company has 23 production   facilities and 22 dispensaries across multiple states (including   acquisitions still pending approval). From cultivation to   the in-store experience, Cresco can provide customers with   consistent, high-quality products and services. It's something   that many other cannabis companies can't do because they   typically control only one part of the process.",
    "Cresco also makes an effort to educate users so that they are   making the best decisions possible. On   the   company's website,    the company has a substantial amount of information on various   different subjects, ranging from generic information to different   ways to consume cannabis as well as links related to medical   marijuana research and studies that have been done.",
    "Cresco is expanding without breaking the bank. Although it   posted a loss in its most recent quarter, if not for a hefty   income tax bill of $5.6 million, the company would have landed in   the black, as its pre-tax profits were $1.7 million.",
    "Operating income of $4.3 million was a significant increase of   170% from last year's tally of just $1.6 million. With its   calculated approach, Cresco has found a way to build and grow its   operations throughout the U.S. without spreading itself too thin.   Although Cresco did post a profit in 2018 with the help of   changes in fair value, with Origin House posting some significant   losses, it might not be as easy getting back to profitability   once that acquisition is complete.",
    "Cresco's share price has risen more than 20% year-to-date, but   the stock is still fairly small at a market cap of just $1   billion, which is much smaller than other cannabis operators that   are not as strong financially. At a price-to-sales ratio of   less than 12, it's a fairly cheap buy compared to some of its   peers. However, as its revenues continue to rise, Cresco might   not be a cheap stock for much longer.",
    "  Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.         And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018. And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution. Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks. Simply click here to get the full story now.  Learn more  ",
    " Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.        ",
    "And make no mistake - it is coming.",
    "Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018.",
    "And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution.",
    "Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks.",
    "Simply click here to get the full story now.",
    " Learn more ",
    "  David Jagielski      has no position in any of the stocks mentioned. The Motley Fool     recommends Origin House. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 06:41:12"
}