{
  "url": "https://www.nasdaq.com/article/spate-of-positive-news-boosts-oil-etfs-cm1208184",
  "title": "Spate of Positive News Boosts Oil ETFs - Nasdaq.com",
  "text": [
    " After slipping into bear territory on trade war escalation and recession fears,  oil prices  received a boost from a slew of positive news including pick up in China's services sector and hopes of trade talks resumption (read: Oil Collapses to Bear Market: Bet on Inverse Energy ETFs  ).  makeArticleAd();  A private survey showed that service activity in China expanded at the fastest pace in three months in August, providing some relief to oil markets. Notably, China is the world's second-largest oil consumer and largest importer. Meanwhile, trade talks between the two world superpowers are expected to resume in early October that is likely to ease global slowdown concerns, which in turn will drive the demand for oil.    This has resulted in a spike in oil ETFs. United States Brent Oil Fund BNO   emerged as a biggest winner, climbing 5.1% on Sep 4 while Invesco DB Oil Fund DBO   , United States Oil Fund USO   and iPath S&P GSCI Crude Oil Total Return Index ETN OIL   gained more than 4% each. Let's dig into these ETFs quickly:   BNO    This fund provides direct exposure to the spot price of Brent crude oil on a daily basis through future contracts. It has amassed $83.9 million in its asset base and trades in a good volume of roughly 360,000 shares a day. The ETF charges 90 bps in annual fees and expenses.   DBO    This product provides exposure to crude oil through WTI futures contracts and follows the DBIQ Optimum Yield Crude Oil Index Excess Return. The fund witnesses solid average daily volume of more than 251,000 shares and has AUM of $267 million. It charges an expense ratio of 0.78% (read: ETFs in Focus as Rising Trade War Tensions Hurt Oil Prices  ).   USO    This is the most popular and liquid ETF in the oil space with an AUM of $1.3 billion and an average daily volume of more than 26.2 million shares. The fund seeks to match the performance of the spot price of West Texas Intermediate (WTI or U.S. crude). The ETF has 0.73% in expense ratio.   OIL    This is an ETN option for oil investors and delivers returns through an unleveraged investment in the WTI crude oil futures contract. The product follows the S&P GSCI Crude Oil Total Return Index, a subset of the S&P GSCI Commodity Index. The note has amassed $84.5 million in AUM and trades in a lower volume of 20,000 shares a day. Its expense ratio came in at 0.75%.   What's In Store?    The rise in oil price seems short-lived given the negative sentiments building up in the space. This is especially true as OPEC oil production has risen for the first time this year in August buoyed by Nigeria and Saudi Arabia, which collectively raised production by 200,000 barrels per day to 29.99 million a day. Oil exports also rose to a four-month high.    According to International Energy Agency, global oil demand outlook is somber amid growing signs of an economic slowdown, which lowered consumption growth during the first five months of this year to the weakest in a decade. The agency cuts global oil demand growth outlook by 100,000 barrels per day for 2019 and 50,000 barrels per day for 2020 (read: Energy ETFs Crash on Rate Cut and New China Tariff  ).    Additionally, ongoing US-China trade war, and President Trump's declaration to be even stringent regarding Beijing if he wins a second term in office will continue to drag oil price lower. Moreover, recession fears as indicated by the bond market will keep hurting the demand. Demand factor is playing a crucial role currently even though supply conditions are still tight given the declines in Venezuela, Iran, and potentially Libya, and the output cut deal.   Want key ETF info delivered straight to your inbox?    Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week. Get it free >>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   United States Brent Oil Fund LP (BNO): ETF Research Reports   Invesco DB Oil Fund (DBO): ETF Research Reports   US Commodity Funds United States Oil Fund (USO): ETF Research Reports   iPath Series B S&P GSCI Crude Oil Total Return Index ETN (OIL): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    "After slipping into bear territory on trade war escalation and recession fears,  oil prices  received a boost from a slew of positive news including pick up in China's services sector and hopes of trade talks resumption (read: Oil Collapses to Bear Market: Bet on Inverse Energy ETFs  ).  makeArticleAd();  A private survey showed that service activity in China expanded at the fastest pace in three months in August, providing some relief to oil markets. Notably, China is the world's second-largest oil consumer and largest importer. Meanwhile, trade talks between the two world superpowers are expected to resume in early October that is likely to ease global slowdown concerns, which in turn will drive the demand for oil.    This has resulted in a spike in oil ETFs. United States Brent Oil Fund BNO   emerged as a biggest winner, climbing 5.1% on Sep 4 while Invesco DB Oil Fund DBO   , United States Oil Fund USO   and iPath S&P GSCI Crude Oil Total Return Index ETN OIL   gained more than 4% each. Let's dig into these ETFs quickly:   BNO    This fund provides direct exposure to the spot price of Brent crude oil on a daily basis through future contracts. It has amassed $83.9 million in its asset base and trades in a good volume of roughly 360,000 shares a day. The ETF charges 90 bps in annual fees and expenses.   DBO    This product provides exposure to crude oil through WTI futures contracts and follows the DBIQ Optimum Yield Crude Oil Index Excess Return. The fund witnesses solid average daily volume of more than 251,000 shares and has AUM of $267 million. It charges an expense ratio of 0.78% (read: ETFs in Focus as Rising Trade War Tensions Hurt Oil Prices  ).   USO    This is the most popular and liquid ETF in the oil space with an AUM of $1.3 billion and an average daily volume of more than 26.2 million shares. The fund seeks to match the performance of the spot price of West Texas Intermediate (WTI or U.S. crude). The ETF has 0.73% in expense ratio.   OIL    This is an ETN option for oil investors and delivers returns through an unleveraged investment in the WTI crude oil futures contract. The product follows the S&P GSCI Crude Oil Total Return Index, a subset of the S&P GSCI Commodity Index. The note has amassed $84.5 million in AUM and trades in a lower volume of 20,000 shares a day. Its expense ratio came in at 0.75%.   What's In Store?    The rise in oil price seems short-lived given the negative sentiments building up in the space. This is especially true as OPEC oil production has risen for the first time this year in August buoyed by Nigeria and Saudi Arabia, which collectively raised production by 200,000 barrels per day to 29.99 million a day. Oil exports also rose to a four-month high.    According to International Energy Agency, global oil demand outlook is somber amid growing signs of an economic slowdown, which lowered consumption growth during the first five months of this year to the weakest in a decade. The agency cuts global oil demand growth outlook by 100,000 barrels per day for 2019 and 50,000 barrels per day for 2020 (read: Energy ETFs Crash on Rate Cut and New China Tariff  ).    Additionally, ongoing US-China trade war, and President Trump's declaration to be even stringent regarding Beijing if he wins a second term in office will continue to drag oil price lower. Moreover, recession fears as indicated by the bond market will keep hurting the demand. Demand factor is playing a crucial role currently even though supply conditions are still tight given the declines in Venezuela, Iran, and potentially Libya, and the output cut deal.   Want key ETF info delivered straight to your inbox?    Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week. Get it free >> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:50:00"
}