{
  "url": "https://www.nasdaq.com/article/broadcom-avgo-3rd-quarter-earnings-what-to-expect-cm1210860",
  "title": "Broadcom (AVGO) 3rd Quarter Earnings: What to Expect - Nasdaq.com",
  "text": [
    "Semiconductor giant Broadcom ( AVGO ) is set to report third-quarter fiscal 2019 earnings results after the closing bell Thursday. Broadcom shares have risen almost 7% in five days in anticipation of a strong quarter.  ",
    "The stock is now up some 16% year to date, reversing a decline that took place following the company's second-quarter results. Soft fiscal year guidance, owing to trade tensions with China, sent Broadcom shares falling some 10% last quarter. This decline happened even though the company delivered yet another profit beat and double-digit revenue growth. The strength of the wireless business, combined with reduced tariff risk, is one reason investors have witnessed the recent rise in the share price. ",
    "At the same time, however, considering the broader technology sector has raced ahead by 32% in 2019, Broadcom remains a relative under-performer. Plus, although the shares have moved modestly higher, at around $294, they are still some 10% off their 52-week high of $323. Investors want some confirmation that this is a good buying opportunity. ",
    "For the quarter that ended July, Wall Street expects the San Jose, Calif.-based company to earn $5.13 per share on revenue of $5.55 billion. This compares to the year-ago quarter when earnings came to $4.98 per share on revenue of $5.07 billion. For the full year, ending October, earnings are projected to increase 8% to $21.38 per share, while full-year revenue of $22.61 billion would rise 8.4% year over year. ",
    "Trade war tensions between the U.S. and China have been the main headwind for Broadcom, which — as with peers Intel ( INTC ), Micron ( MU ) and Nvidia ( NVDA ) — extracts a sizable portion of its revenue from China. The company saw some weakness in China when it reported its results back in March, though management had already accounted for that in its full-year guidance. This was also evident in the second-quarter results. ",
    "Second-quarter revenue came to $5.52 billion. Although that was up about 10% year over year, it missed Street estimates by some $180 million. Weakness on the Semiconductor solutions business, its largest segment, which posted 10% year-over-year revenue decline, was the biggest headwind. This offset the revenue gain Broadcom recognized from its acquisition of mainframe software provider CA Technologies, where Infrastructure software rose to $1.4 billion. ",
    "Weak guidance was also a factor. Citing geopolitical uncertainties and export restrictions for certain customers, Broadcom warned there would be a \"broad-based slowdown in the demand environment.\" Thus, it opted to take a \"conservative stance for the rest of the year.\" Wall Street on Thursday will want to see the extent of the impact the trade war might have had.  ",
    "Analysts will also want to see whether Broadcom maintain its conservative stance with respect to guidance, particularly when with both the U.S. and China recently agreeing to renew trade negotiations. Strong forward-looking commentary from Broadcom management on Thursday could move not only Broadcom shares back above $300 — it can alter the perception of the entire chip sector.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 08:19:36"
}