{
  "url": "https://www.nasdaq.com/article/is-insight-enterprises-nsit-stock-undervalued-right-now-cm1210346",
  "title": "Is Insight Enterprises (NSIT) Stock Undervalued Right Now? - Nasdaq.com",
  "text": [
    " While the proven Zacks Rank places an emphasis on earnings estimates and estimate revisions to find strong stocks, we also know that investors tend to develop their own individual strategies. With this in mind, we are always looking at value, growth, and momentum trends to discover great companies. Of these, value investing is easily one of the most popular ways to find great stocks in any market environment. Value investors rely on traditional forms of analysis on key valuation metrics to find stocks that they believe are undervalued, leaving room for profits. Zacks has developed the innovative Style Scores system to highlight stocks with specific traits. For example, value investors will be interested in stocks with great grades in the \"Value\" category. When paired with a high Zacks Rank, \"A\" grades in the Value category are among the strongest value stocks on the market today. Insight Enterprises (NSIT) is a stock many investors are watching right now. NSIT is currently sporting a Zacks Rank of #2 (Buy) and an A for Value. The stock holds a P/E ratio of 9.72, while its industry has an average P/E of 12.85. Over the past 52 weeks, NSIT's Forward P/E has been as high as 12.16 and as low as 8.40, with a median of 10.85. Another valuation metric that we should highlight is NSIT's P/B ratio of 1.63. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. NSIT's current P/B looks attractive when compared to its industry's average P/B of 2.03. Over the past 12 months, NSIT's P/B has been as high as 2.17 and as low as 1.43, with a median of 1.87. Value investors also love the P/S ratio, which is calculated by simply dividing a stock's price with the company's sales. This is a prefered metric because revenue can't really be manipulated, so sales are often a truer performance indicator. NSIT has a P/S ratio of 0.25. This compares to its industry's average P/S of 0.34. Finally, our model also underscores that NSIT has a P/CF ratio of 8.64. This metric focuses on a firm's operating cash flow and is often used to find stocks that are undervalued based on the strength of their cash outlook. NSIT's current P/CF looks attractive when compared to its industry's average P/CF of 14.22. Over the past 52 weeks, NSIT's P/CF has been as high as 12.39 and as low as 7.11, with a median of 9.73. Value investors will likely look at more than just these metrics, but the above data helps show that Insight Enterprises is likely undervalued currently. And when considering the strength of its earnings outlook, NSIT sticks out at as one of the market's strongest value stocks.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Insight Enterprises, Inc. (NSIT): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "While the proven Zacks Rank places an emphasis on earnings estimates and estimate revisions to find strong stocks, we also know that investors tend to develop their own individual strategies. With this in mind, we are always looking at value, growth, and momentum trends to discover great companies.",
    "Of these, value investing is easily one of the most popular ways to find great stocks in any market environment. Value investors rely on traditional forms of analysis on key valuation metrics to find stocks that they believe are undervalued, leaving room for profits.",
    "Zacks has developed the innovative Style Scores system to highlight stocks with specific traits. For example, value investors will be interested in stocks with great grades in the \"Value\" category. When paired with a high Zacks Rank, \"A\" grades in the Value category are among the strongest value stocks on the market today.",
    "Insight Enterprises (NSIT) is a stock many investors are watching right now. NSIT is currently sporting a Zacks Rank of #2 (Buy) and an A for Value. The stock holds a P/E ratio of 9.72, while its industry has an average P/E of 12.85. Over the past 52 weeks, NSIT's Forward P/E has been as high as 12.16 and as low as 8.40, with a median of 10.85.",
    "Another valuation metric that we should highlight is NSIT's P/B ratio of 1.63. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. NSIT's current P/B looks attractive when compared to its industry's average P/B of 2.03. Over the past 12 months, NSIT's P/B has been as high as 2.17 and as low as 1.43, with a median of 1.87.",
    "Value investors also love the P/S ratio, which is calculated by simply dividing a stock's price with the company's sales. This is a prefered metric because revenue can't really be manipulated, so sales are often a truer performance indicator. NSIT has a P/S ratio of 0.25. This compares to its industry's average P/S of 0.34.",
    "Finally, our model also underscores that NSIT has a P/CF ratio of 8.64. This metric focuses on a firm's operating cash flow and is often used to find stocks that are undervalued based on the strength of their cash outlook. NSIT's current P/CF looks attractive when compared to its industry's average P/CF of 14.22. Over the past 52 weeks, NSIT's P/CF has been as high as 12.39 and as low as 7.11, with a median of 9.73.",
    "Value investors will likely look at more than just these metrics, but the above data helps show that Insight Enterprises is likely undervalued currently. And when considering the strength of its earnings outlook, NSIT sticks out at as one of the market's strongest value stocks.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:10:23"
}