{
  "url": "https://www.nasdaq.com/article/bp-sees-worldwide-oil-demand-to-grow-at-a-slower-pace-in-19-cm1207957",
  "title": "BP Sees Worldwide Oil Demand to Grow at a Slower Pace in '19 - Nasdaq.com",
  "text": [
    "  BP plc BP  expects global oil demand to grow at a slower pace in 2019, per Reuters. The British energy giant foresees demand for the commodity to increase by less than 1 million barrels a day (B/D) in 2019, the source added. In contrast, the worldwide demand for crude grew 1.3 million B/D through 2018, as estimated by the International Energy Agency. The escalating tariff war between the United States and China, along with growing fears of recession have been denting demand for oil and refined petroleum products. The source added that the integrated energy company is forecasting oil refining margin to be soft in the December quarter of 2019. Since Sep 1, the Trump administration has imposed a 15% tariff on roughly $112 billion of imports from Beijing. America is set to levy a 15% tariff on a separate batch of Chinese goods of roughly $160 billion in value from Dec 15 onward. Beijing retaliated and started imposing additional tariffs on several imports from the United States to initiate its plan to impose extra duty on $75 billion of American goods. Of the total of 5,078 U.S. products that Beijing imports, 1,717 items have seen additional tariffs of 5% and 10%, respectively. The rest of the countermeasures will be put into effect on Dec 15. Importantly, for the first time, in more than a year that the two big economies began a trade war, China - one of the largest crude importing countries in the world - has levied a 5% tariff on U.S. oil products, which is likely to weigh on global energy demand. This is expected to prompt many analysts to downwardly revise 2019 estimates for worldwide crude demand. Overall, with oil demand remaining weak, the price of the commodity is unlikely to recover soon. This is taking a toll on upstream energy businesses. While refiners are taking advantages of low input cost, the demand for refined petroleum products remains low, in turn hurting the refining margin.  Zacks Rank & Key Picks  Currently, BP carries a Zacks Rank #3 (Hold). Some better-ranked players in the energy space include National Oilwell Varco Inc. NOV  , World Fuel Services Corporation INT  and Delek Logistics Partners LP DKL  . All the stocks carry a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   . National Oilwell is likely to see earnings growth of 75% in 2019. World Fuel beat the Zacks Consensus Estimate in each of the trailing four quarters, with the average being 16.4%. Delek Logistics is likely to see earnings growth of 4.9% through 2019.  It's Illegal in 42 States, But Investors Will Make   Billions Legally  In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year. That's twice as much as they spend on marijuana, legally or otherwise. Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.   See these 5 \"sin stocks\" now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Delek Logistics Partners, L.P. (DKL): Free Stock Analysis Report   National Oilwell Varco, Inc. (NOV): Free Stock Analysis Report   World Fuel Services Corporation (INT): Free Stock Analysis Report   BP p.l.c. (BP): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " BP plc BP  expects global oil demand to grow at a slower pace in 2019, per Reuters.",
    "The British energy giant foresees demand for the commodity to increase by less than 1 million barrels a day (B/D) in 2019, the source added. In contrast, the worldwide demand for crude grew 1.3 million B/D through 2018, as estimated by the International Energy Agency.",
    "The escalating tariff war between the United States and China, along with growing fears of recession have been denting demand for oil and refined petroleum products. The source added that the integrated energy company is forecasting oil refining margin to be soft in the December quarter of 2019.",
    "Since Sep 1, the Trump administration has imposed a 15% tariff on roughly $112 billion of imports from Beijing. America is set to levy a 15% tariff on a separate batch of Chinese goods of roughly $160 billion in value from Dec 15 onward.",
    "Beijing retaliated and started imposing additional tariffs on several imports from the United States to initiate its plan to impose extra duty on $75 billion of American goods. Of the total of 5,078 U.S. products that Beijing imports, 1,717 items have seen additional tariffs of 5% and 10%, respectively. The rest of the countermeasures will be put into effect on Dec 15.",
    "Importantly, for the first time, in more than a year that the two big economies began a trade war, China - one of the largest crude importing countries in the world - has levied a 5% tariff on U.S. oil products, which is likely to weigh on global energy demand. This is expected to prompt many analysts to downwardly revise 2019 estimates for worldwide crude demand.",
    "Overall, with oil demand remaining weak, the price of the commodity is unlikely to recover soon. This is taking a toll on upstream energy businesses. While refiners are taking advantages of low input cost, the demand for refined petroleum products remains low, in turn hurting the refining margin.",
    " Zacks Rank & Key Picks ",
    "Currently, BP carries a Zacks Rank #3 (Hold). Some better-ranked players in the energy space include National Oilwell Varco Inc. NOV  , World Fuel Services Corporation INT  and Delek Logistics Partners LP DKL  . All the stocks carry a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "National Oilwell is likely to see earnings growth of 75% in 2019.",
    "World Fuel beat the Zacks Consensus Estimate in each of the trailing four quarters, with the average being 16.4%.",
    "Delek Logistics is likely to see earnings growth of 4.9% through 2019.",
    " It's Illegal in 42 States, But Investors Will Make   Billions Legally ",
    "In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    "That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "  See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:22:00"
}