{
  "url": "https://www.nasdaq.com/article/what-happened-in-the-stock-market-today-cm1207582",
  "title": "What Happened in the Stock Market Today - Nasdaq.com",
  "text": [
    " Major benchmarks rebounded on Wednesday after Chinese   government authorities indicated they will cut their reserve   requirement ratio for banks \"in a timely manner,\" a move that   would encourage lending and potentially reaccelerate growth in   the world's second-largest economy. The   Dow Jones Industrial Average    (DJINDICES: ^DJI)  and the   S&P 500    (SNPINDEX: ^GSPC)  gained about 1%. Today's stock market    Data source: Yahoo! Finance.makeArticleAd(); As for   individual stocks    ,   PVH    (NYSE: PVH) rose after a notable insider bought more shares,   while   Starbucks    ' (NASDAQ: SBUX) fiscal 2020 earnings outlook failed to please   investors.   Image source: Getty Images.  A vote of confidence for PVH Shares of PVH, the parent of brands such as Tommy Hilfiger and   Calvin Klein, climbed 9.1% after an   SEC filing    indicated Chairman and CEO Chirico Emanuel spent nearly $10   million yesterday buying 133,155 shares at an average price of   just under $75. The move significantly increased Emanuel's stake   in PVH to 417,351 shares, worth a total of over $33.8 million as   of this writing. It's hard to blame Emanuel for his timing considering PVH was   trading near multiyear lows as of yesterday's close. The apparel   leader's stock was hurt by an   underwhelming quarterly report    in May and, more recently, conservative full-year guidance issued   last week. To blame for the latter, Emanuel said at the time,   were higher promotions amid weak customer traffic in both North   America and China. Considering both Emanuel's big purchase and the aforementioned   news of impending government stimulus in China, it's no surprise   PVH stock soared. Starbucks' lukewarm guidance Starbucks' stock dropped as much as 3.9% early this morning,   then largely recovered to close down around 0.7% after the global   coffee behemoth reiterated its fiscal 2019 earnings outlook, but   followed with disappointing guidance for next year. During a   presentation    this morning at the Goldman Sachs 26th Annual Global Retailing   Conference, Starbucks reaffirmed its outlook for earnings per   share in fiscal 2019 to arrive in the range of $2.80 to $2.82 --   good for growth of roughly 16% year over year. But it also said   that growth will come in part because management chose to pull   forward around $2 billion in share repurchases into fiscal 2019,   rather than in fiscal 2020 as previously planned. As such, given both normalized share repurchases and lapping   one-time tax benefits in fiscal 2019, Starbucks now expects   earnings per share in fiscal 2020 to increase \"below\" its   \"ongoing growth model of 10%\" -- a reduction from its previous   outlook for growth of at least 13%. Still, CFO Pat Grismer insisted the company's \"growth-at-scale   agenda is delivering against our expectations,\" and that its   long-term goal for double-digit EPS growth is \"fully intact.\" With shares trading near all-time highs after nearly doubling   over the past year, however, it's understandable that Starbucks'   stock pulled back modestly in response.   Find out why Starbucks is one of the 10 best stocks to buy now  Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* Tom and David just revealed their ten top stock picks for     investors to buy right now. Starbucks     is on the list      -- but there are nine others you may be overlooking.  Click here to get access to the full       list!     *Stock Advisor returns as of June 1, 2019       Steve Symington      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Starbucks. The Motley Fool has a     disclosure policy      .  ",
    "Major benchmarks rebounded on Wednesday after Chinese   government authorities indicated they will cut their reserve   requirement ratio for banks \"in a timely manner,\" a move that   would encourage lending and potentially reaccelerate growth in   the world's second-largest economy. The   Dow Jones Industrial Average    (DJINDICES: ^DJI)  and the   S&P 500    (SNPINDEX: ^GSPC)  gained about 1%.",
    "Data source: Yahoo! Finance.",
    "As for   individual stocks    ,   PVH    (NYSE: PVH) rose after a notable insider bought more shares,   while   Starbucks    ' (NASDAQ: SBUX) fiscal 2020 earnings outlook failed to please   investors.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Shares of PVH, the parent of brands such as Tommy Hilfiger and   Calvin Klein, climbed 9.1% after an   SEC filing    indicated Chairman and CEO Chirico Emanuel spent nearly $10   million yesterday buying 133,155 shares at an average price of   just under $75. The move significantly increased Emanuel's stake   in PVH to 417,351 shares, worth a total of over $33.8 million as   of this writing.",
    "It's hard to blame Emanuel for his timing considering PVH was   trading near multiyear lows as of yesterday's close. The apparel   leader's stock was hurt by an   underwhelming quarterly report    in May and, more recently, conservative full-year guidance issued   last week. To blame for the latter, Emanuel said at the time,   were higher promotions amid weak customer traffic in both North   America and China.",
    "Considering both Emanuel's big purchase and the aforementioned   news of impending government stimulus in China, it's no surprise   PVH stock soared.",
    "Starbucks' stock dropped as much as 3.9% early this morning,   then largely recovered to close down around 0.7% after the global   coffee behemoth reiterated its fiscal 2019 earnings outlook, but   followed with disappointing guidance for next year.",
    "During a   presentation    this morning at the Goldman Sachs 26th Annual Global Retailing   Conference, Starbucks reaffirmed its outlook for earnings per   share in fiscal 2019 to arrive in the range of $2.80 to $2.82 --   good for growth of roughly 16% year over year. But it also said   that growth will come in part because management chose to pull   forward around $2 billion in share repurchases into fiscal 2019,   rather than in fiscal 2020 as previously planned.",
    "As such, given both normalized share repurchases and lapping   one-time tax benefits in fiscal 2019, Starbucks now expects   earnings per share in fiscal 2020 to increase \"below\" its   \"ongoing growth model of 10%\" -- a reduction from its previous   outlook for growth of at least 13%.",
    "Still, CFO Pat Grismer insisted the company's \"growth-at-scale   agenda is delivering against our expectations,\" and that its   long-term goal for double-digit EPS growth is \"fully intact.\"",
    "With shares trading near all-time highs after nearly doubling   over the past year, however, it's understandable that Starbucks'   stock pulled back modestly in response.",
    "  Find out why Starbucks is one of the 10 best stocks to buy now  Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* Tom and David just revealed their ten top stock picks for     investors to buy right now. Starbucks     is on the list      -- but there are nine others you may be overlooking.  Click here to get access to the full       list!     *Stock Advisor returns as of June 1, 2019    ",
    " Find out why Starbucks is one of the 10 best stocks to buy now ",
    "Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "Tom and David just revealed their ten top stock picks for     investors to buy right now. Starbucks     is on the list      -- but there are nine others you may be overlooking.",
    " Click here to get access to the full       list! ",
    " *Stock Advisor returns as of June 1, 2019 ",
    "  Steve Symington      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Starbucks. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 04:56:54"
}