{
  "url": "https://www.nasdaq.com/article/exxon-mobil-stock-might-be-a-surprise-pick-during-a-recession-cm1206957",
  "title": "Exxon Mobil Stock Might Be a Surprise Pick During a Recession - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Increasingly, oil giant Exxon Mobil (NYSE: XOM ) is looking like a tale of two cities. On one hand, Exxon Mobil stock enjoyed a brilliant surge between January and the last few days of April. This run up more than made up for the losses incurred last December. However, since the end of April, shares have not looked the same.",
    "The volatility in the XOM stock price is understandable. Optimism toward a resolution of the U.S.-China trade war has given way to trepidation. With both sides trading barbs, seemingly unwilling to concede an inch due to pride and political pressures, there seems no end to the conflict. Moreover, because China owns the biggest automotive market in the world, economic deterioration there spells trouble for Exxon Mobil stock.",
    "On another level, our own economy isn't firing on all cylinders. The yield curve inverted again . This historically has been a reliable indicator for predicting recessions. If we do succumb, consumers will shut down unnecessary spending, including limiting transportation use to vital functions. Such a deflationary environment would negatively impact XOM stock.",
    "And if that weren't enough, Exxon Mobil stock faces another geopolitical headwind: the Organization of the Petroleum Exporting Countries, or OPEC. Prior to recent events, OPEC members adopted a deal to collectively cut production in an effort to support oil prices. However, countries like Russia aren't exactly going along with the plan, stirring discord among other members.",
    "In other words, we might see a flood of fresh supply. Based on simple economic principles, that would depress XOM stock. As such, is big oil too much of a big pain to bother with?",
    "Underlining the many headwinds for Exxon Mobil stock is a technological shift. As a Bloomberg article highlighted a few days ago, XOM is about to lose its top-ten status as one of the S&P 500 's biggest companies. This would be the first such instance since the index began almost a century ago.",
    "Additionally, the demotion represents the growing influence of technology and its replacement of industrial stalwarts. On the surface, that augurs unfavorably for Exxon Mobil stock as societies eye the end of hydrocarbon energy sources. However, that goal is far from becoming a reality.",
    "While industry experts predict demand for automotive gasoline will peak due to improving fuel efficiencies and the rise of electric vehicles, I believe these forecasts are misguided.",
    "For example, it's true that small sedans like the Toyota (NYSE: TM ) Corolla are popular worldwide. However, SUVs are gaining significant ground, and they may eventually overtake compact sedans. Combined with America's love for big vehicles, you have a recipe for robust oil demand. And that should translate to support for the XOM stock price.",
    "Further, let's consider how modern cars achieve their improved fuel efficiency. One of the most popular ways is to fit smaller-displacement engines with turbochargers . Admittedly, turbocharging - under certain conditions - does improve fuel efficiency on front-facing statistics.",
    "But on the back end, turbocharged vehicles are more complex than their naturally aspirated counterparts. They produce significantly more heat, and therefore require more upkeep , including frequent oil changes. Thus, fuel-efficient vehicles might hurt an oil company's gasoline revenues, but they can make up for it with alternative products.",
    "But the other automotive headwind against Exxon Mobil stock that analysts often cite is the rise of EVs. Since their early days about ten years ago, EV sales have veritably skyrocketed. As more people make the switch, fossil-fueled cars appear on their last leg.",
    "While EVs are popular, upgrading infrastructures for their mainstream integration is not. While charging stations are growing, monetizing them remains a huge challenge. Under a bull market, this effort is already an uphill battle. But in a recession? Forget about it.",
    "Furthermore, under a downturn, I see the EV dramatically losing its financial incentive. For instance, I've discussed ad nauseum the surprising inefficiencies and inconveniences of EVs.",
    "On another note, Tesla (NASDAQ: TSLA ) recently made a splash in business headlines regarding its Model 3 price cut . But that won't do anything about the other surprising cost of EV ownership: insurance premiums . Oh yeah, insuring the cheapest Tesla costs more than insuring a Porsche 911.",
    "It's one of the reasons why drivers are turning in their Teslas for presumably \"normal,\" fossil-fueled vehicles.",
    "Now, before you jump aboard XOM stock, I do think we will see volatility in oil prices. And that might spook investors, resulting in volatility in XOM. Because of the global economic context, shares are now more speculative than before.",
    "At the same time, I'm not buying into the existential crisis argument for Exxon Mobil stock. This is still very much a relevant, longer-term investment. Therefore, if you're risk tolerant, I'd take a small position now. Later, I'd wait for additional signals to see where this market is likely heading.",
    "As of this writing, Josh Enomoto did not hold a position in any of the aforementioned securities.",
    "The post Exxon Mobil Stock Might Be a Surprise Pick During a Recession appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:05:55"
}