{
  "url": "https://www.nasdaq.com/article/feathers-are-flying-in-the-chicken-sandwich-wars-cm1206974",
  "title": "Feathers Are Flying in the Chicken Sandwich Wars - Nasdaq.com",
  "text": [
    " Chick-fil-A still   rules the roost    when it comes to America's favorite chicken sandwich, but that   menu item is quickly becoming an essential for quick-serve   restaurants, and it's causing as big a stir as a fox in a   henhouse. Where's the beef?  Restaurant Brands International    (NYSE: QSR) launched a chicken sandwich nationwide at its Popeyes   chain on Aug. 12, only to see it sell out just two weeks later --   with no indication of when it will have enough to make a   return.   The Popeyes chicken sandwich is causing quite a stir in the     fast-food industry. Image source: Popeyes.makeArticleAd();  Its popularity prompted Chick-fil-A to tweet out a reminder   about who had the \"original\" chicken sandwich, which caused the   master social media trolls at   Wendy's    (NASDAQ: WEN) to snark, \"Y'all out here fighting about which of   these fools has the second best chicken sandwich.\" When   Popeyes answered that its rivals were looking \"thirsty,\" Wendy's   retorted, \"lol, guess that means the food's as dry as the   jokes.\" While it may seem to be all in good fun, the chicken sandwich   is Popeyes' biggest product launch in 30 years, and it means   billions of dollars in sales to the   fast-food industry    as chains try to establish a new pecking order. A call to action Data from NPD Group's receipt-harvesting service Checkout   shows that although hamburgers remain the top item ordered at   fast-food restaurants, chicken sandwiches grew 3.3% over the   12-month period ending in July at 2.3 billion servings. Burgers   fell to 6.4 billion servings. Which is likely why   McDonald's    (NYSE: MCD) franchisees are worried that their burger joint   doesn't have a chicken sandwich on its menu that can compete --   and why they're taking the matter into their own hands. McDonald's does have a chicken sandwich and nuggets. But it's   not the sort of \"world-class chicken sandwich\" the National   Owners Association said the restaurant needs when it issued a   list of actions    this past summer that it believes McDonald's must take to become   competitive again.  The Wall Street Journal    reported last week that the organization, which represents   McDonald's franchisees, told its members it would rectify that   and would unveil its own chicken sandwich at the group's annual   meeting in Dallas later this month. \"JFK called for a man on the   moon. Our call should be a category leading chicken sandwich,\" it   told members in a letter. Above and beyond burgers And it's not just chicken sandwiches that are whetting   consumer appetites. The KFC chain, owned by   Yum! Brands    (NYSE: YUM) , needed only five hours to be sold out of its   plant-based Beyond Fried Chicken nuggets and boneless wings from   Beyond Meat    (NASDAQ: BYND)  when it tested them at a single Atlanta   restaurant. It said it sold as much faux chicken in that time   period as it sells regular popcorn chicken in a week. Yum! plans   to use the results of the pilot to determine whether the   plant-based alternative should be rolled out more broadly. Chick-fil-A nevertheless has catapulted past Wendy's and   Burger King to become the third largest quick-serve restaurant in   the country (Starbucks is second), with sales up 17% last   year. Yet with Popeyes creating a sensation with its Southern-style   sandwich (McDonald's franchisees say that was the first time   Chick-fil-A \"was forced to blink\"), quality chicken sandwiches at   your favorite local fast-food restaurant may no longer be as rare   as hen's teeth.   10 stocks we like better than Restaurant Brands     International       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Restaurant Brands     International wasn't one of them! That's right -- they think     these 10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Rich Duprey      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Chick-fil-A still   rules the roost    when it comes to America's favorite chicken sandwich, but that   menu item is quickly becoming an essential for quick-serve   restaurants, and it's causing as big a stir as a fox in a   henhouse.",
    " Restaurant Brands International    (NYSE: QSR) launched a chicken sandwich nationwide at its Popeyes   chain on Aug. 12, only to see it sell out just two weeks later --   with no indication of when it will have enough to make a   return.",
    "  The Popeyes chicken sandwich is causing quite a stir in the     fast-food industry. Image source: Popeyes.makeArticleAd(); ",
    "The Popeyes chicken sandwich is causing quite a stir in the     fast-food industry. Image source: Popeyes.",
    "Its popularity prompted Chick-fil-A to tweet out a reminder   about who had the \"original\" chicken sandwich, which caused the   master social media trolls at   Wendy's    (NASDAQ: WEN) to snark, \"Y'all out here fighting about which of   these fools has the second best chicken sandwich.\" When   Popeyes answered that its rivals were looking \"thirsty,\" Wendy's   retorted, \"lol, guess that means the food's as dry as the   jokes.\"",
    "While it may seem to be all in good fun, the chicken sandwich   is Popeyes' biggest product launch in 30 years, and it means   billions of dollars in sales to the   fast-food industry    as chains try to establish a new pecking order.",
    "Data from NPD Group's receipt-harvesting service Checkout   shows that although hamburgers remain the top item ordered at   fast-food restaurants, chicken sandwiches grew 3.3% over the   12-month period ending in July at 2.3 billion servings. Burgers   fell to 6.4 billion servings.",
    "Which is likely why   McDonald's    (NYSE: MCD) franchisees are worried that their burger joint   doesn't have a chicken sandwich on its menu that can compete --   and why they're taking the matter into their own hands.",
    "McDonald's does have a chicken sandwich and nuggets. But it's   not the sort of \"world-class chicken sandwich\" the National   Owners Association said the restaurant needs when it issued a   list of actions    this past summer that it believes McDonald's must take to become   competitive again.",
    " The Wall Street Journal    reported last week that the organization, which represents   McDonald's franchisees, told its members it would rectify that   and would unveil its own chicken sandwich at the group's annual   meeting in Dallas later this month. \"JFK called for a man on the   moon. Our call should be a category leading chicken sandwich,\" it   told members in a letter.",
    "And it's not just chicken sandwiches that are whetting   consumer appetites. The KFC chain, owned by   Yum! Brands    (NYSE: YUM) , needed only five hours to be sold out of its   plant-based Beyond Fried Chicken nuggets and boneless wings from   Beyond Meat    (NASDAQ: BYND)  when it tested them at a single Atlanta   restaurant. It said it sold as much faux chicken in that time   period as it sells regular popcorn chicken in a week. Yum! plans   to use the results of the pilot to determine whether the   plant-based alternative should be rolled out more broadly.",
    "Chick-fil-A nevertheless has catapulted past Wendy's and   Burger King to become the third largest quick-serve restaurant in   the country (Starbucks is second), with sales up 17% last   year.",
    "Yet with Popeyes creating a sensation with its Southern-style   sandwich (McDonald's franchisees say that was the first time   Chick-fil-A \"was forced to blink\"), quality chicken sandwiches at   your favorite local fast-food restaurant may no longer be as rare   as hen's teeth.",
    "  10 stocks we like better than Restaurant Brands     International       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Restaurant Brands     International wasn't one of them! That's right -- they think     these 10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Restaurant Brands     International       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Restaurant Brands     International wasn't one of them! That's right -- they think     these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Rich Duprey      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:45:00"
}