{
  "url": "https://www.nasdaq.com/article/lebanon-still-studying-plans-for-possible-dollar-debt-sale-20190912-00416",
  "title": "Lebanon still studying plans for possible dollar debt sale - Nasdaq.com",
  "text": [
    "BEIRUT, Sept 12 (Reuters) - Lebanon is still considering the option of a new dollar debt sale and has not yet announced any issuance, Finance Minister Ali Hassan Khalil told Reuters on Thursday.",
    "Last week Khalil said that one option in front of Lebanon for paying its debt obligations for the year would be to issue $1.5-2 billion in dollar bonds.",
    "\"The ministry has not announced any issuance and has not taken any step yet regarding bonds,\" he told Reuters.",
    "It has not issued Eurobonds since a $3 billion sale in May 2018, which came shortly after a $5.5 billion debt swap with the central bank, which was issued with Eurobonds in exchange for Lebanese pound T-Bills.   ",
    "Lebanon did not carry out a previously announced May 20 issue which would have covered its foreign currency obligations for the rest of 2019. ",
    "Sources told Reuters that a May debt maturity was instead paid off with the central bank providing funding to the finance ministry. ",
    "\"We need now to sell more bonds in foreign currency that we will issue. The (central bank) governor and I will come up with a plan for how we can work on attracting part of that amount that could maybe be between $1.5-2 billion, to cover what will become due from previous issuances,\" Khalil told a talk show on Lebanon'sMTV television a week ago.",
    "\"We have already agreed there will be a number of tools that complement each other. Within this are issuances at low interest rates, (and) a programme of issuing Eurobonds that we need from now to the end of the month,\" he said.",
    "With one of the world's highest debt burdens, low growth and crumbling infrastructure, Lebanon's economy is struggling and authorities are seeking to implement reforms to ward off a crisis.",
    "Three weeks ago Fitch ratings agency downgraded the sovereign to CCC on debt-servicing concerns. At the same time, S&P Global affirmed Lebanon's credit rating at B-/B with a negative outlook, saying it considered Lebanon's foreign exchange reserves sufficient to service government debt in the \"near term\".",
    "With regional political tensions rising and slow progress by politicians on enacting reforms needed to secure international donor funding and put the economy on a sound footing, Eurobond yields have risen to new highs. ",
    "The yield -- a proxy of the government's borrowing costs -- on a 2021 maturing bond is currently 19.8%. "
  ],
  "published_datetime": "2019-09-12 08:02:00"
}