{
  "url": "https://www.nasdaq.com/article/heres-why-you-should-invest-in-haemonetics-hae-right-now-cm1206602",
  "title": "Here's Why You Should Invest in Haemonetics (HAE) Right Now - Nasdaq.com",
  "text": [
    "  Haemonetics Corporation HAE  has an impressive growth trajectory, courtesy of the NexSys PCS plasmapheresis system. The stock has rallied 18.6% in the past year compared with the  industry  's 1.4% growth. This renowned global provider of blood management solutions to customers such as blood and plasma collectors as well as hospitals has a market cap of $6.84 billion. The company has an earnings growth rate of 13.5% for the next three to five years. Banking on solid prospects, this Zacks Rank #2 (Buy) stock is an attractive pick for investors at the moment. You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .      Potential Upsides of Plasma Franchise  :   In the fiscal first quarter, Plasma, the company's largest business segment, registered 17% revenue growth in North America, driven by price, volume and mix. The company has completed more than 5 million YES procedures, resulting in more than 115,000 incremental leaders of plasma collected. Per management, pricing from NexSys PCS has started contributing to the top line. The company is progressing well with the development and launch of the NexSys PCS plasmapheresis system.   Huge Potential of Hemostasis Management Franchise  :  Lately, under the Hospital business, Hemostasis Management has been delivering robust performance. During the first quarter, the company completed the OrthoPAT end-of-life program. The phased launch of SafeTrace Tx is progressing well. The company has also been witnessing strong early market adoption of the software, which has accelerated its rollout. Adoption of the BloodTrack software, which delivers information at bedside, is expected to continue growing globally, particularly in the United States. R&D projects, including the planned global launch of a four-channel platelet mapping cartridge, are well on track.    Strong Balance Sheet:    Haemonetics exited the first quarter of fiscal 2020 with cash and cash equivalents of $190.2 million compared with $169.4 million at the end of fiscal 2019. Long-term debt at the end of the first quarter was $318.1 million. The company generated operating cash flow of $2.6 million in the first quarter. The company also reported free cash flow (before restructuring and turnaround costs) of $5.3 million during the period. This indicates promising returns to shareholders.  Which Way Are Estimates Treading?  For the second quarter of fiscal 2020, the Zacks Consensus Estimate for earnings is pegged at 71 cents, which indicates a 26.8% rise from the year-ago quarter's reported figure. The same for revenues is pegged at $249.3 million, calling for year-over-year growth of 3.2%. For 2019, the Zacks Consensus Estimate for earnings is pegged at $3.03, suggesting 26.8% year-over-year growth. The same for revenues is pegged at $1.01 billion, implying a 4.1% rise from the prior-year quarter's reported figure.  Other Stocks Worth a Look  A few other top-ranked stocks in the broader medical space are Medtronic MDT  , Baxter BAX  and NuVasive NUVA  , each carrying a Zacks Rank #2. Medtronic's long-term earnings growth rate is expected to be 7.13%. Baxter's long-term earnings growth rate is projected at 12.8%. NuVasive's long-term earnings growth rate is expected to be 12.75%.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Medtronic PLC (MDT): Free Stock Analysis Report   NuVasive, Inc. (NUVA): Free Stock Analysis Report   Baxter International Inc. (BAX): Free Stock Analysis Report   Haemonetics Corporation (HAE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Haemonetics Corporation HAE  has an impressive growth trajectory, courtesy of the NexSys PCS plasmapheresis system.",
    "The stock has rallied 18.6% in the past year compared with the  industry  's 1.4% growth.",
    "This renowned global provider of blood management solutions to customers such as blood and plasma collectors as well as hospitals has a market cap of $6.84 billion. The company has an earnings growth rate of 13.5% for the next three to five years.",
    "Banking on solid prospects, this Zacks Rank #2 (Buy) stock is an attractive pick for investors at the moment. You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "  Potential Upsides of Plasma Franchise  :   In the fiscal first quarter, Plasma, the company's largest business segment, registered 17% revenue growth in North America, driven by price, volume and mix. The company has completed more than 5 million YES procedures, resulting in more than 115,000 incremental leaders of plasma collected. Per management, pricing from NexSys PCS has started contributing to the top line. The company is progressing well with the development and launch of the NexSys PCS plasmapheresis system.",
    "  Huge Potential of Hemostasis Management Franchise  :  Lately, under the Hospital business, Hemostasis Management has been delivering robust performance. During the first quarter, the company completed the OrthoPAT end-of-life program. The phased launch of SafeTrace Tx is progressing well. The company has also been witnessing strong early market adoption of the software, which has accelerated its rollout. Adoption of the BloodTrack software, which delivers information at bedside, is expected to continue growing globally, particularly in the United States. R&D projects, including the planned global launch of a four-channel platelet mapping cartridge, are well on track. ",
    "  Strong Balance Sheet:    Haemonetics exited the first quarter of fiscal 2020 with cash and cash equivalents of $190.2 million compared with $169.4 million at the end of fiscal 2019. Long-term debt at the end of the first quarter was $318.1 million. The company generated operating cash flow of $2.6 million in the first quarter. The company also reported free cash flow (before restructuring and turnaround costs) of $5.3 million during the period. This indicates promising returns to shareholders.",
    " Which Way Are Estimates Treading? ",
    "For the second quarter of fiscal 2020, the Zacks Consensus Estimate for earnings is pegged at 71 cents, which indicates a 26.8% rise from the year-ago quarter's reported figure. The same for revenues is pegged at $249.3 million, calling for year-over-year growth of 3.2%.",
    "For 2019, the Zacks Consensus Estimate for earnings is pegged at $3.03, suggesting 26.8% year-over-year growth. The same for revenues is pegged at $1.01 billion, implying a 4.1% rise from the prior-year quarter's reported figure.",
    " Other Stocks Worth a Look ",
    "A few other top-ranked stocks in the broader medical space are Medtronic MDT  , Baxter BAX  and NuVasive NUVA  , each carrying a Zacks Rank #2.",
    "Medtronic's long-term earnings growth rate is expected to be 7.13%.",
    "Baxter's long-term earnings growth rate is projected at 12.8%.",
    "NuVasive's long-term earnings growth rate is expected to be 12.75%.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:16:00"
}