{
  "url": "https://www.nasdaq.com/article/saudi-russia-call-for-compliance-with-opec-supply-curbs-20190912-00081",
  "title": "Saudi, Russia call for compliance with OPEC+ supply curbs - Nasdaq.com",
  "text": [
    "By Rania El Gamal, Dahlia Nehme and Maha El Dahan",
    "ABU DHABI, Sept 12 (Reuters) - OPEC agreed on Thursday to trim oil output by asking over-producing members Iraq and Nigeria to bring production in line with their targets as the group strives to prevent a glut amid soaring U.S. production and a slowing global economy.",
    "Oil prices  have dropped below $60 per barrel in recent weeks from their 2019 peaks of $75 as fears of a global recession outweigh concerns about falling supply from sanctions-hit Iran and Venezuela.",
    "OPEC+ has overcomplied on average with its agreed cut of 1.2 million barrels per day (bpd) as Iranian and Venezuelan exports collapsed due to sanctions. But some members, such as Iraq and Nigeria, have been producing above their quota.",
    "Iraq, OPEC's second-largest oil producer, pledged on Thursday to reduce output by 175,000 bpd by October, while Nigeria is to reduce supply by 57,000 bpd.",
    "OPEC's de facto leader, Saudi Arabia, will continue pumping less than its target, said Prince Abdulaziz bin Salman, who took over as energy minister from Khalid al-Falih on Sunday.",
    "The kingdom will voluntarily overdeliver on its targets and pump just below 10 million bpd, Prince Abdulaziz said.",
    "He said the meeting on Thursday also discussed rising U.S. shale output and exports, a global economic slowdown and a possible softening of U.S. sanctions on OPEC member Iran.",
    "Any formal decision on deeper oil cuts could be taken only at the next OPEC+ meeting in December, the prince said.",
    "\"I can tell you quite frankly that in all deliberations we have discussed all the potential uncertainties as any responsible organisation and we are mindful of them,\" Prince Abdulaziz said.",
    "\"There is clear readiness to continue to be responsible and responsive.\"",
    "He added that the ministerial committee would gather again before the full OPEC meeting in December.",
    "OPEC, Russia and other non-members agreed in December to reduce production by 1.2 million bpd - or 1.2% of global supply - from Jan. 1 this year.",
    "OPEC's share of the cut, which now runs to March 2020, is 800,000 bpd, delivered by 11 members and exempting Iran, Libya and Venezuela.",
    "Oil prices tumbled more than 2% on Wednesday after a report that U.S. President Donald Trump was considering easing sanctions on Iran, which could boost global crude supply at a time of lingering worries about energy demand.",
    "Iraq has been raising its production and exports steeply in recent years, while Iran's exports have collapsed over the past year because of U.S. sanctions.",
    "Iraq has been pumping 4.8 million bpd in recent months instead of its target of 4.512 million. Nigeria produced 1.84 million bpd in August versus its target of 1.685 million.",
    "For a Reuters OPEC output survey, see OPEC/O"
  ],
  "published_datetime": "2019-09-12 03:24:00"
}