{
  "url": "https://www.nasdaq.com/article/humana-hum-ties-up-to-boost-medicare-advantage-network-cm1208130",
  "title": "Humana (HUM) Ties Up to Boost Medicare Advantage Network - Nasdaq.com",
  "text": [
    "Humana Inc.HUM has entered into a new partnership with Iora Health to add 11 more Iora Primary care practices to its Medicare Advantage network in areas like Texas, Georgia and Arizona. With this deal, Humana Medicare Advantage members can now experience an impactful, relationship-based primary care.\r\n Notably, people of Arizona, Colorado, Georgia and Washington are already benefiting from the relationship of these two companies. In 2019, another chain of Medicare focused primary care practices is being launched in Phoenix and Atlanta as well as for the very first time in Houston.\r\n These practices in particular provide Humana Medicare Advantage HMO, Preferred Provider Organization (PPO) and Dual Eligible Special Needs, which can be accessed by people eligible for Medicare and Medicaid plans along with Original Medicare with or without the most supplement plans and the access to Iora's care model.\r\n Iora is leading the market when it comes to changing the way primary care is being delivered. Patients experience value-based care with longer appointments, assistance from an integrated team that takes care of the patient's health, convenience and access to healthcare professionals for emergencies via phone plus same or next-day appointments for urgencies, etc.\r\n Iora's knowhow combined with Humana's wide array of in-network experts aims at delivering a coordinated healthcare plan to patients.\r\n Meanwhile, Humana is expanding its network through these new practice locations so that its members get better health outcomes from the same. Both Humana and Iora Health have worked together over the years to help Medicare Advantage health plan members across the country.\r\n Last month, Humana also signed an agreement with McLaren Physician Partners to boost in-network facilities for Humana's Medicare Advantage members in Michigan, who are seeking treatment at the McLaren Health Care hospitals and outpatient facilities.\r\n Humana has a comprehensive and expanding value-based care existence. As of Jun 30, 2019, it had around 2.3 million individual Medicare Advantage members and 115,000 commercial members across 43 states and Puerto Rico. It should be noted that it has a total of around 4 million Medicare Advantage members.\r\n Shares of the Zacks Rank #3 (Hold) company have lost 17.8% in a year, wider than the industry 's decline of 16.1%.",
    "Stocks to Consider\r\n Investors interested in the medical sector can take a look at some better-ranked stocks like UnitedHealth Group Incorporated UNH , Universal Health Services, Inc. UHS and Molina Healthcare, Inc. MOH .\r\n UnitedHealth Group works as a diversified health care company. In the trailing four quarters, it came up with average beat of 3.4%. The company currently carries a Zacks Rank #2 (Buy). You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\r\n Universal Health owns and operates acute care hospitals, outpatient facilities and behavioral health care facilities. In the last four quarters, the company delivered average beat of 4.5%. The stock is a Zacks #2 Ranked player.\r\n Molina Healthcare provides managed health care services under the Medicaid and Medicare programs as well as via the state insurance marketplaces. The company currently sports a Zacks Rank #1 and managed to pull off average four-quarter positive surprise of 66.9%.",
    "It's Illegal in 42 States, But Investors Will Make Billions Legally\r\n In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.\r\n That's twice as much as they spend on marijuana, legally or otherwise.\r\n Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:13:00"
}