{
  "url": "https://www.nasdaq.com/article/are-social-media-users-abandoning-facebook-and-instagram-cm1210676",
  "title": "Are Social Media Users Abandoning Facebook and Instagram? - Nasdaq.com",
  "text": [
    "  Facebook    (NASDAQ: FB) and its subsidiary Instagram are among the most   widely used social networking apps in the world, but a   recent   Bank of America    report claims that mobile downloads of both apps are   declining. The report, which cites data from research firm Sensor Tower,   claims that combined downloads of Facebook and Instagram fell 13%   year-over-year in the third quarter so far. Facebook's downloads   declined 15%, while Instagram's downloads dropped 9%.   Image source: Getty Images.makeArticleAd();  Bank of America also notes that downloads of   Snap    's (NYSE: SNAP) Snapchat,   Twitter    (NYSE:    TWTR    ) , and   Pinterest    (NYSE: PINS) all rose year-over-year during the same period.   Let's take a closer look at Facebook and see why the tech giant   might be losing its momentum. Facebook's user growth only comes from certain markets Facebook's total monthly active users (MAUs) rose 8%   annually to 2.41 billion last quarter. However, most of that   growth came from overseas markets.  Source: Facebook second quarter report. That's a big problem for Facebook, since its users in the U.S.   and Canada generated 48% of its revenue last quarter despite only   accounting for 10% of its total MAUs. Its users in Europe   generated 24% of its revenue but only accounted for 16% of its   MAUs. Simply put, Facebook generates most of its revenue   from slower-growth developed markets, but most its user growth   comes from lower-revenue developing markets. Facebook doesn't regularly update its number of Instagram   users, but it announced that the platform's total MAUs doubled   from 500 million to 1 billion between June 2016 and June 2018.   The   tech giant    is increasingly depending on Instagram's growth -- especially in   developed markets -- to offset Facebook's slower growth. Saturation, alienation, and competition Facebook faces three main problems in developed markets like   the U.S. First, the market is heavily saturated. Pew Research   claims that 69% of American adults currently use Facebook, and   that percentage has remained unchanged since 2016. Second, Facebook alienated its users with a seemingly endless   streak of privacy, security, and PR debacles, which   included the Cambridge Analytica data breach, data leaks from   linked third-party apps, severe security problems in WhatsApp,   and the proliferation of fake news campaigns at home   and abroad. Earlier this year, a poll by NBC News and The Wall Street   Journal found that 60% of Americans no longer trusted Facebook   with their personal data, compared to the 37% and 28% who didn't   trust   Alphabet    's Google and   Amazon    , respectively.   Image source: Getty Images.  Lastly, Facebook still faces tough competition from niche   rivals like Snapchat, Twitter, and Pinterest. 41% of U.S. teens   ranked Snapchat as their favorite social network, according   to Piper Jaffray, compared to 35% for Instagram and just 6% for   Facebook. Facebook repeatedly tried to   stomp out    Snapchat by cloning its most popular features in Instagram, yet   Snapchat's daily active user growth   still accelerated    last quarter. Twitter remains the top platform for following celebrities,   brands, real-time news, and debates, while Pinterest's platform   of interest-based pins remains refreshingly detached from a   user's personal life. A recent Cowen & Co. study also found   that 48% of Pinterest's users use the platform to   find and shop    for products -- compared to just 10% of Instagram users. Sensor Tower's numbers indicate that more social media users   are gravitating toward these platforms as Facebook's growth   peaks. Facebook previously offered users an illusion of choice   with Instagram -- but that illusion is fading as Facebook tethers   Instagram   more tightly    to its core app with cross-platform features. Should Facebook investors be concerned? Bank of America's report is noteworthy, but it should be taken   with a grain of salt. Mobile downloads aren't directly comparable   to active users, Facebook's apps are already pre-installed on   many new phones (which reduces recorded downloads), and it's   unclear if Sensor Tower's numbers cover all of Facebook and   Instagram's higher-growth overseas markets. Nonetheless, it supports the bearish claims that Facebook is   running out of room to grow and that its recent missteps are   alienating users. Therefore, investors should see if that case   has merit when Facebook releases its third-quarter report next   month.   10 stocks we like better than Facebook       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Facebook wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. Suzanne Frey, an executive at Alphabet, is a member     of The Motley Fool's board of directors. Randi Zuckerberg, a     former director of market development and spokeswoman for     Facebook and sister to its CEO, Mark Zuckerberg, is a member of     The Motley Fool's board of directors.     Leo Sun      owns shares of Amazon, Facebook, and Snap Inc. The Motley Fool     owns shares of and recommends Alphabet (A shares), Alphabet (C     shares), Amazon, Facebook, and Twitter. The Motley Fool owns     shares of Pinterest. The Motley Fool has a     disclosure policy      .  ",
    " Facebook    (NASDAQ: FB) and its subsidiary Instagram are among the most   widely used social networking apps in the world, but a   recent   Bank of America    report claims that mobile downloads of both apps are   declining.",
    "The report, which cites data from research firm Sensor Tower,   claims that combined downloads of Facebook and Instagram fell 13%   year-over-year in the third quarter so far. Facebook's downloads   declined 15%, while Instagram's downloads dropped 9%.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Bank of America also notes that downloads of   Snap    's (NYSE: SNAP) Snapchat,   Twitter    (NYSE:    TWTR    ) , and   Pinterest    (NYSE: PINS) all rose year-over-year during the same period.   Let's take a closer look at Facebook and see why the tech giant   might be losing its momentum.",
    "Facebook's total monthly active users (MAUs) rose 8%   annually to 2.41 billion last quarter. However, most of that   growth came from overseas markets.",
    "Source: Facebook second quarter report.",
    "That's a big problem for Facebook, since its users in the U.S.   and Canada generated 48% of its revenue last quarter despite only   accounting for 10% of its total MAUs. Its users in Europe   generated 24% of its revenue but only accounted for 16% of its   MAUs. Simply put, Facebook generates most of its revenue   from slower-growth developed markets, but most its user growth   comes from lower-revenue developing markets.",
    "Facebook doesn't regularly update its number of Instagram   users, but it announced that the platform's total MAUs doubled   from 500 million to 1 billion between June 2016 and June 2018.   The   tech giant    is increasingly depending on Instagram's growth -- especially in   developed markets -- to offset Facebook's slower growth.",
    "Facebook faces three main problems in developed markets like   the U.S. First, the market is heavily saturated. Pew Research   claims that 69% of American adults currently use Facebook, and   that percentage has remained unchanged since 2016.",
    "Second, Facebook alienated its users with a seemingly endless   streak of privacy, security, and PR debacles, which   included the Cambridge Analytica data breach, data leaks from   linked third-party apps, severe security problems in WhatsApp,   and the proliferation of fake news campaigns at home   and abroad.",
    "Earlier this year, a poll by NBC News and The Wall Street   Journal found that 60% of Americans no longer trusted Facebook   with their personal data, compared to the 37% and 28% who didn't   trust   Alphabet    's Google and   Amazon    , respectively.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Lastly, Facebook still faces tough competition from niche   rivals like Snapchat, Twitter, and Pinterest. 41% of U.S. teens   ranked Snapchat as their favorite social network, according   to Piper Jaffray, compared to 35% for Instagram and just 6% for   Facebook. Facebook repeatedly tried to   stomp out    Snapchat by cloning its most popular features in Instagram, yet   Snapchat's daily active user growth   still accelerated    last quarter.",
    "Twitter remains the top platform for following celebrities,   brands, real-time news, and debates, while Pinterest's platform   of interest-based pins remains refreshingly detached from a   user's personal life. A recent Cowen & Co. study also found   that 48% of Pinterest's users use the platform to   find and shop    for products -- compared to just 10% of Instagram users.",
    "Sensor Tower's numbers indicate that more social media users   are gravitating toward these platforms as Facebook's growth   peaks. Facebook previously offered users an illusion of choice   with Instagram -- but that illusion is fading as Facebook tethers   Instagram   more tightly    to its core app with cross-platform features.",
    "Bank of America's report is noteworthy, but it should be taken   with a grain of salt. Mobile downloads aren't directly comparable   to active users, Facebook's apps are already pre-installed on   many new phones (which reduces recorded downloads), and it's   unclear if Sensor Tower's numbers cover all of Facebook and   Instagram's higher-growth overseas markets.",
    "Nonetheless, it supports the bearish claims that Facebook is   running out of room to grow and that its recent missteps are   alienating users. Therefore, investors should see if that case   has merit when Facebook releases its third-quarter report next   month.",
    "  10 stocks we like better than Facebook       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Facebook wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Facebook       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Facebook wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. Suzanne Frey, an executive at Alphabet, is a member     of The Motley Fool's board of directors. Randi Zuckerberg, a     former director of market development and spokeswoman for     Facebook and sister to its CEO, Mark Zuckerberg, is a member of     The Motley Fool's board of directors.     Leo Sun      owns shares of Amazon, Facebook, and Snap Inc. The Motley Fool     owns shares of and recommends Alphabet (A shares), Alphabet (C     shares), Amazon, Facebook, and Twitter. The Motley Fool owns     shares of Pinterest. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:00:00"
}