{
  "url": "https://www.nasdaq.com/article/when-the-trade-war-ends-jd-stock-has-a-clear-shot-at-50-cm1206849",
  "title": "When the Trade War Ends, JD Stock Has a Clear Shot at $50 - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "JD.com (NYSE: JD ) reported its second-quarter earnings August 13. They were better than expected sending JD stock up by more than 8% on the news. Unfortunately, it's gone sideways ever since. ",
    "JD traded at $50 as recently as January 2018. It fell all the way to $19 that year on allegations CEO and founder Richard Liu raped a 21-year-old student in Minnesota . Although charges were never laid, JD stock's never fully recovered from the fallout. And the trade war between the U.S. and China didn't help its cause. ",
    "As for the business, the latest quarterly results suggest it is starting to turn the corner. However, despite the positive earnings surprise and being up 47% year to date through August 29, JD stock's gotten stuck at $30.",
    "So, investors are left wondering if JD.com is a $30 or a $50 stock. Here are my arguments for both stock prices.",
    "InvestorPlace contributor Laura Hoy recently wrote that JD's work to build its logistics work is starting to pay off for the company as it gets higher-margin, third-party e-commerce revenues. Furthermore, as the company's gotten involved in the digital advertising space, margins have jumped higher. ",
    "One only needs to look at the growth Amazon (NASDAQ: AMZN ) is experiencing from its foray into digital advertising to know that it's a lucrative endeavor. eMarketer estimates that Amazon's U.S. ad business will grow 53% in 2019 to $11.3 billion. ",
    "So, what's JD.com's ad business look like at the moment?",
    "JD doesn't separate its ad revenue. It's included with the fees the company generates from third-party sellers using its marketplaces. In the first six months of 2019, marketplace and advertising revenues were $2.8 billion , 25% higher than a year earlier. ",
    "During its Q2 2019 conference call, CFO Sidney Huang did say that the company's 42% increase in net service revenues during the quarter were \"driven by strong momentum from third-party logistics and advertising revenues.\"",
    "Although its net services revenue only accounted for 11.2% of its overall revenue, the margins are much higher than those for its own ecommerce sales. ",
    "More importantly, a number of analysts were asking questions about its advertising business during the Q&A after the conference call. You can be sure that they will continue to pester the company for greater detail. Investors should continue to pay attention to this aspect of its business. ",
    "Like Amazon, it will be bigger than most realize. ",
    "One of the reasons I prefer Alibaba (NYSE: BABA ) over JD is because of the free cash flow it generates.",
    "Well, in the first six months of the year, JD had $2.8 billion in free cash flow on $39.5 billion in revenue for an FCF margin of 7.1%. In Alibaba's first quarter ended June 30, it had free cash flow of $3.8 billion on revenue of $16.7 billion for an FCF margin of 22.8%. ",
    "Clearly, JD can't hold a candle to Alibaba, but if it continues to grow the services side of its business, I could see the gap tightening. ",
    "JD's headed in the right direction.",
    "JD is making headway in its business. There's no question. However, the volatility of its free cash flow makes its stock awfully difficult to commit to. ",
    "In the second quarter, JD had a 40% increase in its free cash flow to $2.7 billion . That's an impressive figure. What you might not notice about the jump in free cash flow is that a big chunk of it came from the sale of some of its logistics and real estate properties. Otherwise, its free cash flow wouldn't have been nearly as high. ",
    "Until JD generates consistent free cash flow, its stock isn't nearly as attractive as BABA's. That's especially true if the trade war drags on well into 2020. ",
    "Other than its inconsistent free cash flow generation, there's very little to say that's negative about JD.com. ",
    "InvestorPlace's Will Healy recently stated that JD has tested $26 twice this summer. On both occasions, it's bounced higher. He believes you should wait for a third-time lucky. ",
    "I believe he's right. ",
    "Is JD a $30 or $50 stock?",
    "It's a $50 stock disguised as a $30 stock. Once a trade agreement is reached, $50 will be easy pickings.",
    "At the time of this writing Will Ashworth did not hold a position in any of the aforementioned securities.",
    "The post When the Trade War Ends, JD Stock Has a Clear Shot at $50 appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:58:49"
}