{
  "url": "https://www.nasdaq.com/article/stock-market-news-for-sep-3-2019-cm1206724",
  "title": "Stock Market News For Sep 3, 2019 - Nasdaq.com",
  "text": [
    " Markets closed higher on Friday as positive developments on the trade war front boosted the investor sentiment. The three major benchmarks posted their best weekly performance since June. However, for the month, the benchmarks posted sharp losses. The Dow Jones Industrial Average increased 0.2%, to close at 26,403.28. The S&P 500 increased 0.1% to close at 2,926.46. The tech-laden Nasdaq Composite Index closed at 7,962.88, losing 0.1%. The fear-gauge CBOE Volatility Index (VIX) increased 16.1% to close at 20.75. Advancers outnumbered decliners on the NYSE by a 2.14-to-1 ratio. On Nasdaq, a 1.79-to-1 ratio favored advancing issues.  How Did the Benchmarks Perform?  The Dow gained 41 points to close in the green. Shares of Walgreens Boots Alliance WBA  and UnitedHealth Group UNH  gained 1.6% and 1.5%, respectively and supported gains for the 30-stock index. The S&P 500 rose 1.9 points to end in positive territory. Of the 11 major sectors of the S&P 500, seven ended in the green, with materials leading the advancers. The Materials Select Sector SPDR Fund (XLB) rose 0.7% on Friday. Meanwhile, the Nasdaq slid 10.5 points to close in the red. Shares of Apple AAPL  fell 0.3% and weighed on the Nasdaq. The stock carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  .   US & China Maintain \"Effective Communication\" on   Trade War  At a news briefing in Beijing on Aug 30, China's foreign ministry announced that the United States and China were maintaining \"effective communication\" related to trade war. The statement is being largely viewed as an indication the both the countries would resume trade talks in September. China's commerce ministry also stated that a fresh round of meetings in September was being discussed by the two parties. Such developments led to broad based gains for the markets.  Economic Data  On the economic data front, personal income for the month of July rose 0.1%, lower than the consensus estimate of 0.3%. Meanwhile, personal spending rose 0.6% in July, higher than the consensus estimate of 0.6%. Core PCE inflation increased 0.2% in July, in line with the consensus estimate. Notably, consumer prices rose 1.4% on year-over-year basis.  Weekly & Monthly Roundup  For the week, the Dow, the S&P 500 and the Nasdaq increased 3%, 2.8% and 2.7%, respectively. While the Dow notched up its best weekly gain since Jun 7, the Nasdaq booked its biggest weekly advance since Jun21. Trade tensions between the United States and China appeared to ease over the week. Stocks moved higher after China hinted its unwillingness to retaliate against Washington's new round of tariffs. Further, a revision of second-quarter GDP growth revealed an even stronger consumer spending during the period, positively impacting stocks. Meanwhile, for the month, the Dow, the S&P 500 and the Nasdaq lost 1.7%, 1.8% and 2.6%, respectively. Further, the three major benchmarks posted their first monthly decline since May and the second overall for this year. Intensifying trade conflict between the United States and China was the main reason for equity markets losses in August. China decided to impose import duties on U.S. agricultural products and its central bank fixed the mid-point of yuan to below the psychological level of 7 per U.S. dollar. This rattled the markets. Further, the yield on 10-year government bond fell below the 2-year government bond, triggering investor's concern of an impending recession. Meanwhile, the central bank cut its benchmark rates in a bid to support the American economy amid slowing global growth. However, some investors were disappointed with the extent of the rate cut and Fed Chair Jerome Powell's comments suggesting the rate cut was only a \"mid-cycle adjustment to policy.\"  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Apple Inc. (AAPL): Free Stock Analysis Report   UnitedHealth Group Incorporated (UNH): Free Stock Analysis Report   Walgreens Boots Alliance, Inc. (WBA): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Markets closed higher on Friday as positive developments on the trade war front boosted the investor sentiment. The three major benchmarks posted their best weekly performance since June. However, for the month, the benchmarks posted sharp losses.",
    "The Dow Jones Industrial Average increased 0.2%, to close at 26,403.28. The S&P 500 increased 0.1% to close at 2,926.46. The tech-laden Nasdaq Composite Index closed at 7,962.88, losing 0.1%. The fear-gauge CBOE Volatility Index (VIX) increased 16.1% to close at 20.75. Advancers outnumbered decliners on the NYSE by a 2.14-to-1 ratio. On Nasdaq, a 1.79-to-1 ratio favored advancing issues.",
    " How Did the Benchmarks Perform? ",
    "The Dow gained 41 points to close in the green. Shares of Walgreens Boots Alliance WBA  and UnitedHealth Group UNH  gained 1.6% and 1.5%, respectively and supported gains for the 30-stock index.",
    "The S&P 500 rose 1.9 points to end in positive territory. Of the 11 major sectors of the S&P 500, seven ended in the green, with materials leading the advancers. The Materials Select Sector SPDR Fund (XLB) rose 0.7% on Friday.",
    "Meanwhile, the Nasdaq slid 10.5 points to close in the red. Shares of Apple AAPL  fell 0.3% and weighed on the Nasdaq. The stock carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  . ",
    " US & China Maintain \"Effective Communication\" on   Trade War ",
    "At a news briefing in Beijing on Aug 30, China's foreign ministry announced that the United States and China were maintaining \"effective communication\" related to trade war. The statement is being largely viewed as an indication the both the countries would resume trade talks in September.",
    "China's commerce ministry also stated that a fresh round of meetings in September was being discussed by the two parties. Such developments led to broad based gains for the markets.",
    " Economic Data ",
    "On the economic data front, personal income for the month of July rose 0.1%, lower than the consensus estimate of 0.3%. Meanwhile, personal spending rose 0.6% in July, higher than the consensus estimate of 0.6%.",
    "Core PCE inflation increased 0.2% in July, in line with the consensus estimate. Notably, consumer prices rose 1.4% on year-over-year basis.",
    " Weekly & Monthly Roundup ",
    "For the week, the Dow, the S&P 500 and the Nasdaq increased 3%, 2.8% and 2.7%, respectively. While the Dow notched up its best weekly gain since Jun 7, the Nasdaq booked its biggest weekly advance since Jun21.",
    "Trade tensions between the United States and China appeared to ease over the week. Stocks moved higher after China hinted its unwillingness to retaliate against Washington's new round of tariffs. Further, a revision of second-quarter GDP growth revealed an even stronger consumer spending during the period, positively impacting stocks.",
    "Meanwhile, for the month, the Dow, the S&P 500 and the Nasdaq lost 1.7%, 1.8% and 2.6%, respectively. Further, the three major benchmarks posted their first monthly decline since May and the second overall for this year.",
    "Intensifying trade conflict between the United States and China was the main reason for equity markets losses in August. China decided to impose import duties on U.S. agricultural products and its central bank fixed the mid-point of yuan to below the psychological level of 7 per U.S. dollar. This rattled the markets.",
    "Further, the yield on 10-year government bond fell below the 2-year government bond, triggering investor's concern of an impending recession. Meanwhile, the central bank cut its benchmark rates in a bid to support the American economy amid slowing global growth.",
    "However, some investors were disappointed with the extent of the rate cut and Fed Chair Jerome Powell's comments suggesting the rate cut was only a \"mid-cycle adjustment to policy.\"",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:42:00"
}