{
  "url": "https://www.nasdaq.com/article/cnh-industrial-to-list-truck-and-bus-business-in-breakup-20190903-00824",
  "title": "CNH Industrial to list truck and bus business in break-up - Nasdaq.com",
  "text": [
    "By Giulio Piovaccari",
    "MILAN, Sept 3 (Reuters) - Industrial vehicle maker CNH Industrial  has decided to split in two and list its truck, bus and engine division in an effort to boost asset values and streamline its businesses.",
    "The plan comes just six years after CNH Industrial was created when Fiat Industrial - spun off from the Italian carmaker - was folded into U.S.-based agricultural and construction machine firm CNH.",
    "Monica Bosio, head of equity research at Intesa Sanpaolo-Banca IMI, said the plan should help boost the value of the agriculture side, which is currently trading at a discount compared to competitors.",
    "\"The split should also give more appeal to the truck unit as it might become an interesting asset for other operators, despite the pledge by Exor to remain key shareholder in both entities,\" she said.",
    "CNH's top shareholder Exor - the holding group of Italy's Agnelli family, which also controls Fiat Chrysler Automobiles  and premium sports car maker Ferrari  - said in a statement it supported the new plan.",
    "\"Exor will continue to be the shareholder of reference in both entities following completion of the spin-off process,\" it said.",
    "Last year, CNH's agriculture and construction business had proforma sales of $15.6 billion, while its so-called \"On-Highway\" operations generated $13.1 billion.",
    "The group's most profitable businesses were agricultural equipment and powertrains, which both boasted margins of 8.9% compared with the 2.7% of commercial vehicles.",
    "Under the plan, some high-margin industrial vehicle brands including heavy-duty quarry truck maker Astra and Iveco Defence Vehicles will be assigned to the agricultural and construction unit.",
    "\"The agricultural entity will trade at higher multiples from the beginning, despite the challenging environment, because that's the business with higher margins. Multiples at the truck entity might increase depending on the management's ability to extract margins and eventual M&A perspectives,\" Bosio added.",
    "But in a sign agricultural margins could also come under pressure, U.S. rival Deere & Co.  last month announced a review of costs after bad weather and the U.S.-China trade war dented profits, triggering a profit warning. ",
    "\"It looks as if (Exor head John) Elkann is focusing on cash-in deals to help fund asset diversification at Exor,\" said Roberto Lottici, asset manager at Milan-based Ifigest.",
    "The new plan, dubbed \"Transform 2 Win\" will reduce operating costs and increase efficiency \"through targeted restructuring actions\", CNH said in a statement.",
    "The group expects full implementation of the plan by the end of 2022 and to spend between $450-$500 million in restructuring charges.",
    "In a separate statement, CNH said it planned to enter a strategic and exclusive partnership for Iveco with U.S.-based Nikola Corporation, as it seeks to accelerate its transition towards emission neutrality for heavy-duty trucks in North America and Europe.",
    "The Italian-American group will take a $250 million stake in Nikola, which will kick-off the production of a zero-emission heavy-duty vehicle powered by proprietary hydrogen fuel cell and battery technology, it said.",
    "Massimiliano Chiara, the company's CFO, laid out increases in capex and research and development (R&D) as part of the new plan. Chiara said capex would go up from 1.9% of net sales this year to 3.5% in 2020 and average 3.7% between 2020 and 2024. R&D spending, meanwhile, will go up from 3.8% of net sales to 4.2% in 2020 and average 4.5% from 2020 to 2024.",
    "Milan-listed CNH shares were down 3.5%, having risen as much as 1% when the break-up plan was announced."
  ],
  "published_datetime": "2019-09-03 07:19:00"
}