{
  "url": "https://www.nasdaq.com/article/new-york-city-sues-tmobile-over-rampant-customer-sales-abuses-20190904-01184",
  "title": "New York City sues T-Mobile over 'rampant' customer sales abuses - Nasdaq.com",
  "text": [
    "By Jonathan Stempel",
    "NEW YORK, Sept 4 (Reuters) - New York City sued T-Mobile USA Inc  on Wednesday, accusing the fourth-largest U.S. mobile phone company of engaging in \"rampant\" sales abuses of customers for its lower-priced, prepaid wireless brand, Metro by T-Mobile.",
    "In a complaint filed in the state supreme court in Manhattan, the city said it had identified more than 2,200 violations by T-Mobile, whose \"pervasive\" illegal activity spanned 56 Metro stores in all five boroughs, including authorized dealers and stores run by its MetroPCS NY unit.",
    "Spokespeople for the city's law department and Consumer Affairs Commissioner Lorelei Salas did not immediately respond to requests for comment.",
    "The lawsuit was filed as T-Mobile tries to win necessary approvals to merge with Sprint Corp , the No. 3 U.S. mobile phone company.",
    "Sixteen U.S. states, led by New York and California, and Washington, D.C. have sued to block the merger, which they say will boost costs for consumers by reducing competition.",
    "In its complaint, New York City said it had evidence that many Metro stores sold used or reconditioned phones as new, and charged taxes that were excessive or appeared to be \"made up,\" including \"device change taxes\" and \"device activation taxes.\"",
    "It also accused T-Mobile of partnering with third parties to enroll unsuspecting consumers in expensive financing plans without their consent.",
    "The complaint cited one example in which a woman thought she had bought a phone advertised at $599 from a Bronx dealer, only to learn later that she had signed up for a 12-month lease costing $2,191.30.",
    "New York City also said the website of Metro by T-Mobile deceptively advertised a \"30 day guarantee\" on phone purchases, though the fine print said the guarantee was just seven days and covered only a \"small sub-category\" of transactions.",
    "The lawsuit seeks to recoup overcharges, and impose civil fines of $350 to $500 per violation, among other remedies.",
    "The case is City of New York et al v T-Mobile USA et al, New York State Supreme Court, New York County, No. 451540/2019."
  ],
  "published_datetime": "2019-09-04 06:12:00"
}