{
  "url": "https://www.nasdaq.com/article/htc-replaces-htc-vive-with-new-699-vive-comos-vr-headset-cm1210842",
  "title": "HTC Replaces HTC Vive With New $699 Vive Comos VR Headset - Nasdaq.com",
  "text": [
    "  HTC is getting ready to retire the headset that was central to   its expansion into the      virtual reality    market 3 years ago: The company announced on Thursday that its   new Vive Comos headset will effectively replace the original   HTC   Vive    , which was first released in April of 2016. \"It was time to   upgrade our consumer product,\" said   HTC Vive    North America president Dan O'Brien in an interview with   Variety    this week. The new Vive Cosmos, which HTC   first announced at CES in Las Vegas this past   January    , will be available for a retail price of $699 starting October   3. Like the original HTC Vive, it is powered by a PC. Unlike its   predecessor, it is not dependent on external tracking hardware,   and instead relies on 6 integrated cameras to keep track of a   user's movements and controllers. The Vive Cosmos also offers far superior graphics, thanks to   LCD display with a combined resolution of 2880 by 1700 pixels.   That's 88% better than the original Vive, and even surpasses the   resolution of the Vive Pro that the company released for   enterprise and other professional use cases earlier this year.   \"You get higher fidelity, higher color, better detail,\" said   O'Brien.makeArticleAd(); The headset comes with redesigned controllers, as well as a   unique flip-up visor design that makes it possible to more easily   transition in and out of VR. And thanks to its 6 cameras, the   device also features a video pass-through mode that makes it   possible to watch the outside world from within VR.  This type of pass-through was first debuted by   Facebook with its Oculus Quest VR headset earlier this year    . But while the Quest shows users a grainy black-and-white view   of the world whenever they hit the virtual boundaries of their VR   play space, the Cosmos actually delivers this video view in   color, albeit still with a relatively low resolution - think   washed-out VHS tape, if you will. Still, the video pass-through is intriguing, and HTC Creative   Labs corporate vice president Drew Bamford told   Variety    that the company was going to give developers a chance to   incorporate this view of the real world into their apps. \"It's   gonna result in something really compelling,\" he said. Bamford also argued that combining VR with real-world video   was better than superimposing video images on top of a   glasses-like view of the world, the way augmented reality   headsets typically work. \"We think it's the future of mixed   reality,\" he said. Another interesting aspect of the Vive Cosmos is HTC's promise   to allow users to customize the headset. To that end, they'll be   able to buy a variety of modular extensions, or mods, that can be   swapped out for existing parts of the headset. As a first such   mod, HTC has plans to ship a different faceplate that will allow   owners of the original Vive to use the new headset with their   existing tracking hardware - something that VR purists may prefer   to rule out tracking blindspots. HTC has kept mum on plans for other mods, but the company   teased the ability to power the headset with a phone when it   first introduced the Cosmos in January. In their conversation   with   Variety    , HTC's executives hinted at the possibility to enable mobile   support via a mod as well. The company now has to convince consumers that it will deliver   on the promise of these mods - something that hasn't worked well   for mobile phone manufacturers in the past. What's more, the Vive   Cosmos costs significantly more than other headsets out there.   Facebook's PC-based Rift S headset retails for $399, and the   social networking giant is selling the all-in-one Quest VR   headset for $399 as well. HTC wants to sweeten the deal for the Cosmos by offering   consumers who pre-order the device a year's worth of free access   to the company's      Viveport    Infinity VR subscription service, which usually costs $13 per   month. But ultimately, the company bets on the higher screen   resolution to make all the difference. The Vive Cosmos was a   premium consumer VR headset, argued O'Brien. \"There is a price   for that.\"   More from Variety    HTC VIVE, Taiwan Creative Content Agency         Join Forces on New Grant for International VR Works   First Look: Trailer for Venice-bound VR         Experience 'The Line' (EXCLUSIVE)   Neil Gaiman VR Experience 'Wolves in the         Walls' Wins Primetime Emmy     ",
    "HTC is getting ready to retire the headset that was central to   its expansion into the      virtual reality    market 3 years ago: The company announced on Thursday that its   new Vive Comos headset will effectively replace the original   HTC   Vive    , which was first released in April of 2016. \"It was time to   upgrade our consumer product,\" said   HTC Vive    North America president Dan O'Brien in an interview with   Variety    this week.",
    "The new Vive Cosmos, which HTC   first announced at CES in Las Vegas this past   January    , will be available for a retail price of $699 starting October   3. Like the original HTC Vive, it is powered by a PC. Unlike its   predecessor, it is not dependent on external tracking hardware,   and instead relies on 6 integrated cameras to keep track of a   user's movements and controllers.",
    "The Vive Cosmos also offers far superior graphics, thanks to   LCD display with a combined resolution of 2880 by 1700 pixels.   That's 88% better than the original Vive, and even surpasses the   resolution of the Vive Pro that the company released for   enterprise and other professional use cases earlier this year.   \"You get higher fidelity, higher color, better detail,\" said   O'Brien.",
    "The headset comes with redesigned controllers, as well as a   unique flip-up visor design that makes it possible to more easily   transition in and out of VR. And thanks to its 6 cameras, the   device also features a video pass-through mode that makes it   possible to watch the outside world from within VR.",
    " This type of pass-through was first debuted by   Facebook with its Oculus Quest VR headset earlier this year    . But while the Quest shows users a grainy black-and-white view   of the world whenever they hit the virtual boundaries of their VR   play space, the Cosmos actually delivers this video view in   color, albeit still with a relatively low resolution - think   washed-out VHS tape, if you will.",
    "Still, the video pass-through is intriguing, and HTC Creative   Labs corporate vice president Drew Bamford told   Variety    that the company was going to give developers a chance to   incorporate this view of the real world into their apps. \"It's   gonna result in something really compelling,\" he said.",
    "Bamford also argued that combining VR with real-world video   was better than superimposing video images on top of a   glasses-like view of the world, the way augmented reality   headsets typically work. \"We think it's the future of mixed   reality,\" he said.",
    "Another interesting aspect of the Vive Cosmos is HTC's promise   to allow users to customize the headset. To that end, they'll be   able to buy a variety of modular extensions, or mods, that can be   swapped out for existing parts of the headset. As a first such   mod, HTC has plans to ship a different faceplate that will allow   owners of the original Vive to use the new headset with their   existing tracking hardware - something that VR purists may prefer   to rule out tracking blindspots.",
    "HTC has kept mum on plans for other mods, but the company   teased the ability to power the headset with a phone when it   first introduced the Cosmos in January. In their conversation   with   Variety    , HTC's executives hinted at the possibility to enable mobile   support via a mod as well.",
    "The company now has to convince consumers that it will deliver   on the promise of these mods - something that hasn't worked well   for mobile phone manufacturers in the past. What's more, the Vive   Cosmos costs significantly more than other headsets out there.   Facebook's PC-based Rift S headset retails for $399, and the   social networking giant is selling the all-in-one Quest VR   headset for $399 as well.",
    "HTC wants to sweeten the deal for the Cosmos by offering   consumers who pre-order the device a year's worth of free access   to the company's      Viveport    Infinity VR subscription service, which usually costs $13 per   month. But ultimately, the company bets on the higher screen   resolution to make all the difference. The Vive Cosmos was a   premium consumer VR headset, argued O'Brien. \"There is a price   for that.\"",
    "  More from Variety    HTC VIVE, Taiwan Creative Content Agency         Join Forces on New Grant for International VR Works   First Look: Trailer for Venice-bound VR         Experience 'The Line' (EXCLUSIVE)   Neil Gaiman VR Experience 'Wolves in the         Walls' Wins Primetime Emmy   ",
    " More from Variety ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 04:38:40"
}