{
  "url": "https://www.nasdaq.com/article/pound-at-weekhigh-dollar-sinks-as-riskon-mood-cautiously-holds-20190904-01235",
  "title": "Pound at week-high, dollar sinks as risk-on mood cautiously holds - Nasdaq.com",
  "text": [
    "By Tom Westbrook",
    "SINGAPORE, Sept 5 (Reuters) - The British pound hovered around a one-week high on Thursday as another parliamentary defeat for Prime Minister Boris Johnson made investors optimistic that a no-deal Brexit could be avoided, while a broader risk-on mood held back the dollar.",
    "The dollar fell against most major currencies, though gained on the safe-haven yen, as the UK parliamentary vote, positive economic data in the United States and China and hopes for a de-escalation in Hong Kong's political crisis lured investors to riskier assets.",
    "The British parliament voted on Wednesday to prevent Johnson from taking Britain out of the European Union without a deal on Oct. 31, but rejected his first bid to call a snap election two weeks before the scheduled exit.",
    "\"While there is no 'all clear' on market concerns, investor sentiment pulled back from extremes,\" said Michael McCarthy, chief market strategist at brokerage CMC Markets in Sydney.",
    "\"Currency markets illustrated the shift...the U.S. dollar played a passive role as markets wait for the next trade tweets to drop.\"",
    "The Canadian dollar  spiked sharply to C$1.3344 per dollar after the Bank of Canada left interest rates on hold and sounded less dovish than the market had expected.",
    "The more upbeat mood cautiously held in morning trade in Asia, though few expected it to last long.",
    "Brexit is still up in the air, with possible outcomes ranging from a no-deal exit from the EU to abandoning the whole endeavour.",
    "\"It's important to keep in mind that the situation continues to look pretty bad,\" J.P. Morgan analysts reminded investors in a market note, pointing out that Johnson is pushing for a snap election and a so-called \"hard Brexit\" remains an option.",
    "The weak global trade outlook is also still a key worry, with U.S. President Donald Trump warning on Tuesday he would be \"tougher\" on Beijing in a second term if talks dragged on.",
    "And it was not clear whether Hong Kong would return to calm after leader Carrie Lam withdraw an extradition bill that triggered months of often violent protests.",
    "That caution kept the yen's  losses reasonably muted, though it did drift a little further lower to 106.42 per-dollar, its cheapest since Friday.",
    "The yuan  held on to Wednesday's gains at around 7.1487 per dollar in offshore trade.",
    "China will implement both broad and targeted cuts in the reserve requirement ratio (RRR) for banks \"in a timely manner,\" China's cabinet said in a meeting on Wednesday, an indication that a cut in the key ratio aimed at boosting lending could be imminent.",
    "\"A drop in geopolitical risk premium comes as a welcome relief,\" said Stephen Innes, Asia Pacific market strategist at AxiTrader.",
    "\"But with the omnipresent trade war clouds looming ominously over the market threatening to come thundering down at any time, the air remains thick with caution.\""
  ],
  "published_datetime": "2019-09-04 09:16:00"
}