{
  "url": "https://www.nasdaq.com/article/why-is-callon-cpe-down-211-since-last-earnings-report-cm1208060",
  "title": "Why Is Callon (CPE) Down 21.1% Since Last Earnings Report? - Nasdaq.com",
  "text": [
    " It has been about a month since the las t earnings  report for Callon Petroleum (CPE). Shares have lost about 21.1% in that time frame, underperforming the S&P 500. Will the recent negative trend continue leading up to its next earnings release, or is Callon due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important drivers.  Callon Tops Q2 Earnings Estimates, Keeps FY19   View  Callon Petroleumreported second-quarter 2019 adjusted earnings of 23 cents per share, beating the Zacks Consensus Estimate of 18 cents. The bottom line was flat year over year. Operating revenues of $167 million surpassed the Zacks Consensus Estimate of $162 million and improved from the year-ago quarter's $137 million. The strong quarterly results were driven by a surge in oil equivalent volumes, partially offset by lower price realizations of commodities.  Production Surges  In the quarter, net production volumes averaged 40,516 barrels of oil equivalent per day (Boe/d), reflecting a surge from the year-ago period's 28,954 Boe/d. Of the total second-quarter production, 77% was oil and the rest comprised natural gas.    Price Realizations (Without the Impact of Cash-Settled   Derivatives) Plunge  The average realized price per barrel of oil equivalent was $45.31. The figure was significantly lower than the year-ago quarter's $52.02 a barrel. Average realized price for oil was $56.44 per barrel compared with $61.46 a year ago. Moreover, average realized price for natural gas came in at $1.26 per thousand cubic feet, down from $3.77 in the prior-year quarter.  Expenses Increase  Total operating expenses in the quarter amounted to $108.5 million, higher than the year-ago level of $69.7 million. Lease operating expenses jumped more than 73%, primarily leading to the surge in total operating costs.  Capital Expenditure & Balance Sheet  Capital expenditure in the reported quarter was $166.2 million, lower than the year-ago figure of $187 million. As of Jun 30, 2019, the company's total cash and cash equivalents amounted to $16.1 million, and debt was $1.1 billion, with a debt-to-capitalization ratio of 30.6%.  Guidance Maintained  For 2019, Callon Petroleum's production is estimated in the range of 38-39.5 thousand barrels of oil equivalent per day, of which 78-79% is expected to be oil. Operational capital expenditures for 2019 are projected in the range of $495-$520 million. Net operated horizontal wells to be placed on production in 2019 are expected between 47 and 49, lower than the 2018 level of 54. Notably, the company has maintained its 2019 outlook.   How Have Estimates Been Moving Since Then?  It turns out, estimates revision have trended downward during the past month. The consensus estimate has shifted -5.76% due to these changes.  VGM Scores  At this time, Callon has a nice Growth Score of B, though it is lagging a lot on the Momentum Score front with an F. However, the stock was allocated a grade of A on the value side, putting it in the top quintile for this investment strategy. Overall, the stock has an aggregate VGM Score of A. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Callon has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Callon Petroleum Company (CPE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "It has been about a month since the las t earnings  report for Callon Petroleum (CPE). Shares have lost about 21.1% in that time frame, underperforming the S&P 500.",
    "Will the recent negative trend continue leading up to its next earnings release, or is Callon due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important drivers.  Callon Tops Q2 Earnings Estimates, Keeps FY19   View  Callon Petroleumreported second-quarter 2019 adjusted earnings of 23 cents per share, beating the Zacks Consensus Estimate of 18 cents. The bottom line was flat year over year. Operating revenues of $167 million surpassed the Zacks Consensus Estimate of $162 million and improved from the year-ago quarter's $137 million. The strong quarterly results were driven by a surge in oil equivalent volumes, partially offset by lower price realizations of commodities.  Production Surges  In the quarter, net production volumes averaged 40,516 barrels of oil equivalent per day (Boe/d), reflecting a surge from the year-ago period's 28,954 Boe/d. Of the total second-quarter production, 77% was oil and the rest comprised natural gas.    Price Realizations (Without the Impact of Cash-Settled   Derivatives) Plunge  The average realized price per barrel of oil equivalent was $45.31. The figure was significantly lower than the year-ago quarter's $52.02 a barrel. Average realized price for oil was $56.44 per barrel compared with $61.46 a year ago. Moreover, average realized price for natural gas came in at $1.26 per thousand cubic feet, down from $3.77 in the prior-year quarter.  Expenses Increase  Total operating expenses in the quarter amounted to $108.5 million, higher than the year-ago level of $69.7 million. Lease operating expenses jumped more than 73%, primarily leading to the surge in total operating costs.  Capital Expenditure & Balance Sheet  Capital expenditure in the reported quarter was $166.2 million, lower than the year-ago figure of $187 million. As of Jun 30, 2019, the company's total cash and cash equivalents amounted to $16.1 million, and debt was $1.1 billion, with a debt-to-capitalization ratio of 30.6%.  Guidance Maintained  For 2019, Callon Petroleum's production is estimated in the range of 38-39.5 thousand barrels of oil equivalent per day, of which 78-79% is expected to be oil. Operational capital expenditures for 2019 are projected in the range of $495-$520 million. Net operated horizontal wells to be placed on production in 2019 are expected between 47 and 49, lower than the 2018 level of 54. Notably, the company has maintained its 2019 outlook. ",
    " Callon Tops Q2 Earnings Estimates, Keeps FY19   View ",
    "Callon Petroleumreported second-quarter 2019 adjusted earnings of 23 cents per share, beating the Zacks Consensus Estimate of 18 cents. The bottom line was flat year over year.",
    "Operating revenues of $167 million surpassed the Zacks Consensus Estimate of $162 million and improved from the year-ago quarter's $137 million.",
    "The strong quarterly results were driven by a surge in oil equivalent volumes, partially offset by lower price realizations of commodities.",
    " Production Surges ",
    "In the quarter, net production volumes averaged 40,516 barrels of oil equivalent per day (Boe/d), reflecting a surge from the year-ago period's 28,954 Boe/d. Of the total second-quarter production, 77% was oil and the rest comprised natural gas.  ",
    " Price Realizations (Without the Impact of Cash-Settled   Derivatives) Plunge ",
    "The average realized price per barrel of oil equivalent was $45.31. The figure was significantly lower than the year-ago quarter's $52.02 a barrel. Average realized price for oil was $56.44 per barrel compared with $61.46 a year ago. Moreover, average realized price for natural gas came in at $1.26 per thousand cubic feet, down from $3.77 in the prior-year quarter.",
    " Expenses Increase ",
    "Total operating expenses in the quarter amounted to $108.5 million, higher than the year-ago level of $69.7 million. Lease operating expenses jumped more than 73%, primarily leading to the surge in total operating costs.",
    " Capital Expenditure & Balance Sheet ",
    "Capital expenditure in the reported quarter was $166.2 million, lower than the year-ago figure of $187 million.",
    "As of Jun 30, 2019, the company's total cash and cash equivalents amounted to $16.1 million, and debt was $1.1 billion, with a debt-to-capitalization ratio of 30.6%.",
    " Guidance Maintained ",
    "For 2019, Callon Petroleum's production is estimated in the range of 38-39.5 thousand barrels of oil equivalent per day, of which 78-79% is expected to be oil.",
    "Operational capital expenditures for 2019 are projected in the range of $495-$520 million.",
    "Net operated horizontal wells to be placed on production in 2019 are expected between 47 and 49, lower than the 2018 level of 54.",
    "Notably, the company has maintained its 2019 outlook.",
    " How Have Estimates Been Moving Since Then? ",
    "It turns out, estimates revision have trended downward during the past month. The consensus estimate has shifted -5.76% due to these changes.",
    " VGM Scores ",
    "At this time, Callon has a nice Growth Score of B, though it is lagging a lot on the Momentum Score front with an F. However, the stock was allocated a grade of A on the value side, putting it in the top quintile for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of A. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Callon has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:31:22"
}