{
  "url": "https://www.nasdaq.com/article/10-practical-tips-to-make-divorce-more-tolerable-cm1207076",
  "title": "10 Practical Tips to Make Divorce More Tolerable - Nasdaq.com",
  "text": [
    "On the hierarchy of horrible experiences, divorce is right up there, especially if you are the recipient of the bad news and were unaware of how unhappy your spouse was.",
    "Unfortunately, divorce is a reality for approximately 50% of all first marriages, according to the American Psychological Association -- and the percentage of second and third marriages ending in divorce is even higher.",
    "A divorce is not just the loss of a partner and maybe even a co-parent. It is the end of the hopes and dreams of building a loving relationship with someone you care deeply about. It is normal to feel depressed. Depression can manifest itself in a variety of ways, both physically and emotionally. Some people gain weight, while others lose weight. Some cannot can't get out of bed, while others go to extremes by becoming dependent on drugs or alcohol. Depression, although understandable, can make a terrible situation even worse.",
    "When I co-wrote the book He Said: She Said: A Practical Guide to Finance and Money During Divorce , with my late husband, Herb Shapiro, he used to say, \"Divorce is a death without a body.\" Divorce is the death of a relationship and consequently a way of life.",
    "With that in mind, here are 10 practical tips to get through this transition.",
    "Written by Barbara Shapiro , president of HMS Financial Group in Dedham, Mass. She is a CFP®, Certified Divorce Financial Analyst and a Financial Transitionist®. Her firm specializes in comprehensive financial planning with a subspecialty in divorce that assists clients' transition from marriage to independence with peace of mind and confidence.",
    "Internalizing your feelings -- especially negative feelings -- is a bad idea. Lean on family and friends. It is reassuring to realize that they are in your corner and will patiently listen and support you, no matter how many times you may repeat yourself.",
    "Close friends and family might have great advice, but they likely do not have the professional experience of dealing with people trying to process such a painful, life-changing experience. A professional therapist can, without bias, help you sort out and examine your feelings in a nonjudgmental way.",
    "Most likely the shorter the marriage, the easier it is to move on. Try to get out there -- meet friends for dinner, take a day trip, visit a new exhibit at the museum. In other words, build new experiences that don't include the ex-spouse.",
    "Staying physically active is great advice for almost everyone, but especially those in the aftermath of their marriage blowing up. Working out can release endorphins that can help lift one's spirit. It can also be a healthy way to process thoughts that are going around and around in one's head, in some cases defusing unneeded anger.",
    "If one has children, being the best dad or mom can make a huge difference. Even those who have grandchildren can find immense joy in spending time with the grandkids. For others, it might mean focusing on their career. Some might find that helping charities or their religious group rewarding. Whatever it is, fill the void created by the loneliness of divorce with something that is productive and refocuses your attention, while allowing you to interact with new people.",
    "Many of us have a vision of our future and we are on a path to get there, but divorce forces you to start over. Try to stay positive and have faith that you'll land on your feet and will create positive new memories. It will take time to build a new life, but now you have gained experience and hopefully maturity to create a new and better you. Soon a new door will open, if it has not already.",
    "A divorce creates a wound. Just like any injury, it takes time to heal. Some days may be better than others, but eventually you will be happy and content.",
    "Initially hating your ex-spouse is normal, but if you have children it is very counterproductive. You will be thrown together for every graduation, wedding and funeral. Do yourself and your kids a favor and remain civil. No one expects to be best buddies with their ex, but civility is expected and required to move on.",
    "One of the worst times to make financial decisions is when the emotional part of the brain fully dominates the rational side. A financial adviser, especially one who focuses in helping those through divorce, can guide individuals through very difficult decisions, like whether to keep or sell a house, what is an appropriate revised retirement plan and so much more. Bad financial decisions can only compound the negative ramifications of a divorce, so get help.",
    "You have had a bad experience, but now you have the ability to wipe the slate clean and start over. Embrace the opportunity to use you prior experience and create a new life that makes you happy and content. If you have the right mindset and are resilient, you can and will have a great life.",
    "If you find yourself going through divorce, or recovering from one, remember that you are closing one chapter of your life, but one chapter does not make a novel.",
    "Securities and Advisory Services offered through Cadaret, Grant & Co., Inc., a Registered Investment Adviser and Member FINRA/SIPC. HMS Financial Group and Cadaret, Grant & Co., Inc. are separate entities.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-02 09:12:33"
}