{
  "url": "https://www.nasdaq.com/article/new-strong-buy-stocks-for-september-11th-cm1210481",
  "title": "New Strong Buy Stocks for September 11th - Nasdaq.com",
  "text": [
    "Here are 5 stocks added to the Zacks Rank #1 (Strong Buy) List today:",
    "Consolidated Communications Holdings, Inc . (CNSL): This company that provides telecommunications services has seen the Zacks Consensus Estimate for its current year earnings increasing 6% over the last 60 days.",
    "Consolidated Communications Holdings, Inc. Price and Consensus",
    "Consolidated Communications Holdings, Inc. price-consensus-chart | Consolidated Communications Holdings, Inc. Quote",
    "Jones Lang LaSalle Incorporated (JLL): This professional services company has seen the Zacks Consensus Estimate for its current year earnings increasing 4.2% over the last 60 days.",
    "Jones Lang LaSalle Incorporated Price and Consensus",
    "Jones Lang LaSalle Incorporated price-consensus-chart | Jones Lang LaSalle Incorporated Quote",
    "Douglas Dynamics, Inc . (PLOW): This company that operates as a manufacturer and upfitter of commercial work truck attachments and equipment has seen the Zacks Consensus Estimate for its current year earnings increasing 7.5% over the last 60 days.",
    "Douglas Dynamics, Inc. Price and Consensus",
    "Douglas Dynamics, Inc. price-consensus-chart | Douglas Dynamics, Inc. Quote",
    "Garmin Ltd. (GRMN): This company that designs, develops, manufactures, markets, and distributes a range of navigation, communication, and information devices has seen the Zacks Consensus Estimate for its current year earnings increasing 4% over the last 60 days.",
    "Garmin Ltd. Price and Consensus",
    "Garmin Ltd. price-consensus-chart | Garmin Ltd. Quote",
    "International Money Express, Inc. (IMXI): This company that operates as a money remittance services company has seen the Zacks Consensus Estimate for its current year earnings increasing nearly 39% over the last 60 days.",
    "INTERNATIONAL MONEY EXPRESS, INC. Price and Consensus",
    "INTERNATIONAL MONEY EXPRESS, INC. price-consensus-chart | INTERNATIONAL MONEY EXPRESS, INC. Quote",
    "You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here",
    "Looking for Stocks with Skyrocketing Upside?",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.      ",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   ",
    "See the pot trades we're targeting>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:30:00"
}