{
  "url": "https://www.nasdaq.com/article/financial-sector-update-for-09042019-landzzgtrnoyrd-cm1207502",
  "title": "Financial Sector Update for 09/04/2019: LAND,Z,ZG,TRNO,YRD - Nasdaq.com",
  "text": [
    "Top Financial Stocks",
    "JPM +1.3%",
    "BAC +1.7%",
    "WFC +0.9%",
    "C +1.5%",
    "USB +0.7%",
    "Financial stocks recently eased slightly from their earlier highs, with the NYSE Financial Index (^NYK) rising nearly 1.1% in late trade while the shares of financial companies in the S&P 500 ( XLF  ) were climbing almost 0.8%. The Philadelphia Housing Index (^HGX) also was rising about 1.0%.",
    "Among financial stocks moving on news:",
    "(+) Gladstone Land ( LAND  ) was rising more than 1.0% late Wednesday after the real estate investment trust said it has acquired a 366-acre vineyard in California's Napa Valley for $32 million and also signed a 10-year leaseback agreement with the seller to continue operating the facility. Gladstone recently has been acquiring farmland as it builds a new specialty REIT, also announcing Tuesday its purchase of a sod and berry farm in the Oxnard Plain north of Los Angeles for an undisclosed price.",
    "In other sector news:",
    "(+) Yirendai ( YRD  ) has turned 3% higher this afternoon, reversing an early 5% decline. The Chinese consumer loan marketplace overnigh t report  ed declines in its Q2 net income compared with year-ago levels. The company earned RMB1.67 ($0.24) per American depositary share compared with a RMB2.11 per ADS profit last year while revenue fell 25.8% year-over-year to RMB2.22 billion during the three months ended June 30. Analyst estimates were not available.",
    "(+) Terreno Realty ( TRNO  ) was fractionally higher after the real estate investment trust said it has purchased an industrial property in Oakland, Calif., for about $23.8 million. The 4.7-acre property contains a single industrial distribution building with around 93,000 square feet of usable space near the eastern end of the San Francisco-Oakland Bay Bridge and the Oakland Seaport.",
    "(-) Zillow Group (Z,ZG) fell almost 2% after the real estate sales website late Tuesday disclosed plans for a $1 billion private placement of its convertible senior notes, consisting of $500 million each of convertible notes maturing in 2024 and 2026, respectively. The company expects to use a portion of the net proceeds for capped call transactions intended to limit the potential dilution of existing shareholder if the new notes are converted into stock and with the remaining funds slated for general corporate purposes.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-04 03:27:02"
}