{
  "url": "https://www.nasdaq.com/article/bloomin-brands-blmn-catches-eye-stock-jumps-76-cm1206630",
  "title": "Bloomin' Brands (BLMN) Catches Eye: Stock Jumps 7.6% - Nasdaq.com",
  "text": [
    "  Bloomin' Brands, Inc. BLMN  was a big mover last session, as the company saw its shares rise nearly 8% on the day. The move came on solid volume too with far more shares changing hands than in a normal session. This breaks the recent trend of the company, as the stock is now trading above the volatile price range of $15.26 to $16.92 in the past one-month time frame.  makeArticleAd();  The company has seen a mixed track record when it comes to estimate revision of no increase and one decrease over the past few weeks, while the Zacks Consensus Estimate for the current quarter remained unchanged. The recent price action is encouraging though, so make sure to keep a close watch on this firm in the near future.    Bloomin' Brands currently has a Zacks Rank #3 (Hold) while its Earnings ESP  is positive.  Bloomin' Brands, Inc. Price       Bloomin' Brands, Inc. price    |   Bloomin' Brands, Inc. Quote   Investors interested in the Retail - Restaurants industry may consider Chuy's Holdings, Inc. CHUY  , which has a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .    Is BLMN going up? Or down? Predict to see what others think: Up  or Down   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Chuy's Holdings, Inc. (CHUY): Free Stock Analysis Report   Bloomin' Brands, Inc. (BLMN): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Bloomin' Brands, Inc. BLMN  was a big mover last session, as the company saw its shares rise nearly 8% on the day. The move came on solid volume too with far more shares changing hands than in a normal session. This breaks the recent trend of the company, as the stock is now trading above the volatile price range of $15.26 to $16.92 in the past one-month time frame.  makeArticleAd();  The company has seen a mixed track record when it comes to estimate revision of no increase and one decrease over the past few weeks, while the Zacks Consensus Estimate for the current quarter remained unchanged. The recent price action is encouraging though, so make sure to keep a close watch on this firm in the near future.    Bloomin' Brands currently has a Zacks Rank #3 (Hold) while its Earnings ESP  is positive.",
    " Bloomin' Brands, Inc. Price ",
    "     Bloomin' Brands, Inc. price    |   Bloomin' Brands, Inc. Quote  ",
    " Bloomin' Brands, Inc. price    |   Bloomin' Brands, Inc. Quote ",
    "Investors interested in the Retail - Restaurants industry may consider Chuy's Holdings, Inc. CHUY  , which has a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .    Is BLMN going up? Or down? Predict to see what others think: Up  or Down   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:41:00"
}