{
  "url": "https://www.nasdaq.com/article/4-stocks-to-win-big-from-a-protracted-trade-war-cm1207103",
  "title": "4 Stocks to Win Big From a Protracted Trade War - Nasdaq.com",
  "text": [
    " The U.S. stock market has gone through a lot of gyration, and with the new round of tariffs kicking in, investors brace for a long-drawn-out war between the United States and China. The tech-heavy Nasdaq Composite, in particular, has witnessed wild swings in recent times as tariffs have the potential to drive up costs of chipmakers and gadgets. Tariffs of 15% on $112 billion of Chinese goods have been put into effect on Sep 1, as did retaliatory Chinese tariffs on U.S. commodities, including crude oil imports. In fact, the U.S.-China trade tussle intensified last month after President Trump urged U.S. firms to start looking for an \"alternative to China.\" Now, nearly two-thirds of the consumer goods that the United States import from China will face higher taxes. Americans have to pay more for items like shoes, clothes and sporting goods. Trump's higher tariffs will now impact consumer spending, which has been one of the driving factors for the economy. Needless to say, business houses have lowered spending and exports have slowed down in the face of weak global growth. Both Washington and Beijing are struggling to de-escalate the trade war, with the United States accusing China of stealing trade secrets and unfairly subsidizing its own companies to make headway into high-tech fields such as AI and electric cars. The United States and China were supposed to meet in September to negotiate tariffs, but investors now feel that any truce in the near term looks unlikely. What's more, President Trump has said that he would be \"tougher\" on China in the second term if trade issues continue to linger. Also, the worsening trade situation between two of the world's largest economies dented investors' confidence in global economic growth. Talking about growth, discouraging manufacturing report also stoked worries about an economic slowdown. The ISM manufacturing index slipped to 49.1% in August from 51.2% in July. Notably, any reading below 50% indicates a contraction in manufacturing activity. Also, let's admit that businesses are more worried about expanding because of the uncertainty surrounding the U.S.-China trade disagreement.  Don't Shun Equities, Consider These Stocks  Contrary to popular belief, there are stocks that do well despite a trade war. Prominent among them are Canada Goose Holdings Inc. GOOS  , Akamai Technologies, Inc. AKAM  , SolarEdge Technologies, Inc. SEDG  and MAXIMUS, Inc. MMS  . In response to the Trump administration's move to impose additional tariffs, China has devalued its currency. This, in turn, may negatively impact the overall Chinese consumption level. But, Canada Goose won't be affected much due to this fall in consumption. After all, Canada Goose derives less than 10% of revenues directly from Chinese consumers compared with 30% to 40% for most luxury goods brands. Canada Goose, currently, has a Zacks Rank #2 (Buy). The Zacks Consensus Estimate for its next quarter earnings increased 2%. The company's expected earnings growth for the current year is 21.2%, way more than the Retail - Apparel and Shoes  industry's projected rally of 1.8%. Provider of cloud services for delivering, optimizing, and securing content and business applications, Akamai Technologies is another top pick, thanks to the company's lack of China exposure. To top it, the company's superb over-the-top delivery system, cloud security and online gaming are helping Akamai hold up better than most of its counterpart in a downturn. Akamai Technologies, currently, has a Zacks Rank #3 (Hold). The Zacks Consensus Estimate for its current-year earnings increased 2.7%. The company's expected earnings growth for the current year is 17.7%, way more than the Internet - Services  industry's projected rally of 5.1%. SolarEdge Technologies has shifted its production to Eastern Europe, and is not seeing any tariff disruption. The Zacks Rank #1 (Strong Buy) company's expected earnings growth rate for the current and next quarter is 38.4% and 79.4%, respectively. In fact, the stock's expected earnings growth rate for the current year is 23.7%, slightly higher than the Solar  industry's projected rally of 21.2%. The Zacks Consensus Estimate for its current-year earnings soared 21.4%. You can see  the complete list of today's Zacks #1 Rank stocks here  .  Provider of business outsourcing services across the globe, MAXIMUS actually gains during global growth slowdown. Its model focuses on social programs that are useful in terms of economic uncertainty. Needless to say, as the company has no exposure to China, tariffs have no impact on it. MAXIMUS, currently, has a Zacks Rank #3. The Zacks Consensus Estimate for its current-year earnings increased 0.8%. The company's expected earnings growth for the current quarter is 30.1%, higher than the Government Services  industry's projected rally of 14.5%. In fact, shares of Canada Goose, Akamai Technologies, SolarEdge Technologies and MAXIMUS have gained 100%, 93%, 193.2% and 27.4%, respectively, over the past two-year period. Take a look -       Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.  See 7 breakthrough stocks now>>   makeArticleAd();  Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Akamai Technologies, Inc. (AKAM): Free Stock Analysis Report   Canada Goose Holdings Inc. (GOOS): Free Stock Analysis Report   SolarEdge Technologies, Inc. (SEDG): Free Stock Analysis Report   Maximus, Inc. (MMS): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "The U.S. stock market has gone through a lot of gyration, and with the new round of tariffs kicking in, investors brace for a long-drawn-out war between the United States and China. The tech-heavy Nasdaq Composite, in particular, has witnessed wild swings in recent times as tariffs have the potential to drive up costs of chipmakers and gadgets.",
    "Tariffs of 15% on $112 billion of Chinese goods have been put into effect on Sep 1, as did retaliatory Chinese tariffs on U.S. commodities, including crude oil imports. In fact, the U.S.-China trade tussle intensified last month after President Trump urged U.S. firms to start looking for an \"alternative to China.\"",
    "Now, nearly two-thirds of the consumer goods that the United States import from China will face higher taxes. Americans have to pay more for items like shoes, clothes and sporting goods. Trump's higher tariffs will now impact consumer spending, which has been one of the driving factors for the economy. Needless to say, business houses have lowered spending and exports have slowed down in the face of weak global growth.",
    "Both Washington and Beijing are struggling to de-escalate the trade war, with the United States accusing China of stealing trade secrets and unfairly subsidizing its own companies to make headway into high-tech fields such as AI and electric cars.",
    "The United States and China were supposed to meet in September to negotiate tariffs, but investors now feel that any truce in the near term looks unlikely. What's more, President Trump has said that he would be \"tougher\" on China in the second term if trade issues continue to linger. Also, the worsening trade situation between two of the world's largest economies dented investors' confidence in global economic growth.",
    "Talking about growth, discouraging manufacturing report also stoked worries about an economic slowdown. The ISM manufacturing index slipped to 49.1% in August from 51.2% in July. Notably, any reading below 50% indicates a contraction in manufacturing activity. Also, let's admit that businesses are more worried about expanding because of the uncertainty surrounding the U.S.-China trade disagreement.",
    " Don't Shun Equities, Consider These Stocks ",
    "Contrary to popular belief, there are stocks that do well despite a trade war. Prominent among them are Canada Goose Holdings Inc. GOOS  , Akamai Technologies, Inc. AKAM  , SolarEdge Technologies, Inc. SEDG  and MAXIMUS, Inc. MMS  .",
    "In response to the Trump administration's move to impose additional tariffs, China has devalued its currency. This, in turn, may negatively impact the overall Chinese consumption level. But, Canada Goose won't be affected much due to this fall in consumption. After all, Canada Goose derives less than 10% of revenues directly from Chinese consumers compared with 30% to 40% for most luxury goods brands.",
    "Canada Goose, currently, has a Zacks Rank #2 (Buy). The Zacks Consensus Estimate for its next quarter earnings increased 2%. The company's expected earnings growth for the current year is 21.2%, way more than the Retail - Apparel and Shoes  industry's projected rally of 1.8%.",
    "Provider of cloud services for delivering, optimizing, and securing content and business applications, Akamai Technologies is another top pick, thanks to the company's lack of China exposure. To top it, the company's superb over-the-top delivery system, cloud security and online gaming are helping Akamai hold up better than most of its counterpart in a downturn.",
    "Akamai Technologies, currently, has a Zacks Rank #3 (Hold). The Zacks Consensus Estimate for its current-year earnings increased 2.7%. The company's expected earnings growth for the current year is 17.7%, way more than the Internet - Services  industry's projected rally of 5.1%.",
    "SolarEdge Technologies has shifted its production to Eastern Europe, and is not seeing any tariff disruption. The Zacks Rank #1 (Strong Buy) company's expected earnings growth rate for the current and next quarter is 38.4% and 79.4%, respectively. In fact, the stock's expected earnings growth rate for the current year is 23.7%, slightly higher than the Solar  industry's projected rally of 21.2%. The Zacks Consensus Estimate for its current-year earnings soared 21.4%. You can see  the complete list of today's Zacks #1 Rank stocks here  . ",
    "Provider of business outsourcing services across the globe, MAXIMUS actually gains during global growth slowdown. Its model focuses on social programs that are useful in terms of economic uncertainty. Needless to say, as the company has no exposure to China, tariffs have no impact on it.",
    "MAXIMUS, currently, has a Zacks Rank #3. The Zacks Consensus Estimate for its current-year earnings increased 0.8%. The company's expected earnings growth for the current quarter is 30.1%, higher than the Government Services  industry's projected rally of 14.5%.",
    "In fact, shares of Canada Goose, Akamai Technologies, SolarEdge Technologies and MAXIMUS have gained 100%, 93%, 193.2% and 27.4%, respectively, over the past two-year period. Take a look -",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    " See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 07:31:00"
}