{
  "url": "https://www.nasdaq.com/article/navistar-enjoys-brisk-market-share-gains-cm1207569",
  "title": "Navistar Enjoys Brisk Market-Share Gains - Nasdaq.com",
  "text": [
    " Global heavy vehicle manufacturer   Navistar International    (NYSE: NAV) reported a vigorous set of results in recapping its   fiscal third quarter of 2019 before markets opened on Wednesday.   While profitability dipped, sales increased at an extremely   healthy pace, and the Lisle, Illinois-based organization widened   its share of the market in its biggest sales category. Below,   we'll run through headline numbers and discuss the factors   underpinning the industrial giant's success this quarter. Note that all comparative numbers in this article are   presented against the prior-year quarter. The raw numbers  Data source: Navistar International.makeArticleAd(); What happened with Navistar this quarter?  Management attributed most of the company's revenue gains     to performance in its core market, which comprises heavy truck     and bus classes 6 through 8 sold in the U.S. and Canada. Class     6 and 7 gross weightings land between 19,501 and 30,000 lbs.,     while class 8 includes all vehicles weighing 33,001 lbs. and     above. The company gained an impressive 2.6 percentage points     of core market share over the prior-year quarter. In the truck segment, Navistar's largest business, net     revenue advanced 25% to $2.4 billion. In addition to higher     core sales, the company improved sales in Mexico and also     notched rising sales of class 4 and 5 vehicles to     GM      . Truck sales growth was partially offset by the impact of the     sale of the Navistar Defense business in December 2018. Parts segment revenue declined by 6% to $571 million, due     to lower Blue Diamond Parts sales and the implementation of a     new accounting standard; the drop was mitigated by higher parts     sales in the North American market. Navistar's global operations business was flat at $90     million in revenue, while net revenue in financial services     jumped 14% to $74 million, which management attributed to     higher average receivables portfolio balances in both the U.S.     and Mexico. Despite healthier sales, cost of products sold rose during     the quarter, causing manufacturing     gross margin      to fall 180     basis points      to 16.5%. The lower margin was the primary culprit behind lower     net profitability against the prior-year quarter, as seen in     the table above. Adjusted     EBITDA      increased by 22% to $266 million. Navistar generated $250 million in manufacturing     free cash flow      , i.e. free cash flow excluding activity from the company's     financing business. The organization opened its newest parts distribution     center in Memphis, Tennessee to speed maintenance turnaround     times. Additionally, Navistar announced plans to invest $125     million in its Huntsville, Alabama plant in order to     manufacture \"next-generation\" big-bore powertrains with its     joint venture partner, Traton (a subsidiary of     Volkswagen      ).    Image source: Getty Images.  Management's perspective Despite the threat of lower global economic growth in the near   term, Navistar has focused on speeding manufacturing throughput   as it supplies vehicles for the   freight shipping and logistics market     as well as other commercial and public uses. As you can see   from CEO Troy Clarke's comments in the company's earnings press   release directly below, Navistar intends to maintain an   aggressive manufacturing and service posture over the next few   quarters:  This was another great quarter for Navistar. Market share     increased, revenues and earnings grew at double-digit rates,     and we made significant investments in our operations and our     Uptime [parts and maintenance servicing] promise...We are on     course for a strong end to 2019, and we're not standing still.     The company is recapturing market share and is growing revenue,     EBITDA and cash flow. We remain focused on setting ourselves up     for long-term success.  Looking forward Navistar maintained its full-year guidance estimates in its   earnings release. The company expects industry retail deliveries   of class 6-8 buses and trucks in the U.S. and Canada to be   between 435,000 and 455,000 units, and it expects to own a share   of 18.5% to 19% of this core market by year-end. Navistar is aiming for fiscal full-year revenue of $11.25   billion to $11.75 billion. Management anticipates that fiscal   2019 gross margin will fall within the rather tight range of   17.75% to18%. While the company doesn't provide   earnings-per-share guidance, management reaffirmed its   expectation for fiscal 2019 adjusted EBITDA of $875 million to   $925 million. Shareholders were pleased that Navistar is trucking   on ahead in both year-to-date results and its outlook heading   into the fourth quarter: Shares soared as much as 12.5% during   the Wednesday trading session.   10 stocks we like better than Navistar     International       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Navistar International     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Asit Sharma      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .    ",
    "Global heavy vehicle manufacturer   Navistar International    (NYSE: NAV) reported a vigorous set of results in recapping its   fiscal third quarter of 2019 before markets opened on Wednesday.   While profitability dipped, sales increased at an extremely   healthy pace, and the Lisle, Illinois-based organization widened   its share of the market in its biggest sales category. Below,   we'll run through headline numbers and discuss the factors   underpinning the industrial giant's success this quarter.",
    "Note that all comparative numbers in this article are   presented against the prior-year quarter.",
    "Data source: Navistar International.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Despite the threat of lower global economic growth in the near   term, Navistar has focused on speeding manufacturing throughput   as it supplies vehicles for the   freight shipping and logistics market     as well as other commercial and public uses. As you can see   from CEO Troy Clarke's comments in the company's earnings press   release directly below, Navistar intends to maintain an   aggressive manufacturing and service posture over the next few   quarters:",
    "This was another great quarter for Navistar. Market share     increased, revenues and earnings grew at double-digit rates,     and we made significant investments in our operations and our     Uptime [parts and maintenance servicing] promise...We are on     course for a strong end to 2019, and we're not standing still.     The company is recapturing market share and is growing revenue,     EBITDA and cash flow. We remain focused on setting ourselves up     for long-term success.",
    "Navistar maintained its full-year guidance estimates in its   earnings release. The company expects industry retail deliveries   of class 6-8 buses and trucks in the U.S. and Canada to be   between 435,000 and 455,000 units, and it expects to own a share   of 18.5% to 19% of this core market by year-end.",
    "Navistar is aiming for fiscal full-year revenue of $11.25   billion to $11.75 billion. Management anticipates that fiscal   2019 gross margin will fall within the rather tight range of   17.75% to18%. While the company doesn't provide   earnings-per-share guidance, management reaffirmed its   expectation for fiscal 2019 adjusted EBITDA of $875 million to   $925 million. Shareholders were pleased that Navistar is trucking   on ahead in both year-to-date results and its outlook heading   into the fourth quarter: Shares soared as much as 12.5% during   the Wednesday trading session.",
    "  10 stocks we like better than Navistar     International       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Navistar International     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Navistar     International       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Navistar International     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Asit Sharma      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:27:00"
}