{
  "url": "https://www.nasdaq.com/article/mexico-president-says-el-chapos-drug-wealth-should-go-to-mexico-20190905-00915",
  "title": "Mexico president says El Chapo's drug wealth should go to Mexico - Nasdaq.com",
  "text": [
    "By Dave Graham",
    "MEXICO CITY, Sept 5 (Reuters) - Mexico's president on Thursday welcomed a proposal to give the alleged fortune of drug kingpin Joaquin \"El Chapo\" Guzman to the country's indigenous people, and said the wealth of Mexican criminals in the United States should be returned to Mexico.",
    "Jose Luis Gonzalez Meza, a lawyer for Guzman, said this week his client had proposed that billions of dollars in revenue that U.S. authorities had attributed to his business operations should be handed to indigenous communities in Mexico.",
    "\"I liked the declaration. I don't know if it's true, I can't verify it, but if it's as it came out in the media, that a lawyer says Guzman wants his wealth to be given to Mexico's indigenous communities, I think it's good,\" he said.",
    "\"Also, we have started a process because we want everything that's confiscated in the United States from criminals or suspected criminals from Mexico is returned to Mexico,\" he added.",
    "Lopez Obrador, a veteran leftist who took office in December, gave few details on the initiative beyond saying that his government would undertake \"all necessary legal actions\" to go after such money in the United States due to Mexicans.",
    "The initiative may raise eyebrows in the administration of U.S. President Donald Trump, who ran for office vowing to close the border to criminals and drugs from Mexico, and accused the country of taking advantage of the United States on trade.",
    "In July, U.S. authorities sought a court order requiring Guzman to forfeit $12.7 billion made from his drug-running career after his conviction this year for racketeering and drug trafficking crimes. ",
    "Lawyer Gonzalez Meza told Reuters that while Guzman, 62, had never admitted to having earned the billions, he was of the view that whatever money the U.S. authorities were referring to should be sent back to Mexico and distributed there.",
    "\"He says, well, if that money exists ... that money does not belong to the United States; it belongs to Mexico,\" he said, arguing that because the cultivation and harvesting of the drugs had taken place in Mexico, the proceeds belonged there.",
    "Guzman, who is being held in a maximum security prison in Colorado, put forward the idea during phone calls with his mother and sisters in August, Gonzalez Meza said.",
    "\"And he asks for President Lopez Obrador to allocate (the money) to the indigenous communities,\" he added.",
    "Mexico's indigenous population is among the poorest in the country, and a cause close to Lopez Obrador's heart.",
    "In the 1970s, the president worked among the indigenous people of his native state of Tabasco in southern Mexico. He has vowed to give priority to the poor in his administration."
  ],
  "published_datetime": "2019-09-05 01:47:00"
}