{
  "url": "https://www.nasdaq.com/article/what-the-suddenly-shaky-mellanox-deal-means-for-nvidia-stock-cm1206960",
  "title": "What the Suddenly Shaky Mellanox Deal Means for Nvidia Stock - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "To be sure, the acquisition by Nvidia  (NASDAQ: NVDA ) of Mellanox Technologies (NASDAQ: MLNX ) isn't a transformative deal for Nvidia stock. The current price of NVDA - $167 - suggests a market capitalization just over $100 billion. Nvidia has agreed to pay just under $7 billion for Mellanox.",
    "That said, the acquisition might be more important than the numbers suggest. And it's possible uncertainty surrounding its approval is part of the reason why NVDA stock continues to trade sideways.",
    "After all, the Mellanox deal touches on key aspects of the case for - and against - Nvidia stock at the moment. Meanwhile, with MLNX stock near a post-acquisition low, the market clearly is pricing in a shrinking chance of approval.",
    "The question for Mellanox stock is whether the potential upside is worth the risk of the deal breaking. The question for Nvidia stock is whether a broken deal at this point would raise more concern - or could potentially be even good news.",
    "Back in March, Nvidia won a bidding war for Mellanox. Reports leading up to the announcement suggested that Microsoft (NASDAQ: MSFT ), Intel (NASDAQ: INTC ) and Xilinx (NASDAQ: XLNX ) all were interested in the Israeli networking provider.",
    "It was Nvidia that was willing to pay the highest price - and perhaps with good reason. The addition of Mellanox's interconnect portfolio (adapters and switches) gives Nvidia an edge in its datacenter business. The acquisition, as CEO Jensen Huang put it, allowed Nvidia to \"double down\" in that key end market.",
    "At the time that the acquisition was announced, approval seemed assured. The \"deal spread\" - the return on MLNX stock assuming the deal closed at the $125 per share acquisition price - initially was just 6%. That narrowed at one point to as little as 3.4% .",
    "It's now near 17%, however - almost at its widest point ever. Trade war concerns are the primary factor . China blocked the acquisition of NXP Semiconductors (NASDAQ: NXPI ) by Qualcomm (NASDAQ: QCOM ) last year. It may see the Nvidia-Mellanox deal as another way to score trade war points .",
    "MLNX traded around $90 at the beginning of this year before falling amid chip sector concerns and then rising amid takeover speculation. The current price of $107 thus probably suggests the market sees a roughly 50-60% chance of approval at this point, assuming the stock would head back to the $90 level if Nvidia walked away. Again, the interesting question is what that means for NVDA stock at the moment.",
    "The simplest thesis is that NVDA stock takes a hit if the Mellanox deal falls through. For one, Nvidia, according to its 10-Q , would owe Mellanox a $350 million termination fee.",
    "But that fee is relatively insignificant: about 0.34% of the current Nvidia market capitalization. It's the impact to the NVDA \"story\" that looks much more important.",
    "After all, the two big risks to Nvidia stock right now seem to be in datacenter and in sector/macro sentiment. Datacenter demand has slowed notably across the industry so far this year. Nvidia management continues to see a second-half rebound , but clearly investors aren't convinced.",
    "Meanwhile, the U.S.-China trade battle has been a negative for chip stocks across the board. Stocks in the sector, including NVDA, INTC and Advanced Micro Devices (NASDAQ: AMD ), have been repeatedly rattled by tariff concerns. And the macro concerns amplify the category-specific worries in datacenter: a global recession likely means Nvidia over promises in the second half of FY20, just as it did a year ago with the \" crypto bubble \".",
    "On top of those two risks, a broken deal means management worries start getting a little louder. Nvidia whiffed on crypto last year. It could whiff on datacenter this year. Management insisted on the Q2 conference call last month that the deal would close by the end of the year. If it's wrong again, three big forecasting misses in roughly a year will erode the credibility of Huang and CFO Colette Kress.",
    "At the very least, just getting the deal done takes one worry - even if it's a relatively minor issue - off the proverbial table. This is a stock where, as I wrote in July, no news probably is good news . Less news probably is as well.",
    "That said, a broken deal certainly isn't fatal to Nvidia stock. The company certainly paid up for Mellanox: Huang called the purchase price \" beyond imagination \".",
    "Meanwhile, as Will Ashworth noted last week, Nvidia has paused its share repurchases until closing. Those investors most bullish on NVDA stock might well prefer the company spend $7 billion (it has a $7.2 billion authorization at the moment) on Nvidia shares, not those of Mellanox.",
    "With a previously announced plan for $3 billion in total returns by the end of FY20 (i.e., this January), Nvidia likely would ramp its buybacks rather quickly if and when Chinese regulators blocked the acquisition. And so a broken deal could lead to a short-term dip, followed by a mid-term gain as buy-the-dip investors and Nvidia itself step in.",
    "Again, the Mellanox deal on its own isn't going to make or break NVDA stock. But it matters. It matters to the story. It matters to the fundamentals, as Nvidia projected the deal to be accretive to earnings-per-share and free cash flow.",
    "And it might be at this point, given the volatility in Nvidia stock, that a resolution of any kind can help. This, after all, is a stock that less than a year ago was nearing $300, and a seemingly bulletproof growth story.",
    "Since then, there has been so much noise. The crypto hangover arrived. Trade war speculation has continued ad nauseam. Datacenter has slowed. And NVDA as a result has been bouncing around for almost ten months now.",
    "For the stock to rally, any kind of certainty would help. And so it's possible that news on Mellanox - whether positive or negative - on its own could be a boost to Nvidia stock.",
    "As of this writing, Vince Martin did not hold a position in any of the aforementioned securities.",
    "The post What the Suddenly Shaky Mellanox Deal Means for Nvidia Stock appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:05:01"
}