{
  "url": "https://www.nasdaq.com/article/first-week-of-february-2020-options-trading-for-vaneck-vectors-etf-trust-russia-etf-rsx-cm1207916",
  "title": "First Week of February 2020 Options Trading For VanEck Vectors ETF Trust - Russia ETF (RSX) - Nasdaq.com",
  "text": [
    "Investors in VanEck Vectors ETF Trust - Russia ETF (Symbol: RSX) saw new options become available this week, for the February 2020 expiration. One of the key inputs that goes into the price an option buyer is willing to pay, is the time value, so with 169 days until expiration the newly available contracts represent a possible opportunity for sellers of puts or calls to achieve a higher premium than would be available for the contracts with a closer expiration. At Stock Options Channel , our YieldBoost formula has looked up and down the RSX options chain for the new February 2020 contracts and identified one put and one call contract of particular interest.",
    "Because the $21.00 strike represents an approximate 9% discount to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the put contract would expire worthless. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 76%. Stock Options Channel will track those odds over time to see how they change, publishing a chart of those numbers on our website under the contract detail page for this contract . Should the contract expire worthless, the premium would represent a 3.38% return on the cash commitment, or 7.30% annualized - at Stock Options Channel we call this the YieldBoost .",
    "Considering the fact that the $24.00 strike represents an approximate 4% premium to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the covered call contract would expire worthless, in which case the investor would keep both their shares of stock and the premium collected. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 62%. On our website under the contract detail page for this contract , Stock Options Channel will track those odds over time to see how they change and publish a chart of those numbers (the trading history of the option contract will also be charted). Should the covered call contract expire worthless, the premium would represent a 2.43% boost of extra return to the investor, or 5.24% annualized, which we refer to as the YieldBoost .",
    "Top YieldBoost Calls of the S&P 500 »",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:36:13"
}