{
  "url": "https://www.nasdaq.com/article/gilead-sciences-gild-outpaces-stock-market-gains-what-you-should-know-cm1210791",
  "title": "Gilead Sciences (GILD) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Gilead Sciences (GILD) closed the most recent trading day at $68.08, moving +1.49% from the previous trading session. The stock outpaced the S&P 500's daily gain of 0.72%. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%. Prior to today's trading, shares of the HIV and hepatitis C drugmaker had gained 4.32% over the past month. This has outpaced the Medical sector's loss of 1.41% and the S&P 500's gain of 2.25% in that time. Wall Street will be looking for positivity from GILD as it approaches its nex t earnings  report date. On that day, GILD is projected to report earnings of $1.76 per share, which would represent a year-over-year decline of 4.35%. Meanwhile, our latest consensus estimate is calling for revenue of $5.62 billion, up 0.36% from the prior-year quarter. Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $7.04 per share and revenue of $22.33 billion. These totals would mark changes of +5.55% and +0.91%, respectively, from last year. Investors might also notice recent changes to analyst estimates for GILD. These revisions help to show the ever-changing nature of near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.06% higher. GILD currently has a Zacks Rank of #3 (Hold). Valuation is also important, so investors should note that GILD has a Forward P/E ratio of 9.53 right now. For comparison, its industry has an average Forward P/E of 23.98, which means GILD is trading at a discount to the group. It is also worth noting that GILD currently has a PEG ratio of 3.01. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Medical - Biomedical and Genetics was holding an average PEG ratio of 1.71 at yesterday's closing price. The Medical - Biomedical and Genetics industry is part of the Medical sector. This group has a Zacks Industry Rank of 79, putting it in the top 31% of all 250+ industries. The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. You can find more information on all of these metrics, and much more, on Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Gilead Sciences, Inc. (GILD): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Gilead Sciences (GILD) closed the most recent trading day at $68.08, moving +1.49% from the previous trading session. The stock outpaced the S&P 500's daily gain of 0.72%. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%.",
    "Prior to today's trading, shares of the HIV and hepatitis C drugmaker had gained 4.32% over the past month. This has outpaced the Medical sector's loss of 1.41% and the S&P 500's gain of 2.25% in that time.",
    "Wall Street will be looking for positivity from GILD as it approaches its nex t earnings  report date. On that day, GILD is projected to report earnings of $1.76 per share, which would represent a year-over-year decline of 4.35%. Meanwhile, our latest consensus estimate is calling for revenue of $5.62 billion, up 0.36% from the prior-year quarter.",
    "Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $7.04 per share and revenue of $22.33 billion. These totals would mark changes of +5.55% and +0.91%, respectively, from last year.",
    "Investors might also notice recent changes to analyst estimates for GILD. These revisions help to show the ever-changing nature of near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.",
    "The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.06% higher. GILD currently has a Zacks Rank of #3 (Hold).",
    "Valuation is also important, so investors should note that GILD has a Forward P/E ratio of 9.53 right now. For comparison, its industry has an average Forward P/E of 23.98, which means GILD is trading at a discount to the group.",
    "It is also worth noting that GILD currently has a PEG ratio of 3.01. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Medical - Biomedical and Genetics was holding an average PEG ratio of 1.71 at yesterday's closing price.",
    "The Medical - Biomedical and Genetics industry is part of the Medical sector. This group has a Zacks Industry Rank of 79, putting it in the top 31% of all 250+ industries.",
    "The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "You can find more information on all of these metrics, and much more, on Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:45:27"
}