{
  "url": "https://www.nasdaq.com/article/us-yields-climb-for-3rd-day-in-line-with-europe-ahead-of-ecb-meeting-20190911-00736",
  "title": "U.S. yields climb for 3rd day, in line with Europe, ahead of ECB meeting - Nasdaq.com",
  "text": [
    "By Gertrude Chavez-Dreyfuss",
    "NEW YORK, Sept 11 (Reuters) - U.S. Treasury yields advanced on Wednesday for a third straight day, moving in lock step with the euro zone bond market, amid uncertainty about Thursday's European Central Bank meeting, which could prove less aggressive in easing monetary policy.",
    "U.S. benchmark 10-year and 2-year note yields climbed to five-week peaks, while those on 30-year bonds advanced to four-week highs. In the euro zone, most 10-year bond yields stayed close to recent highs.",
    "\"There was an expectation that the ECB would be aggressive with easing,\" said Tom Simons, economist at Jefferies in New York. \"If they're not, that kind of changes the calculus a little bit. There's nervousness on that front, so there's a lot of paring back of positions.\"",
    "A Reuters poll showed nearly 70 economists were expecting the ECB to cut its deposit rate at the meeting, predicting a 10 basis point reduction to -0.5%. ",
    "Yields also found support from a further easing in U.S.-China trade tensions  after China announced its first batch of tariff exemptions for 16 types of U.S. products, days ahead of a planned meeting between trade negotiators. ",
    "Trump described China's move as \"good gesture\". ",
    "\"The sentiment that we're slipping into recession is quickly slipping,\" said Stan Shipley, fixed income strategist, at Evercore ISI in New York. He added that the Federal Reserve will likely cut interest rates next month, but after that, \"it gets more squishy.\"",
    "Trump on Wednesday called on the Fed to lower interest rates into negative territory, a move reluctantly used by some major central banks to battle weak economic growth as it punishes savers and banks' earnings in the process. ",
    "Evercore's Shipley said this is not something an independent Fed would do. \"If Trump really thinks about it, zero or negative interest rates would be consistent with a recession and that's the last thing he wants.\"",
    "In afternoon trading, U.S. 10-year note yields  rose to 1.74% from 1.702% late on Tuesday. Early in the session, 10-year yields hit a five-week high of 1.752%.",
    "Yields on 30-year bonds were also higher at 2.217%  from 2.181% on Tuesday, moving further away from record lows of 1.905% touched in late August. U.S. 30-year yields also hit a four-week peak of 2.233% earlier in the global session.",
    "U.S. two-year yields rose as well to 1.676% from Tuesday's 1.664% , hitting a five-week high of 1.686%.",
    "Also on Wednesday, the Treasury sold $24 billion in re-opened U.S. 10-year notes, but the auction posted mixed results. The high yield of 1.739% was higher than the expected yield at the bid deadline. But the bid-to-cover ratio was better than average at 2.46. ",
    "September 11 Wednesday 3:41PMNew York / 1941 GMT"
  ],
  "published_datetime": "2019-09-11 03:55:00"
}