{
  "url": "https://www.nasdaq.com/article/signet-jewelers-ltd-sig-q2-2020-earnings-call-transcript-cm1208195",
  "title": "Signet Jewelers Ltd (SIG) Q2 2020 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "Image source: The Motley Fool.",
    "Signet Jewelers Ltd (NYSE: SIG)\r\n Q2 2020 Earnings Call\r\n Sep 5, 2019 , 8:30 a.m. ET",
    "Operator",
    "Good morning. My name is Lisa, and I'll be your conference operator today. At this time, I would like to welcome everyone to the Signet Jewelers Second Quarter Fiscal 2020 Earnings Conference Call. [Operator Instructions] Thank you.",
    "Randi Abada, Senior Vice President of Investor Relations, you may begin your conference.",
    "Randi Abada -- Senior Vice President Corporate Finance Strategy and Investor Relations",
    "Thank you. Lisa. Good morning, and welcome to our second quarter earnings conference call . On the call today are Signet's CEO, Gina Drosos; and CFO, Joan Hilson. During today's presentation, we will make certain forward-looking statements. Any statements that are not historical facts are subject to a number of risks and uncertainties and actual results may differ materially. We urge you to read the risk factors, cautionary language, and other disclosures in our annual report on Form 10-K and quarterly reports on Form 10-Q. Except as required by law, we undertake no obligation to revise or publicly update forward-looking statements in light of new information or future events.",
    "During the call, we will discuss certain non-GAAP financial measures. For further discussion of the non-GAAP financial measures, as well as reconciliations of the non-GAAP financial measures to the most directly comparable GAAP measures, investors should review the news release we posted on our website at www.signetjewelers.com/investors.",
    "I'll now turn the call over to Gina.",
    "Virginia C. Drosos -- Chief Executive Officer",
    "Thank you, Randi. Good morning, everyone, and thank you for joining today's call. To begin, I would like to thank all of our Signet team members, for their support of our customers and for embracing and leading change as we continue to execute our transformation. In my remarks today, I'll start by discussing second quarter results and then preview our holiday plans and the progress toward our transformation. I'll wrap up with some brief comments on our financial guidance.",
    "We continue to execute with diligence on our transformation priorities. In the second quarter, we delivered results above our guidance for same store sales, non-GAAP operating profit and non-GAAP EPS and grew operating profit year-over-year. Also adjusted free cash flow excluding last year's credit proceeds is up $243 million year-to-date due to effective cost control and disciplined inventory management. Despite weak overall retail industry traffic trends, our transformation initiatives for merchandise and targeted digital marketing delivered improved traffic and sales performance as we moved through the quarter. The quarter started off slowly in May and significantly improved in July, with Signet's core North America banners outperforming industry traffic trends for the overall quarter. Importantly, we delivered positive North America same store sales in the July Prime Day promotional week, both in-store and online.",
    "Here are some highlights of our sales performance. Total company same store sales were down 1.5% in the second quarter. North America same store sales were down 1%, inclusive of an 85 basis point unfavorable impact related to a timing change to revenue recognition on service plans and a planned promotional timing shift into Q1 at Jared. E-commerce was up 9.9% in our North America banners, excluding James Allen, and up 4.4% on a consolidated basis. James Allen sales declined 1.5%, a sequential improvement from the first quarter as marketing and assortment changes began to offset pressure from sales tax implementation and the competitive marketplace.",
    "We continue to see benefits from increased newness, which particularly drove strong fashion sales in the second quarter. Fashion grew across all North America banners. Piercing Pagoda continued to deliver double-digit growth for the fifth consecutive quarter. Growth in on trend gold, our in-house designed Love and Be Loved collection, Disney and Aladdin drove the momentum in fashion. Bridal sales experienced some softness with performance improving as we moved through the quarter. Flagship brands enchanted Disney, Leo and (04:15) Brilliance were strong contributors to bridal sales.",
    "Turning to profits. Second quarter non-GAAP operating profit performance was ahead of last year and is the second consecutive quarter of year-over-year stabilization, reflecting continued stability in North America merchandise margin and strong cost discipline. Non-GAAP operating profit came in ahead of our guidance due to better same store sales, higher cost savings and lower credit costs, as well as some benefit from reinvestment shifting into the second half.",
    "Now I'll turn to an update on our holiday plans and Path to Brilliance transformation initiative. Our plans are well under way within our strategic priorities a customer first omni-channel and culture of agility and efficiency. Within customer first, our priorities on improved merchandise, transforming marketing and media effectiveness and improving our shopping experience, including laying the foundation for our service business to be a longer term, meaningful revenue and margin driver for Signet. We are executing on our product strategy to build bigger iconic flagship brands, offer a highly competitive assortment for value-oriented shoppers, especially during holiday periods, and deliver relevant on-trend product. We continue to revamp our product architecture toward more curated relevant assortments. This holiday, we are positioned with bigger branded product launches, a more competitive selection of gifts and key price points for value-oriented shoppers.",
    "We are strengthening our flagship brands. The Disney partnership continues to expand with new princess anniversary bridal designs and fashion expansions. In Vera Wang, we have new designs for women, and the launch of a new Vera Wang men's collection, as well as the expansion of custom design offerings. Neil Lane premiere bridal is expected to expand to a larger number of stores and we will also have new fashion offerings. Additionally, we are expanding our colored gemstone bridal offerings across each of our Disney enchanted Vera Wang and Neil Lane flagship brands.",
    "We are also investing in our fashion assortment. Our holiday plans include amplification of on-trend gold product offerings, including investments in visual merchandising and continued expansion of our exclusive Love and Be loved collection, which has continued to perform well. We also plan to expand the recently tested True North Celestial diamond collection online and to our top 350 Kay [Phonetic] stores for holiday.",
    "In Bridal, we are refreshing our exclusive past, present, future product line at Zales. We are also launching a new Zales product collection. This art deco inspired line was created to celebrate Zales as rich heritage and diamond expertise, since 1924. In addition, we have developed several new exclusive to Signet, bridal and fashion collections that we plan to discuss after they launch in the third quarter. Overall, we believe we have made solid progress on our merchandising strategy toward our goal of reaching an inflection point of newness across our new and existing iconic flagship brands, on-trend merchandise and value-oriented offerings for holiday.",
    "Moving onto marketing. We are continuing to implement strategic changes to our marketing model with respect to timing of spend and mix of media, which is driving greater efficiency and effectiveness. The timing of advertising spend has been rebalanced to a more always on model to support bridal throughout the year. Given the shorter selling season for holiday this year, we are also moving some spend into the third quarter to begin driving awareness earlier in the season.",
    "Piercing Pagoda recently launched its first ever holistic advertising campaign \"Be More You\" across digital and social platforms, as well as custom kiosk signage. Each of our banners will have innovative, integrated campaigns for holiday with strong banner differentiation and modernized creative. We expect to improve return on investment by moving to a higher mix of digital advertising, as well as more efficient targeting of spend. Our new media agency is on-boarded, integrated with our teams, leveraging our proprietary data and executing our targeted strategies in the second half of the year.",
    "Now, I would like to discuss our plans to leverage our full-service jeweler capabilities to drive traffic, create higher frequency relationships with our customers and add incremental higher margin sales. We have spent the last several quarters implementing a Brilliant at the Basics strategy for care, repair and custom capabilities. We've provided focused training to our store team members and developed new tools and technology to improve operations and enhance the customer experience. For example, a repair intake that formally took 20 minutes, now takes approximately seven minutes using our new e-repair ticket system. These efforts have resulted in steady quarter-on-quarter improvement in our repair net promoter score over the last four quarters. We have begun implementing website updates, marketing in-store signage and special events to drive customer awareness of our enhanced care, repair and custom services during holiday and beyond.",
    "Providing piercing services is also a traffic and margin growth opportunity for Signet. Piercing provides opportunities to drive incremental traffic, as well as build customer relationships early to set a stage for future sales to celebrate many life moments, including engagements. We know from our experience that Piercing Pagoda, that piercing skews to an attractive point of entry customer with an average age of 11 to 17. Our research indicates that a distinct group of customers interested in ear piercing would be highly interested in this service at Kay. So we have been testing and learning at a small group of Kay stores, leveraging the expertise of our Piercing Pagoda team. These tests will be expanded further during the fourth quarter with an expectation of offering piercing services at several hundred Kay stores by early next year. Overall, while services will be a small incremental contributor in fiscal 2020, we expect it to be a meaningful traffic and revenue driver for Signet in the longer term as we scale our efforts.",
    "Turning to omni-channel. Our omni-channel transformation efforts have resulted in a significant increase in online channel adoption, with e-commerce penetration doubling over the last two years to reach 11.5% of sales in the second quarter. This was enabled by strong progress in platform and mobile technologies, integrated omni-channel marketing efforts and custom design capabilities. As I've mentioned on prior calls, we are making significant investments in platform and mobile technology in fiscal 2020. The Kay and Jared transition to the hybris platform is scheduled to go live later this month, significantly improving the customer experience on those sites. Our investments in mobile experience, which deliver faster load speeds, higher quality images and improved curated search, go live at Zales in the third quarter. Kay and Jared mobile enhancements will quickly follow that hybris transition, evidencing the speed and efficiency enabled by establishing a common best-in-class technology foundation across our banners. We believe that these changes will set us up to drive higher traffic to our sites and create a more compelling, user-friendly customer experience for holiday. In the second quarter, we had a strong integrated omni-channel effort during the week of the Prime Day event. Our core assortment offerings, both in-store and online and additional e-commerce only offers drove positive same store sales and strong double-digit growth in e-commerce for our North America banners during Prime Week.",
    "We are also continuing to build best-in-class customization capability through our design your own tools across banners as well as unique omni-channel programs. Our integrated approach will allow us to expand customization options from multiple vendors more quickly in the future. After successful testing, we have also expanded the Vera Wang online design your own tool into the store with sample settings and shapes for customers to try on and create a custom ring. This in-store experiential program was inspired by an offering in our James Allen Washington, DC store and is expanding to all Zales stores this fall.",
    "Moving on to Culture of Agility and Efficiency. Our cost optimization efforts positively impacted our second quarter results. We continue to expect $70 million to $80 million in net cost savings in fiscal 2020. Our gross savings are primarily driven by indirect procurement, workforce optimization and lower corporate costs with a portion of the gross savings reinvested in transformative technology and innovation initiatives to drive growth. We have finalized our direct procurement negotiations with our vendors enabling us to accelerate new products, lower our costs and further optimize inventory efficiency beginning in the fourth quarter. Our three-year Path to Brilliance net cost savings goal remains $200 million to $225 million, inclusive of the $85 million in net cost savings achieved in fiscal 2019.",
    "Before I turn the call over to Joan, I will briefly discuss tariff and our fiscal 2020 financial guidance. We are continuing to monitor the ongoing tariff discussions and are hopeful that a long-term agreement can be reached quickly. As we have mentioned previously, the three tranches of tariffs that were enacted in 2018 have no meaningful impact on our business. However, our jewelry merchandise is subject to the recently announced List 4 tariff, which took effect on September 1st. We believe that the actions we've taken to leverage the flexibility in our multinational supply chain will enable us to cover the current 15% List 4 tariff impact within our fiscal 2020 operating profit guidance range. In fiscal 2020, we do not expect to pass along price increases to our customers as a result of tariffs.",
    "While it is premature to provide an estimate for fiscal 2021, through a strategic and disciplined effort. We have been successful in working with our vendors to move a significant amount of our China exposure to other countries. By fiscal 2020 year-end, we expect our merchandise spend exposure to China to be in the mid-teens on a percentage basis, roughly half of the exposure we discussed on our last call. Going forward, we are continuing to work through mitigation strategies in partnership with our multinational vendors.",
    "Turning to guidance. We are reiterating our fiscal 2020 same store sales and non-GAAP operating profit guidance ranges. As I just mentioned, our fiscal 2020 non-GAAP operating profit guidance now includes the expected impact of tariffs. We also continue to expect fiscal 2020 adjusted free cash flow to be higher versus fiscal 2019, primarily driven by lower inventory. As we enter the second half of our fiscal year, we are encouraged by continued growth in e-commerce sales, momentum on our fashion product performance, and the positive impact of strong cost discipline on our operating profit. We believe our outlook appropriately balances these signs of operational improvement with the fact that it is still early in the year. The North America retail environment remains competitive and we continue to face challenges in the UK.",
    "With respect to capital management, this morning we declared a quarterly dividend of $0.37 per share. We continue to evaluate all potential uses of cash, including investing in the business, dividends, share repurchases, and debt repayment as part of our business planning and capital management processes. In closing, we have made good progress building foundational capabilities needed to build Signet's leadership in the jewelry category. We are gaining traction on our multi-year Path to Brilliance transformation and continue to work with diligence to bring critical mass these initiatives to market, while operating in a dynamic and competitive retail environment.",
    "And now I'll turn the call over to Joan.",
    "Joan Hilson -- Chief Financial Officer",
    "Thanks, Gina, and good morning, everyone. In my remarks, I'll first cover the highlights of our second quarter financial results, then discuss our refinancing plans, and conclude with guidance. In the second quarter, same store sales declined 1.5%. In North America, Piercing Pagoda was up double digits. Sales returned to low single digits same store sales growth and we saw growth in e-commerce. Jared improved sequentially adjusted for a planned promotional timing shift and against the more difficult prior year comparison. Kay's same store sales were down low single digits with Kay's more significant product launches still expected to come in Q3 and Q4. International same store sales continued to reflect the challenging operating environment in the UK.",
    "Revenue declined 3.9%, reflecting lower same store sales, the impact of net store closures and the impact of foreign exchange. Non-GAAP gross margin was down 60 basis points in the quarter and was impacted by two structural items. First, we continued our strategy of higher sales to third parties of non-productive diamond inventory from our diamond polishing operations in Botswana to clear excess inventory and generate cash. Similar to the first quarter, this had an unfavorable 65 basis points impact on our gross margin rate. And secondly, as expected there was an unfavorable impact of 25 basis points related to the timing of revenue recognition on service plans. Stabilization in merchandise margin in our North America banners and transformation cost savings were offset by the structural impacts on non-GAAP gross margin.",
    "SG&A was down $33 million, or 1.1% of sales on a year-over-year basis. This performance was driven by lower corporate and indirect spend, as well as lower store staff costs primarily due to store closures. These favorable items were somewhat offset by a $5 million increase in credit costs, as we did not anniversary the outsourcing of our non-prime credit business until late in the second quarter.",
    "Non-GAAP operating profit grew year-over-year, reflecting transformation cost savings somewhat offset by lowering year-over-year sales. Non-GAAP EPS of $0.51 was nearly flat versus prior year, despite a year-over-year tax headwind of $0.11 as we move toward a more normalized tax rate in fiscal 2020. Our second quarter GAAP operating profit detailed in our press release this morning, include the $48 million immaterial out of period adjustment related to goodwill impairments taken in fiscal 2019 with respect to Zales and James Allen. This is a non-cash charge, has no impact on Signet's liquidity and does not reflect any underlying change in our outlook for these businesses.",
    "Turning to balance sheet and cash flow. We are making solid progress, unlocking working capital opportunities and generating higher free cash flow. Our enhanced inventory planning processes are beginning to have impact as we continue to thoughtfully reduce legacy inventory and employ a more disciplined purchasing strategy for new inventory. As a result, inventory is down 4%, or $92 million versus prior year in the second quarter and down 5%, or $115 million versus fiscal 2019 year-end. We continue to expect inventory levels to be lower at year-end versus fiscal 2019. We do expect inventory to increase sequentially in the third quarter due to the typical seasonality of our business as we prepare for the holiday season. We made continued strong progress on cash, generating $194 million in adjusted free cash flow year today, which is up $243 million year-over-year excluding the proceeds from the non-prime credit transaction in the prior year.",
    "Now, I would like to provide an overview of our refinancing plans. We expect to enter into fully committed five-year asset based credit facilities of $1.6 billion to refinance our existing credit facility and term loan that mature in 2021 and the outstanding senior notes due in 2024. As part of the refinancing, this morning we have announced a tender offer for the senior notes with the offer completion subject to a majority of the notes being tendered. Those refinancing improves our financial flexibility as it is expected to be leverage neutral, it extends Signet's debt maturity profile and increases available liquidity. These new facilities are also expected to result in slightly lower interest expense versus our current capital structure, which has been incorporated in our guidance. We continue to expect our leverage ratio to be approximately 4.0 times by the completion of our transformation plan at year-end fiscal 2021.",
    "Moving on to guidance. We are reiterating our fiscal 2021 same store sales guidance of down 2.5% to down 1.5% and fiscal 2020 non-GAAP operating profit guidance of $260 million to $280 million. Our profit guidance reflects net cost savings of $70 million to $80 million with higher reinvestments in the second half of the year. We expect the impact of credit outsourcing to have a neutral impact year-over-year. And as Gina mentioned earlier, our operating [Phonetic] profit guidance now incorporates the expected impact of List 4 tariff.",
    "While we exceeded our non-GAAP operating profit guidance in the first half of the year, we are remaining prudent in our outlook as a significant portion of our revenue and the vast majority of our operating profit is generated in the fourth quarter. The North America retail environment remains competitive. We also face continued headwinds in the UK, and we are now covering expected tariff costs.",
    "With respect to fiscal 2020 non-GAAP EPS, we are updating our guidance to $2.91 to $3.23. This EPS guidance update is due to lower interest expense resulting from the expected impact of the refinancing, lower interest rate expectations and strong free cash flow generation in the first half of the fiscal year. Our operational plans and transformation goals remain unchanged. Our non-GAAP tax rate guidance is also unchanged. And we continue to expect no share repurchases in fiscal 2020.",
    "We expect to close our refinancing during the third quarter and we will provide further details on its impact during our third quarter earnings call . Please note that we have excluded any potential gain or loss on early extinguishment of debt as well as any fees related to the tender offer from the guidance we provided today.",
    "For the third quarter, we expect same store sales of down 1% to down 2%. Non-GAAP operating income is expected to be a loss of $42 million to $50 million with a non-GAAP EPS loss of $1.02 to $1.16. Our same store sales outlook reflects the expected benefits of product launches late in the third quarter, balanced by Piercing Pagoda beginning to lap mid-teens prior year comparisons. James Allen not yet wrapping sales tax implementation and continuing challenges in the UK.",
    "Consistent with our \"Always On\" media strategy, the third quarter operating profit outlook includes an approximately $12 million year-over-year increase in advertising as well as the favorable impact of net cost savings. The net cost savings in the third quarter are slightly below second quarter levels due to a shift in timing of reinvestment spend. As a reminder, the third quarter is our smallest revenue dollar quarter of the year and as a result revenue and expense drivers can have a larger impact on growth rates and margin rates.",
    "To close out my comments, we are encouraged by the progress we have made year-to-date in stabilizing same store sales and margins, lowering our inventories and generating higher free cash flow. I'm confident that we're on the right track to deliver our commitments for fiscal 2020, as well as our long-term transformation initiative.",
    "And now I'll turn the call over to the operator to begin the Q&A section.",
    "Operator",
    "Thank you. [Operator Instructions] And our first question comes from the line of Lorraine Hutchison from Hutchison. Your line is open.",
    "David Buckley -- Bank of America Merrill Lynch -- Analyst",
    "Hi. This is David Buckley on for Lorraine this morning. Thanks for taking our question. Looking forward, what are the key factors to get the comp growing again? And then can you share any quarter-to-date commentary? Has the improvement that you saw in North America comps in second quarter continued in the third quarter?",
    "Virginia C. Drosos -- Chief Executive Officer",
    "Hi, David. It's Gina. I'll take that and then Joan you can chime in with anything incremental. I think the Path to Brilliance strategies that we're putting in place are beginning to get some traction and the key to getting to positive comp growth is really in the customer first and omni-channel initiatives. So continuing to execute our merchandise strategy around bigger iconic brands, around having the right value offerings for shoppers, especially in key holiday periods and being more on trend. We've made some big moves into gold, into colored gemstones. Customers are very interested in those at this point in time and it's paying off for us. So I think on the merchandising strategy, that's key. And then I'd also highlight on the marketing strategy, we did hire a new media agency at the beginning of this year, the intention was to leverage the proprietary data that Signet has as the world's largest specialty retail jeweler and be able to more efficiently and effectively target our media spend to the right customer journeys. So bridal messaging to bridal customers, gifting messaging to gifting customers, that agency is now fully on board. And so we're beginning to see the -- you know those efforts take hold as we go into holiday. And then on omni-channel, first and foremost, it was to get us to the right platforms. We haven't had a great performance on particularly our Kay and Jared e-comm platforms. Over the last couple of holiday periods, as traffic really increases, we have on Zales and Pagoda, since moving to the hybris platform and so that along with the mobile investments that we've made, we think are really fundamental to getting us toward positive comps.",
    "Operator",
    "[Operator Instructions] Our next question comes from the line of Paul Lejuez from Citigroup. Your line is open.",
    "Paul Lejuez -- Citigroup -- Analyst",
    "Thanks, guys. Guys as we look ahead to next year on the SG&A line, are there any investments that need to be made to support the business, or should we expect that SG&A can actually be down next year? And I guess I'm kind of curious if you feel there are any places that maybe pull back a little bit too much that might be hurting top line where you might need to reinvest? Thanks.",
    "Virginia C. Drosos -- Chief Executive Officer",
    "So, Paul, I'll take that question. Well, we don't really provide SG&A guidance. A couple of things that I would say about our cost savings program. We have taken out of our cost non customer facing cost, which we believe have been important in delivering the reinvestments that we need to make to support our top line sales and our growth. So as we invest in the hybris initiative and we invest in the \"Always On\" marketing strategy that Joan [Phonetic] mentioned, that's how we have approached the transformation initiative and made very thoughtful and meaningful reductions in cost to support the growth for the company.",
    "As we look forward in terms of our investments in the business, we consider all of the operating model that you would think about in a retail company, right. We have store labor investments. We have our operating models in terms of evaluating our real estate strategy. So we evaluate all of those components as we look forward into the future. So, as it stands right now, we are very comfortable with the cost savings initiatives that we put in place.",
    "Paul Lejuez -- Citigroup -- Analyst",
    "Thank you. Just a follow up. I'm curious, I think, when you x-out [Phonetic] some of the timing things in the gross margin line, gross margin was flattish, I believe, if I heard you correctly. I was curious if you could talk specifically about merch margin and also by concept, which concepts you're seeing better merch margin on a year-over-year basis versus the remote pressure perhaps by the promotional environment. Thanks.",
    "Virginia C. Drosos -- Chief Executive Officer",
    "Sure. We are -- what we're pleased with is, we saw the stabilization in our North America gross merchandise margin and which does also incorporate the impact of clearance sales. We would -- we've also embedded our updated view on the impact of clearance sales on our gross merchandise margin and inventory in our updated guidance for the third and fourth quarter and for the year. I would just remind you, Paul, that the 65 bps impact on margin that I mentioned from Botswana and that is also something that we continue to expect as we manage our way through the balance of the year.",
    "Paul Lejuez -- Citigroup -- Analyst",
    "Thanks. And by concept, wondering if you can share any insights as to better or worse here we are.",
    "Virginia C. Drosos -- Chief Executive Officer",
    "Yeah. What we can talk about is, is North America merchandise margin as stabilized.",
    "Paul Lejuez -- Citigroup -- Analyst",
    "Got you. Thanks. Good luck.",
    "Virginia C. Drosos -- Chief Executive Officer",
    "Thank you.",
    "Operator",
    "[Operator Closing Remarks]",
    "Duration: 54 minutes",
    "Randi Abada -- Senior Vice President Corporate Finance Strategy and Investor Relations",
    "Virginia C. Drosos -- Chief Executive Officer",
    "Joan Hilson -- Chief Financial Officer",
    "David Buckley -- Bank of America Merrill Lynch -- Analyst",
    "Paul Lejuez -- Citigroup -- Analyst",
    "More SIG analysis",
    "All earnings call transcripts",
    "10 stocks we like better than Signet Jewelers\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks  for investors to buy right now... and Signet Jewelers wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "This article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.",
    "Motley Fool Transcribers has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 01:23:29"
}