{
  "url": "https://www.nasdaq.com/article/euro-zone-bond-yields-extend-climb-on-trade-talk-hopes-20190905-00127",
  "title": "Euro zone bond yields extend climb on trade talk hopes - Nasdaq.com",
  "text": [
    "By Tommy Wilkes",
    "LONDON, Sept 5 (Reuters) - Euro zone bond yields inched higher on Thursday as investors welcomed signs of progress in resolving the U.S.-China trade war, and seized on recent doubts about whether a European Central Bank stimulus package next week can match expectations.",
    "After a strong rally in August, euro zone bonds stumbled in recent days.",
    "On Thursday, China's commerce ministry said Beijing and the United States agreed to hold high-level trade talks in early October in Washington, easing fears that the escalating trade war will trigger a global recession. ",
    "Comments ECB policymakers on Wednesday also appeared to dampen expectations for aggressive stimulus next week.",
    "\"Investors are a little bit concerned that the ECB won't act as expansionary as expected,\" said Daniel Lenz, a rates strategist at DZ Bank.",
    "Lenz said that the market would likely struggle for direction until next Thursday's meeting either disappointed investors or sparked another leg in the rally.",
    "He also noted that this week's ECB comments fit into a pattern of policymakers raising expectations, before dampening them in the weeks preceding a meeting to give themselves room not to disappoint on the day.",
    "The 10-year German Bund  rose more than 1 basis point to -0.66%, away from the record lows of -0.743% touched on Tuesday.",
    "Other top-rated euro zone yields also increased , , although the rises were small.",
    "\"To summarise the tone of the various comments so far from officials (anonymous or not), we would say that at least a degree of doubt as to the ECB's commitment to restarting the APP (Asset Purchase Programme) in September should be priced in,\" ING fixed income strategists wrote in a research note.",
    "\"The modest back-up in EGB (European government Bonds) yields (Italy excepted) is in our view still fairly minor compared to what market reaction would be if an underwhelming package is unveiled on 12 September.\"",
    "Italian yields, which have spiralled lower in the past week after agreement was reached on a new coalition government in Rome, steadied near their record lows.",
    "The 10-year Italian yield was unchanged at 0.826% , close to the record low of 0.803%. The  and 30-year  Italian bond yields were also little moved in early trade.",
    "Italian bonds, which still yield far more most euro zone peers such as Spain and Portugal, have rallied as investors welcome the formation of a government that could prove to be more fiscally responsible than the last.",
    "Analysts say that if after the recent plunge lower in yields, many international investors remain underweight Italian bonds and with the yields relatively attractive, more could pile back in. DZ Bank is targeting a spread between the benchmark German 10-year Bund and the 10-year Italian bond of 120 basis points - 30 basis points lower than current levels ."
  ],
  "published_datetime": "2019-09-05 04:01:00"
}