{
  "url": "https://www.nasdaq.com/article/4-solar-dividend-stocks-to-buy-today-cm1207083",
  "title": "4 Solar Dividend Stocks to Buy Today - Nasdaq.com",
  "text": [
    " The solar industry has had its share of ups and downs over the   past decade, particularly as manufacturers have had to lower   costs to stay competitive. But falling costs have made solar   energy more competitive in the global energy market, which has   driven a rapid increase in installed solar projects. As the industry grows, a key segment is solar project owners.   These are ultimately the financiers of solar projects around the   world, and they also happen to be some of the best dividend   payers in energy today. Right now,   TerraForm Power    (NASDAQ: TERP) ,   NextEra Energy    (NYSE: NEE) ,   NextEra Energy Partners    (NYSE: NEP) , and   Atlantica Yield    (NASDAQ: AY) are my   top dividend picks in the solar industry    .   Image source: Getty Images.makeArticleAd();  TerraForm Power This was one of the first   yieldcos    on the market and got into financial trouble   when its parent company SunEdison went into   bankruptcy.     But today it's run by   Brookfield Asset Management    and has a much more conservative and sustainable dividend and   growth strategy. For starters, the company owns 3,748 megawatts (MW) of wind   and solar projects with 1,345 MW being solar. The solar assets   range from rooftop solar systems on homes and commercial   buildings to some of the largest solar farms in the world. The   portfolio of assets has a weighted average of 13 years left on   its contracts to sell energy to customers like utilities,   corporations, and governments. That creates the stable cash flow   that funds the dividend. Over time, TerraForm aims to keep 15% to 20% of its cash   available for a distribution to pay down debt or acquire new   projects. Growth is expected to lead to a 5% to 8% distribution   increase annually. With a starting dividend yield of 4.8% today,   that's a high and   stable payout for investors    . The NextEra family of companies Utility NextEra Energy is the largest wind and solar   generating company in the world. It has its regulated utility, a   power producing division, and its subsidiary NextEra Energy   Partners. Under its energy resources division, a power-plant developer,   NextEra Energy owns 3 gigawatts (GW) of solar production and is   planning to invest in another 3.8 to 7.3 GW of solar by the end   of 2022. This will help maintain its spot as the biggest   renewable energy owner in the world and quickly increase its base   of solar assets. NextEra Energy Partners is a subsidiary that owns   renewable-energy projects with long contracts to sell electricity   to utilities, just like TerraForm Power, and its portfolio   consists of 750 MW of solar and 4,575 MW of wind assets right   now. It relies more heavily on wind today, but the solar   portfolio is growing quickly. The yieldco has 16 years of   remaining contract life on existing assets and says it has   visibility to 12% to 15% annual dividend growth through the end   of 2024. NextEra Energy's primary business is as a utility, and that's   why it has a relatively low 2.2% dividend yield, but the   diversity of the business is a strength for investors. NextEra   Energy Partners has a 4% dividend yield, and if its growth   targets are met, this could be a great payout for investors for   decades. The solar yieldco play Atlantica Yield is a yieldco structured similar to TerraForm   Power and NextEra Energy Partners. It owns renewable-energy   assets along with a small number of natural gas, transmission,   and water assets. Nearly 90% of the company's 1,496 MW of   renewable energy assets are solar, with wind accounting for the   rest. The average contract duration remaining on the company's   assets is 18 years, longer than the companies I've highlighted   above, which provides additional stability in cash flow. And the   dividend was just increased by 18% to $0.40 per share, or an   annualized yield of 6.7%. The high dividend may make it hard for   the company to acquire growth projects with stock, one way   yieldcos fund growth, but if you're just looking for a high-yield   dividend payout with less certainty for long-term growth, this is   it. Solar's    dividend   stocks  There aren't a lot of solar stocks that pay dividends. But   these utilities and yieldcos are an emerging part of the energy   market, and they're financing the solar industry's growth while   paying lar   ge   dividends    to investors. If you're looking for payouts that can stand the   test of time, these are four great stocks for your portfolio.   10 stocks we like better than NextEra Energy       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and NextEra Energy wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Travis Hoium      owns shares of NextEra Energy Partners. The Motley Fool     recommends NextEra Energy. The Motley Fool has a     disclosure policy      .  ",
    "The solar industry has had its share of ups and downs over the   past decade, particularly as manufacturers have had to lower   costs to stay competitive. But falling costs have made solar   energy more competitive in the global energy market, which has   driven a rapid increase in installed solar projects.",
    "As the industry grows, a key segment is solar project owners.   These are ultimately the financiers of solar projects around the   world, and they also happen to be some of the best dividend   payers in energy today. Right now,   TerraForm Power    (NASDAQ: TERP) ,   NextEra Energy    (NYSE: NEE) ,   NextEra Energy Partners    (NYSE: NEP) , and   Atlantica Yield    (NASDAQ: AY) are my   top dividend picks in the solar industry    .",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "This was one of the first   yieldcos    on the market and got into financial trouble   when its parent company SunEdison went into   bankruptcy.     But today it's run by   Brookfield Asset Management    and has a much more conservative and sustainable dividend and   growth strategy.",
    "For starters, the company owns 3,748 megawatts (MW) of wind   and solar projects with 1,345 MW being solar. The solar assets   range from rooftop solar systems on homes and commercial   buildings to some of the largest solar farms in the world. The   portfolio of assets has a weighted average of 13 years left on   its contracts to sell energy to customers like utilities,   corporations, and governments. That creates the stable cash flow   that funds the dividend.",
    "Over time, TerraForm aims to keep 15% to 20% of its cash   available for a distribution to pay down debt or acquire new   projects. Growth is expected to lead to a 5% to 8% distribution   increase annually. With a starting dividend yield of 4.8% today,   that's a high and   stable payout for investors    .",
    "Utility NextEra Energy is the largest wind and solar   generating company in the world. It has its regulated utility, a   power producing division, and its subsidiary NextEra Energy   Partners.",
    "Under its energy resources division, a power-plant developer,   NextEra Energy owns 3 gigawatts (GW) of solar production and is   planning to invest in another 3.8 to 7.3 GW of solar by the end   of 2022. This will help maintain its spot as the biggest   renewable energy owner in the world and quickly increase its base   of solar assets.",
    "NextEra Energy Partners is a subsidiary that owns   renewable-energy projects with long contracts to sell electricity   to utilities, just like TerraForm Power, and its portfolio   consists of 750 MW of solar and 4,575 MW of wind assets right   now. It relies more heavily on wind today, but the solar   portfolio is growing quickly. The yieldco has 16 years of   remaining contract life on existing assets and says it has   visibility to 12% to 15% annual dividend growth through the end   of 2024.",
    "NextEra Energy's primary business is as a utility, and that's   why it has a relatively low 2.2% dividend yield, but the   diversity of the business is a strength for investors. NextEra   Energy Partners has a 4% dividend yield, and if its growth   targets are met, this could be a great payout for investors for   decades.",
    "Atlantica Yield is a yieldco structured similar to TerraForm   Power and NextEra Energy Partners. It owns renewable-energy   assets along with a small number of natural gas, transmission,   and water assets. Nearly 90% of the company's 1,496 MW of   renewable energy assets are solar, with wind accounting for the   rest.",
    "The average contract duration remaining on the company's   assets is 18 years, longer than the companies I've highlighted   above, which provides additional stability in cash flow. And the   dividend was just increased by 18% to $0.40 per share, or an   annualized yield of 6.7%. The high dividend may make it hard for   the company to acquire growth projects with stock, one way   yieldcos fund growth, but if you're just looking for a high-yield   dividend payout with less certainty for long-term growth, this is   it.",
    "There aren't a lot of solar stocks that pay dividends. But   these utilities and yieldcos are an emerging part of the energy   market, and they're financing the solar industry's growth while   paying lar   ge   dividends    to investors. If you're looking for payouts that can stand the   test of time, these are four great stocks for your portfolio.",
    "  10 stocks we like better than NextEra Energy       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and NextEra Energy wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than NextEra Energy       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and NextEra Energy wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Travis Hoium      owns shares of NextEra Energy Partners. The Motley Fool     recommends NextEra Energy. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:18:00"
}