{
  "url": "https://www.nasdaq.com/article/confirmation-of-uschina-trade-talks-buoys-shares-investors-spirits-20190905-00034",
  "title": "Confirmation of U.S.-China trade talks buoys shares, investors' spirits - Nasdaq.com",
  "text": [
    "By Stanley White",
    "TOKYO, Sept 5 (Reuters) - Asian shares extended gains on Thursday and U.S. stock futures jumped after China said it will hold trade talks with the United States in early October, raising hopes they can de-escalate their trade war before it inflicts further damage on the global economy.",
    "MSCI's broadest index of Asia-Pacific shares outside Japan  was up 1.08% at its highest since Aug. 2, while the Shanghai composite index  surged 1.7%. Japan's Nikkei  added 2.4%.",
    "Pan-European Euro Stoxx 50 futures  were up 1.01%, with Germany's DAX futures  up 1.04% and FTSE futures  up 0.64%.",
    "The Chinese yuan jumped versus the dollar in offshore trade, while safe-have assets such as gold, the Swiss franc, and the yen fell.",
    "China's confirmation of trade talks added to upbeat geopolitical news overnight. A parliamentary vote in Britain put the brakes on the nation's no-deal exit from the European Union, Hong Kong withdrew a contentious extradition bill that sparked recent protests and political turmoil in Italy appeared to be easing.",
    "China'sCommerce Ministry said its trade team will consult with their U.S. counterparts in mid-September in preparation for negotiations in early October, hinting at progress in reducing trade friction.",
    "Both sides had agreed to take actual actions to create favourable conditions, the ministry added, without giving more details.",
    "\"Since yesterday, there has been limited downside in markets because of what happened in Hong Kong, but now the U.S.-China talks are the story,\" said Masayuki Kichikawa, chief macro strategist at Sumitomo Mitsui Asset Management Co in Tokyo.",
    "\"It's the same about Brexit, which means less downside risk.\"",
    "Any sign that Washington and Beijing are closer to scaling back or resolving their trade dispute would lift a significant burden from the global economy, but many analysts believe the two sides are dug in for a longier and costlier battle.",
    "Hong Kong  shares erased early losses to rise 0.3%. They had jumped in afternoon trade on Wednesday after leader Carrie Lam said she was withdrawing an extradition bill that had triggered months of often violent protests in the Asian financial hub.",
    "Lam said on Thursday she hopes the formal withdrawal of a controversial extradition bill and other measures will help solve the city's political crisis. ",
    "In currency markets, sterling held onto gains against the dollar in Asia after rallying the most in more than five months on Wednesday after lawmakers voted to prevent Prime Minister Boris Johnson taking Britain out of the European Union without a deal on Oct. 31.",
    "But, more than three years since the United Kingdom voted narrowly to leave the EU, the outcome of Brexit is still unclear, with possible outcomes ranging from a crash out of the EU to abandoning the whole endeavour.",
    "Against the offshore yuan , the dollar fell 0.2% to 7.1340 yuan.",
    "Spot gold  fell 0.5% to $1545.58 per ounce. GOL/",
    "The dollar rose 0.17% to 106.60 yen  gained 0.3% to 0.9839 Swiss franc .",
    "U.S. Treasury yields extended gains in Asia and the yield curve steepened, both signs that investors were willing to take on riskier assets.",
    "The 10-year yield  rose to 1.5145%, while two-year yields  rose to 1.4899%.",
    "The spread between two- and 10-year Treasury yields , the most commonly used measure of the yield curve, approached the highest since Aug. 21.",
    "The curve inverted on Aug. 14 for the first time since 2007 when long-term yields traded below short-term yields, which is a widely accepted indicator of coming recession.",
    "U.S. West Texas Intermediate crude  was little changed at $56.27 per barrel.",
    "Crude futures surged 4.3% on Wednesday, the biggest daily gain since July 10, due to positive economic data from China and easing geopolitical concerns."
  ],
  "published_datetime": "2019-09-05 01:52:00"
}