{
  "url": "https://www.nasdaq.com/article/is-the-fda-out-to-get-this-29-billion-diabetes-drug-class-cm1208172",
  "title": "Is the FDA Out to Get This $2.9 Billion Diabetes Drug Class? - Nasdaq.com",
  "text": [
    " In March, the Food and Drug Administration issued a complete   response letter -- the agency's euphemism for a rejection letter   -- to   Sanofi    (NASDAQ: SNY) and   Lexicon Pharmaceuticals    (NASDAQ: LXRX) for their application to approve Zynquista as a   treatment for type 1 diabetes. A few months later, AstraZeneca got the same notice for using   Farxiga as a treatment for type 1 diabetes. Zynquista and Farxiga are both sodium-glucose cotransporter   (SGLT) inhibitors. As the name implies, SGLT proteins -- there   are two main ones, SGLT-1 and SGLT-2 -- transport sodium and   glucose (sugar) from the kidneys back into the bloodstream. By   inhibiting the proteins, more sugar ends up being excreted in the   patient's urine instead of causing damage circulating through the   bloodstream.makeArticleAd(); The class has been approved to treat type 2 diabetes   for years    , racking up substantial sales.  Data source: Company press releases. Invokamet contains   Invokana plus generic metformin. Synjardy and Glyxambi contain   Jardiance plus metformin and Tradjenta, respectively. Safety is key? We don't know the exact reason why the FDA rejected the drugs   for type 1 diabetics. AstraZeneca simply said it \"will work   closely with the FDA to discuss the next steps.\" Sanofi and   Lexicon were equally as terse when they announced their   rejections. But given that the FDA has issued multiple drug safety   communications about the drugs, it seems likely the rejections   came from concerns about safety. Over the years, the FDA has   noted worries about infections, acid in the blood, acute kidney   injury, and leg and foot amputations. In January, an FDA advisory committee split 8-8 on whether the   benefits outweighed the risks for Zynquista as a treatment for   type 1 diabetics. The agency's outside advisors were mainly   worried about diabetic ketoacidosis -- high levels of acid in the   blood -- which was eightfold higher in patients taking Zynquista   relative to placebo. Farxiga's label for type 2 diabetes already has a warning   about ketoacidosis, which is based on post-approval reports, so   presumably that may be the issue that caused the FDA's rejection   in type 1 diabetics. Europe and Japan have a different view The European Medicines Agency EMA has approved both Zynquista   and Farxiga, which goes by Forxiga overseas, for the treatment of   patients with type 1 diabetes. In both cases, the agency decided   that the benefits outweighed the risk in type 1 patients who are   overweight, since having less sugar in the bloodstream leads to   increased weight loss. Farxiga is also approved for type 1 diabetics in Japan, where   it also goes by Forxiga.   Image source: Getty Images.  Should investors be worried? It's hard to know how severe the issue is without the   companies disclosing exactly why the FDA turned down Zynquista   and Farxiga for type 1 diabetes or what the companies need to do   to satisfy the agency. Approvals in Europe and Japan are a good   sign, but the U.S. is still the largest opportunity.   Investing in drug companies    is hard enough without having all the facts. Adding a wrinkle to the puzzle, Sanofi is trying to terminate   its alliance with Lexicon. Sanofi has said that it wants to focus   on oncology, immunology, vaccines, and rare diseases, so the   decision may have little to do with its interaction with the FDA.   But clearly Sanofi has decided Zynquista's potential upside isn't   worth the milestone payments and royalties it'll owe Lexicon in   the future. Sanofi was scheduled to submit marketing applications for   Zynquista in type 2 diabetes in the first half of next year. That   certainly could be delayed while the companies work out their   breakup, but an FDA decision on Zynquista in type 2 diabetes   might be the next event that shows whether the agency is down on   the class of drugs or whether its worries are restricted to type   1 diabetes. An issue that could ultimately affect billions in   sales.   10 stocks we like better than Pfizer       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Pfizer wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Brian Orelli      has no position in any of the stocks mentioned. The Motley Fool     recommends Johnson & Johnson. The Motley Fool has a     disclosure policy      .  ",
    "In March, the Food and Drug Administration issued a complete   response letter -- the agency's euphemism for a rejection letter   -- to   Sanofi    (NASDAQ: SNY) and   Lexicon Pharmaceuticals    (NASDAQ: LXRX) for their application to approve Zynquista as a   treatment for type 1 diabetes.",
    "A few months later, AstraZeneca got the same notice for using   Farxiga as a treatment for type 1 diabetes.",
    "Zynquista and Farxiga are both sodium-glucose cotransporter   (SGLT) inhibitors. As the name implies, SGLT proteins -- there   are two main ones, SGLT-1 and SGLT-2 -- transport sodium and   glucose (sugar) from the kidneys back into the bloodstream. By   inhibiting the proteins, more sugar ends up being excreted in the   patient's urine instead of causing damage circulating through the   bloodstream.",
    "The class has been approved to treat type 2 diabetes   for years    , racking up substantial sales.",
    "Data source: Company press releases. Invokamet contains   Invokana plus generic metformin. Synjardy and Glyxambi contain   Jardiance plus metformin and Tradjenta, respectively.",
    "We don't know the exact reason why the FDA rejected the drugs   for type 1 diabetics. AstraZeneca simply said it \"will work   closely with the FDA to discuss the next steps.\" Sanofi and   Lexicon were equally as terse when they announced their   rejections.",
    "But given that the FDA has issued multiple drug safety   communications about the drugs, it seems likely the rejections   came from concerns about safety. Over the years, the FDA has   noted worries about infections, acid in the blood, acute kidney   injury, and leg and foot amputations.",
    "In January, an FDA advisory committee split 8-8 on whether the   benefits outweighed the risks for Zynquista as a treatment for   type 1 diabetics. The agency's outside advisors were mainly   worried about diabetic ketoacidosis -- high levels of acid in the   blood -- which was eightfold higher in patients taking Zynquista   relative to placebo.",
    "Farxiga's label for type 2 diabetes already has a warning   about ketoacidosis, which is based on post-approval reports, so   presumably that may be the issue that caused the FDA's rejection   in type 1 diabetics.",
    "The European Medicines Agency EMA has approved both Zynquista   and Farxiga, which goes by Forxiga overseas, for the treatment of   patients with type 1 diabetes. In both cases, the agency decided   that the benefits outweighed the risk in type 1 patients who are   overweight, since having less sugar in the bloodstream leads to   increased weight loss.",
    "Farxiga is also approved for type 1 diabetics in Japan, where   it also goes by Forxiga.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "It's hard to know how severe the issue is without the   companies disclosing exactly why the FDA turned down Zynquista   and Farxiga for type 1 diabetes or what the companies need to do   to satisfy the agency. Approvals in Europe and Japan are a good   sign, but the U.S. is still the largest opportunity.   Investing in drug companies    is hard enough without having all the facts.",
    "Adding a wrinkle to the puzzle, Sanofi is trying to terminate   its alliance with Lexicon. Sanofi has said that it wants to focus   on oncology, immunology, vaccines, and rare diseases, so the   decision may have little to do with its interaction with the FDA.   But clearly Sanofi has decided Zynquista's potential upside isn't   worth the milestone payments and royalties it'll owe Lexicon in   the future.",
    "Sanofi was scheduled to submit marketing applications for   Zynquista in type 2 diabetes in the first half of next year. That   certainly could be delayed while the companies work out their   breakup, but an FDA decision on Zynquista in type 2 diabetes   might be the next event that shows whether the agency is down on   the class of drugs or whether its worries are restricted to type   1 diabetes. An issue that could ultimately affect billions in   sales.",
    "  10 stocks we like better than Pfizer       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Pfizer wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Pfizer       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Pfizer wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Brian Orelli      has no position in any of the stocks mentioned. The Motley Fool     recommends Johnson & Johnson. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:12:00"
}