{
  "url": "https://www.nasdaq.com/article/united-airlines-and-american-airlines-extend-boeing-737-max-cancellations-cm1206891",
  "title": "United Airlines and American Airlines Extend Boeing 737 MAX Cancellations - Nasdaq.com",
  "text": [
    "The Boeing (NYSE: BA) 737 MAX still needs to clear a few hurdles before it can return to service. However, over the past two months, Boeing has made significant progress toward finalizing software fixes for the issues identified by the FAA and other aviation regulators. This has kept the Boeing 737 MAX on track for an official FAA validation flight sometime next month.",
    "That said, even an October validation flight probably wouldn't leave enough time for airlines to put their 737 MAX fleets back into service by early November -- as United Airlines (NASDAQ: UAL) and American Airlines (NASDAQ: AAL) had been planning until recently. As a result, both airline giants recently removed all 737 MAX flights from their schedules until December.",
    "Two major airlines are extending their 737 MAX flight cancellations into December. Image source: Boeing.",
    "As of mid-July, United Airlines had hoped to put its Boeing 737 MAX jets back into service on Nov. 3. However, in the face of uncertainty about the timeline for recertifying the 737 MAX, the carrier announced late last week that it would remove the troubled model from its schedules until Dec. 19. It will cancel nearly 100 flights a day during this period.",
    "American Airlines followed suit on Sunday morning. The world's largest airline extended its 737 MAX flight cancellations from Nov. 2 to Dec. 3. This will force it to cancel an average of about 140 flights per day during the month of November.",
    "While American Airlines remains slightly more optimistic than United about when the Boeing 737 MAX will return, there is little practical difference between the two airlines' recent schedule changes. Neither one will have the 737 MAX available for the busy Thanksgiving travel weekend, but both still hope to get the aircraft back in service in time for the peak season around Christmas. The period in between those two holidays tends to be one of the slowest times of the year for airlines.",
    "Canceling flights over the Thanksgiving long weekend will lead to lost profits , particularly for American Airlines. Whereas United has expanded its fleet significantly during 2019, American will end 2019 with fewer mainline aircraft than it had at the beginning of the year, even if the Boeing 737 MAX were to be ungrounded. This is largely due to the carrier's decision to retire its aging fleet of MD-80s this week.",
    "As recently as a week ago, American Airlines officials stated that they were confident that the Boeing 737 MAX would reenter service before year-end. However, nothing is guaranteed until the FAA actually recertifies the aircraft and approves new pilot training procedures. The FAA and other global aviation regulators are still demanding more information from Boeing, which suggests that there is a real risk that the return to service will be delayed longer than Boeing and many airline officials expect.",
    "American Airlines will have to fly a reduced schedule over Thanksgiving weekend this year. Image source: American Airlines.",
    "Maintaining an aggressive schedule for getting the Boeing 737 MAX back would potentially enable American and United to carry more passengers around Thanksgiving. The problem is that if the plane is not ready by then, the airlines could be forced to cancel flights at the last minute, alienating impacted customers. Last-minute cancellations during a holiday period would be particularly disruptive, because it would be hard to find space to rebook on other flights.",
    "Airlines seem to have universally decided that canceling flights preemptively is the lesser of the two evils. That means Boeing needs to get its act together and move quickly over the next month or two to assure airlines that the 737 MAX will be ready to fly in December. Otherwise, United Airlines and American Airlines could give up on getting the 737 MAX back in time for Christmas and extend their preemptive cancellations into January.",
    "10 stocks we like better than Boeing\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Boeing wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Adam Levine-Weinberg is long January 2020 $20 calls on American Airlines Group. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:40:00"
}