{
  "url": "https://www.nasdaq.com/article/canadian-court-allows-new-challenges-to-trans-mountain-oil-pipeline-expansion-20190904-00985",
  "title": "Canadian court allows new challenges to Trans Mountain oil pipeline expansion - Nasdaq.com",
  "text": [
    "By Rod Nickel and Nia Williams",
    "Sept 4 (Reuters) - Canada'sFederal Court of Appeal on Wednesday agreed to hear challenges by six indigenous groups of the Canadian government's approval for an expansion of the Trans Mountain  oil pipeline.",
    "In a ruling posted on its website, the court said the challenges relate to the adequacy of the government's consultations with indigenous groups, and that they must proceed on strict, short deadlines.",
    "The project, which Prime Minister Justin Trudeau's government bought last year, is one of several pipeline projects Canada's oil industry says are badly needed to allow Canadian crude to reach higher-paying refiners in the United States and Asia.",
    "The court will not allow challenges on environmental and alleged conflict of interest grounds to proceed, but is allowing six challenges related to the government's duty to consult aboriginals, called First Nations.",
    "\"The applicants do acknowledge that the Government of Canada introduced some new initiatives to assist consultation and added some conditions on the project approval that was ultimately given,\" the court said in its decision. \"But to them this is just window-dressing, box-ticking and nice-sounding words, not the hard work of taking on board their concerns, exploring possible solutions, and collaborating to get to a better place.\"",
    "The Tsleil-Waututh Nation, one of the indigenous groups that challenged the project's approval, said it expects the court to eventually overturn it.",
    "\"It was clear that Canada had already made up their mind as the owners of the project,\" said Chief Leah George-Wilson.",
    "\"Canada continued to do the legal minimum and in our view, fell well below the mark again.\"",
    "But a government spokesman said it believed it engaged in meaningful, two-way dialogue with indigenous groups.",
    "\"We remain confident that we have taken the necessary steps to get this right, by following the clear guidance set by the Federal Court of Appeal, and we are fully prepared to defend our decision in court,\" said Alexandre Deslongchamps, spokesman for Natural Resources Minister Amarjeet Sohi.",
    "The court quashed the government's previous approval in August 2018, mainly over inadequate consultation.",
    "That decision led to the government conducting a new round of consultations before re-approving the project in June.",
    "Projects to expand or build new Canadian pipelines have become deeply contentious in recent years, as some indigenous groups fear spills. Growing Canadian crude oil production, at a time when pipelines are oversubscribed, forced the Alberta government this year to impose production limits to ease a glut and support prices.",
    "The Canadian Association of Petroleum Producers (CAPP), whose members include Suncor Energy Inc  and Canadian Natural Resources Ltd , said the decision was disappointing.",
    "\"The (project) has already undergone a lengthy, thorough and extensive regulatory review process, including extensive consultation with all stakeholders,\" CAPP Chief Executive Tim McMillan said in a statement.",
    "In a statement, Trans Mountain Corp  said that all aspects of planning and construction would continue, since the court's decision does not negate pre-existing approvals.",
    "It announced last month it was restarting construction to nearly triple Trans Mountain's flow of crude. .",
    "\"The decision of the court is disappointing but perhaps not surprising,\" said Gary Mar, CEO of the Petroleum Services Association of Canada.",
    "\"Until this project is actually completed only then will I have some confidence for the energy sector in this country.\""
  ],
  "published_datetime": "2019-09-04 03:16:00"
}