{
  "url": "https://www.nasdaq.com/article/ch-robinson-worldwide-a-top-ranked-safe-dividend-stock-with-24-yield-chrw-cm1206488",
  "title": "C.H. Robinson Worldwide a Top Ranked SAFE Dividend Stock With 2.4% Yield (CHRW) - Nasdaq.com",
  "text": [
    "C.H. Robinson Worldwide, Inc. (Symbol: CHRW) has been named to the Dividend Channel  ''S.A.F.E. 25'' list, signifying a stock with above-average ''DividendRank''  statistics including a strong 2.4% yield, as well as a superb track record of at least two decades of dividend growth, according to the most recent  ''DividendRank''   report.    According to the ETF Finder  at ETF Channel  , C.H. Robinson Worldwide, Inc. is a member of the iShares S&P 1500 Index ETF ( ITOT  ), and is also an underlying holding representing 0.92% of the SPDR S&P Dividend ETF ( SDY  ), which holds $168,314,134 worth of CHRW shares. C.H. Robinson Worldwide, Inc. (Symbol: CHRW) made the \"Dividend Channel S.A.F.E. 25\" list because of these qualities: S  . Solid return - hefty yield and strong  DividendRank   characteristics; A.  Accelerating amount - consistent dividend increases over time; F  . Flawless history - never a missed or lowered dividend; E.  Enduring - at least two decades of dividend payments.  makeArticleAd();  The annualized dividend paid by C.H. Robinson Worldwide, Inc. is $2/share, currently paid in quarterly installments, and its most recent dividend ex-date was on 09/05/2019. Below is a long-term dividend history chart for CHRW, which the report stressed as being of key importance.         CHRW operates in the Air Services Other sector, among companies like Lyft Inc ( LYFT  ), and Air Lease Corp ( AL  ).   Top 25 S.A.F.E. Dividend Stocks Increasing   Payments For Decades »  ",
    "C.H. Robinson Worldwide, Inc. (Symbol: CHRW) made the \"Dividend Channel S.A.F.E. 25\" list because of these qualities: S  . Solid return - hefty yield and strong  DividendRank   characteristics; A.  Accelerating amount - consistent dividend increases over time; F  . Flawless history - never a missed or lowered dividend; E.  Enduring - at least two decades of dividend payments.",
    "  Top 25 S.A.F.E. Dividend Stocks Increasing   Payments For Decades » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 07:43:30"
}