{
  "url": "https://www.nasdaq.com/article/nissan-probe-finds-ceo-saikawa-other-execs-overpaid-20190905-00002",
  "title": "Nissan probe finds CEO Saikawa, other execs overpaid - Nasdaq.com",
  "text": [
    "By Maki Shiraki and Naomi Tajitsu",
    "TOKYO, Sept 5 (Reuters) - Nissan Motor Co  was embroiled in another scandal over executive pay on Thursday after Chief Executive Hiroto Saikawa admitted to being overpaid in violation of internal procedures under a scheme designed by ousted Chairman Carlos Ghosn.",
    "An internal investigation found that Saikawa and other executives had received improper compensation, a source with knowledge of the matter told Reuters, raising doubts about Saikawa's pledge to improve governance in the wake of Ghosn's arrest last year for alleged financial misconduct.",
    "\"I am deeply sorry for causing concern,\" Saikawa said, according to Jiji Press.",
    "In other comments reported by Kyodo news, Saikawa denied any direct role in the execution of a stock appreciation rights (SAR) scheme and said he thought \"proper procedures\" had been taken.",
    "The improper payments, including tens of millions of yen Saikawa received through the SAR scheme, were disclosed on Wednesday at a meeting of Nissan's audit committee, said the source who declined to be identified because the information is not public.",
    "Disciplinary action regarding the issue would be discussed at an upcoming board meeting, the source added.",
    "Nissan said in a statement that the findings from its probe including issues related to the share appreciation rights would be submitted to its board on Sept. 9.",
    "The company has been trying to strengthen governance, slash costs and boost flagging profitability amid persistent allegations of financial misconduct stemming from Ghosn's 20-year reign at Japan's second-biggest automaker. ",
    "Ghosn is awaiting trial in Japan over charges including enriching himself at a cost of $5 million to Nissan. Kyodo reported that proceedings could start as early as March. ",
    "He denies any wrongdoing and says he is the victim of a boardroom coup.",
    "Confidence in Saikawa had already been shaken by accusations he was too close to Ghosn, whose arrest in November rocked the global auto industry and exposed tensions in the automaking partnership between Nissan and Renault SA .",
    "The company launched its internal investigation after Japanese magazine Bungei Shunju in June published accusations by former director Greg Kelly that Saikawa was granted an exception in 2013 to reschedule a stock-linked bonus that bumped up the payout by 47 million yen($445,962). ",
    "Like Ghosn, Kelly is awaiting trial on charges of financial misconduct which he denies.",
    "The latest compensation issue could exacerbate tensions with top shareholder Renault, after a failed attempt by the French automaker to secure a full merger with Nissan and to combine Renault with Fiat Chrysler (FCA). Saikawa opposed both plans.",
    "Renault spokesman Frederic Texier declined to comment on the issue on Thursday. But a source close the company said Renault would \"respect Nissan's governance\" and leave the board to consider its response.",
    "The alliance partners are discussing reforms that could win Nissan's support for a renewed FCA-Renault tie-up, including a potential reduction to Renault's 43.4% stake in Nissan. ",
    "Saikawa was re-appointed by shareholders with the lowest approval rating among the 11 directors in June. ",
    "$1 = 105.3900 yen)"
  ],
  "published_datetime": "2019-09-05 12:13:00"
}