{
  "url": "https://www.nasdaq.com/article/cable-drops-through-12000-as-parliament-may-trigger-early-election-cm1206505",
  "title": "Cable Drops Through 1.2000 as Parliament May Trigger Early Election - Nasdaq.com",
  "text": [
    "Market Drivers September 3, 2019",
    "GBP Volatility reigns US Yields drop driving USDJPY lower Nikkei 1.19% Dax 1.02% UST 10Y 1.48% Oil $54/bbl Gold $1531/oz BTCUSD $10300",
    "Europe and Asia:",
    "RBA keeps rates 1t 1.00% GBP UK Construction PMI 45 vs. 46.7",
    "USD ISM Manufacturing 10:00",
    "Cable dropped to multi-month lows hitting 1.1958 in the morning London dealing on market fears that Boris Johnson may call an early election if Parliament votes to reject the no-deal Brexit path that he has promised voters.",
    "The chaos of early Parliamentary elections would only add to the uncertainty surrounding the situation in the UK especially given the fact that Tories lead by 9% in the polls and could, in fact, create a majority rule that would give them a path to no Brexit deal.",
    "The political realities, however, are likely to be far messier especially if Liberal Democrats stage a comeback as the clear anti-Brexit thwarting a full-on Tory takeover. Regardless of the scenarios, political uncertainty is sure to take its toll on the UK economy.",
    "UK data continues to show deterioration with both Manufacturing and Construction PMIs sinking deeper into recession territory. Tomorrow's UK PMI Services report will be crucial to market sentiment if it too drops below the 50 boom/bust line.",
    "Services are the biggest component of the UK economy and if the sector contracts for the first time since the referendum vote 3 years ago, the political damage to Mr. Johnson could be substantial. For now, the focus will squarely on Westminster as markets await the outcome of Parliament proceedings later today.",
    "Elsewhere RBA kept rates on hold as expected at 1.00% and kept its statement surprisingly upbeat offering no clues that it may cut rates further in the very near future. For now, the RBA appears to be content to remain in neutral mode reserving what ammunition it has left for more difficult times. It seemed particularly focused on the state of employment which remained surprisingly robust given the global trade tensions and it appears that the central bank will not move to cut rates further unless labor conditions deteriorate,",
    "All of this left Aussie bit stronger on the day as the unit bounced from .6678 lows to trade .6725 by EU mid-morning. The pair continues to find support at the .6700 level where it has been basing for more than a month and any positive news in US-China trade negotiations could quickly push it to .6800.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:48:32"
}