{
  "url": "https://www.nasdaq.com/article/swedish-cbank-sticks-to-yearend-rate-hike-plan-to-move-slower-thereafter-20190905-00126",
  "title": "Swedish c.bank sticks to year-end rate hike plan, to move slower thereafter - Nasdaq.com",
  "text": [
    "By Simon Johnson and Johan Ahlander",
    "STOCKHOLM, Sept 5 (Reuters) - Sweden's central bank said on Thursday it still expects to tighten policy around the turn of the year, surprising markets and sparking big gains in the long-suffering crown currency.",
    "With the Swedish economy slowing after years of strong growth, many analysts had expected the Riksbank to postpone plans to raise interest rates and to make further downward adjustments to the rate path at future meetings. ",
    "\"It was surprisingly hawkish,\" Carl Hammer, economist at SEB, said. \"Something tells me they want to reach the zero interest rate level and after that they say that the next raise is very far away.\"",
    "The Riksbank said uncertainty over the trade war between the United States and China and Britain's exit from the European Union meant that rate hikes would proceed more slowly in the years ahead.",
    "\"Low interest rates abroad and worsened sentiment mean that the interest rate is expected to be increased at a slower pace thereafter than in the previous forecast,\" the central bank said in a statement.",
    "With interest rates still in negative territory years after the financial crisis, the crown has been under pressure, depreciating 5% against the euro  since the beginning of 2019 alone. The Riksbank has managed only one rate hike since mid-2011, despite years of strong growth and inflation near its 2% target. ",
    "With the central bank also owning more than 50% of the outstanding stock of government bonds, that leaves it very short on ammunition should a future economic downturn prove to be long and deep.",
    "The relatively hawkish message from the Riksbank helped the Swedish crown gain against the euro, up around 0.7% since the statement, but analysts remained sceptical over whether the central bank would deliver on its plans. ",
    "\"We maintain our Riksbank call of no rate changes in the next two years, but note that global development will have a high impact on the board's future decisions,\" Swedbank said in a note.",
    "The U.S. Federal Reserve has already cut rates, while the European Central Bank is seen easing on Sept. 12. ",
    "\nGRAPHIC:Sweden economy:",
    "\nGRAPHIC:Sweden inflation:",
    "\nGRAPHIC: Riksbank rate, inflation and the Krona:",
    "\nSweden economy:\n",
    "\nSweden inflation:\n",
    "Riksbank rate, inflation and the Krona:"
  ],
  "published_datetime": "2019-09-05 04:06:00"
}