{
  "url": "https://www.nasdaq.com/article/3-tech-stocks-to-buy-and-short-cm1210749",
  "title": "3 Tech Stocks to Buy and Short - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Terrifying and quick-to-counter terrific headline tweets are no way to buy or sell tech stocks. In today's often volatile market, trusting the price charts of Adobe (NASDAQ: ADBE ), Twilio (NYSE: TWLO ) and Shopify (NYSE: SHOP ) and applying smart trading strategies to those decisions is the only way to navigate and profit in a daily and ongoing trade war. Let me explain.",
    "August was undoubtedly a tough one for the market and even more so for many technology stocks. For a time and in the first part of the month, countering trade war jabs from the U.S. and China and an inverted-yield curve got the better of Wall Street. And let's just say, conditions turned quickly ugly on the price charts of most risk-assets.",
    "But given the medium of Twitter and unusual negotiating skill set of POTUS, taking any particular day's headline and message to the market as written in stone is a fool's game. And by the second half of August, Wall Street was already picking up the pieces. On Aug. 13 the broader indices quietly scored a bullish and historically robust follow through day amid still chaotic headlines and uncertain political theater.",
    "At the end of the day, investors have to ask themselves if it's better to react to the loose cannon in charge or proactively listen and watch the price charts for clues to what the future holds. When it comes to tech stocks ADBE, TWLO and SHOP, the decision of whether to buy or short shares is an easy one.",
    "Adobe is a large cap, household name that has been around nearly as long as Microsoft (NASDAQ: MSFT ) and Apple (NASDAQ: AAPL ). And right now the ever-popular software graphics powerhouse is setting up as a buy.",
    "On the weekly price chart, shares of Adobe are testing prior pattern resistance and the 38% level for support as stochastics sets up in oversold territory with a bullish crossover signal.",
    "My suggestion is to allow for a bit of price confirmation on the weekly time frame before buying ADBE stock. As we move into the second half of the trading week, a move through $285 with an initial stop-loss of 5% looks about right, without waiting on a picture-perfect entry.",
    "Twilio is sending a loud and clear message to short shares on the weekly price chart. The in-app communications specialist is a high-profile growth play. Still, as any seasoned investor knows, even the best stocks go through corrections from time to time. Right now appears to be one of those periods.",
    "Currently TWLO stock has broken below bear flag support this week. Shares are slightly oversold as evidenced by Twilio's stochastics and price action pressed into the lower Bollinger Band. As such, I'd wait for a small counter-trend rally before positioning. More importantly, given this tech stock's bullish run over the past two years, its troublesome failure through trendline support and its wide Fibonacci zone that's still untested, this one is a short!",
    "I'm a buyer of cloud-based business solutions platform Shopify, but only if today's price support holds. The weekly chart shows SHOP stock is challenging trendline support and prior pattern resistance tied to a high-level corrective base.",
    "Ultimately and similar to TWLO, Fibonacci support still isn't in play and that's obviously a concern. As stated above, all stocks, even a great growth story like Shopify, is bound to have periods of bearish price action which will test bulls' mettle. And given this technology stock's impressive rally in 2019, that point is all the more important to prepare for.",
    "Given the potential for more impactful and not necessarily benign volatility, I'd advise using the SHOP stock daily chart. The lesser time frame shows a bullish stochastics crossover in oversold territory as weekly technical support is being tested. If necessary, exiting below this week's lows if shares fall beneath $333 makes good sense both off and on the price chart.",
    "Disclosure: Investment accounts under Christopher Tyler's management do not currently own positions in securities mentioned in this article. The information offered is based upon Christopher Tyler's observations and strictly intended for educational purposes only; the use of which is the responsibility of the individual. For additional market insights and related musings, follow Chris on Twitter @Options_CAT and  StockTwits.",
    "The post 3 Tech Stocks to Buy and Short appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:40:14"
}