{
  "url": "https://www.nasdaq.com/article/expect-the-transformation-of-cronos-group-to-change-cron-stock-cm1207431",
  "title": "Expect the Transformation of Cronos Group to Change CRON Stock - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Cronos Group (NASDAQ: CRON ) stock remains on a separate wavelength from its parent company. Thanks to the $1.8 billion cash infusion from Altria (NYSE: MO ), Cronos appears on track to become the marijuana-based version of the tobacco giant.",
    "However, investors seem unaware of how such an investment affects a stock too. Tobacco is an old, established industry. It has become known for generating profits and dividends, and in recent years, controversy. Cronos has much to learn from this experienced master. Until Altria can transform both the company and CRON stock, investors should stay out of this equity.",
    "As I stated in a previous article , investors need to look at Cronos and Cronos Group stock differently.",
    "So far, my thesis has held up. When I made that statement a few weeks ago, CRON stock traded for slightly above $15 per share. Today, it has fallen to the $11 per share level. This also happens to match up well to the highs of September 2018. As many traders recall, that's the level where it traded before it began its journey to as low as $6.50 per share following the post-Canadian legalization selloff.",
    "The question now hinges on how much further it will fall. Is Mark Putrino right that it has support at $10 per share? Does it retest $6.50 per share lows? Does it perhaps fall further?",
    "The marijuana bubble burst of 2018 saw a partial reinflation early this year. However, it has now dropped back. Unfortunately for bulls of CRON stock, much of that bubble remains as the S&P 500 struggles to gain traction. The price-to-sales (PS) ratio stands at over 191. Even CRON stock optimist Luke Lango concedes that valuation remains a \"big near term issue.\"",
    "Moreover, the near-term profit picture remains precarious. Thanks to derivative liability revaluations, analysts expect a profit of 78 cents CAD (58 cents) per share. Those offer only a one-time benefit, and the company maintains a loss operationally. Previous predictions of positive earnings in 2020 have given way to forecasts of further losses.",
    "Much like my colleague Mr. Lango, I am a long-term bull in Cronos Group stock. However, investors need to realize that its education comes from Altria. To be sure, this will bring valuable advice in improving cultivation, distribution, and marketing.",
    "For this reason, I do not see Cronos' lower revenues compared to Canopy Growth (NYSE: CGC ) or Aurora Cannabis (NYSE: ACB ) as a particular concern. The knowledge and resources from Altria will hold CRON stock in good stead as the company becomes a mainstream player.",
    "However, as I stated in earlier articles, this education sets themselves up to become a different kind of equity. Those who know Altria know it as a low-valuation, high-dividend stock. Altria has maintained a low price-earnings (PE) ratio historically. It has also struggled as of late. MO has lost more than 40% of its value over the last two years. This has left it with a generous 7.7% dividend yield, but also an uncertain future.",
    "I do not foresee CRON stock dealing with the level of liability facing MO. However, I think low PEs and high dividend payouts will define Cronos years from now.",
    "To get there, CRON needs first to fall much lower, or at least pause while revenues catch up. It also has to earn an operating profit to become an eventual dividend equity. It will take years for Cronos stock to reach either level.",
    "Investors should realize that Cronos Group stock is in a transition phase. Therefore, this is a name to avoid for now. Like many burgeoning industries before it, CRON benefitted from stratospheric valuations driven by excitement about this emerging industry. After a partial bounce-back early in the year, multiples across the board have fallen. I see no apparent catalyst that can reinflate this bubble.",
    "Moreover, Cronos is now under the tutelage of Altria. This relationship gives CRON both a financial and knowledge advantage that should add efficiencies to growing, processing, distributing, and ultimately, selling marijuana-based products.",
    "However, it will also change CRON stock. That process will take years, but high valuations are not its future. At a PS ratio of over 191, investors should stay away. The bubble still needs to pop before Cronos becomes a buy.",
    "But once this company fully embraces its future as a dividend payer, I think future generations of investors will see CRON stock as a valuable source of dividend income.",
    "As of this writing, Will Healy did not hold a position in any of the aforementioned stocks. You canfollow Will on Twitterat @HealyWriting .",
    "The post Expect the Transformation of Cronos Group to Change CRON Stock appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:41:08"
}