{
  "url": "https://www.nasdaq.com/article/you-will-never-break-our-will--palestinians-to-netanyahu-after-jordan-valley-annexation-pledge-20190911-00613",
  "title": "'You will never break our will' - Palestinians to Netanyahu after Jordan Valley annexation pledge - Nasdaq.com",
  "text": [
    "By Adel Abu Nimeh",
    "JIFTLIK, West Bank, Sept 11 (Reuters) - Palestinians tilling the fertile Jordan Valley said on Wednesday they have been rooted for generations to the West Bank land that Israeli Prime Minister Benjamin Netanyahu plans to annex, and they vowed never to give it up.",
    "\"We tell Netanyahu, and whoever follows him, you will not break the Palestinians' will, you will never break our will, never, never,\" said Hassan Al-Abedi, a 55-year-old farmer who lives in the village of Jiftlik.",
    "The right-wing Netanyahu announced on Tuesday that he plans to \"apply Israeli sovereignty\" to the Jordan Valley and adjacent northern Dead Sea if he prevails in what is shaping up as a tough battle for re-election on Sept. 17.",
    "The plan drew condemnation from Arab leaders and from  Palestinians, who seek to establish a state in all of the Israeli-occupied West Bank and the Gaza Strip. ",
    "The office of U.N. Secretary-General Antonio Guterres said the plan \"would constitute a serious violation of international law.\" ",
    "Palestinian leaders said it would also effectively nullify interim peace deals from the 1990s that included security cooperation. ",
    "Against the backdrop of Jordan's desert mountain range to the east, Palestinian farmers tended their crops and worried about their future in an area where the town of Jericho and the River Jordan are reminders of a biblical past.",
    "\"This is not Netanyahu's land to give,\" said Ismael Hassan, a 75-year-old Palestinian from Zbeidat village. \"Whether or not Netanyahu succeeds (in the election) we won't accept it. This land is for Palestine, for the Palestinians.\"",
    "In Israel, which captured the West Bank in a 1967 war, Netanyahu's declaration was widely seen as a bid to sap support from far-right election rivals who advocate annexation of Jewish settlements, and from a centre-left that for decades has argued that the Jordan Valley should be kept on security grounds.",
    "Retaining the Jordan Valley would effectively leave Israel encircling any Palestinian political entity that emerges.",
    "CRAFTING OPINION",
    "Following up on his speech with remarks on Facebook on Wednesday, Netanyahu took credit for having persuaded U.S. President Donald Trump to recognise Israeli sovereignty over another strategic slice of occupied territory - the Golan Heights, captured from Syria in 1967 - and to relocate the U.S. Embassy to Jerusalem.",
    "The White House was informed in advance of Tuesday's annexation announcement, Netanyahu said, adding that he was \"crafting opinion in favour of recognition of Israeli sovereignty in Judea and Samaria and the Jordan Valley\".",
    "A U.S. official confirmed Washington had been notified but said the announcement was not coordinated.",
    "Netanyahu's decision to make the promise showed that he had little reason to fear any pushback from the Trump administration, which has hewed to a heavily pro-Israel policy and backed Trump at almost every turn since he took office in 2017.",
    "BREADBASKET, BORDER",
    "Some 53,000 Palestinians and around 12,800 Israeli settlers live in the Jordan Valley, according to monitor Peace Now. The main Palestinian city in the region is Jericho, with around 28 villages and smaller Bedouin communities.",
    "Palestinians often refer to the Jordan Valley as their \"breadbasket\". In his speech on Tuesday, Netanyahu described it as Israel's eastern border with Jordan.",
    "\"Even Netanyahu's main rivals believe that any Palestinian entity that is established in the West Bank should be completely encircled by Israel, having no border with Jordan,\" said Nathan Thrall, an International Crisis Group analyst.",
    "\"The annexation plan shouldn't be dismissed as election bluster. If reelected, Netanyahu will be under tremendous pressure to implement it.\"",
    "The valley, which at 2,400 square kilometres (926 square miles) accounts for nearly 30% of the West Bank, has dozens of Palestinian farms as well as open areas that the Palestinian Authority has sought to develop for solar energy projects and industrial zones.",
    "There are some 30 mainly agricultural settlements in the area, along with 18 smaller Israeli outposts, Peace Now says.",
    "\"It's impossible to have a Palestinian state without the Jordan Valley,\" chief Palestinian negotiator Saeb Erekat told Reuters in an interview from his office in Jericho.",
    "\"My prosperity can come (only) if I can control my natural resources, my shores on the Dead Sea, my shores on the Mediterranean, my water, my land.\"",
    "Erekat said the Palestinians would welcome \"a third party presence\" such as NATO or the European Union but said: \"A Israeli military or civilian presence in the state of Palestine is not okay. Because this will not make peace.\"",
    "Israeli leaders have ruled out such a foreign peacekeeper force, citing the failure of a similar proposal for Gaza after Israel quit that territory in 2005.",
    "\"We did not get an era of peace. We got three wars. We're not going to allow that to happen to our east,\" said Dore Gold, a Netanyahu confidant who runs the Jerusalem Center for Public Affairs think-tank.",
    "POLITICAL GAMBIT",
    "The last round of Israeli-Palestinian peace talks broke down in 2014.",
    "The Trump administration is expected to release its long-delayed peace plan after Israel's election, and it is still unclear whether the proposal will adhere to previous U.S. support for the creation of a Palestinian state alongside a secure Israel.",
    "That rollout is unlikely to be affected even if Netanyahu goes ahead with the Jordan Valley annexation plan after the election, a U.S. official said.",
    "Palestinians have boycotted the Trump administration, accusing it of pro-Israel bias.",
    "A far-right coalition partner of Netanyahu hinted at doubt about the premier's sincerity, saying there had been no movement on the Jordan Valley question during his decade in power. \"How come this matter (annexation) is coming up now, a week before the election?\" Bezalel Smotrich told Israel's Army Radio.",
    "Netanyahu also reaffirmed a pledge to annex all of the settlements Israel has established in the West Bank. But he said that broader step could take longer and required \"maximum coordination\" with Washington.",
    "Netanyahu is fighting for his political life after an inconclusive election in April. His Likud party is running neck and neck in opinion polls with former armed forces chief Benny Gantz's Blue and White."
  ],
  "published_datetime": "2019-09-11 12:16:00"
}