{
  "url": "https://www.nasdaq.com/article/gold-stocks-glitter-as-we-enter-spooky-september-4-picks-cm1206510",
  "title": "Gold Stocks Glitter as We Enter Spooky September: 4 Picks - Nasdaq.com",
  "text": [
    " Markets were extremely volatile in August as investors were wary about the escalating tariff dispute between Washington and Beijing. As we step into September, trade tensions and fears of recession continue to bother the Wall Street. In such a situation, investors are dumping stocks to park money in traditional safe-haven securities, leading to a year-to-date surge in gold price of roughly 19%.  Escalating US-Sino Tariff Battle  Since Sep 1, the Trump administration has imposed a 15% tariff on roughly $112 billion of imports from Beijing. America is set to impose a 15% tariff on a separate batch of Chinese goods of roughly $160 billion in value from Dec 15 onward. Beijing retaliated and started imposing additional tariffs on several imports from the United States to initiate its plan to impose extra duty on $75 billion of American goods. Of the total of 5,078 U.S. products that Beijing imports, 1,717 items have seen additional tariffs of 5% and 10%, respectively. The rest of the countermeasures will be put into effect on Dec 15.  Trade Dispute Threatens US Economy  The latest round of tariff by the Trump administration on billions of dollar worth of Chinese imports has raised prices of consumer goods. Americans now need to pay higher prices for more than 66% of products that Washington imports from Beijing. With higher retail prices for many products, the administration's latest stance is likely to impede America's economic growth since it is primarily driven by consumer spending. AllianceBernstein, global asset management firm, believes that if the tariff dispute intensifies, businesses in America will curtail their hiring programs. This is likely to further hurt domestic consumer spending, thereby posing additional risks to the U.S. economy.  Time to Pick Safe-Haven Stocks  September is going to be challenging since there are reasons for the stock market to remain volatile. Hence, it would probably be safe for many investors to pick gold stocks which are considered to be safe haven as they can maintain or increase in value during market turmoil. We have employed our proprietary stock screener  to shortlist potential gold stocks carrying either a Zacks Rank #1 (Strong Buy) or 2 (Buy). You can see   the complete list of today's Zacks #1 Rank stocks   here   . Headquartered in Toronto, Canada, Kirkland Lake Gold Ltd KL  is a leading explorer and producer of gold. The company has an average positive earnings surprise of 6.1% for the past four quarters. Moreover, over the past 30 days, the #1 Ranked stock has been witnessing positive earnings estimate revisions for 2019 and 2020, respectively.  AngloGold Ashanti Limited AU  , headquartered in Johannesburg, South Africa, is among the largest gold miners in the world. For 2019 and 2020, the Zacks #1 Ranked stock is likely to see earnings growth of 158.5% and 60.6%, respectively. Headquartered in Toronto, Canada, Barrick Gold Corporation GOLD  is a leading explorer of gold with 61.5% interest in the prolific Nevada Gold Mines. The company, with a Zacks Rank of 2, is likely to see earnings growth of 54.3% and 31.2% for 2019 and 2020, respectively. Barrick has also managed to beat the Zacks Consensus Estimate in three of the prior four quarters, the positive avera ge earnings  surprise being 8.3%.   Headquartered in Vancouver, Canada, B2Gold Corp. BTG  is a leading gold producer in the world. Through 2019 and 2020, the company with a Zacks Rank of 2 is likely to see earnings growth of 25% and 74.4%, respectively.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Barrick Gold Corporation (GOLD): Free Stock Analysis Report   AngloGold Ashanti Limited (AU): Free Stock Analysis Report   B2Gold Corp (BTG): Free Stock Analysis Report   Kirkland Lake Gold Ltd. (KL): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Markets were extremely volatile in August as investors were wary about the escalating tariff dispute between Washington and Beijing. As we step into September, trade tensions and fears of recession continue to bother the Wall Street.",
    "In such a situation, investors are dumping stocks to park money in traditional safe-haven securities, leading to a year-to-date surge in gold price of roughly 19%.",
    " Escalating US-Sino Tariff Battle ",
    "Since Sep 1, the Trump administration has imposed a 15% tariff on roughly $112 billion of imports from Beijing. America is set to impose a 15% tariff on a separate batch of Chinese goods of roughly $160 billion in value from Dec 15 onward.",
    "Beijing retaliated and started imposing additional tariffs on several imports from the United States to initiate its plan to impose extra duty on $75 billion of American goods. Of the total of 5,078 U.S. products that Beijing imports, 1,717 items have seen additional tariffs of 5% and 10%, respectively. The rest of the countermeasures will be put into effect on Dec 15.",
    " Trade Dispute Threatens US Economy ",
    "The latest round of tariff by the Trump administration on billions of dollar worth of Chinese imports has raised prices of consumer goods. Americans now need to pay higher prices for more than 66% of products that Washington imports from Beijing.",
    "With higher retail prices for many products, the administration's latest stance is likely to impede America's economic growth since it is primarily driven by consumer spending.",
    "AllianceBernstein, global asset management firm, believes that if the tariff dispute intensifies, businesses in America will curtail their hiring programs. This is likely to further hurt domestic consumer spending, thereby posing additional risks to the U.S. economy.",
    " Time to Pick Safe-Haven Stocks ",
    "September is going to be challenging since there are reasons for the stock market to remain volatile. Hence, it would probably be safe for many investors to pick gold stocks which are considered to be safe haven as they can maintain or increase in value during market turmoil.",
    "We have employed our proprietary stock screener  to shortlist potential gold stocks carrying either a Zacks Rank #1 (Strong Buy) or 2 (Buy). You can see   the complete list of today's Zacks #1 Rank stocks   here   .",
    "Headquartered in Toronto, Canada, Kirkland Lake Gold Ltd KL  is a leading explorer and producer of gold. The company has an average positive earnings surprise of 6.1% for the past four quarters. Moreover, over the past 30 days, the #1 Ranked stock has been witnessing positive earnings estimate revisions for 2019 and 2020, respectively.",
    " AngloGold Ashanti Limited AU  , headquartered in Johannesburg, South Africa, is among the largest gold miners in the world. For 2019 and 2020, the Zacks #1 Ranked stock is likely to see earnings growth of 158.5% and 60.6%, respectively.",
    "Headquartered in Toronto, Canada, Barrick Gold Corporation GOLD  is a leading explorer of gold with 61.5% interest in the prolific Nevada Gold Mines. The company, with a Zacks Rank of 2, is likely to see earnings growth of 54.3% and 31.2% for 2019 and 2020, respectively.",
    "Barrick has also managed to beat the Zacks Consensus Estimate in three of the prior four quarters, the positive avera ge earnings  surprise being 8.3%.  ",
    "Headquartered in Vancouver, Canada, B2Gold Corp. BTG  is a leading gold producer in the world. Through 2019 and 2020, the company with a Zacks Rank of 2 is likely to see earnings growth of 25% and 74.4%, respectively.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:28:00"
}