{
  "url": "https://www.nasdaq.com/article/ex-dividend-reminder-umb-financial-cme-group-and-anthem-cm1207801",
  "title": "Ex-Dividend Reminder: UMB Financial, CME Group and Anthem - Nasdaq.com",
  "text": [
    "Looking at the universe of stocks we cover at Dividend Channel  , on 9/9/19, UMB Financial Corp (Symbol: UMBF), CME Group (Symbol: CME), and Anthem Inc (Symbol: ANTM) will all trade ex-dividend for their respective upcoming dividends. UMB Financial Corp will pay its quarterly dividend of $0.30 on 10/1/19, CME Group will pay its quarterly dividend of $0.75 on 9/25/19, and Anthem Inc will pay its quarterly dividend of $0.80 on 9/25/19. As a percentage of UMBF's recent stock price of $62.27, this dividend works out to approximately 0.48%, so look for shares of UMB Financial Corp to trade 0.48% lower - all else being equal - when UMBF shares open for trading on 9/9/19. Similarly, investors should look for CME to open 0.34% lower in price and for ANTM to open 0.32% lower, all else being equal.    Below are dividend history charts for UMBF, CME, and ANTM, showing historical dividends prior to the most recent ones declared.   UMB Financial Corp (Symbol: UMBF)  :   makeArticleAd();    CME Group (Symbol: CME)  :        Anthem Inc (Symbol: ANTM)  :         In general, dividends are not always predictable, following the ups and downs of company profits over time. Therefore, a good first due diligence step in forming an expectation of annual yield going forward, is looking at the history above, for a sense of stability over time. This can help in judging whether the most recen t dividends  from these companies are likely to continue. If they do continue, the current estimated yields on annualized basis would be 1.93% for UMB Financial Corp, 1.34% for CME Group, and 1.26% for Anthem Inc.    In Thursday trading, UMB Financial Corp shares are currently up about 1.3%, CME Group shares are up about 0.9%, and Anthem Inc shares are off about 0.3% on the day.   Click here to learn which 25 S.A.F.E. dividend   stocks should be on your radar screen »  ",
    "  Click here to learn which 25 S.A.F.E. dividend   stocks should be on your radar screen » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:02:33"
}