{
  "url": "https://www.nasdaq.com/article/asian-stocks-follow-us-peers-higher-amid-lull-in-us-china-trade-tensions-cm1210297",
  "title": "Asian Stocks Follow US Peers Higher, Amid lull in US-China Trade Tensions - Nasdaq.com",
  "text": [
    "The lull in the US-China trade conflict has prompted safe haven assets to unwind recent gains: Gold is now trading below the $1490 level, the Japanese Yen has weakened above 107.5 against the US Dollar, while yields on 10-year US Treasuries have surged past 1.70 percent.",
    "Still, South Korea's decision to file a WTO complaint against Japan today is reminding investors that global trade tensions remain an ongoing concern. Although market sentiment may occasionally peek out from behind the risk-off curtain, the overall mood still speaks to a broader apprehension towards riskier assets, barring a meaningful de-escalation in the US-China trade conflict.",
    "The Euro has remained subdued around the 1.10 level against the US Dollar so far this week, in the lead up to the European Central Bank's policy decision on Thursday. Markets are expecting the ECB to push interest rates further into negative territory by 10 basis points, with potentially more stimulus to be unleased onto the ailing Eurozone economy.",
    "It remains to be seen whether the incoming policy stimulus by the ECB will be enough to offset the headwinds faced by the bloc, even as policymakers prepare for a leadership transition at the ECB on November 1. Should the ECB not live up to markets' dovish expectations this week, that may allow the Euro to post some immediate gains, although the broader outlook for the bloc's currency is expected to remain lackluster. The ECB's policy decision and conveyed outlook may also prompt immediate moves in the Dollar, considering that the Euro accounts for more than half of the Dollar Index (DXY).",
    "The 98.1 support level has proven effective for the Dollar Index (DXY), despite last Friday's lower-than-expected US non-farm payrolls print. Dollar bulls have taken the softer US jobs market in stride, propping up DXY this week. Most Asian currencies are currently weaker against the Greenback, while G10 currencies are seeing mixed fortunes against the Dollar.",
    "Looking at the Fed Funds Futures at the time of writing, markets are expecting the Fed to lower US interest rates next week and again in October, before pausing in December, only to incur one more rate cut in January. The upcoming US inflation and retail sales data releases for August are set to shape market expectations over the Federal Reserve's rates path in the lead up to next week's policy decision. Should the incoming economic indicators prompt the Fed to pivot towards a more dovish stance, that could send the Dollar Index below the psychological-98 level, on a path towards the 97.55 support level.",
    "Open your FXTM account today",
    "Disclaimer: The content in this article comprises personal opinions and should not be construed as containing personal and/or other investment advice and/or an offer of and/or solicitation for any transactions in financial instruments and/or a guarantee and/or prediction of future performance. ForexTime (FXTM), its affiliates, agents, directors, officers or employees do not guarantee the accuracy, validity, timeliness or completeness, of any information or data made available and assume no liability as to any loss arising from any investment based on the same.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:55:36"
}