{
  "url": "https://www.nasdaq.com/article/altria-mo-outpaces-stock-market-gains-what-you-should-know-cm1210804",
  "title": "Altria (MO) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Altria (MO) closed the most recent trading day at $44.71, moving +1.06% from the previous trading session. This change outpaced the S&P 500's 0.72% gain on the day. At the same time, the Dow added 0.85%, and the tech-heavy Nasdaq gained 1.06%. Coming into today, shares of the owner of Philip Morris USA, the nation's largest cigarette maker had lost 5.43% in the past month. In that same time, the Consumer Staples sector gained 1.08%, while the S&P 500 gained 2.25%. Wall Street will be looking for positivity from MO as it approaches its nex t earnings  report date. The company is expected to report EPS of $1.14, up 5.56% from the prior-year quarter. Meanwhile, our latest consensus estimate is calling for revenue of $5.29 billion, down 0.07% from the prior-year quarter. MO's full-year Zacks Consensus Estimates are calling for earnings of $4.17 per share and revenue of $19.71 billion. These results would represent year-over-year changes of +4.51% and +0.42%, respectively. Investors should also note any recent changes to analyst estimates for MO. These revisions help to show the ever-changing nature of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Based on our research, we believe these estimate revisions are directly related to near-team stock moves. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. MO currently has a Zacks Rank of #3 (Hold). Investors should also note MO's current valuation metrics, including its Forward P/E ratio of 10.6. This valuation marks a discount compared to its industry's average Forward P/E of 10.84. We can also see that MO currently has a PEG ratio of 1.39. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. Tobacco stocks are, on average, holding a PEG ratio of 1.39 based on yesterday's closing prices. The Tobacco industry is part of the Consumer Staples sector. This industry currently has a Zacks Industry Rank of 27, which puts it in the top 11% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. You can find more information on all of these metrics, and much more, on Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Altria Group, Inc. (MO): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Altria (MO) closed the most recent trading day at $44.71, moving +1.06% from the previous trading session. This change outpaced the S&P 500's 0.72% gain on the day. At the same time, the Dow added 0.85%, and the tech-heavy Nasdaq gained 1.06%.",
    "Coming into today, shares of the owner of Philip Morris USA, the nation's largest cigarette maker had lost 5.43% in the past month. In that same time, the Consumer Staples sector gained 1.08%, while the S&P 500 gained 2.25%.",
    "Wall Street will be looking for positivity from MO as it approaches its nex t earnings  report date. The company is expected to report EPS of $1.14, up 5.56% from the prior-year quarter. Meanwhile, our latest consensus estimate is calling for revenue of $5.29 billion, down 0.07% from the prior-year quarter.",
    "MO's full-year Zacks Consensus Estimates are calling for earnings of $4.17 per share and revenue of $19.71 billion. These results would represent year-over-year changes of +4.51% and +0.42%, respectively.",
    "Investors should also note any recent changes to analyst estimates for MO. These revisions help to show the ever-changing nature of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Based on our research, we believe these estimate revisions are directly related to near-team stock moves. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.",
    "The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. MO currently has a Zacks Rank of #3 (Hold).",
    "Investors should also note MO's current valuation metrics, including its Forward P/E ratio of 10.6. This valuation marks a discount compared to its industry's average Forward P/E of 10.84.",
    "We can also see that MO currently has a PEG ratio of 1.39. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. Tobacco stocks are, on average, holding a PEG ratio of 1.39 based on yesterday's closing prices.",
    "The Tobacco industry is part of the Consumer Staples sector. This industry currently has a Zacks Industry Rank of 27, which puts it in the top 11% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "You can find more information on all of these metrics, and much more, on Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:45:19"
}