{
  "url": "https://www.nasdaq.com/article/7-cheap-semiconductor-stocks-to-buy-now-cm1207607",
  "title": "7 Cheap Semiconductor Stocks to Buy Now - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "U.S. equities are rebounding on Wednesday thanks to relief from a number of pain points, including the rising odds of a Brexit deal to a possible stand down in Hong Kong. The result is a return by the large-cap indices back to the upper end of their two-month trading range.",
    "But beneath the surface, moves are being made by semiconductor stocks - arguably the most business cycle sensitive area of the market. The VanEck VectorsSemiconductor ETF (NYSEARCA: SMH ) is breaking out of its two-month range with a push to levels not see since late July.",
    "The sector has been in a holding pattern since April but could see a breakout here on turnaround hopes.",
    "Here are seven cheap chip-making stocks to buy.",
    "Shares of Flex (NASDAQ: FLEX ), a supplier of printed circuit boards based out of Singapore, are enjoying support near their 200-day moving average. FLEX is finding a low near the $9 level that's been tested three separate times over the past five months. The company will next report results on Oct. 24 after the close. Analysts are looking for earnings of 31 cents per share on revenues of $6.3 billion.",
    "TTM Technologies (NASDAQ: TTMI ) is another provider of printed circuit boards, the foundation for the \"digital brains\" of so many manufactured goods. The company was founded in 1978 and is based in California. Shares look ready for an upside breakout above their 200-day moving average in what would be the first major rally since shares peaked in summer 2018. The company will next report results on Oct. 29 after the close. Analysts are looking for earnings of 38 cents per share on revenues of $709.7 million.",
    "Shares of Amkor Technology (NASDAQ: AMKR ) have rallied back to test the highs set between February and May, capping a sideways range going all the way back to late 2016. The company is a provider of semiconductor packaging and testing services to manufacturers. Amkor will next report results Oct. 28 after the close. Analysts are looking for earnings of 8 cents per share on revenues of $1 billion.",
    "Celestica  (NYSE: CLS ) provides a variety of hardware services to the electronics industry including manufacturing, assembly and testing. The company's headquarters are in Toronto. Shares are finding a base near the lows set in June, setting up a rally to the 200-day moving average which would be worth a gain of more than 20% from here. The company will next report on Oct. 24 after the close. Analysts at looking for earnings of 12 cents per share on revenues of $1.4 billion.",
    "Shares of ASE Technology  (NYSE: ASX ) are rising to test the highs set in April and in the summer of 2018. The stock was recently upgraded by analysts at Goldman Sachs and Macquarie . The company provides a variety of packaging and testing services out of its headquarters in Taiwan. Watch for a breakout to the highs set in early 2018 which would be worth a rise of more than 50% from here.",
    "Shares of AU Optronics  (NYSE: AUO ) are challenging their 50-day moving average for the third time since prices broke down earlier this year. Shares were recently upgraded by analysts at HSBC Securities . The company manufactures liquid crystal displays and other monitors for everything from ATM machines to slot machines. The company will next report on Oct. 30 before the bell. Analysts are looking for a loss of 7 cents per share on revenues of $2.3 billion.",
    "Shares of Photronics  (NASDAQ: PLAB ) are testing the highs set back in February after rising nearly 40% off of the lows set in July. The company manufactures photomasks used in the making of semiconductors and flat panel displays. Photronics was founded in 1969 and is based in Connecticut. The company will next report results on Dec. 11 before the bell. Analysts are looking for earnings of 12 cents per share on revenues of $147 million.",
    "As of this writing, William Roth did not hold any of the aforementioned securities. ",
    "The post 7 Cheap Semiconductor Stocks to Buy Now appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:07:25"
}