{
  "url": "https://www.nasdaq.com/article/buy-ford-stock-for-big-dividends-and-improving-auto-sales-cm1207257",
  "title": "Buy Ford Stock for Big Dividends and Improving Auto Sales - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "It has been a bumpy few years for investors in Ford (NYSE: F ) stock. The company blasted out of the recession, with Ford stock running up to as high as $17 in 2014. Since then, however, fate has not been so kind to Ford stock investors.",
    " Auto sales peaked a few years ago in North America. Meanwhile, Europe faces persistent economic weakness and the trade war has cast a huge shadow over the company's operations in China. Alarmingly, rival General Motors (NYSE: GM ) has made huge inroads in that market as well.",
    "In any case, add it all up, and Ford's stock price has been in a long steady decline. Since 2014, shares have lost nearly half their value, and with hardly any significant rallies along the way. While Ford pays a generous dividend, that hasn't been enough to make up for the stock's inexorable decline. Things may be about to take a turn for the better, however.",
    "While the auto industry is hardly booming right now, things are perking up. Look at the most recent monthly data. Thomas King, a senior VP of data analytics for JD Power, said that : \"Strong volumes coupled with higher average sales prices means that consumers will spend more purchasing new vehicles in August than any month in history.\"",
    "Encouragingly for the auto makers, the average sale price of vehicles is rising nicely as more customers buy SUVs. The extended weakness in oil prices has resulted in cheaper gasoline, and people are taking that into account when purchasing new vehicles. With Ford relying on the F-150 for so much of its profits, gas prices are a solid tailwind for the firm.",
    "Turning back to the figures, however, August numbers won't be enough to make 2019 a huge year for auto sales. JD Power and LMC Automotive are still forecasting a 1.7% decline in total light vehicle sales for 2019. But that's nearly flat, and is well ahead of some more pessimistic assessments earlier this year.",
    "If you look at all 500 companies in the S&P 500, Ford stock currently offers the 13th-highest dividend yield of all. Its 6.54% dividend yield is only a whisker behind Dow (NYSE: DOW ) at 6.61% for being the highest-yielding industrial company in the index. Nearly all of the companies that yield more than Ford are deeply troubled businesses, such as slumping oil and gas companies or struggling firms in the retail sector.",
    "F stock, by contrast, is still performing reasonably well while offering its massive yield. Given its 2018 results, Ford can easily sustain its current dividend. Earnings were double its dividend payout from last year.",
    "Similarly, the company's cash flow after accounting for CAPEX left it enough room to pay more than twice the present dividend rate. We're not at peak auto sector profits right now either. That said, if another big recession comes around, the dividend might run into trouble; Ford had to suspend its payouts for several years during the financial crisis.",
    "It's not all great news for Ford stock though. The big issue facing the firm right now is that profitability has stalled out. While the company has grown revenues by roughly half since the financial crisis, net income has barely budged. It varies from year to year but there's been little in the way of meaningful growth.",
    "Ford is making a gigantic multi-billion dollar restructuring effort. Much of its focus is with international operations; the company is not earning money in various of its overseas markets. All these attempts at cost-cutting are angering some members of the labor force though. With the tight job market in the U.S. and Canada among other places, it may be difficult for Ford to save that much money by squeezing costs.",
    "There's also the uncertainty of what will happen as the trade war intensifies. Through 2017, China accounted for around 20% of Ford's overall vehicle sales. This figure dropped in 2018, and will almost certainly struggle as long as the current icy relations persist.",
    "Europe is another key market. It makes up around 25% of Ford's overall vehicle sales. In recent weeks, we've seen Trump step up tariff talk toward Europe. We'll have to wait and see how far things escalate there. Also, a newly-planned trade deal between Europe and certain countries in South America including Brazil and Argentina may be disintegrating. That could affect Ford's supply chain logistics going forward.",
    "Speaking of supply chain logistics, there's also the NAFTA replacement deal - USMCA - to think about. In theory, Congress should approve it soon. It appears to have enough bipartisan support, however, democratic leadership hasn't let it come up for a vote yet. Canada hasn't ratified the USMCA either - only Mexico has succeeded in that step. Should political issues arise and end up sinking the USMCA trade pact, it'd be a big blow for Ford stock.",
    "Nowadays, it seems many investors are fascinated with upstart auto stocks like Tesla (NASDAQ: TSLA ) and  Nio (NYSE: NIO ). It's important to keep things in perspective, however. Those firms are producing thousands of cars per month or quarter. Ford, by contrast, delivered nearly six million vehicles in 2018, and accounts for nearly 7% of the world's auto market and 14% of sales in North America.",
    "Ford survived the financial crisis and it's doing fine now, even with the downturn in the auto industry. For the F stock price to really shoot up, the company needs to obtain higher profit margins. This recent trend of revenue growth but flat profits does little for the share price.",
    "That said, the business is stable, the nearly 7% dividend is sustainable, and auto sales are starting to heat up. As a result, Ford stock could top $10 a share in coming months.",
    "At the time of this writing, Ian Bezek owned DOW stock. You can reach him on Twitter at @irbezek.",
    "The post Buy Ford Stock for Big Dividends and Improving Auto Sales appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 06:50:49"
}