{
  "url": "https://www.nasdaq.com/article/technology-sector-update-for-09042019-boxcoupeltk-cm1207450",
  "title": "Technology Sector Update for 09/04/2019: BOX,COUP,ELTK - Nasdaq.com",
  "text": [
    "Top Tech Stocks",
    "MSFT +1.09%",
    "AAPL +1.83%",
    "IBM +1.12%",
    "CSCO +1.54%",
    "GOOG +0.78%",
    "Technology stocks were firming in recent trading, with the shares of tech stocks in the S&P 500 adding nearly 1.6% in value this afternoon while the Philadelphia Semiconductor Index was rising just over 2.5%.",
    "Among technology stocks moving on news:",
    "(+) Box Inc ( BOX  ) climbed more than 11% on Wednesday after Starboard Value revealed owning about 7.5% of the cloud content management company's stock. The activist investor also said it may begin talks with the company and could recommend Box pursue a potential merger or sale to another company, seek board representation or suggest changes in its business strategy. Box acknowledged the Starboard Value investment late Tuesday and also said it was open to discussions but declined further comment.",
    "In other sector news:",
    "(+) Coupa Software ( COUP  ) was up more than 9% after late Tuesday reporting a surprise Q2 profit and better-than-expected revenue and forecasting above-consensus results for its FY20 net income and revenue, prompting at least three analysts to increase their price targets for the business spending software firm. Excluding one-time items, the company earned $0.07 per share on $95.1 million in revenue during the three months ended July 31, topping the analyst means looking for a non-GAAP net loss of $0.11 per share on $85.38 million in revenue.",
    "(-) Eltek ( ELTK  ) tumbled more than 33% lower on Wednesday after the Israeli contract manufacturer reported a decline in revenue during its Q2 ended June 30 compared with the year-ago period, falling to $8.2 million from $8.7 million in sales during the same quarter last year. Analyst projections were not available.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-04 01:35:22"
}