{
  "url": "https://www.nasdaq.com/article/faf-or-wrb-which-is-the-better-value-stock-right-now-cm1207179",
  "title": "FAF or WRB: Which Is the Better Value Stock Right Now? - Nasdaq.com",
  "text": [
    " Investors with an interest in Insurance - Property and Casualty stocks have likely encountered both First American Financial (FAF) and W.R. Berkley (WRB). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look. We have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits. Currently, both First American Financial and W.R. Berkley are holding a Zacks Rank of # 2 (Buy). This means that both companies have witnessed positive earnings estimate revisions, so investors should feel comfortable knowing that both of these stocks have an improving earnings outlook. However, value investors will care about much more than just this. Value investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels. Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years. FAF currently has a forward P/E ratio of 11.97, while WRB has a forward P/E of 24.95. We also note that FAF has a PEG ratio of 1.09. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. WRB currently has a PEG ratio of 2.77. Another notable valuation metric for FAF is its P/B ratio of 1.62. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, WRB has a P/B of 2.17. These are just a few of the metrics contributing to FAF's Value grade of A and WRB's Value grade of C. Both FAF and WRB are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that FAF is the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  First American Financial Corporation (FAF): Free Stock Analysis Report   W.R. Berkley Corporation (WRB): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors with an interest in Insurance - Property and Casualty stocks have likely encountered both First American Financial (FAF) and W.R. Berkley (WRB). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look.",
    "We have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits.",
    "Currently, both First American Financial and W.R. Berkley are holding a Zacks Rank of # 2 (Buy). This means that both companies have witnessed positive earnings estimate revisions, so investors should feel comfortable knowing that both of these stocks have an improving earnings outlook. However, value investors will care about much more than just this.",
    "Value investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels.",
    "Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years.",
    "FAF currently has a forward P/E ratio of 11.97, while WRB has a forward P/E of 24.95. We also note that FAF has a PEG ratio of 1.09. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. WRB currently has a PEG ratio of 2.77.",
    "Another notable valuation metric for FAF is its P/B ratio of 1.62. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, WRB has a P/B of 2.17.",
    "These are just a few of the metrics contributing to FAF's Value grade of A and WRB's Value grade of C.",
    "Both FAF and WRB are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that FAF is the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:11"
}