{
  "url": "https://www.nasdaq.com/article/why-rig-count-is-no-longer-a-reliable-gauge-of-production-cm1207480",
  "title": "Why Rig Count Is No Longer a Reliable Gauge of Production - Nasdaq.com",
  "text": [
    " It seems that the 'rig count' data have become irrelevant today, especially in terms of oil and gas production. The figure used to generate considerable excitement among energy investors and has long been deployed to help predict future oil and gas production. However, the correlation seems to come under the spotlight recently. As per conventional thinking, when number of rigs decline, fewer wells are drilled. This means less new oil and gas are discovered, and ultimately production slows down. But recent data suggest otherwise.      Nationwide Oil & Gas Rig Count Slumps  In its lates t report  , oil services player Baker Hughes, a GE company BHGE  said that rigs engaged in exploration and production in the U.S. totaled 904 for the week ended Aug 30, 14% less than a year ago. In particular, the number of oil-directed rigs (at 742) is at its lowest since January 2018. The current total, far from the peak of 1,609 attained in October 2014, is also lower than 862 a year ago. Meanwhile, the current nationwide natural gas rig count (at 162) has plunged to levels last seen in mid-April 2017. It is well below the previous year's rig count of 184 and 90% below the all-time high of 1,606 recorded in 2008.   Moreover, the horizontal/directional rig count (encompassing new technology to drill and extract crude from onshore shale formations) - at 854 - is well below the previous year's tally of 982.  Weakness in Commodity Prices to Blame  There is growing evidence that producers are being repelled by falling crude and  natural gas prices  .  As far as oil is concerned, the volatility in realizations have convinced explorers like Apache APA  , Parsley Energy PE  , Equinor EQNR  among others to take a relatively conservative approach on capital expenditure programs. The U.S. crude benchmark, now below $55 a barrel, is also reeling from fears of a global economic slowdown in the backdrop of the U.S.-China trade war. Oil's troubles pushed the index into a bear market in August, leading to a more than 20% drop from recent highs. Natural gas, meanwhile, recently fell to levels not seen in more than three years, reflecting a steady, albeit slow, descent. Natural gas might experience short-lived surge based on positive weather forecasts but any powerful turnaround looks unlikely at the moment. With gas output in the lower 48 states recently hitting a record 92.1 Bcf per day, there is little room for prices to improve meaningfully from their current levels of around $2.35 per MMBtu.  Yet Production Hits Record  Per the EIA, the U.S. oil output hit an all-time high of 12.5 million barrels per day last week. Further, the government agency predicts that domestic oil production will average a record 12.3 million barrels per day in 2019. On the natural gas front, EIA analysis suggests that average domestic supply will climb around 10% year over year to a record high of 91 billion cubic feet per day in 2019. To put things in perspective, U.S. production was averaging around 55 billion cubic feet per day in 2009, only ten years back.  Why the Disparity?  Firstly, producers have become immensely better at churning out oil and gas out of deep underground layers of rock with the help of sophisticated technology. Secondly, some of the rigs that have been taken out of work were employed in secondary regions where the probability to find oil/gas was low anyway. Therefore, their exclusion did not materially affect overall volumes. Lastly, 2014's crude price spike - that saw the commodity breach the $100-a-barrel level - led to massive expansion in domestic drilling. However, the subsequent commodity price crash forced a number of producers to defer the 'fracking' of the wells. Investors should know that fracking - which follows drilling - is used to complete the well and get the oil flowing. This led to a huge backlog of drilled but uncompleted wells that are now being completed. In other words, lack of new drilling (or lower number of rigs) could still increase production if the wells are being completed.  So, Are Rig Counts Totally Irrelevant?  It's quite clear that the number of rigs is no longer the sole criteria in determining production movement, as it doesn't give the whole picture. Consequently, the decline in the number of U.S. drilling rigs has not translated into slowing shale production yet. For the real picture, one should also take into account existing and impending cut in fracking (or shale drilling) operations from the likes of oilfield services giants Halliburton HAL  and Schlumberger SLB  - both carrying Zacks Rank #3 (Hold) - and spending cuts by top energy companies.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>      Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Schlumberger Limited (SLB): Free Stock Analysis Report   Halliburton Company (HAL): Free Stock Analysis Report   Apache Corporation (APA): Free Stock Analysis Report   Parsley Energy, Inc. (PE): Free Stock Analysis Report   Statoil ASA (EQNR): Free Stock Analysis Report   Baker Hughes, a GE company (BHGE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "It seems that the 'rig count' data have become irrelevant today, especially in terms of oil and gas production.",
    "The figure used to generate considerable excitement among energy investors and has long been deployed to help predict future oil and gas production. However, the correlation seems to come under the spotlight recently.",
    "As per conventional thinking, when number of rigs decline, fewer wells are drilled. This means less new oil and gas are discovered, and ultimately production slows down.",
    "But recent data suggest otherwise.    ",
    " Nationwide Oil & Gas Rig Count Slumps ",
    "In its lates t report  , oil services player Baker Hughes, a GE company BHGE  said that rigs engaged in exploration and production in the U.S. totaled 904 for the week ended Aug 30, 14% less than a year ago.",
    "In particular, the number of oil-directed rigs (at 742) is at its lowest since January 2018. The current total, far from the peak of 1,609 attained in October 2014, is also lower than 862 a year ago.",
    "Meanwhile, the current nationwide natural gas rig count (at 162) has plunged to levels last seen in mid-April 2017. It is well below the previous year's rig count of 184 and 90% below the all-time high of 1,606 recorded in 2008.  ",
    "Moreover, the horizontal/directional rig count (encompassing new technology to drill and extract crude from onshore shale formations) - at 854 - is well below the previous year's tally of 982.",
    " Weakness in Commodity Prices to Blame ",
    "There is growing evidence that producers are being repelled by falling crude and  natural gas prices  . ",
    "As far as oil is concerned, the volatility in realizations have convinced explorers like Apache APA  , Parsley Energy PE  , Equinor EQNR  among others to take a relatively conservative approach on capital expenditure programs. The U.S. crude benchmark, now below $55 a barrel, is also reeling from fears of a global economic slowdown in the backdrop of the U.S.-China trade war. Oil's troubles pushed the index into a bear market in August, leading to a more than 20% drop from recent highs.",
    "Natural gas, meanwhile, recently fell to levels not seen in more than three years, reflecting a steady, albeit slow, descent. Natural gas might experience short-lived surge based on positive weather forecasts but any powerful turnaround looks unlikely at the moment. With gas output in the lower 48 states recently hitting a record 92.1 Bcf per day, there is little room for prices to improve meaningfully from their current levels of around $2.35 per MMBtu.",
    " Yet Production Hits Record ",
    "Per the EIA, the U.S. oil output hit an all-time high of 12.5 million barrels per day last week. Further, the government agency predicts that domestic oil production will average a record 12.3 million barrels per day in 2019.",
    "On the natural gas front, EIA analysis suggests that average domestic supply will climb around 10% year over year to a record high of 91 billion cubic feet per day in 2019. To put things in perspective, U.S. production was averaging around 55 billion cubic feet per day in 2009, only ten years back.",
    " Why the Disparity? ",
    "Firstly, producers have become immensely better at churning out oil and gas out of deep underground layers of rock with the help of sophisticated technology.",
    "Secondly, some of the rigs that have been taken out of work were employed in secondary regions where the probability to find oil/gas was low anyway. Therefore, their exclusion did not materially affect overall volumes.",
    "Lastly, 2014's crude price spike - that saw the commodity breach the $100-a-barrel level - led to massive expansion in domestic drilling. However, the subsequent commodity price crash forced a number of producers to defer the 'fracking' of the wells.",
    "Investors should know that fracking - which follows drilling - is used to complete the well and get the oil flowing. This led to a huge backlog of drilled but uncompleted wells that are now being completed. In other words, lack of new drilling (or lower number of rigs) could still increase production if the wells are being completed.",
    " So, Are Rig Counts Totally Irrelevant? ",
    "It's quite clear that the number of rigs is no longer the sole criteria in determining production movement, as it doesn't give the whole picture. Consequently, the decline in the number of U.S. drilling rigs has not translated into slowing shale production yet.",
    "For the real picture, one should also take into account existing and impending cut in fracking (or shale drilling) operations from the likes of oilfield services giants Halliburton HAL  and Schlumberger SLB  - both carrying Zacks Rank #3 (Hold) - and spending cuts by top energy companies.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "   See 7 breakthrough stocks now>>   ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 01:35:00"
}