{
  "url": "https://www.nasdaq.com/article/christian-evangelicals-harvest-land-in-settlements-israel-hopes-to-annex-20190912-00302",
  "title": "Christian evangelicals harvest land in settlements Israel hopes to annex - Nasdaq.com",
  "text": [
    "By Maayan Lubell and Elana Ringler",
    "SHILO, West Bank, Sept 12 (Reuters) - It's harvest time in vineyards atop the hills of Shilo settlement in the Israeli-occupied West Bank. But it's not Jewish settlers picking the grapes, it's evangelical Christians.",
    "They are volunteers for the devout U.S. evangelical group HaYovel which brings Christians to help Jewish farmers in settlements that Israel has built on land that Palestinians seek for a state.",
    "The West Bank holds special importance to evangelicals who see a divine hand in the modern-day return of Jews to a biblical homeland - and who call the territory by its Hebrew Old Testament name, Judea and Samaria.",
    "The founder of HaYovel, Tommy Waller, is fond of quoting a passage from the book of Jeremiah, which reads: \"Again I will build thee, and thou shalt be built, O virgin of Israel...Thou shalt yet plant vines upon the mountains of Samaria.\"",
    "But that land is also at the heart of the Israeli-Palestinian conflict.",
    "It is the heartland of what the Palestinians see as a future state, along with East Jerusalem and the Gaza Strip, territories that Israel captured in the 1967 Middle East war.",
    "\"We share a commonality between Christianity and Judaism and that's our bible, our scripture,\" said Waller at a vineyard on the outskirts of Har Bracha, another settlement whose farmers his volunteers assist.",
    "ANNEXATION",
    "Most of the international community regards the Israeli settlements as illegal, a view that Israel disputes.",
    "Israeli hawks, including Prime Minister Benjamin Netanyahu, claim the West Bank is vital to Israel's security. Relinquishing it to the Palestinians could put large swaths of Israel under threat of militant attacks, they say. Palestinians say there can be no viable Palestinian state without it.",
    "It's a position that the politically powerful U.S. evangelicals have embraced.",
    "\"Evangelicals believe Judea and Samaria is bible land, because it is,\" said Mike Evans, the Texas-based founder of 'Friends of Zion Museum' which sits in Jerusalem. \"Do we think giving up Judea and Samaria is going to bring peace? No way,\" said Evans, who is a member of Trump's Faith Initiative.",
    "The prospect of annexation has alarmed the Palestinians, who fear that Netanyahu is likely to have Trump's backing.",
    "\"We are worried about losing our lands,\" said Izzat Qadous, a retired school teacher from the Palestinian village Irak Burin, across the way from Har Bracha.",
    "\"The same way they have annexed Jerusalem, they want to annex the West Bank and soon we will hear of Trump acknowledging the annexation of the West Bank.\"",
    "About 2.9 million Palestinians live in the West Bank, according to official Palestinian figures and more than 400,000 Israeli settlers live there, according to the Israeli statistics bureau.",
    "Evangelical leaders lobbied Trump earlier in his presidency for his 2017 recognition of Jerusalem as the capital of Israel, and his relocation of the U.S. Embassy to the holy city in 2018.",
    "\"He (Trump) is rewarding moral clarity and I believe the Jewish people should be rewarded for moral clarity with recognizing more of their land,\" said Evans, referring to the West Bank.",
    "\"ROCK STAR\"",
    "Trump's administration includes evangelicals at some top positions - his vice president Mike Pence and Secretary of State Mike Pompeo, who in an interview to the Christian Broadcast Network in March said that \"the Lord was at work here\" in respect to Trump's Israel policies.",
    "Evangelical support for Israel goes back decades, with political lobbying, fundraising and organised tours to the Holy Land. But some see the ties growing far stronger under both Trump and Netanyahu.",
    "Hanan Ashrawi, a senior official of the Palestine Liberation Organization, said the evangelical base \"has been wielding unprecedented and enormous influence within the United States for the sake of the \"fulfilment of the prophecy,\" thereby giving Israel a free hand to carry out its most hardline and destructive policies against the Palestinian people.\"",
    "Dore Gold, President of the Jerusalem Center for Public Affairs, said Netanyahu began cultivating ties with evangelicals during his first stint as prime minister in the 1990s.",
    "\"The Prime Minister has a keen sense of trendlines in the U.S.,\" said Gold.",
    "That effort may have paid off. \"Benjamin Netanyahu among the evangelicals of the world is a rock star,\" Evans said.",
    "Critics, however, say Netanyahu has alienated many liberal American Jews by embracing Christian conservatives. Even in Israel's settlements, the evangelicals are sometimes greeted with suspicion.",
    "Some Israelis there fear that the Christians may have a missionary agenda - seeking to convert them. Evans said his mission in life is to defend the Jewish people.",
    "Others are nervous about some evangelical readings of the scriptures in which the Jews' return to the biblical land is instrumental in bringing about the end of the world, at which point those who do not accept Jesus Christ will not be saved.",
    "\"These people are pursuing God like we're pursuing God,\" said Waller. \"Obviously we have our own messianic belief, but those are future things, in the kingdom to come.\"",
    "On the other hand, some settlers see the evangelicals as helping them out in fulfilling their own vision.",
    "Nir Lavi, the owner of Har Bracha winery, says Hayovel's contribution to his business has been more than financial.",
    "\"We are grateful,\" said Lavi. \"It's a totally different phase of our own journey - the Jewish people's redemption in their land.\""
  ],
  "published_datetime": "2019-09-12 07:48:00"
}