{
  "url": "https://www.nasdaq.com/article/singapores-vertex-adds-290-mln-venture-fund-for-highgrowth-tech-firms-20190912-00177",
  "title": "Singapore's Vertex adds $290 mln venture fund for high-growth tech firms - Nasdaq.com",
  "text": [
    "By Anshuman Daga and Aradhana Aravindan",
    "SINGAPORE, Sept 12 (Reuters) - Singapore-based Vertex Venture Holdings, the first main backer of Southeast Asia's ride-hailing giant Grab, has added a new $290 million venture capital fund targeting investments in high-growth technology firms, a senior company official said.",
    "The Vertex Growth Fund will seek to invest about $10 million to $15 million per company, typically in third and fourth round fundings, versus $3 million to $4 million by affiliate funds in early rounds, said Vertex Venture Holdings CEO Chua Kee Lock.",
    "Technology startups are sprouting up across Southeast Asia - home to about 640 million people - as companies seek to offer a range of services, including ride-hailing apps, online payments and e-commerce, with consumers rapidly coming online.",
    "The Vertex Ventures Southeast Asia and India Fund invested in Grab when it was a start-up. Seven-year-old Grab has grown to become the region's biggest ride-hailing operation, valued at an estimated $14 billion, sources say.",
    "\"When a lot of companies had come to a stage where they were accelerating growth, we had to stop investments,\" Chua said, adding that this was due to a 10% investment cap in each company set by Vertex's early-stage funds.",
    "Vertex Growth is the sixth and latest member of Vertex's global network of funds spread across China, Southeast Asia and India, the United States and Israel.",
    "Vertex has about $3 billion in assets under management across its network of funds and has invested in more than 200 companies. The funds focus on investments in their regions of industry specialisation and are run independently.",
    "Chua said the Vertex Growth fund exceeded an initial fund target of $250 million.",
    "It secured commitments from Singapore state investor Temasek Holdings , Taiwanese chip design firm Elan Microelectronics  and other institutions, family offices and funds based in Southeast Asia and Taiwan.",
    "Many Southeast Asian funds are sprouting up to tap into fast-growing firms, while tech giants Alibaba , Tencent Holdings Ltd  and SoftBank Group Corp  are also expanding their bets in the region.",
    "Chua said the fund will look at global opportunities, including in areas such as cyber-security in Israel and consumer-related technology in Southeast Asia and China.",
    "Vertex Growth has invested about 10 percent of its capital in companies in the United States, UK and Southeast Asia."
  ],
  "published_datetime": "2019-09-12 05:49:00"
}