{
  "url": "https://www.nasdaq.com/article/technical-pressures-weigh-on-cisco-stock-cm1206855",
  "title": "Technical Pressures Weigh on Cisco Stock - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Over the long run, network technology specialist Cisco (NASDAQ: CSCO ) makes investment sense. With a surge of innovations, especially the 5G network rollout, Cisco stock is incredibly relevant. Plus, with tech increasingly representing a geopolitical flashpoint, CSCO should enjoy strong government support.",
    "However, these positive fundamentals currently clash with technical pressures. Despite a strong and relevant business, CSCO stock has been unable to avoid the fear resulting from potholes such as worrying economic metrics and the ongoing (and escalating) U.S.-China trade war.",
    "Cisco stock is starting off September in a cloud of pessimism. In the prior month, shares lost more than 15% of their market value. As a generally stable and dividend-bearing equity, such a loss is certainly an eyesore.",
    "To be fair, the company is doing all it can to avoid the red ink. For example, in its fiscal fourth quarter of 2019, CSCO produced a beat on both the top and bottom line. Against a per-share profitability target of 82 cents, the company delivered 83 cents. For the consensus revenue estimate of $13.38 billion, actual revenue came in at $13.43 billion.",
    "Unfortunately, management disclosed that China revenue was down 25% on an annualized basis for Q4. Adding to the already acute trade war fears, CEO Chuck Robbins admitted, \"What we've seen is in the state on enterprises … we're just being - we're being uninvited to bid.\"",
    "With management's downgrade for both earnings and revenue in fiscal Q1 2020, Cisco stock had nowhere to go but down.",
    "At the same time, the underlying narrative hasn't changed for CSCO stock. How then should investors respond to the market carnage?",
    "Invariably, anybody looking at the fallout in the CSCO stock price without the full context will hesitate. With the broader indices also flashing warning signs, it doesn't seem like an ideal time to jump in.",
    "However, such logic, although understandable, ignores the longer-term bull case for Cisco stock. And as you might expect, this positive narrative focuses on the 5G network.",
    "At this point, everybody and their grandparents have heard of 5G. What makes Cisco stock stand out is the firm's underlying cohesive approach to the technology. As even their own website declares, if you can't monetize the innovation , 5G is merely a different cog in radio frequencies.",
    "To that end, I appreciate management's directed acquisition strategies, including their plan to buyout Acacia Communications (NASDAQ: ACIA ) for $2.6 billion. In its native form, Acacia specializes in \"disruptive\" high-speed communications technologies. Particularly, Acacia is known within the networking industry for optical interconnect solutions.",
    "Under the current technological landscape, high latency (or the time to transfer data from sender to receiver) and power consumptions represent major challenges. This is especially the case for data transmissions over long distances.",
    "With areas such as cloud computing, data centers and video conferencing demanding lower latencies, an Acacia acquisition makes sense for Cisco and CSCO stock. Certainly, it gives the tech firm a competent, practical advantage in the 5G rollout.",
    "And whether it wants to or not, Cisco plays a pivotal role in U.S. national interests . Increasingly, our geopolitical rivalries with China and Russia are evolving from kinetic concerns to digital ones. As such, you can expect the federal government to ease up on its aggressive stance against big tech.",
    "However, Cisco stock isn't an easy bull argument to make because of the trade war. With national pride and political credibility at stake, neither side has demonstrated a willingness to concede.",
    "Plus, we've already seen the devastating impact that the economic conflict had on CSCO. A 25% reduction in regional revenue is nothing to scoff at. The volatility is very concerning from a technical sentiment perspective. The initial wave of selling pressure that began in late July dropped CSCO stock below the 50-day moving average. Later, the earnings disappointment plunged shares below their 200-day moving average.",
    "Right now, CSCO is in a no man's land. Given the overriding pessimism in the broader markets, I believe shares risk falling first before picking back up.",
    "But if Cisco stock does drop to levels near what we saw early this year, I think it's an opportunity. As I mentioned above, Cisco is simply too important to the rollout of next-gen technologies. That should help mitigate volatility as we close out this year and head into the next.",
    "As of this writing, Josh Enomoto did not hold a position in any of the aforementioned securities.",
    "The post Technical Pressures Weigh on Cisco Stock appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:10:49"
}