{
  "url": "https://www.nasdaq.com/article/kbr-or-rtoxy-which-is-the-better-value-stock-right-now-cm1210428",
  "title": "KBR or RTOXY: Which Is the Better Value Stock Right Now? - Nasdaq.com",
  "text": [
    " Investors looking for stocks in the Engineering - R and D Services sector might want to consider either KBR Inc. (KBR) or ROTORK PLC (RTOXY). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look. There are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits. KBR Inc. has a Zacks Rank of #2 (Buy), while ROTORK PLC has a Zacks Rank of #4 (Sell) right now. This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that KBR is likely seeing its earnings outlook improve to a greater extent. But this is just one factor that value investors are interested in. Value investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels. Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years. KBR currently has a forward P/E ratio of 15.21, while RTOXY has a forward P/E of 22.59. We also note that KBR has a PEG ratio of 1.51. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. RTOXY currently has a PEG ratio of 1.81. Another notable valuation metric for KBR is its P/B ratio of 2.01. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, RTOXY has a P/B of 4.80. These metrics, and several others, help KBR earn a Value grade of B, while RTOXY has been given a Value grade of F. KBR sticks out from RTOXY in both our Zacks Rank and Style Scores models, so value investors will likely feel that KBR is the better option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  KBR, Inc. (KBR): Free Stock Analysis Report   ROTORK PLC (RTOXY): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors looking for stocks in the Engineering - R and D Services sector might want to consider either KBR Inc. (KBR) or ROTORK PLC (RTOXY). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look.",
    "There are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits.",
    "KBR Inc. has a Zacks Rank of #2 (Buy), while ROTORK PLC has a Zacks Rank of #4 (Sell) right now. This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that KBR is likely seeing its earnings outlook improve to a greater extent. But this is just one factor that value investors are interested in.",
    "Value investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels.",
    "Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years.",
    "KBR currently has a forward P/E ratio of 15.21, while RTOXY has a forward P/E of 22.59. We also note that KBR has a PEG ratio of 1.51. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. RTOXY currently has a PEG ratio of 1.81.",
    "Another notable valuation metric for KBR is its P/B ratio of 2.01. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, RTOXY has a P/B of 4.80.",
    "These metrics, and several others, help KBR earn a Value grade of B, while RTOXY has been given a Value grade of F.",
    "KBR sticks out from RTOXY in both our Zacks Rank and Style Scores models, so value investors will likely feel that KBR is the better option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:40:19"
}