{
  "url": "https://www.nasdaq.com/article/daily-dividend-report-vz-chmi-rcii-hes-phm-cm1208157",
  "title": "Daily Dividend Report: VZ, CHMI, RCII, HES, PHM - Nasdaq.com",
  "text": [
    "      The Board of Directors of Verizon Communications today declared a quarterly dividend of 61.50 cents per outstanding share, an increase of 1.25 cents per share, or 2.1 percent, from the previous quarter. The quarterly dividend is payable on Nov. 1, 2019, to Verizon shareowners of record at the close of business on Oct. 10, 2019. This is the 13th consecutive year Verizon's Board has approved a quarterly dividend increase.  makeArticleAd();    Cherry Hill Mortgage Investment today announced that its Board of Directors has declared a dividend of $0.40 per share on the Company's common stock for the third quarter of 2019. The dividend will be payable in cash on October 29, 2019 to holders of the common stock of record as of the close of business on September 30, 2019.      Rent-A-Center, today announced that its Board of Directors has declared a $0.25 per share cash dividend for the fourth quarter of 2019 to be paid to the Company's common stockholders. The dividend will be paid on October 9, 2019 to common stockholders of record as of the close of business on September 23, 2019.      The Board of Directors of Hess today declared a regular quarterly dividend of 25 cents per share payable on the Common Stock of the Corporation on September 30, 2019 to holders of record at the close of business on September 16, 2019.      PulteGroup, announced today that its Board of Directors has declared a quarterly cash dividend of $0.11 per common share payable October 3, 2019, to shareholders of record at the close of business on September 18, 2019.        VIDEO: Daily Dividend Report: VZ, CHMI, RCII, HES,     PHM   ",
    "   VIDEO: Daily Dividend Report: VZ, CHMI, RCII, HES,     PHM  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 12:26:13"
}