{
  "url": "https://www.nasdaq.com/article/is-ishares-msci-acwi-low-carbon-target-etf-crbn-a-strong-etf-right-now-cm1210856",
  "title": "Is iShares MSCI ACWI Low Carbon Target ETF (CRBN) a Strong ETF Right Now? - Nasdaq.com",
  "text": [
    "Designed to provide broad exposure to the World ETFs category of the market, the iShares MSCI ACWI Low Carbon Target ETF (CRBN) is a smart beta exchange traded fund launched on 12/08/2014.",
    "What Are Smart Beta ETFs?",
    "The ETF industry has long been dominated by products based on market cap weighted indexes, a strategy created to reflect the market or a particular market segment.",
    "Investors who believe in market efficiency should consider market cap indexes, as they replicate market returns in a low-cost, convenient, and transparent way.",
    "On the other hand, some investors who believe that it is possible to beat the market by superior stock selection opt to invest in another class of funds that track non-cap weighted strategies--popularly known as smart beta.",
    "By attempting to pick stocks that have a better chance of risk-return performance, non-cap weighted indexes are based on certain fundamental characteristics, or a combination of such.",
    "While this space offers a number of choices to investors, including simplest equal-weighting, fundamental weighting and volatility/momentum based weighting methodologies, not all these strategies have been able to deliver superior results.",
    "Fund Sponsor & Index",
    "Managed by Blackrock, CRBN has amassed assets over $477.79 M, making it one of the larger ETFs in the World ETFs. This particular fund, before fees and expenses, seeks to match the performance of the MSCI ACWI Low Carbon Target Index.",
    "The MSCI ACWI Low Carbon Target Index is designed to address two dimensions of carbon exposure ? carbon emissions and potential carbon emissions from fossil fuel reserves.",
    "Cost & Other Expenses",
    "When considering an ETF's total return, expense ratios are an important factor. And, cheaper funds can significantly outperform their more expensive cousins in the long term if all other factors remain equal.",
    "With one of the least expensive products in the space, this ETF has annual operating expenses of 0.20%.",
    "The fund has a 12-month trailing dividend yield of 2.22%.",
    "Sector Exposure and Top Holdings",
    "Most ETFs are very transparent products, and disclose their holdings on a daily basis. ETFs also offer diversified exposure, which minimizes single stock risk, though it's still important for investors to research a fund's holdings.",
    "When you look at individual holdings, Microsoft Corp (MSFT) accounts for about 2.19% of the fund's total assets, followed by Apple Inc (AAPL) and Amazon Com Inc (AMZN).",
    "Its top 10 holdings account for approximately 11.54% of CRBN's total assets under management.",
    "Performance and Risk",
    "The ETF has added roughly 18.77% and was up about 5.02% so far this year and in the past one year (as of 09/12/2019), respectively. CRBN has traded between $99 and $122.22 during this last 52-week period.",
    "The ETF has a beta of 0.97 and standard deviation of 11.77% for the trailing three-year period, making it a low risk choice in the space. With about 1295 holdings, it effectively diversifies company-specific risk.",
    "Alternatives",
    "IShares MSCI ACWI Low Carbon Target ETF is a reasonable option for investors seeking to outperform the World ETFs segment of the market. However, there are other ETFs in the space which investors could consider.",
    "IShares MSCI KLD 400 Social ETF (DSI) tracks MSCI KLD 400 Social Index and the iShares ESG MSCI USA Leaders ETF (SUSL) tracks MSCI USA EXTENDED ESG LEADERS INDEX. IShares MSCI KLD 400 Social ETF has $1.53 B in assets, iShares ESG MSCI USA Leaders ETF has $1.60 B. DSI has an expense ratio of 0.25% and SUSL charges 0.10%.",
    "Investors looking for cheaper and lower-risk options should consider traditional market cap weighted ETFs that aim to match the returns of the World ETFs.",
    "Bottom Line",
    "To learn more about this product and other ETFs, screen for products that match your investment objectives and read articles on latest developments in the ETF investing universe, please visit Zacks ETF Center .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 06:46:00"
}