{
  "url": "https://www.nasdaq.com/article/10-tech-stocks-to-buy-now-for-2025-cm1207378",
  "title": "10 Tech Stocks to Buy Now for 2025 - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Editor's note: \"10 Tech Stocks to Buy Now for 2025\" was previously published in July 2019. It has since been updated to include the most relevant information available.",
    "The tech sector endured some pretty tough times last year. Even Alphabet (NASDAQ: GOOG , NASDAQ: GOOGL ) and  Facebook  (NASDAQ: FB ) struggled.",
    "But if we put these troubles aside for a moment and focus on the longer-term outlook, a different picture emerges. Stretching out to 2025, some of these big-name tech stocks begin to look very attractive indeed - especially at their current price levels.",
    "In order to pinpoint which tech stocks will be leading the way seven years from now, I turned to a recent report from RBC Capital. Its \"Imagine 2025\" portfolio selects the tech stocks the firm believes will be winning on a long-term basis. \"We believe the following names are best positioned to outperform over a seven-year time horizon through 2025,\" writes the firm.",
    "What does this mean for now? It means longer-term investors should think twice before selling the stocks listed below, while other investors may want to keep a close eye on the following stocks as potential buy on the dip opportunities.",
    "Here are the top tech stocks primed to outperform over the next few years:",
    "As I said above, Alphabet has not been immune to the market's choppiness but that doesn't mean it's still not one of the top stocks to buy.",
    "At the end of the day, this is still a killer stock pick with a \"strong buy\" analyst consensus on TipRanks . This is with a $1,346 average analyst price target.",
    "\"AMZN and GOOGL, in particular, appear to have invested the most in AI competencies and have the Big Data access and Compute Power infrastructure to benefit most from AI and ML developments,\" writes RBC Capital.",
    "And Google has an extra string on its bow: its self-driving car unit Waymo. Alphabet disclosed that Waymo reached the 10 million miles of autonomous vehicle driving milestone.",
    "\"GOOGL appears particularly well situated to lead autonomous vehicle innovations, given its substantial investments in Waymo autonomous vehicle technology,\" it said.",
    "Luckily for Alphabet, RBC believes autonomous vehicles will be arguably one of the biggest applications of AI.",
    "Interested in GOOGL stock?  Get a free GOOGL Stock Research Report.",
    "Nvidia (NASDAQ: NVDA ) is pushing the boundaries of technology and this should pay off over the years to come.",
    "Even though Nvidia is suffering over the last six months, the long-term picture remains very compelling making this one of the top stocks to buy and hold.",
    "For example, Jefferies analyst Mark Lipacis ( Track Record & Ratings ) calls the January quarter a setback. However, he says Nvidia remains \"a top play on secular themes\" in AI, gaming and autonomous vehicles. He tells investors to \"buy the confession.\"",
    "\"While there are no guarantees of a winner in the AI race, we think Nvidia is well ahead of its peers and is continuing to gain traction due primarily to the value of Cuda software,\" says RBC Capital. It estimates over one million engineers working with Cuda and calls it \"the secret sauce that underlies the entire ecosystem.\" Get the NVDA Stock Research Report.",
    "You probably aren't surprised to see Amazon  (NASDAQ: AMZN ) on this list. The eCommerce company is consistently innovating for the future, be it through acquisitions, technology or entering new markets.",
    "One interesting advancement for the company is in the field of robotics. \"Amazon appears particularly well situated to lead robotics innovations, given its ongoing investment in Kiva logistics robots,\" points out RBC Capital.",
    "The company already deploys something to the tune of 100K Kiva robots, basically a robot army. And it's now looking increasingly likely that a very large percentage of Amazon's distribution workforce will be complemented with these robots by 2025.",
    "As RBC concludes, the impact of this should be greater operational efficiency for AMZN stock.",
    "Another interesting trend to consider when you're looking at tech stocks to buy: AI-powered Voice Recognition will likely improve significantly from current levels, allowing even better use of internet apps via voice commands. Again, Amazon should be a major beneficiary of this trend.",
    "Notably, AMZN boasts one of the best ratings on the Street. This comes with a $2,215 average analyst price target. Get the AMZN Stock Research Report.",
    "If you are looking for cheaper long-term stocks to buy, look no further than Rapid7 (NASDAQ: RPD ). This company uses a unique data- and analytics-driven approach to cybersecurity.",
    "The stock is highlighted by RBC as an attractive name in the cybersecurity space, particularly following the recent acquisition of Komand. The company snapped up Komand in 2017 to boost its security orchestration and automation offering.",
    "\"The need for well-designed security and IT automation solutions is acute; resources are scarce, environments are becoming more complex, all while threats are increasing,\" says Corey Thomas, CEO of Rapid7.",
    "\"Security and IT solutions must evolve through context-driven automation, allowing cybersecurity and IT professionals to focus on more strategic activities.\"",
    "Plus RBC's Matthew Hedberg ( Track Record & Ratings ) is behind the stock. \"Success has continued to highlight the power of the platform approach with impressive cross-sell metrics driven by combining security and IT Ops\" concludes the analyst.  Get the RPD Stock Research Report.",
    "\"Within our software universe, we would highlight Splunk  (NASDAQ: SPLK ) as a likely winner in the big data category,\" writes RBC Capital.",
    "Splunk basically turns machine data into answers. It produces software for searching, monitoring and analyzing machine-generated big data, via a web-style interface.",
    "In part, these answers are generated through the firm's machine learning system. Splunk provides the Machine Learning Toolkit, a guided workbench to create and test flexible models that can handle any use case.",
    "\"A key value of creating models in Splunk is that users can seamlessly apply them to real-time machine data\" says RBC Capital.",
    "Plus RBC isn't the only firm singing the stock's praises. This \"strong buy\" stock has a $155 average analyst price target. Get the SPLK Stock Research Report.",
    "If we turn to financial tech stocks to buy, analysts are upbeat on\"moderate buy\" stock PayPal (NASDAQ: PYPL ) right now. This is with a $1117 average analyst price target.",
    "First of all, PayPal offers massive scale. And second, it boasts a unique two-sided model among tech stocks, with both consumers and merchants onside. This means the company can control the entire consumer experience.",
    "\"PayPal's unique assets enable the company to tap into the long-term global shift to digital commerce\" says RBC Capital.",
    "Plus the firm sees the company as a champion of democratizing finance around the globe. \"We believe its growing platform of assets will open up the ~2B people around the world who lack financial services.\"",
    "Similarly top Oppenheimer analyst Glenn Greene ( Track Record & Ratings ) notes PYPL's \"unique\" competitive position. He is even more confident in the stock following recent partnerships, and anticipates high-teens revenue growth and 20%-plus EPS growth for the next several years.  Get the PYPL Stock Research Report.",
    "RBC Capital sees a long runway for Apple (NASDAQ: AAPL ) stock.",
    "\"We think AAPL could be a major beneficiary of AI and VR/AR-related trends, which could generate significant tailwinds for its services business,\" it writes. It notes that the latest iPhones are equipped with the ability to recognize patterns, make predictions and learn from experiences.",
    "What's even more interesting is that by 2025 we could be looking at the first real \"iPhone generation.\" 2025 is 18 years from the launch of the first iPhone.",
    "For people who grew up with iOS devices, Apple could have data on every app a person installed, on every flight, book and purchase, as well as academic records, health statistics, family background and more.",
    "Now imagine an AI trained on this data set. \"This AI would truly be a 'personal' assistant. A hyper-customized neural network that would be so powerful, it would make an existing services pool very strong and usher in a host of new offerings that can only be imagined\" says the firm. Get the AAPL Stock Research Report.",
    "That makes this one of the best stocks to buy in the chip sector is that it is pretty much a guaranteed winner of future tech trends. Someone needs to design AI chips and that someone is Synopsys (NASDAQ: SNPS ).",
    "Synopsys is essentially an \"arms dealer\" for AI and all things chip related says RBC Capital.",
    "\"By helping design complex chips, Synopsys is in the thick of AI in terms of design,\" the firm writes. And the best part is that it doesn't even matter what new companies come along they will still need Synopsys.",
    "\"As new and existing companies continue to push the edge of technology, Synopsys will be helping the companies design each chip regardless of it being a GPU, CPU, FPGA, Digital Chip, Analog chip or otherwise\" the firm explains.",
    "Even now, the stock looks bullish with a \"strong buy\" analyst consensus and $109 average analyst price target.  Get the SNPS Stock Research Report.",
    "One of the great secondary chip stocks to buy is Micron  (NASDAQ: MU ). All future trends result in data creation and Micron is perfectly positioned for this with its DRAM/NAND memory portfolio.",
    "\"The incredible amount of data generated by AI, AR/VR and autonomous driving would require significantly higher memory, both NAND and DRAM, leading to strong and long-term tailwinds for MU\" writes RBC Capital.",
    "Plus we could be looking at a compelling entry point. Indeed, Deutsche Bank's Sidney Ho ( Track Record & Ratings ) points out that shares appear cheaper right now. He has just reiterated his \"buy\" rating with a $60 price target.",
    "And the tech stock still retains its \"moderate buy\" analyst consensus rating. This is with a $54 price target. Get the MU Stock Research Report.",
    "Last but not least, make sure to make room for Microsoft  (NASDAQ: MSFT ). This is a company that ticks all the boxes when it comes to the best stocks to buy for future trends",
    "\"Leading hyperscale hybrid cloud platform with big runway of growth in AI, IoT, Gaming and other services\" explains RBC on the stock's inclusion in its 2025 portfolio.",
    "Like GOOGL and AMZN, MSFT stock benefits from 1) massive amounts of raw compute power; 2) large data sets; and 3) ability to hire the smartest data scientists on the planet.",
    "It picks Microsoft as the No. 1 AI company in the public cloud space. This is thanks to the company's rapidly growing Azure cloud platform.",
    "\"We believe Microsoft is in an enviable position vs other public cloud competitors as their customers can also leverage AI and ML capabilities on premise, something [Amazon's] AWS and [Google's] GCP can't deliver natively,\" said RBC Capital.",
    "Also note the stock's killer \"strong buy\" rating with 20 out of 21 analysts bullish on the stocks prospects. Top this off with a $142 average analyst price target for upside of 17% and I would say Microsoft is one of the most appealing tech stocks to buy and hold onto! Get the MSFT Stock Research Report.",
    "TipRanks.com offers exclusive insights for investors by focusing on the moves of experts: Analysts, Insiders, Bloggers, Hedge Fund Managers and more. See what the experts are saying about your stocks now at  TipRanks.com . As of this writing, Harriet Lefton did not hold a position in any of the aforementioned securities.",
    "The post 10 Tech Stocks to Buy Now for 2025 appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 07:28:15"
}