{
  "url": "https://www.nasdaq.com/article/why-a-huge-price-target-cut-was-actually-good-news-for-this-beaten-down-pot-stock-cm1207385",
  "title": "Why a Huge Price-Target Cut Was Actually Good News for This Beaten-Down Pot Stock - Nasdaq.com",
  "text": [
    " Like it or not, the opinions of major investment analysts   influence stocks tremendously. So when a top analyst slashes a   one-year price target for a stock by a whopping 60%, it's usually   very bad news. That's exactly what happened earlier this week with   Tilray    (NASDAQ: TLRY) . Cowen analyst Vivien Azer cut her price target   for the beaten-down pot stock from $150 to $60. You might think   that Tilray's shares would have tanked on the news. Nope. Instead   the Canadian cannabis stock soared 17% on Tuesday (although it   gave up some of those gains on Wednesday). Why was a huge   price-target cut actually good news for Tilray?   Image source: Getty Images.makeArticleAd();  A positive negative Probably the biggest reason investors received Azer's downward   price-target revision so well is that it still represents a huge   upside for Tilray. The stock would have to roughly double from   its current price to reach Azer's $60 price target. The Cowen analyst's negative action with the price-target cut   still reflects a very positive outlook for Tilray. However, the   Canadian cannabis producer hasn't had much positive going on for   it lately. After Tilray started off the year with a big gain, its   shares plunged more than 60% prior to Tuesday's bounce. Part of Tilray's problem has been a general malaise for   Canadian cannabis stocks. However, Tilray's own lackluster   financial performance hasn't helped. The company reported   sizzling revenue growth in   its second-quarter results    , but its net loss came in much worse than expected. A key   culprit was the company's huge debt burden, fueled partially by   its acquisition earlier this year of hemp foods maker Manitoba   Harvest. Azer's slashing of her price target for Tilray indicates that   she acknowledges the position the stock is in now. She wrote to   investors that Tilray has arguably \"been the most impacted by   weak industry supply as its asset-light model was initially   overly reliant on third-party supply.\" However, this doesn't change her fundamental view of Tilray's   prospects. She thinks that Tilray is a buy after its major   pullback. The bigger picture Why is Vivien Azer still bullish on Tilray? The steps the   company has taken to increase its production capacity are a major   factor. One of the main challenges for Tilray and several of its   peers has been related to supply shortages. But with Tilray   prioritizing its efforts to boost capacity, it's now in better   shape than before. Azer also noted to investors that the entire Canadian cannabis   industry has been held back by too few retail stores. That   problem is also being alleviated to some extent as key provinces   clear the way for more cannabis retail stores to open. The Cowen analyst's note to investors mentioned \"a lack of   novel products\" as an issue as well. But that's about to change   with the launch of the cannabis derivatives market in Canada.   Tilray CEO Brendan Kennedy   said in the company's Q2 conference call    that Tilray will be ready to roll out \"a broad-based portfolio of   brands and new innovative cannabis products and formats including   vapes, edibles, oral strips, topicals, and beverages\" later this   year. In addition to these Canadian opportunities, Azer thinks that   Tilray remains well positioned in international markets. The   company's Portugal facility gives it a great springboard for the   entire European medical cannabis and CBD market. Azer believes   that Tilray should win in the U.S. CBD market as well. Is Azer right? Not everyone agrees with Vivien Azer. Vertical Group   analyst Gordon Johnson thinks that   Tilray is headed for a massive meltdown    . Johnson's price target for the stock is only $4, a far cry from   Azer's $60. On the other hand, Benchmark's Michael Hickey is more   optimistic about Tilray than Azer is, with a one-year price   target of $80. My view about Tilray is less sunny than Azer's or Hickey's,   but it's not nearly as gloomy as Gordon Johnson's prediction of   near-total collapse. I think that Tilray should achieve some   level of success in the soon-to-be-expanded Canadian adult-use   recreational market as well as in international markets,   including the U.S. CBD market. However, I remain concerned about   Tilray's spending, its debt, and its increasingly precarious cash   position. I expect Tilray shares to rise, but I wouldn't go so far as to   recommend the stock as one to buy, as Vivien Azer does. My take   is that one's odds of success with   investing in marijuana stocks    improve if one picks only the best and brightest in the industry.   There are other stocks, in my opinion, that meet those criteria   better than Tilray does.   Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.         And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018. And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution. Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks. Simply click here to get the full story now.  Learn more   ",
    "Like it or not, the opinions of major investment analysts   influence stocks tremendously. So when a top analyst slashes a   one-year price target for a stock by a whopping 60%, it's usually   very bad news.",
    "That's exactly what happened earlier this week with   Tilray    (NASDAQ: TLRY) . Cowen analyst Vivien Azer cut her price target   for the beaten-down pot stock from $150 to $60. You might think   that Tilray's shares would have tanked on the news. Nope. Instead   the Canadian cannabis stock soared 17% on Tuesday (although it   gave up some of those gains on Wednesday). Why was a huge   price-target cut actually good news for Tilray?",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Probably the biggest reason investors received Azer's downward   price-target revision so well is that it still represents a huge   upside for Tilray. The stock would have to roughly double from   its current price to reach Azer's $60 price target.",
    "The Cowen analyst's negative action with the price-target cut   still reflects a very positive outlook for Tilray. However, the   Canadian cannabis producer hasn't had much positive going on for   it lately. After Tilray started off the year with a big gain, its   shares plunged more than 60% prior to Tuesday's bounce.",
    "Part of Tilray's problem has been a general malaise for   Canadian cannabis stocks. However, Tilray's own lackluster   financial performance hasn't helped. The company reported   sizzling revenue growth in   its second-quarter results    , but its net loss came in much worse than expected. A key   culprit was the company's huge debt burden, fueled partially by   its acquisition earlier this year of hemp foods maker Manitoba   Harvest.",
    "Azer's slashing of her price target for Tilray indicates that   she acknowledges the position the stock is in now. She wrote to   investors that Tilray has arguably \"been the most impacted by   weak industry supply as its asset-light model was initially   overly reliant on third-party supply.\"",
    "However, this doesn't change her fundamental view of Tilray's   prospects. She thinks that Tilray is a buy after its major   pullback.",
    "Why is Vivien Azer still bullish on Tilray? The steps the   company has taken to increase its production capacity are a major   factor. One of the main challenges for Tilray and several of its   peers has been related to supply shortages. But with Tilray   prioritizing its efforts to boost capacity, it's now in better   shape than before.",
    "Azer also noted to investors that the entire Canadian cannabis   industry has been held back by too few retail stores. That   problem is also being alleviated to some extent as key provinces   clear the way for more cannabis retail stores to open.",
    "The Cowen analyst's note to investors mentioned \"a lack of   novel products\" as an issue as well. But that's about to change   with the launch of the cannabis derivatives market in Canada.   Tilray CEO Brendan Kennedy   said in the company's Q2 conference call    that Tilray will be ready to roll out \"a broad-based portfolio of   brands and new innovative cannabis products and formats including   vapes, edibles, oral strips, topicals, and beverages\" later this   year.",
    "In addition to these Canadian opportunities, Azer thinks that   Tilray remains well positioned in international markets. The   company's Portugal facility gives it a great springboard for the   entire European medical cannabis and CBD market. Azer believes   that Tilray should win in the U.S. CBD market as well.",
    "Not everyone agrees with Vivien Azer. Vertical Group   analyst Gordon Johnson thinks that   Tilray is headed for a massive meltdown    . Johnson's price target for the stock is only $4, a far cry from   Azer's $60. On the other hand, Benchmark's Michael Hickey is more   optimistic about Tilray than Azer is, with a one-year price   target of $80.",
    "My view about Tilray is less sunny than Azer's or Hickey's,   but it's not nearly as gloomy as Gordon Johnson's prediction of   near-total collapse. I think that Tilray should achieve some   level of success in the soon-to-be-expanded Canadian adult-use   recreational market as well as in international markets,   including the U.S. CBD market. However, I remain concerned about   Tilray's spending, its debt, and its increasingly precarious cash   position.",
    "I expect Tilray shares to rise, but I wouldn't go so far as to   recommend the stock as one to buy, as Vivien Azer does. My take   is that one's odds of success with   investing in marijuana stocks    improve if one picks only the best and brightest in the industry.   There are other stocks, in my opinion, that meet those criteria   better than Tilray does.",
    "  Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.         And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018. And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution. Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks. Simply click here to get the full story now.  Learn more  ",
    " Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.        ",
    "And make no mistake - it is coming.",
    "Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018.",
    "And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution.",
    "Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks.",
    "Simply click here to get the full story now.",
    " Learn more ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:58:00"
}