{
  "url": "https://www.nasdaq.com/article/should-value-investors-buy-acco-brands-acco-stock-cm1207220",
  "title": "Should Value Investors Buy Acco Brands (ACCO) Stock? - Nasdaq.com",
  "text": [
    " While the proven Zacks Rank places an emphasis on earnings estimates and estimate revisions to find strong stocks, we also know that investors tend to develop their own individual strategies. With this in mind, we are always looking at value, growth, and momentum trends to discover great companies. Looking at the history of these trends, perhaps none is more beloved than value investing. This strategy simply looks to identify companies that are being undervalued by the broader market. Value investors use fundamental analysis and traditional valuation metrics to find stocks that they believe are being undervalued by the market at large. Luckily, Zacks has developed its own Style Scores system in an effort to find stocks with specific traits. Value investors will be interested in the system's \"Value\" category. Stocks with both \"A\" grades in the Value category and high Zacks Ranks are among the strongest value stocks on the market right now. One stock to keep an eye on is Acco Brands (ACCO). ACCO is currently sporting a Zacks Rank of #2 (Buy) and an A for Value. The stock is trading with a P/E ratio of 7.21, which compares to its industry's average of 10.47. Over the past year, ACCO's Forward P/E has been as high as 8.80 and as low as 4.83, with a median of 6.84. Investors should also note that ACCO holds a PEG ratio of 1.03. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. ACCO's PEG compares to its industry's average PEG of 1.38. Over the last 12 months, ACCO's PEG has been as high as 1.10 and as low as 0.48, with a median of 0.68. Another valuation metric that we should highlight is ACCO's P/B ratio of 1.17. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. This company's current P/B looks solid when compared to its industry's average P/B of 2.14. ACCO's P/B has been as high as 1.79 and as low as 0.86, with a median of 1.14, over the past year. Value investors also use the P/S ratio. The P/S ratio is is calculated as price divided by sales. Some people prefer this metric because sales are harder to manipulate on an income statement. This means it could be a truer performance indicator. ACCO has a P/S ratio of 0.45. This compares to its industry's average P/S of 1.26. Finally, investors will want to recognize that ACCO has a P/CF ratio of 5.28. This figure highlights a company's operating cash flow and can be used to find firms that are undervalued when considering their impressive cash outlook. This stock's P/CF looks attractive against its industry's average P/CF of 10.16. Over the past 52 weeks, ACCO's P/CF has been as high as 6.30 and as low as 3.05, with a median of 4.98. These are only a few of the key metrics included in Acco Brands's strong Value grade, but they help show that the stock is likely undervalued right now. When factoring in the strength of its earnings outlook, ACCO looks like an impressive value stock at the moment.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Acco Brands Corporation (ACCO): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "While the proven Zacks Rank places an emphasis on earnings estimates and estimate revisions to find strong stocks, we also know that investors tend to develop their own individual strategies. With this in mind, we are always looking at value, growth, and momentum trends to discover great companies.",
    "Looking at the history of these trends, perhaps none is more beloved than value investing. This strategy simply looks to identify companies that are being undervalued by the broader market. Value investors use fundamental analysis and traditional valuation metrics to find stocks that they believe are being undervalued by the market at large.",
    "Luckily, Zacks has developed its own Style Scores system in an effort to find stocks with specific traits. Value investors will be interested in the system's \"Value\" category. Stocks with both \"A\" grades in the Value category and high Zacks Ranks are among the strongest value stocks on the market right now.",
    "One stock to keep an eye on is Acco Brands (ACCO). ACCO is currently sporting a Zacks Rank of #2 (Buy) and an A for Value. The stock is trading with a P/E ratio of 7.21, which compares to its industry's average of 10.47. Over the past year, ACCO's Forward P/E has been as high as 8.80 and as low as 4.83, with a median of 6.84.",
    "Investors should also note that ACCO holds a PEG ratio of 1.03. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. ACCO's PEG compares to its industry's average PEG of 1.38. Over the last 12 months, ACCO's PEG has been as high as 1.10 and as low as 0.48, with a median of 0.68.",
    "Another valuation metric that we should highlight is ACCO's P/B ratio of 1.17. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. This company's current P/B looks solid when compared to its industry's average P/B of 2.14. ACCO's P/B has been as high as 1.79 and as low as 0.86, with a median of 1.14, over the past year.",
    "Value investors also use the P/S ratio. The P/S ratio is is calculated as price divided by sales. Some people prefer this metric because sales are harder to manipulate on an income statement. This means it could be a truer performance indicator. ACCO has a P/S ratio of 0.45. This compares to its industry's average P/S of 1.26.",
    "Finally, investors will want to recognize that ACCO has a P/CF ratio of 5.28. This figure highlights a company's operating cash flow and can be used to find firms that are undervalued when considering their impressive cash outlook. This stock's P/CF looks attractive against its industry's average P/CF of 10.16. Over the past 52 weeks, ACCO's P/CF has been as high as 6.30 and as low as 3.05, with a median of 4.98.",
    "These are only a few of the key metrics included in Acco Brands's strong Value grade, but they help show that the stock is likely undervalued right now. When factoring in the strength of its earnings outlook, ACCO looks like an impressive value stock at the moment.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:10:10"
}