{
  "url": "https://www.nasdaq.com/article/beware-of-september-market-monsters-cm1207657",
  "title": "Beware of September Market ‘Monsters’ - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Knowing what to expect from the markets over the next few months can help you remain focused on your investment goals … what history tells us about September",
    "August landed some punches.",
    "The Dow dropped 1.7%. The S&P pulled back 1.8%. And the Nasdaq fell 2.6%. These are the worst August performances for each respective index since 2015.",
    "Should we expect September to bring some relief?",
    "Not if we go by history.",
    "Over the last 50 years, the Dow has been positive in September only 36% of the time. The average decline during the month has been a shade under 1%.",
    "Yesterday, the markets picked up on this September tradition with the Dow dropping 285 points.",
    "But we don't believe the \"sky is falling.\"",
    "Yes, there are reasons to believe the market is nearing or perhaps already in a slow, transition stage. And yes, there are reasons to believe that tomorrow's market conditions will be more challenging than those we've enjoyed over the last decade.",
    "At the same time, this transition could take many months - possibly years - to play out. Meanwhile, history suggests the U.S. stock market could be in for a significant push higher.",
    "So, we're in a \"murky\" market at the moment. This murkiness can raise anxiety and make investors even more likely to make kneejerk, self-defeating, market decisions that may not align with their long-term goals.",
    "Think about it this way … When you're watching a scary movie for the first time and the monster jumps out from behind the door, you leap up in your seat, right?",
    "But let's say you've watched this same movie 15 times. In this case, there's no murkiness, no anxiety. You know what's coming. When the monster leaps out, you barely bat an eyelash.",
    "Having an expectation of what's coming makes a big difference.",
    "This is especially helpful in the markets. When it comes to investing, there are all sorts of monsters waiting to jump out from behind doors. When they do, in a market such as the one we're in today, lots of unprepared investors run away in fear. This often means selling at the wrong time - reactive investing at its worst, the \"kneejerk\" decisions I just referenced, which tend to derail long-term investment goals.",
    "But if you're an investor who has an idea as to what's coming … if you generally know what the monsters are and when they might leap out of the shadows, you're more likely to make wise, proactive market decisions.",
    "In today's  Digest , let's look at three monsters that are out there lurking. By doing this, we'll replace white-knuckled anxiety with measured forethought so that if a monster does leap out, we can remain focused on our long-term investment goals.",
    "***September could be just as bumpy as August",
    "Let's put it simply - September could be rocky for the markets. Case in point, yesterday's 1% drop in the Dow.",
    "These losses were attributed to fresh data showing the manufacturing sector contracted in August, as well as additional saber-rattling from Trump on the trade war.",
    "The risk is that investors will interpret this volatility as indicative of a bear market's arrival, and will therefore make market decisions that are counterproductive to their long-term goals.",
    "So, let's look directly at this potential for September volatility … and historically, what comes after, so that you're prepared.",
    "MoneyChimp  has a fun calculator tool that uses sixty-odd years of S&P 500 data to look at average stock returns by month. How does September shape up?",
    "From  MoneyChimp :",
    "September is the \"danger\" month, with an overall negative return.",
    "So, yes, we're entering - literally - the worst month for stocks, according to historical data. It's the only month that averages a losing number.",
    "But averages can hide many data points that buck the trend. So, what about  this  September in particular? Any reason to believe it might post a better number than usual?",
    "Not according to James Paulsen - he's the chief investment strategist at the Leuthold Group. Last week, he published a report suggesting that returns in September are likely to be rough. Why?",
    "Well, Paulsen's study found that over the last 50 years, the direction of the stock market, bond yields, and M2 Money Supply have all had \"significant bearing\" on returns for stocks in September. And right now, two of those indicators are pointing south.",
    "Specifically, the S&P has been posting below-average numbers in recent months. This suggests \"a below-average September is on the horizon,\" according to Paulsen in his report.",
    "The second negative indicator is bond yields. Paulsen writes that plunging bond yields in recent months bode poorly for September.",
    "(We won't dive into M2 Money Supply since it's not relevant to our broader point, and would take longer to detail.)",
    "So, history and Paulsen suggest September could be rocky. But to be fair, let's look at what historical returns say for the final three months of the year.",
    "Returning to the same  MoneyChimp  calculator from above, October has historically produced 42 up years compared with 27 down years, for an average gain of 0.66%. November saw 46 up years with just 23 down years for a 1.39% gain. And December comes in at 51 up years relative to only 18 downs years for a 1.35% gain.",
    "So, if we do experience turbulence in September, it's to be expected. The monster will probably jump out from behind the door this month. But keep it in perspective. It should not immediately be interpreted as \"the market is finally turning over\" since, going by straight historical averages, it's normal, and the markets should bounce back as the year closes out.",
    "\r\n ***Why the \"recession\" and \"yield curve\" monsters aren't likely to jump out at us anytime soon",
    "The press has had a field day with the recent yield curve inversion, as well as talks of a looming recession. But last week, our own Matt McCall, editor of  Investment Opportunities , provided a balanced perspective on these issues.",
    "First, Matt tackled the belief that a global recession is imminent.",
    "He started by pointing toward a recent survey by  The Wall Street Journal showing a high number of economists expecting a recession in the next 12 months. About one-third of economists predict a recession in the next year.",
    "Matt reminds readers that a recession is two consecutive quarters of a contracting economy measured by negative GDP growth.",
    "Are we close to being negative? Well, the latest GDP reading from the second quarter shows 2.1%  growth . So, there would have to be a big and sudden drop for a recession to occur.",
    "But what about those economists predicting a recession?",
    "From Matt:",
    "Let me see if I can put this nicely. Economists are some of the absolute worst predictors of recessions - or really anything to do with the economy. Think of them like your local meteorologists. When you turn on the television and the forecasters tell you it will rain today - and it is already raining outside! - it's pretty obvious. Crazy enough, economists CANNOT even do that.",
    "A 2018 study by Prakah Loungani and two others looked at 153 recessions in 63 countries from 1992 to 2014. Only five - just 3% - were predicted by April of the preceding year. Since 1998, the International Monetary Fund (IMF) has never predicted a recession in a developed country with a lead of anything more than a few months.",
    "But what about the other monster - the yield curve? Is the inverted yield curve a sign that a recession and bear market are imminent?",
    "Back to Matt:",
    "This could not be any further from the truth! … Since 1978, a recession historically will not occur after an inversion for another 21.3 months - nearly two years. The more important stat the media overlooks - either due to lack of knowledge or intentionally - is that one year after the reversion occurs, the market is almost always higher. And by a big margin! Over the last four decades, the stock market has been up 20% on average one year after the 2/10 yield curve inverts.",
    "If this trend continues, that would put the S&P 500 near 3,500!",
    "As we wrap up, yes, the market has challenges - the never-ending trade war with China as the most glaring. But \"worry\" is the name of the game when it comes to investing. So, our challenge is to separate those issues that truly deserve our emotional energy from those that are phantoms, or not immediate threats.",
    "September volatility is a phantom. Expect it. If it comes, it does not automatically mean that the bull market is over.",
    "As to the yield curve inversion and a recession, these are real monsters, but the odds suggest they're lurking further out in time. Before they arrive, we're likely in for more market gains.",
    "We'll continue to keep you up to speed.",
    "Have a good evening,",
    "Jeff Remsburg",
    "The post Beware of September Market 'Monsters' appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:45:58"
}