{
  "url": "https://www.nasdaq.com/article/why-ulta-beauty-stock-lost-32-in-august-cm1207109",
  "title": "Why Ulta Beauty Stock Lost 32% in August - Nasdaq.com",
  "text": [
    " What happened  Ulta Beauty    (NASDAQ: ULTA) stock trailed the market by a wide margin last   month by shedding 32% compared to a 2% decrease in the   S&P 500    , according to data provided by      S&P Global Market Intelligence    . The slump pushed shares, which had been comfortably ahead of   the market's 16% increase in 2019, to modest losses on the   year.   Image source: Getty Images.makeArticleAd();  So what The August decline was sparked by the   consumer products    specialist's second-quarter earnings report. Ulta managed solid   sales growth and steady profitability. However, management noted   that the core makeup category that comprises over half of its   sales isn't rebounding as executives had hoped it would. As a   result, Ulta reduced its outlook on both the top and bottom   lines. Now what CEO Mary Dillon and her team   expressed confidence    that the makeup niche will recover, but likely not until 2020 at   the earliest. Without healthy growth in this segment, it will be   hard for Ulta Beauty to return to its prior pace of   comparable-store sales gains of around 8% to 10% and increasing   operating margin. Thus, investors have scaled back their   expectations for the salon and beauty products retailer.   10 stocks we like better than Ulta Beauty       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Ulta Beauty wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Demitrios Kalogeropoulos      has no position in any of the stocks mentioned. The Motley Fool     recommends Ulta Beauty. The Motley Fool has a     disclosure policy      .  ",
    " Ulta Beauty    (NASDAQ: ULTA) stock trailed the market by a wide margin last   month by shedding 32% compared to a 2% decrease in the   S&P 500    , according to data provided by      S&P Global Market Intelligence    .",
    "The slump pushed shares, which had been comfortably ahead of   the market's 16% increase in 2019, to modest losses on the   year.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "The August decline was sparked by the   consumer products    specialist's second-quarter earnings report. Ulta managed solid   sales growth and steady profitability. However, management noted   that the core makeup category that comprises over half of its   sales isn't rebounding as executives had hoped it would. As a   result, Ulta reduced its outlook on both the top and bottom   lines.",
    "CEO Mary Dillon and her team   expressed confidence    that the makeup niche will recover, but likely not until 2020 at   the earliest. Without healthy growth in this segment, it will be   hard for Ulta Beauty to return to its prior pace of   comparable-store sales gains of around 8% to 10% and increasing   operating margin. Thus, investors have scaled back their   expectations for the salon and beauty products retailer.",
    "  10 stocks we like better than Ulta Beauty       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Ulta Beauty wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Ulta Beauty       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Ulta Beauty wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Demitrios Kalogeropoulos      has no position in any of the stocks mentioned. The Motley Fool     recommends Ulta Beauty. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 07:51:00"
}