{
  "url": "https://www.nasdaq.com/article/is-barrett-business-services-bbsi-a-great-value-stock-right-now-cm1210355",
  "title": "Is Barrett Business Services (BBSI) a Great Value Stock Right Now? - Nasdaq.com",
  "text": [
    " Here at Zacks, we focus on our proven ranking system, which places an emphasis on earnings estimates and estimate revisions, to find winning stocks. But we also understand that investors develop their own strategies, so we are constantly looking at the latest trends in value, growth, and momentum to find strong companies for our readers. Looking at the history of these trends, perhaps none is more beloved than value investing. This strategy simply looks to identify companies that are being undervalued by the broader market. Value investors use tried-and-true metrics and fundamental analysis to find companies that they believe are undervalued at their current share price levels. Zacks has developed the innovative Style Scores system to highlight stocks with specific traits. For example, value investors will be interested in stocks with great grades in the \"Value\" category. When paired with a high Zacks Rank, \"A\" grades in the Value category are among the strongest value stocks on the market today. One company value investors might notice is Barrett Business Services (BBSI). BBSI is currently holding a Zacks Rank of #2 (Buy) and a Value grade of A. The stock has a Forward P/E ratio of 14.62. This compares to its industry's average Forward P/E of 22.98. Over the past 52 weeks, BBSI's Forward P/E has been as high as 16.43 and as low as 10.05, with a median of 13.85. Investors should also recognize that BBSI has a P/B ratio of 4.68. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. This stock's P/B looks solid versus its industry's average P/B of 8.02. Over the past 12 months, BBSI's P/B has been as high as 6.29 and as low as 3.45, with a median of 4.72. Value investors also frequently use the P/S ratio. This metric is found by dividing a stock's price with the company's revenue. This is a popular metric because sales are harder to manipulate on an income statement, so they are often considered a better performance indicator. BBSI has a P/S ratio of 0.69. This compares to its industry's average P/S of 0.92. Finally, our model also underscores that BBSI has a P/CF ratio of 12.98. This metric focuses on a firm's operating cash flow and is often used to find stocks that are undervalued based on the strength of their cash outlook. This stock's P/CF looks attractive against its industry's average P/CF of 14.76. Over the past 52 weeks, BBSI's P/CF has been as high as 16.90 and as low as 10.03, with a median of 12.72. Value investors will likely look at more than just these metrics, but the above data helps show that Barrett Business Services is likely undervalued currently. And when considering the strength of its earnings outlook, BBSI sticks out at as one of the market's strongest value stocks.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Barrett Business Services, Inc. (BBSI): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Here at Zacks, we focus on our proven ranking system, which places an emphasis on earnings estimates and estimate revisions, to find winning stocks. But we also understand that investors develop their own strategies, so we are constantly looking at the latest trends in value, growth, and momentum to find strong companies for our readers.",
    "Looking at the history of these trends, perhaps none is more beloved than value investing. This strategy simply looks to identify companies that are being undervalued by the broader market. Value investors use tried-and-true metrics and fundamental analysis to find companies that they believe are undervalued at their current share price levels.",
    "Zacks has developed the innovative Style Scores system to highlight stocks with specific traits. For example, value investors will be interested in stocks with great grades in the \"Value\" category. When paired with a high Zacks Rank, \"A\" grades in the Value category are among the strongest value stocks on the market today.",
    "One company value investors might notice is Barrett Business Services (BBSI). BBSI is currently holding a Zacks Rank of #2 (Buy) and a Value grade of A. The stock has a Forward P/E ratio of 14.62. This compares to its industry's average Forward P/E of 22.98. Over the past 52 weeks, BBSI's Forward P/E has been as high as 16.43 and as low as 10.05, with a median of 13.85.",
    "Investors should also recognize that BBSI has a P/B ratio of 4.68. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. This stock's P/B looks solid versus its industry's average P/B of 8.02. Over the past 12 months, BBSI's P/B has been as high as 6.29 and as low as 3.45, with a median of 4.72.",
    "Value investors also frequently use the P/S ratio. This metric is found by dividing a stock's price with the company's revenue. This is a popular metric because sales are harder to manipulate on an income statement, so they are often considered a better performance indicator. BBSI has a P/S ratio of 0.69. This compares to its industry's average P/S of 0.92.",
    "Finally, our model also underscores that BBSI has a P/CF ratio of 12.98. This metric focuses on a firm's operating cash flow and is often used to find stocks that are undervalued based on the strength of their cash outlook. This stock's P/CF looks attractive against its industry's average P/CF of 14.76. Over the past 52 weeks, BBSI's P/CF has been as high as 16.90 and as low as 10.03, with a median of 12.72.",
    "Value investors will likely look at more than just these metrics, but the above data helps show that Barrett Business Services is likely undervalued currently. And when considering the strength of its earnings outlook, BBSI sticks out at as one of the market's strongest value stocks.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:10:11"
}