{
  "url": "https://www.nasdaq.com/article/oil-prices-rise-after-us-confirms-trade-talks-with-china-to-start-20190904-01245",
  "title": "Oil prices rise after U.S. confirms trade talks with China to start - Nasdaq.com",
  "text": [
    "By Aaron Sheldrick",
    "TOKYO, Sept 5 (Reuters) - Oil prices rose on Thursday, rebounding from earlier losses, after the U.S. confirmed that talks with China to reach a trade agreement would be held in the coming weeks, giving hope that a dispute that has roiled global economies will be resolved.",
    "The gains add to a surge in prices on Wednesday that had been driven by a survey showing activity in China's services sector expanded at the fastest pace in three months in August, as new orders rose in the world's second-biggest consumer of oil. ",
    "West Texas Intermediate (WTI) was up 17 cents, or 0.3%, at $56.43 a barrel, having risen 4.3% the previous session, the biggest percentage gain in nearly two months.",
    "Both contracts were lower earlier in the Asian trading session after data late on Wednesday from the American Petroleum Institute (API) showed U.S. crude stocks rose last week, against expectations of a decline.",
    "U.S. Trade Representative (USTR) Robert Lighthizer and Treasury Secretary Steven Mnuchin spoke with Chinese Vice Premier Liu He and agreed to hold ministerial-level trade talks in Washington \"in the coming weeks\", a USTR spokesman said late on Wednesday.",
    "Shortly after in Beijing, China's commerce ministry said the talks would be held and \"both sides agreed that they should work together and take practical actions to create good conditions for consultations.\"",
    "As the trade war between the United States and China has rumbled on into a second year, evidence has been mounting that economies worldwide are being hit, prompting downgrades of oil demand growth expectations.",
    "BP Plc's  Chief Financial Officer Brian Gilvary told Reuters on Wednesday that global oil demand is expected to grow by less than 1 million barrels per day in 2019 as consumption slows. ",
    "Still, supply looks set to stay constrained as Russian officials and sources from the Organization of the Petroleum Exporting Countries (OPEC) indicated the countries remain committed to an agreement to rein in production to support prices. ",
    "Crude inventories in the United States rose by 401,000 barrels in the week ended Aug. 30 to 429.1 million, compared with analysts' expectations for a decrease of 2.5 million barrels.",
    "Crude stocks at the Cushing, Oklahoma, delivery hub fell by 238,000 barrels, while refinery crude runs fell by 306,000 barrels per day, API said.",
    "TECHNICAL CHART: U.S. oil to retest resistance at $65.96L3N25W0SF",
    "TECHNICAL CHART: Brent oil may gain more to $62.54L3N25W0AM"
  ],
  "published_datetime": "2019-09-04 11:22:00"
}