{
  "url": "https://www.nasdaq.com/article/mallinckrodt-mnk-down-541-since-last-earnings-report-can-it-rebound-cm1208037",
  "title": "Mallinckrodt (MNK) Down 54.1% Since Last Earnings Report: Can It Rebound? - Nasdaq.com",
  "text": [
    " It has been about a month since the las t earnings  report for Mallinckrodt (MNK). Shares have lost about 54.1% in that time frame, underperforming the S&P 500. Will the recent negative trend continue leading up to its next earnings release, or is Mallinckrodt due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important catalysts.  Mallinckrodt Q2 Earnings Beat  Mallinckrod t report  ed adjusted earnings of $2.53 per share in the quarter, up from the year-ago quarter's $2.16. Also, the bottom line beat the Zacks Consensus Estimate of $2.10. Net sales in the quarter came in at $823.3 million, down 0.2% year over year. The figure missed the Zacks Consensus Estimate of $824 million.  Quarter in Detail  The company now operates two reportable segments aligned to the previously-announced separation - the Specialty Brands and the Specialty Generics. Specialty Brands sales came in at $627.8 million, down 0.6% year over year. Acthar, Mallinckrodt's largest product, generated sales of $266.4 million, down 9.1% year over year primarily due to continued reimbursement challenges impacting new and returning patients, and continued payer scrutiny on overall specialty pharmaceutical spending. Inomax, the company's second-largest product, generated sales of $139.7 million, up 6.6%, driven by continued demand and contract renewals. Ofirmev sales increased 5.7% year over year to $90.5 million, owing to strong demand and order timing. Sales of the Therakos immunology platform were $60.9 million, up 7.2% owing to growth in the United States. Specialty Generics sales amounted to $195.5 million, up 0.9%, driven by the recapture of market share. Adjusted selling, general and administrative expenses in the quarter were $208.6 million, down from $215.8 million in the year-ago quarter. Research and development expenses decreased from $92.6 million to $79.6 million, owing to timing of certain developmental milestone payments in the prior year.  Update on Specialty Generics Separation  In December 2018, the company announced that it intends to spin-off the Specialty Generics business into a new company. However, based on current market conditions and developments, including increasing uncertainties regarding the opioid litigation, the company has shelved this plan for now. Mallinckrodt continues to evaluate a range of options for the separation of the Specialty Generics business.  Guidance Update  Specialty Brands sales are expected to be down 5% to up 1%. The company continues to expect the hospital products to collectively achieve high-single-digit net sales growth for the year. Given the current market uncertainties, the company now believes Acthar Gel net sales for 2019 are unlikely to exceed $1 billion. Total sales for Specialty Generics are expected to increase 2-5%. Earnings per share are now projected to be $8.40-$8.70, up from the previous projection of $8.30-$8.60.     How Have Estimates Been Moving Since Then?  In the past month, investors have witnessed a downward trend in estimates review.  VGM Scores  Currently, Mallinckrodt has a strong Growth Score of A, a grade with the same score on the momentum front. Following the exact same course, the stock was allocated a grade of A on the value side, putting it in the top 20% for this investment strategy. Overall, the stock has an aggregate VGM Score of A. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending downward for the stock, and the magnitude of this revision indicates a downward shift. Notably, Mallinckrodt has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.   makeArticleAd();  Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Mallinckrodt public limited company (MNK): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "It has been about a month since the las t earnings  report for Mallinckrodt (MNK). Shares have lost about 54.1% in that time frame, underperforming the S&P 500.",
    "Will the recent negative trend continue leading up to its next earnings release, or is Mallinckrodt due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important catalysts.  Mallinckrodt Q2 Earnings Beat  Mallinckrod t report  ed adjusted earnings of $2.53 per share in the quarter, up from the year-ago quarter's $2.16. Also, the bottom line beat the Zacks Consensus Estimate of $2.10. Net sales in the quarter came in at $823.3 million, down 0.2% year over year. The figure missed the Zacks Consensus Estimate of $824 million.  Quarter in Detail  The company now operates two reportable segments aligned to the previously-announced separation - the Specialty Brands and the Specialty Generics. Specialty Brands sales came in at $627.8 million, down 0.6% year over year. Acthar, Mallinckrodt's largest product, generated sales of $266.4 million, down 9.1% year over year primarily due to continued reimbursement challenges impacting new and returning patients, and continued payer scrutiny on overall specialty pharmaceutical spending. Inomax, the company's second-largest product, generated sales of $139.7 million, up 6.6%, driven by continued demand and contract renewals. Ofirmev sales increased 5.7% year over year to $90.5 million, owing to strong demand and order timing. Sales of the Therakos immunology platform were $60.9 million, up 7.2% owing to growth in the United States. Specialty Generics sales amounted to $195.5 million, up 0.9%, driven by the recapture of market share. Adjusted selling, general and administrative expenses in the quarter were $208.6 million, down from $215.8 million in the year-ago quarter. Research and development expenses decreased from $92.6 million to $79.6 million, owing to timing of certain developmental milestone payments in the prior year.  Update on Specialty Generics Separation  In December 2018, the company announced that it intends to spin-off the Specialty Generics business into a new company. However, based on current market conditions and developments, including increasing uncertainties regarding the opioid litigation, the company has shelved this plan for now. Mallinckrodt continues to evaluate a range of options for the separation of the Specialty Generics business.  Guidance Update  Specialty Brands sales are expected to be down 5% to up 1%. The company continues to expect the hospital products to collectively achieve high-single-digit net sales growth for the year. Given the current market uncertainties, the company now believes Acthar Gel net sales for 2019 are unlikely to exceed $1 billion. Total sales for Specialty Generics are expected to increase 2-5%. Earnings per share are now projected to be $8.40-$8.70, up from the previous projection of $8.30-$8.60.   ",
    " Mallinckrodt Q2 Earnings Beat ",
    "Mallinckrod t report  ed adjusted earnings of $2.53 per share in the quarter, up from the year-ago quarter's $2.16. Also, the bottom line beat the Zacks Consensus Estimate of $2.10.",
    "Net sales in the quarter came in at $823.3 million, down 0.2% year over year.",
    "The figure missed the Zacks Consensus Estimate of $824 million.",
    " Quarter in Detail ",
    "The company now operates two reportable segments aligned to the previously-announced separation - the Specialty Brands and the Specialty Generics.",
    "Specialty Brands sales came in at $627.8 million, down 0.6% year over year.",
    "Acthar, Mallinckrodt's largest product, generated sales of $266.4 million, down 9.1% year over year primarily due to continued reimbursement challenges impacting new and returning patients, and continued payer scrutiny on overall specialty pharmaceutical spending.",
    "Inomax, the company's second-largest product, generated sales of $139.7 million, up 6.6%, driven by continued demand and contract renewals. Ofirmev sales increased 5.7% year over year to $90.5 million, owing to strong demand and order timing.",
    "Sales of the Therakos immunology platform were $60.9 million, up 7.2% owing to growth in the United States.",
    "Specialty Generics sales amounted to $195.5 million, up 0.9%, driven by the recapture of market share.",
    "Adjusted selling, general and administrative expenses in the quarter were $208.6 million, down from $215.8 million in the year-ago quarter. Research and development expenses decreased from $92.6 million to $79.6 million, owing to timing of certain developmental milestone payments in the prior year.",
    " Update on Specialty Generics Separation ",
    "In December 2018, the company announced that it intends to spin-off the Specialty Generics business into a new company. However, based on current market conditions and developments, including increasing uncertainties regarding the opioid litigation, the company has shelved this plan for now. Mallinckrodt continues to evaluate a range of options for the separation of the Specialty Generics business.",
    " Guidance Update ",
    "Specialty Brands sales are expected to be down 5% to up 1%. The company continues to expect the hospital products to collectively achieve high-single-digit net sales growth for the year. Given the current market uncertainties, the company now believes Acthar Gel net sales for 2019 are unlikely to exceed $1 billion. Total sales for Specialty Generics are expected to increase 2-5%. Earnings per share are now projected to be $8.40-$8.70, up from the previous projection of $8.30-$8.60.  ",
    " How Have Estimates Been Moving Since Then? ",
    "In the past month, investors have witnessed a downward trend in estimates review.",
    " VGM Scores ",
    "Currently, Mallinckrodt has a strong Growth Score of A, a grade with the same score on the momentum front. Following the exact same course, the stock was allocated a grade of A on the value side, putting it in the top 20% for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of A. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending downward for the stock, and the magnitude of this revision indicates a downward shift. Notably, Mallinckrodt has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:31:28"
}