{
  "url": "https://www.nasdaq.com/article/nzs-synlait-milk-posts-record-fy-results-on-strong-infant-formula-sales-20190911-00851",
  "title": "NZ's Synlait Milk posts record FY results on strong infant formula sales - Nasdaq.com",
  "text": [
    "By Niyati Shetty",
    "Sept 12 (Reuters) - New Zealand'sSynlait Milk  reported a 10% rise in annual net profit on Thursday but fell short of expectations as a revised pricing deal with its branding partner a2 Milk resulted in lower margins . ",
    "Shares in Synlait, which is 39% owned by China'sBright Dairy Holdings, dropped 9.7% to their lowest level in three months.",
    "Synlait posted a record net profit of NZ$82.2 million ($52.7 million) for the 12 months to July 31, up from NZ$74.6 million a year ago. That was below analysts' estimates of NZ$87.6 million, according to Refinitiv data.  ",
    "Volumes of consumer packaged infant formula, the firm's key product, were up 21% to 42,907 tonnes for the year.",
    "Synlait last year extended its supply deal with a2 Milk by two years, but accepted lower pricing to reflect a \"market-competitive pricing regime\". ",
    "Synlait provides a2 Milk, its second-largest shareholder, with products for its largest markets based in Australia, New Zealand and China. ",
    "A2 Milk also reported lower-than-expected annual profit on the back of higher marketing costs which ate into gains from robust Chinese sales. ",
    "Synlait's revenue rose 17% to NZ$1.02 billion, cracking the billion dollar mark for the first time, but was held back by an increase in premiums Synlait paid out to its milk suppliers under a program that rewards them for using best farming practices.",
    "\"(The result) signals that they need to diversify their income streams,\" said Jeremy Sullivan, investment advisor at Hamilton Hindin Greene. \"Whilst they feel their relationship with a2 Milk is a strength, its also a threat. It does leave them somewhat vulnerable to pricing pressures.\" ",
    "POKENO PROBLEMS",
    "The legal tussle over the facility in Pokeno, in the north of the country's South Island, where Synlait is establishing its second nutritional milk powder is back in court on Oct. 21. ",
    "\"We acknowledge this issue has created uncertainty for shareholders and milk suppliers but are committed to ensuring a reasonable outcome is reached,\" Chief Executive Leon Clement said.",
    "The company said it expects profits to continue to grow in fiscal 2020, with the rate of profitability increasing at least as much as it did in 2019.",
    "\"Investors will still remain relatively positive on the company,\" Sullivan said. \"I don't think the reduction in the share price is overdone, its probably a fair reflection, the market just got a wee bit ahead of themselves.\"",
    "($1 = 1.5591 New Zealand dollars)"
  ],
  "published_datetime": "2019-09-11 05:47:00"
}