{
  "url": "https://www.nasdaq.com/article/better-buy-baker-hughes-vs-helmerich-payne-cm1206729",
  "title": "Better Buy: Baker Hughes vs. Helmerich & Payne - Nasdaq.com",
  "text": [
    "The energy industry can be highly volatile, but energy services companies like Baker Hughes, a GE Company (NYSE: BHGE) and Helmerich & Payne (NYSE: HP) are particularly susceptible to price swings. That's because they sell products and services to oil and natural gas drillers, which often pull back hard on spending when oil prices falter (a relatively frequent occurrence lately). What makes the comparison between Baker Hughes and Helmerich & Payne so interesting, however, has less to do with the oil industry and more to do with the companies themselves. Here's why one of this pair is a much better option than the other today.",
    "Baker Hughes, a GE Company was formed in mid-2017, when GE merged its oil and gas businesses with Baker Hughes. That created a company that can provide products and services to the energy industry across the entire spectrum of the space, including the upstream (drilling), midstream (pipelines), and downstream (chemicals and refining) subsectors. The company actually refers to itself as the world's \"first and only fullstream provider.\"",
    "Image source: Getty Images.",
    "It has a material business, with revenues of $6 billion in the second quarter. Notably, that figure was up 8% year over year. Orders of $6.6 billion were up 9% year over year, as well, suggesting that Baker Hughes is on a solid path. Which is great news, since the company has had a hard time staying in the black since the merger was completed. That's not exactly Baker Hughes' fault; spending in the oil industry has been touch and go because of volatile oil prices . However, profitability does play into the bigger picture here, just a little more indirectly.",
    "That's because General Electric (NYSE: GE) is working through a difficult turnaround effort that hasn't been going particularly well . After the merger of GE's oil and gas business with Baker Hughes, the industrial giant ended up with a 62.5% stake in the combined entity. That's why GE is stuck on the end of Baker Hughes' name. GE has since reduced that stake to a little over 50%, which means it still has a controlling position in Baker Hughes. That stock sale, however, was made at what some believe to be a fire sale price, suggesting that GE was selling out of desperation . With Baker Hughes' shares down roughly 66% since a peak in late 2017, that analysis sounds pretty spot on.",
    "The thing is, GE remains highly leveraged and appears to have a lot of work ahead before its turnaround starts producing material results. Which means that it could decide to sell more Baker Hughes shares to raise cash, if it needs it. Fear of such sales taking place will likely put a damper on Baker Hughes' stock until either there's more clarity at GE (like notably improving earnings) or the company actually sells the shares, which it has promised to do.",
    "BHGE data by YCharts",
    "Baker Hughes, a GE Company is a significant business and has a strong operating history behind it. But most investors should avoid the company until its relationship with GE gets much closer to ending. It will survive the energy industry's current malaise, even if it means bleeding red ink for a bit, but there's no end in sight to the complicated GE story. And that's a risk that's just not worth taking on right now for most investors.",
    "When you compare that situation to Helmerich & Payne, the answer is pretty easy. Like Baker Hughes, Helmerich & Payne has been struggling to adjust to a fast-changing energy landscape. That's meant bottom-line losses. Overall, however, it has done a reasonably good job of dealing with a difficult market . Helmerich & Payne doesn't have the breadth of offerings that Baker Hughes does, but it is a leader in its drilling services niche and will at worst muddle through.",
    "You can be doubly confident of that fact if you take a look at the company's balance sheet . Long-term debt makes up just 10% of Helmerich & Payne's capital structure, making it one of the least leveraged of its closest peers. Moreover, it has the leading market share position in the U.S. onshore space (which is where roughly 90% of its rigs are located), partly because it controls a large portfolio of the most desirable and technically advanced drilling rigs. That's not an accident. Helmerich & Payne has specifically focused on leading the industry in technology, and that's proven to be a successful approach over time. One of the best examples of the company's long-term success is its incredible 46-year history of annual dividend increases. None of its peers comes close to matching that. ",
    "While it may take a strong stomach to buy Helmerich & Payne, given the out-of-favor sector in which it operates, it is one of the better-situated companies in the space. What makes the company a better pick than Baker Hughes, meanwhile, is that Helmerich & Payne is well positioned and it doesn't have a troubled third party in possession of more than half the company's shares. In other words, you can get exposure to an important energy services company without the added risk of a struggling GE.",
    "Helmerich & Payne is the better option here because of the complicated relationship Baker Hughes has with GE. That's not a situation that is going to resolve itself quickly, and it's likely to be a material headwind to the stock until it does actually get resolved. That said, both companies have done a decent job of dealing with the oil industry's current volatility and, frankly, the ups and downs in the space over time, as well. But with a rock-solid balance sheet, leading position in its niche, and no third-party ownership complications, Helmerich & Payne just looks like a safer choice than Baker Hughes today.",
    "10 stocks we like better than Helmerich & Payne\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Helmerich & Payne wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Reuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 07:22:00"
}