{
  "url": "https://www.nasdaq.com/article/enel-kicks-off-sale-of-11-bln-romania-assets-20190905-00896",
  "title": "Enel kicks off sale of $1.1 bln Romania assets - Nasdaq.com",
  "text": [
    "By Stephen Jewkes and Pamela Barbaglia",
    "MILAN/LONDON, Sept 5 (Reuters) - Europe's biggest utility Enel  has kicked off the sale of its operations in Romania in a process led by French bank BNP Paribas  and expected to value the assets at about 1 billion euros ($1.11 billion), sources told Reuters.",
    "Enel is the biggest private investor in energy in Romania where it has been active since 2005 with operations in power distribution and supply as well as renewable energy production.",
    "A spokesman for Enel declined to comment while BNP was not immediately available for comment.",
    "The sale, which is in the early stages, comes as international utilities including Czech firm CEZ , Germany's E.ON  and France'sEngie  are reviewing options for their presence in the country as they struggle to compete with state-backed Hidroelectrica, Romania's largest power producer, one of the sources said. ",
    "\"BNP is now gauging appetite and whether Enel sells all or only part of its business depends on the buyers,\" one of the sources said.",
    "Enel, which controls Spanish utility Endesa , reviews its global businesses on an annual basis through an asset rotation program under which it sells some of its assets to buy others that may offer potentially higher returns.",
    "In recent years it has spent heavily on networks in its key Latin America market where it is currently vying to buy Sempra Energy's assets in Peru and Chile. The sources said these assets were valued at about $3 billion and Enel had made it to the final stages of the process.",
    "Enel's boss Francesco Starace may take advantage of Hidroelectrica's ambitions to hoover up assets in Romania to cash out from some local subsidiaries including Enel Energie and Enel Energie Muntenia which supply energy nationwide.",
    "Reuters reported on Thursday that Hidroelectrica was seeking to hire advisers to handle possible bids for Enel and CEZ's Romanian assets.  ",
    "Enel recently lost its Romania country head Georgios Stassis who took the helm of Greek utility Power Public Corporation and replaced him with Carlo Pignoloni who used to run Enel Green Power's operations in Italy. ",
    "Enel, which is Romania's largest energy supplier and No. 2 distributor, previously tried to put the assets on the block in 2014 as part of a plan to exit both Romania and Slovakia.",
    "In 2015 it agreed to sell its 66% stake in Slovenské Elektrárne - Slovakia's leading power generator - to EP Slovakia, a subsidiary of Czech firm EPH, in 2018.",
    "Enel's Romanian business posted revenues of 1.3 billion euros last year, up more than 20% from the previous year as power sales rose thanks to the gradual liberalization of the market. Core earnings totalled 230 million euros.",
    "($1 = 0.8973 euros)"
  ],
  "published_datetime": "2019-09-05 01:24:00"
}