{
  "url": "https://www.nasdaq.com/article/oil-climbs-after-sharp-drop-in-us-crude-stockpiles-cm1210296",
  "title": "Oil Climbs after Sharp Drop in U.S. Crude Stockpiles - Nasdaq.com",
  "text": [
    " SECTOR COMMENTARY ",
    "The energy sector is poised for a mixed to higher start, supported by strength in the crude complex while major equity futures were flat as rising trade war optimism was offset by concerns ahead of next week's FOMC policy decision meeting.",
    "WTI crude oil futures were up over 1% in early trading, in line with Brent, lifted by last night's API report showing a sharp drop in U.S. crude stocks and reports from OPEC member Iraq who said the producer group would discuss deepening output cuts amid ongoing demand concerns. The weekly API report showed U.S. crude stocks fell last week by 7.2 million barrels, more than twice the amount analysts in a Reuters poll had forecasted. Traders will be looking to the official EIA data as the next major catalyst.",
    "Natural gas futures were down over 1% this morning, weighed down by warming weather forecasts and ahead of tomorrow's stora ge report  .",
    " INTERNATIONAL INTEGRATEDS ",
    "HSBC downgraded Eni  and Royal Dutch Shell  to 'Hold' from 'Buy.'",
    "Reuters - Repsol  believes it can start producing oil at the Norwegian Yme oilfield in the first half of next year, a partner in the field said. \"Repsol, the operator of the field, is confident that Yme could start production in the first half of 2020,\" Erik Haugane, chief executive of Okea, Repsol's partner in the license, told an oil conference in Oslo.   ",
    " U.S. E&PS ",
    "(Late Tuesday) Press Release - EQT  announced that it is streamlining its business to improve operational effectiveness and create a more efficient and nimbler organization. The new structure will simplify the company from 58 to 15 departments, streamline management and focus the organization on processes and functions that are directly aligned with its mission. As part of the reorganization, EQT is reducing its workforce by approximately 23%, or 196 positions. These positions represent approximately $50 million of annual general and administrative costs. EQT anticipates providing guidance on run-rate G&A in connection with its third quarter 2019 earnings results.",
    "(Late Tuesday) Press Release - Northern Oil and Gas  announced the appointment of Nicholas O'Grady as President, in addition to his current role as Northern's Chief Financial Officer.",
    "(Late Tuesday) Press Release - Range Resources  has been notified by Sunoco that they will be performing optimization work at the Marcus Hook export terminal that is expected to result in more efficient transportation to end markets.  This upgrade will cause the Mariner East pipeline to experience downtime during the month of September.  As a result of the outage, Range will sell ethane volumes in its residue natural gas stream that would typically be transported via the Mariner East system.  Range's propane volumes which were previously shipped on Mariner East 1 will be transported via the Mariner East 2 pipeline.  Third quarter production has not changed in terms of expected MMBtu produced, and the impact to cash flow is expected to be minimal.",
    "(Late Tuesday) Press Release - Sundance Energy Australia  announced its decision to re-domicile from Australia to the United States via a proposed Scheme of Arrangement under Australian law, which is subject to shareholder, judicial and regulatory approvals. If the Scheme of Arrangement is approved, the Company will transfer its primary listing to Nasdaq, and will cease to trade on the Australian Securities Exchange.  As part of the re-domiciliation, Sundance has entered into a Scheme Implementation Agreement with a newly formed US corporation (\"Holdco\"), which will become the ultimate parent company of the Sundance group of companies following the implementation of the Scheme.  Pursuant to the Scheme, Sundance shareholders will be entitled to receive one share in Holdco for every 100 Sundance shares held by Sundance shareholders on the Scheme record date.  The Company intends to cancel its sponsored American Depositary Receipt program following the implementation of the Scheme.",
    "(Late Tuesday) Press Release - WPX Energy  announced that it has priced its public offering of $600 million of its 5.250% Senior Notes due 2027. The notes were priced at 100.000% of par. The offering was upsized from the previously announced $500 million aggregate principal amount and is expected to close on Sept. 24, 2019, subject to customary closing conditions. The net proceeds from the offering will be approximately $592.5 million after deducting underwriting discounts and commissions and before estimated offering expenses payable by WPX.",
    " CANADIAN E&PS ",
    "Raymond James downgraded Obsidian Energy  to 'Underperform' from 'Market Perform.'",
    " OILFIELD SERVICES ",
    "(Late Tuesday) Press Release - Baker Hughes, a GE company  announced that General Electric Company and GE Oil & Gas US Holdings I, Inc., GE Holdings (US), Inc. and GE Oil & Gas US Holdings IV, Inc. (collectively, together with GE, the \"selling stockholders\") has commenced a secondary offering of 105 million shares of BHGE Class A common stock, par value $0.0001 per share. The underwriters will have a 30-day option to purchase up to an additional 15.75 million shares of Class A common stock from the selling stockholders. BHGE is not offering any shares of Class A common stock in the offering and will not receive any proceeds from the sale of shares in the offering. In addition, BHGE announced that it has agreed to repurchase from one or more of GE and its affiliates, in a privately negotiated transaction, $250,000,000 of shares of BHGE Class B common stock, par value $0.0001 per share, together with an equal number of associated membership interests of Baker Hughes, a GE company, LLC at a price equal to the price per share at which the underwriters will purchase shares of Class A common stock from the selling stockholders in the offering.",
    "(Late Tuesday) Press Release - Pason Systems  announced that it has made a US$20 million investment to acquire the majority interest in a US-based software company (the \"Company\") that provides products and services for the solar power and energy storage industry.  The Company will be combined with Pason Power to provide a robust and compelling software and control system offering, enabling solar and energy storage developers to secure more projects and deploy assets for their customers with higher confidence.",
    " DRILLERS ",
    "(Late Tuesday) Press Release - Dril-Quip  announced it has entered into agreements with AFGlobal Corporation, pursuant to which AFGlobal will lease Dril-Quip's forge facilities and equipment located at its Houston manufacturing campus with the option to acquire those same assets.  Effective October 1, 2019, AFGlobal's industrial forging division will assume all operational responsibility of Dril-Quip's forge facilities and continue to supply Dril-Quip with forgings pursuant to a supply agreement while also serving AFGlobal's other customers and markets with the capacity from these facilities. The company expects this transaction to contribute approximately $11 - $13 million annually towards the Company's previously announced transformation cost savings target of $40 - $50 million.   ",
    " MLPS & PIPELINES ",
    "Press Release - Buckeye Partners  reported that it has partially resumed operations at its Buckeye Bahamas Hub (\"BBH\") facility following Hurricane Dorian. BBH is now able to accommodate customer vessels at its inland berths for both loading and unloading of petroleum products. Work continues on completing final assessments, and restoring full operations at the facility in the near future.",
    "(Late Tuesday) Press Release - The Kinder Morgan Canada Limited board of directors announced that it has agreed with Pembina Pipeline  to amend and restate the previously announced arrangement agreement dated August 20, 2019 to include the preferred shares of KML in the arrangement transaction. If requisite approval by the holders of KML preferred shares is obtained, upon closing of the transaction, each outstanding KML preferred share of a series will be exchanged for a preferred share of Pembina with the same commercial terms and conditions as that series of KML preferred shares. The inclusion of KML preferred shares in the transaction is subject to approval by at least 66 2/3% of the votes cast by holders of KML preferred shares, voting together as a single class, present in person or represented by proxy at the special meeting of the holders of KML preferred shares to be held to approve the transaction, but is not a condition to closing of the transaction. If KML preferred shareholders do not approve the transaction but all other conditions to closing are satisfied or waived by the applicable party, the KML preferred shares will remain outstanding as shares in the capital of KML, which will be part of the Pembina group following completion of the transaction. The board of directors of KML has unanimously approved the amendments to the proposed transaction and recommends that holders of KML preferred shares vote in favour of the arrangement.",
    " MARKET COMMENTARY ",
    "Futures for Wall Street's major indexes were broadly flat, as hopes of a resolution to the Sino-U.S. trade tensions did little to sway investors who are still awaiting the Federal Reserve's decision on interest rate cuts next week. European shares rose, while the euro slipped against the dollar ahead of a key European Central Bank meeting. Hong Kong stocks closed at their highest since early August and Japanese stocks rose to a six-week high, while China stocks ended down. Oil prices gained on a sharp drop in U.S. crude inventories. Lingering concerns over the global economy supported  gold prices  . Data on producer prices and wholesale inventories are due to be released later in the day.",
    " NASDAQ ENERGY TEAM THOUGHT LEADERSHIP ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:55:00"
}