{
  "url": "https://www.nasdaq.com/article/millennials-want-to-retire-too-heres-how-cm1210063",
  "title": "Millennials Want to Retire Too. Here's How. - Nasdaq.com",
  "text": [
    "Millennials, such as myself, seem to be known the world over for our poor choices, efforts to alter certain cultural norms, or collusion to shutter industries single-handedly. Another bad reputation we receive involves our seemingly perpetual problems for establishing good financial habits. I'll be the first to admit $5 lattes and avocado toast did a number on our generation from a marketing point of view.",
    "Nevertheless, with respect to our financial woes, we seem to struggle with things as common as living within our means, saving money or setting aside enough to fund our retirement fully. Stated succinctly, it would appear we make a lot of mistakes with money.",
    "This begs the question of why that might be. What drives this perception? Further, what can we do to flip the script and salvage our financial futures? Allow me to share my perspective as a millennial.",
    "Much like my peers, delaying gratification and saving consistently to reach some eventual goal countless years in the future doesn't excite me much. If I had to assign blame, I'd point to social media, long-term unpredictability and our on-demand culture. But that's me. I don't claim to speak on behalf of my generation.",
    "Regardless of the culprit(s), it doesn't look as though we'd do well with a modern marshmallow test. That's where you put a marshmallow in front of a kid with the offer that they could \"earn\" a second one if they could go 15 minutes without eating it. Instead, it appears we desire a life of convenience and immediate fulfillment; perhaps because we have a high discount rate on what the future will provide.",
    "We've heard for so long about the virtues of homeownership, investing wisely and retiring comfortably , but many of us millennials don't see those as realistic options yet. We started at a disadvantage compared with our predecessors, thanks to student loan debt and increasingly unaffordable homes.",
    "I don't say this to shirk responsibility for being prudent or patient. Rather, this article intends to demonstrate how we operate the best we can within our expectations for what life can deliver.",
    "Understandably, our circumstances differ from those who came before us. What we have come to expect are convenience, low cost and choice.",
    "Preferably, we'd want these all wrapped up in an unforgettable experience, because experiences tend to make us happier. In short, we want a life with fulfilling experiences at a reasonable price. What we now need to figure out is how to have all of these preferences and attain financial security.",
    "What this all means for millennials is that we need to reshape our definition of retirement, including moving away from the traditional norms, where you work like a dog until you're 65 or 70 and then saunter through your sunset years. That's not the future that I aspire to. Instead, I want more options about when and how I want to \"retire,\" with the ultimate goals being sooner and better.",
    "I think Millennials feel acutely annoyed by restrictions because we've grown up in a world where convenience is king. In my personal life, I constantly seek methods to automate, scale and reduce time commitments to traditional tasks when more expedient options exist. From a retirement perspective, this means not wanting to adhere to a strict schedule and delay my retirement gratification until my 60s. In a sense, why wait until our golden years to hit snooze each morning without consequence?",
    "What I have come to desire as a millennial is to expedite my financial security, thereby allowing me the independence to make decisions irrespective of financial concerns. If my generation as a whole felt this way, it would change our path and free us from a traditional retirement route.",
    "Why do we want this? The reasons should be self-evident: We want what we want when we want it. That means cashing in those financial freedom chips sooner rather than later. After all, because we don't know what tomorrow will hold, we want to live more today. YOLO (you only live once), right?",
    "Let's lay it all on the table. Millennials must confront unique obstacles other generations didn't have to face. Of note are ballooning student debt, stagnant wages, increasingly expensive homes and impediments in career advancement. This speaks nothing of coming of age in an era of declining American global hegemony.",
    "Instead of being defeated by these frictions, millennials should see them as a rallying cry to set our affairs in order, apply ourselves and overcome. Therefore, these challenges also mean that traditional financial advice doesn't apply to our generation in the way it did to our predecessors.",
    "As one example, when people advocate for saving 10% of your salary in perpetuity and relying on Social Security and Medicare to cover the rest in retirement, I'm not certain this will be enough for us to live comfortably. A higher savings rate will be needed.",
    "Let me be clear: Changes like this will require considerable effort, savvy financial planning and unquestionable sacrifice.",
    "However, because we cannot afford to start saving for retirement as early as previous generations (see problems above) and we have less certainty of having entitlement programs exist in their current forms, we need to find another way to reach retirement.",
    "As such, I advocate for pursuing financial independence rather than a traditional retirement.",
    "To reach financial independence, we should:",
    "Two final notes about these actionable steps to take toward financial independence. First, they should combine to cover our current cost of living and leave room for future cost increases in line with inflation. And second, because our efforts compound, I suggest starting on them sooner rather than later.",
    "The above is how I would redefine retirement for millennials. Learning these strategies will free millennials to pursue their passions and give them the lives they want.",
    "Comments are suppressed in compliance with industry guidelines. Click here to learn more and read more articles from the author.",
    "This article was written by and presents the views of our contributing adviser, not the Kiplinger editorial staff. You can check adviser records with the SEC or with FINRA .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-10 08:24:37"
}