{
  "url": "https://www.nasdaq.com/article/healthequity-hqy-earnings-revenues-beat-estimates-in-q2-cm1207251",
  "title": "HealthEquity (HQY) Earnings & Revenues Beat Estimates in Q2 - Nasdaq.com",
  "text": [
    "  HealthEquity, Inc. HQY  reported adjusted earnings per share (EPS) of 45 cents in second-quarter fiscal 2020, which surpassed the Zacks Consensus Estimate of 35 cents. The bottom-line figure also improved 27.8% on a year-over-year basis. Revenues of the Zacks Rank #3 (Hold) company amounted to $86.6 million, which rose 21.9% year over year and also outpaced the Zacks Consensus Estimate of $85.4 million.  HSA Member Detail  As of Jul 31, 2019, the total number of Health Savings Accounts (HSA), for which HealthEquity served as a non-bank custodian (HSA members), was 4.2 million, up 16% year over year. Additionally, total Active HSA members were 3.3 million, up 13% year over year. Total Custodial Assets was $8.5 billion, up 21% year over year.   HealthEquity, Inc. Price, Consensus and EPS     Surprise        HealthEquity, Inc.   price-consensus-eps-surprise-chart    |   HealthEquity, Inc. Quote    Segmental Performance   Service Revenues:  At this segment, revenues rose 5.4% year over year to $26.3 million. The uptick was driven by a year-over-year increase of 17% in average HSA, partially offset by a decline of 10% in service revenues per average HSA.  Custodial Revenues:  At this segment, revenues grew 42% year over year to $43.6 million. The improvement was supported by 21% growth in average custodial cash assets and higher annualized interest rate yield on custodial cash assets of 2.5% during the quarter under review.  Interchange Revenues:  At this segment, revenues improved 8.5% year over year to $16.7 million. The interchange revenues gained from year-over-year growth of 17% in average HSAs.  Margin Details  HealthEquity registered gross profit of $58.4 million, up 25.5% year over year in the fiscal second quarter. Gross margin level was 67.5% of net revenues, up 200 bps year over year. Sales and marketing expenses summed $8.4 million, up 15.8% year over year. Technology and development expenses totaled $11.6 million, up 38.7% year over year. General and administrative expenses amounted to $9.3 million, up 17.3% year over year. Operating income in the fiscal second quarter was $24.9 million, up 15.3% year over year. Operating margin totaled 28.7% in the quarter, down 160 bps year over year.  Guidance  HealthEquity raised its revenue guidance for fiscal 2020. The company now expects revenues of $341-$347 million compared with $339-$345 million mentioned earlier. The Zacks Consensus Estimate of $343.4 million for the same lies within HealthEquity's guided range. Adjusted net income is projected between $76 million and $80 million. Adjusted EPS for fiscal 2020 is expected to be $1.10-$1.16. The Zacks Consensus Estimate for earnings is pegged at $1.33, above the company's guided range.  Summing Up  With solid HSA member growth, HealthEquity exited the second quarter of fiscal 2020 on an impressive note. Additionally, the company raised fiscal 2020 guidance. Strong growth in Service and Custodial revenue segments buoys optimism. Notably, solid growth in HSAs and custodial assets bolstered the company's top-line performance. Currently, HealthEquity is the third-largest HSA custodian by market share. In addition to HSA, the company offers health reimbursement arrangement (HRA) and health flexible spending account (FSA) to regional employers. However, it faces stiff competition in the Medical Services market. HealthEquity is required to comply with the strict treasury regulations formulated by the Internal Revenue Service or the IRS.  Earnings of Better-Ranked MedTech Majors at a   Glance  Some better-ranked stocks, which posted solid results this earnings season, are Masimo Corporation MASI  , Baxter International Inc. BAX  and Intuitive Surgical, Inc. ISRG  , each carrying a Zacks Rank #2 (Buy) at present. You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  .  Masimo delivered second-quarter 2019 adjusted EPS of 76 cents, beating the Zacks Consensus Estimate of 73 cents. Its revenues of $229.7 million surpassed the consensus mark of $223 million. Baxter delivered second-quarter 2019 adjusted EPS of 89 cents, which surpassed the Zacks Consensus Estimate of 81 cents by 9.9%. The company's revenues of $2.84 billion outpaced the consensus mark of $2.79 billion by 1.9%. Intuitive Surgical reported second-quarter 2019 adjusted EPS of $3.25, which beat the Zacks Consensus Estimate of $2.85. Its revenues were $1.1 billion, surpassing the consensus mark of $1.03 billion.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Intuitive Surgical, Inc. (ISRG): Free Stock Analysis Report   Masimo Corporation (MASI): Free Stock Analysis Report   Baxter International Inc. (BAX): Free Stock Analysis Report   HealthEquity, Inc. (HQY): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " HealthEquity, Inc. HQY  reported adjusted earnings per share (EPS) of 45 cents in second-quarter fiscal 2020, which surpassed the Zacks Consensus Estimate of 35 cents. The bottom-line figure also improved 27.8% on a year-over-year basis.",
    "Revenues of the Zacks Rank #3 (Hold) company amounted to $86.6 million, which rose 21.9% year over year and also outpaced the Zacks Consensus Estimate of $85.4 million.",
    " HSA Member Detail ",
    "As of Jul 31, 2019, the total number of Health Savings Accounts (HSA), for which HealthEquity served as a non-bank custodian (HSA members), was 4.2 million, up 16% year over year.",
    "Additionally, total Active HSA members were 3.3 million, up 13% year over year.",
    "Total Custodial Assets was $8.5 billion, up 21% year over year.",
    "  HealthEquity, Inc. Price, Consensus and EPS     Surprise        HealthEquity, Inc.   price-consensus-eps-surprise-chart    |   HealthEquity, Inc. Quote  ",
    " HealthEquity, Inc. Price, Consensus and EPS     Surprise ",
    " HealthEquity, Inc.   price-consensus-eps-surprise-chart    |   HealthEquity, Inc. Quote ",
    " Segmental Performance ",
    " Service Revenues:  At this segment, revenues rose 5.4% year over year to $26.3 million. The uptick was driven by a year-over-year increase of 17% in average HSA, partially offset by a decline of 10% in service revenues per average HSA.",
    " Custodial Revenues:  At this segment, revenues grew 42% year over year to $43.6 million. The improvement was supported by 21% growth in average custodial cash assets and higher annualized interest rate yield on custodial cash assets of 2.5% during the quarter under review.",
    " Interchange Revenues:  At this segment, revenues improved 8.5% year over year to $16.7 million. The interchange revenues gained from year-over-year growth of 17% in average HSAs.",
    " Margin Details ",
    "HealthEquity registered gross profit of $58.4 million, up 25.5% year over year in the fiscal second quarter. Gross margin level was 67.5% of net revenues, up 200 bps year over year.",
    "Sales and marketing expenses summed $8.4 million, up 15.8% year over year. Technology and development expenses totaled $11.6 million, up 38.7% year over year. General and administrative expenses amounted to $9.3 million, up 17.3% year over year.",
    "Operating income in the fiscal second quarter was $24.9 million, up 15.3% year over year. Operating margin totaled 28.7% in the quarter, down 160 bps year over year.",
    " Guidance ",
    "HealthEquity raised its revenue guidance for fiscal 2020.",
    "The company now expects revenues of $341-$347 million compared with $339-$345 million mentioned earlier. The Zacks Consensus Estimate of $343.4 million for the same lies within HealthEquity's guided range.",
    "Adjusted net income is projected between $76 million and $80 million.",
    "Adjusted EPS for fiscal 2020 is expected to be $1.10-$1.16. The Zacks Consensus Estimate for earnings is pegged at $1.33, above the company's guided range.",
    " Summing Up ",
    "With solid HSA member growth, HealthEquity exited the second quarter of fiscal 2020 on an impressive note. Additionally, the company raised fiscal 2020 guidance. Strong growth in Service and Custodial revenue segments buoys optimism.",
    "Notably, solid growth in HSAs and custodial assets bolstered the company's top-line performance. Currently, HealthEquity is the third-largest HSA custodian by market share. In addition to HSA, the company offers health reimbursement arrangement (HRA) and health flexible spending account (FSA) to regional employers.",
    "However, it faces stiff competition in the Medical Services market. HealthEquity is required to comply with the strict treasury regulations formulated by the Internal Revenue Service or the IRS.",
    " Earnings of Better-Ranked MedTech Majors at a   Glance ",
    "Some better-ranked stocks, which posted solid results this earnings season, are Masimo Corporation MASI  , Baxter International Inc. BAX  and Intuitive Surgical, Inc. ISRG  , each carrying a Zacks Rank #2 (Buy) at present. You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  . ",
    "Masimo delivered second-quarter 2019 adjusted EPS of 76 cents, beating the Zacks Consensus Estimate of 73 cents. Its revenues of $229.7 million surpassed the consensus mark of $223 million.",
    "Baxter delivered second-quarter 2019 adjusted EPS of 89 cents, which surpassed the Zacks Consensus Estimate of 81 cents by 9.9%. The company's revenues of $2.84 billion outpaced the consensus mark of $2.79 billion by 1.9%.",
    "Intuitive Surgical reported second-quarter 2019 adjusted EPS of $3.25, which beat the Zacks Consensus Estimate of $2.85. Its revenues were $1.1 billion, surpassing the consensus mark of $1.03 billion.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:32:00"
}