{
  "url": "https://www.nasdaq.com/article/oil-sinks-as-manufacturing-data-feeds-global-economy-worries-20190903-01030",
  "title": "Oil sinks as manufacturing data feeds global economy worries - Nasdaq.com",
  "text": [
    "By Stephanie Kelly",
    "NEW  YORK, Sept 3 (Reuters) - Oil prices fell on Tuesday, with U.S. crude futures down 2% after manufacturing data raised concerns about a weakening global economy, while the U.S.-China trade dispute continued to drag on investor sentiment.",
    "U.S. West Texas Intermediate (WTI) crude  futures fell $1.16, or 2.1%, to settle at $53.94 a barrel. The session low was $52.84 a barrel, the lowest since Aug. 9.",
    "Prices extended losses following data that showed U.S. manufacturing activity in August contracted for the first time in three years.  Earlier, separate data showed euro zone manufacturing activity contracted for a seventh month in August. ",
    "\"That deterioration is continuing to undermine the demand growth outlook for oil,\" said John Kilduff, a partner at Again Capital in New York.",
    "Oil prices have fallen around 20% since a 2019 peak reached in April, hit by concerns the trade war would dent oil demand.",
    "U.S. President Donald Trump said on Tuesday that trade talks between the United States and China were going well, though he warned he would be \"tougher\" in negotiations if discussions drag on until his second term.  Trump said the two sides would meet for talks this month.",
    "Chinese Vice Premier Liu He said China firmly opposes a trade war, the state news agency Xinhua reported. ",
    "Washington began imposing 15% tariffs on an array of Chinese imports on Sunday, while China began placing new duties on U.S. crude oil.",
    "The U.S.-China trade dispute \"is the single most important flat price driver of late,\" said Tamas Varga of oil brokerage PVM.",
    "On the supply side, Venezuela's oil exports fell in August to their lowest level in 2019, internal reports and Refinitiv Eikon data showed, following tougher U.S. sanctions. ",
    "Russian oil production  in August rose to 11.294 million barrels per day (bpd), data showed on Monday, hitting its highest since March and topping the rate Moscow pledged under a pact with the Organization of Petroleum Exporting Countries (OPEC). ",
    "\"Downside price pressures were accentuated today by weekend indications that OPEC had lifted production in August on a month-to-month basis for the first time this year while Russia is reportedly producing beyond agreed upon quota,\" Jim Ritterbusch, president of Ritterbusch and Associates, said in a note.",
    "Data due this week on U.S. inventory levels will be delayed by a day to Wednesday and Thursday because of the U.S. Labor Day holiday on Monday.",
    "Oil prices are likely to remain range-bound for the \"foreseeable future\" and there will be little spending growth in North American oil and gas fields in the near to medium term, Lorenzo Simonelli, chief executive of General Electric Co's Baker Hughes  said. ",
    "CHART: Brent oil still targets $57.13-$57.91 rangeL3N25U02R",
    "CHART: U.S. oil to fall towards $52.99L3N25U0QK"
  ],
  "published_datetime": "2019-09-03 15:38:00"
}