{
  "url": "https://www.nasdaq.com/article/the-fiasco-of-trumps-trade-blitzkrieg-cm1207443",
  "title": "The Fiasco of Trump’s Trade Blitzkrieg - Nasdaq.com",
  "text": [
    "Despite this, it will not be easy for the dollar to avoid growth in the longer term as too many factors risk igniting demand for protective assets, including the U.S. short-term government bonds.",
    "Locally, the dollar and key U.S. indices dropped, following weak manufacturing data and disappointing construction activity indicators. For the first time in 3 years, Manufacturing ISM declined below 50, the area formally separating growth from decline. The construction sector also showed a slight increase in spending in July by 0.1% after a decline of 0.5% and 0.7% during the previous two months.",
    "Currently, it is very worrying picture: the manufacturing sector is on the verge of decline, while construction and consumer activity stalled after a multi-year trend for growth. Trump's tweets, pushing the Fed to further lower interest rates and quickly deal with China, suggest that the U.S. President may be very uncomfortable with the current situation.",
    "Trade wars started at the beginning of 2018 when the IMF continuously raised forecasts of global economic growth. Eighteen months later, only China and the United States face clear problems in the negotiations, while other countries have managed to settle on most of their trade agreements. But the dispute between the two largest and most important players in world trade has turned the situation a full 180 degrees.",
    "The world economy is losing momentum, and investors are returning capital to their homeland, forming a trend for the growth of the dollar and yen over the past year. So far, we have seen that markets have not crossed the line, refraining from a panic sale, while there are few signs of an enormous deleveraging in the financial sector. Meanwhile, emerging market currencies are growing despite Argentina's problems. However, this situation resembles more of a fragile balance than a stable position.",
    "Donald Trump will have to lead the financial markets along the narrow path between the two abysses, balancing between promises of progress in trade negotiations, domestic economic incentives and the Fed's pressure to cut rates.",
    "If successful, markets may avoid a decline and the US dollar may decline the most, as the combination of increased inflation (due to tariffs) and Fed cuts will undermine the value of the dollar. Under these conditions, DXY could lose about 5% of its current levels by the end of the year, returning to the lows of 2019. EURUSD , in this case, is quite capable of rolling back to 1.14-1.15.",
    "A step to the left and progress in trade negotiations will quickly force the Fed to abandon an excessively soft approach to monetary policy. During the first stage, we can see the growth of the dollar, as the markets will have to reconsider their expectations of a Fed rates cut. In this case, the dollar index has the potential to return to the 2016-year highs around 105. DXY was at this level when the Fed first began to normalise the policy. For EURUSD, this is the way down to 1.03-1.04.",
    "A step to the right and the markets could easily go into an upward spiral, choosing dollar assets as a safe haven, despite the deterioration of the U.S. macroeconomic indicators. We saw this in 2008 when the dollar spiked by more than 20% in less than half a year.",
    "A similar amplitude - but within a longer period of time - occurred between 1998 and 2001, as a result of the Asian crisis and Russia's default. At that time, DXY was rising from around 100 to 120. And this scenario may well turn out to be a \"working version\" for the next 12-15 months, as Trump's trade blitzkrieg turns into a protracted guerrilla war where both time and the fear of the markets play against the U.S.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 07:28:22"
}