{
  "url": "https://www.nasdaq.com/article/is-it-time-to-buy-these-etfs-on-a-sudden-slowdown-in-ev-sales-cm1210689",
  "title": "Is it Time to Buy These ETFs on a Sudden Slowdown in EV Sales? - Nasdaq.com",
  "text": [
    " Electric powered vehicles, once a popular and fast-growing area (thanks mainly to technological advancement and improving cost economics), is gradually slowing down. Global electric car sales dropped for the first time on record  in July after China dialed back purchase subsidies. Sales in North America also took a hit. China has been a great proponent of this move. China intends to get 60% of all automobiles in the country to run on electric motors by 2035, per an article published on autonews.com  . China's last roadmap on the auto industry announced in 2017 laid out a plan which said new energy vehicles - all-electric, fuel-celled autos and plugin hybrids - would make up more than 20% of the country's total vehicle sales by 2025  . Along with China's passenger vehicle sales, sales of NEVs (new energy vehicle) dropped for the second consecutive month in August  . Last year, NEV sales grew 62%  year over year in China. But NEV sales declined 4.7% year over year in July, marking the first drop, as quoted on  marketrealist.com  . Apart from subsidy cuts, China's electric autonomous vehicles company Nio recently replaced all of the affected battery packs recalled for fire risk  pretty ahead of schedule. But the entire incident impacted sales. The Chinese EV company delivered just 837 vehicles in July, \"making it the company's third-worst full month  since it started deliveries in June 2018.\"  Short-Term Glitch, Long-Term Gain?  Global plug-in vehicle deliveries were 2.1 million units for 2018, marking a 64% rise from 2017 levels and 2.4% of the world's overall 86 million units sold last year. \"IHS Markit sees EV market share inching up over the next half decade - reaching about 7.6 percent of total new vehicle sales  worldwide by 2025.\" \"Despite expected short-term weakness in 2019, we continue to be positive on long-term EV demand.\" Per Bernstein analysts, EV sales grew 34% in Europe in July despite declines in China and North America. Demand for metals used in battery electric vehicles could increase six-fold if electric cars can touch 8% of road traffic by mid-2020s, delivering hu ge dividends  for producing countries like Democratic Republic of Congo, per Moody's as quoted on Reuters  . Other countries like Peru, Chile and the Philippines should also gain traction from increased exposure to EV adoption over the long term. Against this backdrop, investors can bet on the following ETFs with a long-term view.  ETFs in Focus   Global X Autonomous & Electric Vehicles   ETF  DRIV   Innovation Shares NextGen Vehicles & Technology   ETF  EKAR   KraneShares Electric Vehicles and Future Mobility Index   ETF KARS   Global X Lithium & Battery Tech ETF  LIT   Amplify Advanced Battery Metals and Materials   ETF  BATT   iShares MSCI Peru ETF  EPU   iShares MSCI Chile Capped ETF ( ECH )   iShares MSCI Philippines ETF ( EPHE )   Want key ETF info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.   Get it free >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Global X Autonomous & Electric Vehicles ETF (DRIV): ETF Research Reports   iShares MSCI Philippines ETF (EPHE): ETF Research Reports   iShares MSCI Chile ETF (ECH): ETF Research Reports   Global X Lithium & Battery Tech ETF (LIT): ETF Research Reports   iShares MSCI Peru ETF (EPU): ETF Research Reports   KraneShares Electric Vehicles and Future Mobility ETF (KARS): ETF Research Reports   Ideanomics NextGen Vehicles & Technology ETF (EKAR): ETF Research Reports   Amplify Advanced Battery Metals and Materials ETF (BATT): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    "Electric powered vehicles, once a popular and fast-growing area (thanks mainly to technological advancement and improving cost economics), is gradually slowing down. Global electric car sales dropped for the first time on record  in July after China dialed back purchase subsidies. Sales in North America also took a hit.",
    "China has been a great proponent of this move. China intends to get 60% of all automobiles in the country to run on electric motors by 2035, per an article published on autonews.com  . China's last roadmap on the auto industry announced in 2017 laid out a plan which said new energy vehicles - all-electric, fuel-celled autos and plugin hybrids - would make up more than 20% of the country's total vehicle sales by 2025  .",
    "Along with China's passenger vehicle sales, sales of NEVs (new energy vehicle) dropped for the second consecutive month in August  . Last year, NEV sales grew 62%  year over year in China. But NEV sales declined 4.7% year over year in July, marking the first drop, as quoted on  marketrealist.com  .",
    "Apart from subsidy cuts, China's electric autonomous vehicles company Nio recently replaced all of the affected battery packs recalled for fire risk  pretty ahead of schedule. But the entire incident impacted sales. The Chinese EV company delivered just 837 vehicles in July, \"making it the company's third-worst full month  since it started deliveries in June 2018.\"",
    " Short-Term Glitch, Long-Term Gain? ",
    "Global plug-in vehicle deliveries were 2.1 million units for 2018, marking a 64% rise from 2017 levels and 2.4% of the world's overall 86 million units sold last year. \"IHS Markit sees EV market share inching up over the next half decade - reaching about 7.6 percent of total new vehicle sales  worldwide by 2025.\"",
    "\"Despite expected short-term weakness in 2019, we continue to be positive on long-term EV demand.\" Per Bernstein analysts, EV sales grew 34% in Europe in July despite declines in China and North America.",
    "Demand for metals used in battery electric vehicles could increase six-fold if electric cars can touch 8% of road traffic by mid-2020s, delivering hu ge dividends  for producing countries like Democratic Republic of Congo, per Moody's as quoted on Reuters  . Other countries like Peru, Chile and the Philippines should also gain traction from increased exposure to EV adoption over the long term.",
    "Against this backdrop, investors can bet on the following ETFs with a long-term view.",
    " ETFs in Focus ",
    " Global X Autonomous & Electric Vehicles   ETF  DRIV ",
    " Innovation Shares NextGen Vehicles & Technology   ETF  EKAR ",
    " KraneShares Electric Vehicles and Future Mobility Index   ETF KARS ",
    " Global X Lithium & Battery Tech ETF  LIT ",
    " Amplify Advanced Battery Metals and Materials   ETF  BATT ",
    " iShares MSCI Peru ETF  EPU ",
    " iShares MSCI Chile Capped ETF ( ECH ) ",
    " iShares MSCI Philippines ETF ( EPHE ) ",
    " Want key ETF info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.   Get it free >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:30:00"
}