{
  "url": "https://www.nasdaq.com/article/heres-why-you-should-avoid-acadia-healthcare-stock-now-cm1206598",
  "title": "Here's Why You Should Avoid Acadia Healthcare Stock Now - Nasdaq.com",
  "text": [
    "  Acadia Healthcare Company, Inc. ACHC  has fallen out of favor with  investors due to lack of clarity regarding the sale of its U.K business (comprised 37% of total revenues in 2018) that has been underperforming and dragging down its overall profitability. Clarity on sale of the U.K. business, which remains challenged with weak census and pressure related to nurse staffing, would have lifted overhang on the stock and allowed the company to focus on businesses with strong growth trajectories. Acadia Healthcare has also lowered its earnings guidance. It now expects EBITDA of $610 million to $620 million and adjusted earnings per share in the range of $2.15 to $2.23. The expected EBITDA and EPS indicate year-over-year decline of 35% and 2.2%, respectively, (calculated at the mid-point). The current guidance suggests earnings decline for the third year in a row.   Factors responsible for the current year's earnings drag include the seasonal slowdown in the U.K business, the timing of the U.K. retooling initiatives, the continuing ramp-up of the company's de novo facilities, negative impact from its closed facilities and the continuing ramp of bed additions at its existing facilities. In the first half of 2019, revenues of the company increased 1.4% but  earnings declined 9.8%. The lackluster results weighed on the stock, which has lost 37% in a year compared with the industry  's decline of 13%.    Other companies in the same space like HCA Healthcare. Inc. HCA  and Community Health Systems, Inc. CYH  have declined 10.4% and 35.8%, respectively, while Universal Health Services, Inc. UHS  is up 11% during the same time frame. Acadia Healthcare's return on assets, an indicator of how efficiently a company uses its assets, also gone down to 140 basis points over the past four years and compares unfavorably with the industry average of 6.5%. Also, the company has been witnessing increase in expenses since 2009, resulting in margin contraction. Expenses are likely to rise further due to investments in inorganic growth strategies. During the first half of 2019, expenses rose 4.5%, outpacing revenue growth of 2.5%, and thus raised concerns. Acadia Healthcare carries a Zacks Rank #4 (Sell). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  .   Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>           Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Universal Health Services, Inc. (UHS): Free Stock Analysis Report   Acadia Healthcare Company, Inc. (ACHC): Free Stock Analysis Report   HCA Healthcare, Inc. (HCA): Free Stock Analysis Report   Community Health Systems, Inc. (CYH): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Acadia Healthcare Company, Inc. ACHC  has fallen out of favor with  investors due to lack of clarity regarding the sale of its U.K business (comprised 37% of total revenues in 2018) that has been underperforming and dragging down its overall profitability.",
    "Clarity on sale of the U.K. business, which remains challenged with weak census and pressure related to nurse staffing, would have lifted overhang on the stock and allowed the company to focus on businesses with strong growth trajectories.",
    "Acadia Healthcare has also lowered its earnings guidance. It now expects EBITDA of $610 million to $620 million and adjusted earnings per share in the range of $2.15 to $2.23. The expected EBITDA and EPS indicate year-over-year decline of 35% and 2.2%, respectively, (calculated at the mid-point). The current guidance suggests earnings decline for the third year in a row.  ",
    "Factors responsible for the current year's earnings drag include the seasonal slowdown in the U.K business, the timing of the U.K. retooling initiatives, the continuing ramp-up of the company's de novo facilities, negative impact from its closed facilities and the continuing ramp of bed additions at its existing facilities.",
    "In the first half of 2019, revenues of the company increased 1.4% but  earnings declined 9.8%. The lackluster results weighed on the stock, which has lost 37% in a year compared with the industry  's decline of 13%.",
    "Other companies in the same space like HCA Healthcare. Inc. HCA  and Community Health Systems, Inc. CYH  have declined 10.4% and 35.8%, respectively, while Universal Health Services, Inc. UHS  is up 11% during the same time frame.",
    "Acadia Healthcare's return on assets, an indicator of how efficiently a company uses its assets, also gone down to 140 basis points over the past four years and compares unfavorably with the industry average of 6.5%.",
    "Also, the company has been witnessing increase in expenses since 2009, resulting in margin contraction. Expenses are likely to rise further due to investments in inorganic growth strategies. During the first half of 2019, expenses rose 4.5%, outpacing revenue growth of 2.5%, and thus raised concerns.",
    "Acadia Healthcare carries a Zacks Rank #4 (Sell).",
    "You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  . ",
    " Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:18:00"
}