{
  "url": "https://www.nasdaq.com/article/can-roches-blockbuster-drug-herceptins-sales-grow-cm1206625",
  "title": "Can Roche's Blockbuster Drug Herceptin's Sales Grow? - Nasdaq.com",
  "text": [
    " Roche Holding's   ( RHHBY  ) Herceptin is the leading targeted therapy for the treatment of metastatic HER2 positive breast cancer. HER2 positive breast cancer refers to a type of breast cancer, in which the cells have higher than normal levels of HER2, which is a protein called human epidermal growth factor receptor 2. These cancers tend to grow and spread faster than other breast cancers. Pfizer's Ibrance, Novartis' Kisqali and Afinitor are used as targeted therapy for metastatic hormone receptor positive, HER2-negative breast cancer. AstraZeneca's Lynparaza is used as targeted therapy for people with BRCA1 or BRCA2 gene mutation. In this note we discuss Roche's Herceptin sales, and compare it with other breast cancer drugs in the market. You can view our interactive dashboard analysis ~  How Does Roche's Herceptin Compare To Other   Breast Cancer Drugs?    ~ for more details. In addition, look at our data for healthcare companies   here.",
    " Roche's Herceptin Is the Top Selling Targeted Therapy   Followed By Pfizer's Ibrance ",
    " Herceptin's Share Among The HER2 Breast Cancer Drugs Have   Declined Over The Last Few Years ",
    " Herceptin Is Expected To Lose Market Exclusivity In 2019,   While Other Drugs Are Protected For A Few More Years, As Shown   Below ",
    " Herceptin In An Important Drug For Roche, Given Its   Contribution To The Total Pharmaceutical Sales ",
    "What's behind Trefis? See How it's Powering New Collaboration and What-Ifs",
    "For CFOs and Finance Teams   | Product, R&D, and Marketing Teams ",
    " All Trefis Data ",
    "Like our charts? Explore example interactive dashboards   and create your own.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:47:42"
}