{
  "url": "https://www.nasdaq.com/article/some-aramco-ipo-banks-look-more-equal-than-others-20190912-00122",
  "title": "Some Aramco IPO banks look more equal than others - Nasdaq.com",
  "text": [
    "By George Hay",
    "(The author is a Reuters Breakingviews columnist.)",
    "PARIS, Sept 12 (Reuters Breakingviews) - All Saudi Aramco's listing advisers are equal, at least in name. The oil giant has hired nine banks to lead its revived initial public offering and given them the grand-sounding title of global coordinator, Reuters reported on Wednesday. That means they all get bragging rights. But they will not all be doing the same thing.",
    "In practice, however, the three lead banks will have done most of the work already. It will be surprising if JPMorgan, whose Saudi relationships go back decades and which has comfortably topped Dealogic's list of investment-bank revenue generators so far this year, does not remain the de facto top dog.",
    "That said, there could be tweaks to the IPO pecking order. First time round, HSBC's role was weighted towards the local Saudi listing rather than wherever Aramco will be listed abroad. Its first-tier crown could be taken by Goldman, whose pitch has been burnished by representatives such as Dina Powell, who served in U.S. President Donald Trump's administration before returning to the Wall Street bank last year. Goldman also has history with the Public Investment Fund, whose boss Yasir al-Rumayyan last week became Aramco's chairman.",
    "BofA, Citi and Credit Suisse are wildcards. Citi's departure from Saudi Arabia in 2004 is still remembered there, while the other two lenders have had good relations with Qatar, a Saudi foe. Still, both BofA and Citi have lent money recently to the PIF, while the Swiss bank's efforts are headed by Hazem Shawki, who until recently was a regional bigwig for Goldman.",
    "All nine of Aramco's banks remain equally burdened with what's likely to be a tortuous listing process - starting on the Riyadh bourse and going international later - with a demanding client for minimal reward. In other respects, some will prove more equal than others.",
    "\nOn Twitter\n",
    "CONTEXT NEWS",
    "-  Saudi Aramco has hired nine banks as joint global coordinators to lead its planned initial public offering, two sources familiar with the matter told Reuters on Sept. 11.",
    "- Aramco has selected JPMorgan, Morgan Stanley and Saudi Arabia'sNational Commercial Bank, which were previously working on the share sale before it was paused last year, the sources said.",
    "- It has also chosen Bank of America Merrill Lynch, Goldman Sachs, Credit Suisse, Citigroup, HSBC and Saudi's Samba Financial.",
    "- The kingdom plans to list 1% of the state oil giant - the world's largest oil company - on the Riyadh stock exchange before the end of this year and another 1% in 2020, sources told Reuters this week, as initial steps ahead of a public sale of around 5% of Aramco."
  ],
  "published_datetime": "2019-09-12 04:39:00"
}