{
  "url": "https://www.nasdaq.com/article/zoom-video-zm-2nd-quarter-earnings-what-to-expect-cm1207725",
  "title": "Zoom Video (ZM) 2nd Quarter Earnings: What to Expect - Nasdaq.com",
  "text": [
    "Can shares of Zoom Video (ZM) continue to zip higher? One of the most successful tech IPOs in recent memory, Zoom stock, up 50% year to date, has more than doubled its IPO price.",
    "The company, which aims to disrupt the video conferencing market, is set to report second quarter fiscal 2020 earnings results after the closing bell Thursday. The video conferencing industry is riddled with technical issues, despite a decade-long attempts by larger players to simplify the experience. Some 90% of all virtual meetings within corporations still utilize only audio as business opt to avoid the hassle often associated with integrating video.",
    "Zoom’s video-first platform, which is based on the cloud, is disruptive in its ease of use. Combined with its higher-quality video offering and its 24/7/365 customer support, the company has attracted a loyal customer base. But with the market pricing the company at about 160% higher than its IPO price, valuations concerns have emerged. At around $93 per share, Zoom is priced at some sixty times trailing revenue. In other words, aside from strong growth, investors expect the young company to execute flawlessly.",
    "On Thursday Wall Street will want to see how the company’s loyal customer base can translate to making money. Investors will also want to know whether (or when) the company can expand beyond its video-conferencing business to boost its addressable market. This is because, as with other fast-growth companies, the company’s metrics will begin to decelerate.",
    "If or when this happens, the market will be forced to re-price its expectations and assign a more reasonable valuation. In other words, the company’s guidance will determine whether Zoom’s valuation aligns with investor sentiment.",
    "For the three months that ended July, Wall Street expects the San Jose, Calif.-based company to earn 1 cent per share on revenue of $130.31 million. This will be the company’s second earnings report as a public issue. For the full year, ending January 2020, the company is projected to earn 3 cents per share, while full-year revenue is expected to reach $545.49 million. The company has more-than doubled its revenue in each year for the past two years.",
    "In the first quarter earnings report, Zoom posted revenue of $122 million, which skyrocketed 103% year over year, sending the stock some 10% higher. Just as impressive, the company issued upside revenue guidance, which at the midpoint, calls for fiscal 2020 revenue growth of 62%. This suggests the management sees no signs of slowing down. That said, while that confidence is important, it will be a challenge for any company to keep growing revenue a triple digits. A deceleration in revenue growth happens to every company.",
    "In other words, Zoom will be making investments to sustain its rate of growth, meaning sales and marketing expenses, which accounted for about 52% of the total Q1 revenue, will be closely-watched on Thursday. These costs, known as operating leverage, will also indicate the company’s path towards profitability. And that’s important, given that Zoom competes with behemoths such as Microsoft (MSFT) and Cisco (CSCO) which have much deeper pockets.",
    "All told, expectations are high for Zoom. But the company has so far delivered. As Amazon (AMZN) and Netflix (NFLX) have demonstrated, avoiding a potentially disruptive tech company solely on conventional valuation metrics doesn’t always work.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 08:21:07"
}