{
  "url": "https://www.nasdaq.com/article/why-crowdstrike-is-poised-to-rise-cm1206961",
  "title": "Why CrowdStrike Is Poised to Rise - Nasdaq.com",
  "text": [
    " IPO darling   CrowdStrike Holdings    (NASDAQ: CRWD) has enjoyed a rising stock price, recently   reaching an intraday high of $101.88, up 60% from its market   debut at $63.50 in June. Investors have been attracted to   CrowdStrike for its software-as-a-service (SaaS) cybersecurity   capabilities, which were built from the ground up to support   cloud computing environments. The stock as of this writing trades around $83, having lost   ground as competitors such as   VMware    make moves threatening the company's position. VMware recently   acquired Carbon Black    , which, like CrowdStrike, focuses specifically on endpoint   security. (More on that in a moment.) But at more than 30% above its opening price, does the stock   have room to rise?makeArticleAd();   Image source: Getty Images.   Playing in a red-hot space  Cloud computing has been a hot industry, and it's no surprise   why. The approach allows a company to expand and contract its   need for computing power by accessing remote servers via the   internet (i.e., the cloud). This allows a business to react to   events in real time, like a surge of visitors to its website when   running a sale, which would require increasing the number of   available servers, then reducing costs by turning off these   additional servers when the spike in site visits ends. In this way, corporations can dramatically reduce IT   expenditures. Instead of investing in hardware and software to   support infrastructure, along with hiring staff to set up and   maintain it, businesses can offload these costs to third parties   with expertise in IT infrastructure, such as   Alphabet    ,   Microsoft    , and   Amazon    . The market is expected to continue growing as more companies   migrate their technology to the cloud. Forecasts predict the   cloud computing industry will reach $250 billion next year, an   increase of 17% over this year. Research firm   Gartner    estimates cybersecurity's share of this cloud computing pie will   total $14.1 billion. This market opportunity has led to a deluge of competitors   battling for cybersecurity supremacy. Despite the competition,   CrowdStrike saw revenue grow 103% year-over-year to $96.1 million   in its most recent quarter. Moreover, Gartner listed CrowdStrike   as among the leaders in the space based on its \"completeness of   vision,\" its product offering, and the company's ability to   execute on that vision.  Offering an attractive product  Another advantage is CrowdStrike's compelling product   offering, with its combination of easy setup and   artificial-intelligence-powered security. These two things are a   crucial part of its Falcon platform, a SaaS solution that   monitors all endpoints for its clients. An endpoint is any device   used to connect online. CrowdStrike's ability to monitor all endpoints is important   because we've become   a society of multiple devices    . Gone are the days when an employee accessed company information   only at work. Today, employees are likely to answer company   emails on their own mobile phones or tablets as much as via their   desktop computer in the office. If companies are not monitoring every way an employee accesses   work information, it opens up vulnerabilities that enable   criminals to harm the company. Damages from cybercrime are   estimated to reach $6 trillion by 2021. CrowdStrike's use of AI, through a technique called machine   learning, enables the company's software to identify threats   dynamically. Its system collects data on the devices trying to   access a client's network, and uses it to not only identify   threats but to learn about new threats. This is a key feature   since criminal hackers constantly evolve their attacks. Since   CrowdStrike's AI-powered software can evolve along with the   hackers, it makes CrowdStrike's product more reliable than   traditional security measures offered by competitors like   Symantec    . Another key advantage is the easy setup. While companies like   VMware juggle a hodg-podge of products for clients to implement,   CrowdStrike can get its solution installed and operational on an   endpoint in less than 30 seconds, according to CEO George Kurtz.   This capability helped CrowdStrike grow its customer base nearly   18% in the most recent quarter.  Delivering a proven revenue model  CrowdStike's ability to capture new customers is certainly   important to growing its top line, but its true bread and butter   is its ability to retain and upsell existing customers. Selling   more to existing customers is a much cheaper means of growing   revenue than acquiring new customers. In this arena, CrowdStrike is delivering impressive results.   When it comes to the company's dollar-based net retention rate --   which reveals the percentage of revenue from current customers a   company retained from the prior year after accounting for   upgrades, downgrades, and churn -- CrowdStrike reported a   remarkable 147% through January 2019, easily exceeding its   benchmark of 120%. This indicates CrowdStrike is not only   maintaining its spend levels from existing customers, but that   spend is growing. Since CrowdStrike's products are primarily subscription-based,   its annual recurring revenue (ARR), a key metric for   subscription-based businesses that shows the revenue coming in   each year from subscriptions and indicates what the company can   expect to repeat, is an important indicator of its success. In   Q1, CrowdStrike's ARR grew 114% year-over-year. Consequently,   non-GAAP    subscription gross margin grew to 73% compared to 62% in the same   quarter last year. While Q1 results were stellar in many places, operating   expenses need more improvement. The company's Q1 non-GAAP loss   from operations was $22 million, which was an improvement over   last year's Q1 loss of $31 million. Although CrowdStrike's bottom line appears unhealthy, tech   companies have a history of running at a loss for years before   turning profitable. As CrowdStrike invests in technical advances   such as being the first to deliver its cloud-based endpoint   protection system to mobile devices, it will continue to operate   in the red in favor of growing market share and its customer   base. These early investments enabled CrowdStrike to become a leader   in the cybersecurity space. It's proven to be a smart strategy   that has led to an average of 20% revenue growth over the last   three quarters. CrowdStrike's upcoming Q2 earnings report (scheduled for   Thursday) will confirm if the company can continue to deliver   consistent performance. Given its advantages and track record of   success, CrowdStrike is well-positioned to continue its exciting   growth.   10 stocks we like better than CrowdStrike Holdings,     Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and CrowdStrike Holdings,     Inc. wasn't one of them! That's right -- they think these 10     stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. Suzanne Frey, an executive at Alphabet, is a member     of The Motley Fool's board of directors. Teresa Kersten, an     employee of LinkedIn, a Microsoft subsidiary, is a member of     The Motley Fool's board of directors.     Robert Izquierdo      owns shares of Microsoft. The Motley Fool owns shares of and     recommends Alphabet (A shares), Alphabet (C shares), Amazon,     and Microsoft. The Motley Fool owns shares of CrowdStrike     Holdings, Inc and has the following options: long January 2021     $85 calls on Microsoft. The Motley Fool recommends Gartner and     VMware. The Motley Fool has a     disclosure policy      .  ",
    "IPO darling   CrowdStrike Holdings    (NASDAQ: CRWD) has enjoyed a rising stock price, recently   reaching an intraday high of $101.88, up 60% from its market   debut at $63.50 in June. Investors have been attracted to   CrowdStrike for its software-as-a-service (SaaS) cybersecurity   capabilities, which were built from the ground up to support   cloud computing environments.",
    "The stock as of this writing trades around $83, having lost   ground as competitors such as   VMware    make moves threatening the company's position. VMware recently   acquired Carbon Black    , which, like CrowdStrike, focuses specifically on endpoint   security. (More on that in a moment.)",
    "But at more than 30% above its opening price, does the stock   have room to rise?",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Cloud computing has been a hot industry, and it's no surprise   why. The approach allows a company to expand and contract its   need for computing power by accessing remote servers via the   internet (i.e., the cloud). This allows a business to react to   events in real time, like a surge of visitors to its website when   running a sale, which would require increasing the number of   available servers, then reducing costs by turning off these   additional servers when the spike in site visits ends.",
    "In this way, corporations can dramatically reduce IT   expenditures. Instead of investing in hardware and software to   support infrastructure, along with hiring staff to set up and   maintain it, businesses can offload these costs to third parties   with expertise in IT infrastructure, such as   Alphabet    ,   Microsoft    , and   Amazon    .",
    "The market is expected to continue growing as more companies   migrate their technology to the cloud. Forecasts predict the   cloud computing industry will reach $250 billion next year, an   increase of 17% over this year. Research firm   Gartner    estimates cybersecurity's share of this cloud computing pie will   total $14.1 billion.",
    "This market opportunity has led to a deluge of competitors   battling for cybersecurity supremacy. Despite the competition,   CrowdStrike saw revenue grow 103% year-over-year to $96.1 million   in its most recent quarter. Moreover, Gartner listed CrowdStrike   as among the leaders in the space based on its \"completeness of   vision,\" its product offering, and the company's ability to   execute on that vision.",
    "Another advantage is CrowdStrike's compelling product   offering, with its combination of easy setup and   artificial-intelligence-powered security. These two things are a   crucial part of its Falcon platform, a SaaS solution that   monitors all endpoints for its clients. An endpoint is any device   used to connect online.",
    "CrowdStrike's ability to monitor all endpoints is important   because we've become   a society of multiple devices    . Gone are the days when an employee accessed company information   only at work. Today, employees are likely to answer company   emails on their own mobile phones or tablets as much as via their   desktop computer in the office.",
    "If companies are not monitoring every way an employee accesses   work information, it opens up vulnerabilities that enable   criminals to harm the company. Damages from cybercrime are   estimated to reach $6 trillion by 2021.",
    "CrowdStrike's use of AI, through a technique called machine   learning, enables the company's software to identify threats   dynamically. Its system collects data on the devices trying to   access a client's network, and uses it to not only identify   threats but to learn about new threats. This is a key feature   since criminal hackers constantly evolve their attacks. Since   CrowdStrike's AI-powered software can evolve along with the   hackers, it makes CrowdStrike's product more reliable than   traditional security measures offered by competitors like   Symantec    .",
    "Another key advantage is the easy setup. While companies like   VMware juggle a hodg-podge of products for clients to implement,   CrowdStrike can get its solution installed and operational on an   endpoint in less than 30 seconds, according to CEO George Kurtz.   This capability helped CrowdStrike grow its customer base nearly   18% in the most recent quarter.",
    "CrowdStike's ability to capture new customers is certainly   important to growing its top line, but its true bread and butter   is its ability to retain and upsell existing customers. Selling   more to existing customers is a much cheaper means of growing   revenue than acquiring new customers.",
    "In this arena, CrowdStrike is delivering impressive results.   When it comes to the company's dollar-based net retention rate --   which reveals the percentage of revenue from current customers a   company retained from the prior year after accounting for   upgrades, downgrades, and churn -- CrowdStrike reported a   remarkable 147% through January 2019, easily exceeding its   benchmark of 120%. This indicates CrowdStrike is not only   maintaining its spend levels from existing customers, but that   spend is growing.",
    "Since CrowdStrike's products are primarily subscription-based,   its annual recurring revenue (ARR), a key metric for   subscription-based businesses that shows the revenue coming in   each year from subscriptions and indicates what the company can   expect to repeat, is an important indicator of its success. In   Q1, CrowdStrike's ARR grew 114% year-over-year.",
    "Consequently,   non-GAAP    subscription gross margin grew to 73% compared to 62% in the same   quarter last year.",
    "While Q1 results were stellar in many places, operating   expenses need more improvement. The company's Q1 non-GAAP loss   from operations was $22 million, which was an improvement over   last year's Q1 loss of $31 million.",
    "Although CrowdStrike's bottom line appears unhealthy, tech   companies have a history of running at a loss for years before   turning profitable. As CrowdStrike invests in technical advances   such as being the first to deliver its cloud-based endpoint   protection system to mobile devices, it will continue to operate   in the red in favor of growing market share and its customer   base.",
    "These early investments enabled CrowdStrike to become a leader   in the cybersecurity space. It's proven to be a smart strategy   that has led to an average of 20% revenue growth over the last   three quarters.",
    "CrowdStrike's upcoming Q2 earnings report (scheduled for   Thursday) will confirm if the company can continue to deliver   consistent performance. Given its advantages and track record of   success, CrowdStrike is well-positioned to continue its exciting   growth.",
    "  10 stocks we like better than CrowdStrike Holdings,     Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and CrowdStrike Holdings,     Inc. wasn't one of them! That's right -- they think these 10     stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than CrowdStrike Holdings,     Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and CrowdStrike Holdings,     Inc. wasn't one of them! That's right -- they think these 10     stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. Suzanne Frey, an executive at Alphabet, is a member     of The Motley Fool's board of directors. Teresa Kersten, an     employee of LinkedIn, a Microsoft subsidiary, is a member of     The Motley Fool's board of directors.     Robert Izquierdo      owns shares of Microsoft. The Motley Fool owns shares of and     recommends Alphabet (A shares), Alphabet (C shares), Amazon,     and Microsoft. The Motley Fool owns shares of CrowdStrike     Holdings, Inc and has the following options: long January 2021     $85 calls on Microsoft. The Motley Fool recommends Gartner and     VMware. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 17:23:00"
}