{
  "url": "https://www.nasdaq.com/article/lovesac-co-love-q2-2020-earnings-call-transcript-cm1210656",
  "title": "LOVESAC CO (LOVE) Q2 2020 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   LOVESAC CO    (NASDAQ: LOVE)        Q2 2020 Earnings Call       Sep 11, 2019 ,   8:30 a.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Greetings, welcome to Lovesac Second Quarter Fiscal 2020   Earnings Conference Call. [Operator Instructions] I will now turn the conference over to Rachel Schacter of ICR.   Thank you. You may begin.  Rachel Schacter    --   Investor Relations  Thank you. Good morning, everyone. With me on the call is   Shawn Nelson, Chief Executive Officer; Jack Krause, President and   Chief Operating Officer; and Donna Dellomo, Chief Financial   Officer. Before we get started, I would like to remind you that some of   the information discussed will include forward-looking statements   regarding future events and our future financial performance.   These include statements about our future expectations, financial   projections and our plans and prospects. Actual results may   differ materially from those set forth in such statements. For a discussion of these risks and uncertainties, you should   review the company's filing with the SEC, which includes today's   press release. You should not rely on our forward-looking   statements as predictions of future events. All forward-looking   statements that we make on this call are based on assumptions and   beliefs as of today and we undertake no obligation to update   them, except as required by applicable law. Our discussion today will include non-GAAP financial measures,   including EBITDA and adjusted EBITDA. These non-GAAP measures   should be considered in addition to and not as a substitute for   or in isolation from our GAAP results. A reconciliation of the   most directly comparable GAAP financial measures to such non-GAAP   financial measure has been provided as supplemental financial   information in our press release. Now, I'd like to turn the call over to Shawn Nelson, Chief   Executive Officer of The Lovesac Company.  Shawn Nelson    --   Chief Executive Officer  Thanks, Rachel. Good morning, everybody, and thanks for   joining us today. I will begin today's call by discussing the   financial and operational highlights of our second quarter   results. After which, I'll briefly review our high level thoughts   around our outlook and provide an update on our tariff mitigation   efforts. Then, Jack Krause, our President and COO, will outline   the progress we are making on our key growth initiatives,   including details on an exciting new shop in shop program that is   launched in Q3. Finally, Donna Dellomo, our CFO will review our   financial results and a few items related to our outlook in more   detail. We feel great about our second quarter financial results. Net   sales increased by almost 45% to $48.1 million. Total comparable   sales, which includes same showroom and Internet sales, increased   40.7%, driven by a strong showroom comp increase of 31.8% and   significant growth in our Internet business of 71.5%. In Q2, we again saw our comp growth driven by both   transactions, as well as ticket growth, as our digital marketing   strategies and multi-channel model allow us to draw new customers   to the brands, while also driving repeat purchase behavior.   Adjusted EBITDA was a loss of $3.3 million for the second   quarter. Operationally, we made good progress against our strategic   priorities in the second quarter. A few highlights are: one, we   continue to lean into marketing, including a successful Memorial   Day campaign to increase brand awareness and drive sales, which   is reflected in our almost 45% top line growth for the quarter;   two, we made strategic investments in our infrastructure to   improve the overall customer shopping experience and position us   for continued success, as we scale the business, including   expanded capacity and increased accuracy of customer delivery;   three, we opened two new and remodeled three showrooms during the   quarter, as we continue to increase our showroom presence; four,   we enjoyed strong results from our pop up shop business with   Costco, and given our continued success, during the quarter, we   were given the opportunity to run an 18-day event on costco.com,   which emulates the in-store pop up shop partnership online. We had very encouraging results from this initial online   events and have plans for another two online roadshows with   Costco for later this year. In addition to our pop up shop   business with Costco, we continue to foster new relationships   with other retailers, and we are very excited to announce today   our new partnership with Macy's to pilot four permanent shop in   shop test locations. Not only will this increase our brand   awareness and drive customer acquisition, but it is also a   testament to the existing strength and appeal of our small, but   rapidly growing brand and innovative product line. Jack will   discuss our second quarter operational progress and expand on the   details of this exciting new partnership in just a moment. As it relates to our outlook, given our strong Q2 financial   performance, our marketing, and other plans for the remainder of   the year, we are reiterating today our fiscal 2020 annual revenue   guidance of 40% to 45% sales growth. We are also reiterating our   expectations for positive adjusted EBITDA for fiscal 2020. We are   very pleased to be in a position to reiterate our full year   adjusted EBITDA outlook, despite increased tariffs, which is a   testament to the tremendous progress we have made with tariff   mitigation actions, which I will now discuss. To start, I could not be more proud of our teams for their   efforts and dedication to mitigating the impact of these special   tariffs and optimizing our supply chain. Our focus on optimizing   our supply chain is threefold. Number one, swiftly relocating   manufacturing out of China; two, negotiating aggressive vendor   discounts; and three, assortment, promotional shifts and surgical   price adjustments that has shown zero negative impact on sales to   date. First, in terms of relocating manufacturing outside of China,   we have already successfully moved the majority of our Sactionals   manufacturing to Vietnam and also Malaysia for redundancy.   Sactionals without covers currently represents approximately 57%   of our overall sales, based on costs. The remaining portion of   our Sactional production will have moved entirely out of China by   the end of Q2 next year. A long term Chinese manufacturing partner of ours is currently   in construction on a new purpose built, highly automated   Sactionals factory located in Vietnam to support our continued   rapid growth, along with co-located, cut-and-sew facilities for   both Sac and Sactionals covers. Based on our success thus far, we   are confident that we will make progress this year toward   resourcing the balance of our Sac and Sactionals covers at a   similarly rapid pace and expect to have only a small percentage   of our covers manufacturing in China by the end of Q2 next   year. These expeditious production moves will eliminate our exposure   to special tariffs and also result in lower first costs for these   goods, even versus their pre-tariff levels, which you will see   starting to flow through our P&L with the turnover of the   associated inventories throughout next year. Second, regarding vendor discounts, the minority piece of our   Sactionals manufacturing that remains in China today has been   discounted by our manufacturer to a cost that offsets most of the   effect of the recently announced tariffs increase from 25% to   30%. Our cut-and-sew covers for Sacs and Sactionals and various   accessories like throw pillows and blanket, still manufactured in   China, are all subject to List 1 through 4 tariffs. And we have   recently achieved aggressive vendor discounts on all of these   items as well to carry us through the near term as we transition   nearly everything out of China. We are particularly grateful to   our vendors for their support in this area. They have been   collaborative partners and most of them are moving their   operations with us out of China to various other countries in the   region to retain our business, same on costs and diversify our   overall supply chain risk. As a result of this work, we are pleased to share that as of   this month, only 44% of our total goods are now manufactured in   China, down from approximately 75% at the end of last year. And   we expect this number to continue to fall by year end by a few   more points, heading toward zero before the end of next fiscal   year, if tariffs are not lifted. It is because of all these swift   execution and sourcing, coupled with surgical assortment and   pricing adjustments and discipline expense management, that we   expect to deliver positive adjusted EBITDA, even with all of the   recent tariff elevations and additions and our growth. Essentially by the second half of next year, we project that   the majority of our products will be coming in at lower cost than   they were a year ago, and our supply chain will be far more   robust and diverse. This year, we expect gross margins to decline   temporarily by 320 basis points to 350 basis points for the full   year versus last year. But with our newly well diversified supply   chain and the lower corresponding ongoing product costs, we   expect to return our run rate gross margins percent to the   mid-50% range by the second half of next year. Because of our   exhibited pricing power, strong value proposition, collaborative   manufacturing partners and relentless innovation machine, we are   confident that we can maintain these best in class gross margins   over the long term. Finally, speaking of innovation, we are excited by the launch   of the new Sactional Power Hub this month. It is our first foray   into electronics and it opens the door into numerous new   technology innovation opportunities ahead for this brand. The   concept is patented and we believe it will not only drive repeat   business, increase basket size and our average order value, but   more importantly, because it's reverse compatible with all the   Sactionals pieces we've ever sold, reinforces our unique   commitment to our Designed for Life ethos in the aids of our   loyal customers. Sactionals are a platform that is designed to grow, evolve and   allow customers to add to it or upgrade it throughout their own   lifetime, even in ways they could not have imagined, when they   originally bought the product. Every Sactionals piece that we   have ever sold over these many years already has the receiver   hole already embedded in it, just waiting for this Power Hub, and   maybe other inventions as well, yet to come. We believe that over   the long term, this will result in customer satisfaction and   brand loyalty levels that will be unprecedented in a competitive   landscape, not to mention the platform's unique implications, in   terms of sustainability and reduced waste in landfills. So in summary, I'm very pleased with our financial and   operational progress throughout the quarter. As we look to the   second half of this year, we will continue to focus on executing   against our strategic initiatives and leveraging our distinct   competitive advantages to realize the significant growth   potential that exists for Lovesac. Before I turn the call over to Jack, I want to again thank all   of our team members for the great job that they do day in and day   out. Their hard work is driving a rapid growth and we look   forward to building on this performance, as we move into the   second half of the year. From our standpoint, it's simple, as I   hope we've demonstrated across the four quarters we reported   since becoming a public company, we are going to keep delivering   high sales growth, while maintaining positive adjusted EBITDA on   an annual basis. External challenges notwithstanding. We are very   confident in our ability to deliver on our near and long term   goals and look forward to updating you on our progress. I will now turn the call over to Jack, our President and COO,   to go over our key priorities for the remainder of this year.  Jack Krause    --   President and Chief Operating Officer  Thank you, Shawn, and good morning, everyone. As Shawn said,   we are pleased with our second quarter results. We delivered   strong financial performance and continued to execute against our   key growth initiatives. I will now review some of the operational   highlights and discuss our plans for the remainder of the   year. Starting with expanding our marketing efforts to increase   brand awareness and drive sales, our second quarter top line   results are testament to the continued effectiveness of our   marketing strategies. For the quarter, we achieved overall   comparable sales growth of 40.7%, driven by web costs of 71.5%,   and showrooms at 31.8%. Overall, Memorial Day marketing ROI   finished very strong, as indicated by our sales performance. The   Memorial Day pre-tentpole TV campaign test markets saw strong   lifts in weekly sales averages, versus their pre-12 week sales   average, increasing both sales and program ROIs. Given these encouraging results, we scaled test to 11 markets   for Labor Day, and subject to continued positive results, we will   look to scale this nationally in the fourth quarter of this   year. In terms of digital media advertising, the six-week Pinterest   test campaign during Memorial Day proved to be an efficient   driver of brand awareness and site traffic with over 360,000   clicks to the site at a very favorable CPC or cost per click. We   also saw a great engagement within the platform with almost 30   time increase in monthly viewers and an over 30x increase in   monthly engagers. Overall, we will continue to test increased digital marketing   in the second half, as we continue to see increased ROIs, as a   result of the synergy with TV advertising. We will look at new   efficient marketing strategies to drive the business, as we look   toward the fourth quarter. Importantly, many of the marketing   initiatives we have successfully tested so far this year to drive   sales will be leveraged most heavily in the fourth quarter. Next, expanding and improving our showroom presence. We opened   two new showrooms and remodeled three in the quarter, ending the   quarter with a total of 80 showrooms, and approximately 70 of our   locations having been remodeled to the current rebranded showroom   design. We remain on track to open 17 new showrooms in fiscal   2020, including showrooms in 12 new markets and improving our   penetration in five markets. Turning to our pop up shops. In the second quarter fiscal   2020, we operated 209 pop up shops with Costco, up from 137 in   the second quarter last year, which drove a 40.9% increase in our   other channels sales to $7.4 million. Pop up productivity   increased 5.1% in the quarter. As discussed on previous calls,   pop up shops have been a contributor to our growth over the past   24 months. Last year, our 10-day roadshows with Costco delivered   $1 per square foot productivity multiples higher than even our   own showrooms, driving over $19 million in net sales, which was   over a 300% year-over-year growth. In addition, we believe these pop up shops drive additional   revenue on our website both during and post show. We continue to   believe that the pop up shop format allows us to capitalize on   customer acquisition opportunities in high traffic locations by   showcasing a limited offering of our products in areas, where we   don't necessarily have a showroom presence, introducing our brand   and unique product attributes to a wider market. Due to the success of our roadshows, we work with Costco to   bring an 18-day event to costco.com, providing Lovesac with   nationwide coverage. This event ran in July and the results were   very encouraging. The dot com event generated nearly $750,000 in   sales in 18 days, and due to the success, we've scheduled an   additional two events for the balance of the year. We've also been exploring more permanent shop in shop   opportunities to deploy a similar concept with other retailers   and are very pleased to announce that we have officially entered   into a partnership with Macy's to pilot a test of shop in shops   in four highly attractive Macy's locations in Q3 of this year.   The locations include their Herald Square flagship store in New   York City, as well as Carle Place Furniture Gallery in Long   Island, Del Amo Fashion Center in L.A. County and Lenox Square in   the Buckhead district of Atlanta. Macy's is a logical choice for us, as they have demonstrated   the ability to be a leader in bringing innovation to the retail   furniture space. We have had tremendous success with pop up shops   outside of our own channels and look forward to establishing   additional reach for the Lovesac brand with Macy's, as we expand   the Lovesac shop in shop presence in an agile and efficient   manner. Unlike the Costco roadshows, which are 10-day shows, and pop   up locations, the Macy's test will be launching permanent asset   light shop in shops in key Macy's locations. We know that   experiencing the Sactionals demo is extremely important to many   customers' shopping journeys. And through this partnership, we'll   be able to deliver more demos to a broader audience and   accelerate adoption of the Sactionals platform. We believe that   Macy's brand and customer profile is a great fit with the Lovesac   brand and look forward to kicking this pilot off in Q3, with a   majority of the sales impact expected in Q4. These shop in shops will be designed to be permanent locations   carrying the same digital technology of our showrooms and will be   staffed by Lovesac employees under the direct supervision of our   Sales Operation team. Because these will be run like our own   showrooms, we expect margin rates and contribution to be similar   to our freestanding showrooms, but with significantly less CapEx   investment, less than a third of our current CapEx per   showroom.The current plan is to test these four initial locations   for at least a full year prior to expansion, and we'll continue   to update you on test details, performance and potential   expansion plans, as that information becomes available. Finally, as part of our continued investment in our team and   support of our substantial future growth, we're very excited to   announce the appointment of Tom Lee as our Chief Supply Chain   Officer effective September 9. Tom is a seasoned supply chain and   merchandising executive, and most recently served as SVP, Chief   Supply Chain Officer of SpartanNash. And prior to that, he spent   years at Walmart and Office Depot in both Senior Supply Chain and   Merchandising roles. We are very excited to have him on board and   look forward to benefiting from his expertise as we continue to   develop a world class supply chain that delivers an unparalleled   customer experience. This important addition positions the   business well for continued success. So, in summary, we are pleased with our second quarter results   and the operational progress made on our strategic priorities,   including all of the tariff mitigation work that Shawn went over.   As we look to the remainder of the year, we will continue to   focus on growing the business and strategically investing in our   infrastructure and technology to position the business for   long-term growth. Donna will discuss our guidance in further detail. But as we   look ahead, we continue to be confident in the drivers of our   business, of which we will see the greatest impact in Q4,   including the new business opportunities I just discussed with   Costco and Macy's, the marketing plans with proven highest   effectiveness and year-over-year spend increases in Q4 as well as   increased showroom opening along with the launch of the Power Hub   that Shawn discussed. And with that, for a more detailed review of our second   quarter results, as well as a few items related to our outlook, I   will now turn the call over to Donna Dellomo, our Chief Financial   Officer.  Donna Dellomo    --   Executive Vice President and Chief Financial Officer  Thank you, Jack. Good morning, everyone. I will begin my   remarks with a review of our second quarter results and then   provide some commentary around our thoughts for fiscal 2020.   Total net sales increased 44.8% to $48.1 million, from $33.2   million in the prior year quarter. This sales growth was driven   by strong showroom, Internet and pop up shop performance with   both transaction as well as ticket growth resulting from   successful advertising and marketing strategies, which drew new   customers to the brand, while also driving repeat purchase   behavior. An increase in the number of showrooms also helped fuel our Q2   sales performance. Comparable sales, which includes showroom and   Internet sales, increased 40.7%. Comparable showroom sales   increased 31.8% and represents our 11th consecutive quarter of   positive comp showroom sales increases. We opened two new   showrooms and ended the quarter with 80 showrooms. Looking at our results by channel for the second quarter,   showroom sales increased 35.8% to $31.3 million; Internet sales   increased 71.5% to $9.5 million; and our other channel, which   includes our pop up shops in Costco locations, increased 57.7% to   $7.4 million. By product category, our Sactional sales increased   51.5%, our Sac sales increased 35%, and our other category sales,   which includes decorative pillows, blankets and other   accessories, decreased to $200,000 from $800,000 in the second   quarter, as compared to the prior year quarter. Gross profit dollars increased 36.1% to $24.3 million in the   second quarter. As expected, gross margin percentage decreased by   320 basis points to 50.4% from 53.6% reported in the same period   last year. This year-over-year decline was primarily driven by   the 10% tariff impact, partially offset by reduced cost of our   Sactional and Sac products, primarily related to cost savings   from a change in the sourcing of our Lovesoft and down blend   fills in an ongoing shift of our manufacturing to Vietnam and   other countries outside of China. For the second quarter, total SG&A, excluding advertising   and marketing expense, increased 7.3% to $22 million from $20.5   million in the second quarter of last year. Excluding   approximately $300,000 of other non-recurring expenses, total   SG&A increased to $21.7 million. The increase in SG&A was   driven largely by variable expenses related to the increase in   sales, as well as higher employment costs and rent, which were   partially offset by a decrease in overhead expenses and equity   compensation as detailed in our press release. As a percentage of   sales, total SG&A expense decreased by 15.9%, driven largely   by decreases in stock compensation and IPO-related expenses as   described above. Our investments in advertising and marketing, which benefit   extended periods, increased $2.5 million or 68.8% over Q2 prior   year. As a percentage of sales, advertising and marketing   expenses increased a 180 basis points to 12.6% this quarter,   largely due to an increase in advertising related to Memorial   Day, which had a very positive ROI. Depreciation and amortization increased $447,000 from the   prior year period to $1.2 million, principally related to capital   investments for new and remodeled showrooms. In the second quarter of fiscal 2020, operating loss was $4.9   million compared to an operating loss of $7 million in the second   quarter of last year. In the second quarter of fiscal 2020,   adjusted operating loss was $4.6 million, excluding approximately   $300,000 of non-recurring expenses. In the second quarter of   fiscal 2019, adjusted operating loss was $5.7 million, excluding   approximately $1.3 million of non-recurring expenses. Net interest income was $169,000, which relates to the impact   of our IPO and other primary share financings. Tax expense in the   second quarter of fiscal 2020 and 2019 was less than $10,000 and   is related to minimum state income tax liabilities. Before we turn our attention to net income, net income per   share and EBITDA, I would like to point out, that my discussion   of these metrics will focus on net income and net income per   share adjusted for the IPO and other financing costs, as well as   adjusted EBITDA. Please refer to the terminology and   reconciliation between each of our adjusted metrics and their   most directly comparable GAAP measurements in our earnings   release issued earlier today. Adjusted net loss was $4.5 million in the second quarter of   fiscal 2020, compared to an adjusted net loss of $5.7 million in   the second quarter of fiscal 2019. Net loss per share adjusted   for the IPO and financing costs was $0.31 in the second quarter   of fiscal 2020 and $0.63 in the second quarter of fiscal 2019.   Adjusted EBITDA was a loss of $3.3 million as compared to a loss   of $2 million in the second quarter of last year. Turning to our balance sheet, we ended the quarter with $44.2   million in cash and cash equivalents. Ending inventory increased   101% year-over-year, driven by higher sales, as well as an   increased investment in the weeks of supply of inventory on hand   to support sales growth across all channels, to be agile enough   to support the success of our advertising and marketing   investments, and includes an increase in capitalized freight and   warehousing costs relative to the build in inventory and tariff   charges. Now, I would like to discuss a few items as it relates to our   fiscal 2020 outlook. From a showroom perspective, for the full   fiscal year 2020, we are on track to open 17 new showrooms for   this year with 11 showroom openings in the second half of fiscal   2020 and continue to expect to remodel eight. We are now   referring to our Costco roadshows as pop up shops and our Macy's   pilot as shop in shops, given the nature of the shop setup. As   mentioned for fiscal 2020, we will operate three Costco online   roadshows in addition to our in-store pop up shops with Costco,   as well as four pilot shop in shop locations with Macy's. We continue to expect to deliver strong levels of sales growth   between 40% to 45% in full fiscal 2020. However, we do expect Q3   revenue to be below the low end of our annual growth target with   growth of approximately 30%, while Q4 is expected to be   significantly above the high end of this annual range. This   expected cadence is due to the following items. We expect to see   a deceleration in total comp sales in Q3 with Q3 comps expected   to be slightly ahead of Q3 total sales growth, with a significant   increase in total comp sales in Q4. However, important to point   out that Q3 total comps on a two-year basis are projected to be   in line with Q2 of fiscal 2020. Normal seasonality of the   business with Q4 being our largest volume quarter; the cadence of   planned investments in marketing and advertising with investments   in working media, strategically being made late in Q3, which have   greater ROIs and greater impact on Q4 sales growth. In addition, total showroom revenue will be impacted by the   timing and the number of new showroom openings during Q3 and Q4,   which this fiscal is weighed more heavily in Q4 than Q3. The number of Costco pop up shops continue to increase over   prior year, with the most significant increase in the number of   pop up shops happening in the first half of fiscal 2020, as   compared to prior year. Second half 2020 Costco pop up shops are   projected to be as revenue productive as those in the first half   of fiscal 2020. The new initiatives that Jack mentioned to   include costco.com roadshows and the four new Macy's pilot shop   in shops will have the greatest amount of fiscal 2020 impact on   Q4 revenues. Consistent with the just discussed expected sales growth   cadence, we expect a larger Q3 adjusted EBITDA loss than we   reported in Q2, followed by a substantial improvement in Q4.   Given the significant tariff mitigation process we've made, as   Shawn discussed, we continue to expect to generate positive   adjusted EBITDA for fiscal 2020. We expect full year gross margins for fiscal 2020 to be   approximately 320 basis points to 350 basis points lower than   fiscal 2019, principally related to the following: expected   tariff pressure, which is being offset by mitigation actions and   SG&A initiatives, investments into our distribution   infrastructure to support future growth, a slight headwind due to   the continued shift in product mix toward Sactionals, as well as   a slight impact from higher pop up shop channel mix sales. These   decreases are partially offset by product margin gains relating   to changes in discounting of promotional strategies, reduced   product costs, related to vendor sourcing strategy and vendor   rebates, as well as an accelerated shift of sourcing outside   China. In terms of SG&A, excluding advertising and marketing   expense, as previously mentioned, we expect the most significant   SG&A leverage to be generated in Q4, given the seasonality of   our business. As a reminder, embedded in our SG&A outlook is   all of the investments we are making in the business across   people, process and infrastructure, and our Q4 net sales volumes   enable us to produce the greatest amount of leverage on these   investments over the prior year. So, in summary, while we continue to expect quarterly   fluctuations due to the timing of our tariff mitigation efforts,   our advertising and marketing investments and investments across   all areas of the business to support the significant growth   opportunity we have, we anticipate that we will again deliver a   high sales growth rate and will generate a positive adjusted   EBITDA in fiscal 2020. Finally, as it relates to capital expenditures, we now expect   to incur approximately $11.5 million of CapEx in fiscal 2020,   versus our prior guidance of approximately $13 million, due to a   timing shift of investments of the Sac manufacturing CapEx to   fiscal 2021. The vast majority of our CapEx will be spent on the   opening of 17 showrooms, to remodel of approximately 8 legacy   stores, the opening of 4 Macy's shop in shop pilot locations, and   approximately $1.3 million being invested into the Sac   manufacturing facility this fiscal. The remaining spend is being allocated to technology in our   showrooms, inventory management and logistics systems, e-commerce   platform enhancements and for headquarters data and support   systems. For all other details related to our results, please   refer to our earnings press release. With that, we would like to turn the call back to the   operator, who can open it up for questions. Operator? Questions and Answers:  Operator  Thank you. [Operator Instructions] Our first question is from   Dave King with ROTH Capital Partners. Please proceed.  Dave King    --   ROTH Capital Partners -- Analyst  Thanks. Good morning, everyone. I guess, first off, what's   driving the confidence in the Q4 growth versus the Q3 guidance   you laid out? It sounds like that some of that's Macy's, but what   are you anticipating from a two-year comp perspective versus what   you had in Q2, and what you're expecting for Q3 and what's   driving that?  Jack Krause    --   President and Chief Operating Officer  Yes, consistently -- hey, Dave, this is Jack. We believe,   roughly speaking, the two-year comps will maintain pretty   consistent throughout the year. Obviously, we're going against   tougher and tougher comparables. And the reason we feel confident   in that is, it's harder to see in terms of total marketing spend   on a quarter to quarter basis, but the working marketing, the   effect of our working marketing, which starts in Q3 and goes into   Q4 will be by far the greatest impact in Q4 with roughly   year-over-year working media spends plus -- over plus 60%   [Phonetic], whereas if you look at the effect of the Q3 media, it   was roughly flat to a year ago. So that will give us a dramatic   increase in comparable sales acceleration.  Dave King    --   ROTH Capital Partners -- Analyst  Okay. That helps.  Jack Krause    --   President and Chief Operating Officer  And just a background on that, the reason that we're doing   that delay is, as we've talked about earlier, we've had several   tests going on. And as we do our analysis, the opportunities to   implement have come really in the Q4 versus Q3.  Dave King    --   ROTH Capital Partners -- Analyst  Okay. And so, I know it's a little bit early on that front,   but can you talk about the initial performance of the expanded   regional media runs you had prior to Labor Day, are the ROIs   increasing, you know, any early learnings so far?  Jack Krause    --   President and Chief Operating Officer  Yeah. The pre-tentpole events, so the expansion of the events   is showing increases in ROI and run rate. So at this point, we   believe they will be part of the Q4 program. What I'll do -- I'll   need to do is, we still haven't done sort of the final analysis   of our Labor Day media. So, we'll be finalizing that in the next   couple of weeks and then putting it into a Q4 finalized   program.  Dave King    --   ROTH Capital Partners -- Analyst  Okay. That's good color. All right. Thanks for taking my   questions.  Operator  Our next question is from Brian Nagel with Oppenheimer &   Company. Please proceed.  Brian Nagel    --   Oppenheimer & Company -- Analyst  Nice quarter.  Shawn Nelson    --   Chief Executive Officer  Thanks, Brian.  Brian Nagel    --   Oppenheimer & Company -- Analyst  The first question, I want to ask, and I apologize, Donna,   when you were laying out the guidance for sales, Q3 and Q4, I   maybe just missed it. Could you remind or reiterate what the   sales guidance for the third and fourth quarter is and the   components of that?  Donna Dellomo    --   Executive Vice President and Chief Financial Officer  Yes. What we were saying is that year-over-year, total sales,   well, we're expecting to increase about 30% with a significant   increase in fourth quarter. So we are still lining in to the   annual guidance of 40% to 45%. So we didn't give guidance for Q4,   but it will be significantly higher than the high range of the   40% to 45% annual guidance that we've provided.  Brian Nagel    --   Oppenheimer & Company -- Analyst  Got it. We can back into that just given that it's basically a   missing piece. But -- and then the primary reason for that,   again, I'm sorry, because I know, I think you've reiterated it, I   just want to make sure I get this right. The primary reason for   that, sort of say choppiness is, one, more difficult comparison;   and then, two, just the cadence of the marketing investment?  Jack Krause    --   President and Chief Operating Officer  Yes, there are two things. So, you're right. So that, I will   confirm that comment. And it's really broken into two things. So   you have, on a comp basis, I just explained that, that we're   dramatically increasing our marketing, relatively speaking, our   working marketing in the fourth quarter relative to the third,   and we believe we'll get significantly higher lifts. The other component of that is just initiatives. So, for   example, in the fourth quarter, we'll have a dramatic increase in   new showroom openings versus the third. The third quarter was   really our lowest rate of new showroom openings we've had in the   last several quarters. And in the fourth quarter, we will also   get the results of the Macy's shop in shop roll out, as well as   the two additional Costco shows we mentioned. So those will have   an incremental effect. So we have some comp effects as well as   just new business initiatives kicking in, in the fourth   quarter.  Brian Nagel    --   Oppenheimer & Company -- Analyst  Got it. Then the other question I had, just with regard to   gross margins, clearly, you've been, as you articulated in the   press release and your prepared comments, there have been a lot   of efforts done to deal with, so to say, the tariff, so congrats   on that. As we look at the gross margin degradation here in the   second quarter, is there a way to parse that out of how much of   that -- as we're down 330 basis points year-on-year, how much of   that is investment or one-time in nature as you deal with these   tariffs versus a newer run rate type number?  Donna Dellomo    --   Executive Vice President and Chief Financial Officer  Yes. The guidance that we had given, and it's still pretty   consistent that about 75% of that decrease in margin   year-over-year is related to the tariff pressure. The other 25%   relates to initiatives we have with opening up multiple   warehouses, investing into some infrastructure, some cost   increases on FedEx, some cost increases relative to the increase   in inventory levels, but the majority are at a minimum of 75%   that relates to the impact with tariffs.  Brian Nagel    --   Oppenheimer & Company -- Analyst  Got it. And then my final question with regard to Macy's, the   Macy's, recognizing it's very, very early, how should we think   about -- it sounds to me like the Macy's initiative will be   closer to or more now like, so to say to two of your own   showrooms, but how should we think about the economics of Macy's   location in a showroom? And then the second question on that is, now this is Costco,   Macy's, are you in discussions whether should we expect other   type of retail partnerships in the not too distant future?  Jack Krause    --   President and Chief Operating Officer  Yes. Good question. So I think you're right. I think Macy's is   more analogous to our own showrooms, really with that being an   asset light execution. So we expect the CapEx spends on the   Macy's to be less than a third of a normal showroom. And we   expect those to -- obviously, it's pretty easy to assume our   hurdle rate would be the same types of returns, we want to get,   as we would in showrooms. So if you look at the CapEx that way,   you could easily say that roughly between 30% to 50% of the run   rate of a Macy's shop in shop will be roughly 30% to 50% of a   normal showroom. Obviously, there are huge exceptions. For example, Herald   Square is a substantial opportunity, so that we'd look at that   separately. But it's very early, so, you know, obviously, I think   the best way to look at it is look at the math and the CapEx   investment, and the way we're running them, and you got to model   in what do you think makes sense, because that's going to be as   close as it is right now, because what we're really doing is   testing it out.  Brian Nagel    --   Oppenheimer & Company -- Analyst  Got it. Thank you.  Operator  Our next question is from Thomas Forte with D.A. Davidson.   Please proceed.  Thomas Forte    --   D.A. Davidson -- Analyst  Great. Thanks for taking my questions. I had a couple of   follow ups on Macy's. So the first question I had is, and I know   Jack touched on this a little, but why Macy's? Do you feel like   they have a similar core customer base just in general? And then   how should we think about the economics of the Macy's versus   Costco? And then refining that last question, so if this pilot   results in more shop in shops in Macy's, would you then limit   adjacent showroom locations near those shop in shop?  Jack Krause    --   President and Chief Operating Officer  Good question. So one is why Macy's? I think, what we're   really looking at -- I think, the one thing to do is think of   this as a collaboration with Macy's and their top stores. So if   you look at the top 100 Macy's to the top 50 Macy's, we see a lot   of shared attributes with our customers. Macy's is also a   significant retailer in the furniture segment with hundreds of   millions of dollars sold there. So we think it's a huge   opportunity for furniture shoppers with a light characteristics   to be able to experience our product. And especially in those top   Macy's, they're really doing a lot of interesting things. And I   think that -- I think it will be a great partnership. In terms of the way it works, since they are working much more   like a showroom in terms of the way we will staff them with our   own employees, we manage them through our own system and we are   essentially paying a rent rate to be inside of them, that we   expect the contribution of these to be significantly higher than   what we've seen in the Costco pop up shops, because of the way   those are run.  Thomas Forte    --   D.A. Davidson -- Analyst  And then adjacencies for other showrooms, would you not build   a showroom within a close proximity to Macy's shop in shop?  Jack Krause    --   President and Chief Operating Officer  Yes, a little bit of insight into that. So the way we're   running the Macy's test, the reason we ran those four is for some   interesting test parameters. So, for example, Herald Square is   very close to our Flatiron District showroom. So we'll look at   what happens between showrooms that are less than a mile apart.   We'll also have a test which has a showroom in the same mall as   the Macy's, and we'll have that opportunity to see what happens.   And then we have a showroom in the Carle Place, Macy's, as this   is one of their furniture locations and we'll see what happens   there. So really at this point that -- the primary purpose of   this test is to understand the dynamics and then to start laying   out a plan in terms of how we maximize our penetration at the   most efficient way and also do it in a win-win way with our   Macy's partners.  Thomas Forte    --   D.A. Davidson -- Analyst  Great. Sounds very thoughtful, Jack. Thank you very much.  Jack Krause    --   President and Chief Operating Officer  Thank you, Tom.  Operator  Our next question is from Alex Fuhrman with Craig-Hallum.   Please proceed.  Alex Fuhrman    --   Craig-Hallum -- Analyst  Great. Thanks very much for taking my question and   congratulations on another very strong quarter. You know, couple   of things that I wanted to touch on here. One is, you know, it   certainly sounds like you guys have made a lot of progress in   moving your production out of China and have a good line of sight   to being completely out of there. You know, it sounds like you're   -- you know, relative to the prior conference call, it sounds   like that that has moved a lot faster and better than   expected. Can you give us a sense of what's driving that? I mean, it   sounds like your vendors have been incredibly supportive. Has   there just been more buy in and capital commitment on the part of   your vendors than you expected? Just kind of curious why you've   been able to accelerate that so nicely?  Shawn Nelson    --   Chief Executive Officer  Yes. Great question. We have been moving very rapidly, and we   intend to continue moving rapidly. I don't believe that we ever   intended to go slow. I just don't think we gave specific guidance   on how fast we thought we could do it. I think everything's   moving according to our plan, and it's exactly that our current   suppliers have been very supportive, and in most cases, as I   described, are investing themselves in other countries outside of   China, Malaysia, Vietnam and even some others that are coming   up. And meanwhile, for the goods that are left behind still,   they're offering us heavy discounts in order to keep that   business and kind of get through the tunnel as it were, with   their lights on, so that they can support us on the other side   outside of China. And so, I think, it's just a confluence of   things going well, things going according to plan. And, you know,   our ability to execute, which obviously in the public markets,   you know, we're only a year out. And I think it's a matter of   those watching Lovesac, getting familiar with how we operate.  Alex Fuhrman    --   Craig-Hallum -- Analyst  Great. That's really helpful. Thanks, Shawn. And then, you   know, couple of questions just on the Macy's partnership.   Obviously, this sounds like a huge opportunity. You know, big   difference relative to Costco. I imagined, is that Macy's is a   large furniture retailer on their own. And I'm curious, if you   have a sense of or if it's been a big part of your negotiations   with Macy's, where in the stores, your shop in shops are going to   be located, are they going to be in the furniture sections, or   are you maybe going to do some that are near other furniture   brands and some that aren't? Just curious, you know, how we   should think about the placement of those shop in shops? And then   it's going to be your own employees, is it fair to assume that   you will be able to capture all of the customer data and own that   customer relationship?  Jack Krause    --   President and Chief Operating Officer  Great questions. Yes. Our team, I can tell you it varies by,   you know, the Macy's organization from the way they operate,   obviously, because of the -- the stores are such a big volume and   they have independent store management. The negotiations are   store by store. We literally have to do walk throughs with their   teams in every store. What I can tell you is that, they really believe in terms of   the Macy's, I'd say that the Macy's evolution, they believe this   type of relationship is critical and they're putting us in key   places. And we walked to stores with them and are very happy with   the locations. And they're primarily very strong locations. Not   necessarily obviously next to furniture, because in a lot of the   locations we're testing, they're not even in furniture section.   So that's part of our learning agenda, as to figure out what   works most. And I would expect coming out of this, along with the answer   to some of Tom's questions, would be some answers to your   questions in terms of what adjacencies are working most   effectively? What parts of the model are working? Are there   attributes of a Macy's store over another store that allow us to   accelerate the fastest? That's all that we're trying to do now,   so that hopefully the next time we talk about this, we have some   answers and we start laying out an execution plan. So good   questions and we'll keep you posted on it.  Alex Fuhrman    --   Craig-Hallum -- Analyst  Great. Thanks very much for that. And then, lastly, you know,   your marketing has, of course, been very successful over the last   couple of years and TV seems to have played a nice role in that.   You know, it looks like up until the last couple of months, it   have basically been different versions of the same TV commercial.   And then you came out with a different creative, a few months   ago. Can you talk a little bit about, have you seen a lift from   that new TV creative or was there maybe something kind of a magic   formula in the last commercial? Just kind of curious, you know,   now that you've got your second commercial out there in the   market, what type of response you've seen from that?  Jack Krause    --   President and Chief Operating Officer  Yes. Good question. I would say that we were very careful,   obviously, because we had such a successful creative execution as   we started with this new execution. We tested these   quantitatively and the new and a quantitative research mode, in   terms of persuasion and brand, attributes, et cetera. The new   commercial actually tested equal to or better than the old one   across the board. We also can tell you that initial results on   the new television are showing that, it's driving traffic at   levels that we expect it to drive at historically. Now, other than that, I think you start to get into a whole   media mix discussion, which I can't get into, because we still   don't have the total results for the Labor Day media run, which   is still being analyzed and actually still, you know, the post   Labor Day work is still going on. So we'll probably have a lot   more information for you in the next quarter about that. But   we're feeling very good about the creative overall.  Alex Fuhrman    --   Craig-Hallum -- Analyst  That's terrific. Well, thanks very much, all of you.  Jack Krause    --   President and Chief Operating Officer  Thank you.  Donna Dellomo    --   Executive Vice President and Chief Financial Officer  Thank you.  Operator  Next, we have a follow-up question from Thomas Forte with D.A.   Davidson. Please proceed.  Thomas Forte    --   D.A. Davidson -- Analyst  Great. Thanks. So an investor asked me to ask the following   question. They are really impressed with your comments on your   gross margin outlook for next year returning to the mid-50s. Can   you once again discuss what are the inputs that will drive that   strong gross margin performance next year?  Shawn Nelson    --   Chief Executive Officer  Yes. I mean, the pressure on the business has been largely   tariffs, as Donna has spoked to. You know, we have a few other   outside pieces, be it freights or pressures in the supply chain,   logistics, et cetera, that are small and Donna can touch on that,   but the vast majority has been tariff. So as we mitigate those   tariffs primarily through exiting China. Not only are we then   tariffs free, as it were, at least special tariff free. But we   also, as I mentioned, are getting lower first costs in these   outside countries. And so we were operating in the mid-50s range   on gross margins, and we expect to get right back to that as that   product flows through our supply chain. So it will be the second half of next year, before on a run   rate basis, we begin to see that return to those levels. And, you   know, because it's a run rate basis, it may take even longer to   flow to the P&L, as it were. But we feel very good about our   ability to get back there and our ability to maintain that on the   go forward. And I don't know, Donna, if you have anything else to   add?  Donna Dellomo    --   Executive Vice President and Chief Financial Officer  Yes. I mean, that's really -- the major component is the   tariff. The -- some investments into infrastructure, which we   will still continue to see through next year. And then I think   we'll start to see less of an impact on the shift to the pop up   shops and Sactionals. I think, we're seeing the greatest amount   of that shift happening now. So when that all starts to level   itself out, as Shawn has mentioned, we'll start to see on a run   rate, start to see those margins elevate. We don't expect the   full year to come in at that, but we'll start to see the quarters   in the second half start to elevate to the higher mid-50%   range.  Thomas Forte    --   D.A. Davidson -- Analyst  Great. Thank you, Shawn. Thank you, Donna.  Jack Krause    --   President and Chief Operating Officer  Yes. And just to add a note and beyond that, I think it's   important to state that, you know, we've just hired Tom Lee as   our Chief Supply Chain Officer. And I think in the next 18 months   to 24 months, we'll really be working on combining that supply   chain and the logistics aspects into a value chain, that allows   us to start leveraging other areas. So I think we've only just   begun to really get efficient as a company, and we'll be catching   up with that growth in the next 18 months to 24 months outside of   the whole tariffs issue.  Thomas Forte    --   D.A. Davidson -- Analyst  Great. Thank you, Jack.  Jack Krause    --   President and Chief Operating Officer  Thank you.  Operator  We have reached the end of our question-and-answer session. I   would like to turn the call back over to management for closing   remarks.  Shawn Nelson    --   Chief Executive Officer  Thanks very much for your support as investors, and we   appreciate all the questions and encourage you to continue to   keep an eye on us, as we grow.  Operator  [Operator Closing Remarks]  Duration: 56 minutes  Call participants:  Rachel Schacter    --   Investor Relations   Shawn Nelson    --   Chief Executive Officer   Jack Krause    --   President and Chief Operating Officer   Donna Dellomo    --   Executive Vice President and Chief Financial Officer   Dave King    --   ROTH Capital Partners -- Analyst   Brian Nagel    --   Oppenheimer & Company -- Analyst   Thomas Forte    --   D.A. Davidson -- Analyst   Alex Fuhrman    --   Craig-Hallum -- Analyst   More LOVE analysis   All earnings call transcripts        10 stocks we like better than The Lovesac   Company     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and The Lovesac   Company wasn't one of them! That's right -- they think   these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " LOVESAC CO    (NASDAQ: LOVE)        Q2 2020 Earnings Call       Sep 11, 2019 ,   8:30 a.m. ET ",
    " Operator ",
    "Greetings, welcome to Lovesac Second Quarter Fiscal 2020   Earnings Conference Call. [Operator Instructions]",
    "I will now turn the conference over to Rachel Schacter of ICR.   Thank you. You may begin.",
    " Rachel Schacter    --   Investor Relations ",
    "Thank you. Good morning, everyone. With me on the call is   Shawn Nelson, Chief Executive Officer; Jack Krause, President and   Chief Operating Officer; and Donna Dellomo, Chief Financial   Officer.",
    "Before we get started, I would like to remind you that some of   the information discussed will include forward-looking statements   regarding future events and our future financial performance.   These include statements about our future expectations, financial   projections and our plans and prospects. Actual results may   differ materially from those set forth in such statements.",
    "For a discussion of these risks and uncertainties, you should   review the company's filing with the SEC, which includes today's   press release. You should not rely on our forward-looking   statements as predictions of future events. All forward-looking   statements that we make on this call are based on assumptions and   beliefs as of today and we undertake no obligation to update   them, except as required by applicable law.",
    "Our discussion today will include non-GAAP financial measures,   including EBITDA and adjusted EBITDA. These non-GAAP measures   should be considered in addition to and not as a substitute for   or in isolation from our GAAP results. A reconciliation of the   most directly comparable GAAP financial measures to such non-GAAP   financial measure has been provided as supplemental financial   information in our press release.",
    "Now, I'd like to turn the call over to Shawn Nelson, Chief   Executive Officer of The Lovesac Company.",
    " Shawn Nelson    --   Chief Executive Officer ",
    "Thanks, Rachel. Good morning, everybody, and thanks for   joining us today. I will begin today's call by discussing the   financial and operational highlights of our second quarter   results. After which, I'll briefly review our high level thoughts   around our outlook and provide an update on our tariff mitigation   efforts. Then, Jack Krause, our President and COO, will outline   the progress we are making on our key growth initiatives,   including details on an exciting new shop in shop program that is   launched in Q3. Finally, Donna Dellomo, our CFO will review our   financial results and a few items related to our outlook in more   detail.",
    "We feel great about our second quarter financial results. Net   sales increased by almost 45% to $48.1 million. Total comparable   sales, which includes same showroom and Internet sales, increased   40.7%, driven by a strong showroom comp increase of 31.8% and   significant growth in our Internet business of 71.5%.",
    "In Q2, we again saw our comp growth driven by both   transactions, as well as ticket growth, as our digital marketing   strategies and multi-channel model allow us to draw new customers   to the brands, while also driving repeat purchase behavior.   Adjusted EBITDA was a loss of $3.3 million for the second   quarter.",
    "Operationally, we made good progress against our strategic   priorities in the second quarter. A few highlights are: one, we   continue to lean into marketing, including a successful Memorial   Day campaign to increase brand awareness and drive sales, which   is reflected in our almost 45% top line growth for the quarter;   two, we made strategic investments in our infrastructure to   improve the overall customer shopping experience and position us   for continued success, as we scale the business, including   expanded capacity and increased accuracy of customer delivery;   three, we opened two new and remodeled three showrooms during the   quarter, as we continue to increase our showroom presence; four,   we enjoyed strong results from our pop up shop business with   Costco, and given our continued success, during the quarter, we   were given the opportunity to run an 18-day event on costco.com,   which emulates the in-store pop up shop partnership online.",
    "We had very encouraging results from this initial online   events and have plans for another two online roadshows with   Costco for later this year. In addition to our pop up shop   business with Costco, we continue to foster new relationships   with other retailers, and we are very excited to announce today   our new partnership with Macy's to pilot four permanent shop in   shop test locations. Not only will this increase our brand   awareness and drive customer acquisition, but it is also a   testament to the existing strength and appeal of our small, but   rapidly growing brand and innovative product line. Jack will   discuss our second quarter operational progress and expand on the   details of this exciting new partnership in just a moment.",
    "As it relates to our outlook, given our strong Q2 financial   performance, our marketing, and other plans for the remainder of   the year, we are reiterating today our fiscal 2020 annual revenue   guidance of 40% to 45% sales growth. We are also reiterating our   expectations for positive adjusted EBITDA for fiscal 2020. We are   very pleased to be in a position to reiterate our full year   adjusted EBITDA outlook, despite increased tariffs, which is a   testament to the tremendous progress we have made with tariff   mitigation actions, which I will now discuss.",
    "To start, I could not be more proud of our teams for their   efforts and dedication to mitigating the impact of these special   tariffs and optimizing our supply chain. Our focus on optimizing   our supply chain is threefold. Number one, swiftly relocating   manufacturing out of China; two, negotiating aggressive vendor   discounts; and three, assortment, promotional shifts and surgical   price adjustments that has shown zero negative impact on sales to   date.",
    "First, in terms of relocating manufacturing outside of China,   we have already successfully moved the majority of our Sactionals   manufacturing to Vietnam and also Malaysia for redundancy.   Sactionals without covers currently represents approximately 57%   of our overall sales, based on costs. The remaining portion of   our Sactional production will have moved entirely out of China by   the end of Q2 next year.",
    "A long term Chinese manufacturing partner of ours is currently   in construction on a new purpose built, highly automated   Sactionals factory located in Vietnam to support our continued   rapid growth, along with co-located, cut-and-sew facilities for   both Sac and Sactionals covers. Based on our success thus far, we   are confident that we will make progress this year toward   resourcing the balance of our Sac and Sactionals covers at a   similarly rapid pace and expect to have only a small percentage   of our covers manufacturing in China by the end of Q2 next   year.",
    "These expeditious production moves will eliminate our exposure   to special tariffs and also result in lower first costs for these   goods, even versus their pre-tariff levels, which you will see   starting to flow through our P&L with the turnover of the   associated inventories throughout next year.",
    "Second, regarding vendor discounts, the minority piece of our   Sactionals manufacturing that remains in China today has been   discounted by our manufacturer to a cost that offsets most of the   effect of the recently announced tariffs increase from 25% to   30%. Our cut-and-sew covers for Sacs and Sactionals and various   accessories like throw pillows and blanket, still manufactured in   China, are all subject to List 1 through 4 tariffs. And we have   recently achieved aggressive vendor discounts on all of these   items as well to carry us through the near term as we transition   nearly everything out of China. We are particularly grateful to   our vendors for their support in this area. They have been   collaborative partners and most of them are moving their   operations with us out of China to various other countries in the   region to retain our business, same on costs and diversify our   overall supply chain risk.",
    "As a result of this work, we are pleased to share that as of   this month, only 44% of our total goods are now manufactured in   China, down from approximately 75% at the end of last year. And   we expect this number to continue to fall by year end by a few   more points, heading toward zero before the end of next fiscal   year, if tariffs are not lifted. It is because of all these swift   execution and sourcing, coupled with surgical assortment and   pricing adjustments and discipline expense management, that we   expect to deliver positive adjusted EBITDA, even with all of the   recent tariff elevations and additions and our growth.",
    "Essentially by the second half of next year, we project that   the majority of our products will be coming in at lower cost than   they were a year ago, and our supply chain will be far more   robust and diverse. This year, we expect gross margins to decline   temporarily by 320 basis points to 350 basis points for the full   year versus last year. But with our newly well diversified supply   chain and the lower corresponding ongoing product costs, we   expect to return our run rate gross margins percent to the   mid-50% range by the second half of next year. Because of our   exhibited pricing power, strong value proposition, collaborative   manufacturing partners and relentless innovation machine, we are   confident that we can maintain these best in class gross margins   over the long term.",
    "Finally, speaking of innovation, we are excited by the launch   of the new Sactional Power Hub this month. It is our first foray   into electronics and it opens the door into numerous new   technology innovation opportunities ahead for this brand. The   concept is patented and we believe it will not only drive repeat   business, increase basket size and our average order value, but   more importantly, because it's reverse compatible with all the   Sactionals pieces we've ever sold, reinforces our unique   commitment to our Designed for Life ethos in the aids of our   loyal customers.",
    "Sactionals are a platform that is designed to grow, evolve and   allow customers to add to it or upgrade it throughout their own   lifetime, even in ways they could not have imagined, when they   originally bought the product. Every Sactionals piece that we   have ever sold over these many years already has the receiver   hole already embedded in it, just waiting for this Power Hub, and   maybe other inventions as well, yet to come. We believe that over   the long term, this will result in customer satisfaction and   brand loyalty levels that will be unprecedented in a competitive   landscape, not to mention the platform's unique implications, in   terms of sustainability and reduced waste in landfills.",
    "So in summary, I'm very pleased with our financial and   operational progress throughout the quarter. As we look to the   second half of this year, we will continue to focus on executing   against our strategic initiatives and leveraging our distinct   competitive advantages to realize the significant growth   potential that exists for Lovesac.",
    "Before I turn the call over to Jack, I want to again thank all   of our team members for the great job that they do day in and day   out. Their hard work is driving a rapid growth and we look   forward to building on this performance, as we move into the   second half of the year. From our standpoint, it's simple, as I   hope we've demonstrated across the four quarters we reported   since becoming a public company, we are going to keep delivering   high sales growth, while maintaining positive adjusted EBITDA on   an annual basis. External challenges notwithstanding. We are very   confident in our ability to deliver on our near and long term   goals and look forward to updating you on our progress.",
    "I will now turn the call over to Jack, our President and COO,   to go over our key priorities for the remainder of this year.",
    " Jack Krause    --   President and Chief Operating Officer ",
    "Thank you, Shawn, and good morning, everyone. As Shawn said,   we are pleased with our second quarter results. We delivered   strong financial performance and continued to execute against our   key growth initiatives. I will now review some of the operational   highlights and discuss our plans for the remainder of the   year.",
    "Starting with expanding our marketing efforts to increase   brand awareness and drive sales, our second quarter top line   results are testament to the continued effectiveness of our   marketing strategies. For the quarter, we achieved overall   comparable sales growth of 40.7%, driven by web costs of 71.5%,   and showrooms at 31.8%. Overall, Memorial Day marketing ROI   finished very strong, as indicated by our sales performance. The   Memorial Day pre-tentpole TV campaign test markets saw strong   lifts in weekly sales averages, versus their pre-12 week sales   average, increasing both sales and program ROIs.",
    "Given these encouraging results, we scaled test to 11 markets   for Labor Day, and subject to continued positive results, we will   look to scale this nationally in the fourth quarter of this   year.",
    "In terms of digital media advertising, the six-week Pinterest   test campaign during Memorial Day proved to be an efficient   driver of brand awareness and site traffic with over 360,000   clicks to the site at a very favorable CPC or cost per click. We   also saw a great engagement within the platform with almost 30   time increase in monthly viewers and an over 30x increase in   monthly engagers.",
    "Overall, we will continue to test increased digital marketing   in the second half, as we continue to see increased ROIs, as a   result of the synergy with TV advertising. We will look at new   efficient marketing strategies to drive the business, as we look   toward the fourth quarter. Importantly, many of the marketing   initiatives we have successfully tested so far this year to drive   sales will be leveraged most heavily in the fourth quarter.",
    "Next, expanding and improving our showroom presence. We opened   two new showrooms and remodeled three in the quarter, ending the   quarter with a total of 80 showrooms, and approximately 70 of our   locations having been remodeled to the current rebranded showroom   design. We remain on track to open 17 new showrooms in fiscal   2020, including showrooms in 12 new markets and improving our   penetration in five markets.",
    "Turning to our pop up shops. In the second quarter fiscal   2020, we operated 209 pop up shops with Costco, up from 137 in   the second quarter last year, which drove a 40.9% increase in our   other channels sales to $7.4 million. Pop up productivity   increased 5.1% in the quarter. As discussed on previous calls,   pop up shops have been a contributor to our growth over the past   24 months. Last year, our 10-day roadshows with Costco delivered   $1 per square foot productivity multiples higher than even our   own showrooms, driving over $19 million in net sales, which was   over a 300% year-over-year growth.",
    "In addition, we believe these pop up shops drive additional   revenue on our website both during and post show. We continue to   believe that the pop up shop format allows us to capitalize on   customer acquisition opportunities in high traffic locations by   showcasing a limited offering of our products in areas, where we   don't necessarily have a showroom presence, introducing our brand   and unique product attributes to a wider market.",
    "Due to the success of our roadshows, we work with Costco to   bring an 18-day event to costco.com, providing Lovesac with   nationwide coverage. This event ran in July and the results were   very encouraging. The dot com event generated nearly $750,000 in   sales in 18 days, and due to the success, we've scheduled an   additional two events for the balance of the year.",
    "We've also been exploring more permanent shop in shop   opportunities to deploy a similar concept with other retailers   and are very pleased to announce that we have officially entered   into a partnership with Macy's to pilot a test of shop in shops   in four highly attractive Macy's locations in Q3 of this year.   The locations include their Herald Square flagship store in New   York City, as well as Carle Place Furniture Gallery in Long   Island, Del Amo Fashion Center in L.A. County and Lenox Square in   the Buckhead district of Atlanta.",
    "Macy's is a logical choice for us, as they have demonstrated   the ability to be a leader in bringing innovation to the retail   furniture space. We have had tremendous success with pop up shops   outside of our own channels and look forward to establishing   additional reach for the Lovesac brand with Macy's, as we expand   the Lovesac shop in shop presence in an agile and efficient   manner.",
    "Unlike the Costco roadshows, which are 10-day shows, and pop   up locations, the Macy's test will be launching permanent asset   light shop in shops in key Macy's locations. We know that   experiencing the Sactionals demo is extremely important to many   customers' shopping journeys. And through this partnership, we'll   be able to deliver more demos to a broader audience and   accelerate adoption of the Sactionals platform. We believe that   Macy's brand and customer profile is a great fit with the Lovesac   brand and look forward to kicking this pilot off in Q3, with a   majority of the sales impact expected in Q4.",
    "These shop in shops will be designed to be permanent locations   carrying the same digital technology of our showrooms and will be   staffed by Lovesac employees under the direct supervision of our   Sales Operation team. Because these will be run like our own   showrooms, we expect margin rates and contribution to be similar   to our freestanding showrooms, but with significantly less CapEx   investment, less than a third of our current CapEx per   showroom.The current plan is to test these four initial locations   for at least a full year prior to expansion, and we'll continue   to update you on test details, performance and potential   expansion plans, as that information becomes available.",
    "Finally, as part of our continued investment in our team and   support of our substantial future growth, we're very excited to   announce the appointment of Tom Lee as our Chief Supply Chain   Officer effective September 9. Tom is a seasoned supply chain and   merchandising executive, and most recently served as SVP, Chief   Supply Chain Officer of SpartanNash. And prior to that, he spent   years at Walmart and Office Depot in both Senior Supply Chain and   Merchandising roles. We are very excited to have him on board and   look forward to benefiting from his expertise as we continue to   develop a world class supply chain that delivers an unparalleled   customer experience. This important addition positions the   business well for continued success.",
    "So, in summary, we are pleased with our second quarter results   and the operational progress made on our strategic priorities,   including all of the tariff mitigation work that Shawn went over.   As we look to the remainder of the year, we will continue to   focus on growing the business and strategically investing in our   infrastructure and technology to position the business for   long-term growth.",
    "Donna will discuss our guidance in further detail. But as we   look ahead, we continue to be confident in the drivers of our   business, of which we will see the greatest impact in Q4,   including the new business opportunities I just discussed with   Costco and Macy's, the marketing plans with proven highest   effectiveness and year-over-year spend increases in Q4 as well as   increased showroom opening along with the launch of the Power Hub   that Shawn discussed.",
    "And with that, for a more detailed review of our second   quarter results, as well as a few items related to our outlook, I   will now turn the call over to Donna Dellomo, our Chief Financial   Officer.",
    " Donna Dellomo    --   Executive Vice President and Chief Financial Officer ",
    "Thank you, Jack. Good morning, everyone. I will begin my   remarks with a review of our second quarter results and then   provide some commentary around our thoughts for fiscal 2020.   Total net sales increased 44.8% to $48.1 million, from $33.2   million in the prior year quarter. This sales growth was driven   by strong showroom, Internet and pop up shop performance with   both transaction as well as ticket growth resulting from   successful advertising and marketing strategies, which drew new   customers to the brand, while also driving repeat purchase   behavior.",
    "An increase in the number of showrooms also helped fuel our Q2   sales performance. Comparable sales, which includes showroom and   Internet sales, increased 40.7%. Comparable showroom sales   increased 31.8% and represents our 11th consecutive quarter of   positive comp showroom sales increases. We opened two new   showrooms and ended the quarter with 80 showrooms.",
    "Looking at our results by channel for the second quarter,   showroom sales increased 35.8% to $31.3 million; Internet sales   increased 71.5% to $9.5 million; and our other channel, which   includes our pop up shops in Costco locations, increased 57.7% to   $7.4 million. By product category, our Sactional sales increased   51.5%, our Sac sales increased 35%, and our other category sales,   which includes decorative pillows, blankets and other   accessories, decreased to $200,000 from $800,000 in the second   quarter, as compared to the prior year quarter.",
    "Gross profit dollars increased 36.1% to $24.3 million in the   second quarter. As expected, gross margin percentage decreased by   320 basis points to 50.4% from 53.6% reported in the same period   last year. This year-over-year decline was primarily driven by   the 10% tariff impact, partially offset by reduced cost of our   Sactional and Sac products, primarily related to cost savings   from a change in the sourcing of our Lovesoft and down blend   fills in an ongoing shift of our manufacturing to Vietnam and   other countries outside of China.",
    "For the second quarter, total SG&A, excluding advertising   and marketing expense, increased 7.3% to $22 million from $20.5   million in the second quarter of last year. Excluding   approximately $300,000 of other non-recurring expenses, total   SG&A increased to $21.7 million. The increase in SG&A was   driven largely by variable expenses related to the increase in   sales, as well as higher employment costs and rent, which were   partially offset by a decrease in overhead expenses and equity   compensation as detailed in our press release. As a percentage of   sales, total SG&A expense decreased by 15.9%, driven largely   by decreases in stock compensation and IPO-related expenses as   described above.",
    "Our investments in advertising and marketing, which benefit   extended periods, increased $2.5 million or 68.8% over Q2 prior   year. As a percentage of sales, advertising and marketing   expenses increased a 180 basis points to 12.6% this quarter,   largely due to an increase in advertising related to Memorial   Day, which had a very positive ROI.",
    "Depreciation and amortization increased $447,000 from the   prior year period to $1.2 million, principally related to capital   investments for new and remodeled showrooms.",
    "In the second quarter of fiscal 2020, operating loss was $4.9   million compared to an operating loss of $7 million in the second   quarter of last year. In the second quarter of fiscal 2020,   adjusted operating loss was $4.6 million, excluding approximately   $300,000 of non-recurring expenses. In the second quarter of   fiscal 2019, adjusted operating loss was $5.7 million, excluding   approximately $1.3 million of non-recurring expenses.",
    "Net interest income was $169,000, which relates to the impact   of our IPO and other primary share financings. Tax expense in the   second quarter of fiscal 2020 and 2019 was less than $10,000 and   is related to minimum state income tax liabilities.",
    "Before we turn our attention to net income, net income per   share and EBITDA, I would like to point out, that my discussion   of these metrics will focus on net income and net income per   share adjusted for the IPO and other financing costs, as well as   adjusted EBITDA. Please refer to the terminology and   reconciliation between each of our adjusted metrics and their   most directly comparable GAAP measurements in our earnings   release issued earlier today.",
    "Adjusted net loss was $4.5 million in the second quarter of   fiscal 2020, compared to an adjusted net loss of $5.7 million in   the second quarter of fiscal 2019. Net loss per share adjusted   for the IPO and financing costs was $0.31 in the second quarter   of fiscal 2020 and $0.63 in the second quarter of fiscal 2019.   Adjusted EBITDA was a loss of $3.3 million as compared to a loss   of $2 million in the second quarter of last year.",
    "Turning to our balance sheet, we ended the quarter with $44.2   million in cash and cash equivalents. Ending inventory increased   101% year-over-year, driven by higher sales, as well as an   increased investment in the weeks of supply of inventory on hand   to support sales growth across all channels, to be agile enough   to support the success of our advertising and marketing   investments, and includes an increase in capitalized freight and   warehousing costs relative to the build in inventory and tariff   charges.",
    "Now, I would like to discuss a few items as it relates to our   fiscal 2020 outlook. From a showroom perspective, for the full   fiscal year 2020, we are on track to open 17 new showrooms for   this year with 11 showroom openings in the second half of fiscal   2020 and continue to expect to remodel eight. We are now   referring to our Costco roadshows as pop up shops and our Macy's   pilot as shop in shops, given the nature of the shop setup. As   mentioned for fiscal 2020, we will operate three Costco online   roadshows in addition to our in-store pop up shops with Costco,   as well as four pilot shop in shop locations with Macy's.",
    "We continue to expect to deliver strong levels of sales growth   between 40% to 45% in full fiscal 2020. However, we do expect Q3   revenue to be below the low end of our annual growth target with   growth of approximately 30%, while Q4 is expected to be   significantly above the high end of this annual range. This   expected cadence is due to the following items. We expect to see   a deceleration in total comp sales in Q3 with Q3 comps expected   to be slightly ahead of Q3 total sales growth, with a significant   increase in total comp sales in Q4. However, important to point   out that Q3 total comps on a two-year basis are projected to be   in line with Q2 of fiscal 2020. Normal seasonality of the   business with Q4 being our largest volume quarter; the cadence of   planned investments in marketing and advertising with investments   in working media, strategically being made late in Q3, which have   greater ROIs and greater impact on Q4 sales growth.",
    "In addition, total showroom revenue will be impacted by the   timing and the number of new showroom openings during Q3 and Q4,   which this fiscal is weighed more heavily in Q4 than Q3.",
    "The number of Costco pop up shops continue to increase over   prior year, with the most significant increase in the number of   pop up shops happening in the first half of fiscal 2020, as   compared to prior year. Second half 2020 Costco pop up shops are   projected to be as revenue productive as those in the first half   of fiscal 2020. The new initiatives that Jack mentioned to   include costco.com roadshows and the four new Macy's pilot shop   in shops will have the greatest amount of fiscal 2020 impact on   Q4 revenues.",
    "Consistent with the just discussed expected sales growth   cadence, we expect a larger Q3 adjusted EBITDA loss than we   reported in Q2, followed by a substantial improvement in Q4.   Given the significant tariff mitigation process we've made, as   Shawn discussed, we continue to expect to generate positive   adjusted EBITDA for fiscal 2020.",
    "We expect full year gross margins for fiscal 2020 to be   approximately 320 basis points to 350 basis points lower than   fiscal 2019, principally related to the following: expected   tariff pressure, which is being offset by mitigation actions and   SG&A initiatives, investments into our distribution   infrastructure to support future growth, a slight headwind due to   the continued shift in product mix toward Sactionals, as well as   a slight impact from higher pop up shop channel mix sales. These   decreases are partially offset by product margin gains relating   to changes in discounting of promotional strategies, reduced   product costs, related to vendor sourcing strategy and vendor   rebates, as well as an accelerated shift of sourcing outside   China.",
    "In terms of SG&A, excluding advertising and marketing   expense, as previously mentioned, we expect the most significant   SG&A leverage to be generated in Q4, given the seasonality of   our business. As a reminder, embedded in our SG&A outlook is   all of the investments we are making in the business across   people, process and infrastructure, and our Q4 net sales volumes   enable us to produce the greatest amount of leverage on these   investments over the prior year.",
    "So, in summary, while we continue to expect quarterly   fluctuations due to the timing of our tariff mitigation efforts,   our advertising and marketing investments and investments across   all areas of the business to support the significant growth   opportunity we have, we anticipate that we will again deliver a   high sales growth rate and will generate a positive adjusted   EBITDA in fiscal 2020.",
    "Finally, as it relates to capital expenditures, we now expect   to incur approximately $11.5 million of CapEx in fiscal 2020,   versus our prior guidance of approximately $13 million, due to a   timing shift of investments of the Sac manufacturing CapEx to   fiscal 2021. The vast majority of our CapEx will be spent on the   opening of 17 showrooms, to remodel of approximately 8 legacy   stores, the opening of 4 Macy's shop in shop pilot locations, and   approximately $1.3 million being invested into the Sac   manufacturing facility this fiscal.",
    "The remaining spend is being allocated to technology in our   showrooms, inventory management and logistics systems, e-commerce   platform enhancements and for headquarters data and support   systems. For all other details related to our results, please   refer to our earnings press release.",
    "With that, we would like to turn the call back to the   operator, who can open it up for questions. Operator?",
    " Operator ",
    "Thank you. [Operator Instructions] Our first question is from   Dave King with ROTH Capital Partners. Please proceed.",
    " Dave King    --   ROTH Capital Partners -- Analyst ",
    "Thanks. Good morning, everyone. I guess, first off, what's   driving the confidence in the Q4 growth versus the Q3 guidance   you laid out? It sounds like that some of that's Macy's, but what   are you anticipating from a two-year comp perspective versus what   you had in Q2, and what you're expecting for Q3 and what's   driving that?",
    " Jack Krause    --   President and Chief Operating Officer ",
    "Yes, consistently -- hey, Dave, this is Jack. We believe,   roughly speaking, the two-year comps will maintain pretty   consistent throughout the year. Obviously, we're going against   tougher and tougher comparables. And the reason we feel confident   in that is, it's harder to see in terms of total marketing spend   on a quarter to quarter basis, but the working marketing, the   effect of our working marketing, which starts in Q3 and goes into   Q4 will be by far the greatest impact in Q4 with roughly   year-over-year working media spends plus -- over plus 60%   [Phonetic], whereas if you look at the effect of the Q3 media, it   was roughly flat to a year ago. So that will give us a dramatic   increase in comparable sales acceleration.",
    " Dave King    --   ROTH Capital Partners -- Analyst ",
    "Okay. That helps.",
    " Jack Krause    --   President and Chief Operating Officer ",
    "And just a background on that, the reason that we're doing   that delay is, as we've talked about earlier, we've had several   tests going on. And as we do our analysis, the opportunities to   implement have come really in the Q4 versus Q3.",
    " Dave King    --   ROTH Capital Partners -- Analyst ",
    "Okay. And so, I know it's a little bit early on that front,   but can you talk about the initial performance of the expanded   regional media runs you had prior to Labor Day, are the ROIs   increasing, you know, any early learnings so far?",
    " Jack Krause    --   President and Chief Operating Officer ",
    "Yeah. The pre-tentpole events, so the expansion of the events   is showing increases in ROI and run rate. So at this point, we   believe they will be part of the Q4 program. What I'll do -- I'll   need to do is, we still haven't done sort of the final analysis   of our Labor Day media. So, we'll be finalizing that in the next   couple of weeks and then putting it into a Q4 finalized   program.",
    " Dave King    --   ROTH Capital Partners -- Analyst ",
    "Okay. That's good color. All right. Thanks for taking my   questions.",
    " Operator ",
    "Our next question is from Brian Nagel with Oppenheimer &   Company. Please proceed.",
    " Brian Nagel    --   Oppenheimer & Company -- Analyst ",
    "Nice quarter.",
    " Shawn Nelson    --   Chief Executive Officer ",
    "Thanks, Brian.",
    " Brian Nagel    --   Oppenheimer & Company -- Analyst ",
    "The first question, I want to ask, and I apologize, Donna,   when you were laying out the guidance for sales, Q3 and Q4, I   maybe just missed it. Could you remind or reiterate what the   sales guidance for the third and fourth quarter is and the   components of that?",
    " Donna Dellomo    --   Executive Vice President and Chief Financial Officer ",
    "Yes. What we were saying is that year-over-year, total sales,   well, we're expecting to increase about 30% with a significant   increase in fourth quarter. So we are still lining in to the   annual guidance of 40% to 45%. So we didn't give guidance for Q4,   but it will be significantly higher than the high range of the   40% to 45% annual guidance that we've provided.",
    " Brian Nagel    --   Oppenheimer & Company -- Analyst ",
    "Got it. We can back into that just given that it's basically a   missing piece. But -- and then the primary reason for that,   again, I'm sorry, because I know, I think you've reiterated it, I   just want to make sure I get this right. The primary reason for   that, sort of say choppiness is, one, more difficult comparison;   and then, two, just the cadence of the marketing investment?",
    " Jack Krause    --   President and Chief Operating Officer ",
    "Yes, there are two things. So, you're right. So that, I will   confirm that comment. And it's really broken into two things. So   you have, on a comp basis, I just explained that, that we're   dramatically increasing our marketing, relatively speaking, our   working marketing in the fourth quarter relative to the third,   and we believe we'll get significantly higher lifts.",
    "The other component of that is just initiatives. So, for   example, in the fourth quarter, we'll have a dramatic increase in   new showroom openings versus the third. The third quarter was   really our lowest rate of new showroom openings we've had in the   last several quarters. And in the fourth quarter, we will also   get the results of the Macy's shop in shop roll out, as well as   the two additional Costco shows we mentioned. So those will have   an incremental effect. So we have some comp effects as well as   just new business initiatives kicking in, in the fourth   quarter.",
    " Brian Nagel    --   Oppenheimer & Company -- Analyst ",
    "Got it. Then the other question I had, just with regard to   gross margins, clearly, you've been, as you articulated in the   press release and your prepared comments, there have been a lot   of efforts done to deal with, so to say, the tariff, so congrats   on that. As we look at the gross margin degradation here in the   second quarter, is there a way to parse that out of how much of   that -- as we're down 330 basis points year-on-year, how much of   that is investment or one-time in nature as you deal with these   tariffs versus a newer run rate type number?",
    " Donna Dellomo    --   Executive Vice President and Chief Financial Officer ",
    "Yes. The guidance that we had given, and it's still pretty   consistent that about 75% of that decrease in margin   year-over-year is related to the tariff pressure. The other 25%   relates to initiatives we have with opening up multiple   warehouses, investing into some infrastructure, some cost   increases on FedEx, some cost increases relative to the increase   in inventory levels, but the majority are at a minimum of 75%   that relates to the impact with tariffs.",
    " Brian Nagel    --   Oppenheimer & Company -- Analyst ",
    "Got it. And then my final question with regard to Macy's, the   Macy's, recognizing it's very, very early, how should we think   about -- it sounds to me like the Macy's initiative will be   closer to or more now like, so to say to two of your own   showrooms, but how should we think about the economics of Macy's   location in a showroom?",
    "And then the second question on that is, now this is Costco,   Macy's, are you in discussions whether should we expect other   type of retail partnerships in the not too distant future?",
    " Jack Krause    --   President and Chief Operating Officer ",
    "Yes. Good question. So I think you're right. I think Macy's is   more analogous to our own showrooms, really with that being an   asset light execution. So we expect the CapEx spends on the   Macy's to be less than a third of a normal showroom. And we   expect those to -- obviously, it's pretty easy to assume our   hurdle rate would be the same types of returns, we want to get,   as we would in showrooms. So if you look at the CapEx that way,   you could easily say that roughly between 30% to 50% of the run   rate of a Macy's shop in shop will be roughly 30% to 50% of a   normal showroom.",
    "Obviously, there are huge exceptions. For example, Herald   Square is a substantial opportunity, so that we'd look at that   separately. But it's very early, so, you know, obviously, I think   the best way to look at it is look at the math and the CapEx   investment, and the way we're running them, and you got to model   in what do you think makes sense, because that's going to be as   close as it is right now, because what we're really doing is   testing it out.",
    " Brian Nagel    --   Oppenheimer & Company -- Analyst ",
    "Got it. Thank you.",
    " Operator ",
    "Our next question is from Thomas Forte with D.A. Davidson.   Please proceed.",
    " Thomas Forte    --   D.A. Davidson -- Analyst ",
    "Great. Thanks for taking my questions. I had a couple of   follow ups on Macy's. So the first question I had is, and I know   Jack touched on this a little, but why Macy's? Do you feel like   they have a similar core customer base just in general? And then   how should we think about the economics of the Macy's versus   Costco? And then refining that last question, so if this pilot   results in more shop in shops in Macy's, would you then limit   adjacent showroom locations near those shop in shop?",
    " Jack Krause    --   President and Chief Operating Officer ",
    "Good question. So one is why Macy's? I think, what we're   really looking at -- I think, the one thing to do is think of   this as a collaboration with Macy's and their top stores. So if   you look at the top 100 Macy's to the top 50 Macy's, we see a lot   of shared attributes with our customers. Macy's is also a   significant retailer in the furniture segment with hundreds of   millions of dollars sold there. So we think it's a huge   opportunity for furniture shoppers with a light characteristics   to be able to experience our product. And especially in those top   Macy's, they're really doing a lot of interesting things. And I   think that -- I think it will be a great partnership.",
    "In terms of the way it works, since they are working much more   like a showroom in terms of the way we will staff them with our   own employees, we manage them through our own system and we are   essentially paying a rent rate to be inside of them, that we   expect the contribution of these to be significantly higher than   what we've seen in the Costco pop up shops, because of the way   those are run.",
    " Thomas Forte    --   D.A. Davidson -- Analyst ",
    "And then adjacencies for other showrooms, would you not build   a showroom within a close proximity to Macy's shop in shop?",
    " Jack Krause    --   President and Chief Operating Officer ",
    "Yes, a little bit of insight into that. So the way we're   running the Macy's test, the reason we ran those four is for some   interesting test parameters. So, for example, Herald Square is   very close to our Flatiron District showroom. So we'll look at   what happens between showrooms that are less than a mile apart.   We'll also have a test which has a showroom in the same mall as   the Macy's, and we'll have that opportunity to see what happens.   And then we have a showroom in the Carle Place, Macy's, as this   is one of their furniture locations and we'll see what happens   there. So really at this point that -- the primary purpose of   this test is to understand the dynamics and then to start laying   out a plan in terms of how we maximize our penetration at the   most efficient way and also do it in a win-win way with our   Macy's partners.",
    " Thomas Forte    --   D.A. Davidson -- Analyst ",
    "Great. Sounds very thoughtful, Jack. Thank you very much.",
    " Jack Krause    --   President and Chief Operating Officer ",
    "Thank you, Tom.",
    " Operator ",
    "Our next question is from Alex Fuhrman with Craig-Hallum.   Please proceed.",
    " Alex Fuhrman    --   Craig-Hallum -- Analyst ",
    "Great. Thanks very much for taking my question and   congratulations on another very strong quarter. You know, couple   of things that I wanted to touch on here. One is, you know, it   certainly sounds like you guys have made a lot of progress in   moving your production out of China and have a good line of sight   to being completely out of there. You know, it sounds like you're   -- you know, relative to the prior conference call, it sounds   like that that has moved a lot faster and better than   expected.",
    "Can you give us a sense of what's driving that? I mean, it   sounds like your vendors have been incredibly supportive. Has   there just been more buy in and capital commitment on the part of   your vendors than you expected? Just kind of curious why you've   been able to accelerate that so nicely?",
    " Shawn Nelson    --   Chief Executive Officer ",
    "Yes. Great question. We have been moving very rapidly, and we   intend to continue moving rapidly. I don't believe that we ever   intended to go slow. I just don't think we gave specific guidance   on how fast we thought we could do it. I think everything's   moving according to our plan, and it's exactly that our current   suppliers have been very supportive, and in most cases, as I   described, are investing themselves in other countries outside of   China, Malaysia, Vietnam and even some others that are coming   up.",
    "And meanwhile, for the goods that are left behind still,   they're offering us heavy discounts in order to keep that   business and kind of get through the tunnel as it were, with   their lights on, so that they can support us on the other side   outside of China. And so, I think, it's just a confluence of   things going well, things going according to plan. And, you know,   our ability to execute, which obviously in the public markets,   you know, we're only a year out. And I think it's a matter of   those watching Lovesac, getting familiar with how we operate.",
    " Alex Fuhrman    --   Craig-Hallum -- Analyst ",
    "Great. That's really helpful. Thanks, Shawn. And then, you   know, couple of questions just on the Macy's partnership.   Obviously, this sounds like a huge opportunity. You know, big   difference relative to Costco. I imagined, is that Macy's is a   large furniture retailer on their own. And I'm curious, if you   have a sense of or if it's been a big part of your negotiations   with Macy's, where in the stores, your shop in shops are going to   be located, are they going to be in the furniture sections, or   are you maybe going to do some that are near other furniture   brands and some that aren't? Just curious, you know, how we   should think about the placement of those shop in shops? And then   it's going to be your own employees, is it fair to assume that   you will be able to capture all of the customer data and own that   customer relationship?",
    " Jack Krause    --   President and Chief Operating Officer ",
    "Great questions. Yes. Our team, I can tell you it varies by,   you know, the Macy's organization from the way they operate,   obviously, because of the -- the stores are such a big volume and   they have independent store management. The negotiations are   store by store. We literally have to do walk throughs with their   teams in every store.",
    "What I can tell you is that, they really believe in terms of   the Macy's, I'd say that the Macy's evolution, they believe this   type of relationship is critical and they're putting us in key   places. And we walked to stores with them and are very happy with   the locations. And they're primarily very strong locations. Not   necessarily obviously next to furniture, because in a lot of the   locations we're testing, they're not even in furniture section.   So that's part of our learning agenda, as to figure out what   works most.",
    "And I would expect coming out of this, along with the answer   to some of Tom's questions, would be some answers to your   questions in terms of what adjacencies are working most   effectively? What parts of the model are working? Are there   attributes of a Macy's store over another store that allow us to   accelerate the fastest? That's all that we're trying to do now,   so that hopefully the next time we talk about this, we have some   answers and we start laying out an execution plan. So good   questions and we'll keep you posted on it.",
    " Alex Fuhrman    --   Craig-Hallum -- Analyst ",
    "Great. Thanks very much for that. And then, lastly, you know,   your marketing has, of course, been very successful over the last   couple of years and TV seems to have played a nice role in that.   You know, it looks like up until the last couple of months, it   have basically been different versions of the same TV commercial.   And then you came out with a different creative, a few months   ago. Can you talk a little bit about, have you seen a lift from   that new TV creative or was there maybe something kind of a magic   formula in the last commercial? Just kind of curious, you know,   now that you've got your second commercial out there in the   market, what type of response you've seen from that?",
    " Jack Krause    --   President and Chief Operating Officer ",
    "Yes. Good question. I would say that we were very careful,   obviously, because we had such a successful creative execution as   we started with this new execution. We tested these   quantitatively and the new and a quantitative research mode, in   terms of persuasion and brand, attributes, et cetera. The new   commercial actually tested equal to or better than the old one   across the board. We also can tell you that initial results on   the new television are showing that, it's driving traffic at   levels that we expect it to drive at historically.",
    "Now, other than that, I think you start to get into a whole   media mix discussion, which I can't get into, because we still   don't have the total results for the Labor Day media run, which   is still being analyzed and actually still, you know, the post   Labor Day work is still going on. So we'll probably have a lot   more information for you in the next quarter about that. But   we're feeling very good about the creative overall.",
    " Alex Fuhrman    --   Craig-Hallum -- Analyst ",
    "That's terrific. Well, thanks very much, all of you.",
    " Jack Krause    --   President and Chief Operating Officer ",
    "Thank you.",
    " Donna Dellomo    --   Executive Vice President and Chief Financial Officer ",
    "Thank you.",
    " Operator ",
    "Next, we have a follow-up question from Thomas Forte with D.A.   Davidson. Please proceed.",
    " Thomas Forte    --   D.A. Davidson -- Analyst ",
    "Great. Thanks. So an investor asked me to ask the following   question. They are really impressed with your comments on your   gross margin outlook for next year returning to the mid-50s. Can   you once again discuss what are the inputs that will drive that   strong gross margin performance next year?",
    " Shawn Nelson    --   Chief Executive Officer ",
    "Yes. I mean, the pressure on the business has been largely   tariffs, as Donna has spoked to. You know, we have a few other   outside pieces, be it freights or pressures in the supply chain,   logistics, et cetera, that are small and Donna can touch on that,   but the vast majority has been tariff. So as we mitigate those   tariffs primarily through exiting China. Not only are we then   tariffs free, as it were, at least special tariff free. But we   also, as I mentioned, are getting lower first costs in these   outside countries. And so we were operating in the mid-50s range   on gross margins, and we expect to get right back to that as that   product flows through our supply chain.",
    "So it will be the second half of next year, before on a run   rate basis, we begin to see that return to those levels. And, you   know, because it's a run rate basis, it may take even longer to   flow to the P&L, as it were. But we feel very good about our   ability to get back there and our ability to maintain that on the   go forward. And I don't know, Donna, if you have anything else to   add?",
    " Donna Dellomo    --   Executive Vice President and Chief Financial Officer ",
    "Yes. I mean, that's really -- the major component is the   tariff. The -- some investments into infrastructure, which we   will still continue to see through next year. And then I think   we'll start to see less of an impact on the shift to the pop up   shops and Sactionals. I think, we're seeing the greatest amount   of that shift happening now. So when that all starts to level   itself out, as Shawn has mentioned, we'll start to see on a run   rate, start to see those margins elevate. We don't expect the   full year to come in at that, but we'll start to see the quarters   in the second half start to elevate to the higher mid-50%   range.",
    " Thomas Forte    --   D.A. Davidson -- Analyst ",
    "Great. Thank you, Shawn. Thank you, Donna.",
    " Jack Krause    --   President and Chief Operating Officer ",
    "Yes. And just to add a note and beyond that, I think it's   important to state that, you know, we've just hired Tom Lee as   our Chief Supply Chain Officer. And I think in the next 18 months   to 24 months, we'll really be working on combining that supply   chain and the logistics aspects into a value chain, that allows   us to start leveraging other areas. So I think we've only just   begun to really get efficient as a company, and we'll be catching   up with that growth in the next 18 months to 24 months outside of   the whole tariffs issue.",
    " Thomas Forte    --   D.A. Davidson -- Analyst ",
    "Great. Thank you, Jack.",
    " Jack Krause    --   President and Chief Operating Officer ",
    "Thank you.",
    " Operator ",
    "We have reached the end of our question-and-answer session. I   would like to turn the call back over to management for closing   remarks.",
    " Shawn Nelson    --   Chief Executive Officer ",
    "Thanks very much for your support as investors, and we   appreciate all the questions and encourage you to continue to   keep an eye on us, as we grow.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 56 minutes ",
    " Rachel Schacter    --   Investor Relations ",
    " Shawn Nelson    --   Chief Executive Officer ",
    " Jack Krause    --   President and Chief Operating Officer ",
    " Donna Dellomo    --   Executive Vice President and Chief Financial Officer ",
    " Dave King    --   ROTH Capital Partners -- Analyst ",
    " Brian Nagel    --   Oppenheimer & Company -- Analyst ",
    " Thomas Forte    --   D.A. Davidson -- Analyst ",
    " Alex Fuhrman    --   Craig-Hallum -- Analyst ",
    " More LOVE analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than The Lovesac   Company     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and The Lovesac   Company wasn't one of them! That's right -- they think   these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:23:43"
}