{
  "url": "https://www.nasdaq.com/article/3-reasons-aurora-cannabis-will-dethrone-canopy-growth-as-the-largest-marijuana-stock-cm1207689",
  "title": "3 Reasons Aurora Cannabis Will Dethrone Canopy Growth as the Largest Marijuana Stock - Nasdaq.com",
  "text": [
    " Chances are that you'd struggle to find a   more impressive growth opportunity    than legal marijuana. According to growth estimates from Wall   Street investment bank Stifel, the legal weed industry could see   worldwide sales soar from $10.9 billion in 2018 to perhaps as   high as   $200 billion a decade from now    . That's enormous growth typically reserved for a technological   advance, not the legalization of a plant. Nevertheless, it's   bound to attract a lot of attention from investors.  Canopy Growth has long been the face of the cannabis     industry  Heralding the charge pretty much since the get-go has been   Canopy Growth    (NYSE: CGC) , the largest marijuana stock in the world by market   cap. With few exceptions -- e.g.,   Tilray    's   moon shot following its initial public   offering    last year -- Canopy has firmly planted itself as the biggest   cannabis stock.   Image source: Getty Images.makeArticleAd();  Part of the reason why this company is such a giant has to do   with its top-tier pot brands (e.g., Tweed), as well as its   projection as   the second-leading producer    , behind only   Aurora Cannabis    (NYSE: ACB) . When fully operational, Canopy should have little   issue producing more than 500,000 kilos a year from the 5.6   million square feet set aside for cultivation. Thus far, more   than 5 million square feet has already been approved for   cultivation by regulatory agency Health Canada. Canopy Growth also has one heck of a war chest. In November,   Modelo and Corona beer maker   Constellation Brands    (NYSE: STZ) made a mammoth $4 billion equity investment in the   company, marking its third such investment since October 2017.   The deal, which upped Constellation's equity stake to 37%, gave   Canopy Growth free rein to expand internationally and acquire new   businesses. Even after quite the spending spree, Canopy ended the   most recent quarter with   $2.36 billion in cash and cash equivalents    , which is by far tops in the industry. And, of course, there's the company's   international presence    . With a production, export, or research presence in 16   countries, Canopy Growth trails only Aurora Cannabis. These   foreign markets should prove critical to the long-term success of   the marijuana industry, especially if the domestic Canadian   market becomes saturated with dried cannabis flower.  It's time for a changing of the guard  However, Canopy Growth   hasn't looked like much of a leader    in recent months. The company's stock has lost more than half of   its value, and its most recen   t quarterly   report    featured a one-time loss of more than 1 billion Canadian dollars.   In other words, it may soon be time for a changing of the guard   among the biggest cannabis stocks.   Image source: Getty Images.  Although I've been   highly critical of Aurora Cannabis    in the past (and still remain somewhat critical of the company's   growth tactics), I see far more downside potential built into   Canopy's share price than Aurora's at this point. Mind you,   there's still quite a gap between Canopy's valuation ($8.77   billion) and Aurora's market cap ($5.81 billion). But I can   envision a scenario over the next 12 months where Aurora   dethrones Canopy as the biggest pot stock in the world by market   cap, and I have three reasons to back up this thesis. To begin with, Aurora Cannabis has management continuity. The   company's CEO, Terry Booth, helped found the company back in   2006, and he remains in his leadership role to this day.   Meanwhile, Canopy's visionary co-CEO Bruce Linton   was shown the door by the company's board    in early July, and Mark Zekulin, the company's default CEO   following Linton's firing, will be stepping down once a permanent   CEO is found. In other words, it's unclear what direction Canopy   Growth could be headed next. The only thing we know for certain   is that Constellation Brands, which has two of its own executives   and two independent directors on Canopy's board, could no longer   tolerate Linton's aggressive spending and sent him packing. Secondly, I can appreciate Aurora Cannabis' transparency.   Aurora has taken the time to lay out production estimates for   each of its 15 facilities for investors, provided revenue   guidance in advance of its quarterly reports, and walked Wall   Street through its expectations of reaching positive recurring   EBIDTA (earnings before interest, taxes, depreciation, and   amortization) in the fiscal fourth quarter. Comparatively, Canopy   Growth hasn't offered anything in the way of peak production   estimates, and CFO Mike Lee has largely distanced himself and his   company from narrowing down sale and loss projections in the near   term. Thirdly, but most important, Aurora Cannabis looks to turn the   corner to profitability at an earlier date than Canopy Growth.   Even though   both are on track to lose money in fiscal   2020    , Aurora Cannabis is losing a lot less, and is probably on track   to reach peak operating potential earlier than Canopy. Since   earnings matter now, Aurora has the clear edge here over Canopy   Growth.   Image source: Getty Images.   Keep those expectations realistic  Of course, there's a caveat to my prediction that Aurora   Cannabis will dethrone Canopy Growth. This being that I expect   weakness in Canopy's stock to narrow the market cap gap between   the two far more than I expect strength in Aurora's stock to   close it. In fact, it's possible that both companies could lose   value from this point in time as the legal weed industry   continues to find its footing and mature    . Remember, the entire Canadian pot industry has been contending   with cannabis supply issues since recreational sales began on   Oct. 17, 2018. Regulatory agency Health Canada has been bogged   down with cultivation and sales license applications, although   it's   introduced a fix to the cultivation license   process    that should result in a slow but steady fix. Select provinces   have also been slow to approve the licensing of retail locations.   All of these issues are fixable, but it's going to take numerous   quarters for supply issues to be resolved. There's also the very real likelihood that, despite growing   support for legalization among the public, the United States is   nowhere near close to legalizing marijuana    . Aside from legalization actually costing the federal government   revenue, no reform bill stands a chance of reaching the Senate   floor as long as Mitch McConnell (R-Ky.) is Senate majority   leader. That's stymied the hopes of Canopy, Aurora, and their   peers of quickly profiting from a surge in legal U.S. weed   sales. Investors also shouldn't overlook the fact that it's going to   take time for Aurora's and Canopy's international markets to pay   dividends. Exports are unlikely to generate a lot of revenue   until demand in the Canadian market is satiated -- and given the   supply issues noted above, that's still a long way off. Yes, Aurora can surpass Canopy Growth as the face of the   marijuana industry. But understand that this passing of the torch   is likely to happen more out of weakness in Canopy's stock than   due to strength in Aurora's stock.   Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.         And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018. And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution. Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks. Simply click here to get the full story now.  Learn more     Sean Williams      has no position in any of the stocks mentioned. The Motley Fool     recommends Constellation Brands. The Motley Fool has a     disclosure policy      .  ",
    "Chances are that you'd struggle to find a   more impressive growth opportunity    than legal marijuana. According to growth estimates from Wall   Street investment bank Stifel, the legal weed industry could see   worldwide sales soar from $10.9 billion in 2018 to perhaps as   high as   $200 billion a decade from now    . That's enormous growth typically reserved for a technological   advance, not the legalization of a plant. Nevertheless, it's   bound to attract a lot of attention from investors.",
    "Heralding the charge pretty much since the get-go has been   Canopy Growth    (NYSE: CGC) , the largest marijuana stock in the world by market   cap. With few exceptions -- e.g.,   Tilray    's   moon shot following its initial public   offering    last year -- Canopy has firmly planted itself as the biggest   cannabis stock.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Part of the reason why this company is such a giant has to do   with its top-tier pot brands (e.g., Tweed), as well as its   projection as   the second-leading producer    , behind only   Aurora Cannabis    (NYSE: ACB) . When fully operational, Canopy should have little   issue producing more than 500,000 kilos a year from the 5.6   million square feet set aside for cultivation. Thus far, more   than 5 million square feet has already been approved for   cultivation by regulatory agency Health Canada.",
    "Canopy Growth also has one heck of a war chest. In November,   Modelo and Corona beer maker   Constellation Brands    (NYSE: STZ) made a mammoth $4 billion equity investment in the   company, marking its third such investment since October 2017.   The deal, which upped Constellation's equity stake to 37%, gave   Canopy Growth free rein to expand internationally and acquire new   businesses. Even after quite the spending spree, Canopy ended the   most recent quarter with   $2.36 billion in cash and cash equivalents    , which is by far tops in the industry.",
    "And, of course, there's the company's   international presence    . With a production, export, or research presence in 16   countries, Canopy Growth trails only Aurora Cannabis. These   foreign markets should prove critical to the long-term success of   the marijuana industry, especially if the domestic Canadian   market becomes saturated with dried cannabis flower.",
    "However, Canopy Growth   hasn't looked like much of a leader    in recent months. The company's stock has lost more than half of   its value, and its most recen   t quarterly   report    featured a one-time loss of more than 1 billion Canadian dollars.   In other words, it may soon be time for a changing of the guard   among the biggest cannabis stocks.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Although I've been   highly critical of Aurora Cannabis    in the past (and still remain somewhat critical of the company's   growth tactics), I see far more downside potential built into   Canopy's share price than Aurora's at this point. Mind you,   there's still quite a gap between Canopy's valuation ($8.77   billion) and Aurora's market cap ($5.81 billion). But I can   envision a scenario over the next 12 months where Aurora   dethrones Canopy as the biggest pot stock in the world by market   cap, and I have three reasons to back up this thesis.",
    "To begin with, Aurora Cannabis has management continuity. The   company's CEO, Terry Booth, helped found the company back in   2006, and he remains in his leadership role to this day.   Meanwhile, Canopy's visionary co-CEO Bruce Linton   was shown the door by the company's board    in early July, and Mark Zekulin, the company's default CEO   following Linton's firing, will be stepping down once a permanent   CEO is found. In other words, it's unclear what direction Canopy   Growth could be headed next. The only thing we know for certain   is that Constellation Brands, which has two of its own executives   and two independent directors on Canopy's board, could no longer   tolerate Linton's aggressive spending and sent him packing.",
    "Secondly, I can appreciate Aurora Cannabis' transparency.   Aurora has taken the time to lay out production estimates for   each of its 15 facilities for investors, provided revenue   guidance in advance of its quarterly reports, and walked Wall   Street through its expectations of reaching positive recurring   EBIDTA (earnings before interest, taxes, depreciation, and   amortization) in the fiscal fourth quarter. Comparatively, Canopy   Growth hasn't offered anything in the way of peak production   estimates, and CFO Mike Lee has largely distanced himself and his   company from narrowing down sale and loss projections in the near   term.",
    "Thirdly, but most important, Aurora Cannabis looks to turn the   corner to profitability at an earlier date than Canopy Growth.   Even though   both are on track to lose money in fiscal   2020    , Aurora Cannabis is losing a lot less, and is probably on track   to reach peak operating potential earlier than Canopy. Since   earnings matter now, Aurora has the clear edge here over Canopy   Growth.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Of course, there's a caveat to my prediction that Aurora   Cannabis will dethrone Canopy Growth. This being that I expect   weakness in Canopy's stock to narrow the market cap gap between   the two far more than I expect strength in Aurora's stock to   close it. In fact, it's possible that both companies could lose   value from this point in time as the legal weed industry   continues to find its footing and mature    .",
    "Remember, the entire Canadian pot industry has been contending   with cannabis supply issues since recreational sales began on   Oct. 17, 2018. Regulatory agency Health Canada has been bogged   down with cultivation and sales license applications, although   it's   introduced a fix to the cultivation license   process    that should result in a slow but steady fix. Select provinces   have also been slow to approve the licensing of retail locations.   All of these issues are fixable, but it's going to take numerous   quarters for supply issues to be resolved.",
    "There's also the very real likelihood that, despite growing   support for legalization among the public, the United States is   nowhere near close to legalizing marijuana    . Aside from legalization actually costing the federal government   revenue, no reform bill stands a chance of reaching the Senate   floor as long as Mitch McConnell (R-Ky.) is Senate majority   leader. That's stymied the hopes of Canopy, Aurora, and their   peers of quickly profiting from a surge in legal U.S. weed   sales.",
    "Investors also shouldn't overlook the fact that it's going to   take time for Aurora's and Canopy's international markets to pay   dividends. Exports are unlikely to generate a lot of revenue   until demand in the Canadian market is satiated -- and given the   supply issues noted above, that's still a long way off.",
    "Yes, Aurora can surpass Canopy Growth as the face of the   marijuana industry. But understand that this passing of the torch   is likely to happen more out of weakness in Canopy's stock than   due to strength in Aurora's stock.",
    "  Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.         And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018. And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution. Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks. Simply click here to get the full story now.  Learn more  ",
    " Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.        ",
    "And make no mistake - it is coming.",
    "Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018.",
    "And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution.",
    "Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks.",
    "Simply click here to get the full story now.",
    " Learn more ",
    "  Sean Williams      has no position in any of the stocks mentioned. The Motley Fool     recommends Constellation Brands. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 06:06:00"
}