{
  "url": "https://www.nasdaq.com/article/should-value-investors-buy-anixter-international-axe-stock-cm1210348",
  "title": "Should Value Investors Buy Anixter International (AXE) Stock? - Nasdaq.com",
  "text": [
    " Here at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks. Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks. Of these, perhaps no stock market trend is more popular than value investing, which is a strategy that has proven to be successful in all sorts of market environments. Value investors use a variety of methods, including tried-and-true valuation metrics, to find these stocks. Zacks has developed the innovative Style Scores system to highlight stocks with specific traits. For example, value investors will be interested in stocks with great grades in the \"Value\" category. When paired with a high Zacks Rank, \"A\" grades in the Value category are among the strongest value stocks on the market today. One stock to keep an eye on is Anixter International (AXE). AXE is currently sporting a Zacks Rank of #1 (Strong Buy), as well as an A grade for Value. The stock has a Forward P/E ratio of 9.22. This compares to its industry's average Forward P/E of 9.55. Over the last 12 months, AXE's Forward P/E has been as high as 11.59 and as low as 7.82, with a median of 9.34. Investors will also notice that AXE has a PEG ratio of 1.15. This figure is similar to the commonly-used P/E ratio, with the PEG ratio also factoring in a company's expected earnings growth rate. AXE's industry has an average PEG of 1.18 right now. Over the last 12 months, AXE's PEG has been as high as 1.45 and as low as 0.98, with a median of 1.17. Finally, investors should note that AXE has a P/CF ratio of 8.46. This metric takes into account a company's operating cash flow and can be used to find stocks that are undervalued based on their solid cash outlook. This company's current P/CF looks solid when compared to its industry's average P/CF of 12.49. Over the past 52 weeks, AXE's P/CF has been as high as 14.21 and as low as 7.14, with a median of 8.74. These are only a few of the key metrics included in Anixter International's strong Value grade, but they help show that the stock is likely undervalued right now. When factoring in the strength of its earnings outlook, AXE looks like an impressive value stock at the moment.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Anixter International Inc. (AXE): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Here at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks. Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks.",
    "Of these, perhaps no stock market trend is more popular than value investing, which is a strategy that has proven to be successful in all sorts of market environments. Value investors use a variety of methods, including tried-and-true valuation metrics, to find these stocks.",
    "Zacks has developed the innovative Style Scores system to highlight stocks with specific traits. For example, value investors will be interested in stocks with great grades in the \"Value\" category. When paired with a high Zacks Rank, \"A\" grades in the Value category are among the strongest value stocks on the market today.",
    "One stock to keep an eye on is Anixter International (AXE). AXE is currently sporting a Zacks Rank of #1 (Strong Buy), as well as an A grade for Value. The stock has a Forward P/E ratio of 9.22. This compares to its industry's average Forward P/E of 9.55. Over the last 12 months, AXE's Forward P/E has been as high as 11.59 and as low as 7.82, with a median of 9.34.",
    "Investors will also notice that AXE has a PEG ratio of 1.15. This figure is similar to the commonly-used P/E ratio, with the PEG ratio also factoring in a company's expected earnings growth rate. AXE's industry has an average PEG of 1.18 right now. Over the last 12 months, AXE's PEG has been as high as 1.45 and as low as 0.98, with a median of 1.17.",
    "Finally, investors should note that AXE has a P/CF ratio of 8.46. This metric takes into account a company's operating cash flow and can be used to find stocks that are undervalued based on their solid cash outlook. This company's current P/CF looks solid when compared to its industry's average P/CF of 12.49. Over the past 52 weeks, AXE's P/CF has been as high as 14.21 and as low as 7.14, with a median of 8.74.",
    "These are only a few of the key metrics included in Anixter International's strong Value grade, but they help show that the stock is likely undervalued right now. When factoring in the strength of its earnings outlook, AXE looks like an impressive value stock at the moment.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:10:22"
}