{
  "url": "https://www.nasdaq.com/article/palo-alto-networks-panw-q4-earnings-top-estimates-rise-yy-cm1208131",
  "title": "Palo Alto Networks (PANW) Q4 Earnings Top Estimates, Rise Y/Y - Nasdaq.com",
  "text": [
    "  Palo Alto Networks PANW  reported fourth-quarter fiscal 2019 non-GAAP earnings of $1.47 per share, which not only improved 14.8% year over year but also surpassed the Zacks Consensus Estimate of $1.45. Moreover, the company's revenues of $805.8 million increased 22% year over year, outpacing the consensus estimate of $803 million. The impressive results were mainly driven by several deal wins and the increasing adoption of the company's next-generation security platforms. Growing traction in newer Prisma and Cortex offerings was another tailwind. In a parallel announcement, Palo Alto clarified its intent to acquire the IoT security start-up Zingbox for $75 million.  Quarterly Details  Product revenues increased approximately 12.3% to $305.7 million. The company also witnessed a 29.4% jump in subscription and support revenues to $500.1 million. Further, billings improved 22% year over year to $1.1 billion. Deferred revenues rose 27% to $2.9 billion as well. Region wise, revenues from the Americas climbed 24.7% while revenues from Europe, the Middle East and Africa, and Asia Pacific were up 17.6% and 16.8%, respectively. During the quarter, the company added nearly 3,000 customers. It boasts 65,000 customers currently. Additionally, Palo Alto's non-GAAP gross margin expanded 130 basis points (bps) on a year-over-year basis to 77.5%. While non-GAAP operating expense of $450.4 million as a percentage of revenues expanded 400 bps to 55.9%, non-GAAP operating margin contracted 270 bps to 21.6%.   Palo Alto Networks, Inc. Price, Consensus and EPS     Surprise      Palo Alto Networks, Inc.   price-consensus-eps-surprise-chart    |   Palo Alto Networks, Inc. Quote    Balance Sheet  Palo Alto exited the fiscal fourth quarter with cash, cash equivalents and short-term investments of approximately $2.8 billion compared with $3.7 billion at the end of the preceding quarter. The company's balance sheet does not have any long-term debt. It generated cash flow from operations of $231.5 million compared with $275.4 million in the previous reported quarter. Free cash flow came in at $178.4 million.  Fiscal 2019 Highlights  For fiscal 2019, the company reported total revenues of $2.9 billion, which grew 28% year over year. Also, revenues from its products rose 24.6% year over year to $1.01 billion. Plus, revenues from Subscription and support improved 29.4% to $1.8 billion.  Guidance  For the first quarter of fiscal 2020, Palo Alto anticipates revenue growth of 16-17% year over year. Billings growth is anticipated between 15% and 17% year over year. Non-GAAP earnings per share are estimated in the range of $1.02-$1.04, which includes expenses related to the acquisition of Zingbox. For fiscal 2020, the company expects billings to increase in the range of 17-19% year over year. Revenue growth for the fiscal is envisioned to grow within 19-20% year over year. The company expects billings growth of its next-generation security business (Prisma and Cortex) at 77-79%. Non-GAAP earnings per share are estimated in the band of $5-$5.1 for fiscal 2020. Moreover, management projects a 20% CAGR for total billings and total revenue over the next three years. The company hopes to achieve $6 billion in total billings and $5 billion in total revenues by fiscal 2022.  Zacks Rank & Stocks to Consider  Palo Alto currently has a Zacks Rank #3 (Hold). A few better-ranked stocks in the broader technology sector are Anixter International AXE  , LogMeIn LOGM  and Perficient PRFT  , each flaunting a Zacks Rank #1 (Strong Buy). You can see   the complete list of today's Zacks #1 Rank stocks   here .   Long-term earnings growth rate for Anixter, LogMeIn and Perficient is currently projected to be 8%, 5% and 10.8%, respectively.  It's Illegal in 42 States, But Investors Will Make   Billions Legally  In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year. That's twice as much as they spend on marijuana, legally or otherwise. Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.   See these 5 \"sin stocks\" now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Palo Alto Networks, Inc. (PANW): Free Stock Analysis Report   Perficient, Inc. (PRFT): Free Stock Analysis Report   LogMein, Inc. (LOGM): Free Stock Analysis Report   Anixter International Inc. (AXE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Palo Alto Networks PANW  reported fourth-quarter fiscal 2019 non-GAAP earnings of $1.47 per share, which not only improved 14.8% year over year but also surpassed the Zacks Consensus Estimate of $1.45.",
    "Moreover, the company's revenues of $805.8 million increased 22% year over year, outpacing the consensus estimate of $803 million.",
    "The impressive results were mainly driven by several deal wins and the increasing adoption of the company's next-generation security platforms. Growing traction in newer Prisma and Cortex offerings was another tailwind.",
    "In a parallel announcement, Palo Alto clarified its intent to acquire the IoT security start-up Zingbox for $75 million.",
    " Quarterly Details ",
    "Product revenues increased approximately 12.3% to $305.7 million. The company also witnessed a 29.4% jump in subscription and support revenues to $500.1 million.",
    "Further, billings improved 22% year over year to $1.1 billion. Deferred revenues rose 27% to $2.9 billion as well.",
    "Region wise, revenues from the Americas climbed 24.7% while revenues from Europe, the Middle East and Africa, and Asia Pacific were up 17.6% and 16.8%, respectively.",
    "During the quarter, the company added nearly 3,000 customers. It boasts 65,000 customers currently.",
    "Additionally, Palo Alto's non-GAAP gross margin expanded 130 basis points (bps) on a year-over-year basis to 77.5%.",
    "While non-GAAP operating expense of $450.4 million as a percentage of revenues expanded 400 bps to 55.9%, non-GAAP operating margin contracted 270 bps to 21.6%.",
    "  Palo Alto Networks, Inc. Price, Consensus and EPS     Surprise      Palo Alto Networks, Inc.   price-consensus-eps-surprise-chart    |   Palo Alto Networks, Inc. Quote  ",
    " Palo Alto Networks, Inc. Price, Consensus and EPS     Surprise ",
    " Palo Alto Networks, Inc.   price-consensus-eps-surprise-chart    |   Palo Alto Networks, Inc. Quote ",
    " Balance Sheet ",
    "Palo Alto exited the fiscal fourth quarter with cash, cash equivalents and short-term investments of approximately $2.8 billion compared with $3.7 billion at the end of the preceding quarter.",
    "The company's balance sheet does not have any long-term debt.",
    "It generated cash flow from operations of $231.5 million compared with $275.4 million in the previous reported quarter. Free cash flow came in at $178.4 million.",
    " Fiscal 2019 Highlights ",
    "For fiscal 2019, the company reported total revenues of $2.9 billion, which grew 28% year over year.",
    "Also, revenues from its products rose 24.6% year over year to $1.01 billion. Plus, revenues from Subscription and support improved 29.4% to $1.8 billion.",
    " Guidance ",
    "For the first quarter of fiscal 2020, Palo Alto anticipates revenue growth of 16-17% year over year. Billings growth is anticipated between 15% and 17% year over year.",
    "Non-GAAP earnings per share are estimated in the range of $1.02-$1.04, which includes expenses related to the acquisition of Zingbox.",
    "For fiscal 2020, the company expects billings to increase in the range of 17-19% year over year. Revenue growth for the fiscal is envisioned to grow within 19-20% year over year. The company expects billings growth of its next-generation security business (Prisma and Cortex) at 77-79%.",
    "Non-GAAP earnings per share are estimated in the band of $5-$5.1 for fiscal 2020.",
    "Moreover, management projects a 20% CAGR for total billings and total revenue over the next three years. The company hopes to achieve $6 billion in total billings and $5 billion in total revenues by fiscal 2022.",
    " Zacks Rank & Stocks to Consider ",
    "Palo Alto currently has a Zacks Rank #3 (Hold). A few better-ranked stocks in the broader technology sector are Anixter International AXE  , LogMeIn LOGM  and Perficient PRFT  , each flaunting a Zacks Rank #1 (Strong Buy). You can see   the complete list of today's Zacks #1 Rank stocks   here .  ",
    "Long-term earnings growth rate for Anixter, LogMeIn and Perficient is currently projected to be 8%, 5% and 10.8%, respectively.",
    " It's Illegal in 42 States, But Investors Will Make   Billions Legally ",
    "In addition to the companies you read about above, today you get details on the newly-legalized",
    "industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    "That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "  See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:08:00"
}