{
  "url": "https://www.nasdaq.com/article/mugabes-family-say-burial-to-be-private-place-still-unknown-20190912-00264",
  "title": "Mugabe's family say burial to be private, place still unknown - Nasdaq.com",
  "text": [
    "By MacDonald Dzirutwe and Alexander Winning",
    "HARARE, Sept 12 (Reuters) - Zimbabwe's former president Robert Mugabe will be buried next week at a private ceremony at an as-yet-undisclosed location, his family said on Thursday, rejecting plans bythe rulers that overthrew himto inter him at a state monument.",
    "Mugabe, who ruled Zimbabwe for 37 years until he was ousted by his own army in November 2017, died in a Singapore hospital six days ago aged 95. His body arrived in Zimbabwe from Singapore on Wednesday and was due to lie in state on Thursday.",
    "Mnangagwa and the ruling ZANU-PF party want Mugabe buried at a national monument to heroes of the liberation war against  white minority rule. The government had planned for a state funeral on Saturday and then burial on Sunday.",
    "But some of Mugabe's relatives have pushed back against that plan. They share Mugabe's bitterness at the way former allies including Mnangagwa conspired to topple him and want him buried in his home village.",
    "Leo Mugabe, the late president's nephew, told Reuters the burial ceremony would be private, without saying where it would be.",
    "\"If I tell you that it won't be private,\" he said.",
    "The family on Thursday issued a statement saying it was concerned about the manner in which the government was preparing the programme for Mugabe's funeral \"without consulting his immediate family\".",
    "The family \"also observed with shock that the Government of Zimbabwe is attempting to coerce us to accept a programme for funeral and burial\" which was contrary to Mugabe's wishes, the statement said.",
    "\"We are ready and willing to work with the government to develop a programme for the funeral and burial of the late Robert Gabriel Mugabe which is in conformance to his wishes on how his mortal remains will be interred,\" the family said.",
    "PAYING RESPECTS",
    "Mnangagwa, flanked by security and half a dozen soldiers carrying rifles, visited Mugabe's palatial home in the capital, known as Blue Roof, on Thursday to pay his respects.",
    "A choir wearing yellow T-shirts bearing Mnangagwa's face sang songs and played percussion as he arrived. He was later followed into the house by army officials and Mugabe family members.",
    "Around a hundred well-wishers sat under a marquee on a lawn beneath the main house, waiting to pay their respects.",
    "\"As long as ZANU-PF is in power and as long as I am leading, no one will deviate, you remain our icon, our commander and founding father,\" Mnangagwa said of Mugabe, addressing Mugabe's relatives and associates inside the room where the coffin draped in the Zimbabwean flag was being kept.",
    "Later on Thursday, Mugabe's body will lie in state at a Harare soccer stadium where ordinary Zimbabweans and supporters are expected to pay their respects. The body was then to be taken to his rural home in Kutama, 85 kilometres (50 miles) from the capital.",
    "A few thousand people, mostly supporters in ZANU-PF T-shirts, waited to pay respects at the Rufaro Satdium, the same venue where he took his first oath at independence in 1980.",
    "Mugabe presided over an economy wrecked by hyperinflation, shortages and deeply entrenched corruption, and a raging political rivalry between the country's two largest political parties, ZANU-PF and the opposition MDC.",
    "But many Zimbabweans also remember Mugabe as their country's liberator from white minority rule and for broadening people's access to education and land."
  ],
  "published_datetime": "2019-09-12 05:23:00"
}