{
  "url": "https://www.nasdaq.com/article/forexplans-for-trade-talks-cheer-risk-currencies-hit-safehaven-yen-20190905-00046",
  "title": "FOREX-Plans for trade talks cheer risk currencies, hit safe-haven yen - Nasdaq.com",
  "text": [
    "    * Trade-exposed currencies jump on U.S.-China trade talksdate",
    "* Yen sold as risk-on mood returns",
    "* Some moves retraced in afternoon trade as caution emerges",
    "By Tom Westbrook",
    "SINGAPORE, Sept 5 (Reuters) - China's yuan and theAustralian dollar rallied after news on Thursday that China-U.S.trade talks would resume next month, but investors sold the safehaven yen, even though any de-escalation in the trade war wouldbenefit Japanese exporters.",
    "Other factors helping support risk sentiment, were reducedchances of Britain crashing out of the European Union on Oct. 31without a deal, and a potential breakthrough in the Hong Kongpolitical crisis following a move to withdraw an extraditionbill that had sparked mass protests. urn:newsml:reuters.com:*:nL3N25W1FVurn:newsml:reuters.com:*:nL3N25W08H",
    "Sterling held onto gains made overnight, after the Britishparliament voted to stop a \"no deal\" Brexit and to prevent PrimeMinister Boris Johnson from calling a snap election that couldhave given him the mandate to keep alive the threat of \"nodeal\". urn:newsml:reuters.com:*:nL5N25V1FB",
    "It still leaves Brexit up in the air, with possible outcomesstill ranging from a no-deal exit to abandoning the wholeendeavour.",
    "The pound sat around $1.2241 and the euro EUR=EBS at$1.1027, mostly holding on to overnight gains.",
    "For the broader market, the resumption of China-U.S. tradetalks was the main factor at play. Talks will be held inWashington in early October, China's commerce ministry said. urn:newsml:reuters.com:*:nL3N25W0JF",
    "\"This news has injected a fair amount of optimism inmarkets,\" said Prashant Newnaha, senior rates strategist at TDSecurities in Singapore.",
    "\"It does seem that the markets were positioning morebearishly, and now we've gotten this potential good news and themarkets are running with it,\" he said, adding global economicindicators had also recently been showing some green shoots.",
    "Sentiment has been skittish, however, and some analystssounded a note of caution.",
    "\"The U.S. is still going to raise tariffs next month andDecember, as far as we know,\" said Joe Capurso, senior currencystrategist at the Commonwealth Bank of Australia in Sydney.",
    "\"That's a negative for the world economy and the Chineseeconomy.\"    ",
    "Against a basket of currencies, the dollar .DXY lifted alittle from a one-week low to 98.482.",
    "The Australian and New Zealand dollars, AUD=D3NZD=D3 Chinese yuan CNY= and South Korean won KRW= all jumpedagainst the dollar, while the yen JPY=EBS fell nearly 0.4% to106.75 per dollar, its weakest in more than three weeks.    ",
    " The Australian dollar touched a one-month high of $0.6825,seen as a technical resistance level while the New Zealanddollar hit a one-week peak of $0.6377. The trade-exposed wonclimbed the most of Asia's currencies, rising about 0.5% to1198.00 per dollar.",
    "The Canadian dollar CAD= spiked sharply to C$1.3344 perdollar after the Bank of Canada left interest rates on hold andsounded less dovish than the market had expected.",
    " (Reporting by Tom Westbrook; Editing by Simon Cameron-Moore) ((tom.westbrook@tr.com; +61466355340;))"
  ],
  "published_datetime": "2019-09-05 02:24:00"
}