{
  "url": "https://www.nasdaq.com/article/etfs-to-gain-as-surgical-robots-rise-in-popularity-cm1210807",
  "title": "ETFs to Gain as Surgical Robots Rise in Popularity - Nasdaq.com",
  "text": [
    " Russia's first humanoid robot - Fedor  (Final Experimental Demonstration Object Research) - was recently sent into space. Meanwhile, the CorPath GRX robot assisted a surgeon in the first remote heart operation on a patient 20 miles away in India  . These highlight the fact that we are living in an era that is largely dominated by AI applications and technological advancements. One field that is rapidly picking up pace and touching all the corners of our lives is - robotics (read: Here's Why You Should Invest in Robotics ETFs  ). In fact, a Research and Markets'  report states that the global robotics market is expected to see a CAGR of 25% between 2019 and 2024. Now the application of robots is not just limited to industrial use but a plethora of other areas like healthcare, entertainment, retail, automobile and defense.   Surgical Robots and Healthcare   The rise of medical mechatronics, powerful computing, improved sensing, microfabrication and molecular imaging has enabled new approaches to age-old problems faced by healthcare companies. The growing adoption of robot-assisted surgeries is being observed in the healthcare platform. In fact, per a Reuters' article  , for every three surgeries conducted in the United States, one will be performed with robotic systems by 2021. Accordingly, the global surgical robots market  is expected to see a CAGR of 10.4% to reach a value of $6.5 billion between 2018 and 2023. The growing need for automation in healthcare  , rising occurrences of chronic diseases, ageing population, complexities in surgical procedures, and the expanding demand for non-invasive surgeries with more accuracy and flexibility are factors driving the market. Notably, Intuitive Surgical's ISRG  robot-based da Vinci surgical system enables minimally-invasive surgery that reduces trauma associated with open surgery. The da Vinci System is powered by robotic technology which has provided the company with solid exposure to medical mechatronics, robotics and AI for healthcare. The company launched an upgrade to its flagship Vinci Xi technology - da Vinci X. In recent times, Stryker SYK  launched the robotic-arm assisted total knee arthroplasty application for use with its Mako System. Notably, this is the first and only robotic technology which can be used for total knee, hip and partial knee replacement procedures. Mako Total Knee utilizes both Stryker's robotic platform and its Triathlon Total Knee System, guided through CT-based 3D modeling of bone anatomy. Verb Surgical, a joint venture between Alphabet and Johnson & Johnson, is also said to be working on integrating big data and machine learning with robotic surgery. In a bid to grow in the field of robotics spine surgery, Medtronic MDT  acquired Mazor Robotics, an Israel-based robotic surgical guidance systems company. Following the completion of the transaction, Medtronic launched the Mazor X Stealth Edition robotics guidance platform in January 2019 and has already received positive feedback for this capability. The University of Oxford has conducted a trial of PRECEYES Surgical System  . In the trial, robotic surgeries were as successful or in some cases even more effective compared to traditional procedures  . Encouragingly, the medical fraternity is also planning to use surgical robots to provide gene therapy to the retina  . Another surgical robotics platform - Monarch  - includes flexible robotics, micro-instrumentation, data science, and other technologies for therapeutic and diagnostic bronchoscopic procedures.  ETFs to Shine  We highlight some ETFs that can benefit from the current trends in the surgical robots market.  Global X Robotics & Artificial Intelligence ETF   BOTZ   The fund seeks to replicate the investment results that correspond generally to the price and yield performance, before fees and expenses, of the Indxx Global Robotics & Artificial Intelligence Thematic Index. It holds 37 holdings in its basket with healthcare sector making 13% of the total weight. The fund has amassed $1.39 billion in assets under management and charges a fee of 68 basis points. The fund has gained 17.4% year to date.  ROBO Global Healthcare Technology and Innovation   ETF HTEC  The fund replicates the investment results that, before fees and expenses, correspond generally to the price and yield performance of the ROBO Global Healthcare Technology and Innovation Index. It holds around 85 stocks in its basket. It has amassed $2.4 million in assets under management and charges a fee of 68 basis points. The fund has lost 2% since its launch on Jun 25, 2019.  Want key ETF info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.   Get it free >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Intuitive Surgical, Inc. (ISRG): Free Stock Analysis Report   Stryker Corporation (SYK): Free Stock Analysis Report   Medtronic PLC (MDT): Free Stock Analysis Report   ROBO Global Healthcare Technology and Innovation ETF (HTEC): ETF Research Reports   Global X Robotics & Artificial Intelligence ETF (BOTZ): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    "Russia's first humanoid robot - Fedor  (Final Experimental Demonstration Object Research) - was recently sent into space. Meanwhile, the CorPath GRX robot assisted a surgeon in the first remote heart operation on a patient 20 miles away in India  . These highlight the fact that we are living in an era that is largely dominated by AI applications and technological advancements. One field that is rapidly picking up pace and touching all the corners of our lives is - robotics (read: Here's Why You Should Invest in Robotics ETFs  ).",
    "In fact, a Research and Markets'  report states that the global robotics market is expected to see a CAGR of 25% between 2019 and 2024. Now the application of robots is not just limited to industrial use but a plethora of other areas like healthcare, entertainment, retail, automobile and defense.",
    "  Surgical Robots and Healthcare  ",
    "The rise of medical mechatronics, powerful computing, improved sensing, microfabrication and molecular imaging has enabled new approaches to age-old problems faced by healthcare companies. The growing adoption of robot-assisted surgeries is being observed in the healthcare platform. In fact, per a Reuters' article  , for every three surgeries conducted in the United States, one will be performed with robotic systems by 2021. Accordingly, the global surgical robots market  is expected to see a CAGR of 10.4% to reach a value of $6.5 billion between 2018 and 2023.",
    "The growing need for automation in healthcare  , rising occurrences of chronic diseases, ageing population, complexities in surgical procedures, and the expanding demand for non-invasive surgeries with more accuracy and flexibility are factors driving the market.",
    "Notably, Intuitive Surgical's ISRG  robot-based da Vinci surgical system enables minimally-invasive surgery that reduces trauma associated with open surgery. The da Vinci System is powered by robotic technology which has provided the company with solid exposure to medical mechatronics, robotics and AI for healthcare. The company launched an upgrade to its flagship Vinci Xi technology - da Vinci X. In recent times, Stryker SYK  launched the robotic-arm assisted total knee arthroplasty application for use with its Mako System. Notably, this is the first and only robotic technology which can be used for total knee, hip and partial knee replacement procedures. Mako Total Knee utilizes both Stryker's robotic platform and its Triathlon Total Knee System, guided through CT-based 3D modeling of bone anatomy.",
    "Verb Surgical, a joint venture between Alphabet and Johnson & Johnson, is also said to be working on integrating big data and machine learning with robotic surgery. In a bid to grow in the field of robotics spine surgery, Medtronic MDT  acquired Mazor Robotics, an Israel-based robotic surgical guidance systems company. Following the completion of the transaction, Medtronic launched the Mazor X Stealth Edition robotics guidance platform in January 2019 and has already received positive feedback for this capability.",
    "The University of Oxford has conducted a trial of PRECEYES Surgical System  . In the trial, robotic surgeries were as successful or in some cases even more effective compared to traditional procedures  . Encouragingly, the medical fraternity is also planning to use surgical robots to provide gene therapy to the retina  .",
    "Another surgical robotics platform - Monarch  - includes flexible robotics, micro-instrumentation, data science, and other technologies for therapeutic and diagnostic bronchoscopic procedures.",
    " ETFs to Shine ",
    "We highlight some ETFs that can benefit from the current trends in the surgical robots market.",
    " Global X Robotics & Artificial Intelligence ETF   BOTZ  ",
    "The fund seeks to replicate the investment results that correspond generally to the price and yield performance, before fees and expenses, of the Indxx Global Robotics & Artificial Intelligence Thematic Index. It holds 37 holdings in its basket with healthcare sector making 13% of the total weight. The fund has amassed $1.39 billion in assets under management and charges a fee of 68 basis points. The fund has gained 17.4% year to date.",
    " ROBO Global Healthcare Technology and Innovation   ETF HTEC ",
    "The fund replicates the investment results that, before fees and expenses, correspond generally to the price and yield performance of the ROBO Global Healthcare Technology and Innovation Index. It holds around 85 stocks in its basket. It has amassed $2.4 million in assets under management and charges a fee of 68 basis points. The fund has lost 2% since its launch on Jun 25, 2019.",
    " Want key ETF info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.   Get it free >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:23:00"
}