{
  "url": "https://www.nasdaq.com/article/oil-holds-above-60-on-trade-hopes-us-inventories-eyed-20190905-00204",
  "title": "Oil holds above $60 on trade hopes; U.S. inventories eyed - Nasdaq.com",
  "text": [
    "By Alex Lawler",
    "LONDON, Sept 5 (Reuters) - Oil rose to $61 a barrel on Thursday as hopes of progress in resolving the U.S.-China trade row boosted investor sentiment, although a report showing U.S. crude inventories rose unexpectedly weighed on prices.",
    "Crude had gained more than 4% on Wednesday as positive Chinese economic data sparked a wider market rally. On Thursday, China said Beijing and Washington agreed to hold high-level trade talks in early October. ",
    "Benchmark Brent crude was up 32 cents at $61.02 a barrel by 1159 GMT, having earlier fallen to $60.25. U.S. West Texas Intermediate (WTI) crude fell 4 cents to $56.22.",
    "Still, the American Petroleum Institute (API), an industry group, on Wednesday said U.S. crude stockpiles rose by 400,000 barrels last week, whereas analysts had expected a fall. The government's official supply report is due later on Thursday. EA/S",
    "\"Oil prices remain range-bound despite yesterday's rally,\" said OANDA analyst Craig Erlam. \"API reported a modest increase in inventories on Wednesday, which failed to do much for oil prices.\"",
    "The prolonged U.S.-China trade dispute has been a dampener on oil prices but Brent is still up 12% this year, helped by production cuts led by the Organization of the Petroleum Exporting Countries and its allies including Russia.",
    "Nonetheless, both OPEC and Russia boosted production in August, according to a Reuters survey and Russian energy ministry figures, weighing on prices. ",
    "Also putting downward pressure on prices has been mounting evidence of slowing economic growth worldwide, which has prompted analysts to lower forecasts for oil demand growth.",
    "BP  Chief Financial Officer Brian Gilvary told Reuters on Wednesday that global oil demand was expected to grow by less than 1 million barrels per day in 2019, a slowdown from previous years. ",
    "Later on Thursday, attention will focus on U.S. government weekly inventory figures from the Energy Information Administration to see if they confirm API's view on inventory changes. The EIA report is due out at 1500 GMT.",
    "Analysts expect crude stocks fell by 2.5 million barrels in the week to Aug. 30."
  ],
  "published_datetime": "2019-09-05 05:58:00"
}