{
  "url": "https://www.nasdaq.com/article/china-urges-us-to-take-steps-to-ensure-nkorea-talks-resume-20190912-00050",
  "title": "China urges U.S. to take steps to ensure N.Korea talks resume - Nasdaq.com",
  "text": [
    "By Ben Blanchard",
    "BEIJING, Sept 12 (Reuters) - China urged the United States on Thursday to adopt an approach more conducive to dialogue in response to North Korea's goodwill in wanting to resume denuclearization talks, and again suggested United Nations sanctions relief be considered for Pyongyang.",
    "North Korea said on Monday it was willing to restart nuclear talks with the United States in late September but warned that dealings between the sides could end unless Washington takes a fresh approach.",
    "Speaking in Beijing, the Chinese government's top diplomat, State Councillor Wang Yi, said China welcomed North Korea's recent \"positive signals\" on resuming talks with the United States.",
    "\"We would be glad to see North Korea and the United States resuming talks on schedule at the end of the month,\" Wang told a joint news conference with Malaysian Foreign Minister Saifuddin Abdullah.",
    "Experience shows that for talks to achieve real progress, each side's core concerns must be addressed, Wang added.",
    "\"If there are only preconditions made for the other side, or lists drawn up, or even trying to use extreme pressure to get the other side to make unilateral concessions, then this didn't work in the past and it won't work now or in the future.\"",
    "North Korea has so far this year taken a series of positive steps, and has asked the United States to meet them half way, he said.",
    "\"We hope that the U.S. side can also take practical measures in this regard and make due efforts to ease the situation and promote dialogue.\"",
    "Wang did not mention North Korea's recent weapons tests.",
    "But he reiterated previous suggestions from China for sanctions relief for North Korea, though China has signed up the to onerous sanctions North Korea has endured for many years because of its nuclear and missile tests.",
    "\"We believe that the U.N. Security Council should in due course consider opening a discussion on the North Korea sanctions resolutions reversal clauses, to help North Korea alleviate the difficulties brought to the economy and people's livelihoods by the sanctions.\"",
    "China is North Korea's most important economic and diplomatic backer, and Wang visited Pyongyang last week.",
    "U.S. President Donald Trump and North Korean leader Kim Jong Un met at the demilitarised zone (DMZ) between the two Koreas in June and agreed to restart working-level negotiations that had been stalled since an unsuccessful second summit between the two leaders in Vietnam in February.",
    "Since the DMZ meeting, however, American officials said their attempts to resume talks had gone unanswered. North Korea has also conducted at least eight test launches since then, usually with multiple missiles each time."
  ],
  "published_datetime": "2019-09-12 02:20:00"
}