{
  "url": "https://www.nasdaq.com/article/a-brief-history-of-apples-payment-revolution-cm1206850",
  "title": "A Brief History of Apple's Payment Revolution - Nasdaq.com",
  "text": [
    "  This article was     first published by MyWallSt.   Which 2 pot stocks will beat the market? Find out in our       free guide!    Apple    (NASDAQ: AAPL) is nothing if not an enigma. Like its sometime   rival   Amazon    , the company has conquered one sector after another throughout   its lifespan, often working in secrecy for years before   announcing a world-changing technological innovation. With the   release of its new state-of-the-art Apple Card, many investors,   commentators, and fans are looking back on the impact the iPhone   maker has had on one industry in particular: the highly lucrative   payments space. Apple's involvement in the world of payments formally began in   2014, but the company had been preparing for its big debut for   years beforehand. After acquiring a number of start-ups and   filing patents related to payments, Apple took a leap in 2013 by   joining forces with three of the biggest names in the industry:   Visa    (NYSE: V) ,   MasterCard    (NYSE: MA) , and   American Express    (NYSE: AXP) . All three companies had been independently looking   at replacing the traditional information-sharing transaction   system with single-use digital \"tokens.\" Apple, with its   enormous brand power    , as well as its unmatched presence in hardware and software,   proved to be the perfect unifying force.makeArticleAd();   Image source: Unsplash.  Even more impressively, the tech giant went on that summer to   approach some of the biggest banks in the U.S. to help bring the   venture to fruition. The negotiations were highly secretive: One   major client,   JPMorgan Chase    (NYSE: JPM) , set up a bunker-like \"war room\" in its headquarters   where 300 people worked tirelessly on the project, of whom only   about a third knew the partner was Apple. The result of all of this, Apple Pay, was unveiled by CEO Tim   Cook in September 2014. At the company's iPhone 6 event, Cook   described the traditional card payment process as outdated and   insecure, relying as it did on a \"vulnerable magnetic interface\"   that made loss and theft far too easy. Apple's alternative   allowed customers to pay directly with their devices through   Apple Wallet, a corresponding mobile app. The initiative gained   worldwide attention, and within a few years, the likes of   Starbucks    , KFC, and   J.C. Penney     had all begun accepting Apple Pay. But Cook's ambitions didn't end there. As Apple Pay began   spreading throughout markets across the globe, the company ramped   up its focus on security. The move to \"tokenization\" that had   started with the Visa and Mastercard collaborations has been   developed and perfected over the years to produce an   unprecedentedly secure form of payment. Simply put, a \"token\"   refers to the substitution of sensitive information, such as   one's banking details, with nonsensitive data. Apple's brilliant   innovation was creating a single-use credit card number that   could safely verify a transaction while at the same time, owing   to its ephemerality, proving to be all but useless to   criminals. A key motivation for Apple's investment in payments -- as well   as in health, gaming, news, and streaming -- can be found in a   companywide directional shift. Last year's fourth-quarter   earnings report revealed that the company had seen its first   decline in profits and revenue for over a decade. A slowdown in   iPhone sales, as well as a spate of antitrust complaints and   investigations, caused widespread concern that the brand's glory   days were over. In March of this year, however, Apple confirmed   rumors when it officially announced that it   would intensify its push into services    . To phrase it simplistically, the company was saying that from   now on it would focus less on selling gadgets and   more on amassing subscribers    . The release this month of the Apple Card is one of many steps   in this direction. It also adds a new layer of security to   digital transactions, and -- thanks to the product's elegant   platinum design that recalls premium cards issued by banks --   brings the six-year payment venture full-circle, at least in   design terms. The extra security comes from the ease with which   an Apple customer can cancel a card if he or she encounters a   problem. Old-fashioned cardholders will know the pain of losing   their primary source of payment, the frustration of calling their   bank to report the loss, and the worrisome wait to have a   replacement sent to them. The Apple Card eliminates these   concerns. Since an Apple credit card number is essentially   virtual, a user can revoke a corrupted card within seconds   through the app and have a new number issued immediately. It has   been well-received so far, with one commentator calling it   \"insanely great.\" Apple is well-positioned to gain a serious market share in the   space. The company revealed recently that there are 1.4 billion   active Apple devices in circulation. in terms of user base, this   places Apple between the twin payment giants, Visa (with 3.3   billion cards in circulation) and Mastercard (875 million). While the card represents a major step forward for Apple Pay,   the company is still encouraging customers to use their devices   as their primary form of payment. For one thing, the card is   expensive to manufacture, and for another, it can be quite easily   damaged. The company was teased on social media for warning   physical cardholders that they'll need to take special care with   the product, including keeping it from \"hard surfaces or   materials\" and \"potentially abrasive objects.\" In order to ensure   that the card is used minimally (and that Apple devices are used   more commonly), Apple is offering customers a superior cashback   incentive for paying with a device. Tim Cook turned heads back in January when he announced that   Apple's \"greatest contribution to mankind\" would take place not   in mobile technology   but in the realm of healthcare    . This may prove to be true, but the revolution the company has   stirred in the world of digital transactions and payments may   well end up being a very close second.   Image source: MyWallSt.     One of these pot stocks is         already +100% this year. What are you waiting for?     MyWallSt operates a full disclosure policy. MyWallSt staff     currently hold long positions in Amazon and Apple. Read     our  full disclosure policy here  .    10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. The Motley Fool owns shares of and recommends     Amazon, Apple, Mastercard, Starbucks, and Visa. The Motley Fool     has the following options: short January 2020 $155 calls on     Apple, long January 2020 $150 calls on Apple, short January     2020 $155 calls on Apple, and long January 2020 $150 calls on     Apple. The Motley Fool has a     disclosure policy      .  ",
    " This article was     first published by MyWallSt.   Which 2 pot stocks will beat the market? Find out in our       free guide!  ",
    " Apple    (NASDAQ: AAPL) is nothing if not an enigma. Like its sometime   rival   Amazon    , the company has conquered one sector after another throughout   its lifespan, often working in secrecy for years before   announcing a world-changing technological innovation. With the   release of its new state-of-the-art Apple Card, many investors,   commentators, and fans are looking back on the impact the iPhone   maker has had on one industry in particular: the highly lucrative   payments space.",
    "Apple's involvement in the world of payments formally began in   2014, but the company had been preparing for its big debut for   years beforehand. After acquiring a number of start-ups and   filing patents related to payments, Apple took a leap in 2013 by   joining forces with three of the biggest names in the industry:   Visa    (NYSE: V) ,   MasterCard    (NYSE: MA) , and   American Express    (NYSE: AXP) . All three companies had been independently looking   at replacing the traditional information-sharing transaction   system with single-use digital \"tokens.\" Apple, with its   enormous brand power    , as well as its unmatched presence in hardware and software,   proved to be the perfect unifying force.",
    "  Image source: Unsplash. ",
    "Image source: Unsplash.",
    "Even more impressively, the tech giant went on that summer to   approach some of the biggest banks in the U.S. to help bring the   venture to fruition. The negotiations were highly secretive: One   major client,   JPMorgan Chase    (NYSE: JPM) , set up a bunker-like \"war room\" in its headquarters   where 300 people worked tirelessly on the project, of whom only   about a third knew the partner was Apple.",
    "The result of all of this, Apple Pay, was unveiled by CEO Tim   Cook in September 2014. At the company's iPhone 6 event, Cook   described the traditional card payment process as outdated and   insecure, relying as it did on a \"vulnerable magnetic interface\"   that made loss and theft far too easy. Apple's alternative   allowed customers to pay directly with their devices through   Apple Wallet, a corresponding mobile app. The initiative gained   worldwide attention, and within a few years, the likes of   Starbucks    , KFC, and   J.C. Penney     had all begun accepting Apple Pay.",
    "But Cook's ambitions didn't end there. As Apple Pay began   spreading throughout markets across the globe, the company ramped   up its focus on security. The move to \"tokenization\" that had   started with the Visa and Mastercard collaborations has been   developed and perfected over the years to produce an   unprecedentedly secure form of payment. Simply put, a \"token\"   refers to the substitution of sensitive information, such as   one's banking details, with nonsensitive data. Apple's brilliant   innovation was creating a single-use credit card number that   could safely verify a transaction while at the same time, owing   to its ephemerality, proving to be all but useless to   criminals.",
    "A key motivation for Apple's investment in payments -- as well   as in health, gaming, news, and streaming -- can be found in a   companywide directional shift. Last year's fourth-quarter   earnings report revealed that the company had seen its first   decline in profits and revenue for over a decade. A slowdown in   iPhone sales, as well as a spate of antitrust complaints and   investigations, caused widespread concern that the brand's glory   days were over. In March of this year, however, Apple confirmed   rumors when it officially announced that it   would intensify its push into services    . To phrase it simplistically, the company was saying that from   now on it would focus less on selling gadgets and   more on amassing subscribers    .",
    "The release this month of the Apple Card is one of many steps   in this direction. It also adds a new layer of security to   digital transactions, and -- thanks to the product's elegant   platinum design that recalls premium cards issued by banks --   brings the six-year payment venture full-circle, at least in   design terms. The extra security comes from the ease with which   an Apple customer can cancel a card if he or she encounters a   problem. Old-fashioned cardholders will know the pain of losing   their primary source of payment, the frustration of calling their   bank to report the loss, and the worrisome wait to have a   replacement sent to them. The Apple Card eliminates these   concerns. Since an Apple credit card number is essentially   virtual, a user can revoke a corrupted card within seconds   through the app and have a new number issued immediately. It has   been well-received so far, with one commentator calling it   \"insanely great.\"",
    "Apple is well-positioned to gain a serious market share in the   space. The company revealed recently that there are 1.4 billion   active Apple devices in circulation. in terms of user base, this   places Apple between the twin payment giants, Visa (with 3.3   billion cards in circulation) and Mastercard (875 million).",
    "While the card represents a major step forward for Apple Pay,   the company is still encouraging customers to use their devices   as their primary form of payment. For one thing, the card is   expensive to manufacture, and for another, it can be quite easily   damaged. The company was teased on social media for warning   physical cardholders that they'll need to take special care with   the product, including keeping it from \"hard surfaces or   materials\" and \"potentially abrasive objects.\" In order to ensure   that the card is used minimally (and that Apple devices are used   more commonly), Apple is offering customers a superior cashback   incentive for paying with a device.",
    "Tim Cook turned heads back in January when he announced that   Apple's \"greatest contribution to mankind\" would take place not   in mobile technology   but in the realm of healthcare    . This may prove to be true, but the revolution the company has   stirred in the world of digital transactions and payments may   well end up being a very close second.",
    "  Image source: MyWallSt. ",
    "Image source: MyWallSt.",
    "   One of these pot stocks is         already +100% this year. What are you waiting for?   ",
    " MyWallSt operates a full disclosure policy. MyWallSt staff     currently hold long positions in Amazon and Apple. Read     our  full disclosure policy here  . ",
    "  10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. The Motley Fool owns shares of and recommends     Amazon, Apple, Mastercard, Starbucks, and Visa. The Motley Fool     has the following options: short January 2020 $155 calls on     Apple, long January 2020 $150 calls on Apple, short January     2020 $155 calls on Apple, and long January 2020 $150 calls on     Apple. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:27:00"
}