{
  "url": "https://www.nasdaq.com/article/europe-orders-urgent-airbus-helicopter-checks-after-norway-crash-20190911-00515",
  "title": "Europe orders urgent Airbus helicopter checks after Norway crash - Nasdaq.com",
  "text": [
    "By Gwladys Fouche and Terje Solsvik",
    "OSLO, Sept 11 (Reuters) - European regulators have ordered immediate checks on recently delivered versions of some Airbus  helicopters after a crash in Arctic Norway last month killed five Norwegians and their Swedish pilot.",
    "Norwegian investigators have not discovered a root cause of the AS350 B3E helicopter crash on Aug. 31, but preliminary findings prompted Airbus Helicopters, the world's largest commercial helicopter maker, to call for precautionary checks on parts linking the engine and main gearbox.",
    "About 400 helicopters worldwide are affected by the checks, which apply to recently delivered examples of lightweight helicopters with fewer than 300 hours of flying time.",
    "The crashed aircraft had flown just 73 hours.",
    "The models covered by the inspections include the single-engine AS350 B3, part of the best-selling Ecureuil family, and the similar EC130 T2. The helicopters were designed for fire-fighting, medical evacuation, police surveillance and passenger transport. Airbus also ordered checks on one military version.",
    "Helitrans, operator of the crashed helicopter, said it had performed the newly-required inspections on its 15 remaining helicopters of the same type.",
    "\"There were no discoveries of any kind. In accordance with the recommendations from Airbus, the helicopters are thus cleared to fly and will be put back into operation,\" the company said in a statement.",
    "In 2016 an Airbus Super Puma helicopter crashed off the coast of Norway, killing all 13 people aboard, as a result of metal fatigue in its gearbox. ",
    "Norwegian authorities later recommended that Airbus revise the design of the main gearbox of its AS 332 L2 and EC 225 LP Super Puma helicopters. These models are different from the model that crashed in August.",
    "In the 2016 crash the Super Puma's main rotor blades separated from the helicopter as it was ferrying passengers from an offshore oil platform."
  ],
  "published_datetime": "2019-09-11 09:45:00"
}