{
  "url": "https://www.nasdaq.com/article/boj-considering-ways-to-deepen-negative-rates-at-minimal-cost-20190912-00204",
  "title": "BOJ considering ways to deepen negative rates at minimal cost - Nasdaq.com",
  "text": [
    "By Leika Kihara",
    "TOKYO, Sept 12 (Reuters) - The Bank of Japan is brainstorming ways to deepen negative interest rates at minimal cost, as it considers adopting it as a main policy response to a slowing economy and intensifying global risks, sources familiar with the bank's thinking said.",
    "Any such move will likely be combined with measures to prevent the yield curve from flattening too much, as excessive declines in long- and super-long yields will erode profit margins of financial institutions, they said.",
    "With markets calm for now, the BOJ is leaning towards holding fire at the Sept. 18-19 meeting unless bolder-than expected monetary easing steps by its European and U.S. peers stoke turbulence in markets and lead to an unwelcome yen spike, the sources said.",
    "The BOJ's meeting follows the European Central Bank's policy announcement on Sept. 12 and that of the U.S. Federal Reserve on Sept. 18.",
    "\"Regardless of when the BOJ acts, it must start thinking of what it can do. In doing so, it's very important to consider the side-effects (of additional easing),\" one of the sources said on condition of anonymity.",
    "BOJ policymakers are debating ideas on what tools they could deploy in coming months, if not next week, to prevent slumping global demand from derailing Japan's fragile economic recovery, the sources said.",
    "Pushing its short-term rate target deeper into negative territory is the most likely option if the goal is to boost economic growth via lower borrowing costs, the sources said.",
    "The major concern for the BOJ policymakers in considering deepening negative rates is that such a move risks triggering sharp declines in long-term bond yields and hurting financial institutions' earnings, they added.",
    "Yet, preventing that from happening is no easy task, as pushing down short-term rates would naturally put downward pressure on long-term borrowing costs.",
    "The dilemma underscores the limits of negative rates, something U.S. President Donald Trump called for but has only been reluctantly adopted by other world central banks to battle weak economic growth given dwindling ammunition. ",
    "After years of massive stimulus and super-low rates, the BOJ is left with a diminishing policy arsenal and finds itself boxed into a corner.",
    "\"It's undesirable for the yield curve to flatten too much,\" another sources said, a view echoed by two other sources. \"It would go against the principle of yield curve control.\"",
    "JAWBONING FOR NOW",
    "Under yield curve control (YCC), the BOJ guides short-term rates towards -0.1% and the 10-year government bond yield to around 0%. It also buys government bonds and risky assets in a bid to achieve its elusive 2% inflation target.",
    "Deepening negative rates is highly controversial as it would crush already thin margins financial institutions earn from lending. Still, it is considered the most effective tool to keep yen rises in check and spur growth via lower borrowing costs.",
    "The key is to keep the yield curve steep enough to leave some breathing space for banks, as well as pension funds and insurance firms that invest in super-long bonds.",
    "Signalling its displeasure over falling long-term yields, the BOJ cut bond purchases in market operations when the 10-year bond yield slid to -0.295% on Aug. 4, well below the -0.2% level considered by markets by the bank's line in the sand.",
    "That day, the 20-year bond yield fell to 0.015%, barely staying above zero.",
    "\"The BOJ won't tolerate super-long yields falling below zero,\" the second source said.",
    "There is no consensus yet on what the best approach would be to keep excessive yield falls in check.",
    "The first step could be to communicate more clearly the BOJ's resolve to battle any unwelcome decline in super-long yields via slower bond purchases, the sources said.",
    "BOJ Governor Haruhiko Kuroda did just that when he fired a warning last week, telling the Nikkei newspaper in an interview that super-long yields have fallen \"a bit too far.\" ",
    "\"It's tricky but what's important is to keep the yield curve in an appropriate shape,\" a third source said."
  ],
  "published_datetime": "2019-09-12 05:50:00"
}