{
  "url": "https://www.nasdaq.com/article/financial-sector-update-for-09032019-spgitrnoctolyvbx-cm1206898",
  "title": "Financial Sector Update for 09/03/2019: SPGI,TRNO,CTO,LYV,BX - Nasdaq.com",
  "text": [
    "Top Financial Stocks",
    "JPM -1.38%",
    "BAC -1.94%",
    "WFC -0.89%",
    "C -1.69%",
    "USB -0.83%",
    "Financial stocks were ending mostly lower this afternoon, with the NYSE Financial Index sinking over 0.8% while shares of financial companies in the S&P 500 were falling more than 1.2%. The Philadelphia Housing Index was off nearly 0.7%.",
    "Among financial stocks moving on news:",
    "(+) S&P Global ( SPGI  ) turned lower this afternoon, giving back a 1% gain that followed the financial data company announcing a pair of acquisitions by its Platts division, including Canadian Enerdata, the publisher of the Canadian Gas Price Reporter. It also purchased the UK-based Live Rice Index, which supplies benchmark price assessments and other information to the rice industry. Financial terms of the acquisitions were not disclosed.",
    "In other sector news:",
    "(+) Consolidated-Tomoka Land Co ( CTO  ) rose 1% higher after Tuesday saying it has acquired the Alpine Valley Music Theatre near Milwaukee for an undisclosed price. The 37,000-seat amphitheater in East Troy, Wisc., operates under an absolute net lease with Live Nation Entertainment ( LYV  ) expiring in 2030.",
    "(+) Terreno Realty ( TRNO  ) was hanging on to a slim rise late in Tuesday trading after the real estate investment trust said it has purchased a 192,000-square-foot industrial property in New York for around $80.5 million. The fully leased property contains two industrial distribution buildings covering six acres in Brooklyn's East Williamsburg neighborhood.",
    "(-) Blackstone Group ( BX  ) declined Tuesday, falling over 2%, after announcing plans, through a subsidiary, for an offering of senior notes to help fund the redemption of all of its outstanding 5.875% senior notes due 2021.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-03 15:31:57"
}