{
  "url": "https://www.nasdaq.com/article/van-eck-solidx-attempt-to-bring-a-partial-bitcoin-etf-cm1208214",
  "title": "Van Eck, SolidX Attempt to Bring a Partial Bitcoin ETF - Nasdaq.com",
  "text": [
    "The bitcoin market has been facing its share of disruption of late. There were repeated attempts by issuers for a bitcoin ETF but the SEC disagreed on the same. In a new attempt, Van Eck Securities Corp. and SolidX Management LLC plan to start selling shares on Sep 5 in a limited version of a crypto exchange-traded fund.",
    "The shares will be sold in compliance with SEC's Rule 144A , which allows sale of privately placed securities to \"qualified institutional buyers.\" The rule will excuse the shares from securities registration. With this, \" VanEck and Solid will be able to offer shares of their VanEck SolidX Bitcoin Trust to institutions such as banks and hedge funds, but not retail investors, the report notes,\" per cointelegraph.com.",
    "This is not the first time that VanEck has attempted to launch a bitcoin ETF. On  its third attempt in mid-2018, the company had collaborated with blockchain company SolidX. The plan was to make the product physical and not futures based i.e. comprising actual bitcoin, which will be \" insured against any loss or theft .\" The VanEck SolidX Bitcoin Trust was supposed to have the ticker symbol \"XBTC\". However, it failed to amass SEC's trust as the regulatory body postponed its ruling on the fund (read:  Yet Another SEC Disapproval for Bitcoin ETF: What Next? ).\"",
    "Before this, SolidX's proposal of a physically-backed bitcoin ETF was dismissed by the Securities and Exchange Commission in March 2017 and VanEck  withdrew its application  for a futures-based bitcoin ETF in January 2018, per etf.com.",
    "On Aug 12, the SEC postponed decisions on bitcoin ETF proposals by Bitwise Asset Management and Wilshire Phoenix, all of which hoped to become the first to offer a crypto ETF in the United States. \"Those decisions are now scheduled for later this month and in October.\"",
    "What's Keeping SEC From Giving Its Nod?",
    "SEC is worried about extreme price volatility in cryptocurrencies and liquidity in bitcoin-related funds. Per Reuters, the virtual currency can be deployed to quickly move money anywhere in the world without any central authority intervention, such as a bank or government. The market is pretty unregulated at the current level.",
    "How is the Coin Performing?",
    "So far this year, bitcoin has been extremely volatile. The bitcoin market faced its share of troubles from August 2018 to March 2019. It started performing better from late June. Bulls are wagering on the probability of a continued run as more institutions start to build out their own cryptocurrencies or launch projects using the underlying blockchain technology, per Bloomberg.",
    "Any ETF Alternatives to Play Bitcoin?",
    "Though bitcoin ETFs are not available to investors, they have blockchain ETFs at their disposal. Per a source, \"the  blockchain in Bitcoin  literally acts a ledger; it keeps track of the balances for all users and updates them as money changes hands.\"",
    "So, if investors cannot lay their hands on a bitcoin ETF now, they can definitely familiarize themselves with the concept through blockchain ETFs like  Reality Shares Nasdaq NexGen Economy ETF BLCN ,  Amplify Transformational Data Sharing ETF BLOK and  First Trust Indxx Innovative Transaction & Process ETF LEGR . ",
    "Want key ETF info delivered straight to your inbox?",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.  Get it free >>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 01:00:00"
}