{
  "url": "https://www.nasdaq.com/article/how-much-do-americans-spend-on-car-repairs-cm1210853",
  "title": "How Much Do Americans Spend on Car Repairs? - Nasdaq.com",
  "text": [
    "Your car may bring you joy -- or it may just bring you to work and wherever else you need to go. But however you feel about the vehicle, someday, inevitably, it's also going to bring you some grief, in the form of a large bill from the auto mechanic.",
    "Some people, recognizing that fact, treat their car like a four-wheeled family member. They take it in for yearly checkups, and make sure it receives all of its manufacturer-recommended maintenance and oil changes. But just as people who take care of themselves, get annual physicals, and follow their doctors' orders still get sick, well-maintained cars can still develop problems.",
    "And interestingly, there are some significant differences in how hard those problems hit people in the wallet, depending on their age group.",
    "The costs of auto repairs and maintenance add up. Image source: Getty Images.",
    "Given that a person can drive a car for years with no major breakdowns, its best to take a longer-term view when thinking about our spending on repairs. The average American spent $1,986 over the last five years on vehicle repairs and maintenance, according to a survey by Ally Financial conducted by Harris Poll.",
    "Among millennials and Generation Zers, (18- to 34-year-olds, as defined by the bank , which offers car loans and auto insurance) that average was higher -- $2,334. People 55 and older only spent $1,654 on average, while 35- to 44 -year-olds laid out $1,978 and 45- to 54-year-olds shelled out $2,135.",
    "Two issues in particular are likely major factors in driving repairs costs up for younger drivers. First, they're more likely to own older cars. And second, they're more likely to have longer commutes than workers who are farther along in their careers.",
    "\"Many Americans rely on their cars to get to work and losing access to your vehicle can be a major disruption and huge source of stress-particularly if you can't cover the repair cost,\" said Mark Manzo, president of insurance at Ally Financial. \"The financial strain can be even more daunting for young people who are early in their careers and may be paying down student loan debt as well.\"",
    "Those repair bills are also liable to hit young people harder because so many of them aren't prepared financially for the unexpected. Fully two-thirds of 18- to 24-year-olds lack any emergency savings, according to another recent Ally survey . That's bad, though not too much worse than the situation across the board: Roughly half of all U.S. adults have no emergency fund.",
    "When you buy a car, it's important to factor maintenance and repair costs into your budget and your purchasing calculations. Unbiased outlets like Consumer Reports can show you which new and used vehicles are the most reliable and have the lowest likelihoods of major mechanical problems, but even choosing wisely won't eliminate the possibility of something going wrong.",
    "It all adds up to just one more excellent reason to plan for a rainy day and build up your emergency fund. Ideally, you'll want to be able to cover three to six months worth of living expenses with cash on hand.",
    "That's likely to be a longer-term goal to aim for -- and if you're starting from a basically bare savings account, it might seem an unreachable one. But don't let that discourage you from getting started: However far along in your efforts you are when that next emergency strikes, it'll be an improvement over not having prepared at all, and having even a few hundred dollars in the bank may be enough to get your car back on the road without resorting to a high-interest credit card.",
    "The $16,728 Social Security bonus most retirees completely overlook\r\n If you're like most Americans, you're a few years (or more) behind on your retirement savings. But a handful of little-known \"Social Security secrets\" could help ensure a boost in your retirement income. For example: one easy trick could pay you as much as $16,728 more... each year! Once you learn how to maximize your Social Security benefits, we think you could retire confidently with the peace of mind we're all after. Simply click here to discover how to learn more about these strategies .",
    "Daniel B. Kline has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 05:51:00"
}