{
  "url": "https://www.nasdaq.com/article/dollar-general-dg-displays-solid-run-adds-20-in-3-months-cm1207962",
  "title": "Dollar General (DG) Displays Solid Run, Adds 20% in 3 Months - Nasdaq.com",
  "text": [
    "  Dollar General Corporation DG  has emerged as an investor favorite courtesy of sound fundamentals and growth efforts that reinforce its position in the ultra-competitive retail landscape. We note that shares of this Tennessee-based company have advanced 20.1% in the past three months compared with the industry  's growth of 14%. This Zacks Rank #3 (Hold) stock has also comfortably outperformed the Retail-Wholesale  sector and the S&P 500 Index that rallied 6.6% and 2.1%, respectively. Further, the stock is trading close to its 52-week high of $158.91. In all likelihood, Dollar General with a long-term earnings growth rate of 11.1% can attain new highs. You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   . The stock got a boost following the company's better-than-expected second-quarter fiscal 2019 results, wherein both the top and the bottom line improved year over year. Further, the company witnessed robust same-store sales performance. This was the second straight quarter of positive earnings and sales surprises. (Read: Dollar General Stock Up on Q2 Earnings Beat, Upbeat View  ) Impressive performance prompted the company to raise fiscal 2019 view. As a result, the Zacks Consensus Estimate for earnings has been trending north. The consensus mark for fiscal 2019 and 2020 has increased 3 cents and 4 cents to $6.53 and $7.25, respectively.     Strategic Endeavors to Drive Momentum  Dollar General is committed toward ramping up investments in the wake of rising competition from the likes of Dollar Tree DLTR  , Costco COST  and Ross Stores ROST  . The company's everyday low-price model is anticipated to drive traffic persistently despite the rising popularity of online retailers. We believe that store expansion initiatives and continued restructuring, as evident from steady store openings and the improvement of distribution centers, should keep driving higher revenues. The company's impressive same-store sales growth story is testament to the same. Fiscal 2018 marked the 29th consecutive year of same-store sales growth for the company. The trend persisted in the second quarter of fiscal 2019 as well, wherein same-store sales improved 4% year over year. This follows an increase of 3.8% in the preceding quarter. Management now expects net sales growth of 8% with same-store sales expected to increase in the low-to-mid 3% range. In order to increase traffic, Dollar General is focusing on both consumables and non-consumables categories. The company is also offering better-for-you products at affordable prices. Additionally, the company is expanding cooler facilities to enhance the sale of perishable items and rolling out DG digital coupon program and DG Go app. Management introduced two transformational strategic initiatives - DG Fresh, designed to enable self-distribution of fresh and frozen products, and Fast Track, an in-store labor productivity and customer convenience initiative. The company has adopted a disciplined approach to store openings, expansion and refurbishment. It plans to open about 975 new stores, remodel 1,000 stores and relocate 100 stores in fiscal 2019. Of the planned remodels, the company plans to convert approximately 500 stores in the Dollar General traditional plus format. During the first half, the company opened 489 new stores, remodeled 653 stores (including 254 DGTP remodels), and remodeled and relocated 46 stores.  Wrapping Up  Clearly, in spite of a tough retail landscape, the company has been thriving, when many other traditional operators are finding it difficult to cope. Better pricing, private label offerings, effective inventory management, and merchandise initiatives have aided the company in carving out a niche in the retail space.  It's Illegal in 42 States, But Investors Will Make   Billions Legally  In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year. That's twice as much as they spend on marijuana, legally or otherwise. Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.   See these 5 \"sin stocks\" now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Dollar General Corporation (DG): Free Stock Analysis Report   Dollar Tree, Inc. (DLTR): Free Stock Analysis Report   Ross Stores, Inc. (ROST): Free Stock Analysis Report   Costco Wholesale Corporation (COST): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Dollar General Corporation DG  has emerged as an investor favorite courtesy of sound fundamentals and growth efforts that reinforce its position in the ultra-competitive retail landscape. We note that shares of this Tennessee-based company have advanced 20.1% in the past three months compared with the industry  's growth of 14%.",
    "This Zacks Rank #3 (Hold) stock has also comfortably outperformed the Retail-Wholesale  sector and the S&P 500 Index that rallied 6.6% and 2.1%, respectively. Further, the stock is trading close to its 52-week high of $158.91. In all likelihood, Dollar General with a long-term earnings growth rate of 11.1% can attain new highs. You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    "The stock got a boost following the company's better-than-expected second-quarter fiscal 2019 results, wherein both the top and the bottom line improved year over year. Further, the company witnessed robust same-store sales performance. This was the second straight quarter of positive earnings and sales surprises. (Read: Dollar General Stock Up on Q2 Earnings Beat, Upbeat View  )",
    "Impressive performance prompted the company to raise fiscal 2019 view. As a result, the Zacks Consensus Estimate for earnings has been trending north. The consensus mark for fiscal 2019 and 2020 has increased 3 cents and 4 cents to $6.53 and $7.25, respectively.",
    " Strategic Endeavors to Drive Momentum ",
    "Dollar General is committed toward ramping up investments in the wake of rising competition from the likes of Dollar Tree DLTR  , Costco COST  and Ross Stores ROST  . The company's everyday low-price model is anticipated to drive traffic persistently despite the rising popularity of online retailers. We believe that store expansion initiatives and continued restructuring, as evident from steady store openings and the improvement of distribution centers, should keep driving higher revenues.",
    "The company's impressive same-store sales growth story is testament to the same. Fiscal 2018 marked the 29th consecutive year of same-store sales growth for the company. The trend persisted in the second quarter of fiscal 2019 as well, wherein same-store sales improved 4% year over year. This follows an increase of 3.8% in the preceding quarter. Management now expects net sales growth of 8% with same-store sales expected to increase in the low-to-mid 3% range.",
    "In order to increase traffic, Dollar General is focusing on both consumables and non-consumables categories. The company is also offering better-for-you products at affordable prices. Additionally, the company is expanding cooler facilities to enhance the sale of perishable items and rolling out DG digital coupon program and DG Go app. Management introduced two transformational strategic initiatives - DG Fresh, designed to enable self-distribution of fresh and frozen products, and Fast Track, an in-store labor productivity and customer convenience initiative.",
    "The company has adopted a disciplined approach to store openings, expansion and refurbishment. It plans to open about 975 new stores, remodel 1,000 stores and relocate 100 stores in fiscal 2019. Of the planned remodels, the company plans to convert approximately 500 stores in the Dollar General traditional plus format. During the first half, the company opened 489 new stores, remodeled 653 stores (including 254 DGTP remodels), and remodeled and relocated 46 stores.",
    " Wrapping Up ",
    "Clearly, in spite of a tough retail landscape, the company has been thriving, when many other traditional operators are finding it difficult to cope. Better pricing, private label offerings, effective inventory management, and merchandise initiatives have aided the company in carving out a niche in the retail space.",
    " It's Illegal in 42 States, But Investors Will Make   Billions Legally ",
    "In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    "That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "  See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:19:00"
}