{
  "url": "https://www.nasdaq.com/article/abc-vs-wst-which-stock-should-value-investors-buy-now-cm1207993",
  "title": "ABC vs. WST: Which Stock Should Value Investors Buy Now? - Nasdaq.com",
  "text": [
    " Investors interested in Medical - Dental Supplies stocks are likely familiar with AmerisourceBergen (ABC) and West Pharmaceutical Services (WST). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look. We have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits. Currently, both AmerisourceBergen and West Pharmaceutical Services are holding a Zacks Rank of # 2 (Buy). This means that both companies have witnessed positive earnings estimate revisions, so investors should feel comfortable knowing that both of these stocks have an improving earnings outlook. But this is just one factor that value investors are interested in. Value investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels. Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years. ABC currently has a forward P/E ratio of 12.08, while WST has a forward P/E of 48.22. We also note that ABC has a PEG ratio of 1.53. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. WST currently has a PEG ratio of 4.21. Another notable valuation metric for ABC is its P/B ratio of 5.76. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, WST has a P/B of 7.55. Based on these metrics and many more, ABC holds a Value grade of A, while WST has a Value grade of C. Both ABC and WST are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that ABC is the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  AmerisourceBergen Corporation (ABC): Free Stock Analysis Report   West Pharmaceutical Services, Inc. (WST): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors interested in Medical - Dental Supplies stocks are likely familiar with AmerisourceBergen (ABC) and West Pharmaceutical Services (WST). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look.",
    "We have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits.",
    "Currently, both AmerisourceBergen and West Pharmaceutical Services are holding a Zacks Rank of # 2 (Buy). This means that both companies have witnessed positive earnings estimate revisions, so investors should feel comfortable knowing that both of these stocks have an improving earnings outlook. But this is just one factor that value investors are interested in.",
    "Value investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels.",
    "Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years.",
    "ABC currently has a forward P/E ratio of 12.08, while WST has a forward P/E of 48.22. We also note that ABC has a PEG ratio of 1.53. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. WST currently has a PEG ratio of 4.21.",
    "Another notable valuation metric for ABC is its P/B ratio of 5.76. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, WST has a P/B of 7.55.",
    "Based on these metrics and many more, ABC holds a Value grade of A, while WST has a Value grade of C.",
    "Both ABC and WST are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that ABC is the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:40:20"
}