{
  "url": "https://www.nasdaq.com/article/cathay-pacific-freezes-new-hiring-to-focus-on-cost-cuts-20190911-00948",
  "title": "Cathay Pacific freezes new hiring, to focus on cost cuts - Nasdaq.com",
  "text": [
    "HONG KONG, Sept 12 (Reuters) - Cathay Pacific Airways Ltd  has put a freeze on new hiring, according to an internal memo seen by Reuters, as the airline battles a slump in demand from fliers avoiding Hong Kong amid massive anti-government protests in the city.",
    "In a memo to staff on Wednesday evening, new Chief Executive Augustus Tang said he had asked executives to examine spending and focus on cutting costs. The airline will also not replace departing employees in non-flying positions unless approved by a spending control committee, he said.",
    "Cathay has said it will cut capacity for the upcoming winter season after reporting an 11.3% fall in passenger numbers for August. The airline does not expect September to be any less difficult, while analysts have projected it could swing to a loss in the second half. ",
    "The weak demand and cuts to capacity will heap more pressure on Cathay and its new management, appointed after CEO Rupert Hogg quit last month in a shock move and the resignation of Chairman John Slosar last week. ",
    "Cathay, which is trying to complete a three-year financial turnaround plan, has become the biggest corporate casualty of the Hong Kong protests after China demanded it suspend staff involved in, or supporting, the demonstrations that have plunged the former British colony into a political crisis.",
    "Jefferies analyst Andrew Lee told clients he expected the airline could swing to a HK$973 million ($124.1 million) loss in the second half of the year. BOCOM International analyst Luya You said second-half earnings could be \"notably dismal\".",
    "Cathay last month swung to its first profit for the January-June period since 2016 and said at the time that the second half was likely to be better as usual due to seasonality.",
    "($1 = 7.8377 Hong Kong dollars)"
  ],
  "published_datetime": "2019-09-11 10:30:00"
}