{
  "url": "https://www.nasdaq.com/article/microsoft-msft-outpaces-stock-market-gains-what-you-should-know-cm1207619",
  "title": "Microsoft (MSFT) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Microsoft (MSFT) closed the most recent trading day at $137.63, moving +1.17% from the previous trading session. This change outpaced the S&P 500's 1.08% gain on the day. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%. Heading into today, shares of the software maker had gained 1% over the past month, outpacing the Computer and Technology sector's loss of 1.68% and the S&P 500's loss of 0.68% in that time. Wall Street will be looking for positivity from MSFT as it approaches its nex t earnings  report date. In tha t report  , analysts expect MSFT to post earnings of $1.24 per share. This would mark year-over-year growth of 8.77%. Meanwhile, our latest consensus estimate is calling for revenue of $32.21 billion, up 10.76% from the prior-year quarter. Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $5.22 per share and revenue of $139.76 billion. These totals would mark changes of +9.89% and +11.06%, respectively, from last year. Investors might also notice recent changes to analyst estimates for MSFT. Recent revisions tend to reflect the latest near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.01% higher. MSFT is currently sporting a Zacks Rank of #2 (Buy). In terms of valuation, MSFT is currently trading at a Forward P/E ratio of 26.04. Its industry sports an average Forward P/E of 29.27, so we one might conclude that MSFT is trading at a discount comparatively. We can also see that MSFT currently has a PEG ratio of 2.37. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. MSFT's industry had an average PEG ratio of 2.02 as of yesterday's close. The Computer - Software industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 50, putting it in the top 20% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Microsoft Corporation (MSFT): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Microsoft (MSFT) closed the most recent trading day at $137.63, moving +1.17% from the previous trading session. This change outpaced the S&P 500's 1.08% gain on the day. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%.",
    "Heading into today, shares of the software maker had gained 1% over the past month, outpacing the Computer and Technology sector's loss of 1.68% and the S&P 500's loss of 0.68% in that time.",
    "Wall Street will be looking for positivity from MSFT as it approaches its nex t earnings  report date. In tha t report  , analysts expect MSFT to post earnings of $1.24 per share. This would mark year-over-year growth of 8.77%. Meanwhile, our latest consensus estimate is calling for revenue of $32.21 billion, up 10.76% from the prior-year quarter.",
    "Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $5.22 per share and revenue of $139.76 billion. These totals would mark changes of +9.89% and +11.06%, respectively, from last year.",
    "Investors might also notice recent changes to analyst estimates for MSFT. Recent revisions tend to reflect the latest near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.01% higher. MSFT is currently sporting a Zacks Rank of #2 (Buy).",
    "In terms of valuation, MSFT is currently trading at a Forward P/E ratio of 26.04. Its industry sports an average Forward P/E of 29.27, so we one might conclude that MSFT is trading at a discount comparatively.",
    "We can also see that MSFT currently has a PEG ratio of 2.37. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. MSFT's industry had an average PEG ratio of 2.02 as of yesterday's close.",
    "The Computer - Software industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 50, putting it in the top 20% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:45:25"
}