{
  "url": "https://www.nasdaq.com/article/7-of-the-best-financial-stocks-to-buy-now-cm1206983",
  "title": "7 of the Best Financial Stocks to Buy Now - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "When the U.S. Federal Reserve ended its interest rate hiking cycle and started lowering rates instead, financial stocks drifted lower. With lower rates, banks earn fewer profits from the interest rate spread. Plus, rate cuts are usually done to stimulate a slowing economy. If banks rely on a healthy economy to get deals and drive more business, then we may expect profits to slow down.",
    "But there are several financial stocks to buy now that have the potential to bounce back higher as profit growth steadies.",
    "A few of these stocks to buy happen to be Canadian banks, which means there are a few important things to consider when investing in these stocks:",
    "With that out of the way, the here are the best financial stocks to own based on valuation, future growth prospects and dividend yield .",
    "Toronto-Dominion Bank (NYSE: TD ) reported third-quarter earnings on Aug. 29. It earned C$1.79 a share (non-GAAP) and GAAP earnings-per-share of C$1.74; meanwhinel, revenue rose 6.1% year-over-year to C$10.5 billion.",
    "TD has a healthy balance of exposure in Canadian and U.S. retail. Canadian Retail adjusted net income rose 3% from last year to C$1.92 billion. It benefited from both higher volumes and higher margins. Revenue from its wealth and insurance business also increased. Its U.S. Retail Bank adjusted net income grew 11% year-over-year to C$1.29 billion. TD Ameritrade performed very well as revenue grew 21% YoY.",
    "TD reported positive results in each of its segments because it continued to elevate the customer experience. It introduced solutions such as an international remittance tool. This lets its customers send money through Easy Web for a cash payout at over 500,000 Western Union (NYSE: WU ) locations worldwide. Its discount brokerage benefited from a refreshed Learning Center. In its U.S. Retail bank unit, revenue grew due to strong loan and deposit growth, along with higher fee income.",
    "TD's net interest margin was 3.27%, down sequentially on lower deposit margins and balance sheet mix. It also posted a 12% sequential increase in credit card losses ($191 million). These numbers are not enough to alarm investors. Its Tier 1 ratio is 12%, consistent with the prior quarter. Overall, TD benefited from strong credit quality across its portfolios and expects continued growth ahead.",
    "TD shares have a dividend yielding 4.16% and a price-to-earnings ratio of 11.6X.",
    "Royal Bank of Canada (NYSE: RY ) reported non-GAAP EPS of C$2.26 and GAAP EPS of C$2.22. Net income grew 8% to C$1.609 billion. Revenue rose 4.6% YoY to C$11.54 billion.",
    "The company reported higher earnings in Personal and Commercial Banking and Wealth Management and Insurance. It benefited from higher average fee-based client assets, driven by market appreciation and net sales. Net interest income grew thanks to average volume growth. This was offset by lower earnings in Capital Markets and Investor and Treasury Services. Royal recorded an 8 bps increase in provisions for credit losses (PCL), due to higher provisions in Capital Markets. But its CET1 ratio is a healthy 11.9% and the company raised its dividend by 3% to $1.05 a share. Royal also faced higher costs in support of business growth and higher variable compensation.",
    "To further increase shareholder returns, Royal Bank announced that it bought back C$197 million in the quarter and 5.7 million shares year-to-date.",
    "Looking ahead, the bank's strong underlying credit quality from its Canadian residential portfolio should continue to lift results. Interests are likely to fall next month in the country, stimulating mortgage demand. In Q3, its total mortgage portfolio was C$256 billion.",
    "Royal Bank trades at a P/E of 11.39 times earnings, while the stock offers a dividend yielding 4.21%.",
    "Bank of Montreal (NYSE: BMO ) fell hard in August ahead of its earnings report but finally found support at around $67. Even after a slight bounce, closing at $68.60, BMO stock trades at 9.7 times earnings. Its dividend yield is 4.55%. BMO reported non-GAAP EPS of C$2.36 and revenue growth of 4.5%, to C$5.78 billion. Despite reporting a higher provision for credit losses in the quarter, the market bid the stock higher after the quarterly report.",
    "Despite reporting higher provisions, its CEO expressed confidence for its overall credit quality in its portfolio. The higher provision is due to a few factors. First, higher Canadian consumer losses realized are due almost entirely to the implementation issues with a new consumer collections platform. Second, it took a single large loss from its Canadian commercial portfolio. And third, its performing loans (PCL) increased due to a modestly softer economic outlook.",
    "To improve its performance for the rest of the year, Bank of Montreal will look for efficiencies. As it works to lower its efficiency ratio down and delivering it through operating leverage, it aims to reach an efficiency target of 58% by 2021.",
    "In the fourth quarter, the bank is on track to deliver positive operating leverage. Expense growth will slow by half the rate of the first half of the year.",
    "JPMorgan Chase (NYSE: JPM ) reported quarterly results on July 16, which sent JPM stock to a YTD high of around $116. But the stock fell slightly and closed recently at $109.22. Shares are valued at 11.12 times earnings and have a dividend yield of 3.3%.",
    "On Aug. 14, when the yield curve first inverted (the 10-year Treasury yield fell below the two-year Treasury rate), bank stocks sold off. Yet economic expectations are still strong and should limit any drop in JPM stock.",
    "In Q2 19, JPMorgan reported net income of $9.7 billion and EPS of $2.82. While total loans rose 2%, home lending average loans fell 7% YoY. Average deposits rose 4% YoY. The bank ended the quarter with a Standardized CET1 ratio of 12.2%. In the quarter, JPMorgan delivered strong capital returns by distributing $7.5 billion to shareholders. This includes a $5 billion stock buyback.",
    "JPMorgan's Consumer and Community Banking delivered $4.2 billion in net income, up 22% from last year. Higher net interest income and higher auto lease volumes drove these strong results. The strong credit performance across businesses and another quarter of positive operating leverage should continue for the rest of the year. The credit business benefits from credit costs of $1.1 billion, down 5% YoY. Charge-off rates of 8 basis points were favorable in the quarter and will continue to be so. Strong card loan growth and a good mortgage business suggest steady performance for the next few quarters.",
    "Banco Santander (NYSE: SAN ) looked as though it would hold the $4.60 - $5 range earlier this year. That range broke down when the stock fell last month and in August. SAN stock closed at $3.78 and has a P/E of 7.89X. Its dividend yield is 6.88%.",
    "In the second quarter, Santander reported strong sequential volume growth in loans (up 2%) and consumer funds (up 3%). Profits grew by 8%. Its loyal and digital customer base grew at an impressive double-digit growth. In Q2, profits of EUR 1.391 billion was affected by a EUR 706 million charge, mostly due to restructuring costs. For H1/2019, its underlying profit topped EUR 4,045 billion ($4.469 billion).",
    "Santander has a healthy profitability and solvency profile. CET1 was 11.3%, down 49 bps YTD due to regulatory effects and restructuring costs. With an enormous customer base and steady growth over the last year, Santander is one of the worst-performing financial stocks. Management is aware of the difficulty with growing revenue in mature markets. More competitors are coming to the market, so price reductions hurt profit growth. Still, it continues to increase its strategy of earning customer loyalty. And as it cuts costs by at least EUR 1 billion in Europe, profitability will grow.",
    "Banco Santander has a healthy balance sheet and continues to build its capital ratio. With lower costs and profit growth ahead, Santander stock should eventually find a bottom.",
    "Bank of America (NYSE: BAC ) showed a \"double top\" at $31 between May and the end of July on the charts. And for the rest of August, the stock slumped, bottoming in the $26 range and closing recently at $27.33. The stock has a P/E of 9.73X and a dividend yield of 2.63%. This U.S. bank is relatively cheaper compared to its peers.",
    "BAC reported earnings on July 17: GAAP EPS of 74 cents and revenue of $23.1 billion. Revenue grew 2%, but it is the return metrics that should impress investors. Return on average assets rose to 1.23%, up from 1.17% last year. The return on average common shareholders' equity topped 11.6%, up from 10.8%. Bank of America grew loans and leases by 4%. Average deposits increased $75 billion, up 6% YoY. Since Q2 18, client flows increased by $24 billion.",
    "BAC reported a CET1 of $171 billion and a CET1 ratio of 11.7%. To signal confidence in its business growth ahead, it raised its dividend by 20%. And when the book value per share rose 10% to $26.41, investors are clearly paying a very small premium for the business.",
    "The market is overlooking the consistent performance of this bank. It delivered positive operating leverage for 18 consecutive quarters. So, growing consumer banking digital usage, increasing average deposits and higher loans and leases will lead to continued profit growth.",
    "Wells Fargo (NYSE: WFC ) is still in the dog house, years after it signed customers up for unwanted auto insurance and opening of accounts in customers' names. The stock is stuck in the $45 - $50 range, closing at $46.19 recently. At a P/E of 9.8X and with a dividend yielding 4.49%, investors may wait for the company to continue repairing its reputation. As it wins back customers, growth will come.",
    "Wells Fargo reported Q2 2019 net income of $6.2 billion and diluted EPS of $1.30. Its return of average tangible common equity (ROTCE) was 15.78%. Customer sentiment improved when a branch survey indicated the highest level of customer loyalty and \"overall satisfaction with the most recent visit\" in over three years. Loans and deposits grew from last year, debit and credit cards rose and credit card usage increased. The company returned $6.1 billion to shareholders through stock buybacks and stock dividends. And with its dividend at 45 cents a share, this is up 15% from last year.",
    "Wells Fargo expects that despite the Fed funds rate falling, consumer deposits will increase. Since deposits are very inexpensive to operate, it expects healthy benefits from higher deposits. It also has a promotional activity plan ready to attract deposits. Costs are always something the bank may work on lowering. As it prioritizes expense control without compromising risk controls, performance should improve.",
    "As of this writing, Chris Lau owned shares of Banco Santander.",
    "The post 7 of the Best Financial Stocks to Buy Now appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:52:38"
}