{
  "url": "https://www.nasdaq.com/article/should-first-trust-mid-cap-growth-alphadex-fund-fny-be-on-your-investing-radar-cm1207321",
  "title": "Should First Trust Mid Cap Growth AlphaDEX Fund (FNY) Be on Your Investing Radar? - Nasdaq.com",
  "text": [
    " The First Trust Mid Cap Growth AlphaDEX Fund (FNY) was launched on 04/19/2011, and is a passively managed exchange traded fund designed to offer broad exposure to the Mid Cap Growth segment of the US equity market. The fund is sponsored by First Trust Advisors. It has amassed assets over $294.06 M, making it one of the smaller ETFs attempting to match the Mid Cap Growth segment of the US equity market.  Why Mid Cap Growth  With market capitalization between $2 billion and $10 billion, mid cap companies usually contain higher growth prospects than large cap companies, and are considered less risky than their small cap counterparts. These types of companies, then, have a good balance of stability and growth potential. While growth stocks do boast higher than average sales and earnings growth rates, and they are expected to grow faster than the wider market, investors should note these kinds of stocks have higher valuations. Also, growth stocks are a type of equity that carries more risk compared to others. Compared to value stocks, growth stocks are a safer bet in a strong bull market, but don't perform as strongly in almost all other financial environments.  Costs  Expense ratios are an important factor in the return of an ETF and in the long term, cheaper funds can significantly outperform their more expensive counterparts, other things remaining the same. Annual operating expenses for this ETF are 0.70%, making it the most expensive products in the space. It has a 12-month trailing dividend yield of 0.05%.  Sector Exposure and Top Holdings  ETFs offer a diversified exposure and thus minimize single stock risk but it is still important to delve into a fund's holdings before investing. Most ETFs are very transparent products and many disclose their holdings on a daily basis. This ETF has heaviest allocation to the Information Technology sector--about 25.60% of the portfolio. Industrials and Healthcare round out the top three. Looking at individual holdings, Roku, Inc. (ROKU) accounts for about 1.21% of total assets, followed by Novocure Limited (NVCR) and Alteryx, Inc. (class A) (AYX). The top 10 holdings account for about 9.55% of total assets under management.  Performance and Risk  FNY seeks to match the performance of the Nasdaq AlphaDEX Mid Cap Growth Index before fees and expenses. The NASDAQ AlphaDEX Mid Cap Growth Index is an enhanced which employs the AlphaDEX stock selection methodology to select stocks from the NASDAQ US 600 Mid Cap Growth Index. The ETF return is roughly 24.90% so far this year and is down about -3.45% in the last one year (as of 09/04/2019). In the past 52-week period, it has traded between $33.42 and $47.28. The ETF has a beta of 1.10 and standard deviation of 16.87% for the trailing three-year period, making it a medium risk choice in the space. With about 225 holdings, it effectively diversifies company-specific risk.  Alternatives  First Trust Mid Cap Growth AlphaDEX Fund holds a Zacks ETF Rank of 1 (Strong Buy), which is based on expected asset class return, expense ratio, and momentum, among other factors. Because of this, FNY is an outstanding option for investors seeking exposure to the Style Box - Mid Cap Growth segment of the market. There are other additional ETFs in the space that investors could consider as well. The iShares S&P Mid-Cap 400 Growth ETF (IJK) and the iShares Russell Mid-Cap Growth ETF (IWP) track a similar index. While iShares S&P Mid-Cap 400 Growth ETF has $7.29 B in assets, iShares Russell Mid-Cap Growth ETF has $10.89 B. IJK has an expense ratio of 0.24% and IWP charges 0.24%.  Bottom-Line  An increasingly popular option among retail and institutional investors, passively managed ETFs offer low costs, transparency, flexibility, and tax efficiency; they are also excellent vehicles for long term investors. To learn more about this product and other ETFs, screen for products that match your investment objectives and read articles on latest developments in the ETF investing universe, please visit Zacks ETF Center  .   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  First Trust Mid Cap Growth AlphaDEX Fund (FNY): ETF Research Reports   iShares Russell Mid-Cap Growth ETF (IWP): ETF Research Reports   NovoCure Limited (NVCR): Free Stock Analysis Report   Alteryx, Inc. (AYX): Free Stock Analysis Report   Roku, Inc. (ROKU): Free Stock Analysis Report   iShares S&P Mid-Cap 400 Growth ETF (IJK): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "The First Trust Mid Cap Growth AlphaDEX Fund (FNY) was launched on 04/19/2011, and is a passively managed exchange traded fund designed to offer broad exposure to the Mid Cap Growth segment of the US equity market.",
    "The fund is sponsored by First Trust Advisors. It has amassed assets over $294.06 M, making it one of the smaller ETFs attempting to match the Mid Cap Growth segment of the US equity market.",
    " Why Mid Cap Growth ",
    "With market capitalization between $2 billion and $10 billion, mid cap companies usually contain higher growth prospects than large cap companies, and are considered less risky than their small cap counterparts. These types of companies, then, have a good balance of stability and growth potential.",
    "While growth stocks do boast higher than average sales and earnings growth rates, and they are expected to grow faster than the wider market, investors should note these kinds of stocks have higher valuations. Also, growth stocks are a type of equity that carries more risk compared to others. Compared to value stocks, growth stocks are a safer bet in a strong bull market, but don't perform as strongly in almost all other financial environments.",
    " Costs ",
    "Expense ratios are an important factor in the return of an ETF and in the long term, cheaper funds can significantly outperform their more expensive counterparts, other things remaining the same.",
    "Annual operating expenses for this ETF are 0.70%, making it the most expensive products in the space.",
    "It has a 12-month trailing dividend yield of 0.05%.",
    " Sector Exposure and Top Holdings ",
    "ETFs offer a diversified exposure and thus minimize single stock risk but it is still important to delve into a fund's holdings before investing. Most ETFs are very transparent products and many disclose their holdings on a daily basis.",
    "This ETF has heaviest allocation to the Information Technology sector--about 25.60% of the portfolio. Industrials and Healthcare round out the top three.",
    "Looking at individual holdings, Roku, Inc. (ROKU) accounts for about 1.21% of total assets, followed by Novocure Limited (NVCR) and Alteryx, Inc. (class A) (AYX).",
    "The top 10 holdings account for about 9.55% of total assets under management.",
    " Performance and Risk ",
    "FNY seeks to match the performance of the Nasdaq AlphaDEX Mid Cap Growth Index before fees and expenses. The NASDAQ AlphaDEX Mid Cap Growth Index is an enhanced which employs the AlphaDEX stock selection methodology to select stocks from the NASDAQ US 600 Mid Cap Growth Index.",
    "The ETF return is roughly 24.90% so far this year and is down about -3.45% in the last one year (as of 09/04/2019). In the past 52-week period, it has traded between $33.42 and $47.28.",
    "The ETF has a beta of 1.10 and standard deviation of 16.87% for the trailing three-year period, making it a medium risk choice in the space. With about 225 holdings, it effectively diversifies company-specific risk.",
    " Alternatives ",
    "First Trust Mid Cap Growth AlphaDEX Fund holds a Zacks ETF Rank of 1 (Strong Buy), which is based on expected asset class return, expense ratio, and momentum, among other factors. Because of this, FNY is an outstanding option for investors seeking exposure to the Style Box - Mid Cap Growth segment of the market. There are other additional ETFs in the space that investors could consider as well.",
    "The iShares S&P Mid-Cap 400 Growth ETF (IJK) and the iShares Russell Mid-Cap Growth ETF (IWP) track a similar index. While iShares S&P Mid-Cap 400 Growth ETF has $7.29 B in assets, iShares Russell Mid-Cap Growth ETF has $10.89 B. IJK has an expense ratio of 0.24% and IWP charges 0.24%.",
    " Bottom-Line ",
    "An increasingly popular option among retail and institutional investors, passively managed ETFs offer low costs, transparency, flexibility, and tax efficiency; they are also excellent vehicles for long term investors.",
    "To learn more about this product and other ETFs, screen for products that match your investment objectives and read articles on latest developments in the ETF investing universe, please visit Zacks ETF Center  .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:44:00"
}