{
  "url": "https://www.nasdaq.com/article/why-cleveland-cliffs-lost-steam-after-a-revenue-growth-of-50-over-the-previous-2-years-cm1207673",
  "title": "Why Cleveland-Cliffs Lost Steam After A Revenue Growth Of 50% Over The Previous 2 Years - Nasdaq.com",
  "text": [
    " Cleveland-Cliffs  ( CLF  ) has added close to $0.78 billion in revenue between 2016 and 2018, which has led to total revenues increasing from $1.55 billion in 2016 to $2.33 billion in 2018. This rise was mainly driven by an increase in iron ore volume sold and premium pricing for its high-grade ores. Though freight revenue decreased in 2018, strong iron ore sales have driven healthy revenue growth. However, despite high iron ore prices, the company is not expected to replicate this performance in the near future, with Trefis expecting CLF to only add about $0.04 billion over the next two years, mainly driven by a decrease in shipments and loss of revenue from the sale of the Asia-Pacific operations.",
    "You can view the Trefis interactive dashboard -  Cleveland-Cliffs' Revenues: How Does CLF Make   Money?   - to better understand the company's historical and projected revenue performance, and alter the assumptions to arrive at your own revenue estimates for the company. In addition, here is more  Materials data   .",
    "Before looking at the Iron Ore Revenues of the company, let us understand CLF's business-",
    " (a) What Does CLF Offer? ",
    " (b) Who is Paying? ",
    " (c) What Are The Alternatives? ",
    " Iron Ore Shipments ",
    " Iron Ore Price Realization ",
    " Conclusion ",
    "Despite CLF being set to lose its steam in the near term, based on Cleveland-Cliffs Valuation  by Trefis, we have a price estimate of $13 per share for CLF's stock. We believe that premium pricing for the company's high-grade ore, expansion of production capacity from 1.6 million metric tons to 1.9 million metric tons at the new HBI (hot-briquetted iron) plant in Great Lakes, and upgradation of its Northshore plant to replace up to 3.5 million long tons of blast furnace pellet production with DR-grade (Direct Reduction grade iron, which is a high quality metallic product, ~90% pure iron)  pellet production, is expected to lead to higher production and revenue from late-2020, which would, in turn, support growth in the stock price going forward.",
    "What's behind Trefis? See How it's Powering New Collaboration and What-Ifs",
    "For CFOs and Finance Teams   | Product, R&D, and Marketing Teams ",
    " All Trefis Data ",
    "Like our charts? Explore example interactive dashboards   and create your own.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 01:21:29"
}