{
  "url": "https://www.nasdaq.com/article/waymo-eyes-deploying-selfdriving-technology-in-trucking-ceo-krafcik-20190912-00134",
  "title": "Waymo eyes deploying self-driving technology in trucking -CEO Krafcik - Nasdaq.com",
  "text": [
    "FRANKFURT, Sept 12 (Reuters) - Waymo is exploring deploying its self-driving technology in the trucking industry, CEO John Krafcik said on Thursday, as it works with industry partners to seize a commercial opportunity from a looming shortage of human drivers.",
    "Waymo, backed by Alphabet Inc'sGoogle, has so far focused on so-called robotaxis but, in remarks prepared for a speech to the Frankfurt motor show, Krafcik said the self-driving technology, Waymo Driver, was also suited to steering road freight.",
    "\"Ride-hailing is an important application of our Driver,\" Krafcik told political and industry leaders, including German Chancellor Angela Merkel, at the event's official opening.",
    "\"We've already conducted road tests of the Waymo Driver in Class 8 trucks across the U.S., and we're working closely with the ecosystem — shippers, truck makers, and Tier One suppliers — to ensure a successful deployment.\"",
    "Industry experts and analysts forecast a severe shortage of truck drivers in ageing societies, including Germany, leading mobility players including Uber  to develop applications that aim to boost the sector's efficiency.",
    "Ten-year-old Waymo is widely viewed as the leader of the self-driving race, but attaining the holy grail of full and safe automation remains challenging as companies in the field seek to recoup their research and development costs.",
    "\"Our journey has been a long one, but there is still a long road ahead. For sure, we've learned a few key things over these past 10 years,\" said Krafcik.",
    "He added that it was crucial to achieve scale and robustness, and also to work with partners to win acceptance for a new definition of mobility."
  ],
  "published_datetime": "2019-09-12 04:47:00"
}