{
  "url": "https://www.nasdaq.com/article/syrian-rebels-say-russianbacked-forces-prepare-to-resume-offensive-20190911-00872",
  "title": "Syrian rebels say Russian-backed forces prepare to resume offensive - Nasdaq.com",
  "text": [
    "By Suleiman Al-Khalidi",
    "BEIRUT, Sept 11 (Reuters) - Syrian rebel fighters on Wednesday said Russian-backed forces were amassing troops in preparation for resuming a five-month offensive in northwest Syria after a second day of raids by jets believed to be Russian threatened to end a fragile ceasefire.",
    "The jets that flew overnight at high altitudes struck a village near Kafr Takhareem and an area near the town of Darkoush, both in rural areas in western Idlib province, two opposition sources and a resident in the area said.",
    "Russia said the Syrian government unilaterally agreed to a truce on Aug. 31 in opposition-controlled Idlib, where a \"de-escalation zone\" was brokered two years ago between Russia and Turkey. ",
    "Since then, there has been an end to the intense air strikes by Russian and Syrian warplanes that since late April had accompanied the Russian-backed ground offensive to retake the last rebel bastion.",
    "The Syrian army, aided by Iran-backed militias, also pounded several towns in southern Idlib, including Kafr Sejnah and Hazareen, in what the opposition says has been a persistent pattern of shelling of rebel-held areas despite the truce deal.",
    "\"Artillery shelling that has targeted villages of southern Idlib has not stopped since the alleged ceasefire,\" Mohammad Rashid, spokesman for the Jaish al-Nasr rebel group said.",
    "The rebel official said jets believed to be Russian also hit for the second time a commanding height known as Kabaneh in the mountainous province of Latakia where rebels have for months withstood intense aerial bombing, after a similar raid on Tuesday.",
    "RUSSIAN TROOPS AMASSING",
    "Rebels say that the Russian-led alliance that brings together elite army units and Iranian-backed militias were using the lull in fighting to reorganize their forces.",
    "A week before the ceasefire, Moscow and its allies captured the strategic town of Khan Sheihkoun in the most significant advance against rebels since the start of the military offensive.",
    "The opposition say new reinforcements from Russian special forces, Iranian-backed militias and elite Syrian army units were arriving daily and amassing in front lines in southern Idlib.",
    "Several attempts by small crack units of Russian forces and Kremlin-linked private military contractors had been repelled in the last week, rebels say.",
    "\"The amassing of Iranian militias and Russian ground troops are all signals that something is being prepared for a new offensive,\" Major Youssef Hamoud, a spokesman of Turkey-backed National Army, a coalition of mainstream rebel factions.",
    "Russian Foreign Minister Sergei Lavrov said in August Russian forces were fighting on the ground in Idlib to defeat militant Islamist groups whom Moscow and its Syrian ally blame for violating the de-escalation arrangement reached with Ankara.",
    "The deployment of Russian special forces and Iranian-backed forces succeeded in breaking months of stalemate on the front lines, where rebels had until then been holding back the army from major advances, Western intelligence sources say.",
    "The capture of Khan Sheikhoun brought Moscow closer to regaining control over two of Syria's most important pre-war highways from Aleppo to Hama and Latakia, on the Mediterranean coast.",
    "\"The goals that Russia has set has still not been achieved, which is taking the highways and trying to restore the regime's pre-war commercial arteries,\" Hamoud said.",
    "The northwest offensive, in which non-governmental organizations and rights groups have accused the Russian-led alliance of using \"scorched earth\" bombing tactics, has prompted warnings by the United Nations and aid agencies of a new humanitarian crisis.",
    "Hundreds of civilians have been killed while over a half a million people have been uprooted from villages and towns that now lay in ruins and sought shelter at the border with Turkey."
  ],
  "published_datetime": "2019-09-11 06:29:00"
}