{
  "url": "https://www.nasdaq.com/article/jjs-stelara-gets-approval-in-eu-for-ulcerative-colitis-cm1207963",
  "title": "J&J's Stelara Gets Approval in EU for Ulcerative Colitis - Nasdaq.com",
  "text": [
    "  Johnson & Johnson JNJ  announced that the European Commission (EC) has approved the label expansion of Stelara (ustekinumab) for the treatment of adults with moderately-to-severely active ulcerative colitis (UC). With the latest approval in EU, Stelara can now be prescribed to treat UC patients who have had an inadequate response to or were intolerant to either conventional therapy or a biologic or have medical contraindications to such therapies. Stelara is also under review in the United States for the same indication. Notably, Stelara, presently, has the approval to treat plaque psoriasis, psoriatic arthritis, and  moderate-to-severe Crohn's disease in both the United States and EU.  The EC's approval for UC is based on data from the pivotal phase III UNIFI study. The study was divided into an initial Induction study (UNIFI-I) of at least eight weeks, followed by a Maintenance study (UNIFI-M) of 44 weeks. Both studies demonstrated ustekinumab's efficacy as a treatment for UC. Ulcerative colitis or UC is a complicated immune disease in which patients suffer from persistent diarrhea, abdominal pain, blood in stool, loss of appetite, weight loss and fatigue. More than half of UC patients fail to achieve remission with the currently-available conventional or biologic therapies. The successful induction data from the UNIFI study highlights the potential of Stelara for them. The stock has rallied 2%, so far this year, compared with the 3.3% increase recorded by the  industry  .    Sales of Stelara, one of the key drugs of J&J, grew 23.3% in the first half of 2019. The drug has been gaining market share, particularly owing to the uptick in Crohn's disease, the approval for the treatment of which was received both in the United States and the EU in 2016. Other marketed UC treatments include Pfizer's PFE  JAK inhibitor, Xeljanz, and AbbVie's ABBV  Humira. Another company, Lilly  LLY  , is developing mirikizumab which is in late stage studies for the treatment of UC. J&J currently carries a Zacks Rank #3 (Hold). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .     Johnson & Johnson Price          Johnson & Johnson price    |   Johnson & Johnson Quote     It's Illegal in 42 States, But Investors Will Make     Billions Legally  In addition to the companies you read about above, today you   get details on the newly-legalized industry that's tapping into a   \"habit\" that Americans spend an estimated $150 billion on every   year. That's twice as much as they spend on marijuana, legally or   otherwise. Zacks special report revealing how investors can   profit from this new opportunity. As more states legalize this   activity, the industry could expand by as much as 15X. Zacks' has   just released a Special Report revealing 5 top stocks to watch in   this space.    See these 5 \"sin stocks\" now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Pfizer Inc. (PFE): Free Stock Analysis Report   AbbVie Inc. (ABBV): Free Stock Analysis Report   Eli Lilly and Company (LLY): Free Stock Analysis Report   Johnson & Johnson (JNJ): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " Johnson & Johnson JNJ  announced that the European Commission (EC) has approved the label expansion of Stelara (ustekinumab) for the treatment of adults with moderately-to-severely active ulcerative colitis (UC). With the latest approval in EU, Stelara can now be prescribed to treat UC patients who have had an inadequate response to or were intolerant to either conventional therapy or a biologic or have medical contraindications to such therapies.",
    "Stelara is also under review in the United States for the same indication.",
    "Notably, Stelara, presently, has the approval to treat plaque psoriasis, psoriatic arthritis, and  moderate-to-severe Crohn's disease in both the United States and EU. ",
    "The EC's approval for UC is based on data from the pivotal phase III UNIFI study. The study was divided into an initial Induction study (UNIFI-I) of at least eight weeks, followed by a Maintenance study (UNIFI-M) of 44 weeks. Both studies demonstrated ustekinumab's efficacy as a treatment for UC.",
    "Ulcerative colitis or UC is a complicated immune disease in which patients suffer from persistent diarrhea, abdominal pain, blood in stool, loss of appetite, weight loss and fatigue. More than half of UC patients fail to achieve remission with the currently-available conventional or biologic therapies. The successful induction data from the UNIFI study highlights the potential of Stelara for them.",
    "The stock has rallied 2%, so far this year, compared with the 3.3% increase recorded by the  industry  .",
    "Sales of Stelara, one of the key drugs of J&J, grew 23.3% in the first half of 2019. The drug has been gaining market share, particularly owing to the uptick in Crohn's disease, the approval for the treatment of which was received both in the United States and the EU in 2016.",
    "Other marketed UC treatments include Pfizer's PFE  JAK inhibitor, Xeljanz, and AbbVie's ABBV  Humira. Another company, Lilly  LLY  , is developing mirikizumab which is in late stage studies for the treatment of UC.",
    "J&J currently carries a Zacks Rank #3 (Hold). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "  Johnson & Johnson Price          Johnson & Johnson price    |   Johnson & Johnson Quote     It's Illegal in 42 States, But Investors Will Make     Billions Legally  In addition to the companies you read about above, today you   get details on the newly-legalized industry that's tapping into a   \"habit\" that Americans spend an estimated $150 billion on every   year. That's twice as much as they spend on marijuana, legally or   otherwise. Zacks special report revealing how investors can   profit from this new opportunity. As more states legalize this   activity, the industry could expand by as much as 15X. Zacks' has   just released a Special Report revealing 5 top stocks to watch in   this space. ",
    " Johnson & Johnson Price ",
    " Johnson & Johnson price    |   Johnson & Johnson Quote ",
    " It's Illegal in 42 States, But Investors Will Make     Billions Legally ",
    "In addition to the companies you read about above, today you   get details on the newly-legalized industry that's tapping into a   \"habit\" that Americans spend an estimated $150 billion on every   year. That's twice as much as they spend on marijuana, legally or   otherwise. Zacks special report revealing how investors can   profit from this new opportunity. As more states legalize this   activity, the industry could expand by as much as 15X. Zacks' has   just released a Special Report revealing 5 top stocks to watch in   this space.",
    "  See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:18:00"
}