{
  "url": "https://www.nasdaq.com/article/whats-in-the-offing-for-guidewire-gwre-in-q4-earnings-cm1206620",
  "title": "What's in the Offing for Guidewire (GWRE) in Q4 Earnings? - Nasdaq.com",
  "text": [
    "  Guidewire Software, Inc.  GWRE  is scheduled to report fourth-quarter fiscal 2019 results on Sep 5. The company's earnings surpassed the Zacks Consensus Estimate in the trailing four quarters, the average being 72.6%.  Past-Quarter Performance  In the las t report  ed quarter, Guidewire delivered non-GAAP earnings of 18 cents per share, outpacing the Zacks Consensus Estimate of 8 cents. Notably, the bottom line also improved from the year-ago quarter's figure of 5 cents per share. The company reported revenues of $162.9 million, surging 15% from the year-ago quarter. The figure comfortably surpassed the Zacks Consensus Estimate of $155 million.  What to Expect in Q3?  For fourth-quarter 2019, revenues are expected to be in the range of $199-$207 million. Non-GAAP net income per share is projected to be between 47-53 cents. The Zacks Consensus Estimate for revenues is pegged at $205 million, indicating a decline of approximately 17.68% from the year-ago quarter. We note that the Zacks Consensus Estimate for earnings has remained unchanged in the past week. The Zacks Consensus Estimate for the quarter under review is pegged at 50 cents per share, suggesting a decline of 38.3% from the year-ago reported figure. Notably, Guidewire stock has returned 19.9% on a year-to-date basis, outperforming the industry  's rally of 12.2%.    Let's see how things are shaping up prior to this announcement.  Factors at Play  Guidewire is benefiting from adoption of its InsurancePlatform suite of products. In the quarter under review, notable insurance companies including Groupe Macif (MACIF), Edina, Natixis Assurances, Amica Mutual Insurance, to mention a few, implemented the company's subscription solutions. We believe that rapid adoption of Guidewire's solutions will aid the company in bolstering subscription revenues, consequently enabling it to expand total addressable market or TAM. Moreover, Guidewire's ClaimCenter solution is witnessing traction lately, which is expected to be reflected in the upcoming earnings release. We believe that growing influence of the company's cloud-based solutions will provide a boost to the company's subscription revenues in the to-be-reported quarter. Guidewire's partnership programs are an added positive. Notably, Guidewire's Partner Connect Program that has been implemented worldwide is benefiting customers in the property and casualty insurance industry. Moreover, Guidewire recently announced that Shift Technology, Larsen & Toubro Infotech (or LTI) and Alchemy Technology Services are joining the Guidewire PartnerConnect alliance program. An expanding partner base of PartnerConnect program is expected to bolster the adoption of Guidewire's offerings, in turn favoring the top line in the to-be-reported quarter. The company's initiatives to enhance offerings via product enhancements, inorganic strategies, and collaborations and partnership programs are enabling it to expand clientele. This is expected to impact the top line in quarter under review. Moreover, Guidewire's acquisition strategies aimed at strengthening InsurancePlatform, remain a key catalyst. The acquisition of ISCS (now called Insurance Now), FirstBest (now called Guidewire Underwriting Management) and EagleEye Analytics (now known as Guidewire Predictive Analytics) are not only bolstering revenue growth but also aiding it to expand clientele. Notably, the cross-selling of the product suites has increased customer base and revenue generation. Moreover, synergies from its latest Cyence buyout is expected to aid Guidewire in expanding clientele, which in turn will result in revenue growth in the upcoming quarterly results. However, increasing investments on product enhancements are likely to limit margin expansion at least in the near term.  What the Zacks Model Unveils  According to the Zacks model, a company with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) has a good chance of beating estimates if it also has a positive  Earnings ESP  . Sell-rated stocks (Zacks Rank #4 or 5) are best avoided. Guidewire Softwarehas a Zacks Rank #3 and an Earnings ESP of 0.00%. You can uncover the best stocks to buy or sell before they're reported with our  Earnings ESP Filter  .  Stocks to Consider  Here are some better-ranked stocks, which you may consider as our model shows that these have the right combination of elements to post an earnings beat in its upcoming release: General Mills, Inc. GIS  has an Earnings ESP of +0.37% and a Zacks Rank #2. You can see   the complete list of today's Zacks #1 Rank stocks   here   . The Cooper Companies, Inc. COO  has an Earnings ESP of +0.11% and a Zacks Rank #3. Dollar General Corporation DG  has an Earnings ESP of +0.37% and a Zacks Rank #3.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Guidewire Software, Inc. (GWRE): Free Stock Analysis Report   General Mills, Inc. (GIS): Free Stock Analysis Report   The Cooper Companies, Inc. (COO): Free Stock Analysis Report   Dollar General Corporation (DG): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Guidewire Software, Inc.  GWRE  is scheduled to report fourth-quarter fiscal 2019 results on Sep 5. The company's earnings surpassed the Zacks Consensus Estimate in the trailing four quarters, the average being 72.6%.",
    " Past-Quarter Performance ",
    "In the las t report  ed quarter, Guidewire delivered non-GAAP earnings of 18 cents per share, outpacing the Zacks Consensus Estimate of 8 cents. Notably, the bottom line also improved from the year-ago quarter's figure of 5 cents per share.",
    "The company reported revenues of $162.9 million, surging 15% from the year-ago quarter. The figure comfortably surpassed the Zacks Consensus Estimate of $155 million.",
    " What to Expect in Q3? ",
    "For fourth-quarter 2019, revenues are expected to be in the range of $199-$207 million. Non-GAAP net income per share is projected to be between 47-53 cents.",
    "The Zacks Consensus Estimate for revenues is pegged at $205 million, indicating a decline of approximately 17.68% from the year-ago quarter.",
    "We note that the Zacks Consensus Estimate for earnings has remained unchanged in the past week. The Zacks Consensus Estimate for the quarter under review is pegged at 50 cents per share, suggesting a decline of 38.3% from the year-ago reported figure.",
    "Notably, Guidewire stock has returned 19.9% on a year-to-date basis, outperforming the industry  's rally of 12.2%.",
    "Let's see how things are shaping up prior to this announcement.",
    " Factors at Play ",
    "Guidewire is benefiting from adoption of its InsurancePlatform suite of products. In the quarter under review, notable insurance companies including Groupe Macif (MACIF), Edina, Natixis Assurances, Amica Mutual Insurance, to mention a few, implemented the company's subscription solutions.",
    "We believe that rapid adoption of Guidewire's solutions will aid the company in bolstering subscription revenues, consequently enabling it to expand total addressable market or TAM.",
    "Moreover, Guidewire's ClaimCenter solution is witnessing traction lately, which is expected to be reflected in the upcoming earnings release. We believe that growing influence of the company's cloud-based solutions will provide a boost to the company's subscription revenues in the to-be-reported quarter.",
    "Guidewire's partnership programs are an added positive. Notably, Guidewire's Partner Connect Program that has been implemented worldwide is benefiting customers in the property and casualty insurance industry.",
    "Moreover, Guidewire recently announced that Shift Technology, Larsen & Toubro Infotech (or LTI) and Alchemy Technology Services are joining the Guidewire PartnerConnect alliance program.",
    "An expanding partner base of PartnerConnect program is expected to bolster the adoption of Guidewire's offerings, in turn favoring the top line in the to-be-reported quarter.",
    "The company's initiatives to enhance offerings via product enhancements, inorganic strategies, and collaborations and partnership programs are enabling it to expand clientele. This is expected to impact the top line in quarter under review.",
    "Moreover, Guidewire's acquisition strategies aimed at strengthening InsurancePlatform, remain a key catalyst. The acquisition of ISCS (now called Insurance Now), FirstBest (now called Guidewire Underwriting Management) and EagleEye Analytics (now known as Guidewire Predictive Analytics) are not only bolstering revenue growth but also aiding it to expand clientele.",
    "Notably, the cross-selling of the product suites has increased customer base and revenue generation. Moreover, synergies from its latest Cyence buyout is expected to aid Guidewire in expanding clientele, which in turn will result in revenue growth in the upcoming quarterly results.",
    "However, increasing investments on product enhancements are likely to limit margin expansion at least in the near term.",
    " What the Zacks Model Unveils ",
    "According to the Zacks model, a company with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) has a good chance of beating estimates if it also has a positive  Earnings ESP  . Sell-rated stocks (Zacks Rank #4 or 5) are best avoided.",
    "Guidewire Softwarehas a Zacks Rank #3 and an Earnings ESP of 0.00%. You can uncover the best stocks to buy or sell before they're reported with our  Earnings ESP Filter  .",
    " Stocks to Consider ",
    "Here are some better-ranked stocks, which you may consider as our model shows that these have the right combination of elements to post an earnings beat in its upcoming release:",
    "General Mills, Inc. GIS  has an Earnings ESP of +0.37% and a Zacks Rank #2. You can see   the complete list of today's Zacks #1 Rank stocks   here   .",
    "The Cooper Companies, Inc. COO  has an Earnings ESP of +0.11% and a Zacks Rank #3.",
    "Dollar General Corporation DG  has an Earnings ESP of +0.37% and a Zacks Rank #3.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:53:00"
}