{
  "url": "https://www.nasdaq.com/article/beijing-offers-development-fund-if-solomon-islands-breaks-ties-with-taiwan-20190905-00006",
  "title": "Beijing offers development fund if Solomon Islands breaks ties with Taiwan - Nasdaq.com",
  "text": [
    "By Jonathan Barrett",
    "SYDNEY, Sept 5 (Reuters) - China is offering to bankroll a development fund for the Solomon Islands in the South Pacific if it switches diplomatic ties from Taiwan to Beijing, a parliamentary committee in the small island nation has heard.",
    "The proposal, which would replace a similar structure set-up by Taiwan, comes amid a global push by Beijing to peel away the allies of what it considers a wayward province with no right to state-to-state ties. Only 17 countries now recognise Taiwan.",
    "John Moffat Fugui, a Solomons' parliamentarian and head of a taskforce charged with evaluating diplomatic ties, said on Wednesday that Beijing would pay into a fund even though it usually preferred \"grants, concessionary loans and sometimes gifts\".",
    "\"But for you, we will give you a [Rural Constituency Development Fund] for a certain period,\" Fugui said, referring to recent negotiations with Beijing officials.",
    "Fugui said the offer would help fill an immediate gap should the Solomons cut ties with Taiwan that date back to 1983.",
    "Taiwan has pledged $8.5 million to the Solomons in 2019-20 through a fund, budget documents show.",
    "The Solomons, an archipelago of just over 600,000 people, relies heavily on such payments due to its limited means of generating income, which is largely through timber exports.",
    "The South Pacific has been a diplomatic stronghold for Taiwan, where formal ties with six of the 16 island nations make up more than a third of its total alliances.",
    "A report by the Australia-based Lowy Institute think-tank last month said: \"Both Australia and the U.S. are concerned about whether Solomon Islands chooses to switch recognition from Taiwan to China\". It said \"a switch by any one (of the states that recognise Taiwan) may stimulate others\" to abandon Taipei.",
    "Fugui spoke positively about a potential switch in ties at a parliamentary committee in the capital of Honiara on Wednesday, although he said the taskforce had not yet completed its report.",
    "Separately, the government has convened a ministerial team that has been liaising directly with Beijing. ",
    "An observer at the meetings told Reuters that: \"The government is trying to make a relationship with China now; but to formalise it we need to wait for the report.\" The meeting was open to the public, but has not been broadcast.",
    "China's foreign ministry in Beijing did not immediately respond to questions.",
    "Joanne Ou, spokeswoman for Taiwan's foreign ministry, said: \"Relationship with Solomon Islands currently is stable, but we are closely monitoring and situation and development.\"",
    "Solomon Islands has been actively assessing its Taiwan alliance since a general election in April. ",
    "Anti-graft agency Transparency Solomon Islands has urged caution in changing ties over concerns Solomons will not be able to hold firm against Beijing's interests.",
    "\"It is not a secret that China is the most assertive donor nation offering funding and development assistance that exploit governance gaps in countries with weak or corrupt structures, and makes the gaps wider,\" Transparency Solomon Islands said in a statement last month.",
    "The number of nations recognising Taiwan has been dwindling, with El Salvador in Central America, Burkina Faso in West Africa and the Dominican Republic in the Caribbean, all switching to China last year."
  ],
  "published_datetime": "2019-09-05 12:29:00"
}