{
  "url": "https://www.nasdaq.com/article/australias-cba-issues-25-bln-subordinated-notes-amid-regulatory-capital-push-20190911-00913",
  "title": "Australia's CBA issues $2.5 bln subordinated notes amid regulatory capital push - Nasdaq.com",
  "text": [
    "Sept 12 (Reuters) - Australia's top lender Commonwealth Bank of Australia   on Thursday said it has issued $2.5 billion worth of subordinated notes amid a regulatory push to increase capital reserves.",
    "The financial regulator in July told lenders they needed to bolster capital to act as a buffer during a crisis, but the hike was less than originally proposed in a win for those who had argued the targets were too tough. ",
    "The Australian Prudential Regulation Authority (APRA) said banks were required to lift their total capital by 3 percentage points of risk-weighted assets by Jan. 1, 2024, instead of the 4-5 percentage points initially proposed.",
    "A number of banks have issued such bonds in recent months. National Australia Bank  raised $1.5 billion through subordinated notes - unsecured loans that rank below other, more senior loans or securities with respect to claims on assets or earnings.",
    "APRA last month said Australian banks only would be allowed to have 25% of their tier-one capital - core funds held to help absorb losses - exposed to international operations or related parties from January 2021, down from the current 50%. ",
    "Australia and New Zealand Banking Group , Australia's No.4 lender by market value, sources over a fifth of its profit from New Zealand, where it is the largest lender, benefiting from dividend distributions to the parent worth almost all of the unit's profits. ",
    "The Reserve Bank of New Zealand has proposed almost doubling its capital requirements for the country's largest banks within the next five years, affecting some of the Australian lenders which have big operations there. ",
    "($1 = 1.4548 Australian dollars)"
  ],
  "published_datetime": "2019-09-11 08:24:00"
}