{
  "url": "https://www.nasdaq.com/article/us-oil-and-gas-jobs-fall-as-shale-boom-cools-20190911-00924",
  "title": "U.S. oil and gas jobs fall as shale boom cools - Nasdaq.com",
  "text": [
    "By John Kemp",
    "LONDON, Sept 11 (Reuters) - U.S. oil and gas employment has started to fall as producers and service companies respond to the sharp decline in prices since the fourth quarter of 2018.",
    "The number of jobs in \"mining support activities\", a category that includes oil and gas drilling, as well as site preparation and well completion services, has been drifting gently lower since October 2018.",
    "Employment in the sub-category for \"oil and gas support activities\", mostly covering site work and completion services, had fallen by around 11,000 jobs or 4% between October and July.",
    "Oil and gas employment is trending lower as the industry adjusts to lower petroleum and natural gas prices and lower levels of activity (graphic).",
    "The number of rigs drilling for oil and gas has fallen by 185 or 17% since the end of last year, according to weekly rig counts from oilfield services company Baker Hughes.",
    "And the number of new oil and gas wells drilled across seven major shale plays monitored by U.S. Energy Information Administration (EIA) had declined by 14% in July from its peak in October.",
    "OUTPUT SLOWDOWN",
    "So far, the number of wells fractured and completed each month has held up, despite the drilling downturn, which has kept oil and gas production near record levels.",
    "But as the inventory of drilled but uncompleted wells falls, it is likely completions will also turn down in the second half of 2019 and into 2020.",
    "Fewer well completions should translate into decelerating growth in oil production, marking the end of the second frenzied U.S. shale oil boom.",
    "The first shale oil boom lasted from 2012 until the middle of 2014. The second boom began in late 2016 or early 2017 and lasted through 2018.",
    "Experience suggests it takes around 3-4 months for a fall in oil prices to translate into a lower rig count and around 9-12 months to turn into lower production.",
    "The downturn in oil prices since October 2018 should start to translate into much slower, or even negative, growth in oil production in the third or fourth quarter of 2019 and beyond into 2020.",
    "The Energy Information Administration's latest forecast has year-on-year growth in oil output slowing to around 5% by the end of 2020 from more than 20% in October 2018 (\"Short-Term Energy Outlook\", EIA, Sept. 10).",
    "First signs of this adjustment are already evident, with output flat between the end of 2018 and May 2019. Slower growth in U.S. shale output will be an essential part of the rebalancing in the global oil market.",
    "The adjustment is already well advanced and should continue to play out over the next 12 months — unless there is a global recession or OPEC tries to push prices higher prematurely."
  ],
  "published_datetime": "2019-09-11 09:00:00"
}