{
  "url": "https://www.nasdaq.com/article/investors-likely-to-sue-bofa-4-more-for-bond-price-rigging-cm1207959",
  "title": "Investors Likely to Sue BofA & 4 More for Bond Price Rigging - Nasdaq.com",
  "text": [
    " Bank of America Corporation BAC  , Deutsche Bank DB  , Goldman Sachs GS  , Morgan Stanley MS  and BNP Paribas SA BNPQY  may be sued by investors for trying to manipulate the prices on hundreds of billions of dollars of bonds issued by Fannie Mae and Freddie Mac between 2009 and 2016, per Reuters.  makeArticleAd();  Jed Rakoff, the U.S. District Judge in Manhattan, stated on Tuesday that investors are likely to pursue antitrust claims against these five banks for bond rigging.    Traders of these banks conspired to fix prices of newly issued bonds during the seven-year period, which caused investors to overpay.    Rakoff informed that chat room transcripts, which involved the traders of these banks, were \"direct evidence of a conspiracy to fix prices\".    In fact, Christopher Burke, a lawyer for the investors, plans to offer these transcripts as evidence.    Rakoff added, \"Here, we have the rare smoking gun. The chats unmistakably show traders, acting on behalf of those defendants, agreeing to fix prices at a specific level before bringing the bonds to the secondary market.\"    The suggested class action is led by Pennsylvania Treasurer Joe Torsella, a Birmingham, Alabama public pension fund, and electrical workers' retirement and health plans in Dorchester, MA.    The complaint mentioned that the bonds that were underwritten by the defendants during that period had a value of nearly $3.97 trillion, which accounted for 77.2% of Fannie Mae and Freddie Mac bonds.    Notably, Fannie Mae and Freddie Mac guarantee more than 50% of the mortgages in the United States.    None of the five banks have so far commented on the matter.    Apart from the above-mentioned banks, 11 other finance companies - including Barclays PLC, Citigroup C  , Credit Suisse Group AG, HSBC Holdings Plc, JPMorgan JPM  , UBS Group AG, Toronto-Dominion Bank, Societe Generale SA, Nomura Holdings Inc., First Horizon National Corporation and Cantor Fitzgerald - faced similar claims.    While the claims against these companies were dismissed by Rakoff, investors informed that they might amend the claims.    Of the five defendants mentioned, BNP Paribas currently carries a Zacks Rank #2 (Buy) while the other four carry a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .   It's Illegal in 42 States, But Investors Will Make Billions Legally    In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.    That's twice as much as they spend on marijuana, legally or otherwise.    Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.   See these 5 \"sin stocks\" now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   JPMorgan Chase & Co. (JPM): Free Stock Analysis Report   Citigroup Inc. (C): Free Stock Analysis Report   Bank of America Corporation (BAC): Free Stock Analysis Report   Deutsche Bank Aktiengesellschaft (DB): Free Stock Analysis Report   BNP Paribas SA (BNPQY): Free Stock Analysis Report   Morgan Stanley (MS): Free Stock Analysis Report   The Goldman Sachs Group, Inc. (GS): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Bank of America Corporation BAC  , Deutsche Bank DB  , Goldman Sachs GS  , Morgan Stanley MS  and BNP Paribas SA BNPQY  may be sued by investors for trying to manipulate the prices on hundreds of billions of dollars of bonds issued by Fannie Mae and Freddie Mac between 2009 and 2016, per Reuters.  makeArticleAd();  Jed Rakoff, the U.S. District Judge in Manhattan, stated on Tuesday that investors are likely to pursue antitrust claims against these five banks for bond rigging.    Traders of these banks conspired to fix prices of newly issued bonds during the seven-year period, which caused investors to overpay.    Rakoff informed that chat room transcripts, which involved the traders of these banks, were \"direct evidence of a conspiracy to fix prices\".    In fact, Christopher Burke, a lawyer for the investors, plans to offer these transcripts as evidence.    Rakoff added, \"Here, we have the rare smoking gun. The chats unmistakably show traders, acting on behalf of those defendants, agreeing to fix prices at a specific level before bringing the bonds to the secondary market.\"    The suggested class action is led by Pennsylvania Treasurer Joe Torsella, a Birmingham, Alabama public pension fund, and electrical workers' retirement and health plans in Dorchester, MA.    The complaint mentioned that the bonds that were underwritten by the defendants during that period had a value of nearly $3.97 trillion, which accounted for 77.2% of Fannie Mae and Freddie Mac bonds.    Notably, Fannie Mae and Freddie Mac guarantee more than 50% of the mortgages in the United States.    None of the five banks have so far commented on the matter.    Apart from the above-mentioned banks, 11 other finance companies - including Barclays PLC, Citigroup C  , Credit Suisse Group AG, HSBC Holdings Plc, JPMorgan JPM  , UBS Group AG, Toronto-Dominion Bank, Societe Generale SA, Nomura Holdings Inc., First Horizon National Corporation and Cantor Fitzgerald - faced similar claims.    While the claims against these companies were dismissed by Rakoff, investors informed that they might amend the claims.    Of the five defendants mentioned, BNP Paribas currently carries a Zacks Rank #2 (Buy) while the other four carry a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .   It's Illegal in 42 States, But Investors Will Make Billions Legally    In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.    That's twice as much as they spend on marijuana, legally or otherwise.    Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "  See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:21:00"
}