{
  "url": "https://www.nasdaq.com/article/cancer-biotech-springworks-therapeutics-sets-terms-for-125-million-ipo-cm1206603",
  "title": "Cancer biotech SpringWorks Therapeutics sets terms for $125 million IPO - Nasdaq.com",
  "text": [
    " SpringWorks Therapeutics, a clinical-stage biotech developing small molecule therapies for rare cancers, announced terms for its IPO on Tuesday.    The Stamford, CT-based company plans to raise $125 million by offering 7.4 million shares at a price range of $16 to $18. At the midpoint of the proposed range, SpringWorks Therapeutics would command a fully diluted market value of $725 million and an enterprise value of $427 million.    SpringWorks Therapeutics was founded in 2017 and plans to list on the Nasdaq under the symbol SWTX. J.P. Morgan, Goldman Sachs and Cowen are the joint bookrunners on the deal. It is expected to price on Thursday, September 12, 2019.   The article Cancer biotech SpringWorks Therapeutics sets terms for $125 million IPO  originally appeared on IPO investment manager Renaissance Capital's web site renaissancecapital.com.   Investment Disclosure:  The information and opinions expressed herein were prepared by Renaissance Capital's research analysts and do not constitute an offer to buy or sell any security. Renaissance Capital's Renaissance IPO ETF (symbol: IPO)  , Renaissance International ETF (symbol: IPOS)  , or separately managed institutional accounts may have investments in securities of companies mentioned.",
    "SpringWorks Therapeutics, a clinical-stage biotech developing small molecule therapies for rare cancers, announced terms for its IPO on Tuesday.    The Stamford, CT-based company plans to raise $125 million by offering 7.4 million shares at a price range of $16 to $18. At the midpoint of the proposed range, SpringWorks Therapeutics would command a fully diluted market value of $725 million and an enterprise value of $427 million.    SpringWorks Therapeutics was founded in 2017 and plans to list on the Nasdaq under the symbol SWTX. J.P. Morgan, Goldman Sachs and Cowen are the joint bookrunners on the deal. It is expected to price on Thursday, September 12, 2019. ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:43:00"
}