{
  "url": "https://www.nasdaq.com/article/confident-melrose-hikes-dividend-as-profit-rise-lifts-shares-20190905-00173",
  "title": "Confident Melrose hikes dividend as profit rise lifts shares - Nasdaq.com",
  "text": [
    "By Justin George Varghese",
    "Sept 5 (Reuters) - Melrose Industries Plc  flagged its confidence in meeting full-year forecasts on Friday as the turnaround specialist reported a better-than-expected first-half profit, despite weakness in its automotive business.",
    "Shares in Melrose, which focuses on turning around industrial companies and then finding new owners for them, were up by 7% after it also raised its interim dividend by 10%.",
    "JP Morgan analysts said the results would ease investor concerns on the ongoing downturn in the automotive sector.",
    "\"The strong results and unchanged forecasts, despite ongoing Automotive weakness, underlines that these might be the same GKN assets but they are now managed by Melrose, a significant difference and one that we continue to expect will generate material upside for shareholders from here,\" JP Morgan added.",
    "Investments have helped a number of its North American aerospace facilities become profitable again, Melrose said.",
    "However, Melrose warned that weakness would persist in the second half of the year in its automotive division.",
    "Organic sales at the automotive business, Melrose's biggest, dropped by 7% in the first half, while margins dipped 2 percentage points on a like-for-like basis.",
    "Automakers, major customers of GKN, are facing a host of challenges including declining diesel vehicle sales, stricter regulation, investment in electric vehicles and supply disruption due to the U.S.-China trade dispute.",
    "Melrose has responded with cost curbs.",
    "\"Prompt steps have been taken to control costs (at Automotive), which has included the recently announced closure of one of its German production facilities,\" the company said.",
    "GKN said earlier this week that it planned to cut 1,000 jobs over the next two years at its aerospace business worldwide, as part of a restructuring plan pre-dating the takeover by Melrose.",
    "Melrose said its operating profit rose to 539 million pounds ($661.73 million) in the six months ended June 30, beating analysts' expectation of 500 million pounds.",
    "Shares of the company gave up some initial gains to trade up 5.3% at 195.3 pence by 0801 GMT and were the biggest percentage gainer on the FTSE blue-chip index.",
    "Melrose declared an interim dividend of 1.7 pence-a-share, up from 1.55 pence a year earlier.",
    "($1 = 0.8145 pounds)"
  ],
  "published_datetime": "2019-09-05 05:19:00"
}