{
  "url": "https://www.nasdaq.com/article/energy-sector-update-for-09032019-bpcxoninessl-cm1206899",
  "title": "Energy Sector Update for 09/03/2019: BP,CXO,NINE,SSL - Nasdaq.com",
  "text": [
    "Top Energy Stocks",
    "XOM -0.07%",
    "CVX -1.54%",
    "COP -0.80%",
    "SLB -0.67%",
    "OXY -1.72%",
    "Energy stocks were lower Tuesday afternoon, with the NYSE Energy Sector Index falling almost 0.9% while shares of energy companies in the S&P 500 were down more than 0.7% as a group. West Texas Intermediate crude oil for October delivery settled $1.16 lower at $53.94 per barrel, paring its prior slide, while the global benchmark Brent crude November contract declined 29 cents to $58.37 per barrel. October natural gas futures rose 7 cents to $2.36 per 1 million BTU.",
    "Among energy stocks moving on news:",
    "(+) BP plc ( BP  ) was little changed in late Tuesday trading, rising less than 0.1% after the energy major, through its Standard Oil subsidiary, sold the drilling rights and 371 existing oil wells in the Rock Creek and Tanner oilfields in West Virginia to Viper Capital Partners. Financial details of the transaction were not disclosed.",
    "In other sector news:",
    "(-) Concho Resources ( CXO  ) dropped over 5% after the oil and gas producer said it was selling its assets on the New Mexico Shelf to an affiliate of Spur Energy Partners LLC for $925 million and using the net proceeds, plus available cash, to fund a new, $1.5 billion stock buyback program and to repay existing debt. The transaction is expected to close in November.",
    "(-) Nine Energy Service ( NINE  ) turned sharply lower, reversing a nearly 7% advance soon after Tuesday's opening bell that followed the oilfield-services company Tuesday announcing the sale of its Production Solutions segment to Brigade Energy Services LLC for around $17 million in cash, subject to working capital adjustments.",
    "(-) Sasol Ltd ( SSL  ) tumbled nearly 9% after UBS Tuesday lowered its investment recommendation for the oil and natural gas company to neutral from buy.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-03 15:31:13"
}