{
  "url": "https://www.nasdaq.com/article/validea-motley-fool-strategy-daily-upgrade-report-9122019-cm1210840",
  "title": "Validea Motley Fool Strategy Daily Upgrade Report - 9/12/2019 - Nasdaq.com",
  "text": [
    "The following are today's upgrades for Validea's Small-Cap Growth Investor  model based on the published strategy of Motley Fool  . This strategy looks for small cap growth stocks with solid fundamentals and strong price performance.",
    " MERIDIAN BANCORP INC (MARYLAND) ( EBSB  )  is a small-cap growth stock in the Regional Banks industry. The rating according to our strategy based on Motley Fool changed from 60% to 87% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    " Company Description:  Meridian Bancorp, Inc. is a bank holding company for East Boston Savings Bank (the Bank). The Bank is a stock savings bank. The Bank conducted its business from 31 locations, one mobile branch and three loan centers in the greater Boston metropolitan area as of December 31, 2016. The Bank offers a range of deposit and loan products to individuals and businesses located in its market, which consists of Suffolk, Middlesex and Essex Counties, Massachusetts. The Bank attracts deposits from the public and uses those funds to originate loans, which it holds for investment. The Bank's lending business also involves the purchase and sale of loan participation interests. The Bank also offers non-deposit financial products through a third-party network arrangement. It offers customers a range of non-deposit financial products, including mutual funds, annuities, stocks and bonds, which are offered and cleared by a third-party broker-dealer. It also offers customers long-term care insurance.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here ",
    " CHEMUNG FINANCIAL CORP. ( CHMG  )  is a small-cap value stock in the Regional Banks industry. The rating according to our strategy based on Motley Fool changed from 45% to 72% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    " Company Description:  Chemung Financial Corporation is a bank holding company. The Company, through its subsidiaries, Chemung Canal Trust Company (the Bank) and CFS Group, Inc. (CFS), provides a range of banking, financing, fiduciary and other financial services to its clients. The Company manages its operations through two segments: core banking and Wealth Management Group (WMG). The core banking segment receives deposits from the general public and uses such funds to originate consumer, commercial, commercial real estate and residential mortgage loans, mainly in its local markets and to invest in securities. The WMG services segment provides trust and investment advisory services to clients. The Company's financial services include demand, savings and time deposits, commercial, residential and consumer loans, interest rate swaps, letters of credit, wealth management services, employee benefit plans, insurance products, mutual funds and brokerage services.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here ",
    "Since its inception, Validea's strategy based on Motley Fool has returned 539.05% vs. 201.88% for the S&P 500. For more details on this strategy, click here ",
    " About Motley Fool  : Brothers David and Tom Gardner often wear funny hats in public appearances, but they're hardly fools -- at least not the kind whose advice you should readily dismiss. The Gardners are the founders of the popular Motley Fool web site, which offers frank and often irreverent commentary on investing, the stock market, and personal finance. The Gardners' \"Fool\" really is a multi-media endeavor, offering not only its web content but also several books written by the brothers, a weekly syndicated newspaper column, and subscription newsletter services.",
    " About Validea  : Validea is an  investment research  service that follows the published strategies of investment legends. Validea offers both stock analysis and model portfolios based on gurus who have outperformed the market over the long-term, including Warren Buffett, Benjamin Graham, Peter Lynch and Martin Zweig. For more information about Validea, click here ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 03:50:59"
}