{
  "url": "https://www.nasdaq.com/article/burger-king-to-roll-out-marfrig-veggie-burgers-nationwide-in-brazil-in-november-20190903-00827",
  "title": "Burger King to roll out Marfrig veggie burgers nationwide in Brazil in November - Nasdaq.com",
  "text": [
    "By Ana Mano",
    "SAO PAULO, Sept 3 (Reuters) - Burger King will launch a plant-based burger imitating meat called the \"Rebel Whopper\" in Brazil in November, the company said on Tuesday, amid an international rush for mass-market chains to cater to vegetarian and vegan diners.",
    "Burger King will sell the vegetarian burgers developed by meatpacker Marfrig Global Foods SA  for 29.90 reais ($7.26) in Brazil, representatives of the two companies said at a press briefing in Sao Paulo.",
    "The launch of plant-based products comes amid heightened consumer concerns over health, the environment and even animal welfare, forcing companies to adapt to consumers wanting to eat less meat.",
    "The trend has given rise to non-meat start-ups like Beyond Meat Inc  and Impossible Foods Inc in the United States, with Brazil-based traditional meat-packers like Marfrig and JBS SA  following suit.",
    "Burger King, owned by Brazilian-controlled 3G Capital via its majority stake in Restaurant Brands International , will launch the burger in Sao Paulo city on Sept. 10, expanding to Sao Paulo and Rio de Janeiro states in October, and elsewhere in November.",
    "The chain found in a survey that 69% of Brazilian consumers were likely to buy a plant-based burger if offered at Burger King, ranking first ahead of China with 41%, the company's Brazil CEO Iuri Miranda said.",
    "He estimated Brazil's fast food market is worth 400 billion reais ($97 billion).",
    "In the United States, Impossible Foods supplies the plant-based burgers sold in Burger King stores, while Marfrig will be the chain's exclusive supplier in Brazil.",
    "Executives at Burger King and Marfrig declined to comment on details or duration of that contract.",
    "Marfrig's chief executive for South America, Miguel Gularte, said the company is developing other plant-based products which may be sold in supermarkets, but they will not use the same recipes as the Burger King burgers.",
    "($1 = 4.1196 reais)"
  ],
  "published_datetime": "2019-09-03 10:06:00"
}