{
  "url": "https://www.nasdaq.com/article/is-zoetis-zts-stock-outpacing-its-medical-peers-this-year-cm1210447",
  "title": "Is Zoetis (ZTS) Stock Outpacing Its Medical Peers This Year? - Nasdaq.com",
  "text": [
    " Investors interested in Medical stocks should always be looking to find the best-performing companies in the group. Zoetis (ZTS) is a stock that can certainly grab the attention of many investors, but do its recent returns compare favorably to the sector as a whole? A quick glance at the company's year-to-date performance in comparison to the rest of the Medical sector should help us answer this question. Zoetis is a member of our Medical group, which includes 867 different companies and currently sits at #3 in the Zacks Sector Rank. The Zacks Sector Rank gauges the strength of our 16 individual sector groups by measuring the average Zacks Rank of the individual stocks within the groups. The Zacks Rank is a proven system that emphasizes earnings estimates and estimate revisions, highlighting a variety of stocks that are displaying the right characteristics to beat the market over the next one to three months. ZTS is currently sporting a Zacks Rank of #2 (Buy). Within the past quarter, the Zacks Consensus Estimate for ZTS's full-year earnings has moved 2.49% higher. This signals that analyst sentiment is improving and the stock's earnings outlook is more positive. Based on the most recent data, ZTS has returned 43.83% so far this year. Meanwhile, stocks in the Medical group have gained about 2.05% on average. This means that Zoetis is outperforming the sector as a whole this year. Breaking things down more, ZTS is a member of the Medical - Drugs industry, which includes 172 individual companies and currently sits at #73 in the Zacks Industry Rank. Stocks in this group have gained about 5.85% so far this year, so ZTS is performing better this group in terms of year-to-date returns. ZTS will likely be looking to continue its solid performance, so investors interested in Medical stocks should continue to pay close attention to the company.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Zoetis Inc. (ZTS): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors interested in Medical stocks should always be looking to find the best-performing companies in the group. Zoetis (ZTS) is a stock that can certainly grab the attention of many investors, but do its recent returns compare favorably to the sector as a whole? A quick glance at the company's year-to-date performance in comparison to the rest of the Medical sector should help us answer this question.",
    "Zoetis is a member of our Medical group, which includes 867 different companies and currently sits at #3 in the Zacks Sector Rank. The Zacks Sector Rank gauges the strength of our 16 individual sector groups by measuring the average Zacks Rank of the individual stocks within the groups.",
    "The Zacks Rank is a proven system that emphasizes earnings estimates and estimate revisions, highlighting a variety of stocks that are displaying the right characteristics to beat the market over the next one to three months. ZTS is currently sporting a Zacks Rank of #2 (Buy).",
    "Within the past quarter, the Zacks Consensus Estimate for ZTS's full-year earnings has moved 2.49% higher. This signals that analyst sentiment is improving and the stock's earnings outlook is more positive.",
    "Based on the most recent data, ZTS has returned 43.83% so far this year. Meanwhile, stocks in the Medical group have gained about 2.05% on average. This means that Zoetis is outperforming the sector as a whole this year.",
    "Breaking things down more, ZTS is a member of the Medical - Drugs industry, which includes 172 individual companies and currently sits at #73 in the Zacks Industry Rank. Stocks in this group have gained about 5.85% so far this year, so ZTS is performing better this group in terms of year-to-date returns.",
    "ZTS will likely be looking to continue its solid performance, so investors interested in Medical stocks should continue to pay close attention to the company.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:30:12"
}