{
  "url": "https://www.nasdaq.com/article/is-dynavax-technologies-a-buy-cm1210384",
  "title": "Is Dynavax Technologies a Buy? - Nasdaq.com",
  "text": [
    " What happened Shares of the   small-cap biotech Dynavax Technologies    (NASDAQ: DVAX) gained a stately 48% over the course of   August, according to data from   S&P Global Market Intelligence    . What event sparked this sizable uptick? On Aug. 7, the stock began churning higher in response to the   company's second-quarter earnings report. Even though Dynavax   reported a staggering $42.7 million net loss for the three-month   period, investors were apparently more concerned about the   current state of Heplisav-B's ongoing commercial launch.   Heplisav-B is a vaccine approved by the Food and Drug   Administration as a preventative treatment for hepatitis B. It is   also the company's only FDA-approved product.   Image source: Getty Images.makeArticleAd();  So what The biotech reported that the vaccine's sales came in at $8.3   million for the second quarter, representing a healthy 48%   increase relative to just the first quarter of 2019. Thus, it   appears that Heplisav-B's commercial launch is finally starting   to gain some much-needed momentum. That said, the vaccine's   sales are still rather modest in absolute terms, especially in   light of Wall Street's initial peak sales estimates ranging from   $600 million to $750 million prior to its launch less than two   years ago. Now what The good news is that Heplisav-B's sales should start to pick   up in a big way from here on out. Wall Street's current consensus   estimate suggests that the vaccine's sales could grow by as much   as 138% in 2020 over the company's own high-end projection for   2019. Before investors get too excited, though, there is the matter   of Dynavax's weakening financial condition because of these hefty   quarterly losses. While the company is attempting to rein in   spending to address this issue, Dynavax may need to continue to   tap the public markets on a fairly regular basis for perhaps the   next two years. That fact shouldn't necessarily deter investors   from owning this stock, but it is a risk factor that shouldn't be   brushed off, either.   10 stocks we like better than Dynavax     Technologies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Dynavax Technologies     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        George Budwell      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of the   small-cap biotech Dynavax Technologies    (NASDAQ: DVAX) gained a stately 48% over the course of   August, according to data from   S&P Global Market Intelligence    . What event sparked this sizable uptick?",
    "On Aug. 7, the stock began churning higher in response to the   company's second-quarter earnings report. Even though Dynavax   reported a staggering $42.7 million net loss for the three-month   period, investors were apparently more concerned about the   current state of Heplisav-B's ongoing commercial launch.   Heplisav-B is a vaccine approved by the Food and Drug   Administration as a preventative treatment for hepatitis B. It is   also the company's only FDA-approved product.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "The biotech reported that the vaccine's sales came in at $8.3   million for the second quarter, representing a healthy 48%   increase relative to just the first quarter of 2019. Thus, it   appears that Heplisav-B's commercial launch is finally starting   to gain some much-needed momentum. That said, the vaccine's   sales are still rather modest in absolute terms, especially in   light of Wall Street's initial peak sales estimates ranging from   $600 million to $750 million prior to its launch less than two   years ago.",
    "The good news is that Heplisav-B's sales should start to pick   up in a big way from here on out. Wall Street's current consensus   estimate suggests that the vaccine's sales could grow by as much   as 138% in 2020 over the company's own high-end projection for   2019.",
    "Before investors get too excited, though, there is the matter   of Dynavax's weakening financial condition because of these hefty   quarterly losses. While the company is attempting to rein in   spending to address this issue, Dynavax may need to continue to   tap the public markets on a fairly regular basis for perhaps the   next two years. That fact shouldn't necessarily deter investors   from owning this stock, but it is a risk factor that shouldn't be   brushed off, either.",
    "  10 stocks we like better than Dynavax     Technologies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Dynavax Technologies     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Dynavax     Technologies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Dynavax Technologies     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  George Budwell      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:19:00"
}