{
  "url": "https://www.nasdaq.com/article/renaissancere-holdings-ltd-rnr-ex-dividend-date-scheduled-for-september-12-2019-cm1210286",
  "title": "RenaissanceRe Holdings Ltd. (RNR) Ex-Dividend Date Scheduled for September 12, 2019 - Nasdaq.com",
  "text": [
    "RenaissanceRe Holdings Ltd. ( RNR  ) will begin trading ex-dividend on September 12, 2019. A cash dividend payment of $0.34 per share is scheduled to be paid on September 30, 2019. Shareholders who purchased RNR prior to the ex-dividend date are eligible for the cash dividend payment. This marks the 3rd quarter that RNR has paid the same dividend. At the current stock price of $188.58, the dividend yield is .72%.",
    "The previous trading day's last sale of RNR was $188.58, representing a -2.46% decrease from the 52 week high of $193.34 and a 59.44% increase over the 52 week low of $118.28.",
    "RNR is a part of the Finance sector, which includes companies such as Chubb Limited ( CB  ) and American International Group, Inc. ( AIG  ). RNR's current earnings per share, an indicator of a company's profitability, is $13.5. Zacks Investment Research reports RNR's forecasted earnings growth in 2019 as 59.08%, compared to an industry average of %.",
    "For more information on the declaration, record and payment dates, visit the RNR Dividend History  page. Our  Dividend Calendar  has the full list of stocks that have an ex-dividend today.",
    " Interested in gaining exposure to RNR through an Exchange Traded Fund [ETF]?   The following ETF(s) have RNR as a top-10 holding:  iShares Focused Value Factor ETF (   FOVL    ) iShares S&P Mid-Cap 400 Value ETF (   IJJ    ) SPDR S&P 400 Mid Cap Value ETF (based on S&P MidCap   400 Value (   MDYV    ) VictoryShares USAA MSCI USA Value Momentum ETF (   ULVM    ) First Trust Financials AlphaDEX (   FXO    ).  ",
    "The top-performing ETF of this group is FXO with an increase of 1.69% over the last 100 days. FOVL has the highest percent weighting of RNR at 3.34%.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:00:05"
}