{
  "url": "https://www.nasdaq.com/article/10-stocks-to-buy-to-ride-chinas-emerging-wealth-cm1206988",
  "title": "10 Stocks to Buy to Ride China’s Emerging Wealth - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "A recent statistic from GlobalData said that the affluent population in China, which includes both mass affluents and high-net-worth individuals, is expected to grow by 41% from 40.13 million to 56.67 million. Chinese stocks will benefit from this ongoing surge in the number of wealthy people in the country. ",
    "According to GlobalData, the \"mass affluent\" includes anyone with liquid assets between $50,000 and $1 million, while the \"high-net-worth individual\" is anyone with liquid assets of more than $1 million. China is home to the third-highest number of affluent people behind only the U.S. and Japan. ",
    " \"This growth will be driven by rising levels of urbanization, infrastructure expansion, and high investment inflows in the country. Going forward, the number of affluent Chinese individuals is forecast to grow at a similar rate, reflecting the country's positive economic growth,\" stated Shivani Gupta, Wealth Analyst at GlobalData. ",
    "So, which Chinese stocks will win between now and 2022? A likely place to start for stocks to buy are those companies focused on retail, both online and off. Not all of them will be based in China to benefit from the surge in the affluent population. ",
    "Here are what I believe to be the 10 stocks to buy to ride this trend.  ",
    "New Oriental Education (NYSE: EDU ) is the largest provider of private educational services in China. Those with the means to provide their children with additional schooling and tutoring are going to do so. EDU stock will benefit from this demand. ",
    "On July 23, New Oriental announced its fourth-quarter results. They were extremely healthy. On the top line, net revenue increased by 20.2% compared to last year to $842.9 million, with operating income up 36.0% to $77.0 million. In fiscal 2019, New Oriental saw sales increase 26.5% to $3.1 billion, with operating income rising 16.2% to $305.5 million. ",
    "During the fourth quarter, the company saw total student enrollments in academic subjects tutoring and test preparation courses increase by 33.9% to 2.8 million people, with the number of schools and learning centers increased by 152 to 1,233. ",
    "On Aug. 29, EDU stock hit a 52-week high of $112.49. Its stock is up 98.4% year to date.  New Oriental continues to be one of my favorite Chinese stocks.",
    " Source: Nopparat Khokthong / Shutterstock.com",
    "As Chinese stocks go, Alibaba (NYSE: BABA ) has the highest potential to do big things outside its domestic market. While the Chinese market is massive, it is the market share that it can capture outside of China that will dictate how big it becomes. ",
    "The e-commerce dynamo recently had a bit of a setback. It had planned to list its shares in Hong Kong by doing a secondary offering to raise a little cash and more importantly, bring its stock a little closer to home. Unfortunately, with all the protests going on over there, it decided to delay its Hong Kong listing until the fall or later. ",
    "As I wrote on Aug. 26, it's not a big deal because of the company's firing on all cylinders at the moment. Its e-commerce and cloud businesses had revenue growth of 40% and 66% year over year in the latest quarter. It finished the quarter with $30.7 billion in cash. ",
    "Alibaba stock is up 24% year to date. ",
    " Source: THINK A / Shutterstock.com",
    "For Nio's (NYSE: NIO ) sake, the affluent in China better be buying both its ES8 (7-seater) and ES6 (5-seater) over the next 12-24 months, because if they're not willing to fork over the dough for the tech-heavy SUV, it's unlikely that the middle class will be ready to spend the money. ",
    "Also, the Chinese government is winding down the EV and plug-in hybrid subsidies. By the end of 2020 , they should be gone. Adding to Nio's troubles, Tesla (NASDAQ: TSLA ) is expected to begin manufacturing the Model 3 in China by the end of 2019. Those Tesla's will come with lower prices due to the lack of a tariff on the vehicles. ",
    "I've been very tough on Nio in the past year because it loses more money than it generates in sales. That's not a sustainable business model. However, it's hard to deny that its vehicles are attractive.",
    "At less than $3, NIO stock is a good buy, but for aggressive investors only. ",
    " The one thing I know about the wealthy is that they love to travel.",
    "Carlyle Group (NASDAQ: CG ) Co-Chairman David Rubenstein recently had an interesting story to share with Ctrip.com (NASDAQ: CTRP ) CEO Jane Sun while speaking together at the 2019 Aspen Action Forum in Aspen, Colorado. ",
    "Rubenstein mentioned that he had invested in the Chinese travel service provider back in 2003 when it was valued at $100 million. Rubenstein sold his stock for a 450% profit.",
    "\"At the time, we thought how brilliant are we? The company is today worth USD $21 billion. I guess I sold too soon, right?\" Rubenstein told the Aspen audience. ",
    "\"I'm sure that the travel industry will continue to grow, and Ctrip's will capitalize on those opportunities,\" Sun said. \"And I hope we can live up to the expectations of promoting the global economy and global peace.\"",
    "Although geopolitical issues are affecting leisure and corporate travel in China at the moment, the long-term prognosis continues to be good as the affluent look to do more air travel than in the past. ",
    "China Life Insurance (NYSE: LFC ) is one of the largest life insurance companies in China. It has more than 285 million life insurance policies, annuities, and other financial contracts in place. It is also one of the country's largest asset managers due to its controlling stake in China Life Asset Management Co. Ltd. ",
    "The insurer reported its latest quarterly report on Aug. 22. Its net profit was 129% higher year over year to $5.3 billion. Its total premiums increased by 5% during the quarter and its stock is up 12.8% year to date through Aug. 28.",
    "In November, I suggested that LFC stock was one Chinese stock I thought was worth buying given it had lost 31% with one month left in 2018. Since then it's up 14%.",
    "68%-owned by the Chinese government, some investors might not feel all that comfortable about their investment. I'm not one of them. It is the Berkshire Hathaway (NYSE: BRK.A , NYSE: BRK.B ) of China.   ",
    " Source: Shutterstock",
    "As I mentioned in the section on Nio, the affluent are big car buyers.  Autohome (NYSE: ATHM ) provides consumers in China with the information and services required to successfully buy a car, including financing, insurance, used car sales, etc. ",
    "The company announced its second-quarter results Aug. 7 and they were very healthy. On the top line, Autohome's revenue increased by 23.5% to $323.2 million. On the bottom line, net income increased by 14.9% to $119.7 million. That's a very impressive net margin of 37%.   ",
    "\"In the second quarter, we maintained the solid growth momentum in our core business. Our new initiatives once again picked up steam and gained positive market recognition,\" stated CFO Jun Zou.",
    "On Aug. 18, Autohome held the world's first virtual reality auto show with more than 80 auto brands and over 2,400 dealers taking part. It plans to do more of this type of activity in the future to increase the exposure of the auto industry in China. ",
    "If Autohome keeps this up, you can be sure the profits will continue to roll in.  ",
    " If there's a Chinese stock that confuses me, it's got to be Noah Holdings (NYSE: NOAH ). The Shanghai-based wealth manager aims to service clients with a net worth of a least $140,000. I've recommended it on several occasions in the past because I felt the growing middle class in China, not to mention the affluent class, would provide it with plenty of business. ",
    "However, despite having more than $25 billion in assets under management and a growing online presence, its stock has lost half its value since reaching a $4 billion market cap in May 2018. ",
    "As the Financial Times recently reported , the company distributed products involving supply-chain financing from a third party to its clients that turned out to be fraudulent. ",
    "Noah reported Q2 2019 earnings on Aug. 28. In its conference call , NOAH openly dealt with the issue and feels the incident will eventually be in the rearview mirror. ",
    "Do your due diligence on Noah, but this latest issue won't change my opinion about the company. I still believe it's got an excellent opportunity to win over a big chunk of the Chinese wealth management business. ",
    " Source: Shutterstock",
    "If there's a company to benefit from the increase in affluent people in China, it would have to be LVMH (OTCMKTS: LVMUY ), whose Louis Vuitton bags, Tag Heuer watches, and Moet & Chandon champagne are fashionable in the country of 1.4 billion people. ",
    "In June, Vuitton Chief Executive Michael Burke said that Louis Vuitton is experiencing \"unheard of growth rates\" in China. The Chinese are buying more handbags and watches domestically than they are while traveling outside the country. ",
    "One of the advantages for LVMH is that the Chinese have lowered tariffs from European products to encourage consumers to buy in China instead of overseas, and then resell them once back on the mainland. ",
    "Regardless of what's happening with the U.S.-China trade war, LVMH CEO and founder Bernard Arnault continues to build a retail conglomerate like no other. ",
    "Arnault is currently the world's third-richest person with a net worth of $96.0 billion , $27.4 billion higher in 2019, vaulting him $16 billion ahead of Warren Buffett. China will continue to be good for both LVMH and Arnault. ",
    " I thought I would throw in a Canadian company that's doing well in China.  Manulife Financial (NYSE: MFC ) is primarily a life insurance company. It owns John Hancock in the U.S. and has a large wealth and asset management business.",
    "In the second quarter ended June 30, Manulife had C$1.45 billion in core earnings, C$471 million from its Asian business, which represents 32% of its overall earnings. By contrast, its Canadian insurance business accounts for 21% of its core earnings while the U.S. is responsible for 30% of its core earnings. Its global wealth and asset management business accounted for the remaining 17%. ",
    "CEO Roy Gori, who ran the company's Asian business before taking the top job, said about the second quarter:",
    "\"We delivered solid core earnings and net income of $1.5 billion in the quarter, with double-digit core earnings growth in Asia,\" Gori stated. \"We have also taken steps to further strengthen Manulife's long-term growth opportunity in Asia, including entering into an asset management joint venture agreement in India.\" ",
    "Although the company's Asian head office is in Hong Kong, it also has offices in Shanghai and Beijing. The company's first insurance policy in Asia was sold in Shanghai in 1897 . ",
    " Source: Shutterstock",
    "One of the quickest and easiest ways to benefit from the surge in affluent people in China is to buy an ETF like the iShares MSCI China ETF (NYSEARCA: MCHI ), which provides exposure to a portfolio of mid-sized and large-sized companies based in China. ",
    "The ETF tracks the performance of the MSCI China Index. It has a total of 462 holdings with a significant number of Chinese financial stocks that aren't listed in the U.S. Given wealthy people generally are in greater need of financial services, owning this ETF would help you ride the affluent trend. ",
    "It charges 0.58% annually, which is reasonable given that many of the stocks can't be bought on a U.S. exchange. ",
    "The ETFs top 10 holdings account for 48% of its $3.5 billion in total assets. The top three sectors: consumer cyclical, financial services, and technology, account for 67% of its total holdings. The average market cap is $67.3 billion.  ",
    "At the time of this writing Will Ashworth did not hold a position in any of the aforementioned securities.",
    "The post 10 Stocks to Buy to Ride China's Emerging Wealth appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:48:23"
}