{
  "url": "https://www.nasdaq.com/article/cyrusone-cone-is-an-incredible-growth-stock-3-reasons-why-cm1207244",
  "title": "CyrusOne (CONE) is an Incredible Growth Stock: 3 Reasons Why - Nasdaq.com",
  "text": [
    " Growth stocks are attractive to many investors, as above-average financial growth helps these stocks easily grab the market's attention and produce exceptional returns. However, it isn't easy to find a great growth stock. In addition to volatility, these stocks carry above-average risk by their very nature. Also, one could end up losing from a stock whose growth story is actually over or nearing its end. However, it's pretty easy to find cutting-edge growth stocks with the help of the Zacks Growth Style Score (part of the Zacks Style Scores  system), which looks beyond the traditional growth attributes to analyze a company's real growth prospects. Our proprietary system currently recommends CyrusOne (CONE) as one such stock. This company not only has a favorable Growth Score, but also carries a top Zacks Rank. Research shows that stocks carrying the best growth features consistently beat the market. And returns are even better for stocks that possess the combination of a Growth Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 (Buy). Here are three of the most important factors that make the stock of this data center operator a great growth pick right now.  Earnings Growth  Arguably nothing is more important than earnings growth, as surging profit levels is what most investors are after. And for growth investors, double-digi t earnings  growth is definitely preferable, and often an indication of strong prospects (and stock price gains) for the company under consideration. While the historical EPS growth rate for CyrusOne is 17.4%, investors should actually focus on the projected growth. The company's EPS is expected to grow 7.1% this year, crushing the industry average, which calls for EPS growth of 0.5%.  Cash Flow Growth  Cash is the lifeblood of any business, but higher-than-average cash flow growth is more beneficial and important for growth-oriented companies than for mature companies. That's because, high cash accumulation enables these companies to undertake new projects without raising expensive outside funds. Right now, year-over-year cash flow growth for CyrusOne is 88.9%, which is higher than many of its peers. In fact, the rate compares to the industry average of 13.2%. While investors should actually consider the current cash flow growth, it's worth taking a look at the historical rate too for putting the current reading into proper perspective. The company's annualized cash flow growth rate has been 30.4% over the past 3-5 years versus the industry average of 18.1%.  Promising Earnings Estimate Revisions  Superiority of a stock in terms of the metrics outlined above can be further validated by looking at the trend in earnings estimate revisions. A positive trend is of course favorable here. Empirical research shows that there is a strong correlation between trends in earnings estimate revisions and near-term stock price movements. There have been upward revisions in current-year earnings estimates for CyrusOne. The Zacks Consensus Estimate for the current year has surged 0.5% over the past month.  Bottom Line  CyrusOne has not only earned a Growth Score of B based on a number of factors, including the ones discussed above, but it also carries a Zacks Rank #2 because of the positive earnings estimate revisions. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  . This combination positions CyrusOne well for outperformance, so growth investors may want to bet on it.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  CyrusOne Inc (CONE): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Growth stocks are attractive to many investors, as above-average financial growth helps these stocks easily grab the market's attention and produce exceptional returns. However, it isn't easy to find a great growth stock.",
    "In addition to volatility, these stocks carry above-average risk by their very nature. Also, one could end up losing from a stock whose growth story is actually over or nearing its end.",
    "However, it's pretty easy to find cutting-edge growth stocks with the help of the Zacks Growth Style Score (part of the Zacks Style Scores  system), which looks beyond the traditional growth attributes to analyze a company's real growth prospects.",
    "Our proprietary system currently recommends CyrusOne (CONE) as one such stock. This company not only has a favorable Growth Score, but also carries a top Zacks Rank.",
    "Research shows that stocks carrying the best growth features consistently beat the market. And returns are even better for stocks that possess the combination of a Growth Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 (Buy).",
    "Here are three of the most important factors that make the stock of this data center operator a great growth pick right now.",
    " Earnings Growth ",
    "Arguably nothing is more important than earnings growth, as surging profit levels is what most investors are after. And for growth investors, double-digi t earnings  growth is definitely preferable, and often an indication of strong prospects (and stock price gains) for the company under consideration.",
    "While the historical EPS growth rate for CyrusOne is 17.4%, investors should actually focus on the projected growth. The company's EPS is expected to grow 7.1% this year, crushing the industry average, which calls for EPS growth of 0.5%.",
    " Cash Flow Growth ",
    "Cash is the lifeblood of any business, but higher-than-average cash flow growth is more beneficial and important for growth-oriented companies than for mature companies. That's because, high cash accumulation enables these companies to undertake new projects without raising expensive outside funds.",
    "Right now, year-over-year cash flow growth for CyrusOne is 88.9%, which is higher than many of its peers. In fact, the rate compares to the industry average of 13.2%.",
    "While investors should actually consider the current cash flow growth, it's worth taking a look at the historical rate too for putting the current reading into proper perspective. The company's annualized cash flow growth rate has been 30.4% over the past 3-5 years versus the industry average of 18.1%.",
    " Promising Earnings Estimate Revisions ",
    "Superiority of a stock in terms of the metrics outlined above can be further validated by looking at the trend in earnings estimate revisions. A positive trend is of course favorable here. Empirical research shows that there is a strong correlation between trends in earnings estimate revisions and near-term stock price movements.",
    "There have been upward revisions in current-year earnings estimates for CyrusOne. The Zacks Consensus Estimate for the current year has surged 0.5% over the past month.",
    " Bottom Line ",
    "CyrusOne has not only earned a Growth Score of B based on a number of factors, including the ones discussed above, but it also carries a Zacks Rank #2 because of the positive earnings estimate revisions.",
    "You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .",
    "This combination positions CyrusOne well for outperformance, so growth investors may want to bet on it.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:45:06"
}