{
  "url": "https://www.nasdaq.com/article/some-highyield-bond-funds-vulnerable-in-event-of-shock-eu-regulators-20190905-00316",
  "title": "Some high-yield bond funds vulnerable in event of shock -EU regulators - Nasdaq.com",
  "text": [
    "By Huw Jones",
    "LONDON, Sept 5 (Reuters) - Some EU-registered high-yield bond funds would be potentially unable to meet cash calls if a flood of investors asked for their money back, European Union regulators said on Thursday.",
    "The European Securities and Markets Authority (ESMA) published a framework that supervisors can use to test the resilience of funds to shocks.",
    "\"The results show that overall, most funds are able to cope with such extreme but plausible shocks, as they have enough liquid assets to meet investors' redemption requests,\" ESMA said in a statement.",
    "\"However, pockets of vulnerabilities are identified, especially for high yield (HY) bond funds.\"",
    "Under the new framework's \"severe\" assumptions, up to 40% of high yield bond funds tested could end up with too little liquid assets to meet redemptions.",
    "In return for a credit rating below investment grade, riskier high yield bonds offer higher interest rates to investors and are attractive at times of historically low central bank rates.",
    "The watchdog's case study also looked at the impact on markets of the need for bond funds to sell assets to meet cash calls, which typically puts downward pressure on asset prices.",
    "The pressure was limited for most asset classes but material for high yield and emerging market bonds, ESMA said.",
    "ESMA Chair Steven Maijoor said the stress simulation framework will help ensure resilience to shocks in the overall EU-regulated funds sector, which has grown rapidly to 9.3 trillion euros last year, from 6.2 trillion euros in 2007.",
    "The ability of funds to meet redemption calls has become a hot topic for regulators in Britain after a retail equities fund run by high-profile asset manager Neil Woodford was suspended in June.",
    "The Woodford fund was unable to meet demands from investors for their cash despite advertising itself as offering daily redemptions.",
    "($1 = 0.8973 euros)"
  ],
  "published_datetime": "2019-09-05 06:50:00"
}