{
  "url": "https://www.nasdaq.com/article/us-stockswall-street-bogged-down-by-trade-growth-concerns-20190903-01013",
  "title": "US STOCKS-Wall Street bogged down by trade, growth concerns - Nasdaq.com",
  "text": [
    " (For a live blog on the U.S. stock market, click LIVE/ ortype LIVE/ in a news window.)",
    "* U.S. factory activity shrinks for first time since 2016",
    "* Technology stocks weigh most on S&P 500, industrialstumble",
    "* Indexes fall: Dow 1.28%, S&P 500 0.91%, Nasdaq 1.33%  (Updates to late afternoon, adds commentary, changes byline,adds NEW YORK dateline)",
    "By Sinéad Carew",
    "NEW YORK, Sept 3 (Reuters) - U.S. stocks fell on Tuesdayafter the United States and China imposed new tariffs on eachother and data showed U.S. factory activity shrank in August forthe first time since 2016, renewing growth fears.",
    "Investors fled riskier assets as the latest face-off gnawedat any hopes for a resolution to the long-running U.S.-Chinatrade war, which has rattled markets for months and weighed onworld economies. urn:newsml:reuters.com:*:nL2N25U0FT",
    "Adding to the uncertainty, the Institute for SupplyManagement said its index of national factory activity droppedto 49.1, compared with a reading of 51.1 estimated by analystspolled by Reuters.  urn:newsml:reuters.com:*:nL2N25R073",
    "The uncertain outlook also pushed the benchmark 10-year U.S.Treasury yield US10YT=RR to its lowest level since July 2016as bonds were in demand. ",
    "\"Sentiment was already poor to start the day and then theweaker-than-expected manufacturing data just added fuel to thefire,\" said Dave Mazza, managing director and head of product atasset management firm Direxion in New York. ",
    "\"We now have confirmation that the escalation in the tradewar has spilled over to U.S. manufacturing just as it has tomanufacturing around the globe,\" he added.",
    "At 2:55PM ET, the Dow Jones Industrial Average .DJI fell336.92 points, or 1.28%, to 26,066.36, the S&P 500 .SPX lost26.73 points, or 0.91%, to 2,899.73 and the Nasdaq Composite .IXIC dropped 105.76 points, or 1.33%, to 7,857.13.",
    "Earlier in the day data showed British constructioncompanies last month suffered the sharpest drop in new orderssince the financial crisis due to jitters about Brexit. urn:newsml:reuters.com:*:nL5N25U1XE",
    "\"It's not just tariffs. Tariffs are the main thing but thereare other areas of unknown which tend to be a bad thing forstocks. People like certainty,\" said JJ Kinahan, chief marketstrategist at TD Ameritrade in Chicago.    ",
    "Trade-sensitive industrials .SPLRCI fell 1.8%, the biggestpercentage loser among the S&P 11 major sectors. Technologystocks .SPLRCT fell 1.5%, weighed down by chipmakers, whichhave large revenue exposure to China. The PhiladelphiaSemiconductor index .SOX dropped 2.2%.",
    "Boeing Co shares BA.N , tumbled 3%, weighing on the Dow,after the Federal Aviation Administration said on Friday aglobal panel of experts will need a few more weeks to finish itsreview of the company's 737 MAX certification. urn:newsml:reuters.com:*:nL2N25Q1EF",
    "U.S. casino operators felt the brunt of slowing economicgrowth in China as gambling hub Macau posted weak August casinorevenue. Shares of Las Vegas Sands CorpLVS.N , Wynn ResortsLtd WYNN.O and MGM Resorts InternationalMGM.N fell between2% and almost 5%. urn:newsml:reuters.com:*:nL3N25U2WY",
    "Among the few gainers were the defensive utilities .SPLRCU , real estate .SPLRCR and consumer staples .SPLRCS sectors. ",
    "Declining issues outnumbered advancing ones on the NYSE by a1.90-to-1 ratio; on Nasdaq, a 2.74-to-1 ratio favored decliners.",
    "The S&P 500 posted 37 new 52-week highs and 9 new lows; theNasdaq Composite recorded 45 new highs and 125 new lows.       (Reporting by Uday Sampath and Shreyashi Sanyal in Bengaluru;Editing by Anil D'Silva, Arun Koyyur and Dan Grebler) ((sinead.carew@thomsonreuters.com; +1 (646) 223 6186; ReutersMessaging: sinead.carew.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-03 14:56:00"
}