{
  "url": "https://www.nasdaq.com/article/ryanair-picks-eddie-wilson-as-chief-executive-of-main-airline-cm1206746",
  "title": "Ryanair Picks Eddie Wilson as Chief Executive of Main Airline - Nasdaq.com",
  "text": [
    " Per Reuters  , Ryanair Holdings plc RYAAY  recently appointed Eddie Wilson as the chief executive of its core airline business. Meanwhile, Michael O'Leary has been promoted to chief executive officer of Ryanair Group that includes Laudamotion and Buzz brands.  makeArticleAd();  Wilson, a Ryanair-veteran of 22 years took charge on Sep 1 and reports to O'Leary. Previously, he served as the chief people officer and was responsible for negotiations with unions for the past two years.    A few weeks earlier, O'Leary announced that Peter Bellew would resign from his position as chief operations officer at the end of this year. Prior to this announcement, there were speculations of Peter Bellew becoming the new chief executive.   Ryanair Holdings PLC Price        Ryanair Holdings PLC price    |   Ryanair Holdings PLC Quote    Meanwhile, Ryanair has been struggling with labor-related issues for a prolonged period of time. The carrier is currently facing strikes from its Spanish cabin crew and the UK pilots. Following a mediation failure between Ryanair and the union leaders, its Spanish cabin crew warned of a 10-day strike in September (1, 2, 6, 8, 13, 15, 20, 22, 27 and 29). Meanwhile, the carrier's British pilots began a three-day strike (which the airline believes will have minimal impact on travel). The airline staff is protesting against a poor pay structure and bad work conditions.   Zacks Rank & Key Picks    Ryanair carries a Zacks Rank #4 (Sell).    Some better-ranked stocks in the same space are Allegiant Travel Company ALGT  , Copa Holdings, S.A. CPA  and Gol Linhas Aereas Inteligentes S.A. GOL  , each sporting a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .    Shares of Allegiant, Copa and Gol Linhas have rallied more than 41%, 31% and 18%, respectively, so far this year.   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they   spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has   identified 5 stocks that could soar in response to the powerful demand. One industry insider described   the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Ryanair Holdings PLC (RYAAY): Free Stock Analysis Report   Gol Linhas Aereas Inteligentes S.A. (GOL): Free Stock Analysis Report   Allegiant Travel Company (ALGT): Free Stock Analysis Report   Copa Holdings, S.A. (CPA): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Per Reuters  , Ryanair Holdings plc RYAAY  recently appointed Eddie Wilson as the chief executive of its core airline business. Meanwhile, Michael O'Leary has been promoted to chief executive officer of Ryanair Group that includes Laudamotion and Buzz brands.  makeArticleAd();  Wilson, a Ryanair-veteran of 22 years took charge on Sep 1 and reports to O'Leary. Previously, he served as the chief people officer and was responsible for negotiations with unions for the past two years.    A few weeks earlier, O'Leary announced that Peter Bellew would resign from his position as chief operations officer at the end of this year. Prior to this announcement, there were speculations of Peter Bellew becoming the new chief executive.",
    "  Ryanair Holdings PLC Price        Ryanair Holdings PLC price    |   Ryanair Holdings PLC Quote  ",
    " Ryanair Holdings PLC Price ",
    " Ryanair Holdings PLC price    |   Ryanair Holdings PLC Quote ",
    "Meanwhile, Ryanair has been struggling with labor-related issues for a prolonged period of time. The carrier is currently facing strikes from its Spanish cabin crew and the UK pilots. Following a mediation failure between Ryanair and the union leaders, its Spanish cabin crew warned of a 10-day strike in September (1, 2, 6, 8, 13, 15, 20, 22, 27 and 29). Meanwhile, the carrier's British pilots began a three-day strike (which the airline believes will have minimal impact on travel). The airline staff is protesting against a poor pay structure and bad work conditions.   Zacks Rank & Key Picks    Ryanair carries a Zacks Rank #4 (Sell).    Some better-ranked stocks in the same space are Allegiant Travel Company ALGT  , Copa Holdings, S.A. CPA  and Gol Linhas Aereas Inteligentes S.A. GOL  , each sporting a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .    Shares of Allegiant, Copa and Gol Linhas have rallied more than 41%, 31% and 18%, respectively, so far this year.   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they   spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has   identified 5 stocks that could soar in response to the powerful demand. One industry insider described   the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:57:00"
}