{
  "url": "https://www.nasdaq.com/article/tenyear-yield-at-lowest-since-2016-after-us-manufacturing-shrinks-20190903-00892",
  "title": "Ten-year yield at lowest since 2016 after U.S. manufacturing shrinks - Nasdaq.com",
  "text": [
    "By Kate Duguid",
    "NEW YORK, Sept 3 (Reuters) - U.S. Treasury yields fell on Tuesday morning, with the benchmark 10-year yield at its lowest since July 2016, after manufacturing data showed the U.S. factory sector contracted for the first time since 2016 amid worries about a weakening global economy and trade tensions between China and the United States.",
    "The Institute for Supply Management (ISM) said its index of national factory activity decreased in August to 49.1, the lowest since January 2016. This compared with a figure of 51.2 in July. Analysts polled by Reuters had forecast a reading of 51.1 for August. ",
    "Across maturities, yields fell. The 10-year yield  fell as low as 1.4370% and was last down 6.2 basis points to 1.4439%. The two-year yield  was 0.58 basis points lower to 1.4500%. The fall was greater in shorter-dated maturities, steepening the yield curve slightly, though it remained inverted.",
    "\"Employment was softer at 47.4 vs. 51.7 July - if there was any question whether or not the trade war was hurting manufacturing sentiment, today's release cleared that up with the insightful observation that \"Comments from the panel reflect a notable decrease in business confidence,\"\" said Ian Lyngen, head of U.S. rates strategy at BMO Capital Markets in New York.",
    "Looking at the spread between ISM \"New orders\" minus \"Inventories,\" Lyngen said, \"While not definitive, there is a clear correlation between a negative spread and an economic recession. The logic holds that if inventories are building faster than new orders are coming in, there is a problem on the horizon.\"",
    "U.S. President Donald Trump said on Tuesday that trade talks between the United States and China were going well, but warned he would be \"tougher\" in negotiations if the discussions drag on until his second term. ",
    "Other data on Tuesday showed construction spending barely rising in July. Data on consumer spending had suggested that while the economy was slowing, it was not losing momentum as rapidly as financial markets were flagging.",
    "The two-year yield was at its lowest since September 2017."
  ],
  "published_datetime": "2019-09-03 11:01:00"
}