{
  "url": "https://www.nasdaq.com/article/etfs-in-focus-as-rising-trade-war-tensions-hurt-oil-prices-cm1206975",
  "title": "ETFs in Focus as Rising Trade War Tensions Hurt Oil Prices - Nasdaq.com",
  "text": [
    " All eyes are on how the struggling  global market  s will react to the new set of tariffs imposed on Sep 1. The slowdown in global business activities has also resulted in a decline in demand for oil  . Accordingly, per a Reuters article  , International Brent crude futures fell 59 cents to $58.66 a barrel (as on Sep 2).  U.S. benchmark WTI  crude also declined 33 cents on the same day (read: Trade War Gets Uglier: Here Are the ETF Winners & Losers  ).  Let's see what's causing the slump in  oil prices  :  Escalating Trade War  Retaliating to President Trump's early August attack, China imposed new tariffs  of 5% to 10% on $75 billion worth of U.S. goods, effective on some items from Sep 1 and others from Dec 15. The raised duties will be levied on nearly 5,078 U.S. products ,  including agricultural goods like soybeans and coffee along with whiskey, seafood, aircraft and crude oil. Trump responded by raising tariffs on $550 billion worth  of Chinese goods. He lifted existing tariffsto 30% from 25% on $250 billion of Chinese imports effective Oct 1  . Moreover, tariffs planned on a further $300 billion in Chinese goods will be revised to 15% from 10%  in two stages - Sep 1 and Dec 15 (read: 4 Dividend ETFs to Ride Out Trade War Uncertainty  ). As a result, per the Chinese Commerce Ministry  , China recently filed a complaint against the United States at the World Trade Organization over U.S. import duties. Interestingly, this is the third tariff case  China has filed against the United States to challenge China-related tariffs at the WTO. Moreover, the nations are facing difficulties in coming to common grounds  for negotiation talks that are scheduled to take place in September.  OPEC Output Increases  Adding weakness to oil prices amid the slump in global demand, Organization of the Petroleum Exporting Countries  (OPEC) reported a rise in production of crude oil for the first time this year in August. Production increases  in Nigeria and Iraq eroded benefits from higher-than-pledged output cuts by Saudi Arabia and other Gulf producers. Moreover, Nigeria produced 80,000 barrels per day  (bpd) more while Iraq's production rose by 60,000 bpd in August. Interestingly, OPEC's output in July 2019 was the lowest since March 2014  .  Oil ETFs in Focus  Against this backdrop, investors can wait on sidelines to see how the trade spat unfolds while keeping a tab on oil ETFs.  United States Oil Fund   USO   The fund has an AUM of $1.26 billion. The fund seeks to match the daily price movements of West Texas Intermediate (WTI or U.S. crude). The ETF has 0.73% in expense ratio (read: Worst Sector ETFs of August  ).  United States Brent Oil Fund   BNO    This fund provides direct exposure to the spot price of Brent crude oil on a daily basis through future contracts. It has amassed $85.3 million in its asset base. The ETF charges 90 bps in annual fees and expenses (read: Is an Oil ETF Rally on Middle East Tensions Sustainable?  ).  Invesco DB Oil Fund   DBO   This product provides exposure to crude oil through WTI futures contracts and follows the DBIQ Optimum Yield Crude Oil Index Excess Return. The fund has AUM of $271.6 million. It charges an expense ratio of 0.78% (read : ETFs to Gain From the Oil Rally on US Crude Inventory Data  ).  iPath S&P GSCI Crude Oil Total Return Index ETN   OIL   This is an ETN option for oil investors and delivers returns through an unleveraged investment in the WTI crude oil futures contract. The product follows the S&P GSCI Crude Oil Total Return Index, a subset of the S&P GSCI Commodity Index. The note has amassed $88.8 million in AUM. Its expense ratio came in at 0.45%  Want key ETF info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.   Get it free >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  US Commodity Funds United States Oil Fund (USO): ETF Research Reports   United States Brent Oil Fund LP (BNO): ETF Research Reports   iPath Series B S&P GSCI Crude Oil Total Return Index ETN (OIL): ETF Research Reports   Invesco DB Oil Fund (DBO): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    "All eyes are on how the struggling  global market  s will react to the new set of tariffs imposed on Sep 1. The slowdown in global business activities has also resulted in a decline in demand for oil  . Accordingly, per a Reuters article  , International Brent crude futures fell 59 cents to $58.66 a barrel (as on Sep 2).  U.S. benchmark WTI  crude also declined 33 cents on the same day (read: Trade War Gets Uglier: Here Are the ETF Winners & Losers  ). ",
    "Let's see what's causing the slump in  oil prices  :",
    " Escalating Trade War ",
    "Retaliating to President Trump's early August attack, China imposed new tariffs  of 5% to 10% on $75 billion worth of U.S. goods, effective on some items from Sep 1 and others from Dec 15. The raised duties will be levied on nearly 5,078 U.S. products ,  including agricultural goods like soybeans and coffee along with whiskey, seafood, aircraft and crude oil. Trump responded by raising tariffs on $550 billion worth  of Chinese goods. He lifted existing tariffsto 30% from 25% on $250 billion of Chinese imports effective Oct 1  . Moreover, tariffs planned on a further $300 billion in Chinese goods will be revised to 15% from 10%  in two stages - Sep 1 and Dec 15 (read: 4 Dividend ETFs to Ride Out Trade War Uncertainty  ).",
    "As a result, per the Chinese Commerce Ministry  , China recently filed a complaint against the United States at the World Trade Organization over U.S. import duties. Interestingly, this is the third tariff case  China has filed against the United States to challenge China-related tariffs at the WTO. Moreover, the nations are facing difficulties in coming to common grounds  for negotiation talks that are scheduled to take place in September.",
    " OPEC Output Increases ",
    "Adding weakness to oil prices amid the slump in global demand, Organization of the Petroleum Exporting Countries  (OPEC) reported a rise in production of crude oil for the first time this year in August. Production increases  in Nigeria and Iraq eroded benefits from higher-than-pledged output cuts by Saudi Arabia and other Gulf producers. Moreover, Nigeria produced 80,000 barrels per day  (bpd) more while Iraq's production rose by 60,000 bpd in August. Interestingly, OPEC's output in July 2019 was the lowest since March 2014  .",
    " Oil ETFs in Focus ",
    "Against this backdrop, investors can wait on sidelines to see how the trade spat unfolds while keeping a tab on oil ETFs.",
    " United States Oil Fund   USO  ",
    "The fund has an AUM of $1.26 billion. The fund seeks to match the daily price movements of West Texas Intermediate (WTI or U.S. crude). The ETF has 0.73% in expense ratio (read: Worst Sector ETFs of August  ).",
    " United States Brent Oil Fund   BNO  ",
    " This fund provides direct exposure to the spot price of Brent crude oil on a daily basis through future contracts. It has amassed $85.3 million in its asset base. The ETF charges 90 bps in annual fees and expenses (read: Is an Oil ETF Rally on Middle East Tensions Sustainable?  ).",
    " Invesco DB Oil Fund   DBO  ",
    "This product provides exposure to crude oil through WTI futures contracts and follows the DBIQ Optimum Yield Crude Oil Index Excess Return. The fund has AUM of $271.6 million. It charges an expense ratio of 0.78% (read : ETFs to Gain From the Oil Rally on US Crude Inventory Data  ).",
    " iPath S&P GSCI Crude Oil Total Return Index ETN   OIL  ",
    "This is an ETN option for oil investors and delivers returns through an unleveraged investment in the WTI crude oil futures contract. The product follows the S&P GSCI Crude Oil Total Return Index, a subset of the S&P GSCI Commodity Index. The note has amassed $88.8 million in AUM. Its expense ratio came in at 0.45%",
    " Want key ETF info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.   Get it free >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:45:00"
}