{
  "url": "https://www.nasdaq.com/article/your-credit-score-isnt-the-only-gauge-of-financial-health-cm1207593",
  "title": "Your Credit Score Isn’t the Only Gauge of Financial Health - Nasdaq.com",
  "text": [
    "Your credit score is a bellwether of your financial habits, but it's not the only one. There are other numbers that say a lot about you when you apply for things like a credit card, car loan or mortgage, or act as a yardstick to measure how financially healthy you are.",
    "Here are three numbers worth paying attention to and what you can do to influence them:",
    "This is how your total monthly debt payments compare with your gross monthly income, expressed as a percentage. It's important to lenders since it shows them whether you can afford to take on more debt. It matters as much as your credit score in lending decisions.",
    "Calculating your DTI ratio helps you see how you look to lenders and understand whether you are carrying too much debt. A ratio of 20% or below is considered financially healthy by financial experts. A ratio that is from 36% to 40% and higher shows financial stress, according to the Federal Reserve and the Certified Financial Planner Board of Standards.",
    "What you can do: If your DTI is on the higher side, choose a debt payoff strategy to whittle down what you owe. Start by tackling the debt with the highest interest rate, says Kayse Kress, a certified financial planner at Physician Wealth Services in San Diego. That typically includes things such as credit cards and payday loans. This strategy is known as the debt avalanche.",
    "An alternate way to bring down debt is by paying off the smallest balance first, then rolling that payment into the next small balance, a method known as the debt snowball. (In both methods, you continue making minimum payments on all debts while putting any extra money you can toward the debt you're focusing on.)",
    "This is the pool of money you set aside for unexpected expenses, like a flat tire or a sudden trip to the vet.",
    "An emergency fund is especially important when you have debt because it prevents you from racking up more.",
    "\"If you have a ton of debt, you're not going to get out of it if you have to keep using your credit cards,\" Kress says.",
    "Your job stability influences how much you should save in your fund, she says. \"If you are not going to lose your job, then keeping a lot of cash on hand versus paying off debt is not great. But if your job is volatile, then having more cash on hand is good.\"",
    "What you can do: To start with, saving $500 should cover many common emergencies. Over the long term, you can work toward saving the three to six months' worth of expenses that financial experts advise.",
    "The emergency fund is short-term savings, while retirement contributions are for the long term. Having both matters for your financial health.",
    "Don't lump retirement contributions in with setting money aside for large expenses, Kress says. \"If you are putting money into accounts for travel, kids, school or cars, that is a long-term expense, not long-term savings.\"",
    "How much you should save for retirement depends on a few factors, such as your current income and lifestyle preferences. Financial experts recommend ideally saving 10% to 15% of your income each year, but to find the right number for your situation, use a retirement calculator.",
    "What you can do: If your workplace has a retirement savings plan and offers an employer match, contribute at least enough to get the full match. If you don't have a workplace-sponsored retirement account, consider opening an individual retirement account, or IRA.",
    "\"Even if you are paying off debt, contribute something to retirement,\" Kress says.",
    "The sooner you put money into a retirement account, the longer it has to grow.",
    "More From NerdWallet",
    "Amrita Jayakumar is a writer at NerdWallet. Email: ajayakumar@nerdwallet.com. Twitter: @ajbombay.",
    "The article Your Credit Score Isn't the Only Gauge of Financial Health originally appeared on NerdWallet.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 06:00:29"
}