{
  "url": "https://www.nasdaq.com/article/is-medtronic-about-to-give-intuitive-surgical-a-run-for-its-money-cm1207712",
  "title": "Is Medtronic About to Give Intuitive Surgical a Run for Its Money? - Nasdaq.com",
  "text": [
    "Intuitive Surgical (NASDAQ: ISRG) pretty much had the robotic surgical systems market all to itself for years. Today, however, there are several other companies in the arena. The good news for Intuitive is that none of these rivals have gone head-to-head against its flagship da Vinci robotic surgical system.",
    "But that's about to change.",
    "Medtronic (NYSE: MDT) announced in its fiscal 2020 first-quarter conference call in August that it plans to host an analysts day on Sept. 24 focused on its robotic surgical systems, with a special focus on its new soft-tissue robot that will compete directly against da Vinci. Is Medtronic about to give Intuitive Surgical a run for its money?",
    "Image source: Getty Images.",
    "Make no mistake about it, Medtronic will be a formidable challenger to Intuitive Surgical. The medical device giant's profit in its latest quarter was 25% bigger than Intuitive's total revenue. Medtronic has a lot of money to invest in winning in the robotic surgical systems arena.",
    "And it's pretty clear that Medtronic definitely wants to be a winner. CEO Omar Ishrak stated in the company's Q1 conference call that \"in virtually every area that we have a procedural presence, we will look at robotics because that's how it's going to be.\" Ishrak added that \"we expect to be leaders over the long term... and be the company who rewrites the way surgery is done in the next decade.\"",
    "Aside from its financial strength, there are two specific reasons why Medtronic could deliver on Ishrak's bold prediction. First, the company has close relationships with many major hospital systems across the world. These relationships extend to frequent personal contacts with surgeons in those hospitals.",
    "Second, Medtronic isn't a newbie to robotic surgical systems. The company partnered with, and ultimately acquired, Mazor Robotics. Although Mazor specializes in spinal and brain procedures, Bob White, president of Medtronic's minimally invasive therapies group that is developing the system that will compete against da Vinci, hinted that his team is learning a lot from the progress that Mazor has made.",
    "Although Medtronic is a formidable challenger, it also has a formidable challenge ahead. Dethroning Intuitive Surgical as the king of robotic surgery won't be easy. It could be virtually impossible.",
    "Consider that Intuitive Surgical had an install base of 5,270 systems as of the end of June. This install base continues to grow. And every customer with a da Vinci system installed has a significant financial incentive to maximize the use of the system.",
    "It's possible that Medtronic could price its new robotic surgical system at a steep discount to da Vinci. But even if the company takes this approach, it probably wouldn't be able to offer a price low enough to compel current da Vinci customers to switch systems. A drastically lower price, however, could tempt new customers to go with Medtronic instead of Intuitive Surgical. Of course, Medtronic needs to recover its investment in the new robotic surgical system. There's a limit to how low it can go when it comes to price.",
    "Even if Medtronic does attempt to compete on price, Intuitive Surgical has another card to play. Medtronic's robotic system will be brand new, with only a small number of procedures performed using the system during clinical testing. Da Vinci, on the other hand, has a track record that spans two decades with over 6 million (and counting) procedures performed. Intuitive Surgical can also point prospective customers to the more than 18,000 peer-reviewed scientific articles published about da Vinci. Medtronic won't be able to point to an extensive track record for a long time to come.",
    "And while Medtronic has a strong relationship with surgeons, so does Intuitive Surgical. The company has also been smart about getting its da Vinci virtual reality simulators installed at academic institutions. New surgeons will already have experience with da Vinci and could influence future buying decisions by hospitals.",
    "Intuitive Surgical CEO Gary Guthart doesn't speak very much about potential competition. When asked in the company's Q2 conference call about one of its future robotic surgical rivals, he didn't directly respond but stated, \"There is a fair amount of history out there of companies that have failed to attend to the details and start strong and peter out.\" Guthart stressed that Intuitive will continue to be \"very thoughtful and careful\" about the details of the new innovations that it rolls out.",
    "I don't think that Medtronic will be one of those companies that doesn't pay attention to the details and flames out. However, I also don't think that Intuitive Surgical will lose momentum with a new rival on the scene. Instead, I agree with Canaccord Genuity analyst Jason Mills' view that Intuitive Surgical's competitive advantages, including the breadth of its product offering and its customer relationships, will allow it to continue growing at a solid pace over the next few years.",
    "Over the longer run, I think that the expanding market for robotic surgery will be big enough to support multiple players, including a new system that could be on the way from Verb Surgical. My prediction, for now, is that Intuitive Surgical will remain the king of the robotic surgical systems market.",
    "But investing in healthcare stocks , especially with the sector's fast-changing dynamics, requires a regular reevaluation of the competitive landscape. I plan to closely watch Medtronic's anticipated launch of its new robotic surgical system. My opinion about Intuitive's prospects could change if my assumptions about Intuitive's competitive moat prove to be too optimistic.",
    "10 stocks we like better than Intuitive Surgical\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Intuitive Surgical wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Keith Speights owns shares of Intuitive Surgical. The Motley Fool owns shares of and recommends Intuitive Surgical. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 07:30:00"
}