{
  "url": "https://www.nasdaq.com/article/zambia-mining-firms-say-mineral-royalties-should-be-capped-at-75-20190903-00807",
  "title": "Zambia mining firms say mineral royalties should be capped at 7.5% - Nasdaq.com",
  "text": [
    "LUSAKA, Sept 3 (Reuters) - Zambia should keep mineral royalties capped at 7.5% in the 2020 budget to safeguard the health of the mining sector and promote additional investment, the Chamber of Mines said on Tuesday.",
    "The mining body said in proposals submitted to the finance ministry that the 2019 mining tax regime had raised the tax burden on mines to unsustainable and uncompetitive levels.",
    "Africa's No.2 copper producer increased its sliding scale for royalties of 4 to 6% by 1.5 percentage points and introduced a new 10% tax when the price of copper exceeds $7,500 per tonne.",
    "\"If the 1.5% increment on each band of the sliding scale is to be maintained, the maximum rate should be capped at 7.5%, for an LME copper price equalling or exceeding US$7,500/tonne,\" the Chamber of Mines said.",
    "The mineral royalty tax should also be tax-deductible for mining firms as making it non-deductible as Zambia does amounts to taxation on revenue not received, it said.",
    "\"Zambia is the only mining jurisdiction not allowing a deduction for these costs,\" it said.",
    "The Chamber said a proposed switch to a non-refundable sales tax from a refundable value-added tax should be delayed for at least two years until it is refined.",
    "It also urged a waiver on import duty on copper and cobalt concentrates, saying Zambia has excess smelting capacity which should not be forfeited to competing neighbouring states.",
    "Zambia should also keep mining energy tariff increases in step with inflation over the next three years until a cost of service study is completed and a new tariff plan agreed with indstry, it said.",
    "A ministry of finance spokesman was not immedaitely available for comment.",
    "Foreign Mining companies operating in Zambia include First Quantum Minerals , Barrick Gold  and Glencore ."
  ],
  "published_datetime": "2019-09-03 09:39:00"
}