{
  "url": "https://www.nasdaq.com/article/broadridge-br-completes-financial-database-services-buyout-cm1207088",
  "title": "Broadridge (BR) Completes Financial Database Services Buyout - Nasdaq.com",
  "text": [
    "  Broadridge Financial Solutions, Inc. BR  yesterday announced that it has completed the acquisition of Financial Database Services - a provider of compensation management, compliance and advisor onboarding solutions for the wealth management industry. The financial terms of the deal have been kept under wraps. So far this year, shares of Broadridge have gained 33.4% compared with 28.4% rise of the industry  it belongs and 15.4% rally of the Zacks S&P 500 composite.       A Strategic Move to Ramp Up Wealth Management   Services   The acquisition will help Broadridge amplify its advisor compensation management capabilities, thereby highlighting its focus on delivering value-added technology solutions to the wealth management industry. It will enhance Broadridge's potential in helping clients with adoption and compliance, considering the recently adopted Regulation Best Interest rule by the U.S. Securities and Exchange Commission. We believe the move will help Broadridge strengthen its Global Technology and Operations segment, which serves capital markets, wealth management and asset management firms. Revenues from the segment increased 8.2% year over year in fourth-quarter fiscal 2019. Michael Alexander, head of North American Wealth and Capital Markets Solutions at Broadridge stated, \"The acquisition of Financial Database Services is the latest example of Broadridge expanding our wealth capabilities and growing our client base.\"  Zacks Rank & Stocks to Consider  Broadridge currently carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   . Some better-ranked stocks in the broader Zacks  Business Services   sector are FLEETCOR FLT  , Huron Consulting HURN  and Charles River Associates CRAI  , each carrying a Zacks Rank #2 (Buy). Long-term expected earnings (three to five years) growth rate for FLEETCOR, Huron Consulting and Charles River Associates is 15.6%, 13.5% and 13%, respectively.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  FleetCor Technologies, Inc. (FLT): Free Stock Analysis Report   Huron Consulting Group Inc. (HURN): Free Stock Analysis Report   Charles River Associates (CRAI): Free Stock Analysis Report   Broadridge Financial Solutions, Inc. (BR): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Broadridge Financial Solutions, Inc. BR  yesterday announced that it has completed the acquisition of Financial Database Services - a provider of compensation management, compliance and advisor onboarding solutions for the wealth management industry. The financial terms of the deal have been kept under wraps.",
    "So far this year, shares of Broadridge have gained 33.4% compared with 28.4% rise of the industry  it belongs and 15.4% rally of the Zacks S&P 500 composite.",
    " A Strategic Move to Ramp Up Wealth Management   Services  ",
    "The acquisition will help Broadridge amplify its advisor compensation management capabilities, thereby highlighting its focus on delivering value-added technology solutions to the wealth management industry.",
    "It will enhance Broadridge's potential in helping clients with adoption and compliance, considering the recently adopted Regulation Best Interest rule by the U.S. Securities and Exchange Commission.",
    "We believe the move will help Broadridge strengthen its Global Technology and Operations segment, which serves capital markets, wealth management and asset management firms. Revenues from the segment increased 8.2% year over year in fourth-quarter fiscal 2019.",
    "Michael Alexander, head of North American Wealth and Capital Markets Solutions at Broadridge stated, \"The acquisition of Financial Database Services is the latest example of Broadridge expanding our wealth capabilities and growing our client base.\"",
    " Zacks Rank & Stocks to Consider ",
    "Broadridge currently carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "Some better-ranked stocks in the broader Zacks  Business Services   sector are FLEETCOR FLT  , Huron Consulting HURN  and Charles River Associates CRAI  , each carrying a Zacks Rank #2 (Buy). Long-term expected earnings (three to five years) growth rate for FLEETCOR, Huron Consulting and Charles River Associates is 15.6%, 13.5% and 13%, respectively.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 07:50:00"
}