{
  "url": "https://www.nasdaq.com/article/docusign-docu-2nd-quarter-earnings-what-to-expect-cm1207724",
  "title": "DocuSign (DOCU) 2nd Quarter Earnings: What to Expect - Nasdaq.com",
  "text": [
    "DocuSign (DOCU) is set to report second quarter fiscal 2020 earnings results after the closing bell Thursday.",
    "One of last year’s hottest IPOs, DocuSign provides individuals and businesses the ability to digitize an agreement process. The company competes with HelloSign and Adobe (ADBE) Sign, among others. Despite the crowded market, DocuSign’s client base — which includes the likes of T-Mobile (TMUS), Salesforce (CRM), Morgan Stanley (MS) and Bank of America (BAC) — has grown to more than 400,000 users and more than 300 of the Fortune 500 companies. Strong revenue growth has been a trademark for the company ever since it made its public debut.",
    "Investors who missed the buying opportunity when I last spoke about DocuSign are forced to buy it a more expensive price. After a 33% plunge at the end of November, the stock is now up 40% so far in 2019. And given the company’s projected growth rate, there is no sign of slowing down. The e-signature and cloud-based document company provides individuals and businesses the ability to digitize an agreement process.",
    "In an effort to grow its customer base, company is working to build out its ecosystem with new partners and features. And these initiatives make DocuSign well-positioned for the opportunities ahead. The global digital signature market is estimated to grow by more than 31% annually over the next six years, according to Reports Monitor. With such a strong portfolio of customers and having benefited from domestic and international regulations, the company on Thursday must prove to investors it’s more than just a good idea — it can also make money.",
    "In the three months that ended July, the San Francisco, Calif.-based company is expected to earn 4 cents per share on revenue of $220.93 million. This compares to the year-ago quarter when earnings were 3 cents per share on revenue of $167.04 million. For the full year, ending January, earnings of 19 cents per share would rise 111% year over year, while full-year revenue of $920.43 million would rise 31.3% year over year.",
    "The growing acceptance of e-signatures in the banking, financial services and insurance sector has been of the key reasons DocuSign has amassed strong subscription revenue since its IPO. In the first quarter, the company reported revenue of $213.96 million, which rose 37% year over year, while adjusted EPS of 7 cents per share, beat consensus by 2 cents. But the stock took a hit, falling more than 16% on slight deceleration of subscription revenue.",
    "Although Q1 subscription revenue rose 36% to $201.5 million, it was a slowdown from the 37% growth in Q4. Investors also took pause from the fact that gross margin of 79% was down one percentage point from Q1 of 2018, while subscription margin was essentially flat at 86%. These things aside, the market ignored the fact that the company also posted better-than expected growth in Professional Services and Billings, which rose 64% and 27%, respectively.",
    "In other words, DocuSign, which is priced on exemplary growth, has a lot to prove on Thursday. Namely, that the slowing metrics are not a trend, but an aberration. The company’s subscription business, which does the heavy lifting, accounting for about 95% of total revenue, must show it has tons of runway to re-accelerate the top line.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 08:16:38"
}