{
  "url": "https://www.nasdaq.com/article/costcos-epic-rally-prompts-analyst-downgrade-cm1210742",
  "title": "Costco's Epic Rally Prompts Analyst Downgrade - Nasdaq.com",
  "text": [
    " There's a lot to like about shares of warehouse club   Costco    (NASDAQ: COST) , but a sky-high valuation has one analyst taking   a step back. Analyst Rupesh Parikh at Oppenheimer lowered his rating on   Costco stock from outperform to  perform on Wednesday   morning, citing an epic 45% rally in 2019. Parikh sees limited   upside potential given the stock's recent performance, although   he continues to view Costco's long-term prospects favorably.   Image source: Costco.makeArticleAd();  Oppenheimer is less optimistic about Costco's earnings in the   near term than the average analyst covering the stock. The   investment bank expects EPS of $8.40 and $8.95 in fiscal 2020 and   2021, respectively, below the consensus analyst estimates of   $8.55 and $9.21. Costco stock has performed well for good reason. The retailer   is largely   Amazon    -proof, with an intensely loyal member base and bulky products   that aren't well suited to e-commerce. Comparable sales growth   has also been consistently impressive, up 6.9% in August. But Parikh has a point. With the stock nearing $300 per share,   Costco trades for more than 34 times the consensus analyst   estimate for fiscal 2020 earnings. For comparison, shares of   Walmart    go for less than 24 times forward earnings. For a relatively slow-growing retailer, that's a valuation   that's tough to justify. Costco certainly deserves to trade at a   premium over other retailers, but the rally this year might have   taken the stock a little too high. Costco remains well positioned in the   consumer staples    and food retailing universe, according to Parikh. But with   difficult comparisons coming up, aggressive analyst expectations,   and a lofty valuation, the stock's incredible performance might   not hold up much longer.   10 stocks we like better than Costco Wholesale       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Costco Wholesale wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors.     Timothy Green      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Amazon. The Motley Fool has the     following options: short January 2020 $180 calls on Costco     Wholesale and long January 2020 $115 calls on Costco Wholesale.     The Motley Fool recommends Costco Wholesale. The Motley Fool     has a     disclosure policy      .  ",
    "There's a lot to like about shares of warehouse club   Costco    (NASDAQ: COST) , but a sky-high valuation has one analyst taking   a step back.",
    "Analyst Rupesh Parikh at Oppenheimer lowered his rating on   Costco stock from outperform to  perform on Wednesday   morning, citing an epic 45% rally in 2019. Parikh sees limited   upside potential given the stock's recent performance, although   he continues to view Costco's long-term prospects favorably.",
    "  Image source: Costco.makeArticleAd(); ",
    "Image source: Costco.",
    "Oppenheimer is less optimistic about Costco's earnings in the   near term than the average analyst covering the stock. The   investment bank expects EPS of $8.40 and $8.95 in fiscal 2020 and   2021, respectively, below the consensus analyst estimates of   $8.55 and $9.21.",
    "Costco stock has performed well for good reason. The retailer   is largely   Amazon    -proof, with an intensely loyal member base and bulky products   that aren't well suited to e-commerce. Comparable sales growth   has also been consistently impressive, up 6.9% in August.",
    "But Parikh has a point. With the stock nearing $300 per share,   Costco trades for more than 34 times the consensus analyst   estimate for fiscal 2020 earnings. For comparison, shares of   Walmart    go for less than 24 times forward earnings.",
    "For a relatively slow-growing retailer, that's a valuation   that's tough to justify. Costco certainly deserves to trade at a   premium over other retailers, but the rally this year might have   taken the stock a little too high.",
    "Costco remains well positioned in the   consumer staples    and food retailing universe, according to Parikh. But with   difficult comparisons coming up, aggressive analyst expectations,   and a lofty valuation, the stock's incredible performance might   not hold up much longer.",
    "  10 stocks we like better than Costco Wholesale       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Costco Wholesale wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Costco Wholesale       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Costco Wholesale wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors.     Timothy Green      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Amazon. The Motley Fool has the     following options: short January 2020 $180 calls on Costco     Wholesale and long January 2020 $115 calls on Costco Wholesale.     The Motley Fool recommends Costco Wholesale. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:54:00"
}