{
  "url": "https://www.nasdaq.com/article/agco-corp-rides-on-margin-expansion-strategic-investments-cm1206970",
  "title": "AGCO Corp Rides on Margin Expansion & Strategic Investments - Nasdaq.com",
  "text": [
    " On Sep 2, we issued an updated research report on AGCO Corporation AGCO  . The company is likely to benefit from margin improvement, strategic investment in products, technology, and a solid capital-allocation plan.  makeArticleAd();  AGCO's second-quarter 2019 adjusted earnings per share were up 37.8% year over year to $1.82. The reported figure surpassed the Zacks Consensus Estimate of $1.59. The company witnessed impressive margin expansion across all regions and significan t earnings  per share growth during the April-June quarter.   Upbeat 2019 Prospects    AGCO anticipates gross and operating margins improvement from the 2018 levels, as the positive impact of pricing and benefits from cost-reduction initiatives will likely negate the impact of a softer market outlook for the North and South America segment. The company expects a relatively stable global industry demand for the current year. Considering these, AGCO now forecasts 2019 adjusted earnings per share of $5.10, up from the previous estimate of $4.90.   Strategic Investments Support AGCO    AGCO is consistently making strategic investments to enhance and expand its product lines, upgrade system capabilities as well as improve factory productivity. In a bid to execute its product-development plan and meet the latest emission requirements in Brazil and Europe, the company intends to increase the investment level in 2019. Consequently, AGCO expects current-year capital expenditures of roughly $225 million, up from the $203 million reported in 2018.   Acquisitions to Boost Growth    AGCO has completed two acquisitions in the last two years. In September 2017, it acquired Precision Planting - a leader in innovative planting technology. In October 2017, AGCO purchased the forage division of Lely Group, which will significantly boost its hay and forage product line in Europe, fueling growth in this market.   Solid Capital-Allocation Plan Bodes Well    AGCO is focused on its long-term capital allocation plan by returning cash to shareholders. Over the past six years, the company executed share repurchases of $1.3 billion, which reduced share count by more than 25%. In the first six months of 2019, it repurchased shares worth $70 million. The company expects to generate free cash flow of $275-$300 million for 2019. This year, AGCO increased its quarterly dividend by 7% to 16 cents per share.  AGCO Corporation Price and Consensus         AGCO Corporation price-consensus-chart    |   AGCO Corporation Quote      Zacks Rank & Other Key Picks    AGCO currently carries a Zacks Rank #2 (Buy).    Some other top-ranked stocks in the Industrial Products  sector are Zebra Technologies Corp. ZBRA  , Avery Dennison Corp. AVY  and Tetra Tech, Inc. TTEK  . While Zebra Technologies currently sports a Zacks Rank #1 (Strong Buy), Avery Dennison and Tetra Tech carry a Zacks Rank of 2 (Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here.     Zebra Technologies has a projected earnings growth rate of 16.71% for the current year. The stock has gained 19% in a year's time.    Avery Dennison has an estimated earnings growth rate of 8.42% for 2019. The company's shares have rallied 11.5% in the past year.    Tetra Tech has an expected earnings growth rate of 15.97% for the ongoing year. The stock has appreciated 16.5% over the past year.   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   AGCO Corporation (AGCO): Free Stock Analysis Report   Zebra Technologies Corporation (ZBRA): Free Stock Analysis Report   Avery Dennison Corporation (AVY): Free Stock Analysis Report   Tetra Tech, Inc. (TTEK): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "On Sep 2, we issued an updated research report on AGCO Corporation AGCO  . The company is likely to benefit from margin improvement, strategic investment in products, technology, and a solid capital-allocation plan.  makeArticleAd();  AGCO's second-quarter 2019 adjusted earnings per share were up 37.8% year over year to $1.82. The reported figure surpassed the Zacks Consensus Estimate of $1.59. The company witnessed impressive margin expansion across all regions and significan t earnings  per share growth during the April-June quarter.   Upbeat 2019 Prospects    AGCO anticipates gross and operating margins improvement from the 2018 levels, as the positive impact of pricing and benefits from cost-reduction initiatives will likely negate the impact of a softer market outlook for the North and South America segment. The company expects a relatively stable global industry demand for the current year. Considering these, AGCO now forecasts 2019 adjusted earnings per share of $5.10, up from the previous estimate of $4.90.   Strategic Investments Support AGCO    AGCO is consistently making strategic investments to enhance and expand its product lines, upgrade system capabilities as well as improve factory productivity. In a bid to execute its product-development plan and meet the latest emission requirements in Brazil and Europe, the company intends to increase the investment level in 2019. Consequently, AGCO expects current-year capital expenditures of roughly $225 million, up from the $203 million reported in 2018.   Acquisitions to Boost Growth    AGCO has completed two acquisitions in the last two years. In September 2017, it acquired Precision Planting - a leader in innovative planting technology. In October 2017, AGCO purchased the forage division of Lely Group, which will significantly boost its hay and forage product line in Europe, fueling growth in this market.   Solid Capital-Allocation Plan Bodes Well    AGCO is focused on its long-term capital allocation plan by returning cash to shareholders. Over the past six years, the company executed share repurchases of $1.3 billion, which reduced share count by more than 25%. In the first six months of 2019, it repurchased shares worth $70 million. The company expects to generate free cash flow of $275-$300 million for 2019. This year, AGCO increased its quarterly dividend by 7% to 16 cents per share.",
    " AGCO Corporation Price and Consensus ",
    "       AGCO Corporation price-consensus-chart    |   AGCO Corporation Quote  ",
    " AGCO Corporation price-consensus-chart    |   AGCO Corporation Quote ",
    " Zacks Rank & Other Key Picks    AGCO currently carries a Zacks Rank #2 (Buy).    Some other top-ranked stocks in the Industrial Products  sector are Zebra Technologies Corp. ZBRA  , Avery Dennison Corp. AVY  and Tetra Tech, Inc. TTEK  . While Zebra Technologies currently sports a Zacks Rank #1 (Strong Buy), Avery Dennison and Tetra Tech carry a Zacks Rank of 2 (Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here.     Zebra Technologies has a projected earnings growth rate of 16.71% for the current year. The stock has gained 19% in a year's time.    Avery Dennison has an estimated earnings growth rate of 8.42% for 2019. The company's shares have rallied 11.5% in the past year.    Tetra Tech has an expected earnings growth rate of 15.97% for the ongoing year. The stock has appreciated 16.5% over the past year.   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 17:19:00"
}