{
  "url": "https://www.nasdaq.com/article/why-jumia-technologies-stock-fell-345-in-august-cm1210329",
  "title": "Why Jumia Technologies Stock Fell 34.5% in August - Nasdaq.com",
  "text": [
    "Jumia Technologies (NYSE: JMIA)  saw its share price slip 34.5% in August, according to data from S&P Global Market Intelligence . The stock has been under pressure since a critical research note published by short-seller Andrew Left in May, and the e-commerce company's shares hit a new low following second-quarter results and comments from management last month.",
    "JMIA data by YCharts.",
    "Second-quarter revenue climbed roughly 58% to hit 39.2 million euros (roughly $43 million), but sales for the period came in 1.27 million euros short of the average analyst estimate. Jumia's net loss for the period came in at 67.8 million euros, a significant expansion compared with the loss of 42.3 million euros in the prior-year period. The company's gross merchandise volume (GMV) rose 69% year over year, and gross profit climbed 94%.",
    "The pan-African online retail company had its initial public offering in April, with the stock hitting the market at $14.50 per share and climbing as high as $49.77 thanks to excitement that it could be \"the Amazon of Africa.\" But a scathing note published by Andrew Left in a May edition of his Citron Research newsletter alleged that the company's IPO prospectus had misrepresented important metrics, including GMV and the rate at which orders were canceled or returned. Jumia's recen t quarterly report shed a bit more light on those issues, but apparently did little to assuage investor concerns.",
    "Image source: Getty Images.",
    "After conducting an internal review, the company found that some of its Jumia Force independent sales consultants had engaged in practices that led to its gross merchandise volume being overstated.",
    "The quotes below are taken from the company's earnings press release: \"In the course of this review, we identified several JForce agents and sellers who collaborated with employees in order to benefit from differences between commissions charged to sellers and higher commissions paid to JForce agents. The transactions in question generated approximately 1% of our GMV in each of 2018 and the first quarter of 2019 and had virtually no impact on our 2018 or 2019 financial statements.\"",
    "The company also identified an issue with orders being improperly placed and then canceled: \"Based on our findings to date, we believe that the transactions in question generated approximately 2% of our GMV in 2018, concentrated in the fourth quarter of 2018; approximately 4% in the first quarter of 2019, and approximately 0.1% in the second quarter of 2019. These 0.1% have already been adjusted for in the reported GMV figure for the second quarter of 2019.\"",
    "Jumia maintains that these errors had little to no impact on its financial statements. But it acknowledged that it is facing a series of lawsuits:",
    "Since May 2019, several class action lawsuits have been filed against us and certain of our officers in the U.S. District Court for the Southern District of New York and the Kings County Supreme Court in New York. The claims in these cases relate to alleged misstatements and omissions in our initial public offering prospectus and statements made by our company in connection with our initial public offering. These actions remain in their preliminary stages.",
    "Jumia stock has lost a bit of extra ground in September, with shares moving 2.6% lower in the month's trading so far.",
    "JMIA data by YCharts.",
    "In addition to the commerce platform, the company is also focused on JumiaPay, its platform for payment processing. JumiaPay is being further integrated into the company's product stack, and management also expects that it can be a successful stand-alone entity.",
    "In the second-quarter conference call, CEO Sacha Poignonnec reaffirmed his target to have Jumia hit an operating break-even point late in 2022. There's plenty of growth potential in the African e-commerce market, but the business is posting big losses and still has pending legal issues relating to its IPO prospectus, so the stock probably isn't for the faint of heart.",
    "10 stocks we like better than Jumia Technologies AG-ADR\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Jumia Technologies AG-ADR wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Keith Noonan has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:55:00"
}