{
  "url": "https://www.nasdaq.com/article/forex-daily-recap-cable-took-a-breather-amid-brexit-showdown-cm1206998",
  "title": "Forex Daily Recap – Cable Took a Breather amid Brexit Showdown - Nasdaq.com",
  "text": [
    "After four red sessions in a row, the Cable bulls took a breather today post-UK Parliamentary voting. Quite surprisingly, UK PM Boris Johnson's Conservative Party lost majority in the Parliament. The leading player for the Liberal Democrats win was Phillip Lee, the former Justice Minister. In front of the PM and others in the House, Lee just crossed the floor  to leave the Tories and join the Opposition party. Notably, this has happened for the first time where the government lost the majority in office since John Major in 1997.",
    "This Phillip Lee removing Boris Johnson's majority in front of him by going to sit with the Lib Dems. The UK parliament functions like Mean Girls. pic.twitter.com/Hf7dXliYOZ",
    "- Benjamin Butterworth (@benjaminbutter) September 3, 2019",
    "Nevertheless, Phillip Lee told Sky News that he expects more Tory defections on the horizon.",
    "On the technical side, though the overall perspective remained low, the Cable attempted a small jump, aiming to recover previously incurred losses. The MACD line and the Signal line stood below the zero line, pleasing the bears.",
    "Earlier today, the RBA decided to keep interest rates unchanged at an all-time low of 1%. Notably, the Central Bank had already lowered the rates in June and July, catering the slow global and domestic economic growth. However, data revealed the adverse wage growth and falling Retail Sales statistics. Hence, the policymakers keep the door ajar for probable rate cuts in the coming quarters.",
    "\"The Board will continue to monitor developments, including in the labor market, and ease monetary policy further if needed,\" to support growth and inflation targets, Lowe said  in a short post-meeting statement.",
    "Meantime, the July MoM Retail Sales reported -0.1%, missing market estimates of 0.2%.",
    "On the technical chart, a strong push to the upside was pretty evident throughout the day. The AUD/USD pair has breached the upper boundary of the Bollinger Bands , showcasing a demand upsurge on the buyer side. Anyhow, even if the AUD/USD pair had moved further upside then, that would have immediately activated the resistances stalled near 0.6800 and 0.6822 levels.",
    "Greenback bears took a part of the previously accumulated gains today as highly crucial August ISM Manufacturing PMI missed estimate. The market had expected this PMI data to report near 51.0 points, 0.2 points higher than the previous statistics. Anyhow, the actual figures came around 49.1 points, providing ammunition to the bears. Another pain for the US Dollar Index got triggered with the rise in the GBP/USD following the Parliamentary news.",
    "In the interim, the Greenback had already breached above the sturdy 98.68 levels on August 30. Anyhow, the Index was heading south side on Tuesday, planning a revisit to 98.50/97.50 region.",
    "The Swiss Franc pair was shedding gains on Tuesday following upbeat August CPI data release. Noticeably, the YoY CPI recorded 0.3% over 0.2% forecasts while the MoM CPI came around 0.0% above -0.1% estimate.",
    "At around 16:52 GMT, the USD/CHF pair was 0.26% down, trading near 0.9872 level. Needless to say, the Parabolic SAR was still below the pair accompanying the underlying 50-day SMA. Meanwhile, strong resistance cluster comprising of 100-day and 200-day SMAs was blocking the upside. Also, the Stochastics Oscillator was indicating 80 mark, showing over-bought conditions in combination with the overhead SMAs.",
    "Any further downside would have immediately activated the critical support handles stalled near 0.9775 and 0.9701 levels.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:45:18"
}