{
  "url": "https://www.nasdaq.com/article/is-targa-resources-a-buy-cm1207293",
  "title": "Is Targa Resources a Buy? - Nasdaq.com",
  "text": [
    "Shares of Targa Resources (NYSE: TRGP) have been under a lot of pressure over the past year due to continued volatility in the oil market. Overall, the midstream stock is down more than 35%, which has pushed its dividend yield up to nearly 10.5%.",
    "That lower share price and higher yield likely have investors wondering if now is a good time to buy. Here's a look at the case for and against Targa Resources.",
    "Image source: Getty Images.",
    "One of the reasons the stock has tumbled in the past year is the company's weakening financial profile. That was on full display during the second quarter. It generated only $192 million in distributable cash flow, which wasn't enough to cover the $234.4 million it paid out to investors. After distributing 100% of its cash flow last year, Targa has now paid out significantly more than it hauled in through the first half of this year, which isn't sustainable.",
    "One of the reasons Targa's coverage ratio has worsened this year is an asset sale. That gave it the funds to pay down debt so that it could fund expansion projects. But even with that sale, its leverage ratio remained elevated at 4.4 times debt to EBITDA , which is above the sub-4.0 comfort level of most midstream companies. That's why the company still has a sub-investment-grade credit rating, which makes it more challenging and expensive to borrow money.",
    "While its financial metrics are a concern at the moment, they should improve significantly in the second half of the year. That's because the company has already completed $3 billion of expansions projects since the end of the first quarter and expects to finish several more in the coming quarters.",
    "The biggest project is the Grand Prix pipeline, which will transport natural gas liquids (NGLs) from the Permian Basin to a processing hub in Mont Belvieu, Texas. It recently completed that pipeline following a two-month delay, so it will provide only a partial boost in the third quarter before the company experiences the full benefit during the fourth quarter. Targa also recently finished three natural gas processing plants, an NGL processing facility, and a smaller NGL pipeline, which should boost its second-half results.",
    "There are several more expansion projects ready to come on line over the next year. Leading the way is the Gulf Coast Express pipeline, which fellow midstream giant Kinder Morgan (NYSE: KMI) is developing. Kinder Morgan currently expects this project to be in service late in the third quarter. Meanwhile, Targa has another natural gas processing plant coming on line in the fourth quarter and two more scheduled for 2020. It also has two more NGL facilities on track to start up over the next year.",
    "These expansion projects have its EBITDA on pace to grow from a projected $1.35 billion this year up to around $2 billion in 2020, with additional growth in 2021. Meanwhile, it's expected that expansion spending will decline from $2.3 billion this year to $1.8 billion over the 2020 to 2021 time frame, which will enable it to generate more free cash flow. Because of this growth, Targa's financial metrics should significantly improve over the next year, which will enhance the sustainability of its high-yielding dividend.",
    "Targa Resources has finally reached the inflection point where its expansion projects will begin fueling accelerated earnings growth. Because of that, its financial profile will improve, which should lift the weight that has pushed the energy company 's stock down over the past year. That makes now an ideal time to start buying its shares, which look poised to begin bouncing back in the coming quarters.",
    "10 stocks we like better than Targa Resources\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Targa Resources wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Matthew DiLallo owns shares of Kinder Morgan. The Motley Fool owns shares of and recommends Kinder Morgan. The Motley Fool recommends Targa Resources. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:16:00"
}