{
  "url": "https://www.nasdaq.com/article/new-strong-sell-stocks-for-september-3rd-cm1206742",
  "title": "New Strong Sell Stocks for September 3rd - Nasdaq.com",
  "text": [
    " Here are 5 stocks added to the Zacks Rank #5 (Strong Sell) List today:  Autodesk, Inc.  ADSK   is a software company. The Zacks Consensus Estimate for its current year earnings has been revised 1.4% downward over the last 30 days.  G-III Apparel Group, Ltd.  GIII     is a clothing company. The Zacks Consensus Estimate for its current year earnings has been revised 0.3% downward over the last 30 days.  International Paper Company  IP   is a paper and packaging company. The Zacks Consensus Estimate for its current year earnings has been revised 2.8% downward over the last 30 days.  Momo Inc.  MOMO     operates a mobile application meant for social networking and entertainment. The Zacks Consensus Estimate for its current year earnings has been revised 20.8% downward over the last 30 days.  Phibro Animal Health Corporation  PAHC   is a manufacturer and supplier of animal health and mineral nutrition products. The Zacks Consensus Estimate for its current year earnings has been revised more than 7.5% downward over the last 30 days. View the entire  Zacks Rank #5 List.    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Momo Inc. (MOMO): Free Stock Analysis Report   Autodesk, Inc. (ADSK): Free Stock Analysis Report   Phibro Animal Health Corporation (PAHC): Free Stock Analysis Report   International Paper Company (IP): Free Stock Analysis Report   G-III Apparel Group, LTD. (GIII): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Here are 5 stocks added to the Zacks Rank #5 (Strong Sell) List today:",
    " Autodesk, Inc.  ADSK   is a software company. The Zacks Consensus Estimate for its current year earnings has been revised 1.4% downward over the last 30 days.",
    " G-III Apparel Group, Ltd.  GIII     is a clothing company. The Zacks Consensus Estimate for its current year earnings has been revised 0.3% downward over the last 30 days.",
    " International Paper Company  IP   is a paper and packaging company. The Zacks Consensus Estimate for its current year earnings has been revised 2.8% downward over the last 30 days.",
    " Momo Inc.  MOMO     operates a mobile application meant for social networking and entertainment. The Zacks Consensus Estimate for its current year earnings has been revised 20.8% downward over the last 30 days.",
    " Phibro Animal Health Corporation  PAHC   is a manufacturer and supplier of animal health and mineral nutrition products. The Zacks Consensus Estimate for its current year earnings has been revised more than 7.5% downward over the last 30 days.",
    "View the entire  Zacks Rank #5 List. ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:00:00"
}