{
  "url": "https://www.nasdaq.com/article/what-ulta-beauty-wants-investors-to-know-cm1206879",
  "title": "What Ulta Beauty Wants Investors to Know - Nasdaq.com",
  "text": [
    "Ulta Beauty (NASDAQ: ULTA) recently shocked investors by reducing its full-year growth expectations. The spa and beauty products retailer said it sees sluggish sales and falling profitability for a second straight year, rather than the modest rebound it had predicted just a few months ago.",
    "In a conference call with analysts, CEO Mary Dillon and her team explained the reasoning behind the downgrade while noting that their positive long-term outlook hasn't changed. Below are a few highlights from that presentation.",
    "Image source: Getty Images.",
    "The Ulta Beauty team delivered another quarter of solid top line performance, gross margin expansion and double-digi t earnings growth.\r\n -- Dillon",
    "The fiscal second quarter wasn't bad. In fact, revenue rose at about the same pace as in previous quarters, with rising customer traffic supporting a 6% increase in comparable-store sales . The expanding store base allowed overall sales to rise 12% compared to 13% last quarter. Profitability was also healthy, with gross profit margin ticking up to 36.4% of sales from 36% a year ago.",
    "Yet executives noted a worsening of demand in the core cosmetics segment that makes up about half of its business and delivers its highest-margin sales. That niche didn't stabilize, as management had predicted it would, but instead fell further into negative territory. \"After several years of very strong performance,\" Dillon said, \"growth in the makeup category has been decelerating over the last two years and recently turned negative.\"",
    "The most recent cycle of innovation has just not driven [new makeup] behaviors, resulting in a soft cycle for the cosmetics category as innovation and newness brought to the market has not driven the expected growth.\r\n -- Dillon",
    "Management noted that Ulta is winning market share across its product niches, including in the core makeup category. However, the latest products released by major makeup brands aren't resonating with customers as strongly as they have in recent years. New launches aren't sparking additional application rituals and techniques, so the overall industry has started declining. Ulta is optimistic that a rebound will eventually occur in this consumer staple niche, but likely not in 2019.",
    "It has become apparent to us that we will not see the improvement we had expected in prestige makeup and we will likely also see moderation in the mass makeup sales trend. As a result, we have lowered our sales and gross margin expectations for the second half of the year.\r\n -- CFO Scott Settersten",
    "Ulta's original 2019 growth outlook assumed rebounding demand in the makeup category during the second half of the year. That boost isn't looking likely, given the current trends, so executives rolled back their guidance. Specifically, the company now sees comps rising by between 4% and 6% for the year rather than the 6% to 7% prior range. Operating margin is now on track to decline for the second straight year rather than rebound slightly.",
    "Part of that earnings shortfall is due to the demand challenges, but the rest is driven by continued aggressive investments in things like store remodels and the build-out of Ulta's e-commerce abilities. Executives see no reason to scale back on these long-term investments during what they believe is just a temporary growth issue for the wider makeup industry.",
    "10 stocks we like better than Ulta Beauty\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Ulta Beauty wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Demitrios Kalogeropoulos has no position in any of the stocks mentioned. The Motley Fool recommends Ulta Beauty. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:20:00"
}