{
  "url": "https://www.nasdaq.com/article/north-american-construction-noa-gains-but-lags-market-what-you-should-know-cm1207604",
  "title": "North American Construction (NOA) Gains But Lags Market: What You Should Know - Nasdaq.com",
  "text": [
    " North American Construction (NOA) closed at $12.25 in the latest trading session, marking a +0.66% move from the prior day. This move lagged the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%. Heading into today, shares of the heavy construction and mining services company had gained 1% over the past month, lagging the Construction sector's gain of 1.76% and outpacing the S&P 500's loss of 0.68% in that time. Wall Street will be looking for positivity from NOA as it approaches its nex t earnings  report date. The company is expected to report EPS of $0.31, up 675% from the prior-year quarter. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $124.79 million, up 91.57% from the year-ago period. For the full year, our Zacks Consensus Estimates are projecting earnings of $1.38 per share and revenue of $547.58 million, which would represent changes of +228.57% and +72.94%, respectively, from the prior year. Investors should also note any recent changes to analyst estimates for NOA. Recent revisions tend to reflect the latest near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection remained stagnant. NOA is holding a Zacks Rank of #1 (Strong Buy) right now. In terms of valuation, NOA is currently trading at a Forward P/E ratio of 8.85. For comparison, its industry has an average Forward P/E of 10.56, which means NOA is trading at a discount to the group. The Building Products - Heavy Construction industry is part of the Construction sector. This group has a Zacks Industry Rank of 156, putting it in the bottom 40% of all 250+ industries. The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. You can find more information on all of these metrics, and much more, on Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  North American Construction Group Ltd. (NOA): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "North American Construction (NOA) closed at $12.25 in the latest trading session, marking a +0.66% move from the prior day. This move lagged the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%.",
    "Heading into today, shares of the heavy construction and mining services company had gained 1% over the past month, lagging the Construction sector's gain of 1.76% and outpacing the S&P 500's loss of 0.68% in that time.",
    "Wall Street will be looking for positivity from NOA as it approaches its nex t earnings  report date. The company is expected to report EPS of $0.31, up 675% from the prior-year quarter. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $124.79 million, up 91.57% from the year-ago period.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of $1.38 per share and revenue of $547.58 million, which would represent changes of +228.57% and +72.94%, respectively, from the prior year.",
    "Investors should also note any recent changes to analyst estimates for NOA. Recent revisions tend to reflect the latest near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.",
    "The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection remained stagnant. NOA is holding a Zacks Rank of #1 (Strong Buy) right now.",
    "In terms of valuation, NOA is currently trading at a Forward P/E ratio of 8.85. For comparison, its industry has an average Forward P/E of 10.56, which means NOA is trading at a discount to the group.",
    "The Building Products - Heavy Construction industry is part of the Construction sector. This group has a Zacks Industry Rank of 156, putting it in the bottom 40% of all 250+ industries.",
    "The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "You can find more information on all of these metrics, and much more, on Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:50:21"
}