{
  "url": "https://www.nasdaq.com/article/chileans-rehearse-evacuation-as-southern-volcano-rumbles-20190911-00696",
  "title": "Chileans rehearse evacuation as southern volcano rumbles - Nasdaq.com",
  "text": [
    "By Jorge Vega and Aislinn Laing",
    "SANTIAGO, Sept 11 (Reuters) - Chilean authorities in the country's south have begun rehearsing evacuation plans amid concern an active volcano could potentially erupt within \"days or weeks.\" ",
    "Volcano Villarrica, near the popular tourist resort of Pucon around 750 km (460 miles) south of the capital Santiago, was upgraded to an \"amber alert,\" after it began rumbling and hurling lava into the air late on Tuesday. The amber alert by the National Geology and Mining Service (SERNAGEOMIN) implies a \"significant\" increase in activity.",
    "\"What we have observed in recent days is a significant increase in its activity,\" he told Reuters TV on Tuesday. \"A probable scenario is that this results in a major eruption.\" ",
    "Chile has the second-largest and most active volcanic chain in the world, behind Indonesia.",
    "One of South America's most active volcanoes, Villarica has a 200 metre-wide open crater and last erupted in 2015, sparking a mass evacuation but ultimately no injuries.",
    "A second volcanic complex, the Nevados de Chillan, 230 miles north, has also been placed on amber alert after geologists reported an uptick in activity. This one might take \"months\" to erupt, according to SERNAGEOMIN's Amigo.   ",
    "Residents and visitors around Pucon have been urged by the authorities not to approach within two kilometres of the volcanoes' peaks. The dangers include potentially deadly mud, rock and lava flows, SERNAGEOMIN said.",
    "Managers of the town's ski centre on the slope of Villarrica, which attracts thousands of visitors each year, met with government, army and police officials on Tuesday to revise evacuation plans.",
    "Pucon's mayor, Carlos Barra, told El Mercurio newspaper that since late Tuesday, volcanic activity had virtually ceased and an estimated 50,000 tourists headed to the area for Chile's annual independence celebration holidays should not be alarmed.",
    "\"This is a city prepared for this type of event, we have everything signposted, meeting points, good roads, they can come with confidence,\" he said."
  ],
  "published_datetime": "2019-09-11 03:19:00"
}