{
  "url": "https://www.nasdaq.com/article/why-metlife-met-is-a-great-dividend-stock-right-now-cm1210467",
  "title": "Why MetLife (MET) is a Great Dividend Stock Right Now - Nasdaq.com",
  "text": [
    " Whether it's through stocks, bonds, ETFs, or other types of securities, all investors love seeing their portfolios score big returns. But for income investors, generating consistent cash flow from each of your liquid investments is your primary focus. Cash flow can come from bond interest, interest from other types of investments, and of course, dividends. A dividend is that coveted distribution of a company's earnings paid out to shareholders, and investors often view it by its dividend yield, a metric that measures the dividend as a percent of the current stock price. Many academic studies show tha t dividends  make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.  MetLife in Focus  Based in New York, MetLife (MET) is in the Finance sector, and so far this year, shares have seen a price change of 15.49%. The insurer is currently shelling out a dividend of $0.44 per share, with a dividend yield of 3.71%. This compares to the Insurance - Multi line industry's yield of 2.15% and the S&P 500's yield of 1.9%. Taking a look at the company's dividend growth, its current annualized dividend of $1.76 is up 6% from last year. Over the last 5 years, MetLife has increased its dividend 4 times on a year-over-year basis for an average annual increase of 4.28%. Looking ahead, future dividend growth will be dependent on earnings growth and payout ratio, which is the proportion of a company's annual earnings per share that it pays out as a dividend. MetLife's current payout ratio is 31%, meaning it paid out 31% of its trailing 12-month EPS as dividend. Earnings growth looks solid for MET for this fiscal year. The Zacks Consensus Estimate for 2019 is $5.65 per share, representing a year-over-year earnings growth rate of 4.82%.  Bottom Line  Investors like dividends for many reasons; they greatly improve stock investing profits, decrease overall portfolio risk, and carry tax advantages, among others. However, not all companies offer a quarterly payout. High-growth firms or tech start-ups, for example, rarely provide their shareholders a dividend, while larger, more established companies that have more secure profits are often seen as the best dividend options. Income investors must be conscious of the fact that high-yielding stocks tend to struggle during periods of rising interest rates. That said, they can take comfort from the fact that MET is not only an attractive dividend play, but also represents a compelling investment opportunity with a Zacks Rank of #2 (Buy).   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  MetLife, Inc. (MET): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Whether it's through stocks, bonds, ETFs, or other types of securities, all investors love seeing their portfolios score big returns. But for income investors, generating consistent cash flow from each of your liquid investments is your primary focus.",
    "Cash flow can come from bond interest, interest from other types of investments, and of course, dividends. A dividend is that coveted distribution of a company's earnings paid out to shareholders, and investors often view it by its dividend yield, a metric that measures the dividend as a percent of the current stock price. Many academic studies show tha t dividends  make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.",
    " MetLife in Focus ",
    "Based in New York, MetLife (MET) is in the Finance sector, and so far this year, shares have seen a price change of 15.49%. The insurer is currently shelling out a dividend of $0.44 per share, with a dividend yield of 3.71%. This compares to the Insurance - Multi line industry's yield of 2.15% and the S&P 500's yield of 1.9%.",
    "Taking a look at the company's dividend growth, its current annualized dividend of $1.76 is up 6% from last year. Over the last 5 years, MetLife has increased its dividend 4 times on a year-over-year basis for an average annual increase of 4.28%. Looking ahead, future dividend growth will be dependent on earnings growth and payout ratio, which is the proportion of a company's annual earnings per share that it pays out as a dividend. MetLife's current payout ratio is 31%, meaning it paid out 31% of its trailing 12-month EPS as dividend.",
    "Earnings growth looks solid for MET for this fiscal year. The Zacks Consensus Estimate for 2019 is $5.65 per share, representing a year-over-year earnings growth rate of 4.82%.",
    " Bottom Line ",
    "Investors like dividends for many reasons; they greatly improve stock investing profits, decrease overall portfolio risk, and carry tax advantages, among others. However, not all companies offer a quarterly payout.",
    "High-growth firms or tech start-ups, for example, rarely provide their shareholders a dividend, while larger, more established companies that have more secure profits are often seen as the best dividend options. Income investors must be conscious of the fact that high-yielding stocks tend to struggle during periods of rising interest rates. That said, they can take comfort from the fact that MET is not only an attractive dividend play, but also represents a compelling investment opportunity with a Zacks Rank of #2 (Buy).",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:15:12"
}