{
  "url": "https://www.nasdaq.com/article/chipotle-lawsuit-2019-cmg-faces-alleged-labor-law-violations-cm1210724",
  "title": "Chipotle Lawsuit 2019: CMG Faces Alleged Labor Law Violations - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "A Chipotle lawsuit 2019 has the company facing allegations of violating labor laws.",
    "The lawsuit that Chipotle (NYSE: CMG ) is dealing with comes from New York City. It claims that the fast food company isn't following the city's Fair Workweek Law that went into place in November 2017. This law requires companies to give workers estimates of schedules two weeks in advance.",
    "Other parts of the Chipotle lawsuit 2019 claims that the company hasn't been meeting other requirements from the Fair Workweek Law. This includes not having a legal sick time policy and a lack of paying premiums for closings, as well as last-minute schedule changes. The city is seeking $1 million , and other forms of restitution, from CMG in the lawsuit.",
    "Chipotle's response to the lawsuit is that it has been working with NYC to comply with the Fair Workweek Law. The company says it doesn't believe there was need for the lawsuit and that it will continue to work with the city, reports CNBC .",
    "\"This is a very large corporation that should have known better - that does know better, because this investigation has been going on since early 2018, and still, as of today, Chipotle has not fixed their practices,\" Lorelei Salas, the Department of Consumer Affairs' Commissioner for Consumer and Worker Protection, told The New York Times .",
    "CMG stock was down 6% on Tuesday following news of the Chipotle lawsuit 2019. The stock is currently up almost 1% as of noon Wednesday.",
    "As of this writing, William White did not hold a position in any of the aforementioned securities.",
    "The post Chipotle Lawsuit 2019: CMG Faces Alleged Labor Law Violations appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 12:02:28"
}