{
  "url": "https://www.nasdaq.com/article/tanzanias-gold-exports-rise-23-in-year-to-july-20190905-00097",
  "title": "Tanzania's gold exports rise 23% in year to July - Nasdaq.com",
  "text": [
    "DAR ES SALAAM, Sept 5 (Reuters) - Tanzania's gold exports rose 23% in the year to July, its central bank said on Thursday.",
    "Africa's fourth-biggest gold producer after South Africa, Ghana and Mali hopes to see a rebound in its mining sector after a tax crackdown and overhaul of its mining code in 2017 spooked foreign investors.",
    "\"The value of gold exported (in the year ending July 31) ... grew at an annual rate of 23.3% to $1.783 billion because of an increase in export volume,\" the (central) Bank of Tanzania in its latest monthly economic report.",
    "The country's gold exports in the previous year amounted to $1.45 billion.",
    "Gold accounts for more than 40 percent of the East African nation's non-traditional exports.",
    "Tanzania exported gold worth $1.549 billion in the 2018 calendar year, up slightly from $1.541 billion a year earlier, central bank data shows.",
    "Tanzanian President John Magufuli, who took office in late 2015, is pushing for more revenue from the mining sector, which is a relatively small contributor to national output.",
    "In 2017, the government passed laws which the industry complained would be costly and onerous.",
    "Among other things, the laws hike taxes on mineral exports, mandate a higher government stake in some mining operations and force the construction of local smelters, a move some companies said was uneconomic.",
    "Magufuli also ordered the central bank in January to start buying the country's gold to curb smuggling and build reserves to stabilise the local currency.",
    "Tanzania has also been locked in a prolonged conflict with London-listed Acacia Mining  after authorities banned exports of gold and copper concentrates and accused the miner of tax evasion, which it denies.",
    "A buyout proposal for Acacia from majority shareholder Barrick Gold Corp  is expected to reset strained relations with the government, according to analysts."
  ],
  "published_datetime": "2019-09-05 03:18:00"
}