{
  "url": "https://www.nasdaq.com/article/lands-end-inc-le-q2-2019-earnings-call-transcript-cm1208152",
  "title": "Lands' End Inc (LE) Q2 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   Lands' End Inc    (NASDAQ: LE)        Q2 2019 Earnings Call       Sep 5, 2019 ,   8:30 a.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Good day, ladies and gentlemen. And welcome to the Lands' End   Second Quarter 2019 Earnings Conference Call. At this time, all   participants are in a listen-only mode. Later, we will conduct a   question-and-answer session, and instructions will follow at that   time. [Operator Instructions] As a reminder, this conference call is   being recorded. I would now like to introduce your host for today's conference   Mr. Bernie McCracken, Chief Accounting Officer. Sir, you may   begin.  Bernie McCracken    --   Chief Accounting Officer  Good morning. And thank you for joining the Lands' End   Earnings Call for a discussion of our second quarter fiscal 2019   results, which we released this morning and can be found on our   website landsend.com. On the call today, you will hear from   Jerome Griffith, our Chief Executive Officer and President; and   Jim Gooch, our Chief Operating Officer and Chief Financial   Officer. After the Company's prepared remarks, we will conduct a   question-and-answer session. Please also note that the   information we're about to discuss includes forward-looking   statements. Such statements involve risks and uncertainties. The Company's actual results could differ materially from   those discussed on this call. Factors that could contribute to   such differences, include but are not limited to those items   noted and included in the Company's SEC filings, including our   Annual Report on Form 10-K and Quarterly Reports on Form   10-Q. The forward-looking information that is provided by the   Company on this call represents the Company's outlook as of   today. And we do not undertake any obligation to update   forward-looking statements made by us. Subsequent events and   developments may cause the Company's outlook to change. During this call, we'll be referring to non-GAAP measures.   These non-GAAP measures are not prepared in accordance with   generally accepted accounting principles. A reconciliation of   non-GAAP financial measures to the most directly comparable GAAP   measures can be found in our earnings release issued earlier   today. A copy of which is posted in the Investor Relations   section of our website at landsend.com. With that, I will turn the call over to Jerome Griffith.  Jerome Griffith    --   Chief Executive Officer and President  Thank you, Bernie. Good morning, and thank you for joining us   for a review of our second quarter financial and business   results. We were pleased to have delivered sales and net income   above our expectations, and adjusted EBITDA at the high end of   our range, illustrating the strong progress we are making across   our strategic initiatives. Based on our results and confidence in   the second half, we are reiterating our revenue and increasing   our EPS guidance for fiscal 2019. Our sales increased 5.5%, when adjusted for Sears closures and   the lapping of the Delta launch. This growth was led by the   ongoing momentum in our global e-commerce business, which grew   over 7%. In addition, our US company operated retail stores once   again delivered strong comparable sales growth at 7.5%. As we've discussed in the past, our growth strategies are   centered on getting the product right, operating as a digitally   led company, executing a uni-channel strategy and improving   business processes and infrastructure. The progress we're making   across our numerous strategic initiatives continues to put us on   track to achieve our stated long term objectives of $1.8 billion   to $2 billion in revenue, and high single digit EBITDA margin for   fiscal 2022. Our mission is to deepen our engagement with our core   customers and attract new customers to Lands' End by delivering   product with a purpose that offers great value to our customer.   We believe our growth will be driven by the continued   optimization of our product assortment, as we hone our key item   strategy in our destination categories of swim, outerwear, knits   and bottoms. We are driving this product strategy through four   main objectives that we articulate as own the water, own the   weather, layers, layers, layers, and we fit every body. Our data science department continues to improve our ability   to leverage product interest data and product purchase data,   which is then applied by our design and merchandising   organization to better align our assortment with customer demand   and create more productive inventory. For the second quarter, we were particularly pleased with our   bottoms and knit businesses in both women's and men's, as we   continue to use our data to optimize the assortment mix for our   customers. A good illustration of this is in our shorts business,   where we saw a big opportunity to expand our offerings with new   fabrication. Including No Iron Chino shorts and new linen   silhouette, in addition to having more colors and patterns. Our   bottoms business also benefited from our hard work around   improving our fit as we have learned that providing consistent   fit gives our customers confidence to buy online and garners   loyalty. In our Denim business, we added 360-degree fabric and   shaping along with a variety of washes. Our knit top sell   strength across tanks, tees and polos as well as novelty. We are extremely pleased with the strong response to the   enhancements we have made in our merchandising assortments, as we   continue to see customer shopping patterns, favorite key items   and colors versus full collection. Swimwear saw a slow start to   the season, but picked up later in the quarter and continued into   the third quarter as we've had a better in-stock position as   compared to last year. Overall, we will continue to shift the   assortment to more closely reflect our customer preferences,   which you will see more fully in our fall season. Looking ahead, we're excited to be providing an expanded   outerwear assortment by adding more variety to our fleece,   packable down coats and rainwater offerings. We believe that   this, combined with updated looks to our knits and bottoms   assortment to ensure our customers enjoy newness, will continue   to drive strong results. We also see an opportunity moving   forward in swim. The insights gained this quarter in terms of   silhouette styles and features position us to strengthen our swim   offerings moving forward by increasing our assortment of best   sellers and eliminating less popular items. Regarding our distribution strategy, our goal is to offer our   product wherever, however, and whenever our customer wants to   shop, whether digitally or in brick and mortar stores. With our   heritage of selling clothing online, we continue to lean heavily   into e-commerce, which represents over 90% of our   direct-to-consumer sales. We are driving new customer   acquisitions through digital strategies, investing in digital   search to show up when our customers purchase intent is high and   the results reinforce that we are making the right steps with our   buyer file growing in the mid single digits and new customer   acquisition growing in the high teens last quarter through   algorithmic targeting of key items to relevant lookalike   audiences. During the quarter, we saw positive results from our continued   efforts to capture the digital customer, what she is searching   for what she needs. We know our customer has a short   consideration to purchase cycle. She is shopping because she   wants to buy. So we win when we show up in her search results. As   we have seen, our customer who initiated the search is three   times more likely to purchase than a customer who does not   search. In Q3, we will anniversary the highly successful   implementation of our proprietary internal search engine, which   fully recoup its cost within the first quarter of this. And we're   guided by what the search data tells us. I'll share two quick   examples to demonstrate these efforts. First, our internal and external search data from 2018 made it   clear that we had an opportunity to sell traditional winter goods   such as turtlenecks, cashmere and flannel, well into the spring.   We offer these traditionally seasonal products to our customers   later in the year. While the target audience is much smaller base   than the peak season for these items, we sold several million   dollars of counter seasonal merchandise in the second quarter.   We're still testing, are always on assortment. Second, listening to the digital signals our customer sent. We   noted that there would be the opportunity to invest more in warm   weather goods such as shorts, tanks and tees in the June, July   summer sale time period. Categories such as women shorts saw a   triple digit lift in demand during that time period. A clear   indication of buy now, wear now is increasingly how the customer   chooses to shop. This past year, we also rode out machine learning-based   sorting algorithms. This sorting capability is particularly   helpful for customers who prefer to browse rather than search. As   mobile traffic continues to grow, we understand just how   important a personalized product assortment has become. And we   believe that our algorithms, which we continue to fine tune, are   contributing to our high conversion rate. Since we are not restricted by a store footprint, we can give   our digital customer her favorite key Lands' End items whenever   she's ready to purchase. Our efforts around elevating, digital   focus resulted in half of our traffic now engaging in Lands' End   on the smartphone. As a result, we continue to invest in our   customers smartphone experience, striving for a fast, easy, fun   shopping trip, start to finish that will inspire them to come   back again and again. We believe these investments in mobile are   paying off as we continue to see conversion move along the   positive trajectory, countered to everything we hear about mobile   conversion challenges within the retail industry. Currently, our mobile conversion is over 2.5 times the   industry average rate of approximately 1.8%. We also know that   our digital customers want to shop our brand in retail stores,   which is illustrated by the 7.5% comp growth we saw in our   company operated stores. We're very pleased with our retail   strategy as our stores showcase our assortment, offer exceptional   customer service through highly knowledgeable sales associates   and enable us to further engage our customer with the brand. In addition, our in-store kiosk provides our customers with a   gateway to our entire assortment, and our associates are able to   recommend selections that are now available in our stores. As an   example, we have seen a significant increase in online sales   taking place in our stores during this back to school season.   Students can try on their school uniform for fit and comfort,   then order the appropriate style and size with their school's   logo from our in-store kiosk. And every online purchase made   in-store is shipped free of charge from our Wisconsin   distribution center. Our stores also represent a powerful brand marketing tool and   we remain very disciplined in how we expand our footprint to   leverage our strong brand and heritage. During the second   quarter, we opened two stores to end the quarter with 21 US   stores. For the remainder of fiscal 2019, we plan to open four   more stores to end the year at 25 US locations. By the end of '22, we are currently targeting approximately 70   stores in select locations with store economics that generate   attractive four wall contribution margins. Our Outfitters   business is a key component of our revenue growth strategy, while   this business generates some sales volatility due to periodic   launches of major programs, it represents a significant long term   growth driver for our company. We remain on track with the American Airlines launch scheduled   for the fourth quarter, which will further illustrate our   capabilities in the uniform business. We will continue to   leverage these and other successful relationships as we strive to   grow this business with new and existing partners. Lastly, I will   touch on our plans to improve profitability. We continue to   believe that as our top line grows, we can scale our SG&A   spend appropriately, and accelerate our EBITDA growth to meet our   long term EBITDA margin goal. We also see opportunities to reduce   overall costs to the benefits of the IT investments we're making   now in our order management and warehouse management projects,   and through the realization of greater business process   efficiencies. Jim will discuss this in more detail. We also believe that we can realize greater cost savings by   directly managing more of our material spent. To this end, as we   announced earlier today, we will be opening our own buying office   in Hong Kong later this year. We've hired an industry veteran to   lead the office, and are excited to move forward. As you may   recall, since our separation from Sears, we have utilized the   Sears affiliate to provide buying agent services. Our current   contract runs through June 2020, and we plan to be fully   transitioned by the spring 2020 season. In conclusion, we remain focused on executing our strategic   initiatives. We're making strides, growing our business and   improving our results. We're excited about our continued growth   in our e-commerce business, continued improvement in our buyer   file on NCA, and our positive comp store sales in our company   operated stores. With that, I'll turn it over to Jim to review our financial   performance and review our outlook for the third quarter and the   full year.  James Gooch    --   Executive Vice President, Chief Operating Officer, Chief   Financial Officer and Treasurer  Thank you, Jerome, and good morning. As Jerome mentioned,   we're pleased to have delivered sales and net income above our   expectations and adjusted EBITDA at the high end of our range,   despite gross margin pressure. For the second quarter, total   company revenue decreased 3.1% to $298.3 million compared to   $307.9 million in the same period last year. The decline was due   to operating 110 fewer Lands' End Shops at Sears and counting the   impact of Delta Airlines launch from last year. After adjusting for both, our revenue increased 5.5%. We saw   continued strength in our global e-commerce business, which   increased 7.3%, as well as significant growth in our company   operated stores. We saw solid performance across most of our   categories, particularly with strength in knits and bottoms, as   we continue to focus on delivering relevant, high quality product   at a great value to our customers. Aligning with revenue, total buyers increase mid single digits   with new customers up in the high teens. Online traffic and   conversion increased in the second quarter, but in the highly   promotional environment, average order value did decline   slightly. In our retail business, as expected, with a significant   number of Sears store closures, sales decreased from $31.3   million to $14.2 million. We ended the quarter with 37 Shops at Sears, all of which have   leases expiring by the end of this year. We continue to see   strong performance in our company operated stores, with a 7.5%   comp store sales increase for the quarter. We also opened an   additional two new stores and ended the quarter with 21 US   company operated stores. We remain very pleased with the   performance of our new stores, and plan to open an additional   four stores this year. Within Outfitters, our sales declined $7.4   million as the Delta business was down due that copying of the   final portion of the launch that were shipped in the prior year   second quarter. This decrease was partially offset by growth in our school   uniform business. Looking ahead, we're making continued progress   on our American Airlines launch, which is still being estimated   to be between $40 million and $50 million, with the majority   expected to occur in the fourth quarter of 2019. Gross margin in   second quarter was down approximately 110 basis points to 43.3%.   The gross margin decline was primarily related to pricing actions   taken in response to additional promotional activity seen   throughout the industry. After a slow start in May, we saw a sequential improvement in   June and again in July, which enabled us to exceed our revenue   expectations and achieve our profitability plan for the quarter   despite the margin pressure. Based on our current trends, we do   expect gross margin expansion to resume in the third quarter.   Selling and administrative expenses decreased by $6.8 million to   $122.3 million, primarily due to the decrease in the number of   Sears locations and continued leverage of our cost structure. As   a percentage of revenue, we had 90 basis points of improvement as   we continue to efficiently manage our variable cost structure,   leading to improved scale as we grow the business. Income tax as a benefit of $3.2 million for the quarter,   driven by the favorable treatment of certain foreign entities.   Net loss for the quarter was $3 million or $0.09 per share   compared to a net loss of $5.3 million or $0.16 per share last   year. In addition to the GAAP measures that we outlined above,   adjusted EBITDA is an important profitability measure that we use   to manage our business internally. For the quarter, adjusted   EBITDA was $6.8 million, which was at the high end of our   guidance range of $4 million to $7 million. Turning to the balance sheet, total cash at the end of the   quarter was $82.6 million compared to $194.4 million last year.   The lower cash balance is a result of voluntary prepayment of   $100 million of our term loan. Net long-term debt decreased to   $380.6 million compared to $484.4 million last year. Inventories   at the end of the quarter were $405.8 million, that's up $56.2   million compared to the end of the second quarter last year. As   you will recall, our efforts last year to tightly manage   inventory after a short and critical end of season merchandise.   So this year we built our inventory to improve our in-stock   levels heading into the spring summer selling season. In addition, we accelerate shipments to get in front of tariff   increases, and to also help mitigate delays that could   potentially arise from port congestion. We're very comfortable   with our current inventory levels. They are seasonally   appropriate, and we have historically low-aged merchandise. Now,   I'd like to spend a few minutes discussing our IT initiatives.   We've completed our final portion of our ERP roll-out, and we're   now turning our attention to the implementation of our Enterprise   Order Management system. This will provide us with real-time global visibility in our   inventory, enabling us to increase our inventory productivity as   we improve our ability to offer and fulfill orders through   additional internal and external channels. This should result in   opportunities for both top line growth and working capital   improvement. We've also begun to scope out our Warehouse   Management System, which would enable us to optimize our package   and shipping cost structure, which in turn would drive labor   productivity through process improvements and performance   management. Before turning to guidance, I want to take a moment to update   you on the recent tariff news. The tariffs most recently   announced analysts for are expected to have a gross impact of $8   million to $10 million in the current fiscal year. We anticipate   being able to offset approximately 50% of these tariffs through   negotiating pricing with our vendor base, passing through some of   the costs to our customers, and looking at other savings   opportunities in our business. Looking ahead to 2020, we   anticipate further reducing our exposure to China to   approximately 20% of our total shipments. As a result, we anticipate our ongoing then [phonetic] impact   from the increased tariffs to be approximately $7 million to $9   million per year. Turning to our guidance, for the full year, we   continue to expect net revenue to be between $1.45 billion and   $1.5 billion, driven by growth in our direct-to-consumer and   Outfitters business, combined with nine new store openings. This   will be partially offset by the reduction of our Lands' End Shops   at Sears locations. We are increasing our net income outlook to be between $12   million and $17 million, and diluted earnings per share to be   between $0.37 and $0.52. And that's including the tariff impact   that I mentioned earlier. We expect to partially offset these   additional costs by reducing the incremental marketing   investments that we planned for the second half of 2019. We now   expect to spend an incremental $8 million to $10 million as   compared to our initial expectations of $10 million to $15   million. These investments will be focused on driving brand   awareness and new customer acquisition. We are maintaining our adjusted EBITDA outlook of $70 million   to $80 million. Finally, we expect capex of approximately $40   million, driven by our new Enterprise Order Management system and   additional store openings. For the third quarter, we expect net   revenue to be between $345 million and $355 million, driven by   continued growth in our e-commerce business, offset by the   reduction of 89 Shops at Sears compared to last year. We expect   net income of $1.5 million to $4 million and diluted earnings per   share to be between $0.05 and $0.12. We expect adjusted EBITDA to   be in the range of $17 million to $20 million. And with that, we'll open up the call for questions.  Operator    --   Executive Vice President, Chief Operating Officer, Chief   Financial Officer and Treasurer  Thank you. [Operator Instructions] Our first question comes   from Alex Fuhrman with Craig-Hallum Capital. Your line is now   open.  Alex Fuhrman    --   Analyst  Hey, guys. Thanks for taking my question. And congratulations   on a nice quarter here. I wanted to ask about the guidance. Just   looking at the results of this year, EBITDA was down good amount   here in Q1. It was down slightly in Q2. Looks like based on the   guidance, it should be up a little bit here in Q3, and then the   implication here in the full year guidance is that Q4 EBITDA   should be up quite a bit more than that. So just kind of trying   to understand, is that just the natural continuation of the   better trends you've seen and the increases in the buyer file   throughout the year? And just trying to dissect how much of that,   which is just that natural improvement that you've been seeing   versus what you're expecting to see from the American Airlines   launch coming here in the fourth quarter?  Jerome Griffith    --   Chief Executive Officer and President  Thanks, Alex. Yeah, I think it's a combination of both of   those things. I think you have to remember we have the improving   trends. We expect to see those continue into the back half. And   then in the first half, we're comping the Delta Airlines launch   and then as you mentioned in the fourth quarter, we'll pick up   the impact from the American Airlines launch. So the combination   of all those things I think support our guidance.  Alex Fuhrman    --   Analyst  Okay. And then just thinking about the swim business, I mean,   it sounds like that got off to a little bit of a slower start   than you'd expected and then rebounded nicely throughout the   season. Do you know anything in particular that was driving that   slow start? And, you know, curious, what were you able to do to   course correct there and get that business back on track?  James Gooch    --   Executive Vice President, Chief Operating Officer, Chief   Financial Officer and Treasurer  Hi. How you are doing? Yes, swimsuit was sort of a little bit   slow in the quarter. Quarter 1 was not terrible. May was really   not a great month, partially due to what we had one print that   didn't resonate very well with consumers. But then back into June   and then July, we saw swim pick up and it continued to pick up   into August. So it was really just a slow start to the quarter,   not too much of any changes that we were able to make because we   were bought already but just consumer demand picked up as summer   went on.  Alex Fuhrman    --   Analyst  Okay, that's helpful. And then just thinking about, you know,   your other big seasonal categories coming up here in the back   half. Outerwear, you know has always been a big category for you.   Do you feel you have the right inventory levels for that? And is   it, you know, perhaps the expectation that consumers might be   purchasing a little bit closer to their actual needs therefore,   for outerwear as well?  James Gooch    --   Executive Vice President, Chief Operating Officer, Chief   Financial Officer and Treasurer  Yeah. If you think back to last year, our key item strategy   worked extremely well. We did much better in Q3, Q4 in 2018 than   2017. And that really chalked that up to a lot of the key items   that we had. Flannel shirts, cashmere sweaters, outerwear and as   we go into the back part of 2019, our strategy is really the   same. It's our key items that the customers come and look for. So   we think for -- we're bought really well for the holiday season.   We've put plans in place, which resonate what we've learned in   the last year. And we feel pretty good about it so far.  Alex Fuhrman    --   Analyst  Well, that's great. Thank you very much. And look forward to   seeing your holiday assortments.  Jerome Griffith    --   Chief Executive Officer and President  Thanks, Alex.  James Gooch    --   Executive Vice President, Chief Operating Officer, Chief   Financial Officer and Treasurer  Thanks, Alex. Will talk to you.  Operator    --   Executive Vice President, Chief Operating Officer, Chief   Financial Officer and Treasurer  Thank you. [Operator Instructions] This does conclude today's   question-and-answer session. [Operator Closing Remarks] Questions and Answers:  Duration: 25 minutes  Call participants:  Bernie McCracken    --   Chief Accounting Officer   Jerome Griffith    --   Chief Executive Officer and President   James Gooch    --   Executive Vice President, Chief Operating Officer, Chief   Financial Officer and Treasurer   Alex Fuhrman    --   Craig-Hallum Capital Group LLC -- Analyst   More LE analysis   All earnings call transcripts        10 stocks we like better than Lands' End     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Lands'   End wasn't one of them! That's right -- they think   these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " Lands' End Inc    (NASDAQ: LE)        Q2 2019 Earnings Call       Sep 5, 2019 ,   8:30 a.m. ET ",
    " Operator ",
    "Good day, ladies and gentlemen. And welcome to the Lands' End   Second Quarter 2019 Earnings Conference Call. At this time, all   participants are in a listen-only mode. Later, we will conduct a   question-and-answer session, and instructions will follow at that   time.",
    "[Operator Instructions] As a reminder, this conference call is   being recorded.",
    "I would now like to introduce your host for today's conference   Mr. Bernie McCracken, Chief Accounting Officer. Sir, you may   begin.",
    " Bernie McCracken    --   Chief Accounting Officer ",
    "Good morning. And thank you for joining the Lands' End   Earnings Call for a discussion of our second quarter fiscal 2019   results, which we released this morning and can be found on our   website landsend.com. On the call today, you will hear from   Jerome Griffith, our Chief Executive Officer and President; and   Jim Gooch, our Chief Operating Officer and Chief Financial   Officer. After the Company's prepared remarks, we will conduct a   question-and-answer session. Please also note that the   information we're about to discuss includes forward-looking   statements. Such statements involve risks and uncertainties.",
    "The Company's actual results could differ materially from   those discussed on this call. Factors that could contribute to   such differences, include but are not limited to those items   noted and included in the Company's SEC filings, including our   Annual Report on Form 10-K and Quarterly Reports on Form   10-Q.",
    "The forward-looking information that is provided by the   Company on this call represents the Company's outlook as of   today. And we do not undertake any obligation to update   forward-looking statements made by us. Subsequent events and   developments may cause the Company's outlook to change.",
    "During this call, we'll be referring to non-GAAP measures.   These non-GAAP measures are not prepared in accordance with   generally accepted accounting principles. A reconciliation of   non-GAAP financial measures to the most directly comparable GAAP   measures can be found in our earnings release issued earlier   today. A copy of which is posted in the Investor Relations   section of our website at landsend.com.",
    "With that, I will turn the call over to Jerome Griffith.",
    " Jerome Griffith    --   Chief Executive Officer and President ",
    "Thank you, Bernie. Good morning, and thank you for joining us   for a review of our second quarter financial and business   results. We were pleased to have delivered sales and net income   above our expectations, and adjusted EBITDA at the high end of   our range, illustrating the strong progress we are making across   our strategic initiatives. Based on our results and confidence in   the second half, we are reiterating our revenue and increasing   our EPS guidance for fiscal 2019.",
    "Our sales increased 5.5%, when adjusted for Sears closures and   the lapping of the Delta launch. This growth was led by the   ongoing momentum in our global e-commerce business, which grew   over 7%. In addition, our US company operated retail stores once   again delivered strong comparable sales growth at 7.5%.",
    "As we've discussed in the past, our growth strategies are   centered on getting the product right, operating as a digitally   led company, executing a uni-channel strategy and improving   business processes and infrastructure. The progress we're making   across our numerous strategic initiatives continues to put us on   track to achieve our stated long term objectives of $1.8 billion   to $2 billion in revenue, and high single digit EBITDA margin for   fiscal 2022.",
    "Our mission is to deepen our engagement with our core   customers and attract new customers to Lands' End by delivering   product with a purpose that offers great value to our customer.   We believe our growth will be driven by the continued   optimization of our product assortment, as we hone our key item   strategy in our destination categories of swim, outerwear, knits   and bottoms. We are driving this product strategy through four   main objectives that we articulate as own the water, own the   weather, layers, layers, layers, and we fit every body.",
    "Our data science department continues to improve our ability   to leverage product interest data and product purchase data,   which is then applied by our design and merchandising   organization to better align our assortment with customer demand   and create more productive inventory.",
    "For the second quarter, we were particularly pleased with our   bottoms and knit businesses in both women's and men's, as we   continue to use our data to optimize the assortment mix for our   customers. A good illustration of this is in our shorts business,   where we saw a big opportunity to expand our offerings with new   fabrication. Including No Iron Chino shorts and new linen   silhouette, in addition to having more colors and patterns. Our   bottoms business also benefited from our hard work around   improving our fit as we have learned that providing consistent   fit gives our customers confidence to buy online and garners   loyalty. In our Denim business, we added 360-degree fabric and   shaping along with a variety of washes. Our knit top sell   strength across tanks, tees and polos as well as novelty.",
    "We are extremely pleased with the strong response to the   enhancements we have made in our merchandising assortments, as we   continue to see customer shopping patterns, favorite key items   and colors versus full collection. Swimwear saw a slow start to   the season, but picked up later in the quarter and continued into   the third quarter as we've had a better in-stock position as   compared to last year. Overall, we will continue to shift the   assortment to more closely reflect our customer preferences,   which you will see more fully in our fall season.",
    "Looking ahead, we're excited to be providing an expanded   outerwear assortment by adding more variety to our fleece,   packable down coats and rainwater offerings. We believe that   this, combined with updated looks to our knits and bottoms   assortment to ensure our customers enjoy newness, will continue   to drive strong results. We also see an opportunity moving   forward in swim. The insights gained this quarter in terms of   silhouette styles and features position us to strengthen our swim   offerings moving forward by increasing our assortment of best   sellers and eliminating less popular items.",
    "Regarding our distribution strategy, our goal is to offer our   product wherever, however, and whenever our customer wants to   shop, whether digitally or in brick and mortar stores. With our   heritage of selling clothing online, we continue to lean heavily   into e-commerce, which represents over 90% of our   direct-to-consumer sales. We are driving new customer   acquisitions through digital strategies, investing in digital   search to show up when our customers purchase intent is high and   the results reinforce that we are making the right steps with our   buyer file growing in the mid single digits and new customer   acquisition growing in the high teens last quarter through   algorithmic targeting of key items to relevant lookalike   audiences.",
    "During the quarter, we saw positive results from our continued   efforts to capture the digital customer, what she is searching   for what she needs. We know our customer has a short   consideration to purchase cycle. She is shopping because she   wants to buy. So we win when we show up in her search results. As   we have seen, our customer who initiated the search is three   times more likely to purchase than a customer who does not   search. In Q3, we will anniversary the highly successful   implementation of our proprietary internal search engine, which   fully recoup its cost within the first quarter of this. And we're   guided by what the search data tells us. I'll share two quick   examples to demonstrate these efforts.",
    "First, our internal and external search data from 2018 made it   clear that we had an opportunity to sell traditional winter goods   such as turtlenecks, cashmere and flannel, well into the spring.   We offer these traditionally seasonal products to our customers   later in the year. While the target audience is much smaller base   than the peak season for these items, we sold several million   dollars of counter seasonal merchandise in the second quarter.   We're still testing, are always on assortment.",
    "Second, listening to the digital signals our customer sent. We   noted that there would be the opportunity to invest more in warm   weather goods such as shorts, tanks and tees in the June, July   summer sale time period. Categories such as women shorts saw a   triple digit lift in demand during that time period. A clear   indication of buy now, wear now is increasingly how the customer   chooses to shop.",
    "This past year, we also rode out machine learning-based   sorting algorithms. This sorting capability is particularly   helpful for customers who prefer to browse rather than search. As   mobile traffic continues to grow, we understand just how   important a personalized product assortment has become. And we   believe that our algorithms, which we continue to fine tune, are   contributing to our high conversion rate.",
    "Since we are not restricted by a store footprint, we can give   our digital customer her favorite key Lands' End items whenever   she's ready to purchase. Our efforts around elevating, digital   focus resulted in half of our traffic now engaging in Lands' End   on the smartphone. As a result, we continue to invest in our   customers smartphone experience, striving for a fast, easy, fun   shopping trip, start to finish that will inspire them to come   back again and again. We believe these investments in mobile are   paying off as we continue to see conversion move along the   positive trajectory, countered to everything we hear about mobile   conversion challenges within the retail industry.",
    "Currently, our mobile conversion is over 2.5 times the   industry average rate of approximately 1.8%. We also know that   our digital customers want to shop our brand in retail stores,   which is illustrated by the 7.5% comp growth we saw in our   company operated stores. We're very pleased with our retail   strategy as our stores showcase our assortment, offer exceptional   customer service through highly knowledgeable sales associates   and enable us to further engage our customer with the brand.",
    "In addition, our in-store kiosk provides our customers with a   gateway to our entire assortment, and our associates are able to   recommend selections that are now available in our stores. As an   example, we have seen a significant increase in online sales   taking place in our stores during this back to school season.   Students can try on their school uniform for fit and comfort,   then order the appropriate style and size with their school's   logo from our in-store kiosk. And every online purchase made   in-store is shipped free of charge from our Wisconsin   distribution center.",
    "Our stores also represent a powerful brand marketing tool and   we remain very disciplined in how we expand our footprint to   leverage our strong brand and heritage. During the second   quarter, we opened two stores to end the quarter with 21 US   stores. For the remainder of fiscal 2019, we plan to open four   more stores to end the year at 25 US locations.",
    "By the end of '22, we are currently targeting approximately 70   stores in select locations with store economics that generate   attractive four wall contribution margins. Our Outfitters   business is a key component of our revenue growth strategy, while   this business generates some sales volatility due to periodic   launches of major programs, it represents a significant long term   growth driver for our company.",
    "We remain on track with the American Airlines launch scheduled   for the fourth quarter, which will further illustrate our   capabilities in the uniform business. We will continue to   leverage these and other successful relationships as we strive to   grow this business with new and existing partners. Lastly, I will   touch on our plans to improve profitability. We continue to   believe that as our top line grows, we can scale our SG&A   spend appropriately, and accelerate our EBITDA growth to meet our   long term EBITDA margin goal. We also see opportunities to reduce   overall costs to the benefits of the IT investments we're making   now in our order management and warehouse management projects,   and through the realization of greater business process   efficiencies. Jim will discuss this in more detail.",
    "We also believe that we can realize greater cost savings by   directly managing more of our material spent. To this end, as we   announced earlier today, we will be opening our own buying office   in Hong Kong later this year. We've hired an industry veteran to   lead the office, and are excited to move forward. As you may   recall, since our separation from Sears, we have utilized the   Sears affiliate to provide buying agent services. Our current   contract runs through June 2020, and we plan to be fully   transitioned by the spring 2020 season.",
    "In conclusion, we remain focused on executing our strategic   initiatives. We're making strides, growing our business and   improving our results. We're excited about our continued growth   in our e-commerce business, continued improvement in our buyer   file on NCA, and our positive comp store sales in our company   operated stores.",
    "With that, I'll turn it over to Jim to review our financial   performance and review our outlook for the third quarter and the   full year.",
    " James Gooch    --   Executive Vice President, Chief Operating Officer, Chief   Financial Officer and Treasurer ",
    "Thank you, Jerome, and good morning. As Jerome mentioned,   we're pleased to have delivered sales and net income above our   expectations and adjusted EBITDA at the high end of our range,   despite gross margin pressure. For the second quarter, total   company revenue decreased 3.1% to $298.3 million compared to   $307.9 million in the same period last year. The decline was due   to operating 110 fewer Lands' End Shops at Sears and counting the   impact of Delta Airlines launch from last year.",
    "After adjusting for both, our revenue increased 5.5%. We saw   continued strength in our global e-commerce business, which   increased 7.3%, as well as significant growth in our company   operated stores. We saw solid performance across most of our   categories, particularly with strength in knits and bottoms, as   we continue to focus on delivering relevant, high quality product   at a great value to our customers.",
    "Aligning with revenue, total buyers increase mid single digits   with new customers up in the high teens. Online traffic and   conversion increased in the second quarter, but in the highly   promotional environment, average order value did decline   slightly. In our retail business, as expected, with a significant   number of Sears store closures, sales decreased from $31.3   million to $14.2 million.",
    "We ended the quarter with 37 Shops at Sears, all of which have   leases expiring by the end of this year. We continue to see   strong performance in our company operated stores, with a 7.5%   comp store sales increase for the quarter. We also opened an   additional two new stores and ended the quarter with 21 US   company operated stores. We remain very pleased with the   performance of our new stores, and plan to open an additional   four stores this year. Within Outfitters, our sales declined $7.4   million as the Delta business was down due that copying of the   final portion of the launch that were shipped in the prior year   second quarter.",
    "This decrease was partially offset by growth in our school   uniform business. Looking ahead, we're making continued progress   on our American Airlines launch, which is still being estimated   to be between $40 million and $50 million, with the majority   expected to occur in the fourth quarter of 2019. Gross margin in   second quarter was down approximately 110 basis points to 43.3%.   The gross margin decline was primarily related to pricing actions   taken in response to additional promotional activity seen   throughout the industry.",
    "After a slow start in May, we saw a sequential improvement in   June and again in July, which enabled us to exceed our revenue   expectations and achieve our profitability plan for the quarter   despite the margin pressure. Based on our current trends, we do   expect gross margin expansion to resume in the third quarter.   Selling and administrative expenses decreased by $6.8 million to   $122.3 million, primarily due to the decrease in the number of   Sears locations and continued leverage of our cost structure. As   a percentage of revenue, we had 90 basis points of improvement as   we continue to efficiently manage our variable cost structure,   leading to improved scale as we grow the business.",
    "Income tax as a benefit of $3.2 million for the quarter,   driven by the favorable treatment of certain foreign entities.   Net loss for the quarter was $3 million or $0.09 per share   compared to a net loss of $5.3 million or $0.16 per share last   year. In addition to the GAAP measures that we outlined above,   adjusted EBITDA is an important profitability measure that we use   to manage our business internally. For the quarter, adjusted   EBITDA was $6.8 million, which was at the high end of our   guidance range of $4 million to $7 million.",
    "Turning to the balance sheet, total cash at the end of the   quarter was $82.6 million compared to $194.4 million last year.   The lower cash balance is a result of voluntary prepayment of   $100 million of our term loan. Net long-term debt decreased to   $380.6 million compared to $484.4 million last year. Inventories   at the end of the quarter were $405.8 million, that's up $56.2   million compared to the end of the second quarter last year. As   you will recall, our efforts last year to tightly manage   inventory after a short and critical end of season merchandise.   So this year we built our inventory to improve our in-stock   levels heading into the spring summer selling season.",
    "In addition, we accelerate shipments to get in front of tariff   increases, and to also help mitigate delays that could   potentially arise from port congestion. We're very comfortable   with our current inventory levels. They are seasonally   appropriate, and we have historically low-aged merchandise. Now,   I'd like to spend a few minutes discussing our IT initiatives.   We've completed our final portion of our ERP roll-out, and we're   now turning our attention to the implementation of our Enterprise   Order Management system.",
    "This will provide us with real-time global visibility in our   inventory, enabling us to increase our inventory productivity as   we improve our ability to offer and fulfill orders through   additional internal and external channels. This should result in   opportunities for both top line growth and working capital   improvement. We've also begun to scope out our Warehouse   Management System, which would enable us to optimize our package   and shipping cost structure, which in turn would drive labor   productivity through process improvements and performance   management.",
    "Before turning to guidance, I want to take a moment to update   you on the recent tariff news. The tariffs most recently   announced analysts for are expected to have a gross impact of $8   million to $10 million in the current fiscal year. We anticipate   being able to offset approximately 50% of these tariffs through   negotiating pricing with our vendor base, passing through some of   the costs to our customers, and looking at other savings   opportunities in our business. Looking ahead to 2020, we   anticipate further reducing our exposure to China to   approximately 20% of our total shipments.",
    "As a result, we anticipate our ongoing then [phonetic] impact   from the increased tariffs to be approximately $7 million to $9   million per year. Turning to our guidance, for the full year, we   continue to expect net revenue to be between $1.45 billion and   $1.5 billion, driven by growth in our direct-to-consumer and   Outfitters business, combined with nine new store openings. This   will be partially offset by the reduction of our Lands' End Shops   at Sears locations.",
    "We are increasing our net income outlook to be between $12   million and $17 million, and diluted earnings per share to be   between $0.37 and $0.52. And that's including the tariff impact   that I mentioned earlier. We expect to partially offset these   additional costs by reducing the incremental marketing   investments that we planned for the second half of 2019. We now   expect to spend an incremental $8 million to $10 million as   compared to our initial expectations of $10 million to $15   million. These investments will be focused on driving brand   awareness and new customer acquisition.",
    "We are maintaining our adjusted EBITDA outlook of $70 million   to $80 million. Finally, we expect capex of approximately $40   million, driven by our new Enterprise Order Management system and   additional store openings. For the third quarter, we expect net   revenue to be between $345 million and $355 million, driven by   continued growth in our e-commerce business, offset by the   reduction of 89 Shops at Sears compared to last year. We expect   net income of $1.5 million to $4 million and diluted earnings per   share to be between $0.05 and $0.12. We expect adjusted EBITDA to   be in the range of $17 million to $20 million.",
    "And with that, we'll open up the call for questions.",
    " Operator    --   Executive Vice President, Chief Operating Officer, Chief   Financial Officer and Treasurer ",
    "Thank you. [Operator Instructions] Our first question comes   from Alex Fuhrman with Craig-Hallum Capital. Your line is now   open.",
    " Alex Fuhrman    --   Analyst ",
    "Hey, guys. Thanks for taking my question. And congratulations   on a nice quarter here. I wanted to ask about the guidance. Just   looking at the results of this year, EBITDA was down good amount   here in Q1. It was down slightly in Q2. Looks like based on the   guidance, it should be up a little bit here in Q3, and then the   implication here in the full year guidance is that Q4 EBITDA   should be up quite a bit more than that. So just kind of trying   to understand, is that just the natural continuation of the   better trends you've seen and the increases in the buyer file   throughout the year? And just trying to dissect how much of that,   which is just that natural improvement that you've been seeing   versus what you're expecting to see from the American Airlines   launch coming here in the fourth quarter?",
    " Jerome Griffith    --   Chief Executive Officer and President ",
    "Thanks, Alex. Yeah, I think it's a combination of both of   those things. I think you have to remember we have the improving   trends. We expect to see those continue into the back half. And   then in the first half, we're comping the Delta Airlines launch   and then as you mentioned in the fourth quarter, we'll pick up   the impact from the American Airlines launch. So the combination   of all those things I think support our guidance.",
    " Alex Fuhrman    --   Analyst ",
    "Okay. And then just thinking about the swim business, I mean,   it sounds like that got off to a little bit of a slower start   than you'd expected and then rebounded nicely throughout the   season. Do you know anything in particular that was driving that   slow start? And, you know, curious, what were you able to do to   course correct there and get that business back on track?",
    " James Gooch    --   Executive Vice President, Chief Operating Officer, Chief   Financial Officer and Treasurer ",
    "Hi. How you are doing? Yes, swimsuit was sort of a little bit   slow in the quarter. Quarter 1 was not terrible. May was really   not a great month, partially due to what we had one print that   didn't resonate very well with consumers. But then back into June   and then July, we saw swim pick up and it continued to pick up   into August. So it was really just a slow start to the quarter,   not too much of any changes that we were able to make because we   were bought already but just consumer demand picked up as summer   went on.",
    " Alex Fuhrman    --   Analyst ",
    "Okay, that's helpful. And then just thinking about, you know,   your other big seasonal categories coming up here in the back   half. Outerwear, you know has always been a big category for you.   Do you feel you have the right inventory levels for that? And is   it, you know, perhaps the expectation that consumers might be   purchasing a little bit closer to their actual needs therefore,   for outerwear as well?",
    " James Gooch    --   Executive Vice President, Chief Operating Officer, Chief   Financial Officer and Treasurer ",
    "Yeah. If you think back to last year, our key item strategy   worked extremely well. We did much better in Q3, Q4 in 2018 than   2017. And that really chalked that up to a lot of the key items   that we had. Flannel shirts, cashmere sweaters, outerwear and as   we go into the back part of 2019, our strategy is really the   same. It's our key items that the customers come and look for. So   we think for -- we're bought really well for the holiday season.   We've put plans in place, which resonate what we've learned in   the last year. And we feel pretty good about it so far.",
    " Alex Fuhrman    --   Analyst ",
    "Well, that's great. Thank you very much. And look forward to   seeing your holiday assortments.",
    " Jerome Griffith    --   Chief Executive Officer and President ",
    "Thanks, Alex.",
    " James Gooch    --   Executive Vice President, Chief Operating Officer, Chief   Financial Officer and Treasurer ",
    "Thanks, Alex. Will talk to you.",
    " Operator    --   Executive Vice President, Chief Operating Officer, Chief   Financial Officer and Treasurer ",
    "Thank you. [Operator Instructions] This does conclude today's   question-and-answer session.",
    "[Operator Closing Remarks]",
    " Duration: 25 minutes ",
    " Bernie McCracken    --   Chief Accounting Officer ",
    " Jerome Griffith    --   Chief Executive Officer and President ",
    " James Gooch    --   Executive Vice President, Chief Operating Officer, Chief   Financial Officer and Treasurer ",
    " Alex Fuhrman    --   Craig-Hallum Capital Group LLC -- Analyst ",
    " More LE analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than Lands' End     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Lands'   End wasn't one of them! That's right -- they think   these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 12:23:23"
}