{
  "url": "https://www.nasdaq.com/article/twitters-been-hot-but-square-stock-still-is-the-better-buy-cm1210582",
  "title": "Twitter’s Been Hot, but Square Stock Still Is the Better Buy - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "The last time I compared Twitter (NYSE: TWTR ) to Square (NYSE: SQ ) was 16 months ago in April 2018. At the time, I suggested that Square stock was a better buy than Twitter stock over the long haul because the payment processor solves more problems than the social media platform. ",
    "Flash forward to today and TWTR stock is up 58% through Sept. 9 versus 34% for Square and 14% for the S&P 500.",
    "Jack Dorsey, CEO, and co-founder of Twitter and co-founder of Square has seen his personal wealth increase substantially over this period thanks to the performance of both stocks. ",
    "Not only has Twitter outperformed over the past 16 months, but it's also up 54% year to date while Square's gained just 10% or about half the return of the total market. ",
    "Does that make Twitter the better buy? I don't think so. Here's why. ",
    "As I write this, Twitter stock is trading at 10.5 times sales, 62% higher than Square. However, TWTR's forward P/E of 40.2 is cheaper than 55 times Square's forward earnings, so answering which stock is cheaper is really a matter of personal preference.",
    "Because Square is still losing money on a GAAP basis, I believe P/S one of the few metrics that allow for an apples-to-apples comparison. ",
    "Now, when it comes to free cash flow, one of my favorite financial metrics for assessing a company's financial health, Square's is coming on like gangbusters. ",
    "In the latest six months ended June 30, Square's free cash flow was $136 million , 183 higher than in the same period a year earlier. Meanwhile, Twitter's free cash flow was $475 million , 81% higher than the previous six months. ",
    "It looks like a tie, doesn't it?",
    "To determine which company has a better free cash flow situation, let's look at both companies' free cash flow yields using their trailing 12-month free cash flows, divided by their current enterprise values. ",
    "Square's free cash flow for the trailing 12 months is $321.7 million . That gives it an FCF yield of 1.3% based on an enterprise value of $25.6 billion . Twitter's free cash flow for the trailing 12 months is $1.1 billion . That gives it an FCF yield of 3.4% based on an enterprise value of $31.0 billion .  ",
    "From this perspective, Twitter appears to be the cheaper buy.",
    "What this doesn't take into consideration the rate at which Square is growing its revenue. ",
    "In the past three years, Twitter has grown its revenue from $2.2 billion in 2015 to $3.04 billion in 2018, a compound annual growth rate of 11.4%. At the same, Square's grown its revenue from $1.27 billion in 2015 to $3.30 billion in 2018, a compound annual growth rate of 37.5%, more than three times Twitter's growth. ",
    "As Square continues to introduce innovative products such as Square Terminal outside the U.S., its international revenues will continue to blossom.",
    "I recently attended the Wolfville Farmers Market in Wolfville, Nova Scotia. About an hour's drive from Halifax, Wolfville is the heart of farm country in the province. Almost all of the stalls were using Square products to process payments. ",
    "Here's what I said about Square Terminal in August :",
    "\"At the Canadian launch of Square Terminal, Dorogusker, Square's head of hardware, told reporters that the portable terminal provides small- and medium-sized businesses with the ability to manage inventory, send invoices, record deposits, manage payment histories, and generate reports about their companies…The product eliminates the need for shopkeepers to deploy a slew of iPads, smartphones and tablets, to successfully operate their businesses.\"",
    "From where I sit, Square's innovation will continue to enable it to grow revenues by 30% or more on an annual basis, while Twitter's going to struggle to grow its ad revenues by double digits. ",
    "For this reason, Square deserves a higher valuation than Twitter. ",
    "However, let's assume Square has a P/S multiple identical to Twitter. That would give it a market cap of $42.5 billion, 62% higher than its current market cap. ",
    "Twitter stock has bounced nicely in 2019. I'll give it that.",
    "However, as my InvestorPlace colleague, Luke Lango stated at the end of August, \"Twitter stock looks risky above $40.\"",
    "I said Square was the better stock in April 2018 and it failed to keep up with Twitter. Over the next 16 months, I have no doubt, this time it will be different. ",
    "At the time of this writing Will Ashworth did not hold a position in any of the aforementioned securities.",
    "The post Twitter's Been Hot, but Square Stock Still Is the Better Buy appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:10:31"
}