{
  "url": "https://www.nasdaq.com/article/ford-doesnt-deserve-its-new-junk-credit-rating-cm1210299",
  "title": "Ford Doesn't Deserve Its New Junk Credit Rating - Nasdaq.com",
  "text": [
    " In May 2012, Moody's became the second major credit rating   agency to give   Ford Motor    (NYSE: F) an investment-grade credit rating. This was a huge   milestone, as it allowed Ford to regain full title to its U.S.   assets, including its iconic \"Blue Oval\" logo. Ford had been   forced to post these as collateral for a massive loan that   enabled it to avoid bankruptcy during the Great Recession, unlike   rival U.S. automakers    . However, Moody's is now taking that investment-grade rating   away. On Monday, the prominent rating agency downgraded Ford's   credit rating to Ba1, the highest rung of non-investment-grade   (or junk) territory. In the short term, this development won't have much of an   impact on Ford. But if another one of the major credit rating   agencies downgrades Ford's debt to junk status, the company would   likely face higher borrowing costs, which could pinch its profits   (particularly in its Ford Credit financing subsidiary). That   said, the analysis behind this downgrade underestimates how   quickly Ford is likely to recover from its recent struggles. If   profitability rebounds as I expect, Moody's could restore Ford's   investment-grade rating within a year or two.makeArticleAd(); Moody's cuts Ford's rating -- despite its strong balance   sheet As my Foolish colleague John Rosevear recently noted, the   Moody's downgrade was   somewhat confusing    . Moody's expects restructuring costs to weigh on cash flow for   the next few years, but it seems bullish about Ford's efforts to   boost its profit margin over time by exiting unprofitable markets   and product lines, while refreshing its core offerings. Moody's   also acknowledged that Ford has a solid balance sheet, including   $23.2 billion of cash (which exceeds its automotive debt load).   Thus, the company has the financial flexibility to pull off its   restructuring plan.    Image source: Ford Motor Company.  The main reason why Moody's is cutting Ford's credit rating is   that it expects the Blue Oval's profitability to remain under   pressure until at least 2022. This projection of subpar earnings   in 2020 and 2021 makes Moody's downgrade understandable, as it   means that Ford would be in a weak position to withstand   incremental headwinds like a severe recession, a spike in   commodity costs, or an all-out trade war. Profitability in North America is set to surge Moody's downgrade note highlights that Ford's adjusted   operating margin in North America has fallen to around 8% in 2018   and the first half of 2019, after exceeding 10% as recently as   2016. The rating agency thinks Ford may get back to a 10%   operating margin in its home market eventually but not for a few   years. However, Ford is already close to an inflection point for its   profitability in North America. The automaker has been phasing   out most of its (unprofitable) traditional car models since early   2018. An upgraded and expanded portfolio of crossovers, SUVs, and   trucks will be the key to holding unit sales steady at greatly   improved margins. (A recent decline in commodity costs should   help, too.) So far, Ford has seen great success with the latest version of   its Ford Expedition and Lincoln Navigator full-size SUVs. It   recently boosted production by 20% to meet red-hot demand. The   Ranger midsize pickup has also sold well since being reintroduced   in North America in early 2019. Ford has also seen smaller   success from bringing the EcoSport subcompact SUV to the U.S. for   the first time and introducing the Lincoln Nautilus to replace   the fairly boring Lincoln MKX midsize crossover.   The Ford Ranger was reintroduced in the U.S. earlier this     year. Image source: Ford Motor Company.  That said, the Ford Escape, Ford Explorer, and the latter's   police variant accounted for more than two-thirds of the nearly   800,000 crossovers and SUVs that the Blue Oval brand sold in the   U.S. last year. All three have been badly in need of updating.   Domestic sales of the three models combined fell 14% year over   year in the first half of 2019. Fortunately, all-new versions of   the Explorer and the Police Interceptor went on sale this summer,   and an all-new Escape will follow later in the year. These much-improved models, along with two new Lincoln   crossovers, should drive rapid improvement in sales and earnings   trends in North America over the next few quarters. The   reintroduction of the Ford Bronco off-road SUV and a smaller   sibling in 2020 -- along with the launch of an all-new Ford F-150   -- should drive further gains in 2021. As a result, I expect   Ford's North American operating margin to return to the 10% level   by 2021 at the latest. Ford won't be pressed for cash It may take longer for Ford to fix its business outside North   America, but the company is   already making progress    . Moreover, Ford's home market generates more than half of its   unit sales, more than two-thirds of its revenue, and more than   100% of its automotive profit. Thus, revenue growth and margin   expansion in North America over the next two years would drive   strong earnings growth at the company level, even if results in   other regions remain weak during that period. Strong profitability in North America -- along with dividends   from the Ford Credit subsidiary and gradual improvement in the   rest of the world -- should enable Ford to produce positive free   cash flow in 2020 and 2021 despite incurring high restructuring   costs. That would run contrary to Moody's expectations. Other developments that will bolster Ford's cash position   include   VMWare    's pending deal to buy   Pivotal Software    for $15 per share -- making Ford's stake in the latter worth more   than $250 million -- and   Volkswagen    's recent investment in Argo AI. Volkswagen is buying half of   Ford's interest in the self-driving car start-up for $500   million, while agreeing to invest another $1 billion in Argo AI   and contribute other assets to the company. This will reduce the   amount that Ford will need to invest to continue Argo AI's   research and development efforts. In short, Ford isn't likely to experience nearly as much cash   flow pressure over the next two years as Moody's expects.   Moreover, its profitability is likely to improve rapidly over   that period. If that happens, Moody's is likely to recognize the   error of its ways and restore Ford's investment-grade rating   before too long.   10 stocks we like better than Ford       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Ford wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Adam Levine-Weinberg      owns shares of Ford. The Motley Fool recommends VMware. The     Motley Fool has a     disclosure policy      .  ",
    "In May 2012, Moody's became the second major credit rating   agency to give   Ford Motor    (NYSE: F) an investment-grade credit rating. This was a huge   milestone, as it allowed Ford to regain full title to its U.S.   assets, including its iconic \"Blue Oval\" logo. Ford had been   forced to post these as collateral for a massive loan that   enabled it to avoid bankruptcy during the Great Recession, unlike   rival U.S. automakers    .",
    "However, Moody's is now taking that investment-grade rating   away. On Monday, the prominent rating agency downgraded Ford's   credit rating to Ba1, the highest rung of non-investment-grade   (or junk) territory.",
    "In the short term, this development won't have much of an   impact on Ford. But if another one of the major credit rating   agencies downgrades Ford's debt to junk status, the company would   likely face higher borrowing costs, which could pinch its profits   (particularly in its Ford Credit financing subsidiary). That   said, the analysis behind this downgrade underestimates how   quickly Ford is likely to recover from its recent struggles. If   profitability rebounds as I expect, Moody's could restore Ford's   investment-grade rating within a year or two.",
    "As my Foolish colleague John Rosevear recently noted, the   Moody's downgrade was   somewhat confusing    . Moody's expects restructuring costs to weigh on cash flow for   the next few years, but it seems bullish about Ford's efforts to   boost its profit margin over time by exiting unprofitable markets   and product lines, while refreshing its core offerings. Moody's   also acknowledged that Ford has a solid balance sheet, including   $23.2 billion of cash (which exceeds its automotive debt load).   Thus, the company has the financial flexibility to pull off its   restructuring plan.",
    "   Image source: Ford Motor Company. ",
    " Image source: Ford Motor Company.",
    "The main reason why Moody's is cutting Ford's credit rating is   that it expects the Blue Oval's profitability to remain under   pressure until at least 2022. This projection of subpar earnings   in 2020 and 2021 makes Moody's downgrade understandable, as it   means that Ford would be in a weak position to withstand   incremental headwinds like a severe recession, a spike in   commodity costs, or an all-out trade war.",
    "Moody's downgrade note highlights that Ford's adjusted   operating margin in North America has fallen to around 8% in 2018   and the first half of 2019, after exceeding 10% as recently as   2016. The rating agency thinks Ford may get back to a 10%   operating margin in its home market eventually but not for a few   years.",
    "However, Ford is already close to an inflection point for its   profitability in North America. The automaker has been phasing   out most of its (unprofitable) traditional car models since early   2018. An upgraded and expanded portfolio of crossovers, SUVs, and   trucks will be the key to holding unit sales steady at greatly   improved margins. (A recent decline in commodity costs should   help, too.)",
    "So far, Ford has seen great success with the latest version of   its Ford Expedition and Lincoln Navigator full-size SUVs. It   recently boosted production by 20% to meet red-hot demand. The   Ranger midsize pickup has also sold well since being reintroduced   in North America in early 2019. Ford has also seen smaller   success from bringing the EcoSport subcompact SUV to the U.S. for   the first time and introducing the Lincoln Nautilus to replace   the fairly boring Lincoln MKX midsize crossover.",
    "  The Ford Ranger was reintroduced in the U.S. earlier this     year. Image source: Ford Motor Company. ",
    "The Ford Ranger was reintroduced in the U.S. earlier this     year. Image source: Ford Motor Company.",
    "That said, the Ford Escape, Ford Explorer, and the latter's   police variant accounted for more than two-thirds of the nearly   800,000 crossovers and SUVs that the Blue Oval brand sold in the   U.S. last year. All three have been badly in need of updating.   Domestic sales of the three models combined fell 14% year over   year in the first half of 2019. Fortunately, all-new versions of   the Explorer and the Police Interceptor went on sale this summer,   and an all-new Escape will follow later in the year.",
    "These much-improved models, along with two new Lincoln   crossovers, should drive rapid improvement in sales and earnings   trends in North America over the next few quarters. The   reintroduction of the Ford Bronco off-road SUV and a smaller   sibling in 2020 -- along with the launch of an all-new Ford F-150   -- should drive further gains in 2021. As a result, I expect   Ford's North American operating margin to return to the 10% level   by 2021 at the latest.",
    "It may take longer for Ford to fix its business outside North   America, but the company is   already making progress    . Moreover, Ford's home market generates more than half of its   unit sales, more than two-thirds of its revenue, and more than   100% of its automotive profit. Thus, revenue growth and margin   expansion in North America over the next two years would drive   strong earnings growth at the company level, even if results in   other regions remain weak during that period.",
    "Strong profitability in North America -- along with dividends   from the Ford Credit subsidiary and gradual improvement in the   rest of the world -- should enable Ford to produce positive free   cash flow in 2020 and 2021 despite incurring high restructuring   costs. That would run contrary to Moody's expectations.",
    "Other developments that will bolster Ford's cash position   include   VMWare    's pending deal to buy   Pivotal Software    for $15 per share -- making Ford's stake in the latter worth more   than $250 million -- and   Volkswagen    's recent investment in Argo AI. Volkswagen is buying half of   Ford's interest in the self-driving car start-up for $500   million, while agreeing to invest another $1 billion in Argo AI   and contribute other assets to the company. This will reduce the   amount that Ford will need to invest to continue Argo AI's   research and development efforts.",
    "In short, Ford isn't likely to experience nearly as much cash   flow pressure over the next two years as Moody's expects.   Moreover, its profitability is likely to improve rapidly over   that period. If that happens, Moody's is likely to recognize the   error of its ways and restore Ford's investment-grade rating   before too long.",
    "  10 stocks we like better than Ford       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Ford wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Ford       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Ford wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Adam Levine-Weinberg      owns shares of Ford. The Motley Fool recommends VMware. The     Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:21:00"
}