{
  "url": "https://www.nasdaq.com/article/un-warns-of-burundi-atrocities-as-divine-ruler-eyes-2020-election-20190904-01129",
  "title": "U.N. warns of Burundi atrocities as \"divine\" ruler eyes 2020 election - Nasdaq.com",
  "text": [
    "By Tom Miles",
    "GENEVA, Sept 4 (Reuters) - Burundi is at risk of a new wave of atrocities as it approaches a 2020 election with an unresolved political crisis and a president increasingly portrayed as a \"divine\" ruler, U.N. investigators said in a report on Wednesday.",
    "The report by the U.N. Commission of Inquiry on Burundi  said there was a climate of fear and intimidation against anyone who did not show support for the ruling CNDD-FDD party.",
    "Burundi's Human Rights Minister Martin Nivyabandi told Reuters the government condemned the allegations and did not cooperate with or recognise the U.N. investigation because it \"ignored the main principle of dialogue.\"",
    "He added: \"The content of the report doesn't match the reality known within the country.\"",
    "Using a U.N. risk analysis for potential atrocities, the investigators said all eight common risk factors were present.",
    "\"There is no better early warning than this,\" the U.N. panel's chairman Doudou Diene said in a statement.",
    "\"The 2020 elections pose a major risk,\" the report said, adding that the government was increasing control over non-governmental organisations and there was no real multi-party system, since most parties had been \"infiltrated and divided\".",
    "The report said freedom of the press had become a fiction, while Nkurunziza had exceeded his powers, making appointments that are not within his constitutional authority and relying on shadowy informal structures such as a committee of generals.",
    "There was also a \"slide into religiosity\" apparent in some of his decisions, it said, while the return of the royal motto \"God, King, Country\" to monuments was fuelling speculation about a possible restoration of the monarchy for his benefit.",
    "\"The theme of the divine origin of the President's power is increasingly common in official speeches delivered by the President and his wife,\" the report said.",
    "A former guerrilla leader whose party mainly from the ethnic Hutu majority was the main rebel movement in a civil war in which 300,000 people died, Nkurunziza came to power in 2005 after a peace agreement. Last year he won a referendum that could allow him to stay in office until 2034.",
    "Nkurunziza has lectured on the \"true\" history of Burundi, a former Belgian colony with a similar ethnic mix to neighbouring Rwanda, which suffered a genocide in 1994 when a majority Hutu government launched mass killings of minority Tutsis.",
    "The U.N. report said imposing a biased official version of history could sharpen past grievances, with troubling consequences.",
    "\"A number of armed rebel groups in neighbouring countries have stated that they might resort to force to resolve the situation in Burundi. They could be encouraged to do so by the unlikelihood of a resolution to the crisis,\" it said."
  ],
  "published_datetime": "2019-09-04 03:06:00"
}