{
  "url": "https://www.nasdaq.com/article/august-etf-asset-report-gold-tops-cm1206800",
  "title": "August ETF Asset Report: Gold Tops - Nasdaq.com",
  "text": [
    " The month of August has been anything but favorable for Wall Street, thanks to the re-escalation in Sino-U.S. trade tensions. SPDR S&P 500 ETF  SPY  (down 0.1%),  SPDR Dow Jones Industrial Average ETF DIA  (down 0.3%) and  Invesco QQQ Trust QQQ  (up 0.1%) - all suffered in the past month (as of Aug 30, 2019) (read:  Top and Flop ETF Areas of August  ). Apart from renewed trade tensions, events like the Argentina debt crisis, a slight decline in the second-quarter U.S. GDP growth data and chances of a no-deal Brexit impacted the events in the month (read: August ETF Events That Grab Headlines  ). Let's see how these events impacted asset growth in the ETF industry in August (as of August 29, 2019) (per etf.com).  Gold Glitters  Rising trade spats and the safe-haven rally pushed up precious metal prices. Also, the Fed and several other global central banks are acting dovish. This boosted non-interest-bearing assets like gold. SPDR Gold Trust ( GLD )  added about $2.73 billion in assets in the month (read: Gold ETF Inflows Hits 6-Year High: How to Go Long  ).  S&P 500 Stood Out  Despite turmoil in the broader market, the S&P 500 was the favorite of investors. iShares Core S&P 500 ETF IVV  and Vanguard S&P 500 ETF VOO  hauled in a respective of $2.71 billion and $2.31 billion in assets in August.  Low-Volatility ETFs Sizzle  Low-volatility ETFs have been on radar as investors flocked to  iShares Edge MSCI Min Vol U.S.A. ETF USMV  . The fund garnered $2.14 billion in assets in the month (read: 5 ETF Zones to Take Shelter From Trade War  ).    Consumer Staples ETFs in Fine Fettle  As the broader market saw immense turmoil, safe sectors like consumer staples witnessed ample asset creation. Consumer Staples Select Sector SPDR Fund XLP  pulled in about $1.36 billion in assets in the month (read: 5 ETFs to Gain From Walmart Strength Post Q2 Results  ).  Bond Gave All-Round Performance  As bond yields slumped drastically in August on slowdown fears and central banks' dovish comments, bond ETFs saw huge inflows in assets in the month. Vanguard Total Bond Market ETF BND  , iShares U.S. Treasury Bond ETF GOVT  and iShares 7-10 Year Treasury Bond  ETF IEF  attracted about $1.43 billion, $1.38 billion and $1.10 billion in assets, respectively, in the month.  Emerging Markets Lost Luster  Emerging markets lost luster in August as China-led trade tensions caused a spiraling effect on the entire EM bloc. Strength in the greenback is another reason for emerging market underperformance and investors' disinterest toward the space. iShares MSCI Emerging Markets ETF ( EEM )  lost about $5.15 billion in assets. iShares Core MSCI Emerging Markets ETF ( IEMG )  too shed about $2.10 billion in assets.  Financial ETFs Bleed Assets   Financial Select Sector SPDR Fund ( XLF )  bled about $3.04 billion in assets in August as long-term bond yields slumped in August. This compressed financial institutions' net interest margins.  Nasdaq-100 Fell Out of Investors' Favor  Tech-heavy Invesco QQQ Trust ( QQQ )  lost about $1.56 billion inAugust. This is because tech stocks are highly dependent on U.S.-China trade relation. A worsening of the ties is negative for the fund.  Investors Say No to High-Yield Bond Funds   iShares iBoxx USD High Yield Corporate Bond ETF ( HYG )  and iShares iBoxx USD Investment Grade Corporate Bond ETF ( LQD )  saw about $2.09 billion and$937 million in assets gushing out, respectively.  Want key ETF info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.   Get it free >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeAd('4','300x250','mktsnews','vanguard','','');  SPDR Dow Jones Industrial Average ETF (DIA): ETF Research Reports   iShares iBoxx $ Investment Grade Corporate Bond ETF (LQD): ETF Research Reports   iShares MSCI Emerging Markets ETF (EEM): ETF Research Reports   iShares 7-10 Year Treasury Bond ETF (IEF): ETF Research Reports   iShares Edge MSCI Min Vol USA ETF (USMV): ETF Research Reports   Consumer Staples Select Sector SPDR Fund (XLP): ETF Research Reports   Vanguard S&P 500 ETF (VOO): ETF Research Reports   SPDR Gold Shares (GLD): ETF Research Reports   iShares Core S&P 500 ETF (IVV): ETF Research Reports   iShares iBoxx $ High Yield Corporate Bond ETF (HYG): ETF Research Reports   Financial Select Sector SPDR Fund (XLF): ETF Research Reports   iShares U.S. Treasury Bond ETF (GOVT): ETF Research Reports   Vanguard Total Bond Market ETF (BND): ETF Research Reports   Invesco QQQ (QQQ): ETF Research Reports   SPDR S&P 500 ETF (SPY): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    "The month of August has been anything but favorable for Wall Street, thanks to the re-escalation in Sino-U.S. trade tensions. SPDR S&P 500 ETF  SPY  (down 0.1%),  SPDR Dow Jones Industrial Average ETF DIA  (down 0.3%) and  Invesco QQQ Trust QQQ  (up 0.1%) - all suffered in the past month (as of Aug 30, 2019) (read:  Top and Flop ETF Areas of August  ).",
    "Apart from renewed trade tensions, events like the Argentina debt crisis, a slight decline in the second-quarter U.S. GDP growth data and chances of a no-deal Brexit impacted the events in the month (read: August ETF Events That Grab Headlines  ).",
    "Let's see how these events impacted asset growth in the ETF industry in August (as of August 29, 2019) (per etf.com).",
    " Gold Glitters ",
    "Rising trade spats and the safe-haven rally pushed up precious metal prices. Also, the Fed and several other global central banks are acting dovish. This boosted non-interest-bearing assets like gold. SPDR Gold Trust ( GLD )  added about $2.73 billion in assets in the month (read: Gold ETF Inflows Hits 6-Year High: How to Go Long  ).",
    " S&P 500 Stood Out ",
    "Despite turmoil in the broader market, the S&P 500 was the favorite of investors. iShares Core S&P 500 ETF IVV  and Vanguard S&P 500 ETF VOO  hauled in a respective of $2.71 billion and $2.31 billion in assets in August.",
    " Low-Volatility ETFs Sizzle ",
    "Low-volatility ETFs have been on radar as investors flocked to  iShares Edge MSCI Min Vol U.S.A. ETF USMV  . The fund garnered $2.14 billion in assets in the month (read: 5 ETF Zones to Take Shelter From Trade War  ).  ",
    " Consumer Staples ETFs in Fine Fettle ",
    "As the broader market saw immense turmoil, safe sectors like consumer staples witnessed ample asset creation. Consumer Staples Select Sector SPDR Fund XLP  pulled in about $1.36 billion in assets in the month (read: 5 ETFs to Gain From Walmart Strength Post Q2 Results  ).",
    " Bond Gave All-Round Performance ",
    "As bond yields slumped drastically in August on slowdown fears and central banks' dovish comments, bond ETFs saw huge inflows in assets in the month. Vanguard Total Bond Market ETF BND  , iShares U.S. Treasury Bond ETF GOVT  and iShares 7-10 Year Treasury Bond  ETF IEF  attracted about $1.43 billion, $1.38 billion and $1.10 billion in assets, respectively, in the month.",
    " Emerging Markets Lost Luster ",
    "Emerging markets lost luster in August as China-led trade tensions caused a spiraling effect on the entire EM bloc. Strength in the greenback is another reason for emerging market underperformance and investors' disinterest toward the space. iShares MSCI Emerging Markets ETF ( EEM )  lost about $5.15 billion in assets. iShares Core MSCI Emerging Markets ETF ( IEMG )  too shed about $2.10 billion in assets.",
    " Financial ETFs Bleed Assets ",
    " Financial Select Sector SPDR Fund ( XLF )  bled about $3.04 billion in assets in August as long-term bond yields slumped in August. This compressed financial institutions' net interest margins.",
    " Nasdaq-100 Fell Out of Investors' Favor ",
    "Tech-heavy Invesco QQQ Trust ( QQQ )  lost about $1.56 billion inAugust. This is because tech stocks are highly dependent on U.S.-China trade relation. A worsening of the ties is negative for the fund.",
    " Investors Say No to High-Yield Bond Funds ",
    " iShares iBoxx USD High Yield Corporate Bond ETF ( HYG )  and iShares iBoxx USD Investment Grade Corporate Bond ETF ( LQD )  saw about $2.09 billion and$937 million in assets gushing out, respectively.",
    " Want key ETF info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.   Get it free >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:00:00"
}