{
  "url": "https://www.nasdaq.com/article/9-stocks-that-every-20-year-old-should-buy-cm1210587",
  "title": "9 Stocks That Every 20-Year-Old Should Buy - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "[Editor's note: \"9 Stocks That Every 20-Year-Old Should Buy\" was previously published in July 2019. It has since been updated to include the most relevant information available.]",
    "Investing in your 20s is not only smart, it's exciting. The best part about creating a long-term portfolio, whether while going back to school or taking time off, is having the time to invest in undervalued companies.",
    "When looking at stocks to buy in your 20s, it's all about opportunity cost, which is spent in spades throughout your late-teens and as an aimless 20-something. Long-term investors have the benefit of time, allowing them to ride out turbulence others can't.",
    "Your 20s are a time of future-gazing, and as an investor, you should choose adaptable companies capitalizing on current trends. Just remember, no matter how solid the investment, it will go through periods of ups and downs.",
    "Centering your portfolio around risky stocks, however, isn't a brick-by-brick blueprint toward retirement wealth - you should also consider faithful, dividend-paying stocks. Just like knowledge, wealth grows slowly and steadily.",
    "While analysts claim there are some stocks you can hold \"forever,\" it's important to keep up with what's in your portfolio and make changes according to how each company develops.",
    "If you're a 20-something looking to capitalize on long-term growth and dividends, then the following 10 stocks to buy are worth a look.",
    "Shares of travel review site TripAdvisor (NASDAQ: TRIP ) took a beating in 2017 and 2018 mostly on investor concerns about new entrants like Airbnb  and new search tools from powerhouses like Alphabet  (NASDAQ: GOOG , NASDAQ: GOOGL ) disrupting the space.",
    "However, TRIP stock has since made a significant comeback.",
    "Part of this comeback is the fact that TripAdvisor has something no other site in the online travel industry does : extensive data. Knowledge is power and TRIP definitely has that going for itself. The company is home to one of the largest online collections of traveler reviews , boasting over 500 million reviews encompassing seven million hospitality businesses.",
    "What's that mean exactly? For starters, access to mounds of data means TripAdvisor can better optimize the experience it offers its 415 million monthly users. That means pricing optimization, special offers tailored individually and stronger insights than competitors into their customers' needs.",
    "And that's only just scratched the surface of what it can do with such a robust database. Global tourism generated $7.6 trillion in 2014 , and so long as it continues to grow, TRIP will continue beefing up its user database.",
    "For comparison's sake,  Expedia  (NASDAQ: EXPE ) only brings in 84.5 million monthly users, while  Priceline  (NASDAQ: PCLN ) has a fraction at 16 million.",
    "Having access to such robust data informs TripAdvisor's strategy, as the company recently reined in its InstantBooking feature in favor of giving users the superior experience of price comparisons that direct bookings to partner sites.",
    "According to Forbes, 70% of millennials say they're working just to pay for vacations and travel . Gen Z is becoming increasingly obsessed with travel from a social perspective. They want to go places and share their experience with others. TripAdvisor not only operates in the travel space, but its primary function is helping people find experiences others have enjoyed.",
    "Further, TRIP is expanding the functionality of its mobile site and app, both of which should help the firm gain traction with millennials. With the firm about to turn a corner, now would be a great time to add the stock to your long-term portfolio.",
    "While your 20s are definitely a time to make risky bets on growth stocks, it's important to round out your portfolio with stocks to build wealth slowly and steadily. That's why dividend stocks are attractive, particularly if they're consistent and sustainable. To that end, we have  Chevron  (NYSE: CVX ), which is a dividend aristocrat .",
    "That doesn't mean it's walking around in fancy robes with its nose up, it means Chevron has increased its dividend annually without interruption for the past 25 years.",
    "Dividend aristocrats typically do whatever they can to maintain their status and that's certainly true in Chevron's case.",
    "Chevron currently yields just shy of 4%, which management continued to pay out even when crude prices were scraping the bottom of the barrel. With the firm on the rebound, investors will benefit from Chevron's cost-cutting measures and increased efficiency.",
    "Meanwhile, management is focused on improving profitability, even during the down cycle, which should be a boon for CVX stock as crude prices increase.",
    "Another thing to like about CVX is that it has a relatively small debt load with a quarterly debt-equity ratio of just 24%. Compare that to BP  (NYSE: BP ), for example, which has a debt ratio of 63%, and you can see that CVX is on the low end of debt accumulation in the oil sector.",
    "Chevron is a tightly run ship, giving the firm the ability to thrive in difficult times. That's good for long-term investors who might see oil cycle through another down period in the years to come.",
    "Looking toward future growth, CVX is expecting to see its production rise to nearly three million barrels per day over the next 10 years. That figure takes into account Chevron's anticipated shale and capital projects as well as the firm's cost-cutting measures, which significantly reduced the firm's exploration potential.",
    "The firm's $200 billion market cap makes it one of the largest companies in the U.S. and a solid pick in the oil and gas sector. CVX offers stability and income growth, both of which will be useful to investors in their 20s.",
    "Investing in Facebook  (NASDAQ: FB ) now doesn't sound like an entirely new idea, but Zuckerberg & Co.'s days as merely a social media site are ending. I'm expecting to see the firm morph into an even larger tech powerhouse in the decades to come.",
    "Facebook has size and scale on its side, which is a huge advantage in the tech space. The company owns the two most popular messaging services in the world, Messenger and WhatsApp, and has yet to do anything about monetizing them.",
    "Simply allowing businesses to communicate directly with customers through these platforms would be a big moneymaker for FB advertising wise, but most expect that Facebook has bigger plans to harness the potential Messenger and WhatsApp hold.",
    "FB has also developed payment platforms, which would allow businesses to charge for services they offer via Facebook .",
    "Not only would that make Facebook's advertising business all the more profitable, because advertisements could more easily be converted into sales, but it would open up a new revenue stream for FB if the firm collects a fee for processing.",
    "Remember what I said about having time to absorb the ups and downs? Well, Baidu (NASDAQ: BIDU ) is one of those stocks that you may have to absorb some downs with. The Chinese tech company has been compared to Google because the firm's search engine dominance resembles Google's early days.",
    "There is a huge amount of growth potential ahead for Chinese tech firms, especially a search engine like BIDU. Just over  half of China's population has access to the internet , so the market is relatively new when you compare it to that of the U.S. Since the trade war can't last forever if time is your ally you have to at least consider BIDU stock.",
    "Not only that, but Baidu has been working to expand its autonomous driving technology in the race to create self-driving cars. The firm has already made its driverless car technology available for automakers to use and test in a bid to become somewhat of an autonomous car \"operating system.\"",
    "It's also likely that Chinese companies will get their cars on the road sooner because fewer people own cars in China. That makes for a higher adoption rate, as 75% of Chinese respondents indicated they would ride in a self-driving taxi , while only 52% of Americans would.",
    "What's more, China has a bigger auto industry and its government is hungry for large-scale projects. And while it seems counterintuitive considering China's complex system of roads, the real advantage is with navigation.",
    "The difficult conditions necessary to debut an autonomous vehicle in China means it will have a far easier time \"porting\" the system to the United States than the other way around. That means, for Baidu, international expansion will likely be much faster and less costly.",
    "Starbucks  (NASDAQ: SBUX ) is one of my favorite long-term buys because the company has proven itself to be an adaptable staple in markets all over the world. The company has weathered shifting consumer preferences toward independent, non-chain restaurants by incorporating local goods in their restaurants and revamping store appearances to reflect local cities.",
    "SBUX has also capitalized on the craft beer trend by creating its own Reserve Roastery where coffee lovers can sample different types of coffee and learn about the process. But all of that pales in comparison to SBUX's dominance in mobile.",
    "The Starbucks app is a textbook lesson in how to use mobile to enhance your business. Customers are able to upload money to the app and order and pay for their coffee in advance to avoid waiting in line; 30% of the firm's transactions take place on the app, a figure likely to grow even more as SBUX continues to invest in its mobile technology.",
    "Starbucks maintained an image millennials are comfortable with as the rest of the fast food industry struggled and the firm's focus on mobile has made it convenient to frequent.",
    "Cutting the cable cord is gaining popularity in large part due to the growing popularity of streaming services like Netflix  (NASDAQ: NFLX ). The firm has already seen exponential growth over the past 10 years, causing some to wonder whether we're at the beginning of the end of NFLX stock's dominance.",
    "However, with a market cap under $1 billion, NFLX still has room to grow. If NFLX gains roughly 10% per year for the next 15, the firm would have a market cap of less than $150 billion, which isn't unreasonable when you consider Netflix still has a lot of room to run in foreign markets.",
    "Netflix is only just beginning to ramp up in countries around the world and the firm hasn't been able to turn out the kind of profit investors are looking for because it has to pay for content licensing and new content creation.",
    "With that in mind, streaming is still a relatively new concept and as it becomes more common, NFLX will be establishing itself as a market leader around the globe.",
    "While admittedly not as shiny and new as stocks like NFLX, Waste Management  (NYSE: WM ) is a great stock to buy and hang on to because it operates in an industry almost certain to keep growing.",
    "Waste Management owns and operates landfills and collection trucks and negotiates contracts with local governments to collect and dispose of rubbish in the area. What's good about WM is the company's ownership of local refuse sites means the company doesn't suffer from a lot of customer turn-over.",
    "Not only that, we appear to be a long way off from changing the way we dispose of and recycle our garbage. Consumers are going to keep on consuming and producing waste companies like WM will deal with.",
    "Unlike tech firms, WM is unlikely to suffer from a major industry disruptor anytime soon, so it makes for a good stock to hold on to. Not to mention that WM offers a 1.74% dividend yield, so keeping it in the long-term is a great way to build wealth.",
    "U.S. automaker General Motors   (NYSE: GM ) is another good bet for a long-term investor because the company has a stake in all of the industry-changing trends on the horizon . GM bought up 9% of Lyft last year in an effort to get in on ride-sharing, a trend threatening to change the way people buy and use their cars.",
    "GM has also been a major player in the electric vehicle space, specifically designing mass-appeal cars like its Chevy Bolt. The car is eligible for a tax credit that brings its price down to the $30,000 level, making it accessible to a wider audience than most electric cars cater to.",
    "GM has also been working to develop driverless cars, and the firm's acquisition of CruiseAutomation last year is proof it is a top priority.",
    "GM has plans to create an autonomous electric car , a testament to management's belief that electric cars are the future of the auto industry. According to now-President Mark Reuss, creating a gas-powered autonomous vehicle is a wasted step. He believes that electric cars will soon dominate the roads, so autonomous driving software should be designed with that in mind.",
    "Reuss said that GM may be slower to develop autonomous driving software, but that's only because the firm is hoping to create technology that is designed for use in electric vehicles.",
    "When you're in your 20s and looking for hot tech stocks to buy, International Business Machines Corp.  (NYSE: IBM ) doesn't exactly spring to mind, but the firm's tumultuous few years as a washed-up hardware firm have made IBM stock a bargain.",
    "IBM is doing some big things in the machine learning space and its Watson supercomputer has the potential to disrupt a wide variety of industries, from cybersecurity to health analytics. While IBM has yet to break out figures for Watson, its potential to slash healthcare costs and improve personalized medicine makes IBM a potential powerhouse.",
    "Watson may eventually be able to use massive databases of patient information to make connections between symptoms and diseases that medical professionals would have overlooked. This could revolutionize the way healthcare professionals diagnose, as well as save the healthcare industry loads of money by correctly identifying treatable conditions early on.",
    "But Watson isn't the only reason to scoop up IBM stock. The company  has been successful so far in orchestrating its turnaround , and the company appears to be returning to growth as well as to have rounded a corner away from hardware and on to cloud computing and analytics.",
    "Those two segments make up more than half of IBM's revenue at this point, a good sign that the firm is on track to shift away from its legacy hardware business. The fact that its quickly growing strategic imperatives arm is becoming a much more substantial part of the firm's business is a good sign for future growth.",
    "Not only will shareholders reap the rewards of an IBM turnaround over the next decade, but the firm also pays out a 5.2% dividend yield, a sweet reward for riding out the turbulence. IBM generates an impressive amount of free cash flow and its 47% payout ratio means that dividend is stable and likely to increase in the years to come.",
    "At the time of this writing, Laura Hoy was long SBUX, FB and NFLX stock.",
    "The post 9 Stocks That Every 20-Year-Old Should Buy appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:06:04"
}