{
  "url": "https://www.nasdaq.com/article/principal-financial-group-inc-pfg-ex-dividend-date-scheduled-for-september-04-2019-cm1206522",
  "title": "Principal Financial Group Inc (PFG) Ex-Dividend Date Scheduled for September 04, 2019 - Nasdaq.com",
  "text": [
    "Principal Financial Group Inc ( PFG  ) will begin trading ex-dividend on September 04, 2019. A cash dividend payment of $0.55 per share is scheduled to be paid on September 27, 2019. Shareholders who purchased PFG prior to the ex-dividend date are eligible for the cash dividend payment. This represents an 1.85% increase over prior dividend payment. At the current stock price of $53.22, the dividend yield is 4.13%.",
    "The previous trading day's last sale of PFG was $53.22, representing a -12.93% decrease from the 52 week high of $61.12 and a 31.67% increase over the 52 week low of $40.42.",
    "PFG is a part of the Finance sector, which includes companies such as Aflac Incorporated ( AFL  ) and Assurant, Inc. ( AIZ  ). PFG's current earnings per share, an indicator of a company's profitability, is $5.32. Zacks Investment Research reports PFG's forecasted earnings growth in 2019 as 5.88%, compared to an industry average of -.1%.",
    "For more information on the declaration, record and payment dates, visit the PFG Dividend History  page. Our  Dividend Calendar  has the full list of stocks that have an ex-dividend today.",
    " Interested in gaining exposure to PFG through an Exchange Traded Fund [ETF]?   The following ETF(s) have PFG as a top-10 holding:  Invesco High Yield Equity Dividend Achievers ETF (   PEY    ) Columbia Sustainable U.S. Equity Income ETF (   ESGS    ) Columbia Sustainable Global Equity Income ETF (   ESGW    ) Inspire Global Hope ETF (   BLES    ).  ",
    "The top-performing ETF of this group is PEY with an decrease of -1.9% over the last 100 days. It also has the highest percent weighting of PFG at 2.42%.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:00:04"
}