{
  "url": "https://www.nasdaq.com/article/ubs-to-revamp-investment-bank-in-effort-to-lift-flagging-earnings-20190905-00779",
  "title": "UBS to revamp investment bank in effort to lift flagging earnings - Nasdaq.com",
  "text": [
    "By Brenna Hughes Neghaiwi and Oliver Hirt",
    "Sept 4 (Reuters) - Switzerland's UBS  plans another shake-up of its investment banking arm to help boost earnings and curb costs after tough market conditions precipitated a performance dip.",
    "The world's largest investment banks have had their worst start to a year since 2006, the latest data published by industry analyst Coalition on Thursday shows. ",
    "Switzerland's largest bank has shaken up its investment bank several times since the appointment of former investment banker Sergio Ermotti as chief executive in 2011, who implemented an overhaul including sweeping job cuts soon after taking over.",
    "UBS declined to comment on the latest planned revamp and an earlier Financial Times report that it would be announced on Thursday and could result in hundreds of job cuts at the group's investment bank, especially within its higher ranks.",
    "The Swiss bank's main equities unit will be merged with its smaller foreign exchange, rates and credit trading (FRC) operations to form a single 'Global Markets' securities and trading unit, people familiar with the matter said.",
    "On the advisory side, Ros Stephenson and Javier Oficialdegui would be named global co-heads of the newly renamed Global Banking unit, overseeing global M&A, IPOs and capital markets activities, they added.",
    "Debt and equity capital markets will be combined into one global unit led by Brendan Connolly, formerly the head of leveraged debt capital markets.",
    "Piero Novelli and Robert Karofsky, who assumed joint leadership of the overall investment bank after Andrea Orcel's departure last year, will remain in their roles.",
    "Several major banks have cut jobs in their investment banking divisions in response to weak results, including Deutsche Bank , HSBC , Societe Generale  and Citigroup .",
    "UBS has already been making changes and last week appointed former Credit Suisse  manager Iqbal Khan to co-lead its flagship wealth management business, as part of a broader shake-up of its executive board. ",
    "The revamp helped address questions about succession planning for UBS CEO Ermotti, and drum up enthusiasm for the world's largest wealth manager.",
    "UBS has faced challenges ranging from sluggish client trading to a multi-billion court case in France in recent years and client activity has remained subdued of late, one executive said, adding: \"There is no reason for them to be optimistic\"."
  ],
  "published_datetime": "2019-09-05 11:04:00"
}