{
  "url": "https://www.nasdaq.com/article/ex-dividend-reminder-cno-financial-group-american-national-insurance-and-travelers-companies-cm1207796",
  "title": "Ex-Dividend Reminder: CNO Financial Group, American National Insurance and Travelers Companies - Nasdaq.com",
  "text": [
    "Looking at the universe of stocks we cover at Dividend Channel  , on 9/9/19, CNO Financial Group Inc (Symbol: CNO), American National Insurance Co. (Symbol: ANAT), and Travelers Companies Inc (Symbol: TRV) will all trade ex-dividend for their respective upcoming dividends. CNO Financial Group Inc will pay its quarterly dividend of $0.11 on 9/24/19, American National Insurance Co. will pay its quarterly dividend of $0.82 on 9/20/19, and Travelers Companies Inc will pay its quarterly dividend of $0.82 on 9/30/19. As a percentage of CNO's recent stock price of $14.89, this dividend works out to approximately 0.74%, so look for shares of CNO Financial Group Inc to trade 0.74% lower - all else being equal - when CNO shares open for trading on 9/9/19. Similarly, investors should look for ANAT to open 0.70% lower in price and for TRV to open 0.54% lower, all else being equal.    Below are dividend history charts for CNO, ANAT, and TRV, showing historical dividends prior to the most recent ones declared.   CNO Financial Group Inc (Symbol: CNO)  :   makeArticleAd();    American National Insurance Co. (Symbol: ANAT)  :        Travelers Companies Inc (Symbol: TRV)  :         In general, dividends are not always predictable, following the ups and downs of company profits over time. Therefore, a good first due diligence step in forming an expectation of annual yield going forward, is looking at the history above, for a sense of stability over time. This can help in judging whether the most recen t dividends  from these companies are likely to continue. If they do continue, the current estimated yields on annualized basis would be 2.96% for CNO Financial Group Inc, 2.80% for American National Insurance Co. , and 2.17% for Travelers Companies Inc .    In Thursday trading, CNO Financial Group Inc shares are currently up about 2.4%, American National Insurance Co. shares are up about 0.7%, and Travelers Companies Inc shares are up about 0.8% on the day.   Click here to learn which 25 S.A.F.E. dividend   stocks should be on your radar screen »  ",
    "  Click here to learn which 25 S.A.F.E. dividend   stocks should be on your radar screen » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:02:49"
}