{
  "url": "https://www.nasdaq.com/article/how-is-tanger-dealing-with-the-retail-apocalypse-cm1208153",
  "title": "How Is Tanger Dealing With the Retail Apocalypse? - Nasdaq.com",
  "text": [
    "  Tanger Factory Outlet Centers    (NYSE: SKT) is unique among   real estate investment trust    s (REIT) in that it is the only one focused exclusively on outlet   centers. Investors don't appear too pleased with this niche   approach today, with the stock down 26% since the start of the   year and the yield up to around 10%. Management is telling   investors that it's working through the headwinds -- store   closings and retailer bankruptcies -- and that it's just a matter   of time until things get better. But will the old playbook be enough to deal with the so-called   \"   retail apocalypse    \"? Tanger financials look solid Looking at the metrics, Tanger has been holding up reasonably   well as online shopping slices an increasing share of the retail   pie.makeArticleAd(); For example, occupancy rates are still strong and hover in the   mid-90% range. That puts it among the highest of its enclosed   mall peers (which isn't a perfect comparison group, but it is the   one that fits best). Basically, it is keeping its malls   filled. Sales per square foot, meanwhile, has remained between $380   and $395 over the last five years or so, with an uptick over the   last six months to the high end of that range. While this   sales-per-square-foot range would be low for an enclosed mall,   Tanger's outlet-focused business model is different and the   actual number isn't the most important takeaway. The big story is   that consumers are still coming to Tanger's outlets and shopping   at similar levels despite the retail apocalypse. And occupancy   costs for its tenants remain low relative to other options,   suggesting it remains a good place for companies to put a   store. So, despite the stock price weakness, Tanger's business is   hardly dying.   Image source: Getty Images.  Also important is the fact that Tanger remains financially   strong. It has an   investment-grade-    rated   balance sheet    . Total debt to adjusted assets is 49%, well below a 60% debt   covenant. Only 6% of its square footage is encumbered by   mortgages (largely related to joint venture assets). It covers   its interest expenses five times over, meaning that debt costs   aren't an issue. And it's used just 3% of its credit facility,   suggesting that it has ample liquidity. Despite being financially strong and performing reasonably   well, investors remain concerned: Can Tanger's business model   stand up to the continuing flow of store closures as consumers   shift to online shopping? One of the sectors that seems to factor   into investors' concerns is fashion. Clothing has long been one   of Tanger's biggest focus areas. Tanger management's attitude is \"We got this!\" So far, Tanger has been telling investors that it has handled   headwinds like this before and survived. That this time is no   different and that the same playbook it has used in the past will   work again. Effectively, it is granting rent concessions to   tenants to keep occupancy high (and, thus, its outlet centers   desirable for lessees and consumers). Meanwhile, it is working to   add new tenants to replace ones that are leaving, largely due to   bankruptcies. CEO Steve Tanger noted during the   second-quarter conference call    :  Look, we've always had tenant turnover every year. It's a     fact of life and 10 years from now, we still will be talking     about tenant turnover. But the names of our major tenants are     totally different today than they were 10 years ago.  Here's the thing, that's not \"totally\" true. If you go in and   look at Tanger's top 10 tenants in 2018 and compare the list to   2008, there are notable differences. But they aren't as big as   they may at first appear. Some names have fallen off the top-10   list and some have been added, but a lot of the movement is with   the underlying brands -- many of which have simply changed hands.   Essentially, the lists are roughly similar and (perhaps just as   important) both are heavily focused on fashion:    Data source: Tanger Factory Outlet Center company filings. Tanger has been stepping outside its comfort zone to try new   concepts, like adding discount fashion stores to the mix. Since   customers can often find the same clothing in an outlet store as   in a discount store, it chose to test the concept before going   all in. It took the time to open one   TJ Maxx     store in one outlet center to ensure that it didn't affect   other tenants before looking to expand the relationship. It   didn't jump in with both feet and risk hurting its overall   results. Tanger is also adding more health- and food-related   stores to expand further beyond the fashion niche. Tanger's approach bends conservative These efforts are largely at the margins, though. That's not   surprising given the conservative nature of the company. And   Tanger is not being nearly as aggressive with   \"densification\" as other mall REITs    . This is the rental concept of bringing in hotels, rental   apartments, and healthcare facilities to fill empty space. Tanger   prefers to let the adjoining retail space around its outlet   centers evolve over time, with the areas organically adding such   things without the need for the REIT to take on the risk or cost   of the effort. The end result, however, is similar (an increased   customer base), but the timing is less certain and likely more   drawn out. The big question then: Is Tanger doing enough? When Tanger has   been faced with challenges in the past they have been around   recessionary periods    . What it is dealing with today is a shift in the way customers   are shopping, largely taking place during an expansionary period.   This time may, in fact, be different. But is it different enough   to require a totally new approach? That's not clear just yet, and   investors who own Tanger are basically betting that it can make   this transition with the same slow and steady approach that it   has always used before. The worst-case scenario With a strong balance sheet and a business that appears to be   holding up reasonably well, the risk of Tanger's going out of   business is very low. It will likely survive the \"retail   apocalypse,\" even if it manages only to muddle through. So the   real risk today is the dividend, which was well covered in 2018,   eating up only 56% of   funds from operations    (FFO), in line with typical earnings for a REIT. If there is a   recession or more fashion stores hit the skids and close up shop,   Tanger's fat dividend could be at risk of getting cut. And that   potential is what is causing the stock price drop we've been   seeing. Slow and steady Tanger looks like a decent   value play    , but go in with your eyes open to the risks it is facing. The   playbook it is using may need to be updated a little to deal with   the hit from the growth of online shopping. I own the stock, am   losing money on my position, and have no plans to sell it at this   point ... but I'm not adding more. What I am doing is letting   that fat dividend reinvest and looking at other REITs in the   deeply out-of-favor mall space with more diversified   portfolios.   10 stocks we like better than Tanger Factory Outlet     Centers       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Tanger Factory Outlet     Centers wasn't one of them! That's right -- they think these 10     stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019         Reuben Gregg Brewer        owns shares of Tanger Factory Outlet Centers. The Motley Fool       owns shares of and recommends Carter's, Nike, Tapestry, Under       Armour (A Shares), and Under Armour (C Shares). The Motley       Fool owns shares of G-III Apparel Group. The Motley Fool       recommends Tanger Factory Outlet Centers    and The TJX Companies        . The Motley Fool has a       disclosure policy        .   ",
    " Tanger Factory Outlet Centers    (NYSE: SKT) is unique among   real estate investment trust    s (REIT) in that it is the only one focused exclusively on outlet   centers. Investors don't appear too pleased with this niche   approach today, with the stock down 26% since the start of the   year and the yield up to around 10%. Management is telling   investors that it's working through the headwinds -- store   closings and retailer bankruptcies -- and that it's just a matter   of time until things get better.",
    "But will the old playbook be enough to deal with the so-called   \"   retail apocalypse    \"?",
    "Looking at the metrics, Tanger has been holding up reasonably   well as online shopping slices an increasing share of the retail   pie.",
    "For example, occupancy rates are still strong and hover in the   mid-90% range. That puts it among the highest of its enclosed   mall peers (which isn't a perfect comparison group, but it is the   one that fits best). Basically, it is keeping its malls   filled.",
    "Sales per square foot, meanwhile, has remained between $380   and $395 over the last five years or so, with an uptick over the   last six months to the high end of that range. While this   sales-per-square-foot range would be low for an enclosed mall,   Tanger's outlet-focused business model is different and the   actual number isn't the most important takeaway. The big story is   that consumers are still coming to Tanger's outlets and shopping   at similar levels despite the retail apocalypse. And occupancy   costs for its tenants remain low relative to other options,   suggesting it remains a good place for companies to put a   store.",
    "So, despite the stock price weakness, Tanger's business is   hardly dying.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Also important is the fact that Tanger remains financially   strong. It has an   investment-grade-    rated   balance sheet    . Total debt to adjusted assets is 49%, well below a 60% debt   covenant. Only 6% of its square footage is encumbered by   mortgages (largely related to joint venture assets). It covers   its interest expenses five times over, meaning that debt costs   aren't an issue. And it's used just 3% of its credit facility,   suggesting that it has ample liquidity.",
    "Despite being financially strong and performing reasonably   well, investors remain concerned: Can Tanger's business model   stand up to the continuing flow of store closures as consumers   shift to online shopping? One of the sectors that seems to factor   into investors' concerns is fashion. Clothing has long been one   of Tanger's biggest focus areas.",
    "So far, Tanger has been telling investors that it has handled   headwinds like this before and survived. That this time is no   different and that the same playbook it has used in the past will   work again. Effectively, it is granting rent concessions to   tenants to keep occupancy high (and, thus, its outlet centers   desirable for lessees and consumers). Meanwhile, it is working to   add new tenants to replace ones that are leaving, largely due to   bankruptcies.",
    "CEO Steve Tanger noted during the   second-quarter conference call    :",
    "Look, we've always had tenant turnover every year. It's a     fact of life and 10 years from now, we still will be talking     about tenant turnover. But the names of our major tenants are     totally different today than they were 10 years ago.",
    "Here's the thing, that's not \"totally\" true. If you go in and   look at Tanger's top 10 tenants in 2018 and compare the list to   2008, there are notable differences. But they aren't as big as   they may at first appear. Some names have fallen off the top-10   list and some have been added, but a lot of the movement is with   the underlying brands -- many of which have simply changed hands.   Essentially, the lists are roughly similar and (perhaps just as   important) both are heavily focused on fashion:",
    "Data source: Tanger Factory Outlet Center company filings.",
    "Tanger has been stepping outside its comfort zone to try new   concepts, like adding discount fashion stores to the mix. Since   customers can often find the same clothing in an outlet store as   in a discount store, it chose to test the concept before going   all in. It took the time to open one   TJ Maxx     store in one outlet center to ensure that it didn't affect   other tenants before looking to expand the relationship. It   didn't jump in with both feet and risk hurting its overall   results. Tanger is also adding more health- and food-related   stores to expand further beyond the fashion niche.",
    "These efforts are largely at the margins, though. That's not   surprising given the conservative nature of the company. And   Tanger is not being nearly as aggressive with   \"densification\" as other mall REITs    . This is the rental concept of bringing in hotels, rental   apartments, and healthcare facilities to fill empty space. Tanger   prefers to let the adjoining retail space around its outlet   centers evolve over time, with the areas organically adding such   things without the need for the REIT to take on the risk or cost   of the effort. The end result, however, is similar (an increased   customer base), but the timing is less certain and likely more   drawn out.",
    "The big question then: Is Tanger doing enough? When Tanger has   been faced with challenges in the past they have been around   recessionary periods    . What it is dealing with today is a shift in the way customers   are shopping, largely taking place during an expansionary period.   This time may, in fact, be different. But is it different enough   to require a totally new approach? That's not clear just yet, and   investors who own Tanger are basically betting that it can make   this transition with the same slow and steady approach that it   has always used before.",
    "With a strong balance sheet and a business that appears to be   holding up reasonably well, the risk of Tanger's going out of   business is very low. It will likely survive the \"retail   apocalypse,\" even if it manages only to muddle through. So the   real risk today is the dividend, which was well covered in 2018,   eating up only 56% of   funds from operations    (FFO), in line with typical earnings for a REIT. If there is a   recession or more fashion stores hit the skids and close up shop,   Tanger's fat dividend could be at risk of getting cut. And that   potential is what is causing the stock price drop we've been   seeing.",
    "Slow and steady Tanger looks like a decent   value play    , but go in with your eyes open to the risks it is facing. The   playbook it is using may need to be updated a little to deal with   the hit from the growth of online shopping. I own the stock, am   losing money on my position, and have no plans to sell it at this   point ... but I'm not adding more. What I am doing is letting   that fat dividend reinvest and looking at other REITs in the   deeply out-of-favor mall space with more diversified   portfolios.",
    "  10 stocks we like better than Tanger Factory Outlet     Centers       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Tanger Factory Outlet     Centers wasn't one of them! That's right -- they think these 10     stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Tanger Factory Outlet     Centers       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Tanger Factory Outlet     Centers wasn't one of them! That's right -- they think these 10     stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "   Reuben Gregg Brewer        owns shares of Tanger Factory Outlet Centers. The Motley Fool       owns shares of and recommends Carter's, Nike, Tapestry, Under       Armour (A Shares), and Under Armour (C Shares). The Motley       Fool owns shares of G-III Apparel Group. The Motley Fool       recommends Tanger Factory Outlet Centers    and The TJX Companies        . The Motley Fool has a       disclosure policy        .  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 12:13:23"
}