{
  "url": "https://www.nasdaq.com/article/why-aerovironment-stock-popped-11-this-morning-cm1208191",
  "title": "Why AeroVironment Stock Popped 11% This Morning - Nasdaq.com",
  "text": [
    "Military drone makerAeroVironment (NASDAQ: AVAV) stunned Wall Street with a major earnings beat this morning, sending its shares flying in early trading. As of 12:30 p.m. EDT, the stock is still up a healthy 4.1%, but it's given back a lot of its gains already.",
    "Expected to report fiscal Q1 2020 sales of $86.3 million and per-share profits of $0.35, AeroVironment instead told investors it earned $0.71 per share on sales of $86.9 million, beating on both the top and bottom lines.",
    "Image source: Getty Images.",
    "Fiscal first-quarter 2020 sales increased 11% versus last year's Q1. Profits either declined by 16% when calculated according to generally accepted accounting principles ( GAAP ), or grew by 25% ( pro forma ). Funded backlog of work to be done expanded by 5%, foreshadowing further growth to come.",
    "CEO Wahid Nawabi credited \"strong performance globally in our small unmanned aircraft systems product line\" for the positive results. He further predicted continued strength as AeroVironment expands its acquired \"VAPOR unmanned helicopter solutions\" business and said the company is getting better \"visibility into the timing of U.S. Army orders for our Switchblade tactical missile systems.\"",
    "In dollars and cents, what that means is that for full-year fiscal 2020, AeroVironment is now predicting it will generate sales of between $350 million and $370 million, earning between $1.35 and $1.55 per diluted share. Pro forma profits should be $1.47 to $1.67 per share.",
    "Given that analysts are still looking for full-year sales of less than $357 million and pro forma profits of only $1.51 per share, AeroVironment's forecast is stronger than what many had expected, which explains why the shares went up so much this morning. As for why the stock has since retreated somewhat...I can only hazard a guess at that.",
    "Twist my arm, though, and I'd point out that free cash flow this past quarter was a bare $1.2 million -- down two-thirds from the $3.6 million generated in last year's Q1, and far below the $17.1 million \"profit\" claimed on AeroVironment's income statement. If investors are worrying that the company's earnings quality is suspect due to cash not backing up more of the reported profit, well, that could explain their waning enthusiasm for the stock.",
    "10 stocks we like better than AeroVironment\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and AeroVironment wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Rich Smith has no position in any of the stocks mentioned. The Motley Fool recommends AeroVironment. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 01:24:06"
}