{
  "url": "https://www.nasdaq.com/article/is-commercial-metals-cmc-outperforming-other-basic-materials-stocks-this-year-cm1210446",
  "title": "Is Commercial Metals (CMC) Outperforming Other Basic Materials Stocks This Year? - Nasdaq.com",
  "text": [
    " Investors focused on the Basic Materials space have likely heard of Commercial Metals (CMC), but is the stock performing well in comparison to the rest of its sector peers? One simple way to answer this question is to take a look at the year-to-date performance of CMC and the rest of the Basic Materials group's stocks. Commercial Metals is a member of the Basic Materials sector. This group includes 247 individual stocks and currently holds a Zacks Sector Rank of #13. The Zacks Sector Rank considers 16 different sector groups. The average Zacks Rank of the individual stocks within the groups is measured, and the sectors are listed from best to worst. The Zacks Rank emphasizes earnings estimates and estimate revisions to find stocks with improving earnings outlooks. This system has a long record of success, and these stocks tend to be on track to beat the market over the next one to three months. CMC is currently sporting a Zacks Rank of #2 (Buy). The Zacks Consensus Estimate for CMC's full-year earnings has moved 6.68% higher within the past quarter. This means that analyst sentiment is stronger and the stock's earnings outlook is improving. Based on the most recent data, CMC has returned 8.80% so far this year. Meanwhile, the Basic Materials sector has returned an average of 8.19% on a year-to-date basis. As we can see, Commercial Metals is performing better than its sector in the calendar year. To break things down more, CMC belongs to the Steel - Producers industry, a group that includes 28 individual companies and currently sits at #192 in the Zacks Industry Rank. On average, this group has lost an average of 5.84% so far this year, meaning that CMC is performing better in terms of year-to-date returns. CMC will likely be looking to continue its solid performance, so investors interested in Basic Materials stocks should continue to pay close attention to the company.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Commercial Metals Company (CMC): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors focused on the Basic Materials space have likely heard of Commercial Metals (CMC), but is the stock performing well in comparison to the rest of its sector peers? One simple way to answer this question is to take a look at the year-to-date performance of CMC and the rest of the Basic Materials group's stocks.",
    "Commercial Metals is a member of the Basic Materials sector. This group includes 247 individual stocks and currently holds a Zacks Sector Rank of #13. The Zacks Sector Rank considers 16 different sector groups. The average Zacks Rank of the individual stocks within the groups is measured, and the sectors are listed from best to worst.",
    "The Zacks Rank emphasizes earnings estimates and estimate revisions to find stocks with improving earnings outlooks. This system has a long record of success, and these stocks tend to be on track to beat the market over the next one to three months. CMC is currently sporting a Zacks Rank of #2 (Buy).",
    "The Zacks Consensus Estimate for CMC's full-year earnings has moved 6.68% higher within the past quarter. This means that analyst sentiment is stronger and the stock's earnings outlook is improving.",
    "Based on the most recent data, CMC has returned 8.80% so far this year. Meanwhile, the Basic Materials sector has returned an average of 8.19% on a year-to-date basis. As we can see, Commercial Metals is performing better than its sector in the calendar year.",
    "To break things down more, CMC belongs to the Steel - Producers industry, a group that includes 28 individual companies and currently sits at #192 in the Zacks Industry Rank. On average, this group has lost an average of 5.84% so far this year, meaning that CMC is performing better in terms of year-to-date returns.",
    "CMC will likely be looking to continue its solid performance, so investors interested in Basic Materials stocks should continue to pay close attention to the company.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:30:13"
}