{
  "url": "https://www.nasdaq.com/article/bet-on-low-risk-etfs-for-a-historically-worst-september-cm1208133",
  "title": "Bet on Low-Risk ETFs for a Historically Worst September - Nasdaq.com",
  "text": [
    " After a brutal August, Wall Street is expected to continue its sluggish trend, given the persistent headwinds, especially trade gyrations, and a historically weak month  makeArticleAd(); Web Woes    Trade between the United States and China remained an overhang on the stocks. Both the countries have implemented their latest tariff increases on each other's goods effective Sep 1. The Trump administration raised tariffs from 10% to 15% on $112 billion worth of Chinese goods including footwear, apparel and Apple (AAPL) Watches, while China imposed retaliatory tariffs on some goods from the United States, including pork, beef, chicken and agricultural goods, on its $75 billion target list.    Trump plans to levy duties on further $160 billion in Chinese products such as laptops and cellphones in mid-December. China plans to ramp up tariffs on soybeans to 30% from 25% in mid-December. Though the trade representatives from the world's two biggest economies are expected to resume talks next month, tariff hike will hurt U.S. consumers, pushing up the prices of goods and thereby curtailing spending. It will further impact worldwide economy and corporate profits, particularly at big U.S. exporters (read: 5 ETF Zones to Take Shelter From Trade War  ).    Further, rounds of weak global economic data, low inflation, collapse in bond yields, geopolitical tension and Brexit concerns have also kept investors on the edge. The chaos has triggered several rounds of broad market sell-off in August and may cause further drop this month. The most notable U.S. manufacturing data to start September came up with disappointing numbers. The U.S. manufacturing PMI unexpectedly contracted for first time in three years amid China trade war.   Historical Underperformance    September is historically the worst month for the stock market. According to Dow Jones Market Data, the Dow Jones Industrial Average and the S&P 500 have witnessed average declines of 1% each since 1937. The Nasdaq Composite, which was introduced in 1971, also dropped 0.5% on average. Per Bespoke Investment Group, the stocks have posted an average decline of 0.92% over the past 50 years. Since 1950, September has been the worst month for the S&P 500 with average decline of 0.5% during the month, according to LPL Financial.    The declines are due to a seasonal phenomenon as investors are more prone to selling than buying when they return from their summer vacations, trading volume after Labor Day is mostly bearish, many mutual funds have fiscal years ending Sep 30, window-dressing is rampant, and investors generally sell stocks to pay tuition bills for their kids' private schools and colleges (read: August ETF Events That Grab Headlines  ).    Against such a backdrop, those seeking to remain invested in the equity world could consider low-risk ETFs by picking low volatility products.   Why?    Low risk ETFs have the potential to outpace the broader market in bearish market conditions or in an uncertain environment, providing significant protection to the portfolio. This is because these funds include more stable stocks that have experienced the least price movement in their portfolio. Further, these allocate more to defensive sectors that usually have a higher distribution yield than the broader markets.    Below we have presented five ETFs that could be solid options for investors in the current choppy market:   iShares Edge MSCI Min Vol USA ETF USMV     This fund offers exposure to 212 U.S. stocks having lower volatility characteristics than the broader U.S. equity market by tracking the MSCI USA Minimum Volatility Index. It is well spread across a number of securities, with none holding more than 1.8% of the assets. From a sector look, information technology, financials, consumer staples, and healthcare take the top four spots with a double-digit allocation each. With AUM of $33.4 billion, the product charges 0.15% in expense ratio and trades in solid average daily volume of 3.9 million shares. It has a Zacks ETF Rank #2 (Buy) with a Medium risk outlook.   Invesco S&P 500 Low Volatility ETF SPLV     This ETF provides exposure to stocks with the lowest realized volatility over the past 12 months. It tracks the S&P 500 Low Volatility Index and holds 100 securities in its basket with none accounting for more than 1.3% of assets. Utilities, financials, and real estate make up the top three sectors with a double-digit allocation each. SPLV has amassed $12.3 billion in its asset base and trades in heavy volume of around 3.2 million shares a day on average. It charges 25 bps in annual fees and has a Zacks ETF Rank #3 with a Medium risk outlook (read: Low-Volatility ETF Hits New 52-Week High  ).   Nationwide Risk-Based U.S. Equity ETF RBUS     This ETF follows the Rothschild & Co Risk-Based US Index and employs a risk-based strategy that seeks to provide upside potential while protecting against losses stemming from volatility. It holds well-diversified 250 stocks in its basket, with none of the securities accounting for more than 2.4% share. Utilities, financial services, consumer defense, healthcare and consumer cyclical are the top five sectors. RBUS has accumulated $114.6 million and charges 30 bps in annual fees. It trades in a thin volume of 6,000 shares a day on average.   SPDR Russell 1000 Low Volatility Focus ETF ONEV     This fund follows the Russell 1000 Low Volatility Focused Factor Index and focuses on stocks that exhibit low volatility and offer downside protection. It holds 463 securities in its basket, with none accounting for more than 0.81% of assets. Financial services, consumer discretionary and producer durables are the top three sectors with a double-digit allocation each. The ETF has AUM of $545.3 million and charges 20 bps in annual fees. It trades in average daily volume of about 9,000 shares and has a Zacks ETF Rank #3 (read: Low Volatility ETFs for Turbulent Times  ).   Fidelity Low Volatility Factor ETF FDLO     This fund offers exposure to stocks with lower volatility than the broader market by tracking the Fidelity U.S. Low Volatility Factor Index. Holding 129 stocks in its basket, it is well spread across components, with none holding more than 4.5% share. From a sector look, the ETF is skewed toward the information technology sector at 21.7% while healthcare, financials, and consumer discretionary round off the next three spots with a double-digit allocation each. The fund has been able to garner just $268.8 million in AUM so far and average daily volume is also moderate at 64,000 shares. FDLO charges 29 bps in annual fees from investors.   Bottom Line    These products could be worthwhile for investors with low risk tolerance and have the potential to outperform the broad market, especially if trade fears and the historically weak month continue to dent sentiments.   Want key ETF info delivered straight to your inbox?    Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week. Get it free >>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   SPDR Russell 1000 Low Volatility Focus ETF (ONEV): ETF Research Reports   Invesco S&P 500 Low Volatility ETF (SPLV): ETF Research Reports   Fidelity Low Volatility Factor ETF (FDLO): ETF Research Reports   iShares Edge MSCI Min Vol USA ETF (USMV): ETF Research Reports   Nationwide Risk-Based U.S. Equity ETF (RBUS): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    "After a brutal August, Wall Street is expected to continue its sluggish trend, given the persistent headwinds, especially trade gyrations, and a historically weak month  makeArticleAd(); Web Woes    Trade between the United States and China remained an overhang on the stocks. Both the countries have implemented their latest tariff increases on each other's goods effective Sep 1. The Trump administration raised tariffs from 10% to 15% on $112 billion worth of Chinese goods including footwear, apparel and Apple (AAPL) Watches, while China imposed retaliatory tariffs on some goods from the United States, including pork, beef, chicken and agricultural goods, on its $75 billion target list.    Trump plans to levy duties on further $160 billion in Chinese products such as laptops and cellphones in mid-December. China plans to ramp up tariffs on soybeans to 30% from 25% in mid-December. Though the trade representatives from the world's two biggest economies are expected to resume talks next month, tariff hike will hurt U.S. consumers, pushing up the prices of goods and thereby curtailing spending. It will further impact worldwide economy and corporate profits, particularly at big U.S. exporters (read: 5 ETF Zones to Take Shelter From Trade War  ).    Further, rounds of weak global economic data, low inflation, collapse in bond yields, geopolitical tension and Brexit concerns have also kept investors on the edge. The chaos has triggered several rounds of broad market sell-off in August and may cause further drop this month. The most notable U.S. manufacturing data to start September came up with disappointing numbers. The U.S. manufacturing PMI unexpectedly contracted for first time in three years amid China trade war.   Historical Underperformance    September is historically the worst month for the stock market. According to Dow Jones Market Data, the Dow Jones Industrial Average and the S&P 500 have witnessed average declines of 1% each since 1937. The Nasdaq Composite, which was introduced in 1971, also dropped 0.5% on average. Per Bespoke Investment Group, the stocks have posted an average decline of 0.92% over the past 50 years. Since 1950, September has been the worst month for the S&P 500 with average decline of 0.5% during the month, according to LPL Financial.    The declines are due to a seasonal phenomenon as investors are more prone to selling than buying when they return from their summer vacations, trading volume after Labor Day is mostly bearish, many mutual funds have fiscal years ending Sep 30, window-dressing is rampant, and investors generally sell stocks to pay tuition bills for their kids' private schools and colleges (read: August ETF Events That Grab Headlines  ).    Against such a backdrop, those seeking to remain invested in the equity world could consider low-risk ETFs by picking low volatility products.   Why?    Low risk ETFs have the potential to outpace the broader market in bearish market conditions or in an uncertain environment, providing significant protection to the portfolio. This is because these funds include more stable stocks that have experienced the least price movement in their portfolio. Further, these allocate more to defensive sectors that usually have a higher distribution yield than the broader markets.    Below we have presented five ETFs that could be solid options for investors in the current choppy market:   iShares Edge MSCI Min Vol USA ETF USMV     This fund offers exposure to 212 U.S. stocks having lower volatility characteristics than the broader U.S. equity market by tracking the MSCI USA Minimum Volatility Index. It is well spread across a number of securities, with none holding more than 1.8% of the assets. From a sector look, information technology, financials, consumer staples, and healthcare take the top four spots with a double-digit allocation each. With AUM of $33.4 billion, the product charges 0.15% in expense ratio and trades in solid average daily volume of 3.9 million shares. It has a Zacks ETF Rank #2 (Buy) with a Medium risk outlook.   Invesco S&P 500 Low Volatility ETF SPLV     This ETF provides exposure to stocks with the lowest realized volatility over the past 12 months. It tracks the S&P 500 Low Volatility Index and holds 100 securities in its basket with none accounting for more than 1.3% of assets. Utilities, financials, and real estate make up the top three sectors with a double-digit allocation each. SPLV has amassed $12.3 billion in its asset base and trades in heavy volume of around 3.2 million shares a day on average. It charges 25 bps in annual fees and has a Zacks ETF Rank #3 with a Medium risk outlook (read: Low-Volatility ETF Hits New 52-Week High  ).   Nationwide Risk-Based U.S. Equity ETF RBUS     This ETF follows the Rothschild & Co Risk-Based US Index and employs a risk-based strategy that seeks to provide upside potential while protecting against losses stemming from volatility. It holds well-diversified 250 stocks in its basket, with none of the securities accounting for more than 2.4% share. Utilities, financial services, consumer defense, healthcare and consumer cyclical are the top five sectors. RBUS has accumulated $114.6 million and charges 30 bps in annual fees. It trades in a thin volume of 6,000 shares a day on average.   SPDR Russell 1000 Low Volatility Focus ETF ONEV     This fund follows the Russell 1000 Low Volatility Focused Factor Index and focuses on stocks that exhibit low volatility and offer downside protection. It holds 463 securities in its basket, with none accounting for more than 0.81% of assets. Financial services, consumer discretionary and producer durables are the top three sectors with a double-digit allocation each. The ETF has AUM of $545.3 million and charges 20 bps in annual fees. It trades in average daily volume of about 9,000 shares and has a Zacks ETF Rank #3 (read: Low Volatility ETFs for Turbulent Times  ).   Fidelity Low Volatility Factor ETF FDLO     This fund offers exposure to stocks with lower volatility than the broader market by tracking the Fidelity U.S. Low Volatility Factor Index. Holding 129 stocks in its basket, it is well spread across components, with none holding more than 4.5% share. From a sector look, the ETF is skewed toward the information technology sector at 21.7% while healthcare, financials, and consumer discretionary round off the next three spots with a double-digit allocation each. The fund has been able to garner just $268.8 million in AUM so far and average daily volume is also moderate at 64,000 shares. FDLO charges 29 bps in annual fees from investors.   Bottom Line    These products could be worthwhile for investors with low risk tolerance and have the potential to outperform the broad market, especially if trade fears and the historically weak month continue to dent sentiments.   Want key ETF info delivered straight to your inbox?    Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week. Get it free >> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:59:00"
}