{
  "url": "https://www.nasdaq.com/article/healthequitys-growth-slows-as-management-focuses-on-the-long-term-cm1207392",
  "title": "HealthEquity's Growth Slows as Management Focuses on the Long Term - Nasdaq.com",
  "text": [
    "  HealthEquity    (NASDAQ: HQY) , a leading provider of health savings   accounts (HSAs), reported its fiscal 2020   second-quarter results on Tuesday. HealthEquity has been in a state of flux over the last couple   of months. The company announced its intention to   acquire WageWorks in April    . The deal officially closed on Aug. 30, but   HealthEquity began to make investments in itself ahead of   the closing. At the same time, management has purposely shifted   its attention away from service and interchange revenue growth in   favor of boosting custodial revenue. That change caused its   top-line growth rate to slow. When combined with a higher tax   rate and increased spending, its bottom line took a step   backward. HealthEquity fiscal 2020 Q2 results: The raw numbers  Data source: HealthEquity.   GAAP    = generally accepted accounting principles.makeArticleAd();   Image source: Getty Images.  What happened with HealthEquity this quarter?  Custodial revenue, which is earned from assets held     under management, continues to be the star of the show and grew     42% to $43.6 million. Service revenue and interchange revenue     grew by 5% and 8%, respectively, as management continues     to lower its fees in an effort to bring more value to its     customers. Custodial assets under management, which is the total     amount of money that is held in members' accounts, grew 21% to     $8.5 billion. Total HSA membership increased 16% to 4.2 million. HSA members who held investments grew 31% to 187,000. Gross margin rose 200 basis points to 67.5%. HealthEquity closed its acquisition of WageWorks on Aug.     30. The combined company is now the largest HSA administrator     by accounts in the country. Operating expenses rose to 39% of revenue during the period     due to integration costs and strategic investments in the     business. Elevated spending levels and a higher tax rate were the     primary causes of the decline in net income. Non-GAAP net income was $29.4 million, or $0.45 per     share.   Check out the latest           earnings call      transcript for  HealthEquity      .  What management had to say  CEO Jon Kessler    remained excited about the progress that has been made in 2019   and the opportunity ahead of the newly combined company:  We believe that HealthEquity's results in the second quarter     and the speedy close of the WageWorks acquisition     position us for a strong second half selling season.     HealthEquity's more than 215,000 new HSAs and $400     million in custodial asset growth in the first half     provides the team the opportunity to once again outpace HSA     market growth this year. HealthEquity's unique combined     offering of HSAs and consumer-directed benefits will enable us     to continue building our leading HSA market position.  On the conference call with investors, Kessler also   talked up a handful of regulatory developments that bode well for   continued growth in the HSA market: \"The IRS clarified and   expanded the scope of HSA qualified plans to include plan designs   with more coverage for chronic conditions. And bipartisan   legislation introduced in the House would extend the benefits of   HSAs to all Medicare recipients.\" Looking ahead The WageWorks acquisition will start to impact the company's   financial statements in the upcoming quarter. To avoid confusion,   management plans on providing investors with guidance for   HealthEquity and WageWorks on a stand-alone basis for the   remainder of the year. With that in mind, here's what management now expects to   happen in fiscal 2020:  Revenue is now expected to land between $341 million and     $347 million. That's up from its prior guidance range of $333     million to $339 million. WageWorks should contribute an additional $170 million to     $175 million in revenue. GAAP net income is expected to land between $9 million and     $13 million. Non-GAAP net income should come in between $76 million and     $80 million, or $1.10 to $1.16 per share. That's down from its     prior range of $83 million to $87 million, or $1.28 to $1.31     per share. The drop is mostly attributable to the inclusion of     interest expense related to the new $1.25 billion in debt that     was issued to fund the WageWorks acquisition.  Investors sold off HealthEquity's stock in the trading session   following the earnings release. The most likely reason for the   decline is the reduced guidance range for full-year non-GAAP   earnings per share. That's an understandable reaction given   that HealthEquity is considered a   high-growth business     and trades at a premium valuation. HealthEquity's management team is purposely sacrificing profit   growth now in an effort to build a more robust company over time.   Only time will tell if those investments will pay off.   Shareholders will need to remain patient.   10 stocks we like better than HealthEquity       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and HealthEquity wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Brian Feroldi      owns shares of HealthEquity. The Motley Fool owns shares of and     recommends HealthEquity. The Motley Fool has a     disclosure policy      .  ",
    " HealthEquity    (NASDAQ: HQY) , a leading provider of health savings   accounts (HSAs), reported its fiscal 2020   second-quarter results on Tuesday.",
    "HealthEquity has been in a state of flux over the last couple   of months. The company announced its intention to   acquire WageWorks in April    . The deal officially closed on Aug. 30, but   HealthEquity began to make investments in itself ahead of   the closing. At the same time, management has purposely shifted   its attention away from service and interchange revenue growth in   favor of boosting custodial revenue. That change caused its   top-line growth rate to slow. When combined with a higher tax   rate and increased spending, its bottom line took a step   backward.",
    "Data source: HealthEquity.   GAAP    = generally accepted accounting principles.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    " Check out the latest           earnings call      transcript for  HealthEquity      . ",
    " CEO Jon Kessler    remained excited about the progress that has been made in 2019   and the opportunity ahead of the newly combined company:",
    "We believe that HealthEquity's results in the second quarter     and the speedy close of the WageWorks acquisition     position us for a strong second half selling season.     HealthEquity's more than 215,000 new HSAs and $400     million in custodial asset growth in the first half     provides the team the opportunity to once again outpace HSA     market growth this year. HealthEquity's unique combined     offering of HSAs and consumer-directed benefits will enable us     to continue building our leading HSA market position.",
    "On the conference call with investors, Kessler also   talked up a handful of regulatory developments that bode well for   continued growth in the HSA market: \"The IRS clarified and   expanded the scope of HSA qualified plans to include plan designs   with more coverage for chronic conditions. And bipartisan   legislation introduced in the House would extend the benefits of   HSAs to all Medicare recipients.\"",
    "The WageWorks acquisition will start to impact the company's   financial statements in the upcoming quarter. To avoid confusion,   management plans on providing investors with guidance for   HealthEquity and WageWorks on a stand-alone basis for the   remainder of the year.",
    "With that in mind, here's what management now expects to   happen in fiscal 2020:",
    "Investors sold off HealthEquity's stock in the trading session   following the earnings release. The most likely reason for the   decline is the reduced guidance range for full-year non-GAAP   earnings per share. That's an understandable reaction given   that HealthEquity is considered a   high-growth business     and trades at a premium valuation.",
    "HealthEquity's management team is purposely sacrificing profit   growth now in an effort to build a more robust company over time.   Only time will tell if those investments will pay off.   Shareholders will need to remain patient.",
    "  10 stocks we like better than HealthEquity       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and HealthEquity wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than HealthEquity       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and HealthEquity wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Brian Feroldi      owns shares of HealthEquity. The Motley Fool owns shares of and     recommends HealthEquity. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:40:52"
}