{
  "url": "https://www.nasdaq.com/article/jeff-clarks-market-minute-this-hasnt-happened-in-three-years-cm1207473",
  "title": "Jeff Clark’s Market Minute: This Hasn’t Happened in Three Years - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "The gold sector is on the verge of generating its first sell signal since 2016.",
    " Gold stocks have had an amazing run higher over the past few months. The sector has been much stronger than I anticipated. And, the current rally has lasted much longer than I thought it would.",
    "But, the gold sector remains vulnerable to a sharp and swift pullback. And even though my mom isn't talking to me these days because  I talked her out of buying gold stocks last month , my advice to her would still be the same today…",
    "You will have a better opportunity to buy gold stocks at lower prices in the weeks and months ahead. One of my favorite gold-stock timing indicators is on the verge of a sell signal.",
    "Take a look at this chart of the Gold Miners Bullish Percent Index ($BPGDM)…",
    "A bullish percent index is a gauge of overbought and oversold conditions. It measures the percentage of stocks in a sector that are trading in a bullish technical formation. Since it's measured as a percentage, a bullish percent index can only reach as high as 100 or fall as low as zero.",
    "Typically, a sector is extremely overbought when its bullish percent index rallies above 80. It's extremely oversold when it drops below 20. Trading signals get triggered when the index reaches extreme levels and then reverses.",
    "For example, last September, the $BPGDM turned higher from a deeply oversold reading of 13. That action triggered a \"buy\" signal. At the time, the VanEck Vectors Gold Miners Fund (GDX) was trading for a little less than $19 per share. Yesterday, GDX closed around $30.50.",
    "It took a while to get going, but that turned out to be one heck of a buy signal.",
    "Today, though, things look a little different.",
    "The $BPGDM is trading above 87. That indicates an extremely overbought condition.",
    "It hasn't turned lower. So we don't yet have a \"sell\" signal. But, the gold sector is clearly overbought. And with GDX trading nearly 50% higher than where it started the year, now is probably not a good time to be buying into the sector.",
    "The last time we got a $BPGDM sell signal was back in August 2016. That also happens to be the last time the Commercial Trader net-short interest was over 330,000 contracts. That was also the last time GDX was trading above $30 per share.",
    "Two months later, GDX was back down to $23.",
    "Now, I'm not saying we're headed for the same sort of decline this time around. I'm just suggesting that right now is probably not the best time to be putting new money to work in the gold sector. We'll likely have a better chance to do so in the months ahead.",
    "Best regards and good trading,",
    "Jeff Clark",
    "Claim The Complete Blueprint From America's Top Options Expert",
    "For the past 36 years, millionaire trader Jeff Clark's options strategies have helped everyday people have the chance to retire wealthy.",
    "Which is why Jeff's now offering his complete Blueprint, and a year of his guidance, for just $19.",
    "That's right… for a limited time, it's all yours for less than twenty bucks.",
    "Because Jeff knows that every dollar that you use on his strategies could turn into a windfall in a short amount of time.",
    "Get started here.",
    "The post Jeff Clark's Market Minute: This Hasn't Happened in Three Years appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:16:08"
}