{
  "url": "https://www.nasdaq.com/article/2-reasons-to-buy-the-dip-in-ulta-beauty-stock-cm1207471",
  "title": "2 Reasons to Buy the Dip in Ulta Beauty Stock - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Shares of Ulta Beauty (NASDAQ: ULTA ) plunged in late August after the cosmetic retailer's second-quarter earnings report missed estimates across the board. ULTA stock dropped a whopping 30% in response, and currently trades at its lowest levels since Christmas Eve 2018.",
    "Was the report really that bad? Ostensibly, yes. Ulta missed on everything. In the quarter, comparable sales came in shy of estimates, as did revenues, margins and profits. Management also cut the guide everywhere, citing weakness across the entire cosmetics industry. The company also significantly reduced the sales, comps, margin and profit guides.",
    "Broadly speaking, it was about as bad a quarter as Ulta could've reported. Also, heading into the print, ULTA stock was trading at a historically rich 27-times forward price-to-earnings multiple.",
    "Considering all that, the 30% post-earnings plunge in ULTA stock shouldn't be too surprising. This was an overvalued stock that reported miserable numbers.",
    "But, I think this huge selloff in Ulta stock is an opportunity. Why? Two big reasons.",
    "First, near-term headwinds in the cosmetics industry won't last. They will pass. When they do, Ulta's numbers will improve. Second, considering its long-term growth potential, ULTA stock is now undervalued, and the stock has sizable upside in the event the numbers do improve from here.",
    "I think it may be time to buy the dip in ULTA stock. The quarter was ugly, but this is still a winning stock with a ton of long-term growth firepower.",
    "All the growth trends at Ulta are going in the opposite direction. Comparable sales growth is slowing. Store growth and revenue growth are slowing, too. Expanding margins are turning into compressing margins. Big profit growth is turning into markedly smaller profit growth.",
    "The theme of Ulta's Q2 conference call was that this adverse growth trend reversal is being driven by a slowdown in the macro U.S. cosmetics industry. Specifically, according to management, what was red-hot growth across the entire U.S. cosmetics category earlier this decade, has slowed meaningfully over the past two years, and actually turned negative in 2019.",
    "Against the backdrop of this slowing growth industry, Ulta's top- and bottom-line momentum is similarly slowing.",
    "This all makes a ton of sense. The cosmetics industry has been very hot for a long time. It needs to cool off, and as the market goes through this necessary cooling period, Ulta's growth rates will naturally take a hit. Importantly, though, this slowdown won't last.",
    "History shows us that any and all slowdowns in the U.S. personal care industry over the past two decades have been small and short-lived. During that stretch, personal care sales have risen at a fairly steady 4% compounded annual growth rate, and there have never been back-to-back years of declines.",
    "There's no reason to believe this slowdown will be the exception to the longer running trend. The secular drivers here - mainly, the proliferation of visual-first social media wherein consumers are sharing pictures and videos of themselves all the time - imply that consumers still want (need?) to look good, and will continue to spend big on cosmetics.",
    "As such, near-term macro U.S. cosmetics headwinds aren't here to stay for the long run. They will pass. When they do, this whole market will resume on its secular march higher.",
    "Despite the horrible quarter, Ulta is still a growth company in a growth industry. For a growth company in a growth industry, ULTA stock is materially undervalued at the current moment - leaving room for substantial upside when the numbers improve.",
    "Everything is slowing at Ulta right now. Yet, the company is still projected to grow sales at a 10%-plus rate this year alongside 10%-plus profit growth. To be sure, most of this growth is driven by unit growth (7% unit growth projected this year), and margins are in decline. But, management projects that comps will remain solidly positive (5% for the year), and margins should rebound when the cosmetics industry rebounds.",
    "In the big picture, Ulta will continue to serve as a physical commerce launching board for digitally native and emerging cosmetics brands over the next several years, at the same time that it continues to expand its physical retail footprint. As it does both of those things, the company will continue to gain market share in the 4% growth U.S. cosmetics industry. That implies high single-digit revenue growth as the norm going forward.",
    "Margins should creep higher as high single-digit revenue growth should be enough to drive marginally positive operating leverage. Buybacks will remain in play, too. All together, Ulta should be a low double-digit profit grower for the next several years. Realistically, that pegs earnings per share somewhere north of $20 by 2025.",
    "Based on a growth stock average 20-times forward multiple, that implies a 2024 price target for ULTA stock of over $400. Discounted back by 10% per year, that implies a 2019 price target of about $250 - markedly above today's $230 price tag.",
    "Near-term pain in ULTA stock won't last. Heading into the Q2 print, you had an overvalued stock on a decelerating growth trajectory. Now, you have an undervalued stock with the opportunity to re-accelerate growth over the next few quarters.",
    "Consequently, it appears that the worst of the Ulta correction is in the rear-view mirror. Going forward, ULTA stock should rebound from today's depressed levels.",
    "As of this writing, Luke Lango did not hold a position in any of the aforementioned securities. ",
    "The post 2 Reasons to Buy the Dip in Ulta Beauty Stock appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:24:34"
}