{
  "url": "https://www.nasdaq.com/article/napco-security-technologies-inc-nssc-q4-2019-earnings-call-transcript-cm1206932",
  "title": "NAPCO Security Technologies Inc (NSSC) Q4 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   NAPCO Security Technologies Inc    (NASDAQ: NSSC)        Q4 2019 Earnings Call       Sep 3, 2019 ,   11:00 a.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Greetings, and welcome to the NAPCO Security Technologies,   Inc. Fiscal Fourth Quarter 2019 and Full-Year Results Conference   Call. At this time, all participants are in a listen-only mode. A   brief question-and-answer session will follow the formal   presentation. [Operator Instructions] It is now my pleasure to introduce your host, Mr. Patrick   McKillop, Director of Investor Relations. Thank you. You may   begin.  Patrick McKillop    --   Director of Investor Relations  Thank you. Good morning, and thank you all for joining us for   today's conference call to discuss our financial results for our   fiscal fourth quarter 2019 and fiscal year 2019. By now, all of   you should have had the opportunity to review the press release   discussing the results. If you have not, a copy of the release is   available in the Investor Relations sections of our website   www.napcosecurity.com. On the call today is Richard Soloway,   President and CEO of NAPCO Security Technologies; and Kevin   Buchel, Senior Vice President and CFO. Before we begin, let me take a moment to read the   forward-looking statement. This conference call may contain   forward-looking statements that involve numerous risks and   uncertainties. Actual results, performance or achievements may   differ materially from those anticipated in such forward-looking   statements as a result of certain factors, including those set   forth in the Company's filings with the SEC. During the call, we may also present certain Non-GAAP   financial measures, such as adjusted EBITDA and certain ratios   that are used with these measures. In the press release and on   the financial tables issued earlier today, you'll find the   definition of these non-GAAP financial measures, a reconciliation   of these non-GAAP financial measures with the closest GAAP   financial measure, as well as a discussion about why we think   these non-GAAP financial measures are relevant to our results.   These financial measures are included for the benefit of   investors and should not be considered instead of GAAP   measures. I will turn the call over to Dick in a moment, but before I   do, I just want to mention a few things on the IR front. In terms   of upcoming investor outreach, we will be attending and hosting a   one-on-one meeting at the Lake Street Big3 conference on   September 12th in New York and also at the CL King Conference in   New York on September 19th. Investor outreach is crucial   especially for small cap companies such as NAPCO. And I would   like to thank all of those folks that assist us in these   conferences and marketing trips. With that out of the way, let me turn the call over to Richard   Soloway, President and CEO of NAPCO Security Technologies. Dick,   the floor is yours.  Richard L. Soloway    --   President and Chief Executive Officer  Thank you, Patrick. Good morning, everyone, and welcome to our   conference call. Thank you for joining us today to discuss our   results. The fourth quarter and fiscal year 2019 marked another   record revenue and profitability performance for NAPCO. Our SaaS   recurring revenues continued to grow at a rapid rate. Our   recurring revenues annual run rate is now $20.4 million as of   June. Our focus on targeting the professional installations and   mostly commercial end market is driving this continuous   growth. Our balance sheet remains strong with zero debt as of this   report, and our cash balances continue to grow. Capitalizing on   key industry trends, including school security solution, wireless   fire and intrusion alarm communicators, enterprise access control   system and architectural locking products remains our focus. The   management team here at NAPCO continues to focus on the key   metrics of growth, profit and return on equity. These metrics are   important for us as well as our shareholders. Our business   strategy is to executing well and our interests are aligned with   our shareholders as senior management at NAPCO owns 38% of the   equity. Before I go into greater detail, I'll now turn the call over   to our CFO, Kevin Buchel. He will provide an overview of our   fiscal fourth quarter and fiscal year financial results, and then   I'll be back with more on our strategies and outlook. Kevin?  Kevin S. Buchel    --   Senior Vice President of Operations and Finance and Chief   Financial Officer  Thank you, Dick, and good morning, everybody. For the fourth   quarter, net sales increased 9% to $29.6 million, which was a   record quarterly performance and the 20th consecutive quarter of   year-over-year record sales, as compared to $27.3 million for the   same period a year ago. For fiscal 2019, net sales increased 12%   to a record $102.9 million, as compared with $91.7 million a year   ago. The increase in sales for the quarter were primarily related   to increased sales of our alarm communication services,   door-locking products and access control products. For the full   fiscal year, the increase in sales was primarily related to   increased sales from alarm communication services and products,   door-locking products and access control products. Recurring   monthly revenue from the alarm division increased 44% for the   quarter and 45% for the fiscal year. Recurring revenue now has an   annual run rate of $20.4 million based on June 2019 recurring   revenue. Gross profit for the fourth quarter increased 7% to $12.9   million with a gross margin of 44%, as compared to $12.1 million   with a gross margin of 45% last year. Gross profit for fiscal   year 2019 increased 16% to $43.9 million with a gross margin of   43%, as compared to $38 million with a gross margin of 41% last   year. The increase in gross profit for the fourth quarter and the   fiscal year was primarily due to the increase in sales as   partially offset by increased salary and freight expenses. The slight decrease in gross margin in the fourth quarter was   primarily due to product mix, as well as additional sales   discounts given related to several new product launches. The   increase in gross margin for the fiscal year was primarily due to   the 45% increase in recurring revenue, where the gross margin was   78%, as well as the leverage from the Dominican Republic   manufacturing facility generated from equipment revenue increases   of 7%. Also, please note that the tariff situation with China has   no effect on our margins as we manufacture virtually 100% in the   Dominican Republic. Even when we get raw materials from China,   they're shipped directly to the DR, so no tariffs. Our   competition is not as fortunate. They have tariff issues on both   finished and raw material. R&D expenses for the fourth quarter increased 8% to $1.9   million or 6% of sales compared to $1.7 million or 6% of sales   last year. For the fiscal year, R&D expenses increased 9% to   $7.2 million or 7% of sales as compared to $6.6 million or 7% of   sales last year. The increase for the three months and the full   year was primarily due to additional personnel. SG&A expenses for Q4 increased 3% year-over-year to $6.3   million or 21% of sales as compared to $6.1 million or 23% of   sales last year. For the fiscal 2019, SG&A expenses increased   1% to $23.2 million or 23% of sales as compared to $23 million or   25% of sales last year. The increases in dollars was primarily   from increases in employee compensation. The decrease as a   percentage of sales was primarily the result of the percentage   increase of sales exceeding the increase in selling, general and   administrative expense. Operating income for the fourth quarter increased 11% to $4.8   million as compared to $4.3 million last year. For the fiscal   year, operating income increased 60% to $13.5 million compared to   $8.4 million last year. Income tax expense for the quarter decreased by $531,000 to   $35,000, as compared to $566,000 last year. Income tax expense   for fiscal 2019 increased $538,000 to $1.2 million as compared to   $684,000 for the same period a year ago. The decrease in income   tax expense for the fourth quarter was primarily due to the   recognition of increased R&D tax credit. The increase in   income tax expense for the fiscal year was primarily due to the   aforementioned increase in operating income. The Company's   effective tax rate remained relatively constant at 9% for fiscal   2019 as compared to 8% for fiscal 2018. Net income for the fourth quarter increased 28% to a fourth   quarter record of $4.7 million, which equates to 16% of net sales   or $0.26 per diluted share as compared to $3.7 million or $0.20   per diluted share last year. For the year, net income increased   60% to a record $12.2 million, which equates to 12% of net sales   or $0.66 per diluted share, as compared to $7.6 million or $0.41   per diluted share for the same period a year ago. The change in   net income for the quarter and the year ended June 30, 2019, was   primarily due to the items previously mentioned. Adjusted EBITDA for the quarter, as outlined in the schedule   included in today's press release, increased 10% to $5.2 million,   which equates to 17% of net sales or $0.28 per diluted share   compared to $4.7 million or $0.25 per diluted share last year.   For the year, adjusted EBITDA increased 51% to $15 million, which   equates to 15% of net sales or $0.81 per diluted share as   compared to $10 million or $0.53 for diluted share last year. Moving on to the balance sheet. The cash balance at June 30,   2019, was $8 million as compared to $5.3 million at June 30,   2018. Our working capital as of June 30, 2019 was $51.1 million   as compared to $44.3 million at June 30, 2018. Current ratio is   4.6:1 at June 30, 2019 as compared with 5.7:1 at June 30, 2018.   And debt remained at zero at June 30, 2019. Net cash provided by operating activities for the quarter was   $2.9 million[Phonetic] and for the full fiscal year was $8.7   million. Inventory levels remain higher than normal as we are   gearing up for several new product launches, including iSecure,   our new Marks' anti-ligature lock, and our new line of AT&T   LTE StarLink Radio, all of which, I think, we'll cover   momentarily. Capex was $388,000 during the quarter and was 1.9 --   $1,988,000 for the year. That concludes my formal remarks, and I would now like to   return the call back to Dick.  Richard L. Soloway    --   President and Chief Executive Officer  Kevin, thank you. The growth of our business is strong, and we   believe the trend will continue in the future. Demand for our   recurring revenue product is coming from alarm communications,   including fire, intrusion and the growth of the smart home   category. We continue to believe that the market opportunity for   school security in the United States is significant. There are   approximately 100,000 K-12 and 10,000 colleges and universities   in the US. None of us will ever forget the tragic event that took   place during 2018 and continue to take place this year. We remain   dedicated to providing solutions and products that schools that   desperately need. During our past conference calls, we have discussed an   increased volume of legislation being passed by many states since   2018, which includes funding of $1 billion. According to a US   News & World Report article from earlier this year, states   are considering nearly 250 different school safety builds in   2019. This underscores how the issue remains front and center for   everyone. The federal government, you may recall, in 2018 passed   a grant program which has allocated $100 million dollars per year   through 2028 for school security. We're also aware of other   pending legislation, which we are monitoring. The pipeline for   school security products looks robust. And we will continue to   announce new wins when we can, as we need to receive approval   from the schools prior to doing so. Recently, we have witnessed more and more active shooter   incidences taking place at houses of worship and other public   meeting places. We have seen a need to expand the use of our SAVI   audit system for these location. The continuing violence in   public area is painting a clear picture for the need to secure   these areas with our products, such as wireless locks and access   control. During Q4, we began the launch of our new AT&T LTE   StarLink line of universal fire, intrusion alarm and IoT   communicators. We now have StarLink lines on both Horizon and the   AT&T LTE network, which provides our dealers with the largest   LTE service coverage in the US. Also, we will be launching the   new version of our Marks Division anti-ligature locks. These   locks meet ADA, that's American with Disabilities Act,   requirements as well as the BHMA highest anti-ligature standard.   The shaping and structure of these locksets are designed to   restrict the attachment of lines, laces, etc, to doorknobs and   levers. The locksets are offered in unprecedented, cylindrical,   mortise styles, models and functions and provide easy   installation and retrofit to all popular door constructions. We are very excited about the upcoming launch of our latest   product iSecure. It was debuted at the ISC West Trade Show in Las   Vegas in April of this year. The iSecure is designed for the new   breed of professional installers and savvy consumers. It has   quick installation time, and its advanced features are perfect   for smart home applications so in demand today. The iSecure won   the MVP, that's the Most Valuable Product, Award in the Home   Controls category at the trade show and drew lots of traffic from   dealers into our trade show booth. Lastly, our FireLink Fire Alarm Control Panel with a built-in   cellular communicator was launched earlier this year. FireLink,   an all-in-one 8-32 zone fire alarm panel with built-in cellular   LTE StarLink-powered communicator, has grown quickly in sales.   FireLink comes pre-configured and pre-activated enabling easy   installation and cost savings for dealer. FireLink will add to   our already rapidly growing recovering revenue. We'll begin our Q&A session portion of this call in a   moment. Our fiscal year 2019 was a very successful record-breaking   year for us as we continued to grow the Company and deliver   strong profits. Our shareholders have been rewarded with very   healthy returns and stock performance. NAPCO is in a strong   position to continue its growth in sales and profits going   forward. We are excited about the future fiscal year 2020 and   beyond. NAPCO's senior management maintains a higher level of   ownership in our equity, approximately 38%, and I would like to   thank everyone for their support and for joining us in the   exciting future we have. Our formal remarks are now concluded. We'd like to open the   call for the Q&A session. Operator, please proceed. Questions and Answers:  Operator  Thank you. We'll now be conducting a question-and-answer   session. [Operator Instructions] Our first question comes from   the line of Jaeson Schmidt with Lake Street Capital. Please   proceed with your question.  Jaeson Schmidt    --   Lake Street Capital -- Analyst  Hey, guys. Thanks for taking my questions. I just want to   start with the security market -- school security market. It   seems like you are seeing some really nice traction there. Can   you comment if you're seeing the size of the installed increasing   over the past few months here?  Richard L. Soloway    --   President and Chief Executive Officer  This -- good morning. There are many different types of jobs   that we're getting, and some of them are larger than others, and   we always find that with the jobs that we do, the schools,   especially universities, keep adding to that. So we've done some   schools -- we've gone back four times, keep doing the dorm   buildings and the classrooms and the executive offices. But   they're all different sizes all over the country. If you've seen   the press releases we've put out, they're all starting to come   together where localities want to protect their students, come to   the realization this is not going to stop unless something major   is done in policy within the country, which that looks like that   kind of stymied, I don't know what's going to happen with   that. So the only way around all this is to put in school security.   And our line of school security is the widest school security   line in the industry. And that we make stand-alone, we make   remote control, we make systems where you can have a man trap and   lock an active shooter between doorways. There are different ways   of configuring our systems that we're very flexible. So we expect   that to continue small, medium and large job, and each job   increasing in volume as they add more facilities too them.  Jaeson Schmidt    --   Lake Street Capital -- Analyst  Okay. That's helpful. And along those lines, just given the   increasing correction in that market, do you expect to need to   add to headcount in a significant way to address all the   opportunities?  Richard L. Soloway    --   President and Chief Executive Officer  We have a very nice network of sales agents and reps and in   fact, we've made an integration between the Marks group and the   Alarm Lock group. So we have more sales people, and they are more   intense in their territory. But we don't expect to see an   increase in -- for the new year. In fact, this year the SG&A   was basically flat. We are very budget conscious. We wanted to   make sure we get the most efficiency out of each of our sales   people. As far as the manufacturing side of the business, we're   in the Dominican Republic. Our components are shipped in from all   over Asia, and we do all our assembly there. The minimum wage in   the Dominican Republic is $2,500 a year, so it's not really   material. If you get another 50 workers assembling products, the   margins are great on the product, so that it's not really a   material effect. So we're pretty stable in both of these areas,   both sales, marketing and manufacturing.  Jaeson Schmidt    --   Lake Street Capital -- Analyst  Okay. And the last one for me and I'll jump back into queue. I   know previously you threw out a $40 million recurring revenue run   rate target for fiscal 2021. Do you still feel confident in that   target?  Kevin S. Buchel    --   Senior Vice President of Operations and Finance and Chief   Financial Officer  Not only do I feel confident -- it's Kevin. Not only do I feel   confident, Jaeson, I thought, we would be pushing hard to get to   $20 million -- we got to twenty $20.4 million run rate. $40   million, we could beat it. And I'm just keeping -- I'm still   saying $40 million. But if we had recurring revenue into the   other areas of the business, like we talked about, we try to get   it into the locking side, the access, we'll blow past the $40   million. For now, let's just call it $40 million by June of   2021.  Jaeson Schmidt    --   Lake Street Capital -- Analyst  Okay. Thanks a lot, guys.  Kevin S. Buchel    --   Senior Vice President of Operations and Finance and Chief   Financial Officer  You're welcome, Jaeson.  Richard L. Soloway    --   President and Chief Executive Officer  Thank you.  Operator  Thank you. Our next question comes from the line of Mike   Walkley with Canaccord Genuity. Please proceed with your   question.  Mike Walkley    --   Canaccord Genuity -- Analyst  Great. Thanks. Great to see the recurring revenue growth and   reiteration of targets. Just a question for me on the hardware   gross margin side. What about -- maybe a little bit closer to 40%   with the $24 million hardware revenue achieved this quarter, can   you talk a little bit about the mix that impacted margins for the   quarter and maybe a little more color on some of the price   discounts that you gave during the quarter?  Kevin S. Buchel    --   Senior Vice President of Operations and Finance and Chief   Financial Officer  One of the[Phonetic] things -- we tried to do by -- is to   capture a lot of the AT&T radio market -- LTE. And we   introduced that in the fourth quarter, and our thought process   was to capture that market, because once we start getting the   recurring revenue, we got that pretty much for life. It is a big   market. We didn't have it. We're starting to get it. I would put   about 2% margin effect in the quarter because of that. So I would   have expected normal situation to be at 40% also. We came in and   basically set 37%. So there is a 3% differential. 2% I would say,   is because of discounts we gave on the new product introduction.   1%, I would say, is due to the mixed -- sometimes there's mix   differences. If we get a big school job at a university in one   quarter and you get a job that's not as big the following year,   that could easily affect it by 1%. Nothing that we saw out of the   ordinary to have a 1% differential on mix. Not that unusual. The   part that was different was the 2% because of discount. Virtually   all due to the AT&T LTE radio intro.  Mike Walkley    --   Canaccord Genuity -- Analyst  Great, thanks. And then maybe just building on that, you   highlighted all kinds of new products ramping in the coming   quarters. How should we think maybe about mix from the new   products? How does that impact gross margin in the short term on   the hardware side? Obviously, growing recurring revenue is great   for the long term, but how should we maybe think about short-term   margins given some of these new products coming into the   model?  Kevin S. Buchel    --   Senior Vice President of Operations and Finance and Chief   Financial Officer  I think, in Q1 you'll see a little more of what we saw in Q4   in the introduction, because the LTE -- that's a big area for us.   You'll see a little more of that. I don't think you'll see any   discounting or we introduce the new anti-lig, that's a very   expensive high margin product to begin with. And everybody wants   to get their hands on the new version. We don't have to do that.   We're like one of the few that manufactured this. The iSecure   that's coming out of the gate very aggressively priced. We don't   have to discount that beyond what it is. People are going to jump   at that, just because the price is so good right out of the gate.   It is going to blow away the competition. So I don't expect any   discounting on that one either. It's really a little bit more on   the radio side, but we believe that the recurring growing   dramatically like it has with 78% to 80% gross margin that -- it   will more than make up for that.  Mike Walkley    --   Canaccord Genuity -- Analyst  Thanks, and last question for me and I'll pass on. Just on the   recurring revenue given your conference, you still think of like   40% plus year-over-year growth rate? Or does it slow in the short   term and accelerate as the new products start to ramp? And then   secondly, just given the ramp at AT&T, any color how it's   going so far, maybe relative to the Verizon launch? Thank   you.  Richard L. Soloway    --   President and Chief Executive Officer  We expect that, the $40 million is the number that we're going   to hit in June 30, 2021[Phonetic] year. We think that with the   AT&T, the iSecure and some of the locking products that are   going to be generating recurring revenue, which is revolutionary   for the business never been done before in the whole industry.   Locks traditionally don't generate recurring revenue. They're a   one-off sale, but our versions of the locks will generate   recurring revenue. The installation companies as well as end   users. We think that we can go beyond the $40 million and we'll   do -- do to get our market share. But I think that the price   point that we've established are going to be pretty stable. And   we're going to hit that number of $40 million and beyond. That's   how we look at it.  Mike Walkley    --   Canaccord Genuity -- Analyst  Thanks. Thank you.  Richard L. Soloway    --   President and Chief Executive Officer  Okay, Mike.  Operator  Thank you. Our next question comes from the line of Matt Pfau   with William Blair. Please proceed with your question.  Matt Pfau    --   William Blair -- Analyst  Hey, guys. Thanks for taking my questions. I wanted to ask on   hardware growth in the quarter. It's the lowest for the year. And   -- but the full year was about 7%, which is sort of in line with   what you guys have talked about longer term. Was there anything   disappointing in the quarter or one-off in the quarter that had   that growth rate below the other quarters and the year? And how   do we think about that growth rate going forward as the fourth   quarter more indicative of the go forward, or is the full-year   growth more of how we should think about it?  Kevin S. Buchel    --   Senior Vice President of Operations and Finance and Chief   Financial Officer  The hardware growth for the full year of 7% was one of the   highest increases we've had in years. We've been saying our goal   is to get the high single or double digit. So 7%, we're on our   way to high single, I don't think there's any reason for us to   believe why we can't do more better from a percentage point of   view for fiscal 2020. Since we're introducing so many things   between, iSecure, the new anti-lig, the new radios, the FireLink   panel hasn't been out that long. We're doing -- we spend a lot of   money on R&D, for us a lot, hasn't gone up by that much but   $7.2 million this past year? They're spending a lot of time on   doing a lot of things that get us more recurring and more   hardware. The hardware sales is very important to us too. The   Dominican leverage we talked about is very important. Just we   didn't see it as much in Q4, but you saw it for the full year.   And that's a big part of what we're doing. We're getting so busy   down there. We're going to be going to a second shift on radios   soon. These are all good things. So if I was projecting out, I   would still believe that low-single -- I mean, high-single digits   for Q -- for the full year, even though it was lower in Q4 it's   Still a goal and still very achievable.  Matt Pfau    --   William Blair -- Analyst  Got it. And then on the school security side, you mentioned   all these funding bills that are out there and the fees that have   passed. How big of an impact has the government funding been to   the school security business or is that still more of an   opportunity with some of these bills being passed, potentially   accelerating the growth of that business?  Richard L. Soloway    --   President and Chief Executive Officer  We're seeing an increase in school security jobs. We're   publishing them as we get them. There's many, many more queue if   the schools are being -- it they're getting some funding from   their regional area, we expect there's going to be federal   funding, there is going to be legislation put out. So all of this   primes the pump to get a lot more business. And since we have a   offering for K-12, which are low-cost, easy-to-convert K-12 to   more secure places for the student and not that expensive to do.   Schools are jumping the gun and doing their own financing of this   through state legislature and counties around the country. The   college or universities have large endowments. They're using that   money in anticipation of more money coming down. And we're seeing   a better situation in the schools that make these moves, and   they're going to be much more protective for the students. So we see this all in a very positive light. It's going to   take many, many years of growth and the schools will be secure.   But as far as we could see, I could see five years of continuous   school growth ahead of us, and the big money is going to really   come down.  Matt Pfau    --   William Blair -- Analyst  Got it. And in terms of the hurricane that's currently   impacting the Caribbean, any impact there to your operations in   the Dominican? I realized it didn't hit there. But in terms of   getting the goods out of the Dominican to the US, are there any   disruption there from the hurricane?  Richard L. Soloway    --   President and Chief Executive Officer  We haven't -- we -- our factor is Category 5 in the Dominican   Republic. So the hurricane itself didn't hit. There's going to be   -- we ship things both by air and by sea. Though we haven't   gotten feedback yet from the ocean shipping companies. But they   are on top of their game. So we expect with the amount of   inventory we have here that we'll be able to satisfy all demand   and keep things rolling. But let's see how things go in the next   week or so.  Matt Pfau    --   William Blair -- Analyst  Okay. Got it. That's it for me, guys. Thanks a lot.  Richard L. Soloway    --   President and Chief Executive Officer  Thanks, Matt.  Operator  [Operator Instructions] Our next question comes from the line   of Jeff Kessler with Imperial Capital. Please proceed with your   question.  Jeff Kessler    --   Imperial Capital -- Analyst  Thank you. Thank you for taking my question. It's probably   fair to say that there is a little bit of a surprise up on the   analyst part in looking at how much you spent on some of the new   investments that you're making, the AT&T radio capturing that   part of that market? And I'm wondering -- this brings up two   questions. Number 1, do you think that, Number 1, by keeping this   under wraps, at least publicly, not talking about what you were   going to invest in, do you think you've been able to take the   competitive market a little bit by surprise since you've already   been in the Verizon side of the market? You haven't been in the   AT&T market so heavily. Do you think that you again, taken a   little bit of the AT&T folks on the communication side by   surprise? And Number 2, are these investments that you're making now,   where do you see the returns coming? Let's get -- if you want to   call it a little bit earlier and which ones are you going to be   taking a little bit longer to play out over the course of the   next fiscal year and a half?  Richard L. Soloway    --   President and Chief Executive Officer  Jeff, these are complicated questions. It's not an exact   science, but it's always good to sneak up on the competition, and   that's what the AT&T radios are very important launch, and   you hit the nail right on the head. We're going to have   tremendous success with AT&T radios to grow our recurring   revenue. And we had to do we had to do to run run the business in   a very solid way for mid-term and long-term, and that AT&T   radio nationwide makes us very unique of the fact that we're   doing fire with it as well as home and more business. So it's an   important thing to do, and it bodes well for our future. We   expect that between AT&T radios and iSecure and every iSecure   has a radio built into it, so that every alarm that's installed.   Going forward iSecure, which we expect to be a real volume   producer will generate recurring revenue for us. And having it on   all these network is very important. So if you want more detail,   we could do a conversation later on getting in deeper if you want   to go deeper than this.  Jeff Kessler    --   Imperial Capital -- Analyst  Sure. And as far as if you want to -- I don't see a schedule,   but what do you see as -- which are we going to be seeing the   returns from a little bit earlier, which are really seeing the   returns from a little bit later? Are those investments that you   were making over the last quarter and into -- and obviously into   the next quarter?  Richard L. Soloway    --   President and Chief Executive Officer  Our investments are -- we have this goal -- we have of the   goal at June 30, 2021 that we're going to be at $40 million in   recurring and we're going to be a $100 million in hardware   manufacturing. And if you put that together and you are over   $1.30 a share and that is our goal. And we're doing everything we   can to win market share to get to our goal and go beyond our   goal. And it looks like, this is working for us.  Jeff Kessler    --   Imperial Capital -- Analyst  Okay. One final question. One of the real big issues that I'm   dealing with right now and which the industry is -- overall is   dealing with right now to try to -- not just prop up, but to --   just to reinforce the value proposition is the difference between   verified and unverified alarm signals out there? The difference   between convenience and having a professional service, to have   police show up within five or six minutes on the residential   side, not just on the commercial side. What are you folks -- what   are you doing? And I'm thinking about iSecure in companies and   products like that. What are you doing to accelerate the   industry's -- the professional industry's ability to have police   and, of course, the PSAPs, 911[Phonetic] centers, except the   signals more readily and allow police to come in and respond   without having false alarms?  Richard L. Soloway    --   President and Chief Executive Officer  Well, a lot of the false alarms are caused by DIY products,   not professionally installed products. DIY products are not   attached to the walls, to the ceiling that well, they move and   they cause a false alarm or they're not close enough to the   magnetic contacts to go on the windows. So that caused a lot of   false alarms. Our iSecure is not aimed for the DIY market, but   its price point and its functionality is to put the dealer --   professional dealer in the game of installing more and more alarm   systems, which compete against the DIY products. So it's very professionally installed, which eliminate a lot   of the false alarms you're getting DIY. And we're trying to arm   our dealers and the dealers across the nation with a product,   which has a better return on investment, more reliable, more   feature rich and installs with less false alarms. That's our   contribution to what's going on. I   t report    s to all Central Station. It reports daily and it works to our   back-end NOC, which has the ability to give it additional   functionality to eliminate false alarm. And we can talk about   that off line -- since I know that you and the industry and us   were all components of keeping the police respond to real alarms   not false alarms, that's the major thing in the industry. But we   can talk offline and go through exactly what this does from a   [Speech Overlap]  Jeff Kessler    --   Imperial Capital -- Analyst  Great, Richard. Yes, that's great. Okay, thank you very much.   I Appreciate.  Richard L. Soloway    --   President and Chief Executive Officer  Alright.  Operator  Thank you. We have reached the end of our question-and-answer   session. I would like to turn the call back over to Mr. Soloway   for any closing remark.  Richard L. Soloway    --   President and Chief Executive Officer  Thank you, everyone, for participating in today's conference   call. As always, should you have any further questions, please   feel free to call Patrick, Kevin or myself for further   information. We thank you for your interest and support, and we   look forward to speaking to you all again in a few months to   NAPCO's fiscal Q1 2020 results. Bye-bye.  Operator  [Operator Closing Remarks]  Duration: 44 minutes  Call participants:  Patrick McKillop    --   Director of Investor Relations   Richard L. Soloway    --   President and Chief Executive Officer   Kevin S. Buchel    --   Senior Vice President of Operations and Finance and Chief   Financial Officer   Jaeson Schmidt    --   Lake Street Capital -- Analyst   Mike Walkley    --   Canaccord Genuity -- Analyst   Matt Pfau    --   William Blair -- Analyst   Jeff Kessler    --   Imperial Capital -- Analyst   More NSSC analysis   All earnings call transcripts        10 stocks we like better than Napco Security   Systems     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Napco Security   Systems wasn't one of them! That's right -- they think   these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " NAPCO Security Technologies Inc    (NASDAQ: NSSC)        Q4 2019 Earnings Call       Sep 3, 2019 ,   11:00 a.m. ET ",
    " Operator ",
    "Greetings, and welcome to the NAPCO Security Technologies,   Inc. Fiscal Fourth Quarter 2019 and Full-Year Results Conference   Call. At this time, all participants are in a listen-only mode. A   brief question-and-answer session will follow the formal   presentation. [Operator Instructions]",
    "It is now my pleasure to introduce your host, Mr. Patrick   McKillop, Director of Investor Relations. Thank you. You may   begin.",
    " Patrick McKillop    --   Director of Investor Relations ",
    "Thank you. Good morning, and thank you all for joining us for   today's conference call to discuss our financial results for our   fiscal fourth quarter 2019 and fiscal year 2019. By now, all of   you should have had the opportunity to review the press release   discussing the results. If you have not, a copy of the release is   available in the Investor Relations sections of our website   www.napcosecurity.com. On the call today is Richard Soloway,   President and CEO of NAPCO Security Technologies; and Kevin   Buchel, Senior Vice President and CFO.",
    "Before we begin, let me take a moment to read the   forward-looking statement. This conference call may contain   forward-looking statements that involve numerous risks and   uncertainties. Actual results, performance or achievements may   differ materially from those anticipated in such forward-looking   statements as a result of certain factors, including those set   forth in the Company's filings with the SEC.",
    "During the call, we may also present certain Non-GAAP   financial measures, such as adjusted EBITDA and certain ratios   that are used with these measures. In the press release and on   the financial tables issued earlier today, you'll find the   definition of these non-GAAP financial measures, a reconciliation   of these non-GAAP financial measures with the closest GAAP   financial measure, as well as a discussion about why we think   these non-GAAP financial measures are relevant to our results.   These financial measures are included for the benefit of   investors and should not be considered instead of GAAP   measures.",
    "I will turn the call over to Dick in a moment, but before I   do, I just want to mention a few things on the IR front. In terms   of upcoming investor outreach, we will be attending and hosting a   one-on-one meeting at the Lake Street Big3 conference on   September 12th in New York and also at the CL King Conference in   New York on September 19th. Investor outreach is crucial   especially for small cap companies such as NAPCO. And I would   like to thank all of those folks that assist us in these   conferences and marketing trips.",
    "With that out of the way, let me turn the call over to Richard   Soloway, President and CEO of NAPCO Security Technologies. Dick,   the floor is yours.",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    "Thank you, Patrick. Good morning, everyone, and welcome to our   conference call. Thank you for joining us today to discuss our   results. The fourth quarter and fiscal year 2019 marked another   record revenue and profitability performance for NAPCO. Our SaaS   recurring revenues continued to grow at a rapid rate. Our   recurring revenues annual run rate is now $20.4 million as of   June. Our focus on targeting the professional installations and   mostly commercial end market is driving this continuous   growth.",
    "Our balance sheet remains strong with zero debt as of this   report, and our cash balances continue to grow. Capitalizing on   key industry trends, including school security solution, wireless   fire and intrusion alarm communicators, enterprise access control   system and architectural locking products remains our focus. The   management team here at NAPCO continues to focus on the key   metrics of growth, profit and return on equity. These metrics are   important for us as well as our shareholders. Our business   strategy is to executing well and our interests are aligned with   our shareholders as senior management at NAPCO owns 38% of the   equity.",
    "Before I go into greater detail, I'll now turn the call over   to our CFO, Kevin Buchel. He will provide an overview of our   fiscal fourth quarter and fiscal year financial results, and then   I'll be back with more on our strategies and outlook. Kevin?",
    " Kevin S. Buchel    --   Senior Vice President of Operations and Finance and Chief   Financial Officer ",
    "Thank you, Dick, and good morning, everybody. For the fourth   quarter, net sales increased 9% to $29.6 million, which was a   record quarterly performance and the 20th consecutive quarter of   year-over-year record sales, as compared to $27.3 million for the   same period a year ago. For fiscal 2019, net sales increased 12%   to a record $102.9 million, as compared with $91.7 million a year   ago. The increase in sales for the quarter were primarily related   to increased sales of our alarm communication services,   door-locking products and access control products. For the full   fiscal year, the increase in sales was primarily related to   increased sales from alarm communication services and products,   door-locking products and access control products. Recurring   monthly revenue from the alarm division increased 44% for the   quarter and 45% for the fiscal year. Recurring revenue now has an   annual run rate of $20.4 million based on June 2019 recurring   revenue.",
    "Gross profit for the fourth quarter increased 7% to $12.9   million with a gross margin of 44%, as compared to $12.1 million   with a gross margin of 45% last year. Gross profit for fiscal   year 2019 increased 16% to $43.9 million with a gross margin of   43%, as compared to $38 million with a gross margin of 41% last   year. The increase in gross profit for the fourth quarter and the   fiscal year was primarily due to the increase in sales as   partially offset by increased salary and freight expenses.",
    "The slight decrease in gross margin in the fourth quarter was   primarily due to product mix, as well as additional sales   discounts given related to several new product launches. The   increase in gross margin for the fiscal year was primarily due to   the 45% increase in recurring revenue, where the gross margin was   78%, as well as the leverage from the Dominican Republic   manufacturing facility generated from equipment revenue increases   of 7%. Also, please note that the tariff situation with China has   no effect on our margins as we manufacture virtually 100% in the   Dominican Republic. Even when we get raw materials from China,   they're shipped directly to the DR, so no tariffs. Our   competition is not as fortunate. They have tariff issues on both   finished and raw material.",
    "R&D expenses for the fourth quarter increased 8% to $1.9   million or 6% of sales compared to $1.7 million or 6% of sales   last year. For the fiscal year, R&D expenses increased 9% to   $7.2 million or 7% of sales as compared to $6.6 million or 7% of   sales last year. The increase for the three months and the full   year was primarily due to additional personnel.",
    "SG&A expenses for Q4 increased 3% year-over-year to $6.3   million or 21% of sales as compared to $6.1 million or 23% of   sales last year. For the fiscal 2019, SG&A expenses increased   1% to $23.2 million or 23% of sales as compared to $23 million or   25% of sales last year. The increases in dollars was primarily   from increases in employee compensation. The decrease as a   percentage of sales was primarily the result of the percentage   increase of sales exceeding the increase in selling, general and   administrative expense.",
    "Operating income for the fourth quarter increased 11% to $4.8   million as compared to $4.3 million last year. For the fiscal   year, operating income increased 60% to $13.5 million compared to   $8.4 million last year.",
    "Income tax expense for the quarter decreased by $531,000 to   $35,000, as compared to $566,000 last year. Income tax expense   for fiscal 2019 increased $538,000 to $1.2 million as compared to   $684,000 for the same period a year ago. The decrease in income   tax expense for the fourth quarter was primarily due to the   recognition of increased R&D tax credit. The increase in   income tax expense for the fiscal year was primarily due to the   aforementioned increase in operating income. The Company's   effective tax rate remained relatively constant at 9% for fiscal   2019 as compared to 8% for fiscal 2018.",
    "Net income for the fourth quarter increased 28% to a fourth   quarter record of $4.7 million, which equates to 16% of net sales   or $0.26 per diluted share as compared to $3.7 million or $0.20   per diluted share last year. For the year, net income increased   60% to a record $12.2 million, which equates to 12% of net sales   or $0.66 per diluted share, as compared to $7.6 million or $0.41   per diluted share for the same period a year ago. The change in   net income for the quarter and the year ended June 30, 2019, was   primarily due to the items previously mentioned.",
    "Adjusted EBITDA for the quarter, as outlined in the schedule   included in today's press release, increased 10% to $5.2 million,   which equates to 17% of net sales or $0.28 per diluted share   compared to $4.7 million or $0.25 per diluted share last year.   For the year, adjusted EBITDA increased 51% to $15 million, which   equates to 15% of net sales or $0.81 per diluted share as   compared to $10 million or $0.53 for diluted share last year.",
    "Moving on to the balance sheet. The cash balance at June 30,   2019, was $8 million as compared to $5.3 million at June 30,   2018. Our working capital as of June 30, 2019 was $51.1 million   as compared to $44.3 million at June 30, 2018. Current ratio is   4.6:1 at June 30, 2019 as compared with 5.7:1 at June 30, 2018.   And debt remained at zero at June 30, 2019.",
    "Net cash provided by operating activities for the quarter was   $2.9 million[Phonetic] and for the full fiscal year was $8.7   million. Inventory levels remain higher than normal as we are   gearing up for several new product launches, including iSecure,   our new Marks' anti-ligature lock, and our new line of AT&T   LTE StarLink Radio, all of which, I think, we'll cover   momentarily. Capex was $388,000 during the quarter and was 1.9 --   $1,988,000 for the year.",
    "That concludes my formal remarks, and I would now like to   return the call back to Dick.",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    "Kevin, thank you. The growth of our business is strong, and we   believe the trend will continue in the future. Demand for our   recurring revenue product is coming from alarm communications,   including fire, intrusion and the growth of the smart home   category. We continue to believe that the market opportunity for   school security in the United States is significant. There are   approximately 100,000 K-12 and 10,000 colleges and universities   in the US. None of us will ever forget the tragic event that took   place during 2018 and continue to take place this year. We remain   dedicated to providing solutions and products that schools that   desperately need.",
    "During our past conference calls, we have discussed an   increased volume of legislation being passed by many states since   2018, which includes funding of $1 billion. According to a US   News & World Report article from earlier this year, states   are considering nearly 250 different school safety builds in   2019. This underscores how the issue remains front and center for   everyone. The federal government, you may recall, in 2018 passed   a grant program which has allocated $100 million dollars per year   through 2028 for school security. We're also aware of other   pending legislation, which we are monitoring. The pipeline for   school security products looks robust. And we will continue to   announce new wins when we can, as we need to receive approval   from the schools prior to doing so.",
    "Recently, we have witnessed more and more active shooter   incidences taking place at houses of worship and other public   meeting places. We have seen a need to expand the use of our SAVI   audit system for these location. The continuing violence in   public area is painting a clear picture for the need to secure   these areas with our products, such as wireless locks and access   control.",
    "During Q4, we began the launch of our new AT&T LTE   StarLink line of universal fire, intrusion alarm and IoT   communicators. We now have StarLink lines on both Horizon and the   AT&T LTE network, which provides our dealers with the largest   LTE service coverage in the US. Also, we will be launching the   new version of our Marks Division anti-ligature locks. These   locks meet ADA, that's American with Disabilities Act,   requirements as well as the BHMA highest anti-ligature standard.   The shaping and structure of these locksets are designed to   restrict the attachment of lines, laces, etc, to doorknobs and   levers. The locksets are offered in unprecedented, cylindrical,   mortise styles, models and functions and provide easy   installation and retrofit to all popular door constructions.",
    "We are very excited about the upcoming launch of our latest   product iSecure. It was debuted at the ISC West Trade Show in Las   Vegas in April of this year. The iSecure is designed for the new   breed of professional installers and savvy consumers. It has   quick installation time, and its advanced features are perfect   for smart home applications so in demand today. The iSecure won   the MVP, that's the Most Valuable Product, Award in the Home   Controls category at the trade show and drew lots of traffic from   dealers into our trade show booth.",
    "Lastly, our FireLink Fire Alarm Control Panel with a built-in   cellular communicator was launched earlier this year. FireLink,   an all-in-one 8-32 zone fire alarm panel with built-in cellular   LTE StarLink-powered communicator, has grown quickly in sales.   FireLink comes pre-configured and pre-activated enabling easy   installation and cost savings for dealer. FireLink will add to   our already rapidly growing recovering revenue.",
    "We'll begin our Q&A session portion of this call in a   moment.",
    "Our fiscal year 2019 was a very successful record-breaking   year for us as we continued to grow the Company and deliver   strong profits. Our shareholders have been rewarded with very   healthy returns and stock performance. NAPCO is in a strong   position to continue its growth in sales and profits going   forward. We are excited about the future fiscal year 2020 and   beyond. NAPCO's senior management maintains a higher level of   ownership in our equity, approximately 38%, and I would like to   thank everyone for their support and for joining us in the   exciting future we have.",
    "Our formal remarks are now concluded. We'd like to open the   call for the Q&A session. Operator, please proceed.",
    " Operator ",
    "Thank you. We'll now be conducting a question-and-answer   session. [Operator Instructions] Our first question comes from   the line of Jaeson Schmidt with Lake Street Capital. Please   proceed with your question.",
    " Jaeson Schmidt    --   Lake Street Capital -- Analyst ",
    "Hey, guys. Thanks for taking my questions. I just want to   start with the security market -- school security market. It   seems like you are seeing some really nice traction there. Can   you comment if you're seeing the size of the installed increasing   over the past few months here?",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    "This -- good morning. There are many different types of jobs   that we're getting, and some of them are larger than others, and   we always find that with the jobs that we do, the schools,   especially universities, keep adding to that. So we've done some   schools -- we've gone back four times, keep doing the dorm   buildings and the classrooms and the executive offices. But   they're all different sizes all over the country. If you've seen   the press releases we've put out, they're all starting to come   together where localities want to protect their students, come to   the realization this is not going to stop unless something major   is done in policy within the country, which that looks like that   kind of stymied, I don't know what's going to happen with   that.",
    "So the only way around all this is to put in school security.   And our line of school security is the widest school security   line in the industry. And that we make stand-alone, we make   remote control, we make systems where you can have a man trap and   lock an active shooter between doorways. There are different ways   of configuring our systems that we're very flexible. So we expect   that to continue small, medium and large job, and each job   increasing in volume as they add more facilities too them.",
    " Jaeson Schmidt    --   Lake Street Capital -- Analyst ",
    "Okay. That's helpful. And along those lines, just given the   increasing correction in that market, do you expect to need to   add to headcount in a significant way to address all the   opportunities?",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    "We have a very nice network of sales agents and reps and in   fact, we've made an integration between the Marks group and the   Alarm Lock group. So we have more sales people, and they are more   intense in their territory. But we don't expect to see an   increase in -- for the new year. In fact, this year the SG&A   was basically flat. We are very budget conscious. We wanted to   make sure we get the most efficiency out of each of our sales   people. As far as the manufacturing side of the business, we're   in the Dominican Republic. Our components are shipped in from all   over Asia, and we do all our assembly there. The minimum wage in   the Dominican Republic is $2,500 a year, so it's not really   material. If you get another 50 workers assembling products, the   margins are great on the product, so that it's not really a   material effect. So we're pretty stable in both of these areas,   both sales, marketing and manufacturing.",
    " Jaeson Schmidt    --   Lake Street Capital -- Analyst ",
    "Okay. And the last one for me and I'll jump back into queue. I   know previously you threw out a $40 million recurring revenue run   rate target for fiscal 2021. Do you still feel confident in that   target?",
    " Kevin S. Buchel    --   Senior Vice President of Operations and Finance and Chief   Financial Officer ",
    "Not only do I feel confident -- it's Kevin. Not only do I feel   confident, Jaeson, I thought, we would be pushing hard to get to   $20 million -- we got to twenty $20.4 million run rate. $40   million, we could beat it. And I'm just keeping -- I'm still   saying $40 million. But if we had recurring revenue into the   other areas of the business, like we talked about, we try to get   it into the locking side, the access, we'll blow past the $40   million. For now, let's just call it $40 million by June of   2021.",
    " Jaeson Schmidt    --   Lake Street Capital -- Analyst ",
    "Okay. Thanks a lot, guys.",
    " Kevin S. Buchel    --   Senior Vice President of Operations and Finance and Chief   Financial Officer ",
    "You're welcome, Jaeson.",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    "Thank you.",
    " Operator ",
    "Thank you. Our next question comes from the line of Mike   Walkley with Canaccord Genuity. Please proceed with your   question.",
    " Mike Walkley    --   Canaccord Genuity -- Analyst ",
    "Great. Thanks. Great to see the recurring revenue growth and   reiteration of targets. Just a question for me on the hardware   gross margin side. What about -- maybe a little bit closer to 40%   with the $24 million hardware revenue achieved this quarter, can   you talk a little bit about the mix that impacted margins for the   quarter and maybe a little more color on some of the price   discounts that you gave during the quarter?",
    " Kevin S. Buchel    --   Senior Vice President of Operations and Finance and Chief   Financial Officer ",
    "One of the[Phonetic] things -- we tried to do by -- is to   capture a lot of the AT&T radio market -- LTE. And we   introduced that in the fourth quarter, and our thought process   was to capture that market, because once we start getting the   recurring revenue, we got that pretty much for life. It is a big   market. We didn't have it. We're starting to get it. I would put   about 2% margin effect in the quarter because of that. So I would   have expected normal situation to be at 40% also. We came in and   basically set 37%. So there is a 3% differential. 2% I would say,   is because of discounts we gave on the new product introduction.   1%, I would say, is due to the mixed -- sometimes there's mix   differences. If we get a big school job at a university in one   quarter and you get a job that's not as big the following year,   that could easily affect it by 1%. Nothing that we saw out of the   ordinary to have a 1% differential on mix. Not that unusual. The   part that was different was the 2% because of discount. Virtually   all due to the AT&T LTE radio intro.",
    " Mike Walkley    --   Canaccord Genuity -- Analyst ",
    "Great, thanks. And then maybe just building on that, you   highlighted all kinds of new products ramping in the coming   quarters. How should we think maybe about mix from the new   products? How does that impact gross margin in the short term on   the hardware side? Obviously, growing recurring revenue is great   for the long term, but how should we maybe think about short-term   margins given some of these new products coming into the   model?",
    " Kevin S. Buchel    --   Senior Vice President of Operations and Finance and Chief   Financial Officer ",
    "I think, in Q1 you'll see a little more of what we saw in Q4   in the introduction, because the LTE -- that's a big area for us.   You'll see a little more of that. I don't think you'll see any   discounting or we introduce the new anti-lig, that's a very   expensive high margin product to begin with. And everybody wants   to get their hands on the new version. We don't have to do that.   We're like one of the few that manufactured this. The iSecure   that's coming out of the gate very aggressively priced. We don't   have to discount that beyond what it is. People are going to jump   at that, just because the price is so good right out of the gate.   It is going to blow away the competition. So I don't expect any   discounting on that one either. It's really a little bit more on   the radio side, but we believe that the recurring growing   dramatically like it has with 78% to 80% gross margin that -- it   will more than make up for that.",
    " Mike Walkley    --   Canaccord Genuity -- Analyst ",
    "Thanks, and last question for me and I'll pass on. Just on the   recurring revenue given your conference, you still think of like   40% plus year-over-year growth rate? Or does it slow in the short   term and accelerate as the new products start to ramp? And then   secondly, just given the ramp at AT&T, any color how it's   going so far, maybe relative to the Verizon launch? Thank   you.",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    "We expect that, the $40 million is the number that we're going   to hit in June 30, 2021[Phonetic] year. We think that with the   AT&T, the iSecure and some of the locking products that are   going to be generating recurring revenue, which is revolutionary   for the business never been done before in the whole industry.   Locks traditionally don't generate recurring revenue. They're a   one-off sale, but our versions of the locks will generate   recurring revenue. The installation companies as well as end   users. We think that we can go beyond the $40 million and we'll   do -- do to get our market share. But I think that the price   point that we've established are going to be pretty stable. And   we're going to hit that number of $40 million and beyond. That's   how we look at it.",
    " Mike Walkley    --   Canaccord Genuity -- Analyst ",
    "Thanks. Thank you.",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    "Okay, Mike.",
    " Operator ",
    "Thank you. Our next question comes from the line of Matt Pfau   with William Blair. Please proceed with your question.",
    " Matt Pfau    --   William Blair -- Analyst ",
    "Hey, guys. Thanks for taking my questions. I wanted to ask on   hardware growth in the quarter. It's the lowest for the year. And   -- but the full year was about 7%, which is sort of in line with   what you guys have talked about longer term. Was there anything   disappointing in the quarter or one-off in the quarter that had   that growth rate below the other quarters and the year? And how   do we think about that growth rate going forward as the fourth   quarter more indicative of the go forward, or is the full-year   growth more of how we should think about it?",
    " Kevin S. Buchel    --   Senior Vice President of Operations and Finance and Chief   Financial Officer ",
    "The hardware growth for the full year of 7% was one of the   highest increases we've had in years. We've been saying our goal   is to get the high single or double digit. So 7%, we're on our   way to high single, I don't think there's any reason for us to   believe why we can't do more better from a percentage point of   view for fiscal 2020. Since we're introducing so many things   between, iSecure, the new anti-lig, the new radios, the FireLink   panel hasn't been out that long. We're doing -- we spend a lot of   money on R&D, for us a lot, hasn't gone up by that much but   $7.2 million this past year? They're spending a lot of time on   doing a lot of things that get us more recurring and more   hardware. The hardware sales is very important to us too. The   Dominican leverage we talked about is very important. Just we   didn't see it as much in Q4, but you saw it for the full year.   And that's a big part of what we're doing. We're getting so busy   down there. We're going to be going to a second shift on radios   soon. These are all good things. So if I was projecting out, I   would still believe that low-single -- I mean, high-single digits   for Q -- for the full year, even though it was lower in Q4 it's   Still a goal and still very achievable.",
    " Matt Pfau    --   William Blair -- Analyst ",
    "Got it. And then on the school security side, you mentioned   all these funding bills that are out there and the fees that have   passed. How big of an impact has the government funding been to   the school security business or is that still more of an   opportunity with some of these bills being passed, potentially   accelerating the growth of that business?",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    "We're seeing an increase in school security jobs. We're   publishing them as we get them. There's many, many more queue if   the schools are being -- it they're getting some funding from   their regional area, we expect there's going to be federal   funding, there is going to be legislation put out. So all of this   primes the pump to get a lot more business. And since we have a   offering for K-12, which are low-cost, easy-to-convert K-12 to   more secure places for the student and not that expensive to do.   Schools are jumping the gun and doing their own financing of this   through state legislature and counties around the country. The   college or universities have large endowments. They're using that   money in anticipation of more money coming down. And we're seeing   a better situation in the schools that make these moves, and   they're going to be much more protective for the students.",
    "So we see this all in a very positive light. It's going to   take many, many years of growth and the schools will be secure.   But as far as we could see, I could see five years of continuous   school growth ahead of us, and the big money is going to really   come down.",
    " Matt Pfau    --   William Blair -- Analyst ",
    "Got it. And in terms of the hurricane that's currently   impacting the Caribbean, any impact there to your operations in   the Dominican? I realized it didn't hit there. But in terms of   getting the goods out of the Dominican to the US, are there any   disruption there from the hurricane?",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    "We haven't -- we -- our factor is Category 5 in the Dominican   Republic. So the hurricane itself didn't hit. There's going to be   -- we ship things both by air and by sea. Though we haven't   gotten feedback yet from the ocean shipping companies. But they   are on top of their game. So we expect with the amount of   inventory we have here that we'll be able to satisfy all demand   and keep things rolling. But let's see how things go in the next   week or so.",
    " Matt Pfau    --   William Blair -- Analyst ",
    "Okay. Got it. That's it for me, guys. Thanks a lot.",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    "Thanks, Matt.",
    " Operator ",
    "[Operator Instructions] Our next question comes from the line   of Jeff Kessler with Imperial Capital. Please proceed with your   question.",
    " Jeff Kessler    --   Imperial Capital -- Analyst ",
    "Thank you. Thank you for taking my question. It's probably   fair to say that there is a little bit of a surprise up on the   analyst part in looking at how much you spent on some of the new   investments that you're making, the AT&T radio capturing that   part of that market? And I'm wondering -- this brings up two   questions. Number 1, do you think that, Number 1, by keeping this   under wraps, at least publicly, not talking about what you were   going to invest in, do you think you've been able to take the   competitive market a little bit by surprise since you've already   been in the Verizon side of the market? You haven't been in the   AT&T market so heavily. Do you think that you again, taken a   little bit of the AT&T folks on the communication side by   surprise?",
    "And Number 2, are these investments that you're making now,   where do you see the returns coming? Let's get -- if you want to   call it a little bit earlier and which ones are you going to be   taking a little bit longer to play out over the course of the   next fiscal year and a half?",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    "Jeff, these are complicated questions. It's not an exact   science, but it's always good to sneak up on the competition, and   that's what the AT&T radios are very important launch, and   you hit the nail right on the head. We're going to have   tremendous success with AT&T radios to grow our recurring   revenue. And we had to do we had to do to run run the business in   a very solid way for mid-term and long-term, and that AT&T   radio nationwide makes us very unique of the fact that we're   doing fire with it as well as home and more business. So it's an   important thing to do, and it bodes well for our future. We   expect that between AT&T radios and iSecure and every iSecure   has a radio built into it, so that every alarm that's installed.   Going forward iSecure, which we expect to be a real volume   producer will generate recurring revenue for us. And having it on   all these network is very important. So if you want more detail,   we could do a conversation later on getting in deeper if you want   to go deeper than this.",
    " Jeff Kessler    --   Imperial Capital -- Analyst ",
    "Sure. And as far as if you want to -- I don't see a schedule,   but what do you see as -- which are we going to be seeing the   returns from a little bit earlier, which are really seeing the   returns from a little bit later? Are those investments that you   were making over the last quarter and into -- and obviously into   the next quarter?",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    "Our investments are -- we have this goal -- we have of the   goal at June 30, 2021 that we're going to be at $40 million in   recurring and we're going to be a $100 million in hardware   manufacturing. And if you put that together and you are over   $1.30 a share and that is our goal. And we're doing everything we   can to win market share to get to our goal and go beyond our   goal. And it looks like, this is working for us.",
    " Jeff Kessler    --   Imperial Capital -- Analyst ",
    "Okay. One final question. One of the real big issues that I'm   dealing with right now and which the industry is -- overall is   dealing with right now to try to -- not just prop up, but to --   just to reinforce the value proposition is the difference between   verified and unverified alarm signals out there? The difference   between convenience and having a professional service, to have   police show up within five or six minutes on the residential   side, not just on the commercial side. What are you folks -- what   are you doing? And I'm thinking about iSecure in companies and   products like that. What are you doing to accelerate the   industry's -- the professional industry's ability to have police   and, of course, the PSAPs, 911[Phonetic] centers, except the   signals more readily and allow police to come in and respond   without having false alarms?",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    "Well, a lot of the false alarms are caused by DIY products,   not professionally installed products. DIY products are not   attached to the walls, to the ceiling that well, they move and   they cause a false alarm or they're not close enough to the   magnetic contacts to go on the windows. So that caused a lot of   false alarms. Our iSecure is not aimed for the DIY market, but   its price point and its functionality is to put the dealer --   professional dealer in the game of installing more and more alarm   systems, which compete against the DIY products.",
    "So it's very professionally installed, which eliminate a lot   of the false alarms you're getting DIY. And we're trying to arm   our dealers and the dealers across the nation with a product,   which has a better return on investment, more reliable, more   feature rich and installs with less false alarms. That's our   contribution to what's going on. I   t report    s to all Central Station. It reports daily and it works to our   back-end NOC, which has the ability to give it additional   functionality to eliminate false alarm. And we can talk about   that off line -- since I know that you and the industry and us   were all components of keeping the police respond to real alarms   not false alarms, that's the major thing in the industry. But we   can talk offline and go through exactly what this does from a   [Speech Overlap]",
    " Jeff Kessler    --   Imperial Capital -- Analyst ",
    "Great, Richard. Yes, that's great. Okay, thank you very much.   I Appreciate.",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    "Alright.",
    " Operator ",
    "Thank you. We have reached the end of our question-and-answer   session. I would like to turn the call back over to Mr. Soloway   for any closing remark.",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    "Thank you, everyone, for participating in today's conference   call. As always, should you have any further questions, please   feel free to call Patrick, Kevin or myself for further   information. We thank you for your interest and support, and we   look forward to speaking to you all again in a few months to   NAPCO's fiscal Q1 2020 results. Bye-bye.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 44 minutes ",
    " Patrick McKillop    --   Director of Investor Relations ",
    " Richard L. Soloway    --   President and Chief Executive Officer ",
    " Kevin S. Buchel    --   Senior Vice President of Operations and Finance and Chief   Financial Officer ",
    " Jaeson Schmidt    --   Lake Street Capital -- Analyst ",
    " Mike Walkley    --   Canaccord Genuity -- Analyst ",
    " Matt Pfau    --   William Blair -- Analyst ",
    " Jeff Kessler    --   Imperial Capital -- Analyst ",
    " More NSSC analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than Napco Security   Systems     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Napco Security   Systems wasn't one of them! That's right -- they think   these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:23:25"
}