{
  "url": "https://www.nasdaq.com/article/should-value-investors-pick-cleveland-cliffs-clf-stock-cm1207335",
  "title": "Should Value Investors Pick Cleveland-Cliffs (CLF) Stock? - Nasdaq.com",
  "text": [
    " Value investing is easily one of the most popular ways to find great stocks in any market environment. After all, who wouldn't want to find stocks that are either flying under the radar and are compelling buys, or offer up tantalizing discounts when compared to fair value?  makeArticleAd();  One way to find these companies is by looking at several key metrics and financial ratios, many of which are crucial in the value stock selection process. Let's put Cleveland-Cliffs Inc. CLF  stock into this equation and find out if it is a good choice for value-oriented investors right now, or if investors subscribing to this methodology should look elsewhere for top picks:   PE Ratio    A key metric that value investors always look at is the Price to Earnings Ratio, or PE for short. This shows us how much investors are willing to pay for each dollar o f earnings  in a given stock, and is easily one of the most popular financial ratios in the world. The best use of the PE ratio is to compare the stock's current PE ratio with: a) where this ratio has been in the past; b) how it compares to the average for the industry/sector; and c) how it compares to the market as a whole.    On this front, Cleveland-Cliffs has a trailing twelve months PE ratio of 3.90, as you can see in the chart below:        This level actually compares pretty favorably with the market at large, as the PE for the S&P 500 stands at about 18.02. If we focus on the long-term PE trend, Cleveland-Cliffs' current PE level puts it below its midpoint over the past three years.        Further, the stock's PE also compares favorably with the industry's trailing twelve months PE ratio, which stands at 34.50. At the very least, this indicates that the stock is relatively undervalued right now, compared to its peers.        However, we should point out that Cleveland-Cliffs has a forward PE ratio (price relative to this year's earnings) of 4.70, so we might say that the forward earnings estimates indicate that the company's share price will likely appreciate in the near future.   P/S Ratio    Another key metric to note is the Price/Sales ratio. This approach compares a given stock's price to its total sales, where a lower reading is generally considered better. Some people like this metric more than other value-focused ones because it looks at sales, something that is far harder to manipulate with accounting tricks than earnings.    Right now, Cleveland-Cliffs has a P/S ratio of about 0.83. This is significantly lower than the S&P 500 average, which comes in at 3.17 right now. Also, as we can see in the chart below, this is well below the highs for this stock in particular over the past few years.        If anything, CLF is in the lower end of its range in the time period from a P/S metric, suggesting some level of undervalued trading-at least compared to historical norms.   Broad Value Outlook    In aggregate, Cleveland-Cliffs currently has a Zacks Value Style Score of A, putting it into the top 20% of all stocks we cover from this look. This makes Cleveland-Cliffs a solid choice for value investors, and some of its other key metrics make this pretty clear too.    For example, its P/CF ratio (another great indicator of value) comes in at 3.21, which is better than the industry average of 5.11. Clearly, CLF is a solid choice on the value front from multiple angles.   What About the Stock Overall?    Though Cleveland-Cliffs might be a good choice for value investors, there are plenty of other factors to consider before investing in this name. In particular, it is worth noting that the company has a Growth grade of C and a Momentum score of F. This gives CLF a Zacks VGM score-or its overarching fundamental grade-of B. (You can read more about the Zacks Style Scores here >>  )    Meanwhile, the company's recen t earnings  estimates have been mixed at best. The current quarter has seen no estimates go higher in the past sixty days compared to four lower, while the full year estimate has seen two upward and four downward revisions in the same time period.    As a result, the current quarter consensus estimate has fallen by 12.9% in the past two months, while the full year estimate has decreased 2.3%. You can see the consensus estimate trend and recent price action for the stock in the chart below:   Cleveland-Cliffs Inc. Price and Consensus         Cleveland-Cliffs Inc. price-consensus-chart    |   Cleveland-Cliffs Inc. Quote   This negative trend is why the stock has just a Zacks Rank #3 (Hold) and why we are looking for in-line performance from the company in the near term.   Bottom Line    Cleveland-Cliffs is an inspired choice for value investors, as it is hard to beat its incredible lineup of statistics on this front. However, with a sluggish industry rank (among the bottom 43%) and a Zacks Rank #3, it is hard to get too excited about this company overall. In fact, over the past two years, the industry has clearly underperformed the broader market, as you can see below:        So, value investors might want to wait for estimates, analyst sentiment and broader factors to turn around in this name first, but once that happens, this stock could be a compelling pick.   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Cleveland-Cliffs Inc. (CLF): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Value investing is easily one of the most popular ways to find great stocks in any market environment. After all, who wouldn't want to find stocks that are either flying under the radar and are compelling buys, or offer up tantalizing discounts when compared to fair value?  makeArticleAd();  One way to find these companies is by looking at several key metrics and financial ratios, many of which are crucial in the value stock selection process. Let's put Cleveland-Cliffs Inc. CLF  stock into this equation and find out if it is a good choice for value-oriented investors right now, or if investors subscribing to this methodology should look elsewhere for top picks:   PE Ratio    A key metric that value investors always look at is the Price to Earnings Ratio, or PE for short. This shows us how much investors are willing to pay for each dollar o f earnings  in a given stock, and is easily one of the most popular financial ratios in the world. The best use of the PE ratio is to compare the stock's current PE ratio with: a) where this ratio has been in the past; b) how it compares to the average for the industry/sector; and c) how it compares to the market as a whole.    On this front, Cleveland-Cliffs has a trailing twelve months PE ratio of 3.90, as you can see in the chart below:        This level actually compares pretty favorably with the market at large, as the PE for the S&P 500 stands at about 18.02. If we focus on the long-term PE trend, Cleveland-Cliffs' current PE level puts it below its midpoint over the past three years.        Further, the stock's PE also compares favorably with the industry's trailing twelve months PE ratio, which stands at 34.50. At the very least, this indicates that the stock is relatively undervalued right now, compared to its peers.        However, we should point out that Cleveland-Cliffs has a forward PE ratio (price relative to this year's earnings) of 4.70, so we might say that the forward earnings estimates indicate that the company's share price will likely appreciate in the near future.   P/S Ratio    Another key metric to note is the Price/Sales ratio. This approach compares a given stock's price to its total sales, where a lower reading is generally considered better. Some people like this metric more than other value-focused ones because it looks at sales, something that is far harder to manipulate with accounting tricks than earnings.    Right now, Cleveland-Cliffs has a P/S ratio of about 0.83. This is significantly lower than the S&P 500 average, which comes in at 3.17 right now. Also, as we can see in the chart below, this is well below the highs for this stock in particular over the past few years.        If anything, CLF is in the lower end of its range in the time period from a P/S metric, suggesting some level of undervalued trading-at least compared to historical norms.   Broad Value Outlook    In aggregate, Cleveland-Cliffs currently has a Zacks Value Style Score of A, putting it into the top 20% of all stocks we cover from this look. This makes Cleveland-Cliffs a solid choice for value investors, and some of its other key metrics make this pretty clear too.    For example, its P/CF ratio (another great indicator of value) comes in at 3.21, which is better than the industry average of 5.11. Clearly, CLF is a solid choice on the value front from multiple angles.   What About the Stock Overall?    Though Cleveland-Cliffs might be a good choice for value investors, there are plenty of other factors to consider before investing in this name. In particular, it is worth noting that the company has a Growth grade of C and a Momentum score of F. This gives CLF a Zacks VGM score-or its overarching fundamental grade-of B. (You can read more about the Zacks Style Scores here >>  )    Meanwhile, the company's recen t earnings  estimates have been mixed at best. The current quarter has seen no estimates go higher in the past sixty days compared to four lower, while the full year estimate has seen two upward and four downward revisions in the same time period.    As a result, the current quarter consensus estimate has fallen by 12.9% in the past two months, while the full year estimate has decreased 2.3%. You can see the consensus estimate trend and recent price action for the stock in the chart below:",
    "  Cleveland-Cliffs Inc. Price and Consensus         Cleveland-Cliffs Inc. price-consensus-chart    |   Cleveland-Cliffs Inc. Quote  ",
    " Cleveland-Cliffs Inc. Price and Consensus  ",
    " Cleveland-Cliffs Inc. price-consensus-chart    |   Cleveland-Cliffs Inc. Quote ",
    "This negative trend is why the stock has just a Zacks Rank #3 (Hold) and why we are looking for in-line performance from the company in the near term.   Bottom Line    Cleveland-Cliffs is an inspired choice for value investors, as it is hard to beat its incredible lineup of statistics on this front. However, with a sluggish industry rank (among the bottom 43%) and a Zacks Rank #3, it is hard to get too excited about this company overall. In fact, over the past two years, the industry has clearly underperformed the broader market, as you can see below:        So, value investors might want to wait for estimates, analyst sentiment and broader factors to turn around in this name first, but once that happens, this stock could be a compelling pick.   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:35:00"
}