{
  "url": "https://www.nasdaq.com/article/dubai-might-struggle-to-support-highly-indebted-state-firms-sp-says-20190903-00791",
  "title": "Dubai might struggle to support highly indebted state firms, S&P says - Nasdaq.com",
  "text": [
    "DUBAI, Sept 3 (Reuters) - Hurt by a slowdown in economic growth, Dubai could have a hard time financially supporting government-related entities that have piled up almost $60 billion of debt, S&P Global said in a research note on Tuesday.",
    "Dubai's economy wobbled in 2009, when a global credit crisis caused its real estate market to crash and threatened to force some of its state-linked companies to default on billions of dollars of debt.",
    "Dubai has seen another slump in the real estate market over the past few years, but the downturn has not been as severe as the one in 2009. ",
    "S&P did not say that Dubai would need to provide extraordinary financial support to government-related entities, but that it would find it difficult to do so if it had to.",
    "The agency estimated government-related entities' debt at $59 billion, equivalent to 52% of GDP in 2018. The Dubai government's own debt is estimated at $65 billion, 56% of GDP.",
    "Dubai's government communications office did not immediately respond to an emailed request for comment on the report. ",
    "The federal United Arab Emirates government, backed by the oil-rich capital Abu Dhabi, would help Dubai if it found itself in financial distress, S&P said.",
    "Dubai, one of the seven emirates that make up the UAE, got a $20 billion bailout from the central bank and from Abu Dhabi to escape the 2009 debt crisis.",
    "S&P said it expected the debt would continue to be rolled over. Sources familiar with the matter told Reuters in February that the debt, which was due in March, would be extended for a second time after a first extension in 2014.",
    "Dubai has been counting on an economic boost before and during the World Expo that it will host for six months starting October 2020. But Dubai's gross domestic product per capita fell to an estimated $36,000 in 2019 from a peak of $45,000 in 2013, indicating a weaker economy, S&P said.",
    "Increased economic activity related to the Expo would see GDP growth average around 2.5% annually over the next three years, the agency added."
  ],
  "published_datetime": "2019-09-03 08:50:00"
}