{
  "url": "https://www.nasdaq.com/article/pc-connection-camping-world-apple-goldman-sachs-and-verizon-highlighted-as-zacks-bull-and-bear-of-the-day-cm1206726",
  "title": "PC Connection, Camping World, Apple, Goldman Sachs and Verizon highlighted as Zacks Bull and Bear of the Day - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL - September 3, 2019 - Zacks Equity Research  PC Connection, Inc. CNXN  as the Bull of the Day, Camping World Holdings, Inc. CWH  as the Bear of the Day. In addition, Zacks Equity Research provides analysis on Apple AAPL  , Goldman Sachs GS  and Verizon VZ  . Here is a synopsis of all five stocks:   Bull of the Day  :  Headquartered in Merrimack, New Hampshire, PC Connection, Inc. directly markets brand-name personal computers and related equipment, software, and networking products to business, education, and consumer customers throughout the United States.  Q2 Earnings Better-Than-Expected  Earnings of 89 cents easily beat the Zacks Consensus of 70 cents per share, and net income hit a quarterly record of $23.7 million, growing nearly 30% year-over-year. Revenue of $741 million also surpassed our consensus estimate, up about 5% from the year-ago quarter. Breaking it down by segment, Business Solutions saw sales of $271.1 million thanks to strong growth in sales of desktops, servers/storage, and software products. Public Sector Solutions hit revenue of $152 million, an increase of 12.2%, while Enterprise Solutions grew by 5.6% to $318 million. PC Connection's largest category, notebook/mobility sales, grew 14% year-over-year and accounted for 29% of net sales in Q2. \"Our increased productivity and improved execution allowed us to deliver a 31.3% increase in diluted earnings per share,\" said CEO and President Tim McGrath. \"The Company achieved record gross profit, gross margin, and net income this quarter.\"  PC Connection Price and Consensus  Year-to-date, CNXN stock is up around 19.5%. Estimates have been rising lately too, pushing the stocks towards a Zacks Rank #1 (Strong Buy). For the current fiscal year, PC Connection's earnings growth is expected to grow 15.19% year-over-year. Two analysts have revised their estimate upwards in the past 60 days, and the Zacks Consensus Estimate has moved 23 cents higher from $2.50 to $2.73 during the same time frame. 2020 looks pretty strong too, and earnings are expected to grow about 4.2%; next year's consensus estimate sits at $2.85 cents per share, with eight upward revisions and up by 19 cents in the last 60 days.  Bottom Line  As more people, businesses, and governments look to expand their digital presence, it will be companies like PC Connection that will more in demand in ever, especially as technologies like cloud computing, AI, \"Big Data,\" and blockchain grow. If you're an investor looking for a broad retail stock to add to your portfolio, make sure to keep CNXN on your shortlist.  Bear of the Day  : Camping World Holdings, Inc. is the go-to company for RV enthusiasts, providing services, protection plans, products, and resources for customers; its brands include Camping World and Good Sam. The company offers new and used RVs for sale, vehicle service, and maintenance through its retail locations and membership clubs.  Q2 Earnings Disappoint, Shares Plunge  Last month, Camping World reported second-quarter results that came in well below analyst expectations, and shares fell over 13% on the report. Earnings of 45 cents missed the Zacks Consensus of 64 cents. Revenue of $1.47 billion, though, managed to just beat our consensus of $1.45 billion and grow 2.3% year-over-year. The company's biggest issue that it currently faces is weakness in the overall RV market. During Q2, sales of new vehicles fell 6.3% to 22,900, while average selling prices were about flat. Despite hope after its Q1 report that there could be signs of a turnaround on the horizon, investors, once they saw the Q2 numbers, began to realize that maybe that wouldn't be the case for Camping World. In a post-  earnings call  with invetsors, CEO Marcus A. Lemonis said that \"As a management team, we've spent considerable time looking at multiple scenarios and have concluded that for purposes for full year 2019 guidance, we must assume that the current market conditions and uncertainties will continue.\"  Falling Estimates  Analysts have turned bearish on Camping World, with six cutting estimates in the last 60 days for the current fiscal year. The Zacks Consensus Estimate has dropped drastically, down 68 cents during that same time period from $1.17 to $0.42 per share; earnings could now see a roughly 70% year-over-year decline for fiscal 2019. This sentiment has stretched into 2020, and our consensus estimate has dropped 60 cents in the past two months as well. CWH is now a Zacks Rank #5 (Strong Sell).  Bottom Line  Shares of CWH are down almost 39% since January, and have fallen around 63% in the past one-year period. It's going to take a lot of patience for current shareholders to continue holding on to Camping World. But right now, it looks better stay away, since consumers seem to be steering away from RVs and the company itself is not too confident in a quick turnaround plan.   Can Apple's (AAPL) New Credit Card Succeed?     Apple announced earlier this year that they would be offering a credit card in partnership with Goldman Sachs. Users are able to sign up for the credit card through their phones and access the card in just minutes. Apple issues their card holders a sleek titanium card for instances when an institution doesn't accept Apple Pay. The new card is a step into uncharted territory for both companies. Apple is trying to develop a new revenue stream beyond its hardware products, and Goldman Sachs is continuing its push into consumer financial products with the Apple card. However, skeptics point to how mobile payments has not caught on in the US like it has in other countries. Let's take a closer look into the card and the obstacles it will have to overcome to succeed.  Putting the Pressure on Wireless Carriers  The tech giant's move into banking could enable it to provide customers with financing on new iPhone models. If Apple were to reach this point, it would break off its relationships with wireless carriers like Verizon. Wireless carriers sell expensive new phones to consumers in installment plans that are added to their monthly bill. The customers are then locked into the carrier until the phone is paid off. The Apple card paired with the SIM technology can make it easier for customers to switch between wireless carriers. On top of all that, the card pays 2% cash back on Apple Pay transactions, 3% on direct Apple purchases, and 1% on purchases made with the physical card. Apple emphasizes privacy and security on the card; Apple does not know what you bought, how much you paid, or where you bought it. The analytics for spending are done on the device, not in Apple servers. Furthermore, Goldman will not sell purchase data to third parties. Apple Pay is accepted by more than 70% of US retailers and is projected to work in more than 40 countries by the end of 2019. Additionally, Apple CEO Tim Cook stated that \"Apple Pay will work in the mass transit systems of Portland, Chicago, and New York later this year.\"  Mobile Payments Have Struggled in US  Despite increasing smartphone dependence, most Americans are still not using their smartphones to pay for things. This isn't the case for countries like India and China where they are experiencing a massive increase in mobile purchases. In China, smartphone payments made up more than 80% of all purchases in the country in 2018. The US had adoption rates of mobile payment apps of less than 10%. Experts see the lack of interest in mobile payments and other rewards cards as major headwinds for the Apple credit card. The lack of mobile payments is an anomaly, as over 81% of Americans own a smartphone. A major reason phones became the go to payment option in China and India is because cash was the only other, far less attractive, option. Both countries were cash dependent economies and mobile payments provided people with a much more convenient method of payment. India's government encouraged digital financial transactions in order to stimulate tax revenue, as cash payments often happen under the table. Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      https://www.zacks.com  Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer  . Past performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  https://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Verizon Communications Inc. (VZ): Free Stock Analysis Report   Apple Inc. (AAPL): Free Stock Analysis Report   The Goldman Sachs Group, Inc. (GS): Free Stock Analysis Report   Camping World Holdings Inc. (CWH): Free Stock Analysis Report   PC Connection, Inc. (CNXN): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL - September 3, 2019 - Zacks Equity Research  PC Connection, Inc. CNXN  as the Bull of the Day, Camping World Holdings, Inc. CWH  as the Bear of the Day. In addition, Zacks Equity Research provides analysis on Apple AAPL  , Goldman Sachs GS  and Verizon VZ  .",
    "Here is a synopsis of all five stocks:",
    "  Bull of the Day  : ",
    "Headquartered in Merrimack, New Hampshire, PC Connection, Inc. directly markets brand-name personal computers and related equipment, software, and networking products to business, education, and consumer customers throughout the United States.",
    " Q2 Earnings Better-Than-Expected ",
    "Earnings of 89 cents easily beat the Zacks Consensus of 70 cents per share, and net income hit a quarterly record of $23.7 million, growing nearly 30% year-over-year. Revenue of $741 million also surpassed our consensus estimate, up about 5% from the year-ago quarter.",
    "Breaking it down by segment, Business Solutions saw sales of $271.1 million thanks to strong growth in sales of desktops, servers/storage, and software products. Public Sector Solutions hit revenue of $152 million, an increase of 12.2%, while Enterprise Solutions grew by 5.6% to $318 million.",
    "PC Connection's largest category, notebook/mobility sales, grew 14% year-over-year and accounted for 29% of net sales in Q2.",
    "\"Our increased productivity and improved execution allowed us to deliver a 31.3% increase in diluted earnings per share,\" said CEO and President Tim McGrath. \"The Company achieved record gross profit, gross margin, and net income this quarter.\"",
    " PC Connection Price and Consensus ",
    "Year-to-date, CNXN stock is up around 19.5%.",
    "Estimates have been rising lately too, pushing the stocks towards a Zacks Rank #1 (Strong Buy).",
    "For the current fiscal year, PC Connection's earnings growth is expected to grow 15.19% year-over-year. Two analysts have revised their estimate upwards in the past 60 days, and the Zacks Consensus Estimate has moved 23 cents higher from $2.50 to $2.73 during the same time frame.",
    "2020 looks pretty strong too, and earnings are expected to grow about 4.2%; next year's consensus estimate sits at $2.85 cents per share, with eight upward revisions and up by 19 cents in the last 60 days.",
    " Bottom Line ",
    "As more people, businesses, and governments look to expand their digital presence, it will be companies like PC Connection that will more in demand in ever, especially as technologies like cloud computing, AI, \"Big Data,\" and blockchain grow.",
    "If you're an investor looking for a broad retail stock to add to your portfolio, make sure to keep CNXN on your shortlist.",
    " Bear of the Day  :",
    "Camping World Holdings, Inc. is the go-to company for RV enthusiasts, providing services, protection plans, products, and resources for customers; its brands include Camping World and Good Sam. The company offers new and used RVs for sale, vehicle service, and maintenance through its retail locations and membership clubs.",
    " Q2 Earnings Disappoint, Shares Plunge ",
    "Last month, Camping World reported second-quarter results that came in well below analyst expectations, and shares fell over 13% on the report. Earnings of 45 cents missed the Zacks Consensus of 64 cents. Revenue of $1.47 billion, though, managed to just beat our consensus of $1.45 billion and grow 2.3% year-over-year.",
    "The company's biggest issue that it currently faces is weakness in the overall RV market. During Q2, sales of new vehicles fell 6.3% to 22,900, while average selling prices were about flat.",
    "Despite hope after its Q1 report that there could be signs of a turnaround on the horizon, investors, once they saw the Q2 numbers, began to realize that maybe that wouldn't be the case for Camping World.",
    "In a post-  earnings call  with invetsors, CEO Marcus A. Lemonis said that \"As a management team, we've spent considerable time looking at multiple scenarios and have concluded that for purposes for full year 2019 guidance, we must assume that the current market conditions and uncertainties will continue.\"",
    " Falling Estimates ",
    "Analysts have turned bearish on Camping World, with six cutting estimates in the last 60 days for the current fiscal year. The Zacks Consensus Estimate has dropped drastically, down 68 cents during that same time period from $1.17 to $0.42 per share; earnings could now see a roughly 70% year-over-year decline for fiscal 2019.",
    "This sentiment has stretched into 2020, and our consensus estimate has dropped 60 cents in the past two months as well.",
    "CWH is now a Zacks Rank #5 (Strong Sell).",
    " Bottom Line ",
    "Shares of CWH are down almost 39% since January, and have fallen around 63% in the past one-year period.",
    "It's going to take a lot of patience for current shareholders to continue holding on to Camping World. But right now, it looks better stay away, since consumers seem to be steering away from RVs and the company itself is not too confident in a quick turnaround plan.",
    "  Can Apple's (AAPL) New Credit Card Succeed?  ",
    "Apple announced earlier this year that they would be offering a credit card in partnership with Goldman Sachs. Users are able to sign up for the credit card through their phones and access the card in just minutes. Apple issues their card holders a sleek titanium card for instances when an institution doesn't accept Apple Pay.",
    "The new card is a step into uncharted territory for both companies. Apple is trying to develop a new revenue stream beyond its hardware products, and Goldman Sachs is continuing its push into consumer financial products with the Apple card. However, skeptics point to how mobile payments has not caught on in the US like it has in other countries. Let's take a closer look into the card and the obstacles it will have to overcome to succeed.",
    " Putting the Pressure on Wireless Carriers ",
    "The tech giant's move into banking could enable it to provide customers with financing on new iPhone models. If Apple were to reach this point, it would break off its relationships with wireless carriers like Verizon. Wireless carriers sell expensive new phones to consumers in installment plans that are added to their monthly bill. The customers are then locked into the carrier until the phone is paid off. The Apple card paired with the SIM technology can make it easier for customers to switch between wireless carriers.",
    "On top of all that, the card pays 2% cash back on Apple Pay transactions, 3% on direct Apple purchases, and 1% on purchases made with the physical card. Apple emphasizes privacy and security on the card; Apple does not know what you bought, how much you paid, or where you bought it. The analytics for spending are done on the device, not in Apple servers. Furthermore, Goldman will not sell purchase data to third parties.",
    "Apple Pay is accepted by more than 70% of US retailers and is projected to work in more than 40 countries by the end of 2019. Additionally, Apple CEO Tim Cook stated that \"Apple Pay will work in the mass transit systems of Portland, Chicago, and New York later this year.\"",
    " Mobile Payments Have Struggled in US ",
    "Despite increasing smartphone dependence, most Americans are still not using their smartphones to pay for things. This isn't the case for countries like India and China where they are experiencing a massive increase in mobile purchases. In China, smartphone payments made up more than 80% of all purchases in the country in 2018. The US had adoption rates of mobile payment apps of less than 10%. Experts see the lack of interest in mobile payments and other rewards cards as major headwinds for the Apple credit card. The lack of mobile payments is an anomaly, as over 81% of Americans own a smartphone.",
    "A major reason phones became the go to payment option in China and India is because cash was the only other, far less attractive, option. Both countries were cash dependent economies and mobile payments provided people with a much more convenient method of payment. India's government encouraged digital financial transactions in order to stimulate tax revenue, as cash payments often happen under the table.",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    https://www.zacks.com ",
    "Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer  .",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  https://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:37:00"
}