{
  "url": "https://www.nasdaq.com/article/cream-of-the-crop-5-mid-cap-tech-stocks-promise-big-returns-cm1207985",
  "title": "Cream of the Crop: 5 Mid-Cap Tech Stocks Promise Big Returns - Nasdaq.com",
  "text": [
    " Placing bets on mid-cap stocks is often considered a discreet portfolio diversification strategy. These stocks with a market capitalization of $1-$5 billion integrate lucrative prospects of both small and large-cap stocks. The mid-cap stocks, although less stable than the large-cap ones, offer higher returns. Moreover, these are more mature businesses and are less risk-prone or volatile than the small-cap ones. Given the uncertainty in the market due to the US-China trade tension, decelerating global economy and geopolitical turbulences, investment in mid-cap stocks should be wisely executed in our opinion.  These stocks are less vulnerable to losses in case the trade deal falls flat as the penetration level is slim in the  global market  s. Notably, mid-cap stocks have surged so far this year. While the S&P 400 Mid-cap Index (SP400) has returned 9.4% year to date.  Technology's Impact Inimitable  Technology has been one of the most bankable sectors for investors despite the current macroeconomic challenges it is subjected to. Notably, the Technology Select Sector SPDR ETF (XLK) has gained 28.9% on a year-to-date basis compared with the S&P 500's rally of roughly 14.5%. Rapid adoption of AI, cloud computing, IoT, autonomous vehicles and wearables has been fueling growth for the sector. Moreover, increasing video streaming, growing demand for smart speakers and connected devices powered by AI, machine learning and deep learning, are key catalysts. Additionally, the accelerated deployment of 5G technology and faster-than-expected growth in robotics set the stage for more development. Although the aforementioned factors look promising for the sector, the unstable macroeconomic scenario is quite an eyesore. Notably, the semiconductor industry, which forms the fulcrum of the tech sector, is caught in a volatile geopolitical situation stemming from the trade and tariff dispute as well as economic weakness in China. Nonetheless, the much-anticipated growth revival in the second half of the current year is raising investor's optimism.  Key Picks  The attractive growth opportunities that the technology sector presents make it a favorite among investors. As the mid-cap tech stocks have greater potential to offer better returns, with the help of the Zacks Stock Screener  , we made our selection foolproof. To shortlist the mid-cap stocks from the vast universe of tech companies, we picked those that carry a Zacks Rank #1 (Strong Buy) or 2 (Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here.   To further narrow the list down, we chose stocks with an impressive Zacks  Growth Score   of A or B. Our research shows that stocks with a Growth Score of A or B when combined with a Zacks Rank of 1 or 2 offer the best upside potential. The chart below shows price performance of the five best bets so far this year.       Perficient PRFT  has a Zacks Rank #1 and a Growth Score of A. The company has a market cap of $1.22 billion. The company delivered average four-quarter positive surprise of 9.62% and has a long-term earnings growth rate of 10.8%. The Zacks Consensus Estimate of $2.01 for 2019 earnings has been maintained in the past 30 days. The stock has surged 67.8% year to date.  Chegg CHGG  is a Zacks #1 Ranked player and has a Growth Score of B. The company has a market cap of $4.5 billion. The company pulled off average four-quarter earnings surprise of 57.7% and has a long-term earnings growth rate of 30%. The Zacks Consensus Estimate for 2019 earnings of 78 cents has been stable in the past 30 days. The stock has soared 32.3% year to date.  CyberArk Software CYBR  has a Zacks Rank of 2 and a Growth Score of B. The company has a market cap of $4.31 billion. The company came up with average four-quarter positive surprise of 47.69% and has a long-term earnings growth rate of 15.8%. The Zacks Consensus Estimate of $2.28 for 2019 earnings has been revised 6.5% upward in the past 30 days. The stock has jumped 54.1% year to date.  OSI Systems OSIS  has a Zacks Rank #2 and a Growth Score of A. The company has a market cap of $1.92 billion. The company came up with average four-quarter beat of 24.47% and has a long-term earnings growth rate of 12.5%. The Zacks Consensus Estimate of $9.26 for fiscal 2020 earnings has moved 2.2% north over the past 30 days. The stock has gained 44% year to date.  Itron ITRI  is a Zacks #2 Ranked stock and has a favorable Growth Score of B. The company has a market cap of $4.24 billion. The company delivered average four-quarter positive surprise of 50.11% and has a long-term earnings growth rate of 25%.  The Zacks Consensus Estimate for 2019 earnings of $2.85 has been raised 8.4% in the past 30 days. The stock has climbed 46.5% year to date.  It's Illegal in 42 States, But Investors Will Make   Billions Legally  In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year. That's twice as much as they spend on marijuana, legally or otherwise. Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.   See these 5 \"sin stocks\" now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Chegg, Inc. (CHGG): Free Stock Analysis Report   CyberArk Software Ltd. (CYBR): Free Stock Analysis Report   Perficient, Inc. (PRFT): Free Stock Analysis Report   OSI Systems, Inc. (OSIS): Free Stock Analysis Report   Itron, Inc. (ITRI): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Placing bets on mid-cap stocks is often considered a discreet portfolio diversification strategy. These stocks with a market capitalization of $1-$5 billion integrate lucrative prospects of both small and large-cap stocks.",
    "The mid-cap stocks, although less stable than the large-cap ones, offer higher returns. Moreover, these are more mature businesses and are less risk-prone or volatile than the small-cap ones.",
    "Given the uncertainty in the market due to the US-China trade tension, decelerating global economy and geopolitical turbulences, investment in mid-cap stocks should be wisely executed in our opinion.  These stocks are less vulnerable to losses in case the trade deal falls flat as the penetration level is slim in the  global market  s.",
    "Notably, mid-cap stocks have surged so far this year. While the S&P 400 Mid-cap Index (SP400) has returned 9.4% year to date.",
    " Technology's Impact Inimitable ",
    "Technology has been one of the most bankable sectors for investors despite the current macroeconomic challenges it is subjected to.",
    "Notably, the Technology Select Sector SPDR ETF (XLK) has gained 28.9% on a year-to-date basis compared with the S&P 500's rally of roughly 14.5%.",
    "Rapid adoption of AI, cloud computing, IoT, autonomous vehicles and wearables has been fueling growth for the sector. Moreover, increasing video streaming, growing demand for smart speakers and connected devices powered by AI, machine learning and deep learning, are key catalysts.",
    "Additionally, the accelerated deployment of 5G technology and faster-than-expected growth in robotics set the stage for more development.",
    "Although the aforementioned factors look promising for the sector, the unstable macroeconomic scenario is quite an eyesore. Notably, the semiconductor industry, which forms the fulcrum of the tech sector, is caught in a volatile geopolitical situation stemming from the trade and tariff dispute as well as economic weakness in China.",
    "Nonetheless, the much-anticipated growth revival in the second half of the current year is raising investor's optimism.",
    " Key Picks ",
    "The attractive growth opportunities that the technology sector presents make it a favorite among investors. As the mid-cap tech stocks have greater potential to offer better returns, with the help of the Zacks Stock Screener  , we made our selection foolproof.",
    "To shortlist the mid-cap stocks from the vast universe of tech companies, we picked those that carry a Zacks Rank #1 (Strong Buy) or 2 (Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here.  ",
    "To further narrow the list down, we chose stocks with an impressive Zacks  Growth Score   of A or B. Our research shows that stocks with a Growth Score of A or B when combined with a Zacks Rank of 1 or 2 offer the best upside potential.",
    "The chart below shows price performance of the five best bets so far this year.",
    " Perficient PRFT  has a Zacks Rank #1 and a Growth Score of A. The company has a market cap of $1.22 billion.",
    "The company delivered average four-quarter positive surprise of 9.62% and has a long-term earnings growth rate of 10.8%. The Zacks Consensus Estimate of $2.01 for 2019 earnings has been maintained in the past 30 days. The stock has surged 67.8% year to date.",
    " Chegg CHGG  is a Zacks #1 Ranked player and has a Growth Score of B. The company has a market cap of $4.5 billion.",
    "The company pulled off average four-quarter earnings surprise of 57.7% and has a long-term earnings growth rate of 30%. The Zacks Consensus Estimate for 2019 earnings of 78 cents has been stable in the past 30 days. The stock has soared 32.3% year to date.",
    " CyberArk Software CYBR  has a Zacks Rank of 2 and a Growth Score of B. The company has a market cap of $4.31 billion.",
    "The company came up with average four-quarter positive surprise of 47.69% and has a long-term earnings growth rate of 15.8%. The Zacks Consensus Estimate of $2.28 for 2019 earnings has been revised 6.5% upward in the past 30 days. The stock has jumped 54.1% year to date.",
    " OSI Systems OSIS  has a Zacks Rank #2 and a Growth Score of A. The company has a market cap of $1.92 billion.",
    "The company came up with average four-quarter beat of 24.47% and has a long-term earnings growth rate of 12.5%. The Zacks Consensus Estimate of $9.26 for fiscal 2020 earnings has moved 2.2% north over the past 30 days. The stock has gained 44% year to date.",
    " Itron ITRI  is a Zacks #2 Ranked stock and has a favorable Growth Score of B. The company has a market cap of $4.24 billion.",
    "The company delivered average four-quarter positive surprise of 50.11% and has a long-term earnings growth rate of 25%.  The Zacks Consensus Estimate for 2019 earnings of $2.85 has been raised 8.4% in the past 30 days. The stock has climbed 46.5% year to date.",
    " It's Illegal in 42 States, But Investors Will Make   Billions Legally ",
    "In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    "That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "  See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:58:00"
}