{
  "url": "https://www.nasdaq.com/article/disney-and-apple-wont-let-you-binge-watch-cm1207279",
  "title": "Disney and Apple Won't Let You Binge Watch - Nasdaq.com",
  "text": [
    "  Netflix    (NASDAQ: NFLX) completely changed the way we consume television   shows. Instead of waiting for a new episode every week,   binge-watching three or four episodes or even an entire season of   a series is now a weekly event in many homes. But   Disney    (NYSE: DIS) and   Apple    (NASDAQ: AAPL) aren't as on board with binge-watching. Disney's planning to release episodes for its Disney+   originals on a weekly schedule. Hulu, of which Disney owns a   majority share and full operational control, releases three   episodes to premiere a series before releasing new episodes   weekly. Apple is considering the same release schedule for Apple   TV+. While consumers love to binge-watch, there's a clear strategy   in releasing episodes on a weekly basis for Disney and Apple.makeArticleAd();   Image source: Disney  Feeling the churn Netflix disappointed investors when i   t report    ed a net loss in U.S. subscribers in the second quarter. The   company didn't point to competition or its price increase as   the reason for its disappointing results    . Instead, it said, \"We think Q2's content slate drove less   growth in paid net adds than we anticipated.\" In other words, Netflix's subscriber growth is highly   dependent on its release schedule. While management didn't note   anything about the impact of its content slate on subscriber   churn, it's evident it saw significant churn last quarter as   well. It's really hard to lose customers without an uptick in   churn. Releasing episodes over the course of a couple of months can   help produce a more stable subscriber base. Prospective   subscribers can't just sign up, binge a season, and cancel until   the next release. With any luck, Apple and Disney will have a   steady pipeline of hit series that keeps subscribers discovering   something new by the time the last series run ends. Limiting the   availability of new episodes also encourages subscribers to   explore what else is available on the services. Weekly releases may be more important for Disney and Apple   than for Netflix. Netflix releases dozens of new original films   and series every month. That said, Netflix just started   experimenting with weekly releases for some of its shows,   including popular hits like the   Great British Baking Show    . Disney and Apple won't be spending nearly as much on original   content as Netflix. Apple, in particular, won't have a back   catalog of content for subscribers to fall back on when they're   waiting for the next original, either. So, keeping subscribers   coming back to the service on a regular basis is essential to   keeping them paying month after month. The challenge could get even bigger As more and more competitors enter the streaming market, it'll   become increasingly difficult to keep subscribers from switching   between the various outlets for streaming video content. While   cord-cutting is growing and   consumers are spending    more of their money on alternative forms of entertainment like   streaming media, many are still budget conscious. It doesn't make   sense to subscribe to eight different streaming services at the   same time if you're paying more than you were for a cable   bundle. So, Apple, Disney, and new entrants are working to increase   switching costs. Netflix does this by releasing copious amounts   of new content every month (although even that isn't bulletproof,   as we saw last quarter).   Amazon    , for example, ties its Prime Video service to its Prime shipping   service, which keeps subscribers from switching. Disney is   offering considerable discounts to consumers willing to commit to   a year of the service. It also ran a successful launch promotion   that encouraged people to sign up for three years. Releasing new episodes weekly is just one way to increase   switching costs as more competitors enter the market. As they get   ready to launch, Disney and Apple will surely experiment with   other ways to incentivize subscribers to pay for the next month   of service. Stay tuned.   Find out why Walt Disney is one of the 10 best stocks to buy now  Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* Tom and David just revealed their ten top stock picks for     investors to buy right now. Walt Disney     is on the list      -- but there are nine others you may be overlooking.  Click here to get access to the full       list!     *Stock Advisor returns as of June 1, 2019      John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors.     Adam Levy      owns shares of Amazon, Apple, and Walt Disney. The Motley Fool     owns shares of and recommends Amazon, Apple, Netflix, and Walt     Disney. The Motley Fool has the following options: long January     2021 $60 calls on Walt Disney, short October 2019 $125 calls on     Walt Disney, short January 2020 $155 calls on Apple, long     January 2020 $150 calls on Apple, short January 2020 $155 calls     on Apple, and long January 2020 $150 calls on Apple. The Motley     Fool has a     disclosure policy      .  ",
    " Netflix    (NASDAQ: NFLX) completely changed the way we consume television   shows. Instead of waiting for a new episode every week,   binge-watching three or four episodes or even an entire season of   a series is now a weekly event in many homes. But   Disney    (NYSE: DIS) and   Apple    (NASDAQ: AAPL) aren't as on board with binge-watching.",
    "Disney's planning to release episodes for its Disney+   originals on a weekly schedule. Hulu, of which Disney owns a   majority share and full operational control, releases three   episodes to premiere a series before releasing new episodes   weekly. Apple is considering the same release schedule for Apple   TV+.",
    "While consumers love to binge-watch, there's a clear strategy   in releasing episodes on a weekly basis for Disney and Apple.",
    "  Image source: Disney ",
    "Image source: Disney",
    "Netflix disappointed investors when i   t report    ed a net loss in U.S. subscribers in the second quarter. The   company didn't point to competition or its price increase as   the reason for its disappointing results    . Instead, it said, \"We think Q2's content slate drove less   growth in paid net adds than we anticipated.\"",
    "In other words, Netflix's subscriber growth is highly   dependent on its release schedule. While management didn't note   anything about the impact of its content slate on subscriber   churn, it's evident it saw significant churn last quarter as   well. It's really hard to lose customers without an uptick in   churn.",
    "Releasing episodes over the course of a couple of months can   help produce a more stable subscriber base. Prospective   subscribers can't just sign up, binge a season, and cancel until   the next release. With any luck, Apple and Disney will have a   steady pipeline of hit series that keeps subscribers discovering   something new by the time the last series run ends. Limiting the   availability of new episodes also encourages subscribers to   explore what else is available on the services.",
    "Weekly releases may be more important for Disney and Apple   than for Netflix. Netflix releases dozens of new original films   and series every month. That said, Netflix just started   experimenting with weekly releases for some of its shows,   including popular hits like the   Great British Baking Show    .",
    "Disney and Apple won't be spending nearly as much on original   content as Netflix. Apple, in particular, won't have a back   catalog of content for subscribers to fall back on when they're   waiting for the next original, either. So, keeping subscribers   coming back to the service on a regular basis is essential to   keeping them paying month after month.",
    "As more and more competitors enter the streaming market, it'll   become increasingly difficult to keep subscribers from switching   between the various outlets for streaming video content. While   cord-cutting is growing and   consumers are spending    more of their money on alternative forms of entertainment like   streaming media, many are still budget conscious. It doesn't make   sense to subscribe to eight different streaming services at the   same time if you're paying more than you were for a cable   bundle.",
    "So, Apple, Disney, and new entrants are working to increase   switching costs. Netflix does this by releasing copious amounts   of new content every month (although even that isn't bulletproof,   as we saw last quarter).   Amazon    , for example, ties its Prime Video service to its Prime shipping   service, which keeps subscribers from switching. Disney is   offering considerable discounts to consumers willing to commit to   a year of the service. It also ran a successful launch promotion   that encouraged people to sign up for three years.",
    "Releasing new episodes weekly is just one way to increase   switching costs as more competitors enter the market. As they get   ready to launch, Disney and Apple will surely experiment with   other ways to incentivize subscribers to pay for the next month   of service. Stay tuned.",
    "  Find out why Walt Disney is one of the 10 best stocks to buy now  Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* Tom and David just revealed their ten top stock picks for     investors to buy right now. Walt Disney     is on the list      -- but there are nine others you may be overlooking.  Click here to get access to the full       list!     *Stock Advisor returns as of June 1, 2019    ",
    " Find out why Walt Disney is one of the 10 best stocks to buy now ",
    "Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "Tom and David just revealed their ten top stock picks for     investors to buy right now. Walt Disney     is on the list      -- but there are nine others you may be overlooking.",
    " Click here to get access to the full       list! ",
    " *Stock Advisor returns as of June 1, 2019 ",
    " John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors.     Adam Levy      owns shares of Amazon, Apple, and Walt Disney. The Motley Fool     owns shares of and recommends Amazon, Apple, Netflix, and Walt     Disney. The Motley Fool has the following options: long January     2021 $60 calls on Walt Disney, short October 2019 $125 calls on     Walt Disney, short January 2020 $155 calls on Apple, long     January 2020 $150 calls on Apple, short January 2020 $155 calls     on Apple, and long January 2020 $150 calls on Apple. The Motley     Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:24:42"
}