{
  "url": "https://www.nasdaq.com/article/buy-these-5-low-leverage-stocks-to-keep-losses-at-bay-cm1206615",
  "title": "Buy These 5 Low Leverage Stocks to Keep Losses at Bay - Nasdaq.com",
  "text": [
    " Leverage is an investment strategy adopted by corporations wherein borrowed capital is used to expand operations and amplify possible returns from risk capital. Per the theory of cost of capital, a company's capital structure reflects a mix of debt and equity that is used to finance capital projects. Now a comparative analysis of the theory of cost of capital reveals that most companies prefer debt financing over equity since debt is cheaper, especially in periods of low interest rates. This is because when a company resorts to debt financing, it takes on fixed expenses in the form of interest payments for a specific time period. However, in case of equity financing, a shareholder not only becomes a partial owner of the company but develops a direct claim on the company's future profits as well. So, debt financing remains the preferred option for corporates. However, debt financing has its share of drawbacks. The problem arises when leverage, referred to as the amount of debt a company bears, becomes exorbitant. A high degree of financial leverage means high interest payments, which affect a company's bottom line. Therefore, choosing a less debt-ridden stock should be an appropriate option for a risk-averse investor.  And here comes the importance of leverage ratios, which can measure the exact amount of debt risk a company bears. Debt-to-equity ratio is one such measure, perhaps the most popular one, to evaluate a company's creditworthiness for potential equity investments.  Analyzing Debt/Equity  Debt-to-Equity Ratio = Total Liabilities/Shareholders' Equity This metric is a liquidity ratio that indicates the amount of financial risk a company bears. A company with a lower debt-to-equity ratio shows improved solvency for a company. Investors must be looking for stocks exhibiting solid earnings growth in the last couple of quarters. However, blindly investing in stocks displaying solid earnings growth, without considering their debt level, is not a wise move.  The Winning Strategy  Considering the aforementioned factors, it is prudent to choose stocks with a low debt-to-equity ratio to ensure steady returns. However, an investment strategy based solely on the debt-to-equity ratio might not fetch the desired outcome. To choose stocks that have the potential to give you steady returns, we have expanded our screening criteria to include some other factors.  Here are the other parameters  :  Debt/Equity less than X-Industry Median  : Stocks that are less leveraged than their industry peers.  Current Price greater than or equal to 10  : The stocks must be trading at a minimum of $10 or above.  Average 20-day Volume greater than or equal to 50000  : A substantial trading volume ensures that the stock is easily tradable.  Percentage Change in EPS F(0)/F(-1) greater than X-Industry Median  : Earnings growth adds to optimism, leading to a stock's price appreciation.   VGM  Score of A or B  : Our research shows that stocks with a VGM Score of A or B when combined with a Zacks Rank #1 (Strong Buy) or 2 (Buy) offer the best upside potential.  Estimated One-Year EPS Growth F(1)/F(0) greater than 5  : This shows earnings growth expectation.  Zacks Rank #1 or 2  :  Irrespective of market conditions, stocks with a Zacks Rank #1 have a proven history of success. Excluding stocks that have a negative or a zero debt-to-equity ratio, here are five of the 21 stocks that made it through the screen.  MDU Resources Group MDU  : The company provides value-added natural resource products and related services that are essential to energy and transportation infrastructure.  It delivered average positive earnings surprise of 1.64% in the last four quarters and currently carries a Zacks Rank #2.  Gibraltar Industries ROCK  : It is a leading manufacturer and distributor of building products for the industrial, infrastructure and residential markets. The company currently holds a Zacks Rank of 2 and delivered average positive earnings surprise 0.01% for the last four quarters.  Caseys General Stores CASY  : It is a chain of convenience stores. It came up with average positive earnings surprise of 30.26% in the preceding four quarters and sports a Zacks Rank #1. You can see  the complete list of today's Zacks #1 Rank stocks   here   .  FTI Consulting FCN  : The company is a global business advisory firm. Currently, the company sports a Zacks Rank #1. It came up with average positive earnings surprise of 70.83% in the preceding four quarters.  SolarEdge Technologies SEDG  : It is a global leading PV inverter manufacturer. It sports a Zacks Rank #1. It delivered average positive earnings surprise of 1.23% in the last four quarters. Get the rest of the stocks on the list and start putting this and other ideas to the test. It can all be done with the Research Wizard stock picking and back testing software. The Research Wizard is a great place to begin. It's easy to use. Everything is in plain language. And it's very intuitive. Start your Research Wizard trial today. And the next time you read an economic report, open up the Research Wizard, plug your finds in, and see what gems come out.   Click here to sign up for a free trial to the   Research Wizard today   .  Disclosure: Officers, directors and/or employees of Zacks   Investment Research may own or have sold short securities and/or   hold long and/or short positions in options that are mentioned in   this material. An affiliated investment advisory firm may own or   have sold short securities and/or hold long and/or short   positions in options that are mentioned in this material.   Disclosure: Performance information for Zacks' portfolios and strategies are available at  :     https://www.zacks.com/performance   .   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  MDU Resources Group, Inc. (MDU): Free Stock Analysis Report   Caseys General Stores, Inc. (CASY): Free Stock Analysis Report   Gibraltar Industries, Inc. (ROCK): Free Stock Analysis Report   SolarEdge Technologies, Inc. (SEDG): Free Stock Analysis Report   FTI Consulting, Inc. (FCN): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Leverage is an investment strategy adopted by corporations wherein borrowed capital is used to expand operations and amplify possible returns from risk capital. Per the theory of cost of capital, a company's capital structure reflects a mix of debt and equity that is used to finance capital projects.",
    "Now a comparative analysis of the theory of cost of capital reveals that most companies prefer debt financing over equity since debt is cheaper, especially in periods of low interest rates.",
    "This is because when a company resorts to debt financing, it takes on fixed expenses in the form of interest payments for a specific time period. However, in case of equity financing, a shareholder not only becomes a partial owner of the company but develops a direct claim on the company's future profits as well. So, debt financing remains the preferred option for corporates.",
    "However, debt financing has its share of drawbacks. The problem arises when leverage, referred to as the amount of debt a company bears, becomes exorbitant. A high degree of financial leverage means high interest payments, which affect a company's bottom line.",
    "Therefore, choosing a less debt-ridden stock should be an appropriate option for a risk-averse investor.  And here comes the importance of leverage ratios, which can measure the exact amount of debt risk a company bears. Debt-to-equity ratio is one such measure, perhaps the most popular one, to evaluate a company's creditworthiness for potential equity investments.",
    " Analyzing Debt/Equity ",
    "Debt-to-Equity Ratio = Total Liabilities/Shareholders' Equity",
    "This metric is a liquidity ratio that indicates the amount of financial risk a company bears. A company with a lower debt-to-equity ratio shows improved solvency for a company.",
    "Investors must be looking for stocks exhibiting solid earnings growth in the last couple of quarters. However, blindly investing in stocks displaying solid earnings growth, without considering their debt level, is not a wise move.",
    " The Winning Strategy ",
    "Considering the aforementioned factors, it is prudent to choose stocks with a low debt-to-equity ratio to ensure steady returns.",
    "However, an investment strategy based solely on the debt-to-equity ratio might not fetch the desired outcome. To choose stocks that have the potential to give you steady returns, we have expanded our screening criteria to include some other factors.",
    " Here are the other parameters  :",
    " Debt/Equity less than X-Industry Median  : Stocks that are less leveraged than their industry peers.",
    " Current Price greater than or equal to 10  : The stocks must be trading at a minimum of $10 or above.",
    " Average 20-day Volume greater than or equal to 50000  : A substantial trading volume ensures that the stock is easily tradable.",
    " Percentage Change in EPS F(0)/F(-1) greater than X-Industry Median  : Earnings growth adds to optimism, leading to a stock's price appreciation.",
    "  VGM  Score of A or B  : Our research shows that stocks with a VGM Score of A or B when combined with a Zacks Rank #1 (Strong Buy) or 2 (Buy) offer the best upside potential.",
    " Estimated One-Year EPS Growth F(1)/F(0) greater than 5  : This shows earnings growth expectation.",
    " Zacks Rank #1 or 2  :  Irrespective of market conditions, stocks with a Zacks Rank #1 have a proven history of success.",
    "Excluding stocks that have a negative or a zero debt-to-equity ratio, here are five of the 21 stocks that made it through the screen.",
    " MDU Resources Group MDU  : The company provides value-added natural resource products and related services that are essential to energy and transportation infrastructure.  It delivered average positive earnings surprise of 1.64% in the last four quarters and currently carries a Zacks Rank #2.",
    " Gibraltar Industries ROCK  : It is a leading manufacturer and distributor of building products for the industrial, infrastructure and residential markets. The company currently holds a Zacks Rank of 2 and delivered average positive earnings surprise 0.01% for the last four quarters.",
    " Caseys General Stores CASY  : It is a chain of convenience stores. It came up with average positive earnings surprise of 30.26% in the preceding four quarters and sports a Zacks Rank #1. You can see  the complete list of today's Zacks #1 Rank stocks   here   .",
    " FTI Consulting FCN  : The company is a global business advisory firm. Currently, the company sports a Zacks Rank #1. It came up with average positive earnings surprise of 70.83% in the preceding four quarters.",
    " SolarEdge Technologies SEDG  : It is a global leading PV inverter manufacturer. It sports a Zacks Rank #1. It delivered average positive earnings surprise of 1.23% in the last four quarters.",
    "Get the rest of the stocks on the list and start putting this and other ideas to the test. It can all be done with the Research Wizard stock picking and back testing software.",
    "The Research Wizard is a great place to begin. It's easy to use. Everything is in plain language. And it's very intuitive. Start your Research Wizard trial today. And the next time you read an economic report, open up the Research Wizard, plug your finds in, and see what gems come out.",
    "  Click here to sign up for a free trial to the   Research Wizard today   .",
    " Disclosure: Officers, directors and/or employees of Zacks   Investment Research may own or have sold short securities and/or   hold long and/or short positions in options that are mentioned in   this material. An affiliated investment advisory firm may own or   have sold short securities and/or hold long and/or short   positions in options that are mentioned in this material. ",
    " Disclosure: Performance information for Zacks' portfolios and strategies are available at  :     https://www.zacks.com/performance   .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:59:00"
}