{
  "url": "https://www.nasdaq.com/article/emirates-nbds-gains-support-dubai-egypt-up-on-financials-20190905-00684",
  "title": "Emirates NBD's gains support Dubai, Egypt up on financials - Nasdaq.com",
  "text": [
    "By Ateeq Shariff",
    "Sept 5 (Reuters) - The Dubai stock market rose on Thursday, mainly helped by its largest lender Emirates NBD , while Egypt rebounded on the back of financials.",
    "Dubai's index  closed 0.4% up, with Emirates NBD increasing 1.5% and Dubai Islamic Bank , the United Arab Emirates' largest sharia-compliant lender, adding 0.6%.    Emirates NBD has been rising since Monday after it raised its foreign ownership limit to 20% from 5%.",
    "The realtor's chairman said on Wednesday he did not expect a change in the company's business after Dubai's ruler set up a new real estate committee to regulate and control market supply. ",
    "Dubai's property prices have contracted by 25-35% since a mid-2014 peak and will continue to decline sharply this year and next, as a slowdown in the economy and an oversupply of housing units pose big downside risks to already weak outlook of real estate sector in the Emirate, a Reuters poll showed. ",
    "The Egyptian blue-chip index  was up 0.6% with its biggest bank, Commercial International Bank , rising  1.6%, while Eastern Company  advancing 3.3%.",
    "Last month, Egypt reported its lowest headline inflation rate in nearly four years, and its central bank cut interest rates by 150 basis points on Thursday. ",
    "Egypt's index is up 14.6% so far this year, beating most regional markets.",
    "The Saudi index  slipped 0.1%, driven down by a 0.9% fall in market heavyweight Saudi Basic Industries  and a 1% drop in Saudi Telecom Company .",
    "Saudi Arabia may have to revise down economic growth estimates as lower crude output and tumbling oil prices take their toll on economic activity, with some economists forecasting a contraction this year in the world's biggest oil exporter, Reuters reported on Wednesday. ",
    "The Saudi central bank forecast economic growth of at least 2% this year but economists now expect marginal growth at best or a slight shrinkage, its second in two years.",
    "The Abu Dhabi index  lost 0.2% as Abu Dhabi Commercial Bank  ended 1.5% lower.",
    "Qatar's index  also ended lower to close at 0.4% down with Qatar National Bank , the Gulf's largest lender by assets, falling 1.2% and Qatar Islamic Bank  down 1%."
  ],
  "published_datetime": "2019-09-05 09:36:00"
}