{
  "url": "https://www.nasdaq.com/article/q3-earnings-season-preview-cm1210832",
  "title": "Q3 Earnings Season Preview - Nasdaq.com",
  "text": [
    "Note: The following is an excerpt from this week's Earnings Trends  report. You can access the full report that contains detailed historical actual and estimates for the current and following periods,  please click here>>>",
    "Here are the key points:",
    "We still have about four weeks to go before the Q3 earnings season really gets going, but we will officially start tracking this reporting cycle in the next few days as companies with fiscal quarters ending in August like Oracle (ORCL), FedEx (FDX) and others coming out with quarterly results. All of these companies with fiscal quarters ending in August can count as part of the September-quarter tally. In fact, we will have seen results from almost two dozen such companies by the time JPMorgan (JPM) reports results on October 15th.",
    "The expectation is that the overall earnings growth picture emerging from the Q3 earnings season will not be much different from what we saw in the first two quarters of the year.",
    "Total Q3 earnings for the S&P 500 index are expected to be down -4.7% from the same period last year on +4.3% higher revenues. Driving this weak growth picture is tough comparisons to last year when earnings were boosted by the tax reform.",
    "Estimates for Q3 came down as the quarter got underway, as the chart below shows.",
    "While the revisions trend is undoubtedly negative, the magnitude of decline in Q3 earnings estimates is about in-line with historical trends.",
    "The chart below of quarterly year-over-year earnings growth for the S&P 500 index shows estimates for the current and following 2 quarters and actual results for the preceding 4 quarters.",
    "As you can see above, earnings growth was flat in the March and June quarters, and is expected to be down -4.7% in the current period and in modestly positive territory in the last quarter of the year. My sense is that actual Q3 growth will most likely be in the vicinity of what we saw in the first half of the year and Q4 earnings growth will most likely turn negative by the time we are closing the books on the Q3 reporting cycle. ",
    "The chart below puts earnings growth expectations for full-year 2019 in the context of where growth has been in recent years and what is expected in the next two years.",
    "The market appears to have accepted the deceleration in growth this year in the hope that growth resumes from next year onwards.",
    "The key issue will be if expectations for next year remain stable or start coming down as we move through the remainder of the year. Analysts have not made any significant revisions to their estimates in response to the ongoing trade dispute, likely in the hope that the issue will eventually get resolved. This, coupled with the ongoing economic weakness in Europe, China and elsewhere likely represent downside risks to the growth outlook. ",
    "It's Illegal in 42 States, But Investors Will Make Billions Legally",
    "In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    "That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:52:00"
}