{
  "url": "https://www.nasdaq.com/article/malaysia-aug-palm-stocks-set-to-hit-13month-low--reuters-survey-20190904-01222",
  "title": "Malaysia Aug palm stocks set to hit 13-month low - Reuters survey - Nasdaq.com",
  "text": [
    "By Emily Chow",
    "KUALA LUMPUR, Sept 5 (Reuters) - Malaysian palm oil stockpiles are forecast to fall for a sixth straight month in August to the lowest in more than a year, as stronger exports outpace a slight rise in output, a Reuters survey showed.",
    "Inventories in Malaysia, the world's second-largest palm oil producer, are expected to fall 7.1% from the previous month to 2.22 million tonnes at end-August, the lowest since July 2018, according to a median estimate of seven planters, traders and analysts polled by Reuters. ",
    "The expected drawdown in stocks was due mainly strong gains in exports, which were seen rising 14.5% from July to 1.70 million tonnes in August.",
    "It would be the second consecutive month of gains, and the sharpest monthly rise since March, with poll respondents pointing to increasing demand from India and China. ",
    "India, the world's largest edible oils importer has posted a strong jump in imports of refined palm oil from Malaysia this year following a change in Indian duties.  On Wednesday it boosted the tax for six months. ",
    "China, another key edible oils buyer, has also been relying on palm as a soyoil substitute, as a trade war with the U.S. has curbed soybean imports after Beijing imposed tariffs on American cargoes.",
    "The survey pegged August output at 1.77 million tonnes, up 1.8% from the previous month, to the highest since December 2018, although three poll respondents forecast falling output. ",
    "\"Production in many regions was down month-on-month during the first half of August, partly due to the dry weather,\" said a manager at a plantations company, who declined to be named as he was not authorized to speak to the media.",
    "\"However, rains during the last 10 days of the month, especially in East Malaysia, after a relatively long dry spell have given a boost in production.\"",
    "Poll respondents added that output would rise from now until the year-end, estimating peak production to be around October to November this year.",
    "Official palm oil data will be published by the Malaysian Palm Oil Board ‪after 0430 GMT on Sept. 10.",
    "The median results from the Reuters survey put Malaysia's consumption in August at 304,677 tonnes.",
    "Breakdown of August estimates (in tonnes):",
    "* Official stocks of 2,391,677 tonnes in July plus the above estimated output and imports yield a total August supply of 4,226,677 tonnes. Based on the median of exports and closing stocks estimate, Malaysia's domestic consumption in August is estimated to be 304,677 tonnes.",
    "($1 = 4.1900 ringgit)"
  ],
  "published_datetime": "2019-09-04 09:37:00"
}