{
  "url": "https://www.nasdaq.com/article/illinois-jumps-on-bandwagon-to-block-t-mobile-and-sprints-merger-cm1206956",
  "title": "Illinois Jumps on Bandwagon to Block T-Mobile and Sprint's Merger - Nasdaq.com",
  "text": [
    " Over the summer, numerous state attorneys general joined   forces to file a lawsuit   seeking to block T-Mobile    's (NASDAQ: TMUS) proposed megamerger with smaller rival   Sprint    (NYSE: S) , a $26 billion deal that would reshape the U.S.   wireless industry, a favorite among   dividend investors    . Additional states promptly   piled on    , with more joining the effort opposing the deal in the months   since. The states argue that the merger would hurt competition   and eventually lead to higher prices for consumers. Illinois has now jumped on the bandwagon, too.   Sprint Executive Chairman Marcelo Claure and T-Mobile CEO     John Legere. Image source: T-Mobile.makeArticleAd();  Over half of the U.S. population is represented New York Attorney General Letitia James announced the   latest addition this morning, noting that Illinois Attorney   General Kwame Raoul will become the 17th state prosecutor to join   the suit. That means a full third of state attorneys general in   the U.S. (when including the District of Columbia), which James   notes represent over half of the U.S. population, are now   attempting to block the deal. The attorneys general now included in the lawsuit represent   California, Colorado, Connecticut, Hawaii, Illinois, Maryland,   Massachusetts, Michigan, Minnesota, Mississippi, Nevada, New   York, Oregon, Texas, Virginia, Wisconsin, and the District of   Columbia. \"This merger would significantly decrease competition for   mobile wireless telecommunications services in Illinois and   across the country,\" Raoul said in a statement. \"With fewer   companies competing, customers would face fewer choices, higher   prices, less innovation and lower quality service.\" The   prosecutors note that Illinois includes the third-most-populous   city in the U.S. (Chicago) and is an important hub for the   industrial, agricultural, and transportation sectors, which makes   it \"highly susceptible\" to competitive harm. So much for closing in 2019 T-Mobile and Sprint   scored merger approval    from the Department of Justice in late July, a settlement that   required the combined company to spin off certain prepaid   subsidiaries in addition to wireless spectrum. The idea is to enable a new fourth wireless carrier --   DISH Network    -- to be created in order to preserve competition, although   critics such as the attorneys general question the viability of   the proposal since DISH has no meaningful experience in deploying   a cellular network nationally. It's worth noting that   five of the states that are currently still part of the   lawsuit (Nebraska, Kansas, Ohio, Oklahoma, and South Dakota) have   signed on to the proposed settlement. The states won a delay last month that pushed the trial   to Dec. 9, with the attorneys general arguing they needed more   time to investigate. T-Mobile had previously hoped to secure   all of the necessary approvals in order to close the deal by the   year's end, but that timeline now seems unlikely. \"We believe the plaintiffs' claims are without merit, and we   intend to defend the lawsuit vigorously,\" T-Mobile wrote in its   most recent 10-Q.   10 stocks we like better than T-Mobile US       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and T-Mobile US wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Evan Niu, CFA      has no position in any of the stocks mentioned. The Motley Fool     recommends T-Mobile US. The Motley Fool has a     disclosure policy      .  ",
    "Over the summer, numerous state attorneys general joined   forces to file a lawsuit   seeking to block T-Mobile    's (NASDAQ: TMUS) proposed megamerger with smaller rival   Sprint    (NYSE: S) , a $26 billion deal that would reshape the U.S.   wireless industry, a favorite among   dividend investors    . Additional states promptly   piled on    , with more joining the effort opposing the deal in the months   since. The states argue that the merger would hurt competition   and eventually lead to higher prices for consumers.",
    "Illinois has now jumped on the bandwagon, too.",
    "  Sprint Executive Chairman Marcelo Claure and T-Mobile CEO     John Legere. Image source: T-Mobile.makeArticleAd(); ",
    "Sprint Executive Chairman Marcelo Claure and T-Mobile CEO     John Legere. Image source: T-Mobile.",
    "New York Attorney General Letitia James announced the   latest addition this morning, noting that Illinois Attorney   General Kwame Raoul will become the 17th state prosecutor to join   the suit. That means a full third of state attorneys general in   the U.S. (when including the District of Columbia), which James   notes represent over half of the U.S. population, are now   attempting to block the deal.",
    "The attorneys general now included in the lawsuit represent   California, Colorado, Connecticut, Hawaii, Illinois, Maryland,   Massachusetts, Michigan, Minnesota, Mississippi, Nevada, New   York, Oregon, Texas, Virginia, Wisconsin, and the District of   Columbia.",
    "\"This merger would significantly decrease competition for   mobile wireless telecommunications services in Illinois and   across the country,\" Raoul said in a statement. \"With fewer   companies competing, customers would face fewer choices, higher   prices, less innovation and lower quality service.\" The   prosecutors note that Illinois includes the third-most-populous   city in the U.S. (Chicago) and is an important hub for the   industrial, agricultural, and transportation sectors, which makes   it \"highly susceptible\" to competitive harm.",
    "T-Mobile and Sprint   scored merger approval    from the Department of Justice in late July, a settlement that   required the combined company to spin off certain prepaid   subsidiaries in addition to wireless spectrum.",
    "The idea is to enable a new fourth wireless carrier --   DISH Network    -- to be created in order to preserve competition, although   critics such as the attorneys general question the viability of   the proposal since DISH has no meaningful experience in deploying   a cellular network nationally. It's worth noting that   five of the states that are currently still part of the   lawsuit (Nebraska, Kansas, Ohio, Oklahoma, and South Dakota) have   signed on to the proposed settlement.",
    "The states won a delay last month that pushed the trial   to Dec. 9, with the attorneys general arguing they needed more   time to investigate. T-Mobile had previously hoped to secure   all of the necessary approvals in order to close the deal by the   year's end, but that timeline now seems unlikely.",
    "\"We believe the plaintiffs' claims are without merit, and we   intend to defend the lawsuit vigorously,\" T-Mobile wrote in its   most recent 10-Q.",
    "  10 stocks we like better than T-Mobile US       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and T-Mobile US wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than T-Mobile US       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and T-Mobile US wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Evan Niu, CFA      has no position in any of the stocks mentioned. The Motley Fool     recommends T-Mobile US. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 15:38:23"
}