{
  "url": "https://www.nasdaq.com/article/asian-stocks-at-6week-highs-as-trade-war-gloom-lifts-before-ecb-20190912-00035",
  "title": "Asian stocks at 6-week highs as trade war gloom lifts before ECB - Nasdaq.com",
  "text": [
    "By Stanley White",
    "TOKYO, Sept 12 (Reuters) - Asian stocks advanced to a six-week high on Thursday on hopes for a thaw in U.S.-China trade relations and expectations that the European Central Bank would kick off another wave of monetary easing by global central banks.",
    "MSCI's broadest index of Asia-Pacific shares outside Japan  was up 0.5% and Tokyo's Nikkei stock index  rose 0.96%. Australian shares  were up 0.2%.",
    "Chinese stocks rose and the yuan hit a three-week high after U.S. President Donald Trump agreed to delay an additional increase in tariffs on Chinese goods by two weeks at the request of China's Vice Premier Liu He \"as a gesture of good will.\" ",
    "U.S. stock futures  rose 0.38% and safe-havens such as the yen, U.S. Treasuries, and gold weakened in a sign of improving appetite for risk.",
    "\"Trump's comments are likely to put a little juice in the market, but it could be gone tomorrow,\" said Hugh Dive, chief investment officer at Atlas Funds Management in Sydney.",
    "\"Some in the market react to small changes in negotiating positions because Trump is negotiating in the open. I'm more concerned about Brexit, because there is some complacency in the EU about this.\"",
    "Oil prices rose in Asia, rebounding from a tumble on Wednesday, on hopes OPEC members will cut output to support prices.",
    "Any easing of concerns about the bruising trade war is likely to help equities extend their rally this month after a tumultuous August.",
    "Investors also await an ECB meeting later on Thursday to see how far policymakers will go to support a flagging economy, given the risks posed by Britain's divorce from the European Union, commonly referred to as Brexit.",
    "On Wall Street, the S&P 500  ended 0.72% higher on Wednesday.",
    "The dollar briefly rose to a six-week high of 108.175 yen  before paring gains slightly to trade up 0.17% at 108.030 yen.",
    "The yield on benchmark 10-year Treasury notes   rose to 1.7730%, the highest in five weeks, extending a sell-off in government bonds that started on Sept. 4.",
    "Spot gold  fell 0.14% to $1,495.00 per ounce. GOL/",
    "Trump's delay of additional tariffs on Chinese goods comes one day after China said it would exempt 16 types of U.S. products from import tariffs. ",
    "The world's two largest economies have been locked in protracted battle over Beijing's trade practices that has raised the spectre of a global recession.",
    "The gestures of goodwill raise hopes both sides can narrow their differences before working-level talks resume in mid-September and high-level trade negotiations that are expected in October.",
    "In offshore trading, the yuan  rose to a three-week high of 7.0739 per dollar, while Chinese shares  rose 0.66% on renewed optimism about trade talks.",
    "The euro  held steady at $1.1014 but remained near a one-week low. The ECB is set to unveil fresh stimulus measures on Thursday but its exact moves are far from clear.     ",
    "Germany is at risk of slipping into recession and inflation expectations sliding, but ECB President Mario Draghi, who hands over the leadership of the central bank to Christine Lagarde at the end of October, will face resistance to aggressive easing from more conservative ECB members. ",
    "Sterling  traded at $1.2328, little changed following a 0.24% decline on Wednesday after a Scottish court ruled that Prime Minister Boris Johnson's suspension of the British Parliament was unlawful.",
    "Political wrangling over the terms of the UK's exit from the EU has weighed on the outlook for the British pound. ",
    "U.S. crude  rose 0.93% to $56.27 in Asia on the day. Futures tumbled more than 2% on Wednesday following a report that Trump is considering easing sanctions on Iran, which could potentially boost oil supplies.",
    "Asian traders were likely focused on OPEC's decision on Wednesday to cut its forecast for global oil demand in 2020. OPEC also said all producers have a shared responsibility to support the oil market. "
  ],
  "published_datetime": "2019-09-12 01:47:00"
}