{
  "url": "https://www.nasdaq.com/article/financial-services-provider-alerus-financial-sets-terms-for-75-million-ipo-cm1206687",
  "title": "Financial services provider Alerus Financial sets terms for $75 million IPO - Nasdaq.com",
  "text": [
    " Alerus Financial, a diversified financial services provider with locations in five states, announced terms for its IPO on Tuesday.    The Grand Forks, ND-based company plans to raise $75 million by offering 3.3 million shares at a price range of $22 to $24. At the midpoint of the proposed range, Alerus Financial would command a fully diluted market value of $401 million.    Alerus Financial was founded in 1879 and booked $183 million in revenue for the 12 months ended June 30, 2019. It plans to list on the Nasdaq under the symbol ALRS. Raymond James and D.A. Davidson are the joint bookrunners on the deal. It is expected to price during the week of September 9, 2019.  The article Financial services provider Alerus Financial sets terms for $75 million IPO  originally appeared on IPO investment manager Renaissance Capital's web site renaissancecapital.com.   Investment Disclosure:  The information and opinions expressed herein were prepared by Renaissance Capital's research analysts and do not constitute an offer to buy or sell any security. Renaissance Capital's Renaissance IPO ETF (symbol: IPO)  , Renaissance International ETF (symbol: IPOS)  , or separately managed institutional accounts may have investments in securities of companies mentioned.",
    "Alerus Financial, a diversified financial services provider with locations in five states, announced terms for its IPO on Tuesday.    The Grand Forks, ND-based company plans to raise $75 million by offering 3.3 million shares at a price range of $22 to $24. At the midpoint of the proposed range, Alerus Financial would command a fully diluted market value of $401 million.    Alerus Financial was founded in 1879 and booked $183 million in revenue for the 12 months ended June 30, 2019. It plans to list on the Nasdaq under the symbol ALRS. Raymond James and D.A. Davidson are the joint bookrunners on the deal. It is expected to price during the week of September 9, 2019.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:09:00"
}