{
  "url": "https://www.nasdaq.com/article/asbury-automotive-abg-hits-fresh-high-is-there-still-room-to-run-cm1208003",
  "title": "Asbury Automotive (ABG) Hits Fresh High: Is There Still Room to Run? - Nasdaq.com",
  "text": [
    " Shares of Asbury Automotive Group (ABG) have been strong performers lately, with the stock up 3.7% over the past month. The stock hit a new 52-week high of $95.4 in the previous session. Asbury Automotive Group has gained 42.9% since the start of the year compared to the 20% move for the Zacks Retail-Wholesale sector and the 31% return for the Zacks Automotive - Retail and Whole Sales industry.  What's Driving the Outperformance?  The stock has an impressive record of positive earnings surprises, as it hasn't missed our earnings consensus estimate in any of the last four quarters. In its las t earnings  report on July 26, 2019, Asbury Automotive reported EPS of $2.38 versus consensus estimate of $2.27 while it beat the consensus revenue estimate by 0.44%. For the current fiscal year, Asbury Automotive is expected to post earnings of $9.29 per share on $7.21 billion in revenues. This represents a 10.46% change in EPS on a 4.87% change in revenues. For the next fiscal year, the company is expected to earn $9.83 per share on $7.34 billion in revenues. This represents a year-over-year change of 5.75% and 1.76%, respectively.  Valuation Metrics  Asbury Automotive may be at a 52-week high right now, but what might the future hold for the stock? A key aspect of this question is taking a look at valuation metrics in order to determine if the company is due for a pullback from this level. On this front, we can look at the Zacks Style Scores, as these give investors a variety of ways to comb through stocks (beyond looking at the Zacks Rank of a security). These styles are represented by grades running from A to F in the categories of Value, Growth, and Momentum, while there is a combined VGM Score as well. Investors should consider the style scores a valuable tool that can help you to pick the most appropriate Zacks Rank stocks based on their individual investment style. Asbury Automotive has a Value Score of A. The stock's Growth and Momentum Scores are A and F, respectively, giving the company a VGM Score of A. In terms of its value breakdown, the stock currently trades at 10.3X current fiscal year EPS estimates. On a trailing cash flow basis, the stock currently trades at 8.2X versus its peer group's average of 7.1X. Additionally, the stock has a PEG ratio of 0.72. This isn't enough to put the company in the top echelon of all stocks we cover from a value perspective.  Zacks Rank  We also need to consider the stock's Zacks Rank, as this supersedes any trend on the style score front. Fortunately, Asbury Automotive currently has a Zacks Rank of #1 (Strong Buy) thanks to favorable earnings estimate revisions from covering analysts. Since we recommend that investors select stocks carrying Zacks Rank of 1 (Strong Buy) or 2 (Buy) and Style Scores of A or B, it looks as if Asbury Automotive meets the list of requirements. Thus, it seems as though Asbury Automotive shares could have a bit more room to run in the near term.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Asbury Automotive Group, Inc. (ABG): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Shares of Asbury Automotive Group (ABG) have been strong performers lately, with the stock up 3.7% over the past month. The stock hit a new 52-week high of $95.4 in the previous session. Asbury Automotive Group has gained 42.9% since the start of the year compared to the 20% move for the Zacks Retail-Wholesale sector and the 31% return for the Zacks Automotive - Retail and Whole Sales industry.",
    " What's Driving the Outperformance? ",
    "The stock has an impressive record of positive earnings surprises, as it hasn't missed our earnings consensus estimate in any of the last four quarters. In its las t earnings  report on July 26, 2019, Asbury Automotive reported EPS of $2.38 versus consensus estimate of $2.27 while it beat the consensus revenue estimate by 0.44%.",
    "For the current fiscal year, Asbury Automotive is expected to post earnings of $9.29 per share on $7.21 billion in revenues. This represents a 10.46% change in EPS on a 4.87% change in revenues. For the next fiscal year, the company is expected to earn $9.83 per share on $7.34 billion in revenues. This represents a year-over-year change of 5.75% and 1.76%, respectively.",
    " Valuation Metrics ",
    "Asbury Automotive may be at a 52-week high right now, but what might the future hold for the stock? A key aspect of this question is taking a look at valuation metrics in order to determine if the company is due for a pullback from this level.",
    "On this front, we can look at the Zacks Style Scores, as these give investors a variety of ways to comb through stocks (beyond looking at the Zacks Rank of a security). These styles are represented by grades running from A to F in the categories of Value, Growth, and Momentum, while there is a combined VGM Score as well. Investors should consider the style scores a valuable tool that can help you to pick the most appropriate Zacks Rank stocks based on their individual investment style.",
    "Asbury Automotive has a Value Score of A. The stock's Growth and Momentum Scores are A and F, respectively, giving the company a VGM Score of A.",
    "In terms of its value breakdown, the stock currently trades at 10.3X current fiscal year EPS estimates. On a trailing cash flow basis, the stock currently trades at 8.2X versus its peer group's average of 7.1X. Additionally, the stock has a PEG ratio of 0.72. This isn't enough to put the company in the top echelon of all stocks we cover from a value perspective.",
    " Zacks Rank ",
    "We also need to consider the stock's Zacks Rank, as this supersedes any trend on the style score front. Fortunately, Asbury Automotive currently has a Zacks Rank of #1 (Strong Buy) thanks to favorable earnings estimate revisions from covering analysts.",
    "Since we recommend that investors select stocks carrying Zacks Rank of 1 (Strong Buy) or 2 (Buy) and Style Scores of A or B, it looks as if Asbury Automotive meets the list of requirements. Thus, it seems as though Asbury Automotive shares could have a bit more room to run in the near term.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:35:06"
}