{
  "url": "https://www.nasdaq.com/article/is-northrop-grumman-noc-outperforming-other-aerospace-stocks-this-year-cm1207178",
  "title": "Is Northrop Grumman (NOC) Outperforming Other Aerospace Stocks This Year? - Nasdaq.com",
  "text": [
    " Investors interested in Aerospace stocks should always be looking to find the best-performing companies in the group. Has Northrop Grumman (NOC) been one of those stocks this year? Let's take a closer look at the stock's year-to-date performance to find out. Northrop Grumman is a member of the Aerospace sector. This group includes 33 individual stocks and currently holds a Zacks Sector Rank of #1. The Zacks Sector Rank gauges the strength of our 16 individual sector groups by measuring the average Zacks Rank of the individual stocks within the groups. The Zacks Rank is a proven model that highlights a variety of stocks with the right characteristics to outperform the market over the next one to three months. The system emphasizes earnings estimate revisions and favors companies with improving earnings outlooks. NOC is currently sporting a Zacks Rank of #2 (Buy). Within the past quarter, the Zacks Consensus Estimate for NOC's full-year earnings has moved 1.07% higher. This shows that analyst sentiment has improved and the company's earnings outlook is stronger. Based on the latest available data, NOC has gained about 49.54% so far this year. At the same time, Aerospace stocks have gained an average of 29.09%. This means that Northrop Grumman is outperforming the sector as a whole this year. To break things down more, NOC belongs to the Aerospace - Defense industry, a group that includes 11 individual companies and currently sits at #18 in the Zacks Industry Rank. This group has gained an average of 27% so far this year, so NOC is performing better in this area. Investors in the Aerospace sector will want to keep a close eye on NOC as it attempts to continue its solid performance.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Northrop Grumman Corporation (NOC): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors interested in Aerospace stocks should always be looking to find the best-performing companies in the group. Has Northrop Grumman (NOC) been one of those stocks this year? Let's take a closer look at the stock's year-to-date performance to find out.",
    "Northrop Grumman is a member of the Aerospace sector. This group includes 33 individual stocks and currently holds a Zacks Sector Rank of #1. The Zacks Sector Rank gauges the strength of our 16 individual sector groups by measuring the average Zacks Rank of the individual stocks within the groups.",
    "The Zacks Rank is a proven model that highlights a variety of stocks with the right characteristics to outperform the market over the next one to three months. The system emphasizes earnings estimate revisions and favors companies with improving earnings outlooks. NOC is currently sporting a Zacks Rank of #2 (Buy).",
    "Within the past quarter, the Zacks Consensus Estimate for NOC's full-year earnings has moved 1.07% higher. This shows that analyst sentiment has improved and the company's earnings outlook is stronger.",
    "Based on the latest available data, NOC has gained about 49.54% so far this year. At the same time, Aerospace stocks have gained an average of 29.09%. This means that Northrop Grumman is outperforming the sector as a whole this year.",
    "To break things down more, NOC belongs to the Aerospace - Defense industry, a group that includes 11 individual companies and currently sits at #18 in the Zacks Industry Rank. This group has gained an average of 27% so far this year, so NOC is performing better in this area.",
    "Investors in the Aerospace sector will want to keep a close eye on NOC as it attempts to continue its solid performance.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:11"
}