{
  "url": "https://www.nasdaq.com/article/should-wisdomtree-us-smallcap-fund-ees-be-on-your-investing-radar-cm1210857",
  "title": "Should WisdomTree U.S. SmallCap Fund (EES) Be on Your Investing Radar? - Nasdaq.com",
  "text": [
    "Designed to provide broad exposure to the Small Cap Value segment of the US equity market, the WisdomTree U.S. SmallCap Fund (EES) is a passively managed exchange traded fund launched on 02/23/2007.",
    "The fund is sponsored by Wisdomtree. It has amassed assets over $802.40 M, making it one of the average sized ETFs attempting to match the Small Cap Value segment of the US equity market.",
    "Why Small Cap Value",
    "With more potential comes more risk, and small cap companies, with market capitalization below $2 billion, epitomizes this way of thinking.",
    "While value stocks have lower than average price-to-earnings and price-to-book ratios, they also have lower than average sales and earnings growth rates. Considering long-term performance, value stocks have outperformed growth stocks in almost all markets; however, they are more likely to underperform growth stocks in strong bull markets.",
    "Costs",
    "Expense ratios are an important factor in the return of an ETF and in the long term, cheaper funds can significantly outperform their more expensive counterparts, other things remaining the same.",
    "Annual operating expenses for this ETF are 0.38%, putting it on par with most peer products in the space.",
    "It has a 12-month trailing dividend yield of 1.39%.",
    "Sector Exposure and Top Holdings",
    "Even though ETFs offer diversified exposure that minimizes single stock risk, investors should also look at the actual holdings inside the fund. Luckily, most ETFs are very transparent products that disclose their holdings on a daily basis.",
    "This ETF has heaviest allocation to the Consumer Discretionary sector--about 24.10% of the portfolio. Financials and Industrials round out the top three.",
    "Looking at individual holdings, Lithia Motors Inc (LAD) accounts for about 1.13% of total assets, followed by Kb Home (KBH) and Taylor Morrison Home Corp (TMHC).",
    "The top 10 holdings account for about 7.89% of total assets under management.",
    "Performance and Risk",
    "EES seeks to match the performance of the WisdomTree U.S. SmallCap Earnings Index before fees and expenses. The WisdomTree U.S. SmallCap Earnings Index is a fundamentally weighted index that measures the performance o f earnings -generating companies within the small-capitalization segment of the U.S. Stock Market.",
    "The ETF return is roughly 14.28% so far this year and is down about -8.42% in the last one year (as of 09/12/2019). In the past 52-week period, it has traded between $30.28 and $40.61.",
    "The ETF has a beta of 1.20 and standard deviation of 16.22% for the trailing three-year period, making it a medium risk choice in the space. With about 848 holdings, it effectively diversifies company-specific risk.",
    "Alternatives",
    "WisdomTree U.S. SmallCap Fund carries a Zacks ETF Rank of 3 (Hold), which is based on expected asset class return, expense ratio, and momentum, among other factors. Thus, EES is a reasonable option for those seeking exposure to the Style Box - Small Cap Value area of the market. Investors might also want to consider some other ETF options in the space.",
    "The iShares Russell 2000 Value ETF (IWN) and the Vanguard Small-Cap Value ETF (VBR) track a similar index. While iShares Russell 2000 Value ETF has $9.28 B in assets, Vanguard Small-Cap Value ETF has $13.60 B. IWN has an expense ratio of 0.24% and VBR charges 0.07%.",
    "Bottom-Line",
    "While an excellent vehicle for long term investors, passively managed ETFs are a popular choice among institutional and retail investors due to their low costs, transparency, flexibility, and tax efficiency.",
    "To learn more about this product and other ETFs, screen for products that match your investment objectives and read articles on latest developments in the ETF investing universe, please visit Zacks ETF Center .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 06:45:00"
}