{
  "url": "https://www.nasdaq.com/article/4-high-earnings-yield-stocks-to-power-your-portfolio-cm1208143",
  "title": "4 High Earnings Yield Stocks to Power Your Portfolio - Nasdaq.com",
  "text": [
    "If you are not sure whether to invest your money in bonds or stocks, a key parameter that can show you the right direction is earnings yield. It is the reciprocal of the price-to-earnings (P/E) ratio. This ratio is effective for determining undervalued stocks. Also, this ratio is useful for comparing stocks with the market or fixed income securities.",
    "Earnings yield can be calculated as (annual earnings per share/market price) x 100. While comparing similar stocks, the one with high earnings yield should fetch higher returns.",
    "This ratio is effective for comparing the performance of the market with the 10-year Treasury yield. When the yield of the market index is higher than the 10-year Treasury yield, stocks can be said to be undervalued in comparison to bonds. This implies that investing in the stock market is a better option for a value investor.",
    "However, while T-bills are free from risks, investing in stocks always carries some inherent risks. Hence, it will be wise to add a risk premium to the Treasury yield while comparing with the earnings yield of a stock or the broader market.",
    "The Winning Strategy",
    "We have set  Earnings Yield greater than 10%  as our primary screening criterion but it alone cannot be used for picking stocks that have the potential to generate solid returns. So, we have added the following parameters to the screen:",
    "Estimated EPS growth for the next 12 months greater than or equal to the S&P 500 : This metric compares the 12-month forward EPS estimate with the 12-month actual EPS.",
    "Average Daily Volume (20 Day) greater than or equal to 100,000 : High trading volume implies that a stock has adequate liquidity.",
    "Current Price greater than or equal to $5 .",
    "Buy-Rated Stocks : Stocks with a Zacks Rank #1 (Strong Buy) or 2 (Buy) have been known to outperform peers in any type of market environment. You can see  the complete list of today's Zacks #1 Rank stocks here .",
    "Here are four of the 71 stocks that made it through the screen:",
    "Based in L.A.  Guess?GES designs, markets, distributes and licenses casual apparel and accessories for men, women and children per American lifestyle and European fashion sensibilities. It has a Zacks Rank #1 and an expected EPS growth rate of 17.5% for the next 3-5 years.",
    "Headquartered in Oregon, Lithia MotorsLAD is one of the leading automotive retailers of new and used vehicles, and related services in the United States. Apart from a wide range of new and used vehicles, the company offers finance and insurance products, and automotive repair and maintenance. It has a Zacks Rank #2 and an expected EPS growth rate of 11.9% for the next 3-5 years.",
    "Arizona-based Meritage Homes CorporationMTH is one of the leading designers and builders of single-family homes.  The company primarily engages in building and selling single-family homes for entry-level, first-time, move-up, luxury and active adult buyers in historically high-growth regions of the United States. It has a Zacks Rank #1 and an expected EPS growth rate of 8.2% for the next 3-5 years.",
    "Irving, TX- based Commercial Metals CompanyCMC manufactures, recycles and markets steel and metal products, related materials and services. It has a Zacks Rank #2 and an expected EPS growth rate of 3.8% for the next 3-5 years.",
    "You can get the rest of the stocks on this list by signing up now for a 2-week free trial to the Research Wizard stock picking and backtesting software. You can also create your own strategies and test them first before making investments.",
    "The Research Wizard is a great place to begin. It's easy to use. Everything is in plain language. And it's very intuitive. Start your Research Wizard trial today. And the next time you read an economic report, open up the Research Wizard, plug your finds in, and see what gems come out.",
    "Click here to sign up for a free trial to the Research Wizard today .",
    "Disclosure :  Officers, directors and/or employees of Zacks Investment Research may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material. An affiliated investment advisory firm may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material .",
    "Disclosure:  Performance information for Zacks' portfolios and strategies are available at :  https://www.zacks.com/performance .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:36:00"
}