{
  "url": "https://www.nasdaq.com/article/why-energy-transfer-et-could-be-a-top-value-stock-pick-cm1206644",
  "title": "Why Energy Transfer (ET) Could Be a Top Value Stock Pick - Nasdaq.com",
  "text": [
    " Value investing is always a very popular strategy, and for good reason. After all, who doesn't want to find stocks that have low PEs, solid outlooks, and decen t dividends  ?  makeArticleAd();  Fortunately for investors looking for this combination, we have identified a strong candidate which may be an impressive value; Energy Transfer LP ET  .   Energy Transfer in Focus    ET may be an interesting play thanks to its forward PE of 10.2, its P/S ratio of 0.7, and its decen t dividend yield  of 9%. These factors suggest that Energy Transfer is a pretty good value pick, as investors have to pay a relatively low level for each dollar o f earnings  , and that ET has decent revenue metrics to back up its earnings.   Energy Transfer LP PS Ratio (TTM)         Energy Transfer LP ps-ratio-ttm    |   Energy Transfer LP Quote   But before you think that Energy Transfer is just a pure value play, it is important to note that it has been seeing solid activity on the earnings estimate front as well. For current year earnings, the consensus has gone up by 3.9% in the past 30 days, thanks to three upward revisions in the past one month compared to one lower.    This estimate strength is actually enough to push ET to a Zacks Rank #2 (Buy), suggesting it is poised to outperform. You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .    So really, Energy Transfer is looking great from a number of angles thanks to its PE below 20, a P/S ratio below one, and a strong Zacks Rank, meaning that this company could be a great choice for value investors at this time.   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Energy Transfer LP (ET): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Value investing is always a very popular strategy, and for good reason. After all, who doesn't want to find stocks that have low PEs, solid outlooks, and decen t dividends  ?  makeArticleAd();  Fortunately for investors looking for this combination, we have identified a strong candidate which may be an impressive value; Energy Transfer LP ET  .   Energy Transfer in Focus    ET may be an interesting play thanks to its forward PE of 10.2, its P/S ratio of 0.7, and its decen t dividend yield  of 9%. These factors suggest that Energy Transfer is a pretty good value pick, as investors have to pay a relatively low level for each dollar o f earnings  , and that ET has decent revenue metrics to back up its earnings.   Energy Transfer LP PS Ratio (TTM) ",
    "       Energy Transfer LP ps-ratio-ttm    |   Energy Transfer LP Quote  ",
    " Energy Transfer LP ps-ratio-ttm    |   Energy Transfer LP Quote ",
    "But before you think that Energy Transfer is just a pure value play, it is important to note that it has been seeing solid activity on the earnings estimate front as well. For current year earnings, the consensus has gone up by 3.9% in the past 30 days, thanks to three upward revisions in the past one month compared to one lower.    This estimate strength is actually enough to push ET to a Zacks Rank #2 (Buy), suggesting it is poised to outperform. You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .    So really, Energy Transfer is looking great from a number of angles thanks to its PE below 20, a P/S ratio below one, and a strong Zacks Rank, meaning that this company could be a great choice for value investors at this time.   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:32:00"
}