{
  "url": "https://www.nasdaq.com/article/us-stockswall-st-pushed-down-by-weak-data-trade-worries-20190903-01154",
  "title": "US STOCKS-Wall St pushed down by weak data, trade worries - Nasdaq.com",
  "text": [
    " (For a live blog on the U.S. stock market, click LIVE/ ortype LIVE/ in a news window.)",
    "* U.S. factory activity shrinks for first time since 2016",
    "* Technology stocks weigh most on S&P 500, industrialstumble",
    "* Indexes fall: Dow 1.08%, S&P 500 0.69%, Nasdaq 1.11%  (Updates to close)",
    "By Sinéad Carew",
    "NEW YORK, Sept 3 (Reuters) - U.S. stocks fell on Tuesday asinvestors worried about global growth prospects after datashowed U.S. factory activity shrank in August for the first timesince 2016 and the United States and China imposed new tariffson each other over the weekend.",
    "Investors fled riskier assets as the latest round of tariffsand the lack of a date for a resumption of U.S.-China talksgnawed at any hopes for a resolution to the long-running tradewar, which has rattled markets for months and weighed on worldeconomies. urn:newsml:reuters.com:*:nL2N25U0FT",
    "Compounding the uncertainty, the Institute for SupplyManagement said early in the day that its index of nationalfactory activity dropped to 49.1, compared with a reading of51.1 estimated by analysts polled by Reuters.  urn:newsml:reuters.com:*:nL2N25R073",
    "\"If anything the U.S. manufacturing data signals that thenew tariffs couldn't come at a worse time. It's bad news on topof bad news. That's why investors are so focused onnegotiations\" said Alec Young, managing director of globalmarkets research at FTSE Russell based in New York.     \"Not only have expectations been receding for a U.S.-Chinadeal but they can't even agree on a date to meet,\" said Young. ",
    "He also cited growing uncertainty around Brexit as a concernfor investors. British lawmakers on Tuesday triggered a votethat could allow them to stop Boris Johnson pursuing a \"no-deal\"Brexit, a challenge that the government warned would prompt theprime minister to seek an election on Oct. 14. urn:newsml:reuters.com:*:nL5N25U0GW",
    "Earlier in the day data showed British constructioncompanies last month suffered the sharpest drop in new orderssince the financial crisis amid Brexit jitters. urn:newsml:reuters.com:*:nL5N25U1XE",
    "The Dow Jones Industrial Average .DJI fell 285.26 points,or 1.08%, to 26,118.02, the S&P 500 .SPX lost 20.19 points, or0.69%, to 2,906.27 and the Nasdaq Composite .IXIC dropped88.72 points, or 1.11%, to 7,874.16.",
    "Trade-sensitive industrials .SPLRCI fell 1.4%, making forthe biggest percentage loser among the S&P 11 major sectors.Technology stocks .SPLRCT fell 1.3%, weighed down bychipmakers, which have a large revenue exposure to China. ThePhiladelphia Semiconductor index .SOX dropped 1.8%.",
    "Boeing Co shares BA.N , tumbled 2.7% providing the biggestdrag for the Dow, after the Federal Aviation Administration saidon Friday a global panel of experts will need a few more weeksto finish its review of the company's 737 MAX certification. urn:newsml:reuters.com:*:nL2N25Q1EF",
    "U.S. casino operators felt the brunt of slowing economicgrowth in China as gambling hub Macau posted weak August casinorevenue. Shares of Las Vegas Sands CorpLVS.N , Wynn ResortsLtd WYNN.O and MGM Resorts InternationalMGM.N fell between2% and almost 4%. urn:newsml:reuters.com:*:nL3N25U2WY",
    "The only sectors that gained ground were utilities .SPLRCU , rising 1.8%, real estate .SPLRCR , climbing 1.3% andconsumer staples .SPLRCS , which closed the session up 0.5%. ",
    "Declining issues outnumbered advancing ones on the NYSE by a1.61-to-1 ratio; on Nasdaq, a 2.50-to-1 ratio favored decliners.",
    "The S&P 500 posted 43 new 52-week highs and 10 new lows; theNasdaq Composite recorded 49 new highs and 134 new lows.  ",
    "On U.S. exchanges 6.72 billion shares changed hands comparedwith the 6.99 billion average for the last 20 sessions. (Reporting by Uday Sampath and Shreyashi Sanyal in Bengaluru;Editing by Dan Grebler and Tom Brown) ((sinead.carew@thomsonreuters.com; +1 (646) 223 6186; ReutersMessaging: sinead.carew.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-03 16:20:00"
}