{
  "url": "https://www.nasdaq.com/article/us-judge-says-opioid-litigation-can-proceed-toward-trial-20190903-00974",
  "title": "U.S. judge says opioid litigation can proceed toward trial - Nasdaq.com",
  "text": [
    "By Jonathan Stempel",
    "Sept 3 (Reuters) - A U.S. judge on Tuesday rejected efforts by drugmakers, distributors and pharmacies to dismiss claims that they caused the nation's opioid crisis, clearing the way for a scheduled  landmark trial even as he pushes for a nationwide settlement.",
    "U.S. District Judge Dan Polster, who oversees roughly 2,000 opioid lawsuits by state and local governments, said the plaintiffs could try to prove that drugmakers' deceptive marketing of the painkillers caused a harmful, massive increase in supply that distributors and pharmacies did not do enough to stop.",
    "The ruling was among seven decisions and orders totaling 80 pages issued by Polster ahead of a scheduled Oct. 21 trial by two Ohio counties against Purdue Pharma, the OxyContin maker accused of fueling the epidemic, and several other defendants.",
    "Polster also refused to dismiss civil conspiracy claims against the drugmakers, distributors and pharmacies, and said federal law did not preempt a variety of the plaintiffs' claims.",
    "Opioid addiction claimed roughly 400,000 lives in the United States from 1999 to 2017, according to the U.S. Centers for Disease Control and Prevention. Critics of the industry said opioid makers hid the addiction and abuse risks of prolonged use from consumers.",
    "Defendants in the litigation also include the drugmaker Endo International Plc ; pharmacy operators CVS Health Corp , Rite Aid Corp , Walgreens Boots Alliance Inc  and Walmart Inc ; and major distributors AmerisourceBergen Corp , Cardinal Health Inc  and McKesson Corp , among others.",
    "Polster also rejected separate dismissal requests by the generic drugmakers Teva Pharmaceutical Industries Ltd  and Allergan Plc .",
    "Lawyers for the respective defendants did not immediately respond to requests for comment or declined to comment.",
    "Paul Hanly, a lawyer for the counties, said the plaintiffs were pleased that Polster \"almost uniformly\" agreed with their positions on the dismissal motions and whether various testimony should be admitted.",
    "Purdue Pharma and its owners, the Sackler family, have been in talks on a possible $10 billion to $12 billion nationwide settlement of opioid claims, two people familiar with the matter said last week. ",
    "That accord could include a bankruptcy filing for the Stamford, Connecticut-based company. Purdue and the Sacklers have denied the allegations.",
    "The case is In re National Prescription Opiate Litigation, U.S. District Court, Northern District of Ohio, No. 17-md-02804."
  ],
  "published_datetime": "2019-09-03 13:40:00"
}