{
  "url": "https://www.nasdaq.com/article/norwegian-bank-invests-in-crypto-exchange-founded-by-airline-magnate-cm1206584",
  "title": "Norwegian Bank Invests in Crypto Exchange Founded By Airline Magnate - Nasdaq.com",
  "text": [
    "A Norwegian savings bank dating back to the mid-1800s has just   invested in a cryptocurrency exchange set up by local business   magnate Bjørn Kjos.",
    "In a   press   release    posted on the Oslo Stock Exchange, Sparebanken Øst said it   had taken a 16.3 percent stake in Norwegian Block   Exchange (NBX) for 15 million Norwegian krone (around $1.638   million).",
    "NBX was   revealed     to be in development in April of last year, after being   founded by Kjos and his family. Bjorn's son Lars Ola Kjos -   apparently a   fan of   bitcoin    - is leading the exchange's operations. The platform   launched    for limited user testing in mid-August.",
    " Related: VanEck, SolidX to Offer Bitcoin ETF-Like     Product to Institutions ",
    "With Bjorn the founder and former CEO of Norwegian Air   Shuttle, the top Scandinavian airline is   expected    to tie up with NBX to offer cryptocurrency payments for flight   tickets.",
    "In its investment announcement, Sparebanken Øst said:",
    "\"Possible collaboration with the airline Norwegian Air     Shuttle, a key player with NBX, could be a platform for     launching new solutions on a mass scale, and the bank sees     great market potential both nationally and     internationally.\"",
    "The bank added that, in backing in NBX, the exchange \"will   offer solutions that will equip the bank to manage competition   and future-oriented solutions for its customers.\"",
    " Related: Binance Launches Two Crypto Futures Platforms     for User Testing ",
    "  Bjorn     Kjos      image via Norwegian Air/Kristoffer Sandven ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:30:17"
}