{
  "url": "https://www.nasdaq.com/article/what-makes-cirrus-logic-crus-a-strong-momentum-stock-buy-now-cm1210407",
  "title": "What Makes Cirrus Logic (CRUS) a Strong Momentum Stock: Buy Now? - Nasdaq.com",
  "text": [
    " Momentum investing revolves around the idea of following a stock's recent trend in either direction. In the 'long' context, investors will be essentially be \"buying high, but hoping to sell even higher.\" With this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving that way. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades. While many investors like to look for momentum in stocks, this can be very tough to define. There is a lot of debate surrounding which metrics are the best to focus on and which are poor quality indicators of future performance. The Zacks Momentum Style Score, part of the Zacks Style Scores  , helps address this issue for us. Below, we take a look at Cirrus Logic (CRUS)  , a company that currently holds a Momentum Style Score of A. We also talk about price change and earnings estimate revisions, two of the main aspects of the Momentum Style Score. It's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Cirrus Logic currently has a Zacks Rank of #1 (Strong Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of A or B outperform the market over the following one-month period. You can see the current list of Zacks #1 Rank Stocks here >>>   Set to Beat the Market?  Let's discuss some of the components of the Momentum Style Score for CRUS that show why this chipmaker shows promise as a solid momentum pick. Looking at a stock's short-term price activity is a great way to gauge if it has momentum, since this can reflect both the current interest in a stock and if buyers or sellers have the upper hand at the moment. It's also helpful to compare a security to its industry; this can show investors the best companies in a particular area. For CRUS, shares are up 2.13% over the past week while the Zacks Electronics - Semiconductors industry is up 2.22% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 2.65% compares favorably with the industry's 3.76% performance as well. While any stock can see a spike in price, it takes a real winner to consistently outperform the market. Shares of Cirrus Logic have increased 33.11% over the past quarter, and have gained 33.56% in the last year. On the other hand, the S&P 500 has only moved 3.69% and 5.5%, respectively. Investors should also pay attention to CRUS's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. CRUS is currently averaging 565,518 shares for the last 20 days.  Earnings Outlook  The Zacks Momentum Style Score also takes into account trends in estimate revisions, in addition to price changes. Please note that estimate revision trends remain at the core of Zacks Rank as well. A nice path here can help show promise, and we have recently been seeing that with CRUS. Over the past two months, 6 earnings estimates moved higher compared to none lower for the full year. These revisions helped boost CRUS's consensus estimate, increasing from $2.24 to $2.79 in the past 60 days. Looking at the next fiscal year, 4 estimates have moved upwards while there have been no downward revisions in the same time period.  Bottom Line  Given these factors, it shouldn't be surprising that CRUS is a #1 (Strong Buy) stock and boasts a Momentum Score of A. If you're looking for a fresh pick that's set to soar in the near-term, make sure to keep Cirrus Logic on your short list.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Cirrus Logic, Inc. (CRUS): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Momentum investing revolves around the idea of following a stock's recent trend in either direction. In the 'long' context, investors will be essentially be \"buying high, but hoping to sell even higher.\" With this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving that way. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades.",
    "While many investors like to look for momentum in stocks, this can be very tough to define. There is a lot of debate surrounding which metrics are the best to focus on and which are poor quality indicators of future performance. The Zacks Momentum Style Score, part of the Zacks Style Scores  , helps address this issue for us.",
    "Below, we take a look at Cirrus Logic (CRUS)  , a company that currently holds a Momentum Style Score of A. We also talk about price change and earnings estimate revisions, two of the main aspects of the Momentum Style Score.",
    "It's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Cirrus Logic currently has a Zacks Rank of #1 (Strong Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of A or B outperform the market over the following one-month period.",
    "You can see the current list of Zacks #1 Rank Stocks here >>> ",
    " Set to Beat the Market? ",
    "Let's discuss some of the components of the Momentum Style Score for CRUS that show why this chipmaker shows promise as a solid momentum pick.",
    "Looking at a stock's short-term price activity is a great way to gauge if it has momentum, since this can reflect both the current interest in a stock and if buyers or sellers have the upper hand at the moment. It's also helpful to compare a security to its industry; this can show investors the best companies in a particular area.",
    "For CRUS, shares are up 2.13% over the past week while the Zacks Electronics - Semiconductors industry is up 2.22% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 2.65% compares favorably with the industry's 3.76% performance as well.",
    "While any stock can see a spike in price, it takes a real winner to consistently outperform the market. Shares of Cirrus Logic have increased 33.11% over the past quarter, and have gained 33.56% in the last year. On the other hand, the S&P 500 has only moved 3.69% and 5.5%, respectively.",
    "Investors should also pay attention to CRUS's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. CRUS is currently averaging 565,518 shares for the last 20 days.",
    " Earnings Outlook ",
    "The Zacks Momentum Style Score also takes into account trends in estimate revisions, in addition to price changes. Please note that estimate revision trends remain at the core of Zacks Rank as well. A nice path here can help show promise, and we have recently been seeing that with CRUS.",
    "Over the past two months, 6 earnings estimates moved higher compared to none lower for the full year. These revisions helped boost CRUS's consensus estimate, increasing from $2.24 to $2.79 in the past 60 days. Looking at the next fiscal year, 4 estimates have moved upwards while there have been no downward revisions in the same time period.",
    " Bottom Line ",
    "Given these factors, it shouldn't be surprising that CRUS is a #1 (Strong Buy) stock and boasts a Momentum Score of A. If you're looking for a fresh pick that's set to soar in the near-term, make sure to keep Cirrus Logic on your short list.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:00:07"
}