{
  "url": "https://www.nasdaq.com/article/heres-why-mallinckrodt-is-collapsing-today-cm1208155",
  "title": "Here's Why Mallinckrodt Is Collapsing Today - Nasdaq.com",
  "text": [
    " What happened Shares of   Mallinckrodt    (NYSE: MNK) dropped as much as 45% today after Bloomberg reported   that the company is considering restructuring, and possibly   bankruptcy, as a strategy to limit its legal and financial   exposure related to the opioid crisis. The company is facing   lawsuits claiming it and other opioid manufacturers downplayed   the addictive nature of such drugs and didn't do enough to stop   suspicious orders, thereby playing a central role in the   complicated origins of the ongoing crisis. While some analysts estimate the legal settlements and fines   could reach into the billions of dollars, settlements to date   have been much lower. That said, Mallinckrodt's balance sheet   suggests even smaller fines and penalties could prove to be an   existential threat. As of 11:47 a.m. EDT, the stock had settled to a 39.4%   loss.makeArticleAd();   Image source: Getty Images.  So what Mallinckrodt ended the first half of 2019 with $10.2 billion   in assets, but $7.7 billion, or 75% of that total, was in the   form of intangible assets. It's generally a red flag when a   business counts 20% of its assets as goodwill and intangibles.   That means there's not much to be sold off in the event the   company has to pay a large fine or settlement. The company also exited June with just $241 million in cash   and $4.8 billion in long-term debt. If Mallinckrodt receives a   fine of hundreds of millions of dollars related to the opioid   crisis, it won't be able to use cash on hand and might struggle   to find creditors willing to extend more debt. Now what Generic drug companies have been some of the worst-performing   pharma stocks    in recent years due to a combination of headwinds ranging from   increased competition to, in several cases, the legal   uncertainties related to the opioid crisis. That has compounded   Mallinckrodt's headache and is now forcing it to consider   bankruptcy, which, given the state of its balance sheet, might be   the only option.   10 stocks we like better than Mallinckrodt       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Mallinckrodt wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Maxx Chatsko      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   Mallinckrodt    (NYSE: MNK) dropped as much as 45% today after Bloomberg reported   that the company is considering restructuring, and possibly   bankruptcy, as a strategy to limit its legal and financial   exposure related to the opioid crisis. The company is facing   lawsuits claiming it and other opioid manufacturers downplayed   the addictive nature of such drugs and didn't do enough to stop   suspicious orders, thereby playing a central role in the   complicated origins of the ongoing crisis.",
    "While some analysts estimate the legal settlements and fines   could reach into the billions of dollars, settlements to date   have been much lower. That said, Mallinckrodt's balance sheet   suggests even smaller fines and penalties could prove to be an   existential threat.",
    "As of 11:47 a.m. EDT, the stock had settled to a 39.4%   loss.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Mallinckrodt ended the first half of 2019 with $10.2 billion   in assets, but $7.7 billion, or 75% of that total, was in the   form of intangible assets. It's generally a red flag when a   business counts 20% of its assets as goodwill and intangibles.   That means there's not much to be sold off in the event the   company has to pay a large fine or settlement.",
    "The company also exited June with just $241 million in cash   and $4.8 billion in long-term debt. If Mallinckrodt receives a   fine of hundreds of millions of dollars related to the opioid   crisis, it won't be able to use cash on hand and might struggle   to find creditors willing to extend more debt.",
    "Generic drug companies have been some of the worst-performing   pharma stocks    in recent years due to a combination of headwinds ranging from   increased competition to, in several cases, the legal   uncertainties related to the opioid crisis. That has compounded   Mallinckrodt's headache and is now forcing it to consider   bankruptcy, which, given the state of its balance sheet, might be   the only option.",
    "  10 stocks we like better than Mallinckrodt       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Mallinckrodt wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Mallinckrodt       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Mallinckrodt wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Maxx Chatsko      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 12:07:00"
}