{
  "url": "https://www.nasdaq.com/article/top-ranked-stocks-suitable-for-millennials-6-picks-cm1207986",
  "title": "Top-Ranked Stocks Suitable for Millennials: 6 Picks - Nasdaq.com",
  "text": [
    " Millennials, also known as Gen Y, are the demographic cohort falling between the effervescent Gen X and the digitalized Gen Z. Millennials are rapidly outpacing the baby boomers and makes up around 25% of the U.S. population. Currently there are 79.4 million millennials, compared with 75.5 million baby boomers. As per CNBC, immigration could lead millennial population to jump to 81 million by 2036. Per the new guidelines of Pew Research Center, millennials are classified those whose birth years range between 1981 and 1996. Per this classification, the oldest millennial is 37 years while the youngest is 22, which makes this generation highly susceptible to economic downturn. A look at the investment pattern of the millennial generation reveals that this group has a more conservative stance. With age on their side, they have a long-time horizon for investment. This allows them to take risks and focus more on capital appreciation rather than dividend income. Thanks to growing market volatility and uncertainty related to investment returns, millennials prefer to play it safe.  Financial Goals  Notably, millennials remain confident about their spending decisions. A survey conducted by   Charles Schwab  reveals that 81% of millennial responders were optimistic about their spending. As per CNBC,millennials save more than 36% of their annual salaries compared with preceding generations.Further, millennials are closing the gap between personal and societal well-being. Per Morgan Stanley report, approximately 84% of millennials have started investing with the major focus being on ESG (Environmental, Social and Governance). For years, millennials were plagued by higher student loan debt, sluggish wages and poor job prospects as the result of the \"Great Recession.\" However, currently, millennials are the most educated generation among other cohorts. As per CNBC report, around 39% of the millennial population holds at least a bachelor's degree. Consequently, better education makes millennials aware of the socio-economic scenario of the country, which in turn is beneficial for both individual and the economy. Moreover, it helps the generation to improve the quality of life by insuring their own financial security.  Growth in Millennial Population  A survey report from   TD Ameritrade  shows that 43% of respondents considering socially responsible investments are by millennials compared with 33%, 25% and 18% by Generation X, Baby Boomers and mature investors, respectively. This is due to the fact that many millennials put more of an emphasis on environmental benefits and human rights. As this section of the population has chances of making up 75% of the workforce by 2025, businesses that are likely to benefit from their habits could offer solid returns. Per research by Global X, millennials now earn about $2 trillion, with a projected $8 trillion by 2025. Millennials' spending is likewise expected to rise to $1.4 trillion annually and account for 30% of total retail sales by 2020, according to Accenture. Gone are those days when millennials were considered dependent on parents and unlikely to have surplus cash to invest in the stock market. This demography is significant part of the U.S. population and their stock purchase behavior has considerable impact on the market.  6 Top Picks  However, it is difficult to pick the right stocks for millennials from a wide range of available investment opportunities. This is where our Style Score System and  Zacks Stock Screener   comes into play. Our  Growth Style Score   condenses all the essential metrics from the company's financial statements to achieve a true sense of quality and sustainability of its growth. Our research shows that stocks with Growth Style Scores of A or B when combined with a Zacks Rank #1 (Strong Buy) or 2 (Buy) offer the best investment opportunities in the growth investing space. You can see   the complete list of today's Zacks #1 Rank stocks   here   .  Our Picks   Keysight Technologies KEYS  sports a Zacks Rank #1 and a Growth Score of A. The stock has returned 54.4% on a year-to-date basis. Further, the company has a long-term expected EPS growth rate of 10%. The estimates for both 2019 and 2020 for the company have improved 6.4% and 5.3%, respectively, over the last 60 days.   Keysight Technologies Inc. Price and Consensus        Keysight Technologies Inc.   price-consensus-chart    |   Keysight Technologies Inc. Quote    Anixter International AXE  flaunts a Zacks Rank #1 and a Growth Score of B. The stock has returned 10.7% on a year-to-date basis. Further, the company has a long-term expected EPS growth rate of 8%. The estimates for both 2019 and 2020 for the company have improved 12.3% and 9.7%, respectively, over the last 60 days.   Anixter International Inc. Price and Consensus        Anixter International Inc.   price-consensus-chart    |   Anixter International Inc. Quote    Cirrus Logic  CRUS  has a Zacks Rank #1 and a Growth Score of B. The stock has returned 60.4% on a year-to-date basis. Further, the company has a long-term expected EPS growth rate of 15%. The estimates for both 2020 and 2021 for the company have improved 25.6% and 15.5%, respectively, over the last 60 days.   Cirrus Logic, Inc. Price and Consensus        Cirrus Logic, Inc. price-consensus-chart    |   Cirrus Logic, Inc. Quote    Symantec Corporation  SYMC  has a Zacks Rank #2 and a Growth Score of A. The stock has surged 23.4% on a year-to-date basis. Further, the company has a long-term expected EPS growth rate of 6.9%. The estimates for both 2020 and 2021 for the company have improved 4.2% and 2.8%, respectively, over the last 60 days.   Symantec Corporation Price and Consensus        Symantec Corporation price-consensus-chart    |   Symantec Corporation Quote    Microsoft MSFT  has a Zacks Rank #2 and a Growth Score of A. The stock has appreciated 35.3% on a year-to-date basis. Further, the company has a long-term expected EPS growth rate of 11%. The estimates for both 2020 and 2021 for the company have improved 2.4% and 2.3%, respectively, over the last 60 days.   Microsoft Corporation Price and Consensus        Microsoft Corporation price-consensus-chart    |   Microsoft Corporation Quote    Alphabet GOOGL  has a Zacks Rank #2 and Growth Score of B. The stock has returned 13.1% on a year-to-date basis. Further, the company has a long-term expected EPS growth rate of 17.5%. The estimates for both 2019 and 2020 for the company have improved 8% and 2.8%, respectively, over the last 60 days.   Alphabet Inc. Price and Consensus        Alphabet Inc. price-consensus-chart    |   Alphabet Inc. Quote    It's Illegal in 42 States, But Investors Will Make   Billions Legally  In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year. That's twice as much as they spend on marijuana, legally or otherwise. Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.   See these 5 \"sin stocks\" now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Alphabet Inc. (GOOGL): Free Stock Analysis Report   Symantec Corporation (SYMC): Free Stock Analysis Report   Microsoft Corporation (MSFT): Free Stock Analysis Report   Cirrus Logic, Inc. (CRUS): Free Stock Analysis Report   Keysight Technologies Inc. (KEYS): Free Stock Analysis Report   Anixter International Inc. (AXE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Millennials, also known as Gen Y, are the demographic cohort falling between the effervescent Gen X and the digitalized Gen Z. Millennials are rapidly outpacing the baby boomers and makes up around 25% of the U.S. population.",
    "Currently there are 79.4 million millennials, compared with 75.5 million baby boomers. As per CNBC, immigration could lead millennial population to jump to 81 million by 2036.",
    "Per the new guidelines of Pew Research Center, millennials are classified those whose birth years range between 1981 and 1996. Per this classification, the oldest millennial is 37 years while the youngest is 22, which makes this generation highly susceptible to economic downturn.",
    "A look at the investment pattern of the millennial generation reveals that this group has a more conservative stance. With age on their side, they have a long-time horizon for investment. This allows them to take risks and focus more on capital appreciation rather than dividend income. Thanks to growing market volatility and uncertainty related to investment returns, millennials prefer to play it safe.",
    " Financial Goals ",
    "Notably, millennials remain confident about their spending decisions. A survey conducted by   Charles Schwab  reveals that 81% of millennial responders were optimistic about their spending.",
    "As per CNBC,millennials save more than 36% of their annual salaries compared with preceding generations.Further, millennials are closing the gap between personal and societal well-being. Per Morgan Stanley report, approximately 84% of millennials have started investing with the major focus being on ESG (Environmental, Social and Governance).",
    "For years, millennials were plagued by higher student loan debt, sluggish wages and poor job prospects as the result of the \"Great Recession.\" However, currently, millennials are the most educated generation among other cohorts. As per CNBC report, around 39% of the millennial population holds at least a bachelor's degree.",
    "Consequently, better education makes millennials aware of the socio-economic scenario of the country, which in turn is beneficial for both individual and the economy. Moreover, it helps the generation to improve the quality of life by insuring their own financial security.",
    " Growth in Millennial Population ",
    "A survey report from   TD Ameritrade  shows that 43% of respondents considering socially responsible investments are by millennials compared with 33%, 25% and 18% by Generation X, Baby Boomers and mature investors, respectively. This is due to the fact that many millennials put more of an emphasis on environmental benefits and human rights.",
    "As this section of the population has chances of making up 75% of the workforce by 2025, businesses that are likely to benefit from their habits could offer solid returns. Per research by Global X, millennials now earn about $2 trillion, with a projected $8 trillion by 2025. Millennials' spending is likewise expected to rise to $1.4 trillion annually and account for 30% of total retail sales by 2020, according to Accenture.",
    "Gone are those days when millennials were considered dependent on parents and unlikely to have surplus cash to invest in the stock market. This demography is significant part of the U.S. population and their stock purchase behavior has considerable impact on the market.",
    " 6 Top Picks ",
    "However, it is difficult to pick the right stocks for millennials from a wide range of available investment opportunities. This is where our Style Score System and  Zacks Stock Screener   comes into play.",
    "Our  Growth Style Score   condenses all the essential metrics from the company's financial statements to achieve a true sense of quality and sustainability of its growth. Our research shows that stocks with Growth Style Scores of A or B when combined with a Zacks Rank #1 (Strong Buy) or 2 (Buy) offer the best investment opportunities in the growth investing space. You can see   the complete list of today's Zacks #1 Rank stocks   here   .",
    " Our Picks ",
    " Keysight Technologies KEYS  sports a Zacks Rank #1 and a Growth Score of A. The stock has returned 54.4% on a year-to-date basis. Further, the company has a long-term expected EPS growth rate of 10%.",
    "The estimates for both 2019 and 2020 for the company have improved 6.4% and 5.3%, respectively, over the last 60 days.",
    "  Keysight Technologies Inc. Price and Consensus        Keysight Technologies Inc.   price-consensus-chart    |   Keysight Technologies Inc. Quote  ",
    " Keysight Technologies Inc. Price and Consensus ",
    " Keysight Technologies Inc.   price-consensus-chart    |   Keysight Technologies Inc. Quote ",
    " Anixter International AXE  flaunts a Zacks Rank #1 and a Growth Score of B. The stock has returned 10.7% on a year-to-date basis. Further, the company has a long-term expected EPS growth rate of 8%.",
    "The estimates for both 2019 and 2020 for the company have improved 12.3% and 9.7%, respectively, over the last 60 days.",
    "  Anixter International Inc. Price and Consensus        Anixter International Inc.   price-consensus-chart    |   Anixter International Inc. Quote  ",
    " Anixter International Inc. Price and Consensus ",
    " Anixter International Inc.   price-consensus-chart    |   Anixter International Inc. Quote ",
    " Cirrus Logic  CRUS  has a Zacks Rank #1 and a Growth Score of B. The stock has returned 60.4% on a year-to-date basis. Further, the company has a long-term expected EPS growth rate of 15%.",
    "The estimates for both 2020 and 2021 for the company have improved 25.6% and 15.5%, respectively, over the last 60 days.",
    "  Cirrus Logic, Inc. Price and Consensus        Cirrus Logic, Inc. price-consensus-chart    |   Cirrus Logic, Inc. Quote  ",
    " Cirrus Logic, Inc. Price and Consensus ",
    " Cirrus Logic, Inc. price-consensus-chart    |   Cirrus Logic, Inc. Quote ",
    " Symantec Corporation  SYMC  has a Zacks Rank #2 and a Growth Score of A. The stock has surged 23.4% on a year-to-date basis. Further, the company has a long-term expected EPS growth rate of 6.9%.",
    "The estimates for both 2020 and 2021 for the company have improved 4.2% and 2.8%, respectively, over the last 60 days.",
    "  Symantec Corporation Price and Consensus        Symantec Corporation price-consensus-chart    |   Symantec Corporation Quote  ",
    " Symantec Corporation Price and Consensus ",
    " Symantec Corporation price-consensus-chart    |   Symantec Corporation Quote ",
    " Microsoft MSFT  has a Zacks Rank #2 and a Growth Score of A. The stock has appreciated 35.3% on a year-to-date basis. Further, the company has a long-term expected EPS growth rate of 11%.",
    "The estimates for both 2020 and 2021 for the company have improved 2.4% and 2.3%, respectively, over the last 60 days.",
    "  Microsoft Corporation Price and Consensus        Microsoft Corporation price-consensus-chart    |   Microsoft Corporation Quote  ",
    " Microsoft Corporation Price and Consensus ",
    " Microsoft Corporation price-consensus-chart    |   Microsoft Corporation Quote ",
    " Alphabet GOOGL  has a Zacks Rank #2 and Growth Score of B. The stock has returned 13.1% on a year-to-date basis. Further, the company has a long-term expected EPS growth rate of 17.5%.",
    "The estimates for both 2019 and 2020 for the company have improved 8% and 2.8%, respectively, over the last 60 days.",
    "  Alphabet Inc. Price and Consensus        Alphabet Inc. price-consensus-chart    |   Alphabet Inc. Quote  ",
    " Alphabet Inc. Price and Consensus ",
    " Alphabet Inc. price-consensus-chart    |   Alphabet Inc. Quote ",
    " It's Illegal in 42 States, But Investors Will Make   Billions Legally ",
    "In addition to the companies you read about above, today you get details on the newly-legalized",
    "industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    "That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "  See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:54:00"
}