{
  "url": "https://www.nasdaq.com/article/dow-jones-today-risk-ebbs-at-least-for-a-day-cm1207649",
  "title": "Dow Jones Today: Risk Ebbs — At Least For a Day - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Headline risk has been confounding global equity markets over the past several months, but there was some relief on that front Wednesday. Stocks rallied, buoyed by some geopolitical relief.",
    "In Hong Kong, leader Carrie Lam withdrew the controversial extradition plan that served as the tipping point of pro-democracy protests that spanned several months. Ebbing of tensions in Hong Kong could clear the way for Beijing to proceed with meaningful efforts to negotiate a trade truce with the U.S., which would really light a fire under a nascent rally.",
    "The encouraging news from overseas comes ahead of comments from Federal Reserve Chairman Jerome Powell later this week and the August jobs report due out Friday. Overall, today was a good start toward healing the wounds incurred by stocks yesterday and last month .",
    "The Nasdaq Composite added 1.3% while the S&P 500 jumped 1.08%. The Dow Jones Industrial Average climbed 0.91%. In late trading, 24 of the 30 members of the Dow were trading higher.",
    "There has been plenty of talk about semiconductor stocks lately, due in large part to the group being one of the \"ground zeros\" for the U.S./China trade war. On that note, Intel (NASDAQ: INTC ) was the Dow's best-performing name today, adding 4.1%. Even with the trade war far from being resolved, there may be reasons for investors to revisit semiconductor stocks as some analysts see upside for the group over the rest of 2019.",
    "\"We remain confident in a [second-half] pickup in overall demand with near seasonal demand in PC computing, wireless/wired infrastructure (around 5G), aerospace/defense, smartphones (ex- Huawei ), consumer/gaming, and a resumption in cloud/hyperscale spending trends,\" said JPMorgan analyst Harlan Sur in a note out earlier today .",
    "Tech bellwether Apple (NASDAQ: AAPL ) got in on the act, gaining 1.7%. The company announced a $7 billion corporate bond offering today, its first since 2017. Investors need not worry about debt issues because Apple carries more than $200 billion in cash on its balance sheet and less than half that figure in liabilities .",
    "Some positive analyst commentary also boosted shares of Apple today, with Evercore ISI's Amit Daryanani talking about the iPhone maker's compelling opportunity set in India.",
    "\"Apple has spent years lobbying for both changes and the ongoing effort by the Indian government to attract foreign companies should help Apple expand its customer base in the fast growing country,\" said the analyst .",
    "It has been a while since I've been able to say \"excellence\" in the same sentence as Exxon Mobil (NYSE: XOM ). Not-so-fun fact: the largest U.S. oil company recently dropped out of the top 10 names in the cap-weighted S&P 500 for the first time.",
    "In better news, the stock gained more than 1% today after Bank of America Merrill Lynch analyst Doug Leggate said Wall Street isn't fully appreciating Exxon's cash flow generating capabilities. He has $100 price target on the shares, implying upside of 45% from current levels.",
    "Boeing (NYSE: BA ) - the largest member of the Dow and one that is off 20% from its 52-week high, putting in a bear market - posted a modest gain today. Some traders argue that the worst of the bad news (and there has been plenty) is priced into Boeing stock and upside is the path of least resistance from here.",
    "Today was certainly better than yesterday and not to sound like a broken record, but riskier assets need some resolution on trade if there is going to be any type of substantial rally in the last four months of the year.",
    "\"The U.S.-China trade standoff has materially escalated amid tit-for-tat actions, just as summer ends in many parts of the globe and back-to-school season begins,\" said BlackRock in a recent note . \"The latest twists and turns include newly announced U.S. and Chinese tariffs, and increasingly unpredictable U.S. policy actions, particularly around trade, that threaten the longstanding institutional underpinnings of the global economy.\"",
    "As of this writing, Todd Shriber does not own any of the aforementioned securities.",
    "The post Dow Jones Today: Risk Ebbs - At Least For a Day appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 04:19:21"
}