{
  "url": "https://www.nasdaq.com/article/noteworthy-wednesday-option-activity-ttd-aeo-wbt-cm1207504",
  "title": "Noteworthy Wednesday Option Activity: TTD, AEO, WBT - Nasdaq.com",
  "text": [
    "Looking at  options trading  activity among components of the Russell 3000 index, there is noteworthy activity today in The Trade Desk Inc (Symbol: TTD), where a total volume of 9,640 contracts has been traded thus far today, a contract volume which is representative of approximately 964,000 underlying shares (given that every 1 contract represents 100 underlying shares). That number works out to 61.7% of TTD's average daily trading volume over the past month, of 1.6 million shares. Especially high volume was seen for the $250 strike call option expiring September 06, 2019  , with 774 contracts trading so far today, representing approximately 77,400 underlying shares of TTD. Below is a chart showing TTD's trailing twelve month trading history, with the $250 strike highlighted in orange:       makeArticleAd();    American Eagle Outfitters, Inc. (Symbol: AEO) options are showing a volume of 25,030 contracts thus far today. That number of contracts represents approximately 2.5 million underlying shares, working out to a sizeable 61.1% of AEO's average daily trading volume over the past month, of 4.1 million shares. Particularly high volume was seen for the $14.50 strike put option expiring September 06, 2019  , with 1,781 contracts trading so far today, representing approximately 178,100 underlying shares of AEO. Below is a chart showing AEO's trailing twelve month trading history, with the $14.50 strike highlighted in orange:       And Welbilt Inc (Symbol: WBT) options are showing a volume of 7,261 contracts thus far today. That number of contracts represents approximately 726,100 underlying shares, working out to a sizeable 60.8% of WBT's average daily trading volume over the past month, of 1.2 million shares. Particularly high volume was seen for the $20 strike call option expiring December 20, 2019  , with 4,750 contracts trading so far today, representing approximately 475,000 underlying shares of WBT. Below is a chart showing WBT's trailing twelve month trading history, with the $20 strike highlighted in orange:         For the various different available expirations for TTD options  , AEO options  , or WBT options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 03:25:47"
}