{
  "url": "https://www.nasdaq.com/article/why-abbvie-abbv-is-a-top-dividend-stock-for-your-portfolio-cm1210472",
  "title": "Why AbbVie (ABBV) is a Top Dividend Stock for Your Portfolio - Nasdaq.com",
  "text": [
    " All investors love getting big returns from their portfolio, whether it's through stocks, bonds, ETFs, or other types of securities. But when you're an income investor, your primary focus is generating consistent cash flow from each of your liquid investments. While cash flow can come from bond interest or interest from other types of investments, income investors hone in on dividends. A dividend is the distribution of a company's earnings paid out to shareholders; it's often viewed by its dividend yield, a metric that measures a dividend as a percent of the current stock price. Many academic studies show tha t dividends  make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.  AbbVie in Focus  Based in North Chicago, AbbVie (ABBV) is in the Medical sector, and so far this year, shares have seen a price change of -26.04%. Currently paying a dividend of $1.07 per share, the company has a dividend yield of 6.28%. In comparison, the Large Cap Pharmaceuticals industry's yield is 2.77%, while the S&P 500's yield is 1.9%. Looking at dividend growth, the company's current annualized dividend of $4.28 is up 19.2% from last year. In the past five-year period, AbbVie has increased its dividend 5 times on a year-over-year basis for an average annual increase of 21.14%. Looking ahead, future dividend growth will be dependent on earnings growth and payout ratio, which is the proportion of a company's annual earnings per share that it pays out as a dividend. AbbVie's current payout ratio is 51%, meaning it paid out 51% of its trailing 12-month EPS as dividend. ABBV is expecting earnings to expand this fiscal year as well. The Zacks Consensus Estimate for 2019 is $8.90 per share, which represents a year-over-year growth rate of 12.52%.  Bottom Line  Investors like dividends for a variety of different reasons, from tax advantages and decreasing overall portfolio risk to considerably improving stock investing profits. But, not every company offers a quarterly payout. For instance, it's a rare occurrence when a tech start-up or big growth business offers their shareholders a dividend. It's more common to see larger companies with more established profits give out dividends. During periods of rising interest rates, income investors must be mindful that high-yielding stocks tend to struggle. With that in mind, ABBV is a compelling investment opportunity. Not only is it a strong dividend play, but the stock currently sits at a Zacks Rank of 3 (Hold).   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  AbbVie Inc. (ABBV): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "All investors love getting big returns from their portfolio, whether it's through stocks, bonds, ETFs, or other types of securities. But when you're an income investor, your primary focus is generating consistent cash flow from each of your liquid investments.",
    "While cash flow can come from bond interest or interest from other types of investments, income investors hone in on dividends. A dividend is the distribution of a company's earnings paid out to shareholders; it's often viewed by its dividend yield, a metric that measures a dividend as a percent of the current stock price. Many academic studies show tha t dividends  make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.",
    " AbbVie in Focus ",
    "Based in North Chicago, AbbVie (ABBV) is in the Medical sector, and so far this year, shares have seen a price change of -26.04%. Currently paying a dividend of $1.07 per share, the company has a dividend yield of 6.28%. In comparison, the Large Cap Pharmaceuticals industry's yield is 2.77%, while the S&P 500's yield is 1.9%.",
    "Looking at dividend growth, the company's current annualized dividend of $4.28 is up 19.2% from last year. In the past five-year period, AbbVie has increased its dividend 5 times on a year-over-year basis for an average annual increase of 21.14%. Looking ahead, future dividend growth will be dependent on earnings growth and payout ratio, which is the proportion of a company's annual earnings per share that it pays out as a dividend. AbbVie's current payout ratio is 51%, meaning it paid out 51% of its trailing 12-month EPS as dividend.",
    "ABBV is expecting earnings to expand this fiscal year as well. The Zacks Consensus Estimate for 2019 is $8.90 per share, which represents a year-over-year growth rate of 12.52%.",
    " Bottom Line ",
    "Investors like dividends for a variety of different reasons, from tax advantages and decreasing overall portfolio risk to considerably improving stock investing profits. But, not every company offers a quarterly payout.",
    "For instance, it's a rare occurrence when a tech start-up or big growth business offers their shareholders a dividend. It's more common to see larger companies with more established profits give out dividends. During periods of rising interest rates, income investors must be mindful that high-yielding stocks tend to struggle. With that in mind, ABBV is a compelling investment opportunity. Not only is it a strong dividend play, but the stock currently sits at a Zacks Rank of 3 (Hold).",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:15:11"
}