{
  "url": "https://www.nasdaq.com/article/celanese-ce-shares-up-38-ytd-whats-going-in-its-favor-cm1210854",
  "title": "Celanese (CE) Shares Up 38% YTD: What's Going in its Favor? - Nasdaq.com",
  "text": [
    "Shares of Celanese CorporationCE have shot up around 38.2% so far this year. The leading chemical and specialty materials maker has also handily outperformed its industry 's rise of roughly 10.8% over the same time frame. Moreover, it has outpaced the S&P 500's rise of around 19.7% year to date.\r\n Celanese, a Zacks Rank #3 (Hold) stock, has a market cap of roughly $15.4 billion and average volume of shares traded in the last three months was around 925.1K. The company has an expected long-term earnings per share growth rate of 10%.",
    "Let's delve deeper into the factors behind the stock's price appreciation.What's Behind the Rally?\r\n Better-than-expected earnings performance in the first two quarters of 2019 and compelling business prospects have contributed to the run-up in Celanese's shares. Celanese is gaining from its inorganic growth actions, productivity measures and growth investments in organic projects amid a challenging environment. The company remains focused on strengthening its businesses by executing its productivity programs and strategically investing in high-return projects.\r\n Celanese's strategic measures including cost savings through productivity initiatives, price increase actions and efficiency enhancement are expected to support its earnings in 2019. The company is committed to execute its productivity programs that include implementation of a number of cost reduction capital projects.\r\n Celanese also continues to actively pursue acquisitions, which are providing it opportunities for additional growth, investment and synergies. The acquisitions of SO.F.TER., Nilit and Omni Plastics are expected to significantly contribute to earnings expansion in the company's Engineered Materials (EM) segment.\r\n The EM unit is also poised to benefit from new business wins and significant project commercialization. The company commercialized 1,177 projects during the second quarter. It is on track to commercialize more than 4,000 projects in 2019.    \r\n The company is also implementing several process improvement projects across a global network of acetyls manufacturing plants. All these positions its Acetyl Chain unit for solid growth.\r\n Celanese is also committed toward rewarding its shareholders with dividends and share buybacks, leveraging solid free cash flow generation. The company generated operating cash flow of $424 million and free cash flow of $356 million during the second quarter. It returned $378 million to its shareholders through dividends and share repurchases during the quarter.",
    "Celanese Corporation Price and Consensus",
    "Celanese Corporation price-consensus-chart | Celanese Corporation Quote",
    "Stocks Worth a Look\r\n Stocks worth considering in the basic materials space include Kinross Gold Corporation KGC , NewMarket Corporation NEU and Alamos Gold Inc. AGI , each sporting a Zacks Rank #1 (Strong Buy). You can see the complete list of today's Zacks #1 Rank stocks here .\r\n Kinross has projected earnings growth rate of 160% for the current year. The company's shares have surged around 68% in a year's time.\r\n NewMarket has an expected earnings growth rate of 16.2% for the current year. Its shares have gained around 15% in the past year.\r\n Alamos Gold has estimated earnings growth rate of 320% for the current year. The company's shares have rallied roughly 44% in a year's time.Breakout Biotech Stocks with Triple-Digit Profit Potential\r\n The biotech sector is projected to surge beyond $775 billion by 2024 as scientists develop treatments for thousands of diseases. They're also finding ways to edit the human genome to literally erase our vulnerability to these diseases.\r\n Zacks has just released Century of Biology: 7 Biotech Stocks to Buy Right Now to help investors profit from 7 stocks poised for outperformance. Our recent biotech recommendations have produced gains of +98%, +119% and +164% in as little as 1 month. The stocks in this report could perform even better.See these 7 breakthrough stocks now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 07:10:00"
}