{
  "url": "https://www.nasdaq.com/article/this-oil-company-is-pounding-the-table-that-its-stock-is-cheap-cm1206968",
  "title": "This Oil Company Is Pounding the Table That Its Stock Is Cheap - Nasdaq.com",
  "text": [
    " Shares of   Concho Resources    (NYSE: CXO)    cratered    last month after the company posted disappointing second-quarter   results. Not only did the   Permian Basin    -focused oil producer miss analysts' earnings expectations, but   it also cut its full-year forecast and reported disappointing   results for a well spacing test. That shellacking has sent shares   down more than 28% for the year even though    oil   prices    have rebounded nearly 16%. While Concho's second-quarter report was a disappointment, its   value proposition hasn't changed. As a result, the   energy company    is taking advantage of the decline in its stock price to buy back   a big chunk of its shares.   Image source: Getty Images.makeArticleAd();  Jump-starting its buyback Concho Resources has shifted its priorities over the past   year. The company has gone from focusing on growing production as   fast as it can to living below its means so that it can generate   free cash flow. That has enabled the company to more quickly pay   down debt as well as   initiate a dividend    . It targeted to return even more money to shareholders in the   future as its free cash flow grew. However, with its stock price tumbling this year, Concho has   accelerated that plan, doing so by selling its legacy assets in   the New Mexico Shelf for $925 million. It plans to use 60% of   that money to pay off debt, which will enable it to achieve its   leverage target. It will use the rest to jump-start a share   buyback program, which it has initially set at $1.5 billion. The   company will fund the balance of its buyback with the increasing   free cash flow it expects to generate in the future. At its   current market value, that's enough money to retire more than 10%   of its outstanding stock. Following a well-known blueprint Concho Resources is the latest oil stock to authorize a   meaningful share repurchase program. It's doing so by following   the same acceleration strategy as its peers. U.S. oil giant   ConocoPhillips    (NYSE: COP) drew up the game plan toward the end of 2016. At the   time, ConocoPhillips aimed to sell $5 billion to $8 billion in   assets, which would give it the cash to pay down debt and   repurchase $3 billion in stock. It would go on to vastly   outperform its plan by selling more assets than expected. That   allowed it to pay down debt quickly, enabling it to generate more   free cash flow to buy back its shares. As a result,   ConocoPhillips is now on track to repurchase $15 billion of   stock, which could retire about 20% of its outstanding shares in   the coming years.      Meanwhile,   Devon Energy    (NYSE: DVN) has taken things even further. The company sold   several assets, which has narrowed its focus on four key regions.   That gave Devon Energy the cash to repurchase $4.4 billion of its   stock so far, which is 24% of its shares outstanding. The company   aims to buy back another $600 million by year-end, which could   push its share total down by 30% from its peak. More repurchases   are likely in the future since Devon now has a top-tier balance   sheet and a business that's generating increasing free cash   flow. Taking matters into its own hands Concho Resources' recent sell-off pushed its stock price into   bargain territory in the company's view. As a result, it's   selling assets so that it can repurchase shares. That will enable   the company to immediately gobble up some of its discounted   shares, which it hopes will create more value for its investors   over the long term.   10 stocks we like better than Concho Resources       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Concho Resources wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Matthew DiLallo      owns shares of ConocoPhillips. The Motley Fool has no position     in any of the stocks mentioned. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   Concho Resources    (NYSE: CXO)    cratered    last month after the company posted disappointing second-quarter   results. Not only did the   Permian Basin    -focused oil producer miss analysts' earnings expectations, but   it also cut its full-year forecast and reported disappointing   results for a well spacing test. That shellacking has sent shares   down more than 28% for the year even though    oil   prices    have rebounded nearly 16%.",
    "While Concho's second-quarter report was a disappointment, its   value proposition hasn't changed. As a result, the   energy company    is taking advantage of the decline in its stock price to buy back   a big chunk of its shares.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Concho Resources has shifted its priorities over the past   year. The company has gone from focusing on growing production as   fast as it can to living below its means so that it can generate   free cash flow. That has enabled the company to more quickly pay   down debt as well as   initiate a dividend    . It targeted to return even more money to shareholders in the   future as its free cash flow grew.",
    "However, with its stock price tumbling this year, Concho has   accelerated that plan, doing so by selling its legacy assets in   the New Mexico Shelf for $925 million. It plans to use 60% of   that money to pay off debt, which will enable it to achieve its   leverage target. It will use the rest to jump-start a share   buyback program, which it has initially set at $1.5 billion. The   company will fund the balance of its buyback with the increasing   free cash flow it expects to generate in the future. At its   current market value, that's enough money to retire more than 10%   of its outstanding stock.",
    "Concho Resources is the latest oil stock to authorize a   meaningful share repurchase program. It's doing so by following   the same acceleration strategy as its peers. U.S. oil giant   ConocoPhillips    (NYSE: COP) drew up the game plan toward the end of 2016. At the   time, ConocoPhillips aimed to sell $5 billion to $8 billion in   assets, which would give it the cash to pay down debt and   repurchase $3 billion in stock. It would go on to vastly   outperform its plan by selling more assets than expected. That   allowed it to pay down debt quickly, enabling it to generate more   free cash flow to buy back its shares. As a result,   ConocoPhillips is now on track to repurchase $15 billion of   stock, which could retire about 20% of its outstanding shares in   the coming years.     ",
    "Meanwhile,   Devon Energy    (NYSE: DVN) has taken things even further. The company sold   several assets, which has narrowed its focus on four key regions.   That gave Devon Energy the cash to repurchase $4.4 billion of its   stock so far, which is 24% of its shares outstanding. The company   aims to buy back another $600 million by year-end, which could   push its share total down by 30% from its peak. More repurchases   are likely in the future since Devon now has a top-tier balance   sheet and a business that's generating increasing free cash   flow.",
    "Concho Resources' recent sell-off pushed its stock price into   bargain territory in the company's view. As a result, it's   selling assets so that it can repurchase shares. That will enable   the company to immediately gobble up some of its discounted   shares, which it hopes will create more value for its investors   over the long term.",
    "  10 stocks we like better than Concho Resources       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Concho Resources wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Concho Resources       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Concho Resources wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Matthew DiLallo      owns shares of ConocoPhillips. The Motley Fool has no position     in any of the stocks mentioned. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 17:04:00"
}