{
  "url": "https://www.nasdaq.com/article/gold-climbs-on-rate-cut-bets-firm-equities-cap-gains-20190911-00568",
  "title": "Gold climbs on rate cut bets; firm equities cap gains - Nasdaq.com",
  "text": [
    "By Asha Sistla",
    "Sept 11 (Reuters) - Gold rose on Wednesday on expectations of monetary policy easing by top central banks while global growth risks continue to linger, although improved appetite for riskier assets capped bullion's gains and kept it near a four-week low.",
    "Spot gold  was up 0.6% to $1,494.90 per ounce at 1:39 p.m. EDT (1739 GMT). Prices fell to their lowest since Aug. 13 at $1,483.90 in the previous session in four-day losing streak.",
    "\"If the European Central Bank (ECB) announces another cut or more liquidity, it should boost precious metals and that's what's given a positive tone for gold,\" said Chris Gaffney, president of world markets at TIAA Bank.",
    "\"Low interest rates and slowing global growth are helping gold stay well bid. It's just that to push it back to $1,500, we need to see a rise in tensions and more expectations of lower rates.\"",
    "Bond yields extended their steady climb and Wall Street gained, with investor focus turning to monetary policy decisions by the ECB on Thursday, when the bank is widely expected to cut interest rates. MKTS/GLOBUS/",
    "The ECB decision is likely to set the tone for upcoming rate-setting decisions by the U.S. Federal Reserve and the Bank of Japan next week.",
    "While recent economic indicators might prompt a 25-basis point interest rate reduction by the U.S. Fed, \"a major cut of 50 bps (basis points) is unnecessary,\" said TIAA Bank's Gaffney.",
    "Lower interest rates decrease the opportunity cost of holding non-yielding bullion and weigh on the dollar, making gold cheaper for investors holding other currencies.",
    "Also on investors' radar was the U.S.-China trade ties, with China exempting certain U.S. goods from retaliatory tariffs days ahead of the October talks in an attempt to de-escalate the protracted dispute. ",
    "Spot gold is still targeting $1,453, as it has breached a support at $1,497 per ounce, according to Reuters technical analyst Wang Tao. ",
    "\"Weakening global growth, high risk aversion and low interest rates should keep prices elevated, but they are unlikely to provide a further boost given that they are, for the most part, already accounted for,\" analysts at Capital Economics wrote in a note.",
    "Among other precious metals, silver  was up 0.4% to $18.09 per ounce, having hit a two-week low of $17.75 in the previous session.",
    "Palladium  rose 0.3% to $1,565.87 an ounce, after hitting its highest since July 11 at $1,590. Platinum  rose 0.9% to $938.58."
  ],
  "published_datetime": "2019-09-11 11:07:00"
}