{
  "url": "https://www.nasdaq.com/article/interesting-team-put-and-call-options-for-august-2020-cm1206740",
  "title": "Interesting TEAM Put And Call Options For August 2020 - Nasdaq.com",
  "text": [
    "Investors in Atlassian Corp PLC (Symbol: TEAM) saw new options begin trading today, for the August 2020 expiration. One of the key inputs that goes into the price an option buyer is willing to pay, is the time value, so with 353 days until expiration the newly trading contracts represent a possible opportunity for sellers of puts or calls to achieve a higher premium than would be available for the contracts with a closer expiration. At Stock Options Channel  , our YieldBoost formula has looked up and down the TEAM options chain for the new August 2020 contracts and identified one put and one call contract of particular interest.    The put contract at the $130.00 strike price has a current bid of $20.20. If an investor was to sell-to-open that put contract, they are committing to purchase the stock at $130.00, but will also collect the premium, putting the cost basis of the shares at $109.80 (before broker commissions). To an investor already interested in purchasing shares of TEAM, that could represent an attractive alternative to paying $132.89/share today. Because the $130.00 strike represents an approximate 2% discount to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the put contract would expire worthless. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 62%. Stock Options Channel will track those odds over time to see how they change, publishing a chart of those numbers on our website under the contract detail page for this contract  . Should the contract expire worthless, the premium would represent a 15.54% return on the cash commitment, or 16.07% annualized - at Stock Options Channel we call this the YieldBoost  .  makeArticleAd();  Below is a chart showing the trailing twelve month trading history for Atlassian Corp PLC, and highlighting in green where the $130.00 strike is located relative to that history:       Turning to the calls side of the option chain, the call contract at the $135.00 strike price has a current bid of $22.90. If an investor was to purchase shares of TEAM stock at the current price level of $132.89/share, and then sell-to-open that call contract as a \"covered call,\" they are committing to sell the stock at $135.00. Considering the call seller will also collect the premium, that would drive a total return (excluding dividends, if any) of 18.82% if the stock gets called away at the August 2020 expiration (before broker commissions). Of course, a lot of upside could potentially be left on the table if TEAM shares really soar, which is why looking at the trailing twelve month trading history for Atlassian Corp PLC, as well as studying the business fundamentals becomes important. Below is a chart showing TEAM's trailing twelve month trading history, with the $135.00 strike highlighted in red:    Considering the fact that the $135.00 strike represents an approximate 2% premium to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the covered call contract would expire worthless, in which case the investor would keep both their shares of stock and the premium collected. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 41%. On our website under the contract detail page for this contract  , Stock Options Channel will track those odds over time to see how they change and publish a chart of those numbers (the trading history of the option contract will also be charted). Should the covered call contract expire worthless, the premium would represent a 17.23% boost of extra return to the investor, or 17.82% annualized, which we refer to as the YieldBoost  .    The implied volatility in the put contract example, as well as the call contract example, are both approximately 48%.    Meanwhile, we calculate the actual trailing twelve month volatility (considering the last 250 trading day closing values as well as today's price of $132.89) to be 47%. For more put and call options contract ideas worth looking at, visit StockOptionsChannel.com.   Top YieldBoost Calls of the S&P 500 »  ",
    "Because the $130.00 strike represents an approximate 2% discount to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the put contract would expire worthless. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 62%. Stock Options Channel will track those odds over time to see how they change, publishing a chart of those numbers on our website under the contract detail page for this contract  . Should the contract expire worthless, the premium would represent a 15.54% return on the cash commitment, or 16.07% annualized - at Stock Options Channel we call this the YieldBoost  .",
    "Considering the fact that the $135.00 strike represents an approximate 2% premium to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the covered call contract would expire worthless, in which case the investor would keep both their shares of stock and the premium collected. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 41%. On our website under the contract detail page for this contract  , Stock Options Channel will track those odds over time to see how they change and publish a chart of those numbers (the trading history of the option contract will also be charted). Should the covered call contract expire worthless, the premium would represent a 17.23% boost of extra return to the investor, or 17.82% annualized, which we refer to as the YieldBoost  .",
    "  Top YieldBoost Calls of the S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:49:45"
}