{
  "url": "https://www.nasdaq.com/article/uk-watchdog-warns-polling-firms-ahead-of-possible-brexit-election-20190903-00449",
  "title": "UK watchdog warns polling firms ahead of possible Brexit election - Nasdaq.com",
  "text": [
    "By Huw Jones",
    "LONDON, Sept 3 (Reuters) - Trading government bonds or currencies using information gleaned from unpublished polls could breach market abuse rules, Britain'sFinancial Conduct Authority (FCA) said on Tuesday.",
    "The FCA was responding to lawmaker concerns that during the Brexit vote in 2016, polling companies provided broadcasters with surveys while at the same time selling data privately to hedge funds which could then trade on the information.",
    "Clarity has become more pressing as the next national election is potentially as soon as next month, sending polling firms into top gear.",
    "\"We encourage firms, where appropriate, to take legal advice on specific questions and actions which should be applied on a case-by-case basis,\" the FCA said in a statement on Tuesday.",
    "\"It is important to note that all firms and individuals, regardless of whether they carry out regulated financial services activities, fall in scope of our regulatory remit on market abuse.\"",
    "The concern among UK lawmakers prompted FCA Chief Executive Andrew Bailey to meet with polling industry officials to see how the watchdog's regulatory remit could interact with polling.",
    "The FCA said in its formal response on Tuesday that it would be a breach of rules if an established polling firm shared bond market-moving information pre-publication, other than in the \"normal exercise of employment, a profession or duties\".",
    "\"It could also be an offence for anyone in possession of the information to trade in the relevant government bonds in advance of publication of the polling results if it is trading on the basis of the anticipated bond price movement that will result from publication of the results,\" the FCA said.",
    "Trading in spot foreign exchange is not covered by the insider dealing provisions of market abuse rules, but other FCA rules would apply, the watchdog said.",
    "The British Polling Council, an industry body, last year rejected lawmaker accusations of conflicts of interest in the sector."
  ],
  "published_datetime": "2019-09-03 07:43:00"
}