{
  "url": "https://www.nasdaq.com/article/integra-lifesciences-organic-growth-strong-on-new-products-cm1206735",
  "title": "Integra LifeSciences' Organic Growth Strong on New Products - Nasdaq.com",
  "text": [
    " On Sep 2, we issued an updated research report on Integra LifeSciences Holdings Corporation IART  . The company has been noticing certain major developments overseas. However, a tough competitive landscape is a concern. This New Jersey-based company is a leading developer, manufacturer and marketer of surgical implants and medical instruments for use in neurosurgery, extremity reconstruction, orthopedics and general surgery. Shares of this Zacks Rank #2 (Buy) company have outperformed its industry  in the past three months. The stock has rallied 29.2% compared with the industry's 8% rise. Integra LifeSciences exited the second quarter of 2019 on a solid note. We are upbeat about year-over-year revenue growth across both its key business segments. Several product launches including CereLink ICP monitor and CertasPlus family of Hydrocephalus management products in the quarter buoy optimism on the stock. In the same period, the company successfully completed its first clinical case using DuraGen in Japan. Expansion of gross and operating margins and a raised EPS guidance for 2019 are encouraging.   Integra LifeSciences Holdings Corporation     Price      Integra LifeSciences Holdings Corporation   price    |   Integra LifeSciences Holdings Corporation   Quote   Benefiting from product launches and an enhanced sales force performance, the company expects faster organic growth during the second half of 2019. In the second quarter, within Codman Specialty Surgical segment, the company began the commercial launch of its products ahead of schedule. Integra LifeSciences is looking forward to investment opportunities in the Asian market for growing its business much faster than in the United States and also certain parts of its international operations. In line with this strategy, the company is preparing to launch several products in China and Japan. Turning to Europe, management feels encouraged about the growth potential of this region with Tissue Technologies business and CUSA Clarity product scheduled to be launched on the continent. Meanwhile, the company faces severe competition in the surgical implants and the medical instruments market. It needs consistent innovation to ward off rivalry. Moreover, consolidations in the industry could cause an acute pricing pressure.  Other Key Picks  A few other top-ranked stocks in the broader medical space are Medtronic MDT  , Baxter BAX  and NuVasive NUVA  , each carrying the same favorable Zacks Rank as Integra LifeSciences. Medtronic's long-term earnings growth rate is expected at 7.13%. Baxter's long-term earnings growth rate is projected at 12.8%. NuVasive's long-term earnings growth rate is estimated to be 12.75%.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Medtronic PLC (MDT): Free Stock Analysis Report   Baxter International Inc. (BAX): Free Stock Analysis Report   NuVasive, Inc. (NUVA): Free Stock Analysis Report   Integra LifeSciences Holdings Corporation (IART): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "On Sep 2, we issued an updated research report on Integra LifeSciences Holdings Corporation IART  . The company has been noticing certain major developments overseas. However, a tough competitive landscape is a concern.",
    "This New Jersey-based company is a leading developer, manufacturer and marketer of surgical implants and medical instruments for use in neurosurgery, extremity reconstruction, orthopedics and general surgery.",
    "Shares of this Zacks Rank #2 (Buy) company have outperformed its industry  in the past three months. The stock has rallied 29.2% compared with the industry's 8% rise.",
    "Integra LifeSciences exited the second quarter of 2019 on a solid note. We are upbeat about year-over-year revenue growth across both its key business segments. Several product launches including CereLink ICP monitor and CertasPlus family of Hydrocephalus management products in the quarter buoy optimism on the stock. In the same period, the company successfully completed its first clinical case using DuraGen in Japan. Expansion of gross and operating margins and a raised EPS guidance for 2019 are encouraging.",
    "  Integra LifeSciences Holdings Corporation     Price      Integra LifeSciences Holdings Corporation   price    |   Integra LifeSciences Holdings Corporation   Quote  ",
    " Integra LifeSciences Holdings Corporation     Price ",
    " Integra LifeSciences Holdings Corporation   price    |   Integra LifeSciences Holdings Corporation   Quote ",
    "Benefiting from product launches and an enhanced sales force performance, the company expects faster organic growth during the second half of 2019. In the second quarter, within Codman Specialty Surgical segment, the company began the commercial launch of its products ahead of schedule.",
    "Integra LifeSciences is looking forward to investment opportunities in the Asian market for growing its business much faster than in the United States and also certain parts of its international operations. In line with this strategy, the company is preparing to launch several products in China and Japan. Turning to Europe, management feels encouraged about the growth potential of this region with Tissue Technologies business and CUSA Clarity product scheduled to be launched on the continent.",
    "Meanwhile, the company faces severe competition in the surgical implants and the medical instruments market. It needs consistent innovation to ward off rivalry. Moreover, consolidations in the industry could cause an acute pricing pressure.",
    " Other Key Picks ",
    "A few other top-ranked stocks in the broader medical space are Medtronic MDT  , Baxter BAX  and NuVasive NUVA  , each carrying the same favorable Zacks Rank as Integra LifeSciences.",
    "Medtronic's long-term earnings growth rate is expected at 7.13%.",
    "Baxter's long-term earnings growth rate is projected at 12.8%.",
    "NuVasive's long-term earnings growth rate is estimated to be 12.75%.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:04:00"
}