{
  "url": "https://www.nasdaq.com/article/uk-police-confident-heathrow-climate-protest-will-not-bring-chaos-20190911-00545",
  "title": "UK police confident Heathrow climate protest will not bring chaos - Nasdaq.com",
  "text": [
    "By Kylie MacLellan",
    "LONDON, Sept 11 (Reuters) - British police said they were confident an attempt by climate change activists to disrupt London'sHeathrow airport with toy drones from Friday would not lead to a repeat of the chaos seen at Gatwick last December.",
    "Drone sightings at Gatwick, Britain's second-busiest airport, led to about 1,000 flight cancellations and disrupted the travel plans of 140,000 passengers in the run-up to Christmas.",
    "\"I'm very confident that we've taken the learning from Gatwick,\" said London police Deputy Assistant Commissioner Laurence Taylor on Wednesday.",
    "\"The aviation industry and national policing have been working hard to look at measures to mitigate those issues we saw at Gatwick and I'm confident in the tactics that we've got in place that we won't see a repeat of what happened at Gatwick,\" he told reporters.",
    "Taylor declined to discuss specific tactics but said the police had robust plans in place which included the ability to detect and identify drones and also the use of counter-drones.",
    "\"If people come to the airport intent on committing criminal activity they will be arrested,\" he said.",
    "\"Endangering the life of passengers, flying drones without permission within the exclusion zone, attempting to disrupt the airport is very serious. We will enforce the law and we will use legislation available to us ... to prevent that from happening.\"",
    "Heathrow Pause, a splinter group of the climate activism group Extinction Rebellion which has disrupted London with high profile demonstrations this year, said it would fly drones at no higher than head level and give the airport one hour's advance notice.",
    "The airport has said the plan is illegal and counterproductive but that it too had robust plans in place to make sure the airport could continue to operate."
  ],
  "published_datetime": "2019-09-11 10:31:00"
}