{
  "url": "https://www.nasdaq.com/article/3-beaten-down-industrials-worth-considering-now-cm1210309",
  "title": "3 Beaten-Down Industrials Worth Considering Now - Nasdaq.com",
  "text": [
    " When scanning the market for value, it's easy to fall prey to   lofty dividends and low multiples given by declining and   mismanaged businesses. The better move is to find companies that   provide a steady balance of responsible management, dividend   yields, and growth prospects.   Caterpillar    (NYSE: CAT) ,   FedEx    (NYSE: FDX) , and   Southwest Airlines    (NYSE: LUV) all have significantly below-market-average   valuations and have underperformed the market in 2019, opening   the door for value investors to take a look. The biggest of the three, Caterpillar, is known for its farm   and construction equipment. Lesser known but making up a good   deal of the company's business are diesel and natural gas   engines, transmissions, pumps, and generators for the marine and   oil and gas industry. Caterpillar's global dealership network   covers 21 industries and services six continents.   Image source: Getty Images.makeArticleAd();  FedEx's shipping duopoly with UPS is highly tied to global   trade. As such, the stock is hypersensitive to geopolitical news,   most notably the recent U.S.-China trade conflict. FedEx employs   more than 300,000 people and has seven main business segments:   FedEx Corporation, FedEx Express, FedEx Ground, FedEx Freight,   FedEx Services, FedEx Logistics, and FedEx Office. Southwest Airlines got its reputation as the airline with the   best customer service in the industry. The company primarily   offers flights across the United States as well as to the   Caribbean and Mexico. FedEx and Southwest Airlines are both well known for their   paradigm-shifting business models, which have since been   replicated and adopted into case studies that are taught by   Harvard Business School and other universities around the   world.  Source: Yahoo! Finance. All data as of market close Sept. 6,   2019. Looking beyond trade tariffs All three of these companies have exposure to international   markets, and they have all been impacted by trade tensions that   have been ongoing for more than a year now. But the general   health of the American economy affects them too. Unlike   consumer staples    companies like   Procter & Gamble    or   Clorox    that are less reactive to economic cycles. That's because they   focus on domestic markets and therefore aren't reliant on trade.   Both companies continuously achieve steady growth despite   economic cycles thanks to their diversified portfolios of   inelasticly demanded products, meaning demand will not fall   during a recession. By contrast, most industrial companies depend   to a greater extent on economic growth to drive their   results. New home builds, ship construction, natural gas pipelines, and   more all increase Caterpillar's revenue. That same economic   growth slows during a recession but also booms during an economic   expansion. Same goes for FedEx, which ships more packages when   the economic climate is good. The highest margins are from   international shipments, which are, of course, dependent on   healthy trade relations. Southwest Airlines is no different. More people fly when they   have discretionary income to take vacations. When cash flow is   rich, companies will send employees to conventions, trade shows,   conferences, and more, all of which increase Southwest's   earnings. This may sound like common sense, but it's important to   understand when determining if it's the right time to invest in   an industrial company. The good news is that Caterpillar, FedEx, and Southwest   Airlines are all cheap stocks on paper. Earnings multiples are   roughly half the 22 times earnings that the broader S&P 500   fetches. Even during a recession, all three companies have business   models that will turn a profit, albeit not as much as usual. That's where the dividends come into play. To bolster   shareholder confidence, Caterpillar pays a nice 3.5% dividend.   The company is well known as a bellwether stock for the American   economy, meaning that if the company forecasts mediocre guidance,   it's likely a result of a slowing or even rapidly declining   business environment. FedEx and Southwest Airlines offer small   dividends, 1.6%, and 1.4% respectively, but at least it's   something. For investors willing to weather short-term volatility, strong   industrial names like Caterpillar, FedEx, and Southwest Airlines   offer solid long-term performance with diversified revenue   streams, consisten   t earnings    , and reputable brands. Much of the U.S.-China trade tension is   already priced into the stocks. From headlines alone, the three   stocks have fallen while the broader markets have risen. It   remains to be seen just how severe the trade conflict will impact   industrial stocks. The good news is that investors are already   assuming these stocks will take a hit as a result of the trade   war, and have thus sold off their stocks off ahead of any   tangible results. This sell-off bodes well for investors   considering a position now.   10 stocks we like better than Caterpillar       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Caterpillar wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Daniel Foelber      owns shares of Caterpillar, Clorox, FedEx, and Southwest     Airlines. The Motley Fool owns shares of and recommends FedEx     and Southwest Airlines. The Motley Fool is short shares of     Clorox and Procter & Gamble. The Motley Fool has a     disclosure policy      .  ",
    "When scanning the market for value, it's easy to fall prey to   lofty dividends and low multiples given by declining and   mismanaged businesses. The better move is to find companies that   provide a steady balance of responsible management, dividend   yields, and growth prospects.   Caterpillar    (NYSE: CAT) ,   FedEx    (NYSE: FDX) , and   Southwest Airlines    (NYSE: LUV) all have significantly below-market-average   valuations and have underperformed the market in 2019, opening   the door for value investors to take a look.",
    "The biggest of the three, Caterpillar, is known for its farm   and construction equipment. Lesser known but making up a good   deal of the company's business are diesel and natural gas   engines, transmissions, pumps, and generators for the marine and   oil and gas industry. Caterpillar's global dealership network   covers 21 industries and services six continents.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "FedEx's shipping duopoly with UPS is highly tied to global   trade. As such, the stock is hypersensitive to geopolitical news,   most notably the recent U.S.-China trade conflict. FedEx employs   more than 300,000 people and has seven main business segments:   FedEx Corporation, FedEx Express, FedEx Ground, FedEx Freight,   FedEx Services, FedEx Logistics, and FedEx Office.",
    "Southwest Airlines got its reputation as the airline with the   best customer service in the industry. The company primarily   offers flights across the United States as well as to the   Caribbean and Mexico.",
    "FedEx and Southwest Airlines are both well known for their   paradigm-shifting business models, which have since been   replicated and adopted into case studies that are taught by   Harvard Business School and other universities around the   world.",
    "Source: Yahoo! Finance. All data as of market close Sept. 6,   2019.",
    "All three of these companies have exposure to international   markets, and they have all been impacted by trade tensions that   have been ongoing for more than a year now. But the general   health of the American economy affects them too. Unlike   consumer staples    companies like   Procter & Gamble    or   Clorox    that are less reactive to economic cycles. That's because they   focus on domestic markets and therefore aren't reliant on trade.   Both companies continuously achieve steady growth despite   economic cycles thanks to their diversified portfolios of   inelasticly demanded products, meaning demand will not fall   during a recession. By contrast, most industrial companies depend   to a greater extent on economic growth to drive their   results.",
    "New home builds, ship construction, natural gas pipelines, and   more all increase Caterpillar's revenue. That same economic   growth slows during a recession but also booms during an economic   expansion. Same goes for FedEx, which ships more packages when   the economic climate is good. The highest margins are from   international shipments, which are, of course, dependent on   healthy trade relations.",
    "Southwest Airlines is no different. More people fly when they   have discretionary income to take vacations. When cash flow is   rich, companies will send employees to conventions, trade shows,   conferences, and more, all of which increase Southwest's   earnings. This may sound like common sense, but it's important to   understand when determining if it's the right time to invest in   an industrial company.",
    "The good news is that Caterpillar, FedEx, and Southwest   Airlines are all cheap stocks on paper. Earnings multiples are   roughly half the 22 times earnings that the broader S&P 500   fetches.",
    "Even during a recession, all three companies have business   models that will turn a profit, albeit not as much as usual.",
    "That's where the dividends come into play. To bolster   shareholder confidence, Caterpillar pays a nice 3.5% dividend.   The company is well known as a bellwether stock for the American   economy, meaning that if the company forecasts mediocre guidance,   it's likely a result of a slowing or even rapidly declining   business environment. FedEx and Southwest Airlines offer small   dividends, 1.6%, and 1.4% respectively, but at least it's   something.",
    "For investors willing to weather short-term volatility, strong   industrial names like Caterpillar, FedEx, and Southwest Airlines   offer solid long-term performance with diversified revenue   streams, consisten   t earnings    , and reputable brands. Much of the U.S.-China trade tension is   already priced into the stocks. From headlines alone, the three   stocks have fallen while the broader markets have risen. It   remains to be seen just how severe the trade conflict will impact   industrial stocks. The good news is that investors are already   assuming these stocks will take a hit as a result of the trade   war, and have thus sold off their stocks off ahead of any   tangible results. This sell-off bodes well for investors   considering a position now.",
    "  10 stocks we like better than Caterpillar       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Caterpillar wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Caterpillar       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Caterpillar wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Daniel Foelber      owns shares of Caterpillar, Clorox, FedEx, and Southwest     Airlines. The Motley Fool owns shares of and recommends FedEx     and Southwest Airlines. The Motley Fool is short shares of     Clorox and Procter & Gamble. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:00:00"
}