{
  "url": "https://www.nasdaq.com/article/3-signs-youre-thinking-about-social-security-the-wrong-way-cm1207579",
  "title": "3 Signs You're Thinking About Social Security the Wrong Way - Nasdaq.com",
  "text": [
    " Social Security is one of the most universal and crucial parts   of Americans' retirement plans. It's also one of the most   misunderstood. These misconceptions often cause people to   overestimate the income they'll receive from the program while   underestimating their personal control over the size of their   checks. Here are three signs that you're guilty of   misunderstanding the Social Security program. 1. You think Social Security will cover all of your expenses   in retirement Millions of Americans count on Social Security as their   primary source of income in retirement, but it was only intended   to be a supplement to your personal retirement savings. The   Social Security Administration (SSA) states that the program was   designed to replace about 40% of pre-retirement income for   average earners. It gives no insights into what it considers   avera   ge   earnings    , but you can expect it will cover close to this figure for you.   High-income households may find it covers less than 40% of their   pre-retirement income while low-income households may find it   covers more.   Image source: Getty Images.makeArticleAd();  The average Social Security benefit as of July 2019 is $1,472   per month, or $17,664 per year. The Bureau of Labor Statistics   estimates that the average household headed by an adult 65 or   older currently spends about $50,000 per year. Based on these   numbers, the average Social Security benefit won't quite cover   40% of those expenditures, but if there are two people in the   household claiming benefits, it could possibly cover more of   their annual expenses. 2. You haven't given any thought to when you'll start taking   benefits In addition to overestimating   Social Security benefits    , many people tend to see their benefits as something beyond   their control, a predetermined amount decided by the government.   This is somewhat true, but you do have some say over the size of   your checks. The   benefit formula    calculates how much you're entitled to based on your work record   at your   full retirement age (FRA)    . This is not the age you leave the workforce or start taking   benefits. It's a government-chosen designation, and it's anywhere   from 66 to 67 for today's workers, depending on when they were   born. You can start benefits as early as 62 regardless of your   FRA, but it'll cost you. For every month you receive benefits before your FRA, the SSA   will dock your checks. If you start at 62, you'll only receive   70% of your scheduled benefit per check if your FRA is 67, or 75%   if your FRA is 66. You can also delay benefits past your FRA and   your checks will increase until you reach the maximum benefit at   70. That's 124% of your scheduled benefit for an FRA of 67 or   132% for an FRA of 66. There is no right or wrong answer for claiming Social   Security, but there are starting ages that will net you more   money than others, depending on your life expectancy. If you want   to maximize your benefits, you should figure out which starting   age offers the   maximum lifetime benefit    by multiplying the size of your monthly checks by the number of   months you expect to receive benefits based on your estimated   life expectancy. Create a   my Social Security account    to estimate how much you can expect per month if you start at 62,   your FRA, or 70. 3. You aren't taking steps now to increase your Social   Security checks later Another consequence of thinking your Social Security checks   are wholly determined by the government is that many people fail   to take actions while they're still working to increase their   future benefit checks. Anything you do today that increases your   income will increase your Social Security checks because your   benefits are calculated based on your   average indexed monthly earnings    over your 35 highest-earning years, with adjustments for   inflation. Working a little extra, pursuing promotions, or switching to a   more lucrative field can help you earn more money today and enjoy   more Social Security benefits in the future. But only up to a   point. Annual income in excess of $132,900 in 2019 is not subject   to Social Security tax, so it won't help increase your benefit   checks at all. Make sure you stay in the workforce for at least 35 years if   you can. Failing to work for at least that long results in zeros   weighing down your benefit calculation, and not working for at   least 10 years could leave you ineligible for any benefits. No matter what you do, Social Security is likely never going   to cover all your retirement expenses unless you live extremely   frugally. But by understanding how your benefits are calculated   and how your decisions affect your checks, you can stretch your   benefits a little further.   The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .   The Motley Fool has a     disclosure policy      .  ",
    "Social Security is one of the most universal and crucial parts   of Americans' retirement plans. It's also one of the most   misunderstood. These misconceptions often cause people to   overestimate the income they'll receive from the program while   underestimating their personal control over the size of their   checks. Here are three signs that you're guilty of   misunderstanding the Social Security program.",
    "Millions of Americans count on Social Security as their   primary source of income in retirement, but it was only intended   to be a supplement to your personal retirement savings. The   Social Security Administration (SSA) states that the program was   designed to replace about 40% of pre-retirement income for   average earners. It gives no insights into what it considers   avera   ge   earnings    , but you can expect it will cover close to this figure for you.   High-income households may find it covers less than 40% of their   pre-retirement income while low-income households may find it   covers more.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "The average Social Security benefit as of July 2019 is $1,472   per month, or $17,664 per year. The Bureau of Labor Statistics   estimates that the average household headed by an adult 65 or   older currently spends about $50,000 per year. Based on these   numbers, the average Social Security benefit won't quite cover   40% of those expenditures, but if there are two people in the   household claiming benefits, it could possibly cover more of   their annual expenses.",
    "In addition to overestimating   Social Security benefits    , many people tend to see their benefits as something beyond   their control, a predetermined amount decided by the government.   This is somewhat true, but you do have some say over the size of   your checks.",
    "The   benefit formula    calculates how much you're entitled to based on your work record   at your   full retirement age (FRA)    . This is not the age you leave the workforce or start taking   benefits. It's a government-chosen designation, and it's anywhere   from 66 to 67 for today's workers, depending on when they were   born. You can start benefits as early as 62 regardless of your   FRA, but it'll cost you.",
    "For every month you receive benefits before your FRA, the SSA   will dock your checks. If you start at 62, you'll only receive   70% of your scheduled benefit per check if your FRA is 67, or 75%   if your FRA is 66. You can also delay benefits past your FRA and   your checks will increase until you reach the maximum benefit at   70. That's 124% of your scheduled benefit for an FRA of 67 or   132% for an FRA of 66.",
    "There is no right or wrong answer for claiming Social   Security, but there are starting ages that will net you more   money than others, depending on your life expectancy. If you want   to maximize your benefits, you should figure out which starting   age offers the   maximum lifetime benefit    by multiplying the size of your monthly checks by the number of   months you expect to receive benefits based on your estimated   life expectancy. Create a   my Social Security account    to estimate how much you can expect per month if you start at 62,   your FRA, or 70.",
    "Another consequence of thinking your Social Security checks   are wholly determined by the government is that many people fail   to take actions while they're still working to increase their   future benefit checks. Anything you do today that increases your   income will increase your Social Security checks because your   benefits are calculated based on your   average indexed monthly earnings    over your 35 highest-earning years, with adjustments for   inflation.",
    "Working a little extra, pursuing promotions, or switching to a   more lucrative field can help you earn more money today and enjoy   more Social Security benefits in the future. But only up to a   point. Annual income in excess of $132,900 in 2019 is not subject   to Social Security tax, so it won't help increase your benefit   checks at all.",
    "Make sure you stay in the workforce for at least 35 years if   you can. Failing to work for at least that long results in zeros   weighing down your benefit calculation, and not working for at   least 10 years could leave you ineligible for any benefits.",
    "No matter what you do, Social Security is likely never going   to cover all your retirement expenses unless you live extremely   frugally. But by understanding how your benefits are calculated   and how your decisions affect your checks, you can stretch your   benefits a little further.",
    "  The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      . ",
    " The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .",
    " The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:09:00"
}