{
  "url": "https://www.nasdaq.com/article/hkex-halts-derivatives-trading-on-connectivity-issues-stocks-slip-20190905-00132",
  "title": "HKEX halts derivatives trading on 'connectivity' issues; stocks slip - Nasdaq.com",
  "text": [
    "By Noah Sin and Alun John",
    "HONG KONG, Sept 5 (Reuters) - Bourse operator Hong Kong Exchanges and Clearing (HKEX)  said on Thursday it has suspended trading in its derivatives market for the afternoon and after-hours sessions.",
    "Derivatives trading was halted just as local stocks  slipped on profit taking, after an almost 4% rally on Wednesday when the city's leader formally withdrew a proposed extradition bill that sparked three months of protests. ",
    "It said all other markets remained fully operational, and that the clearing system for derivatives would remain open for the afternoon session only.",
    "HKEX Chief Executive Charles Li said it was a difficult decision to suspend the market, a major one that was not taken lightly.",
    "\"You would only do this if the market was no longer considered orderly,\" Li said.",
    "HKEX is continuing to investigate the root cause and will update the market as soon as possible, he said.",
    "Even before the glitches, some investors were already taking the opportunity to sell and take profit following recent gains.",
    "\"With this (glitches) happening, people may lower their exposure more,\" said Steven Leung, executive director for Institutional Sales at UOB Kay Hian in Hong Kong.",
    "The Hang Seng Index  fell as much as 0.9% in the afternoon session, before closing flat.",
    "Earlier, the index rose 0.7%, tracking gains in other Asian markets after China said it will hold trade talks with the United States in early October, raising hopes they can de-escalate their trade war. MKTS/GLOB",
    "Index heavyweights will be most affected by the Hong Kong suspension, since some investors use index futures to hedge their exposure in these stocks, said Linus Yip, chief strategist at First Shanghai Securities.",
    "Hong Kong property shares were down more than 2% in intraday trade. Wharf Real Estate Investment Company  was the worst performer on the Hang Seng, falling 5% at one point.",
    "Earlier in the day, HKEX said it was looking into some derivatives trading connectivity issues, and that its websites were experiencing \"intermittent technical difficulties\"."
  ],
  "published_datetime": "2019-09-05 02:26:00"
}