{
  "url": "https://www.nasdaq.com/article/ultragenyx-genetx-get-orphan-drug-status-for-gtx-102-from-fda-cm1207324",
  "title": "Ultragenyx-GeneTx Get Orphan Drug Status for GTX-102 From FDA - Nasdaq.com",
  "text": [
    "  Ultragenyx Pharmaceutical Inc. RARE  and partner GeneTx Biotherapeutics LLC announced that the FDA granted Orphan Drug and Rare Pediatric Disease designations to GTX-102 for the treatment of Angelman Syndrome, which is a serious, debilitating rare neurogenetic disorder. GTX-102 is an antisense oligonucleotide (ASO) and currently in late preclinical development, with an investigational new drug (IND) application expected to be filed with the FDA in the first half of 2020. In August 2019, Ultragenyx and GeneTx announced a partnership to develop GTX-102 with the former receiving an exclusive option to acquire the latter. Shares of the company have gained 18% year to date against the  industry  's decline of 4.2%.    Notably, the Orphan Drug designation is granted to drugs capable of treating rare diseases that affect less than 200,000 people in the United States. This designation also makes the company entitled to certain other benefits, including tax credits related to clinical trial expenses and an exemption from the FDA user fee. Additionally, the Rare Pediatric Disease designation granted to the candidate provides Ultragenyx with the opportunity to obtain a Pediatric Disease Priority Review Voucher from the FDA, after a qualifying new drug application (NDA) or biologics license application (BLA) is approved for the treatment of any rare pediatric disease. The company may use the voucher to obtain Priority Review for an NDA or BLA submitted later. We note that all of Ultragenyx's current clinical product candidates are in-licensed from academic institutions or derived from partnerships with other pharmaceutical companies. In June 2019, Ultragenyx and Arcturus Therapeutics Holdings Inc. ARCT  expanded their collaboration to discover and develop mRNA, DNA and siRNA therapeutics for up to 12 rare disease targets. In October 2018, Ultragenyx exercised its option with REGENXBIO Inc.  RGNX  to develop a gene therapy to treat patients with CDD, using the latter's adeno-associated virus (AAV) vectors like AAV9. Ultragenyx has several products in its pipeline. The company is also looking to expand the label of Crysvita. The drug is being developed for the treatment of tumor-induced osteomalacia (TIO). The company also has some gene-therapy candidates like DTX301, which is an adeno-associated virus 8 (AAV8) being evaluated for the treatment of patients with Ornithine transcarbamylase (OTC) deficiency. DTX401 is another AAV8 gene-therapy candidate being evaluated for the treatment of patients with glycogen storage disease type Ia (GSDIa). Ultragenyx is developing DTX201, its FVIII gene-therapy program, for the treatment of hemophilia A, in collaboration with Bayer BAYRY  . Potential approval of these candidates will drive the company's revenues. Ultragenyx currently has a Zacks Rank #3 (Hold). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here.       Ultragenyx Pharmaceutical Inc. Price        Ultragenyx Pharmaceutical Inc. price    |   Ultragenyx Pharmaceutical Inc. Quote    Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Bayer Aktiengesellschaft (BAYRY): Free Stock Analysis Report   REGENXBIO Inc. (RGNX): Free Stock Analysis Report   Ultragenyx Pharmaceutical Inc. (RARE): Free Stock Analysis Report   Alcobra Ltd. (ARCT): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Ultragenyx Pharmaceutical Inc. RARE  and partner GeneTx Biotherapeutics LLC announced that the FDA granted Orphan Drug and Rare Pediatric Disease designations to GTX-102 for the treatment of Angelman Syndrome, which is a serious, debilitating rare neurogenetic disorder.",
    "GTX-102 is an antisense oligonucleotide (ASO) and currently in late preclinical development, with an investigational new drug (IND) application expected to be filed with the FDA in the first half of 2020. In August 2019, Ultragenyx and GeneTx announced a partnership to develop GTX-102 with the former receiving an exclusive option to acquire the latter.",
    "Shares of the company have gained 18% year to date against the  industry  's decline of 4.2%.",
    "Notably, the Orphan Drug designation is granted to drugs capable of treating rare diseases that affect less than 200,000 people in the United States. This designation also makes the company entitled to certain other benefits, including tax credits related to clinical trial expenses and an exemption from the FDA user fee.",
    "Additionally, the Rare Pediatric Disease designation granted to the candidate provides Ultragenyx with the opportunity to obtain a Pediatric Disease Priority Review Voucher from the FDA, after a qualifying new drug application (NDA) or biologics license application (BLA) is approved for the treatment of any rare pediatric disease. The company may use the voucher to obtain Priority Review for an NDA or BLA submitted later.",
    "We note that all of Ultragenyx's current clinical product candidates are in-licensed from academic institutions or derived from partnerships with other pharmaceutical companies.",
    "In June 2019, Ultragenyx and Arcturus Therapeutics Holdings Inc. ARCT  expanded their collaboration to discover and develop mRNA, DNA and siRNA therapeutics for up to 12 rare disease targets.",
    "In October 2018, Ultragenyx exercised its option with REGENXBIO Inc.  RGNX  to develop a gene therapy to treat patients with CDD, using the latter's adeno-associated virus (AAV) vectors like AAV9.",
    "Ultragenyx has several products in its pipeline. The company is also looking to expand the label of Crysvita. The drug is being developed for the treatment of tumor-induced osteomalacia (TIO). The company also has some gene-therapy candidates like DTX301, which is an adeno-associated virus 8 (AAV8) being evaluated for the treatment of patients with Ornithine transcarbamylase (OTC) deficiency. DTX401 is another AAV8 gene-therapy candidate being evaluated for the treatment of patients with glycogen storage disease type Ia (GSDIa).",
    "Ultragenyx is developing DTX201, its FVIII gene-therapy program, for the treatment of hemophilia A, in collaboration with Bayer BAYRY  .",
    "Potential approval of these candidates will drive the company's revenues.",
    "Ultragenyx currently has a Zacks Rank #3 (Hold). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here.  ",
    "  Ultragenyx Pharmaceutical Inc. Price        Ultragenyx Pharmaceutical Inc. price    |   Ultragenyx Pharmaceutical Inc. Quote  ",
    " Ultragenyx Pharmaceutical Inc. Price ",
    " Ultragenyx Pharmaceutical Inc. price    |   Ultragenyx Pharmaceutical Inc. Quote ",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:42:00"
}