{
  "url": "https://www.nasdaq.com/article/utilize-new-analyst-coverage-to-find-strong-stocks-in-september-cm1206992",
  "title": "Utilize New Analyst Coverage to Find Strong Stocks in September - Nasdaq.com",
  "text": [
    "The U.S.-China trade war looms more heavily than ever over the markets and the global economic picture continues to worsen. Nonetheless, stocks will still play a vital role as Wall Street giants and investors need to find returns somewhere amid the current interest rate environment. One way to find solid investments, with potential for big returns, is to search for stocks that more analysts have started to cover recently.",
    "Broker recommendations play their part no matter how investors feel about them. And we seemingly all take a look no matter what. Individual investors, large institutional portfolio managers, and everyone in between are likely pleased to see one of their stocks get an upgraded rating or a new analyst covers the company.",
    "Right off the bat, investor interest can generate more analyst coverage. This helps explain why analysts jump on young, much-hyped and talked about tech companies. Then, as new coverage is initiated, the company and the stock become more visible, which in turn often leads to more demand potential and therefore the possibility of higher prices. ",
    "Plus, analysts almost always initiate coverage with a positive recommendation. And the logic follows because why spend all the time and write a research report on a company not widely tracked only to say it's not good?",
    "When it comes to companies with little to no analyst coverage, one new recommendation can sometimes give portfolio managers the validation they need to build a position. And the more money they can invest, the more they can potentially influence prices.",
    "The best way to use this information is to search for companies with analyst coverage that has increased over the last 4 weeks. We just look at the number of analyst recommendations today and compare it to the number of analyst recommendations 4 weeks ago.",
    "The rule of thumb here is that an increase in coverage leans bullish and a decrease signals bearish behavior. It is also worth pointing out that, in general, the change in the average broker recommendation is a better indicator than the actual recommendation itself.",
    "On top of that, it is typically more bullish if the increase went from none to one or if the coverage was minimal to begin with. (As the number of analysts climbs the addition of new coverage isn't earth-shattering.) In the end, increased coverage is still better than decreased coverage, unless the coverage is heading in the wrong direction. ",
    "Now let's try this screen…",
    "• Number of Broker Ratings now greater than the Number of Broker Ratings four weeks ago",
    "(This shows stocks where new coverage has recently been added.)",
    "• Average Broker Rating less than Average Broker Rating four weeks ago",
    "(By 'less than', we mean 'better than' four weeks ago.)",
    "• Prices greater than or equal to 5",
    "(We're applying all of the above parameters to stocks above $5 a share since many money managers won't even look at stocks under $5)",
    "• Average Daily Volume greater than or equal to 100,000 shares",
    "(If there's not enough volume, even individual investors won't want it).",
    "Here are three of the nine stocks that came through the screen this week…",
    "ACM Research, Inc. (ACMR) - (from 2 analyst four weeks ago to 4)",
    "K12 Inc. (LRN) - (from 2 analysts four weeks ago to 3)",
    "Central Garden & Pet Company (CENT) - (from 1 analysts four weeks ago to 4)",
    "Many screeners won't let you search for the number of analysts covering a stock, let alone comparing the amount of coverage they had weeks or even months ago. But you can with the Research Wizard. And you can backtest it all. Find out how to pick the right stocks right now by taking a free trial to the Research Wizard stock picking and backtesting program.",
    "Click here to sign up for a free trial to the Research Wizard today .",
    "Want more articles from this author? Scroll up to the top of this article and click the FOLLOW AUTHOR button to get an email each time a new article is published.",
    "Disclosure: Officers, directors and/or employees of Zacks Investment Research may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material. An affiliated investment advisory firm may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material.",
    "Disclosure: Performance information for Zacks' portfolios and strategies are available at:https://www.zacks.com/performance.",
    "Zacks' Super Screen It's hard to believe, even for us at Zacks. But from 2000-2018, while the market gained +4.8% per year, our top stock-picking strategy averaged +54.3% per year.\r\n How has that screen done lately? From 2017-2018, it sextupled the market's +15.8% gain with a soaring +98.3% return.Free - See the Stocks It Turned Up for Today >>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:40:00"
}