{
  "url": "https://www.nasdaq.com/article/7-stocks-the-insiders-are-buying-on-sale-cm1206925",
  "title": "7 Stocks the Insiders Are Buying on Sale - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "[Editor's Note: This article is updated each week with the latest insider moves.]",
    "I have learned that a simple, yet effective way to find stocks to buy is to look for companies with insider buying. This is especially the case if the stock has recently moved downwards in price.",
    "Insiders are people who have access to confidential information about a company. When they buy or sell their company's stock, the need to make a public filing with the U.S. Securities and Exchange Commission. This is intended to prevent insiders from taking advantage of information that the public does not have access to. For example, if an insider has information that a news story which will drive the stock price higher is about to be released, they could buy it from shareholders that don't know the news.",
    "Because of this we can find out when insiders are buying or selling their stock.",
    "There are many reasons why they may sell. Maybe they need to raise money to buy a house or to pay for their kids' braces.",
    "However, there is only one reason why an insider will buy the stock. They believe that it is currently undervalued. They buy it because they believe that it will eventually trade higher and they will profit.",
    "The following stocks have had significant insider buying following recent price declines.",
    "Post Holdings (NYSE: POST ) is a consumer packaged goods holding company. POST reported earnings earlier this month, and shareholders did not like what they heard. In just a few days, POST stock lost over 10% of its value.",
    "As president of Michael Foods, an operating company of Post Holdings, Mark Westphal is an insider of the company. He must think that the selloff is an overreaction because he just invested almost $200,000 of his personal funds. He paid $98.13 per share for 2,000 shares .",
    "Wall Street also thinks that POST is a good value at current levels. Twelve firms follow the company on a research basis. Ten of them have \"buy\" ratings on it, while the other two have the stock rated as a \"hold.\" The average target price is around $123, which is over 20% higher than where it is currently trading.",
    "J.C. Penney (NYSE: JCP ) sells merchandise to its customers though its department store and website. Like many other traditional retailers, this company is facing tough times. Some analysts attribute this to the  Amazon  (NASDAQ: AMZN ) effect, while others think that it is due to a series of strategic blunders.",
    "Wall Street doesn't see this company turning around any time soon. The average rating is \"underweight,\" and the average target price is 86 cents. This is probably the lowest price target that I have ever seen put on a company.",
    "Many insiders must think the stock is a bargain at these levels because the have just made large purchases. CEO Jill Soltau just bought 500,000 shares at 56 cents per share . Chairman Ron Tysoe made an even larger investment of almost $600,000 when he paid 59 cents for 1 million shares. There has been significant buying by other insiders as well.",
    "Town Sports International Holdings (NASDAQ: CLUB ) offers group exercise and fitness programs. Shareholders of this company may be be losing weight if they work out there, but they are also losing money. The value of CLUB stock has fallen by almost 80% over the past year.",
    "Patrick Walsh is the CEO of CLUB. He must believe that the stock is a great value at these levels. On Aug.26, he invested $330,000 of his personal funds when he paid an average price of $1.52 for 216,266 shares. Just two days later, he bought another 68,550 shares at an average price of $1.87 per share. This puts his investment up to just over $450,000.",
    "Only one firm follows Town Sports on a research basis. It has a \"buy\" rating on it with a target price of $3.",
    "Supernus Pharmaceuticals b( NASDAQ: SUPN ) engages in the development and commercialization of products for the treatment of central nervous system diseases.",
    "When the company announced its second-quarter 2019 results, shareholders were disappointed and the stock dropped from around $33 to $26 a share.",
    "The CEO and president of the company, Jack Khattar, believes this selloff has created a great buying opportunity. He just paid $26.39 a share for 7,300 shares .",
    "The Street also believes the stock is a good value at these levels. Eight firms follow it and the average rating is a \"buy.\" The average target price is $53, which is almost two times higher than where SUPN stock is is currently trading.",
    "TriState Capital Holdings (NASDAQ: TSC) is a bank holding company that provides commercial banking, private banking and investment services to middle-market companies, institutions and high net worth individuals.",
    "TSC has lost about 20% of its value over the past three months due to fears over an inverted yield curve and a possible recession.",
    "James Getz is the chairman, CEO and president of TriState. He must believe that the stock will eventually rally because he just bought 25,000 shares for $19.41 per share. Nothing says confidence like an almost $500,000 investment .",
    "Wall Street agrees with Getz. Five firms follow it. The average rating is \"overweight\" while the average target price is $25.50, about 25% higher than current levels.",
    "East West Bancorp (NASDAQ: EWBC ) is a bank holding company that provides financial services. After East West reported its Q2 2019 earnings, the stock dropped by almost 30%.",
    "As a result of this selloff, there has been significant insider buying. These insiders must believe that the earnings release wasn't as bad as the sellers thought.",
    "CFO Irene Oh just purchased 6,400 shares at $39.10, a $250,000 investment. Paul Krause is the executive vice president. He made a similar size investment when he paid $39.19 for 6,400 shares. And CEO Dominic Ng just invested $600,000 on Aug. 27 when he bought 15,800 shares at $38.01. On Aug. 28 and Aug. 29, Ng made investments bought another 10,040 shares.",
    "Community Health Systems (NYSE: CYH ) engages in the management and operation of hospitals.",
    "CYH stock has lost over 50% of its value since this past March. This could be because shareholders are disappointed after the company reported a loss of $1.47 a share in its most recent quarter.",
    "Wayne Smith is the CEO and chairman of Community Health. Has must believe that the selloff is almost done because he just invested over $2 million into the stock at an average price of $1.99.",
    "In early August, Community Health's Executive Vice President and General Counsel Ben Fordham made a $57,000 investment when he paid $2.29 for 25,000 shares. Even more recently, on Aug. 27, Fordham purchased another 25,000 shares at $1.85 per share.",
    "The post 7 Stocks the Insiders Are Buying on Sale appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:08:23"
}