{
  "url": "https://www.nasdaq.com/article/interesting-etfc-put-and-call-options-for-october-11th-cm1206771",
  "title": "Interesting ETFC Put And Call Options For October 11th - Nasdaq.com",
  "text": [
    "Investors in Etrade Financial Corporation (Symbol: ETFC) saw new options become available today, for the October 11th expiration. At Stock Options Channel  , our YieldBoost formula has looked up and down the ETFC options chain for the new October 11th contracts and identified one put and one call contract of particular interest.    The put contract at the $40.00 strike price has a current bid of $1.18. If an investor was to sell-to-open that put contract, they are committing to purchase the stock at $40.00, but will also collect the premium, putting the cost basis of the shares at $38.82 (before broker commissions). To an investor already interested in purchasing shares of ETFC, that could represent an attractive alternative to paying $40.98/share today. Because the $40.00 strike represents an approximate 2% discount to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the put contract would expire worthless. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 62%. Stock Options Channel will track those odds over time to see how they change, publishing a chart of those numbers on our website under the contract detail page for this contract  . Should the contract expire worthless, the premium would represent a 2.95% return on the cash commitment, or 28.34% annualized - at Stock Options Channel we call this the YieldBoost  .  makeArticleAd();  Below is a chart showing the trailing twelve month trading history for Etrade Financial Corporation, and highlighting in green where the $40.00 strike is located relative to that history:       Turning to the calls side of the option chain, the call contract at the $41.50 strike price has a current bid of $1.43. If an investor was to purchase shares of ETFC stock at the current price level of $40.98/share, and then sell-to-open that call contract as a \"covered call,\" they are committing to sell the stock at $41.50. Considering the call seller will also collect the premium, that would drive a total return (excluding dividends, if any) of 4.76% if the stock gets called away at the October 11th expiration (before broker commissions). Of course, a lot of upside could potentially be left on the table if ETFC shares really soar, which is why looking at the trailing twelve month trading history for Etrade Financial Corporation, as well as studying the business fundamentals becomes important. Below is a chart showing ETFC's trailing twelve month trading history, with the $41.50 strike highlighted in red:    Considering the fact that the $41.50 strike represents an approximate 1% premium to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the covered call contract would expire worthless, in which case the investor would keep both their shares of stock and the premium collected. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 53%. On our website under the contract detail page for this contract  , Stock Options Channel will track those odds over time to see how they change and publish a chart of those numbers (the trading history of the option contract will also be charted). Should the covered call contract expire worthless, the premium would represent a 3.49% boost of extra return to the investor, or 33.52% annualized, which we refer to as the YieldBoost  .    The implied volatility in the put contract example is 32%, while the implied volatility in the call contract example is 31%.    Meanwhile, we calculate the actual trailing twelve month volatility (considering the last 250 trading day closing values as well as today's price of $40.98) to be 29%. For more put and call options contract ideas worth looking at, visit StockOptionsChannel.com.   Top YieldBoost Calls of Stocks Analysts Like   »  ",
    "Because the $40.00 strike represents an approximate 2% discount to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the put contract would expire worthless. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 62%. Stock Options Channel will track those odds over time to see how they change, publishing a chart of those numbers on our website under the contract detail page for this contract  . Should the contract expire worthless, the premium would represent a 2.95% return on the cash commitment, or 28.34% annualized - at Stock Options Channel we call this the YieldBoost  .",
    "Considering the fact that the $41.50 strike represents an approximate 1% premium to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the covered call contract would expire worthless, in which case the investor would keep both their shares of stock and the premium collected. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 53%. On our website under the contract detail page for this contract  , Stock Options Channel will track those odds over time to see how they change and publish a chart of those numbers (the trading history of the option contract will also be charted). Should the covered call contract expire worthless, the premium would represent a 3.49% boost of extra return to the investor, or 33.52% annualized, which we refer to as the YieldBoost  .",
    "  Top YieldBoost Calls of Stocks Analysts Like   » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:32:55"
}