{
  "url": "https://www.nasdaq.com/article/brookfield-infrastructure-partners-patience-continues-to-pay-dividends-cm1206893",
  "title": "Brookfield Infrastructure Partners' Patience Continues to Pay Dividends - Nasdaq.com",
  "text": [
    "Brookfield Infrastructure Partners (NYSE: BIP) is a value investor at heart. Because of that, the company won't invest in an opportunity unless it meets its strict criteria, even if it's in a market segment that Brookfield's specifically targeting. In recent years, for example, the company has publicly stated that it wanted to make acquisitions in Mexico as well as in the Indian telecom tower sector. It had opportunities in both areas in the past but chose to walk away because the returns didn't meet its high bar.",
    "Instead of compromising on returns, Brookfield remained patient. That approach has paid off as it recently announced deals in both regions. CEO Sam Pollock discussed why the company was finally able to make these long-awaited moves on the second-quarter conference call .",
    "Image source: Getty Images.",
    "Pollock stated on the call:",
    "A number of you will know that we opened an office in Mexico in 2015 with the intention of establishing a local presence in the country, consistent with the approach we've done in many other places. Up until now, we've not seen opportunities to acquire assets at appropriate risk-adjusted returns. We went to Mexico as we view it as a very business-friendly country with good market fundamentals, and we see the value of investing in the country over the long term.",
    "The company highlighted Mexico in early 2017. That was because President Trump's threats to reduce trade between the U.S. and Mexico had created a lot of uncertainty. Brookfield thought this situation would allow it to make value-based acquisitions. Those opportunities, however, failed to materialize. Pollock later noted the cause as \"probably a little bit of a disparity between views on valuations between buyers and sellers.\"",
    "While it took much longer than expected, that disparity has finally narrowed because \"institutional interest [in the Mexican market] has moderated somewhat\" in recent months, according to Pollock. \"This created an opportunity for us to enter the market and acquire a low-risk, high-quality asset within our target return range.\" In this particular deal, the company bought a recently built pipeline that transports natural gas from the U.S. to Mexico. Pollock noted that \"the business is very attractive as the pipelines generate stable and predictable cash flows without volume or commodity price risk.\" That makes it an excellent fit for Brookfield since it will enhance the long-term sustainability of the company's high-yield dividend.",
    "Pollock then turned his attention to another recent transaction. He stated that \"you also may be aware that we've been monitoring opportunities in the telecom market in India for the past several years.\" The company had a deal in place in 2017 to invest in a portfolio of 40,000 towers. However, it was conditional on the merger of two telecom companies, which didn't proceed as planned.",
    "The Indian telecom market, however, has since consolidated and stabilized. Because of that, Brookfield was recently able to acquire a portfolio of 130,000 towers. Pollock noted that this business \"generates stable and predictable cash flows that will benefit from expected increases in data usage.\" That's why he believes \"this is a great opportunity to penetrate a high-growth market at our target returns.\"",
    "Image source: Getty Images.",
    "Mexico and the Indian telecom tower sector aren't the only two areas where the company has been patiently waiting for the right opportunity. It's also on the lookout for deals in the water infrastructure and airport segments.",
    "While Brookfield did make a small deal for a water irrigation system in Peru in 2017, it wants to make a much bigger splash in the sector. It's looking for opportunities in water supply, transportation, and recycling. At some point the right deal will likely emerge, especially given the vastness of the market potential. According to one estimate, the shortfall between government investment in water infrastructure and the global need is a staggering $6.7 trillion by 2050.",
    "Brookfield is also looking for a deal to diversify its transportation infrastructure business to include operating airports. The company had an agreement in place in 2015 to acquire a company that had the right to operate an airport in Brazil, but it fell apart. As a result, Brookfield is still waiting for the right opportunity. Pollock noted on the second-quarter call that the company is actively monitoring the airport sector in India, which it thinks \"is a very attractive sector.\" Because of that, \"if something came along there, I think that's something we'd look at.\"",
    "By sticking to its strict return criteria, Brookfield can make deals that move the needle. Its recent slate of acquisitions, for example, will help boost its cash flow per unit by 20% from where it was a year ago. That outsized growth rate is increasing the long-term sustainability of the company's 4.3%-yielding dividend while giving it the fuel to grow that payout at a faster pace in the future.",
    "10 stocks we like better than Brookfield Infrastructure Partners\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Brookfield Infrastructure Partners wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Matthew DiLallo owns shares of Brookfield Infrastructure Partners. The Motley Fool recommends Brookfield Infrastructure Partners. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:32:00"
}