{
  "url": "https://www.nasdaq.com/article/bank-of-canada-says-economy-resilient-gives-no-clue-on-rate-cuts-20190905-00816",
  "title": "Bank of Canada says economy resilient, gives no clue on rate cuts - Nasdaq.com",
  "text": [
    "By Kelsey Johnson",
    "OTTAWA, Sept 5 (Reuters) - The Canadian economy is showing \"a welcome degree of resilience\" to negative shocks, a senior Bank of Canada official said on Thursday, giving little indication as to whether an interest rate cut might be imminent.",
    "Bank of Canada Deputy Governor Lawrence Schembri made his comments a day after the central bank held its key rate steady at a time when the U.S Federal Reserve and other institutions have eased borrowing costs.",
    "\"This solid starting point means the economy has a welcome degree of resilience to possible negative economic developments,\" he told a business audience in Halifax, Nova Scotia.",
    "Market analysts had been looking for clues about the bank's thinking on a possible rate cut on Oct. 30, the next scheduled announcement date.",
    "After he spoke, market expectations of a cut on Oct. 30, as reflected in the overnight index swaps markets, fell to 39.6% from around 50%. ",
    "A Reuters poll released last week found economists were divided on whether the bank would cut rates this year or hold off until early 2020.",
    "\"Schembri chose to keep the cards close to his chest,\" said Avery Shenfeld, chief economist at CIBC Capital Markets.",
    "\"Nothing in here to stand in the way of a fourth quarter cut (which the market is pricing in, and the speech doesn't directly try to refute), but also no hint that October has better odds than December,\" he said in a note to clients.",
    "Canada's central bank has shown no appetite for cutting rates amid steady domestic activity, choosing to sit on the sidelines since last October.",
    "The country is on the brink of a national election campaign, a period during which the central bank traditionally stays quiet. Canadians go to the polls on Oct 21.",
    "While the escalating trade war between the United States and China remains the biggest downside risk to the trade-dependent Canadian economy, Schembri said, Canadian inflation remains around its 2% target.",
    "On Thursday, Schembri said Canada's central bank will continue to \"conduct monetary policy appropriate to our own circumstances,\" adding Canada's current overnight rate - at 1.75% - is 50 basis points lower than the U.S Federal Reserve's."
  ],
  "published_datetime": "2019-09-05 11:55:00"
}