{
  "url": "https://www.nasdaq.com/articles/validea-james-p.-oshaughnessy-strategy-daily-upgrade-report-9-14-2019-2019-09-14",
  "title": "Validea James P. O'Shaughnessy Strategy Daily Upgrade Report - 9/14/2019 | Nasdaq",
  "text": [
    "The following are today's upgrades for Validea's Growth/Value Investor model based on the published strategy of James P. O'Shaughnessy. This two strategy approach offers a large-cap value model and a growth approach that looks for persistent earnings growth and strong relative strength.",
    "NOVARTIS AG (ADR) (NVS) is a large-cap growth stock in the Major Drugs industry. The rating according to our strategy based on James P. O'Shaughnessy changed from 80% to 100% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Novartis AG is a holding company, which provides healthcare solutions. The Company is engaged in the research, development, manufacturing and marketing of a range of healthcare products led by pharmaceuticals. The Company's segments include Innovative Medicines, Sandoz, Alcon and Corporate activities. Innovative Medicines researches, develops, manufactures, distributes and sells patented prescription medicines to develop health outcomes for patients and healthcare providers. Sandoz develops, manufactures, distributes and sells prescription medicines, as well as pharmaceutical active substances that are not protected by valid and enforceable third-party patents. Alcon researches, develops, manufactures, distributes and sells eye care products. Alcon is a provider of eye care with product offerings in eye care devices and vision care. The Company's range of products includes pharmaceuticals and oncology medicines, generic and biosimilar medicines, and eye care devices.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "GIBRALTAR INDUSTRIES INC (ROCK) is a small-cap growth stock in the Constr. - Supplies & Fixtures industry. The rating according to our strategy based on James P. O'Shaughnessy changed from 75% to 100% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Gibraltar Industries, Inc. is a manufacturer and distributor of building products for industrial, transportation infrastructure, residential housing, renewable energy and resource conservation markets. The Company's segments include Residential Products; Industrial and Infrastructure Products, and Renewable Energy and Conservation. The Residential Products segment services residential housing construction and residential repair and remodeling activity with products including roof and foundation ventilation products, rain dispersion products and roof ventilation accessories. The Industrial and Infrastructure Products segment focuses on a range of markets, including industrial and commercial construction, automotive, airports and energy and power generation markets with products. The Renewable Energy and Conservation segment focuses on the design, engineering, manufacturing and installation of solar racking systems and commercial, institutional and retail greenhouse structures.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "Since its inception, Validea's strategy based on James P. O'Shaughnessy has returned 275.57% vs. 202.53% for the S&P 500. For more details on this strategy, click here",
    "About James P. O'Shaughnessy: Research guru and money manager James O'Shaughnessy forced many professional and amateur investors alike to rethink their investment beliefs when he published his 1996 bestseller, What Works on Wall Street. O'Shaughnessy back-tested 44 years of stock market data from the comprehensive Standard & Poor's Compustat database to find out which quantitative strategies have worked over the years and which haven't. To the surprise of many, he concluded that price/earnings ratios aren't the best indicator of a stock's value, and that small-company stocks, contrary to popular wisdom, don't as a group have an edge on large-company stocks. Today O'Shaughnessy is the Chief Investment Officer of O'Shaughnessy Asset Management.",
    "About Validea: Validea is an investment research service that follows the published strategies of investment legends. Validea offers both stock analysis and model portfolios based on gurus who have outperformed the market over the long-term, including Warren Buffett, Benjamin Graham, Peter Lynch and Martin Zweig. For more information about Validea, click here",
    "The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
  ],
  "published_datetime": "2019-09-14 11:00:00"
}