{
  "url": "https://www.nasdaq.com/article/forexeuro-waits-for-ecb-as-trade-thaw-spurs-yuan-rebound-20190912-00166",
  "title": "FOREX-Euro waits for ECB as trade thaw spurs yuan rebound - Nasdaq.com",
  "text": [
    "    * ECB decision due at 1145 GMT, press conference 1230 GMT",
    "* Trump's delay to scheduled tariff hike boosts markets",
    "* China's offshore yuan gains 0.5%, Aussie hits 6-wk high",
    "* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh (Writes through, adds quotes, details)",
    "By Tommy Wilkes",
    "LONDON, Sept 12 (Reuters) - The euro hovered near $1.10 onThursday as traders prepared for the European Central Bank tounveil an expected stimulus package, while China's yuan andAustralia's dollar rallied on further signs of a thaw in theU.S.-China trade war.",
    "Investors expect a rate cut at Thursday's meeting as the ECBtries to prop up the region's ailing economy. The realuncertainty is whether policymakers restart a quantitativeeasing (QE) programme after some ECB members expressed doubt inrecent weeks about the need to relaunch asset purchases. urn:newsml:reuters.com:*:nL5N2630ZT",
    "Euro/dollar overnight implied volatility has soared to itshighest since mid-2018 EURONO= , reflecting investoruncertainty about the impact of the ECB announcement on thesingle currency. ",
    "The ECB decision is scheduled for 1145 GMT, and presidentMario Draghi's press conference at 1230 GMT. The meeting is thefirst in a series of major central bank events, with the FederalReserve and the Bank of Japan meeting next week. ",
    "SEB strategist Jussi Hiljanen said he expected the ECB tocut the deposit rate by 10 basis points from the current levelof -0.4%, extend the forward guidance on rates by six months andannounce the restart of QE but with monthly purchases lower thanthe market anticipated.",
    "\"Such a package of stimulus measures would be adisappointment for the market, pushing long rates higher andEUR/USD higher and steepening the curve,\" Hiljanen said.",
    "The common currency EUR=EBS has shed 3.4% since June butwas 0.2% higher at $1.1028 on Thursday.",
    "Stephen Gallo, European Head of FX Strategy at BMO CapitalMarkets, said that if the ECB prepares the market forsignificant rate cuts ahead, \"that would be quite dovish, quitebearish\" for the euro.",
    "However, he said the reaction would be contained as traderswere reluctant to take positions on the dollar before nextweek's Fed meeting.",
    "The dollar was slightly lower against a basket of currenciesat 98.528 .DXY .",
    "RISK RALLY",
    "After a difficult August in which concerns about a globalrecession sparked a scramble into safer assets, markets haverallied this month, encouraged by easing trade tensions and byreceding fears of a no-deal Brexit.",
    "China on Wednesday exempted a basket of U.S. goods from itstariffs, while U.S. President Donald Trump said in a tweet hewould delay a scheduled tariff hike by two weeks in October. urn:newsml:reuters.com:*:nL3N2621DV",
    "Export-driven currencies across Asia strengthened, as didmost emerging market currencies .MIEM00000CUS .",
    "The Aussie hit a six-week high of $0.6887AUD=D3 and theoffshore Chinese yuan rose 0.5% CNH=EBS to a three-week highof 7.0737 per dollar. urn:newsml:reuters.com:*:nL3N2631KO",
    "The Japanese yen, the go-to safe haven currency for fearfulinvestors, fell to a six-week low against the dollar. The yenbreached the 108 mark in Asian trade and was last at 107.86 yenper dollar JPY=EBS . It had hit a seven-month high of 104.46last month.",
    "Sterling was little changed GBP=D3EURGBP=D3 . The poundrocketed to a six-week high against the dollar on Monday asinvestors welcomed the British parliament's move to block ano-deal Brexit on Oct. 31. ",
    "Despite the more positive mood in risk assets this week,analysts expressed caution about its sustainability. urn:newsml:reuters.com:*:nL5N2631XG",
    "\"The bigger picture is one of a very tense geopoliticalenvironment that is unlikely to be rectified quickly,\" BMO'sGallo said.",
    "\n<^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\nChina's offshore yuan vs dollar   https://tmsnrt.rs/2AbkJJF\n    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^> (Editing by Hugh Lawson and Gareth Jones) ((thomas.wilkes@thomsonreuters.com))"
  ],
  "published_datetime": "2019-09-12 05:45:00"
}