{
  "url": "https://www.nasdaq.com/article/unitedhealth-group-unh-stock-sinks-as-market-gains-what-you-should-know-cm1207614",
  "title": "UnitedHealth Group (UNH) Stock Sinks As Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " In the latest trading session, UnitedHealth Group (UNH) closed at $226.79, marking a -1.66% move from the previous day. This change lagged the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%. Coming into today, shares of the largest U.S. health insurer had lost 7.11% in the past month. In that same time, the Medical sector lost 1.27%, while the S&P 500 lost 0.68%. UNH will be looking to display strength as it nears its nex t earnings  release. The company is expected to report EPS of $3.77, up 10.56% from the prior-year quarter. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $59.96 billion, up 6.02% from the year-ago period. For the full year, our Zacks Consensus Estimates are projecting earnings of $14.81 per share and revenue of $242.45 billion, which would represent changes of +14.98% and +7.16%, respectively, from the prior year. It is also important to note the recent changes to analyst estimates for UNH. Recent revisions tend to reflect the latest near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection remained stagnant. UNH currently has a Zacks Rank of #3 (Hold). In terms of valuation, UNH is currently trading at a Forward P/E ratio of 15.57. For comparison, its industry has an average Forward P/E of 15.15, which means UNH is trading at a premium to the group. It is also worth noting that UNH currently has a PEG ratio of 1.23. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. UNH's industry had an average PEG ratio of 1.06 as of yesterday's close. The Medical - HMOs industry is part of the Medical sector. This industry currently has a Zacks Industry Rank of 65, which puts it in the top 26% of all 250+ industries. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Be sure to follow all of these stock-moving metrics, and many more, on Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  UnitedHealth Group Incorporated (UNH): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "In the latest trading session, UnitedHealth Group (UNH) closed at $226.79, marking a -1.66% move from the previous day. This change lagged the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%.",
    "Coming into today, shares of the largest U.S. health insurer had lost 7.11% in the past month. In that same time, the Medical sector lost 1.27%, while the S&P 500 lost 0.68%.",
    "UNH will be looking to display strength as it nears its nex t earnings  release. The company is expected to report EPS of $3.77, up 10.56% from the prior-year quarter. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $59.96 billion, up 6.02% from the year-ago period.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of $14.81 per share and revenue of $242.45 billion, which would represent changes of +14.98% and +7.16%, respectively, from the prior year.",
    "It is also important to note the recent changes to analyst estimates for UNH. Recent revisions tend to reflect the latest near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection remained stagnant. UNH currently has a Zacks Rank of #3 (Hold).",
    "In terms of valuation, UNH is currently trading at a Forward P/E ratio of 15.57. For comparison, its industry has an average Forward P/E of 15.15, which means UNH is trading at a premium to the group.",
    "It is also worth noting that UNH currently has a PEG ratio of 1.23. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. UNH's industry had an average PEG ratio of 1.06 as of yesterday's close.",
    "The Medical - HMOs industry is part of the Medical sector. This industry currently has a Zacks Industry Rank of 65, which puts it in the top 26% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Be sure to follow all of these stock-moving metrics, and many more, on Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:45:26"
}