{
  "url": "https://www.nasdaq.com/article/what-in-the-world-is-going-on-cm1210715",
  "title": "What in the WORLD is going on? - Nasdaq.com",
  "text": [
    "   The Trade continues to chug along with positive sentiment coming from china this week. Is there a solution in sight? John Blank joins us to discuss the possible solutions and what the U.S. and China should be doing. He touches on problems such as intellectual property, trade deficit and the idea of ending tariffs all together. We then dive head first into the stock market asking the most important question. Is the current tensions creating investment opportunities? We break down our portfolios and in particular, Disney (DIS) and its recent run up. To get recent Zacks video updates, be sure to subscribe to our Youtube channel and participate by leaving any comments or questions Finally, take a look at what John Blank wrote about the trade war  recently.  Looking for Stocks with Skyrocketing Upside?  makeArticleAd();  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.          Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.       See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   The Walt Disney Company (DIS): Free Stock Analysis Report   Square, Inc. (SQ): Free Stock Analysis Report   AT&T Inc. (T): Free Stock Analysis Report   ProShares S&P 500 Dividend Aristocrats ETF (NOBL): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "The Trade continues to chug along with positive sentiment coming from china this week. Is there a solution in sight? John Blank joins us to discuss the possible solutions and what the U.S. and China should be doing. He touches on problems such as intellectual property, trade deficit and the idea of ending tariffs all together. We then dive head first into the stock market asking the most important question. Is the current tensions creating investment opportunities? We break down our portfolios and in particular, Disney (DIS) and its recent run up. To get recent Zacks video updates, be sure to subscribe to our Youtube channel and participate by leaving any comments or questions",
    "Finally, take a look at what John Blank wrote about the trade war  recently.",
    " Looking for Stocks with Skyrocketing Upside?  makeArticleAd();  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.          Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.       See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:33:00"
}