{
  "url": "https://www.nasdaq.com/article/advanced-micro-devices-amd-stock-sinks-as-market-gains-what-you-should-know-cm1210787",
  "title": "Advanced Micro Devices (AMD) Stock Sinks As Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Advanced Micro Devices (AMD) closed the most recent trading day at $29.76, moving -1.55% from the previous trading session. This change lagged the S&P 500's 0.72% gain on the day. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%. Heading into today, shares of the chipmaker had lost 5.85% over the past month, lagging the Computer and Technology sector's gain of 2.17% and the S&P 500's gain of 2.25% in that time. Investors will be hoping for strength from AMD as it approaches its nex t earnings  release. The company is expected to report EPS of $0.18, up 38.46% from the prior-year quarter. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $1.80 billion, up 9.08% from the year-ago period. AMD's full-year Zacks Consensus Estimates are calling for earnings of $0.63 per share and revenue of $6.76 billion. These results would represent year-over-year changes of +36.96% and +4.43%, respectively. Investors should also note any recent changes to analyst estimates for AMD. Recent revisions tend to reflect the latest near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook. Our research shows that these estimate changes are directly correlated with near-term stock prices. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.34% lower within the past month. AMD is holding a Zacks Rank of #3 (Hold) right now. Looking at its valuation, AMD is holding a Forward P/E ratio of 48.11. This represents a premium compared to its industry's average Forward P/E of 19.84. Also, we should mention that AMD has a PEG ratio of 2.04. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. Electronics - Semiconductors stocks are, on average, holding a PEG ratio of 2.04 based on yesterday's closing prices. The Electronics - Semiconductors industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 99, which puts it in the top 39% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. You can find more information on all of these metrics, and much more, on Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Advanced Micro Devices, Inc. (AMD): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Advanced Micro Devices (AMD) closed the most recent trading day at $29.76, moving -1.55% from the previous trading session. This change lagged the S&P 500's 0.72% gain on the day. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%.",
    "Heading into today, shares of the chipmaker had lost 5.85% over the past month, lagging the Computer and Technology sector's gain of 2.17% and the S&P 500's gain of 2.25% in that time.",
    "Investors will be hoping for strength from AMD as it approaches its nex t earnings  release. The company is expected to report EPS of $0.18, up 38.46% from the prior-year quarter. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $1.80 billion, up 9.08% from the year-ago period.",
    "AMD's full-year Zacks Consensus Estimates are calling for earnings of $0.63 per share and revenue of $6.76 billion. These results would represent year-over-year changes of +36.96% and +4.43%, respectively.",
    "Investors should also note any recent changes to analyst estimates for AMD. Recent revisions tend to reflect the latest near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.",
    "Our research shows that these estimate changes are directly correlated with near-term stock prices. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.34% lower within the past month. AMD is holding a Zacks Rank of #3 (Hold) right now.",
    "Looking at its valuation, AMD is holding a Forward P/E ratio of 48.11. This represents a premium compared to its industry's average Forward P/E of 19.84.",
    "Also, we should mention that AMD has a PEG ratio of 2.04. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. Electronics - Semiconductors stocks are, on average, holding a PEG ratio of 2.04 based on yesterday's closing prices.",
    "The Electronics - Semiconductors industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 99, which puts it in the top 39% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "You can find more information on all of these metrics, and much more, on Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:45:29"
}