{
  "url": "https://www.nasdaq.com/article/why-growth-remains-valuable-cm1210372",
  "title": "Why growth remains valuable - Nasdaq.com",
  "text": [
    "   People will always prize what is scarce. Given an increasingly erratic trade dispute, low to negative interest rates and softening economic growth, investors are justifiably putting a premium on hedges, yield and earnings growth. The latter dynamic helps explains why, despite a relatively high premium, growth stocks continue to beat value. To the extent economic  growth is unlikely to quickly rebound, this trend is likely to continue. I last wrote about growth and value in early June  . During the past three months, U.S. growth out-performance has continued, with growth up 7% versus less than 3% for value. As discussed in June, growth continues to benefit from an environment of decelerating growth. For example, in June I highlighted the implications of the flattening yield curve, a trend that has only intensified. Since then other indicators have only reinforced the impression of an economic slowdown. Most recently, the U.S.'s main manufacturing gauge fell to multi-year lows, suggesting that the manufacturing sector may already be in a contraction.  Relative value elevated, not insane   The counter-argument to continued growth out-performance: a rich valuation premium. While this is a fair point, it is not the full story. Consider the following: 1. Value/growth differentials are well within their historical range.  While today's premium of growth over value is elevated, it is not indicative of an extreme event like the tech bubble (see Chart 1). As of the end of August, the Russell 1000 Growth Index was trading at a 70% premium to value. While the current premium is high by post-crisis standards, it is not even in the same zip code as 20 years ago. At its peak in 2000, the P/E on the Russell 1000 Growth Index was 350%  of the value P/E. 2. Slowing growth justifies a higher premium.  Today's premium is about what you'd expect given the economic landscape. As I highlighted a few months ago, growth's premium expands as economic expectations diminish. This relationship is well captured by the U.S. Treasury curve, which explains roughly 50% of the ratio in multiples. With the 10-2 Treasury Curve near inversion, i.e. 2-year yields equal to 10-year yields, today's premium looks about right. 3. Secular trends favor growth industries.  The global economy is increasingly dominated by several secular trends: low but stable growth and inflation, the rise of the \"cap-light\" business model, a secular shift in consumption away from goods and towards services, and unprecedented economies of scale for select technology platforms. All these trends favor growth stocks.     Bottom line   The bottom line is not that value will never outperform again. A sharp cyclical upturn, as we experienced in late 2016, could lead to a strong period for value. That said, the tailwinds continue to favor growth, which is why investors should expect to pay a premium for it.   Russ Koesterich   , CFA, is a Portfolio Manager for  BlackRock's Global Allocation  Fund and is a regular contributor to   The     Blog   .  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:11:17"
}