{
  "url": "https://www.nasdaq.com/article/target-has-a-plan-to-stop-tariffs-from-impacting-prices-cm1206792",
  "title": "Target Has a Plan to Stop Tariffs From Impacting Prices - Nasdaq.com",
  "text": [
    "Despite what President Donald Trump has repeatedly said, tariffs are paid by the company importing goods, not the country where they were made. That generally raises the costs of the items being imported, an increase which normally gets passed on to consumers.",
    "In some cases, however, the added cost can be partially, or even fully, absorbed by the vendor or retailer importing the goods. And Target (NYSE: TGT) has made it clear in a letter to vendors that it expects them to absorb the cost of the tariffs.",
    "\"As we look forward, Target will continue to keep guests at the heart of our strategy and continue to rely on your help and cooperation as tariff changes continue and uncertainty remains,\" wrote Target Chief Merchandising Officer Mark Tritton. \"Target will not accept any new cost increases related to tariffs on goods imported from China. Our expectation is that you will develop the appropriate contingency plans so that we don't have to pass price increases along to our guests.\"",
    "Target wants its vendors to absorb any tariffs. Image source: Target.",
    "Tritton's letter acknowledged that many of its vendors sell items that will be impacted by the increased tariffs, some of which went into effect on Sept. 1 (others will take effect on Dec. 15). The first round will impact footwear, apparel, certain technology items, and other goods, while the second round will affect laptops and cellphones.",
    "Target expects its vendors to either find alternative sources for the goods they sell the company, or simply eat the cost of the tariffs on goods imported from China . That's a big ask from the chain, which essentially makes it clear that it's not going to raise its prices or lower its own margins.",
    "This puts vendors in a very challenging position. Some may be able to find alternative sourcing for goods, but others will have to choose between telling Target no -- and possibly losing the retailer as a customer -- or continuing to sell to the chain at a lower margin, or perhaps even a loss.",
    "Target and its vendors have likely taken some steps to source goods from countries other than China. The problem is that factories can't be built quickly, and it's impossible to fully pivot away from the country without paying more to buy the items elsewhere (which causes the same problems tariffs do).",
    "The National Retail Federation (NRF) has been very clear in its opposition to the tariffs, calling them a tax on Americans. NRF Senior Vice President for Government Relations released a statement that alludes to the dilemma Target's vendors face.",
    "\"It's impossible for businesses to plan for the future in this type of environment. The administration's approach clearly isn't working, and the answer isn't more taxes on American businesses and consumers. Where does this end?\" he said.",
    "Target has significant leverage over many of its vendors. Some will likely balk at eating the added cost, but others will have no choice but to comply. It's really a question of whether they want to choke to death quickly by walking away from a huge customer, or starve to death by making less money.",
    "At some point, the American consumer will pay these tariffs. Target may be able to force many vendors' hands for a while, but eventually businesses need to make money to survive, and many won't be able to take on the increased cost.",
    "10 stocks we like better than Target\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Target wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Daniel B. Kline has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 07:34:00"
}