{
  "url": "https://www.nasdaq.com/article/german-firm-suspected-of-selling-spyware-to-turkey--media-investigation-20190905-00249",
  "title": "German firm suspected of selling spyware to Turkey - media investigation - Nasdaq.com",
  "text": [
    "BERLIN, Sept 5 (Reuters) - German prosecutors are investigating a Bavarian company suspected of supplying software to Turkey allowing authorities to spy on opposition activists via their phones, an investigative media consortium reported on Thursday.",
    "The Munich investigators suspect FinFisher illegally exported the equipment, said the outlets, an alliance of broadcasters and the Sueddeutsche Zeitung newspaper.",
    "Ties between the two NATO allies are already fraught.",
    "There was no immediate reply to requests for comment from FinFisher by email and telephone. Nor was there immediate comment from prosecutors, the German government or Turkey.",
    "The software, named Finspy, was allegedly deployed on phones of activists in a 2017 protest against mass arrests by President Tayyip Erdogan's government in response to a failed coup, the German media said.",
    "It allowed authorities to access the address books and photo and video stores of the phones, the consortium said.",
    "In 2018, when the allegations first surfaced in the same media group, the German Economics Ministry said it had not issued a licence to export the software.",
    "The media outlets said they had seen a deposition from several activist groups, including Reporters without Borders and the European Center for Constitutional and Human Rights, containing an analysis of the software's source code that they said suggested it was provided by the German company.",
    "The deposition named five directors of the company and further unspecified employees, they reported.",
    "In a statement, the NGO groups said they had filed criminal complaints against company officials for exporting the software without a licence. They said the spyware had been planted on a \"fake version\" of a Turkish opposition website.",
    "\"It is outrageous and unacceptable to see German spyware being used against journalists and opposition voices in Turkey,\" said Christian Mihr, executive director of Reporters Without Borders Germany."
  ],
  "published_datetime": "2019-09-05 06:29:00"
}