{
  "url": "https://www.nasdaq.com/article/consumer-sector-update-for-09112019-mdprhplay-cm1210631",
  "title": "Consumer Sector Update for 09/11/2019: MDP,RH,PLAY - Nasdaq.com",
  "text": [
    "Top Consumer Stocks",
    "WMT +0.31%",
    "MCD +0.05%",
    "DIS -0.16%",
    "CVS +0.12%",
    "KO +0.55%",
    "Consumer stocks were trading higher in afternoon trade, with shares of consumer staples companies in the S&P 500 climbing about 0.1% while the shares of consumer discretionary firms in the S&P 500 also were posting a slightly more than 0.3% gain.",
    "Among consumer stocks moving on news:",
    "(+) Meredith Corp ( MDP  ) climbed 8%. A new regulatory filing showed CEO Thomas Harty Monday bought 12,000 shares of the magazine publisher's common stock at $35.02 apiece, increasing his direct stake to 46,455 shares. He also indirectly controls another 10,888 shares through a managed account.",
    "In other sector news:",
    "(+) RH ( RH  ) rose over 6% on Wednesday after the specialty retailer crushed Wall Street expectations with Q2 financial results and raised its FY20 outlook, prompting analysts at least eight firms to increase their respective price targets for the company's stock. RH is now projecting adjusted net income this year in a range of $10.53 to $10.76 per share, up from its prior call looking for a $9.08 to $9.52 per share non-GAAP profit and straddling the Capital IQ consensus expecting $10.68 per share for the 12 months ending Jan. 31.",
    "(-) Dave & Buster's ( PLAY  ) slipped 6% after the restaurant chain lowered its FY20 sales outlook to $1.34 billion to $1.36 billion for the 12 months ending Jan. 31. The Street is at $1.36 billion, according to Capital IQ.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-11 01:36:48"
}