{
  "url": "https://www.nasdaq.com/article/mugabes-body-brought-home-but-zimbabweans-unsure-of-his-burial-place-20190911-00681",
  "title": "Mugabe's body brought home but Zimbabweans unsure of his burial place - Nasdaq.com",
  "text": [
    "By MacDonald Dzirutwe and Alexander Winning",
    "HARARE, Sept 11 (Reuters) - The body of Zimbabwe's founder Robert Mugabe arrived home at the country's main airport on Wednesday, but it was still unclear where he would be buried amid a dispute between some family members and the government.",
    "Mugabe, one of the last \"Big Men\" of African politics,  ruled Zimbabwe for 37 years until he was ousted by his own army in November 2017. He died in a Singapore hospital five days ago aged 95.",
    "The former president's body arrived at Harare'sRobert Gabriel Mugabe International Airport shortly after 1330 GMT. A military guard of honour stood at attention as the casket was removed from the aircraft, draped in the national flag and accompanied by security chiefs.",
    "\"The entire nation of Zimbabwe, our people, across the board are grieved and are in mourning because the light which led us to independence is no more, but his works, his ideology will continue to guide this nation,\" Mnangagwa said.",
    "\"On the day we shall lay him to rest, on Sunday, I appeal to you in your hundreds, in your thousands, in your millions to show your love of our great leader who has left us,\" he added, without saying where Mugabe would be buried.",
    "Mugabe's wife Grace, dressed in black and wearing a veil, was next to Mnangagwa at the airport. As she left the tarmac in a vehicle behind the hearse, Grace could be seen wiping away tears and being consoled by one of her sisters.",
    "Also present were Mugabe's daughter Bona and son Bellarmine and Savior Kasukuwere, a former Mugabe cabinet minister and staunch ally who has been living in self-imposed exile in South Africa since early this year.",
    "Vice President Constantino Chiwenga, the former general who led the coup that overthrew Mugabe, was notably absent at the airport. He has been receiving treatment in China since July for an unknown illness.",
    "Crowds had gathered at the airport well before the scheduled arrival time, with some wearing T-shirts bearing Mugabe's face and others with Mnangagwa's image, while music blared from loudspeakers.",
    "A convoy of vehicles with number plates bearing the letters \"RG Mugabe\" and the former leader's signature were also on the runway.",
    "BLUE ROOF",
    "Leo Mugabe, a nephew and family spokesman, declined to say where Mugabe would be buried.",
    "Mnangagwa and his party want him buried at a national monument to heroes of the liberation war against the white minority Rhodesian regime.",
    "But some of Mugabe's relatives have pushed back against that plan. They share Mugabe's bitterness at the way former allies including Mnangagwa conspired to topple him and want him buried in his home village.",
    "Sunday's burial will take place a day after a state funeral, but officials said the burial site would only be known after consultations with the family.",
    "The body was taken to Mugabe's palatial home in the capital, known as Blue Roof, after an earlier detour to an army barrack for prayers by the military.",
    "Soldiers held the coffin aloft as they carried it up the steps to the house. Grace Mugabe walked behind the coffin, wailing.",
    "Musicians sang songs and beat drums as family members and associates filed into the ornate pagoda-style main building. Flowers arranged in the shape of the word \"Gushungo\", Mugabe's clan name, decorated the steps of the building.",
    "Hundreds of well-wishers sat in a marquee on a lawn in front of the house, waiting to pay their respects.",
    "On Thursday, ordinary Zimbabweans and supporters are expected to pay their last respects to Mugabe at a Harare soccer stadium, where the body will lie in state before being taken to his rural home in Kutama, 85 kilometres (50 miles) from the capital.",
    "Mugabe left behind an economy wrecked by hyperinflation and deeply entrenched corruption, and a raging political rivalry between ZANU-PF and the opposition MDC.",
    "The MDC said on Wednesday it had postponed its 20th anniversary rally because of Mugabe's funeral.",
    "\"Notwithstanding our legendary differences with Mr. Mugabe, we have no reason to exhibit barbarity by hosting a national festivity during his funeral,\" it said in a statement."
  ],
  "published_datetime": "2019-09-11 09:38:00"
}