{
  "url": "https://www.nasdaq.com/article/heres-why-you-should-hold-on-to-hill-rom-hrc-stock-now-cm1207201",
  "title": "Here's Why You Should Hold on to Hill-Rom (HRC) Stock Now - Nasdaq.com",
  "text": [
    "  Hill-Rom Holdings, Inc  . HRC  has been progressing steadily on the back of strategic acquisitions and a diverse product portfolio. The company has a market cap of $7.19 billion. It has an expected earnings growth rate of 10% for the next five years. In the past year, the company's shares have outperformed its industry. The stock has gained 10.5% compared with the  industry  's growth of 1.9% .  Riding on solid prospects, this Zacks Rank #3 (Hold) stock is worth retaining for now.  What's Favoring the Stock?    Strategic Acquisitions:    Hill-Rom has been proactively pursuing acquisitions to accelerate growth across five key clinical focus areas - advancing patient mobility, wound care and prevention, surgical, safety and efficiency, clinical workflow solutions as well as respiratory help. The company continues to gain from the acquisition of Voalte. In August 2019, the company announced the buyout of Breath Technologies, a developer and manufacturer of a patented nasal cannula technology that enables improved patient mobility. The takeover of Breath Technologies' differentiated and disruptive respiratory therapy enables it to leverage Hill-Rom's vertically-integrated commercial model.        Impressive Product Portfolio   : Of late, the company has been focusing on expansion through product development as reflected in higher research and development expenditure. The contribution from new products like Centrella, the Connex Vital Signs Spot Monitor and the Monarch Airway Clearance System has added approximately 300-basis points growth during the third quarter. In the third quarter, the company launched several products viz EarlySense, WATCHCARE and the RetinaVue 700 Imager to sustain momentum.   Progress in Digital Health Space   : Hill-Rom recently launched a smartphone application - Linq mobile. Per the company, the platform has integrated Clinical Workflows with Nurse Call and clinical surveillance with monitoring systems to enhance team communication as well as efficiency. In line with its strategy to boost position in the Digital Health space, Hill-Rom recently partnered with Microsoft. The alliance will converge Hill-Rom's extensive clinical knowledge as well as streaming operational data from medical devices with Microsoft's cloud that include Azure IoT and Azure Machine Learning.  Downsides:  However, there are some factors that have been deterring the stock's growth.   Macroeconomic Headwind May Hamper Growth   : In the past several years, the credit and capital markets have experienced extreme volatility and disruption. These factors have led to recessionary conditions and lowered levels of consumer as well as commercial spending. Phases of recessions have compelled customers to reduce or delay plans to purchase Hill-Rom's products and services, which led to a slowdown in the company's market growth rate.   Tough Competitive Landscape   : The presence of a large number of players like ArjoHuntleigh (Division of Getinge AB), Universal Hospital Services, Inc, Stryker Corporation, GE Healthcare and Philips has intensified competition in the medical devices market.  Which Way Are Estimates Heading?  For the fourth quarter of fiscal 2019, the Zacks Consensus Estimate for earnings is pegged at $1.65 that indicates 1.2% growth from the year-ago quarter's figure. The same for revenues stands at $760.3 million, which calls for year-over-year improvement of 0.1%. For 2019, the Zacks Consensus Estimate for earnings is pinned at $5.05, which suggests 6.3% year-over-year growth. The same for revenues is pegged at $2.88 billion that calls for 1.3% rise year over year.  Stocks Worth a Look  Some better-ranked stocks in the broader medical space are Medtronic MDT  , Baxter BAX  and Amedisys AMED  , each carrying a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   . Medtronic's long-term earnings growth rate is expected to be 7.13%. Baxter's long-term earnings growth rate is projected at 12.8%. Amedisys' long-term earnings growth rate is expected to be 16.26%.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Medtronic PLC (MDT): Free Stock Analysis Report   Hill-Rom Holdings, Inc. (HRC): Free Stock Analysis Report   Baxter International Inc. (BAX): Free Stock Analysis Report   Amedisys, Inc. (AMED): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " Hill-Rom Holdings, Inc  . HRC  has been progressing steadily on the back of strategic acquisitions and a diverse product portfolio.",
    "The company has a market cap of $7.19 billion. It has an expected earnings growth rate of 10% for the next five years.",
    "In the past year, the company's shares have outperformed its industry. The stock has gained 10.5% compared with the  industry  's growth of 1.9% . ",
    "Riding on solid prospects, this Zacks Rank #3 (Hold) stock is worth retaining for now.",
    " What's Favoring the Stock? ",
    "  Strategic Acquisitions:    Hill-Rom has been proactively pursuing acquisitions to accelerate growth across five key clinical focus areas - advancing patient mobility, wound care and prevention, surgical, safety and efficiency, clinical workflow solutions as well as respiratory help. The company continues to gain from the acquisition of Voalte. In August 2019, the company announced the buyout of Breath Technologies, a developer and manufacturer of a patented nasal cannula technology that enables improved patient mobility. The takeover of Breath Technologies' differentiated and disruptive respiratory therapy enables it to leverage Hill-Rom's vertically-integrated commercial model.",
    "  Impressive Product Portfolio   : Of late, the company has been focusing on expansion through product development as reflected in higher research and development expenditure. The contribution from new products like Centrella, the Connex Vital Signs Spot Monitor and the Monarch Airway Clearance System has added approximately 300-basis points growth during the third quarter. In the third quarter, the company launched several products viz EarlySense, WATCHCARE and the RetinaVue 700 Imager to sustain momentum.",
    "  Progress in Digital Health Space   : Hill-Rom recently launched a smartphone application - Linq mobile. Per the company, the platform has integrated Clinical Workflows with Nurse Call and clinical surveillance with monitoring systems to enhance team communication as well as efficiency. In line with its strategy to boost position in the Digital Health space, Hill-Rom recently partnered with Microsoft. The alliance will converge Hill-Rom's extensive clinical knowledge as well as streaming operational data from medical devices with Microsoft's cloud that include Azure IoT and Azure Machine Learning.",
    " Downsides: ",
    "However, there are some factors that have been deterring the stock's growth.",
    "  Macroeconomic Headwind May Hamper Growth   : In the past several years, the credit and capital markets have experienced extreme volatility and disruption. These factors have led to recessionary conditions and lowered levels of consumer as well as commercial spending. Phases of recessions have compelled customers to reduce or delay plans to purchase Hill-Rom's products and services, which led to a slowdown in the company's market growth rate.",
    "  Tough Competitive Landscape   : The presence of a large number of players like ArjoHuntleigh (Division of Getinge AB), Universal Hospital Services, Inc, Stryker Corporation, GE Healthcare and Philips has intensified competition in the medical devices market.",
    " Which Way Are Estimates Heading? ",
    "For the fourth quarter of fiscal 2019, the Zacks Consensus Estimate for earnings is pegged at $1.65 that indicates 1.2% growth from the year-ago quarter's figure. The same for revenues stands at $760.3 million, which calls for year-over-year improvement of 0.1%.",
    "For 2019, the Zacks Consensus Estimate for earnings is pinned at $5.05, which suggests 6.3% year-over-year growth. The same for revenues is pegged at $2.88 billion that calls for 1.3% rise year over year.",
    " Stocks Worth a Look ",
    "Some better-ranked stocks in the broader medical space are Medtronic MDT  , Baxter BAX  and Amedisys AMED  , each carrying a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "Medtronic's long-term earnings growth rate is expected to be 7.13%.",
    "Baxter's long-term earnings growth rate is projected at 12.8%.",
    "Amedisys' long-term earnings growth rate is expected to be 16.26%.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:18:00"
}