{
  "url": "https://www.nasdaq.com/article/why-is-delek-us-holdings-dk-down-95-since-last-earnings-report-cm1207359",
  "title": "Why Is Delek US Holdings (DK) Down 9.5% Since Last Earnings Report? - Nasdaq.com",
  "text": [
    " It has been about a month since the las t earnings  report for Delek US Holdings (DK). Shares have lost about 9.5% in that time frame, underperforming the S&P 500. Will the recent negative trend continue leading up to its next earnings release, or is Delek US Holdings due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important drivers.  Delek Delivers Strong Q2 Results  Delek US Holdings reported adjusted net income per share of $1.17, comfortably surpassing the Zacks Consensus Estimate of 77 cents and increasing from the comparable year-ago profit of 92 cents. Quarterly revenues came in at $2,480 million, beating the Zacks Consensus Estimate of $2,430 million. The top line also compared favorably with the year-ago sales of $2,422 million.  Segmental Performance   Refining:   Margin from the Refining segment was $178.3 million, slightly higher than $177 million recorded in the year-ago quarter. The segment's results were aided by reduced RIN costs, completion of the Alkylation project at the Krotz Springs refinery and higher crack spreads, partially offset by lower Midland discount versus Cushing (on continued congestion in the Permian Basin).  Logistics:  Margin from the Logistics unit decreased to $44.2 million from $45.2 million in the year-ago period amid lower y/y volumes from its Lion Pipeline System.  Retail:   Margin for the unit - which came into being following the acquisition of Alon USA Energy in 2017 - declined 5.4% from the year-ago quarter to $17.6 million due to lower merchandise sales and margins. Delek's merchandise sales came in at $83.3 million with an average margin of 31.2% compared with $90.2 million with an average margin of 31.7% in the year-ago period.  Financials  Total expenses incurred in the quarter declined 6.2% from the prior-year period to $2,346 million. In the reported quarter, Delek spent $86 million on capital programs (57% on the Refining segment). As of Jun 30, the company had cash and cash equivalents of $951.4 million and a long-term debt of $1,852.3 million, with a debt-to-capitalization ratio of 49.5%. During the quarter under review, Delek bought back shares worth $58.6 million. It is expected to repurchase an additional $40 million shares in the third quarter. The company declared quarterly dividend of 29 cents a share, marking a 3.6% sequential rise. The dividend will be payable on Aug 19 to its shareholders of record as of Sep 3.   How Have Estimates Been Moving Since Then?  It turns out, estimates revision have trended downward during the past month. The consensus estimate has shifted -13.93% due to these changes.  VGM Scores  At this time, Delek US Holdings has a nice Growth Score of B, though it is lagging a lot on the Momentum Score front with an F. However, the stock was allocated a grade of A on the value side, putting it in the top 20% for this investment strategy. Overall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Delek US Holdings has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Delek US Holdings, Inc. (DK): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "It has been about a month since the las t earnings  report for Delek US Holdings (DK). Shares have lost about 9.5% in that time frame, underperforming the S&P 500.",
    "Will the recent negative trend continue leading up to its next earnings release, or is Delek US Holdings due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important drivers.  Delek Delivers Strong Q2 Results  Delek US Holdings reported adjusted net income per share of $1.17, comfortably surpassing the Zacks Consensus Estimate of 77 cents and increasing from the comparable year-ago profit of 92 cents. Quarterly revenues came in at $2,480 million, beating the Zacks Consensus Estimate of $2,430 million. The top line also compared favorably with the year-ago sales of $2,422 million.  Segmental Performance   Refining:   Margin from the Refining segment was $178.3 million, slightly higher than $177 million recorded in the year-ago quarter. The segment's results were aided by reduced RIN costs, completion of the Alkylation project at the Krotz Springs refinery and higher crack spreads, partially offset by lower Midland discount versus Cushing (on continued congestion in the Permian Basin).  Logistics:  Margin from the Logistics unit decreased to $44.2 million from $45.2 million in the year-ago period amid lower y/y volumes from its Lion Pipeline System.  Retail:   Margin for the unit - which came into being following the acquisition of Alon USA Energy in 2017 - declined 5.4% from the year-ago quarter to $17.6 million due to lower merchandise sales and margins. Delek's merchandise sales came in at $83.3 million with an average margin of 31.2% compared with $90.2 million with an average margin of 31.7% in the year-ago period.  Financials  Total expenses incurred in the quarter declined 6.2% from the prior-year period to $2,346 million. In the reported quarter, Delek spent $86 million on capital programs (57% on the Refining segment). As of Jun 30, the company had cash and cash equivalents of $951.4 million and a long-term debt of $1,852.3 million, with a debt-to-capitalization ratio of 49.5%. During the quarter under review, Delek bought back shares worth $58.6 million. It is expected to repurchase an additional $40 million shares in the third quarter. The company declared quarterly dividend of 29 cents a share, marking a 3.6% sequential rise. The dividend will be payable on Aug 19 to its shareholders of record as of Sep 3. ",
    " Delek Delivers Strong Q2 Results ",
    "Delek US Holdings reported adjusted net income per share of $1.17, comfortably surpassing the Zacks Consensus Estimate of 77 cents and increasing from the comparable year-ago profit of 92 cents.",
    "Quarterly revenues came in at $2,480 million, beating the Zacks Consensus Estimate of $2,430 million. The top line also compared favorably with the year-ago sales of $2,422 million.",
    " Segmental Performance ",
    " Refining:   Margin from the Refining segment was $178.3 million, slightly higher than $177 million recorded in the year-ago quarter. The segment's results were aided by reduced RIN costs, completion of the Alkylation project at the Krotz Springs refinery and higher crack spreads, partially offset by lower Midland discount versus Cushing (on continued congestion in the Permian Basin).",
    " Logistics:  Margin from the Logistics unit decreased to $44.2 million from $45.2 million in the year-ago period amid lower y/y volumes from its Lion Pipeline System.",
    " Retail:   Margin for the unit - which came into being following the acquisition of Alon USA Energy in 2017 - declined 5.4% from the year-ago quarter to $17.6 million due to lower merchandise sales and margins. Delek's merchandise sales came in at $83.3 million with an average margin of 31.2% compared with $90.2 million with an average margin of 31.7% in the year-ago period.",
    " Financials ",
    "Total expenses incurred in the quarter declined 6.2% from the prior-year period to $2,346 million.",
    "In the reported quarter, Delek spent $86 million on capital programs (57% on the Refining segment). As of Jun 30, the company had cash and cash equivalents of $951.4 million and a long-term debt of $1,852.3 million, with a debt-to-capitalization ratio of 49.5%.",
    "During the quarter under review, Delek bought back shares worth $58.6 million. It is expected to repurchase an additional $40 million shares in the third quarter.",
    "The company declared quarterly dividend of 29 cents a share, marking a 3.6% sequential rise. The dividend will be payable on Aug 19 to its shareholders of record as of Sep 3.",
    " How Have Estimates Been Moving Since Then? ",
    "It turns out, estimates revision have trended downward during the past month. The consensus estimate has shifted -13.93% due to these changes.",
    " VGM Scores ",
    "At this time, Delek US Holdings has a nice Growth Score of B, though it is lagging a lot on the Momentum Score front with an F. However, the stock was allocated a grade of A on the value side, putting it in the top 20% for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Delek US Holdings has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:39"
}