{
  "url": "https://www.nasdaq.com/article/zackscom-featured-highlights-include-medifast-nvr-universal-forest-products-emcor-and-alliancebernstein-cm1208134",
  "title": "Zacks.com featured highlights include: MEDIFAST, NVR, Universal Forest Products, EMCOR and AllianceBernstein - Nasdaq.com",
  "text": [
    "For Immediate Release",
    "Chicago, IL - September 5, 2019 - Stocks in this week's article are MEDIFAST Inc.MED , NVR Inc.NVR , Universal Forest Products Inc.UFPI , EMCOR Group Inc.EME and AllianceBernstein Holding L.P.AB .",
    "5 Top-Ranked Stocks Screened on DuPont Criteria",
    "Return on equity is an investor-favorite metric when it comes to cherry picking quality stocks. But ROE doesn't always tell the complete story and an investor might get fooled by picking stocks based on this number. Thus, taking a step beyond the basic ROE and analyzing it at an advanced level or applying the DuPont technique seems to be an intriguing idea.",
    "Here is how DuPont breaks down ROE into its different components:",
    "ROE = Net Income/Equity",
    "Net Income / Equity = (Net Income / Sales) * (Sales / Assets) * (Assets / Equity)",
    "ROE = Profit Margin * Asset Turnover Ratio * Equity Multiplier",
    "Why Use DuPont?",
    "The DuPont analysis allows investors to assess the elements that play a dominant role in any change in ROE. It can help investors to separate companies having higher margins from those having a high turnover. For example, high-end fashion brands generally survive on high margin as compared with retail goods, which rely on higher turnover.",
    "In fact, it also focuses on the company's leverage status. A lofty ROE could be due to the overuse of debt. If this is the case, the strength of a company can be uncertain if it has a high debt load.",
    "So, an investor confined solely to a ROE perspective may be confused if he or she has to judge between two stocks of equal ratio. This is where DuPont analysis gets the upper hand while finding out the better stock.",
    "Investors can simply do this analysis by taking a look at the company's financials. However, looking at financial statements of each company separately can be a tedious task. Screening tools like Zacks Research Wizard can come to your rescue and help you shortlist the stocks that look impressive with a DuPont analysis.",
    "For the rest of this Screen of the Week article please visit Zacks.com at:https://www.zacks.com/stock/news/500982/5-topranked-stocks-screened-on-dupont-criteria",
    "Disclosure: Officers, directors and/or employees of Zacks Investment Research may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material. An affiliated investment advisory firm may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material.",
    "About Screen of the Week",
    "Zacks.com created the first and best screening system on the web earning the distinction as the \"#1 site for screening stocks\" by Money Magazine.  But powerful screening tools is just the start. That is why Zacks created the Screen of the Week to highlight profitable stock picking strategies that investors can actively use.",
    "Strong Stocks that Should Be in the News",
    "Many are little publicized and fly under the Wall Street radar. They're virtually unknown to the general public. Yet today's 220 Zacks Rank #1 \"Strong Buys\" were generated by the stock-picking system that has more than doubled the market from 1988 through 2016. Its average gain has been a stellar +25% per year. See these high-potential stocks free >>.",
    "Follow us on Twitter:  http://twitter.com/zacksresearch",
    "Join us on Facebook:  http://www.facebook.com/ZacksInvestmentResearch",
    "Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.",
    "Contact: Jim Giaquinto",
    "Company: Zacks.com",
    "Phone: 312-265-9268",
    "Email: pr@zacks.com",
    "Visit: www.Zacks.com",
    "Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer .",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit http://www.zacks.com/performance  for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:51:00"
}