{
  "url": "https://www.nasdaq.com/article/papa-johns-turnaround-value-play-or-value-trap-cm1208197",
  "title": "Papa John’s Turnaround: Value Play or Value Trap? - Nasdaq.com",
  "text": [
    "Papa John's (NASDAQ: PZZA) has come a long way in the last few years. The company finally named a new CEO: Rob Lynch, an industry pro who just played a part in Arby's resurgence. What will it take for Papa John's to get out of its founder's shadow and right the ship? In this week's episode of Industry Focus: Consumer Goods , host Nick Sciple and Motley Fool analyst Dan Kline approach the question from a few angles. How can Papa John's stand up to its competition? How important is a strong brand identity? Where does Shaq fit in? Controversies aside, what was wrong with Papa John's old business model? What do investors absolutely need to know about the company's comps cycle? And how optimistic should we really be about this company's long-term potential for a Domino's -esque turnaround? Find out below.",
    "To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center . A full transcript follows the video.",
    "10 stocks we like better than Papa John's International\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Papa John's International wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "This video was recorded on Sept. 3, 2019.",
    "Nick Sciple: Welcome to Industry Focus , the podcast that dives into a different sector of the stock market every day. Today is Tuesday, September 3rd, and we're talking Papa John's. I'm your host, Nick Sciple, and today I'm joined by Motley Fool contributor Dan Kline via Skype. How's it going, Dan?",
    "Dan Kline: Hey there, Nick! I was supposed to be sitting there next to you.",
    "Sciple: Yeah, you were supposed to be here. As a lot of our folks know, Dan is based down in West Palm Beach, Florida, and there's a little bit of a storm coming through there. What does the weather look like down in your neck of the woods, Dan?",
    "Kline: Most people have someone in their family that, they're going to show up at a holiday, and you know something bad is going to happen. But that something bad could be, he tells an insensitive joke and falls asleep at the table; or, it could end up with the police being called. That's kind of what a hurricane is like. You know something terrible is going to happen, but you don't know exactly what or exactly where. So for the past four days, we've been preparing. Getting water, charging batteries, downloading things to our phone, doing everything you can do to get ready for a storm, while watching endless weather reports that show the storm could hit us directly, it could miss us, it could hit us partially. And for the most part -- and I say this knowing I'm tempting fate -- here in West Palm Beach, the storm has mostly missed us. So we're going to get maybe even tropical storms tonight, but it's a lot of rain, it's a lot of wind, but unlike our friends in the Bahamas, it seems like we're going to be spared a direct hit.",
    "Despite that, most things are closed. I can't get on a plane; the airport is closed. I was supposed to be there to tape with you and to go to FinCon all week. Hopefully I'll get out later this week. But really, it's a lot about nothing, except even a tiny change could have been catastrophic, a category three or four hurricane absolutely wreaking havoc here. But fortunately, that is not what's happening, and we get to talk Papa John's via Skype.",
    "Sciple: Yeah. As someone who grew up on the Gulf Coast, you always have to appreciate these storms. You always have to watch that cone, where's it going to go? A lot of uncertainty there. For all the folks that are affected by the storm, hope you can stay safe, stay healthy, and rebuild whatever damage occurs. Hopefully, it stays off the coast as much as it can.",
    "Let's talk about Papa John's now, Dan. Big news coming out of Papa John's last week. We've heard that they named their new CEO, Rob Lynch, the former president of Arby's. What are your thoughts on this news, just off the top?",
    "Kline: I think it's a great hire. Now, that said, I'm not sure Papa John's needed to replace its CEO. The previous CEO had worked his way up through the system. You can't really blame him for any of the issues going wrong. But he kind of got sacrificed to circumstances. Coming from Arby's is a brilliant play. What was Arby's? It was kind of the restaurant that wasn't Burger King or McDonald's . And this is the guy who created \"We have the meat,\" a slogan that perfectly explains what Arby's is. It doesn't tell you it's good, it just gives you a place. It's like, \"All right, Arby's has meats. It has roast beef, brisket. It has things that are not what you get at other fast food chains.\" And that breathed life into the brand.",
    "Sciple: Yeah. There's very few company mottoes that become a meme. I think \"We have the meat\" is probably one of those. Looking at Papa John's, this is a company that, after the controversy with the original Papa John Schnatter that has played out of the past several years, he's continued to sell down his stake, this is a continued evolution of the company to de-position itself away from his presence. We've also seen Shaq has been added to the board. We saw Starboard Value take a stake in the company. As you see the company starting to reposition itself, good signs so far?",
    "Kline: Yeah, it's great signs. The problem is, Papa John is a real guy, and he's a real guy who's done some controversial things. He's had some anti-labor practices. We all know some of the racism controversy without rehashing that. The problem is, his name is still on the door. Even though he doesn't have anything to do with the company, he likes to be on the news. Papa John gave an interview saying how he had said that they should replace the CEO -- a CEO he picked, by the way -- that they should have replaced him sooner. And he likes to insert himself in the conversation. And what the company is doing by naming a new CEO with no connection to the company, and hiring Shaq as a brand ambassador -- which, we've talked about before, is a little bit of a clumsy move. Like, \"Hey, we were accused of some racist stuff. Here's a guy who's going to now say nice things about us.\" That said, people love Shaq, and the company does seem to truly want to reform. This is a way to get you to forget that the guy the company is named after is a real guy and turn it to, \"Papa John's, it's a pizza place, and it's not a cult of personality anymore.\"",
    "Sciple: Sure. It's all part of trying to turn this business around, reshape its image. Another exciting thing, I mentioned earlier that Starboard Value came on in February, purchasing $200 million in preferred stock. Their CEO and chief investment officer Jeff Smith is now the chairman of the board at Papa John's. They have a strong history of activist shareholding, particularly in the restaurant space. In 2014, they had the entire Darden board replaced, and that stock is up over 170% since that move. They're going to be using some of those funds injected by Starboard Value to advance their turnaround priorities. $100 million of those funds will go into the turnaround plan of the business.",
    "We talked a little bit about the controversy coming out of the original Papa John and those sorts of things. When you look at actual operating metrics of the business, what problems is Rob Lynch encountering as he takes the corner office at Papa John's?",
    "Kline: Comparable-store sales have been declining. You can pinpoint the beginning of that to some of this controversy, but the reality is, Papa John's has failed in other ways. You might think of them as a pizza company, but the reality is, they're a convenience play and a technology company . Why do you order from Domino's? Domino's is the direct competitor here, and they've had a staggering amount -- I think it's 33 straight quarters of U.S. comp-store growth, and over 100 internationally. Well, why is Domino's winning? Domino's is winning because they have made ordering a pizza insanely easy. You can text them an emoji. You can log into their app and repeat a past order. You can have deliveries sent to locations that aren't where you live. You're outside of the park, and Domino's shows up, and it knows how to get to you. That's where Papa John's stores have failed. Its technology is not as good. It stores look dated. Its advertising is generally based around whatever its limited-time offer is, and nothing ever feel special or good about it. The limited time offer will be like, \"Hey, it's $7.99 for a pepperoni and sausage pizza.\" That's not that special, it's not that interesting.",
    "So, what he inherits is a company that really needs to focus on rebranding itself in one area, but also rebuilding its infrastructure in another, and making it so if you either don't care between Papa John's or Domino's, or you like Papa John's more than Domino's -- we can throw Pizza Hut into the mix here, too -- you have to make it easier or as easy to get the pizza as the chain's rivals make it. Little Caesars has built its business around the idea that you walk in and the pizza is ready. What's the hook at Papa John's, other than, \"better ingredients, better pizza?\" Which, I think, if you've had their pizza, it's better pizza than maybe, I don't know, Ellio's, but not much else.",
    "Sciple: Yeah. This \"better ingredients, better pizza\" idea really worked for Papa John's as they grew up as a business, but I think it's become much tougher for these large national pizza chains to compete, as almost every town you're at, there's a new independent pizza store popping up every day, which has made it difficult to compete on quality. Really, when you're in pizza, there's three things you can compete on. It's either, you're going to have higher quality and better taste; you're going to have a cheaper price; or you're going to have convenience. As you mentioned, they've really struggled on the convenience side versus Domino's. Pricing, I mean, it's difficult to see how much lower these prices can get with a $6 medium pizza coming from these companies. But really, Papa John's has to reposition themselves to both drive higher quality, repositioning their stores, as well as do something on convenience with those tech investments.",
    "Kline: Yeah, and that's the big problem. You can't go that much lower on price. I think it's harder to be cheaper than Little Caesars. It's very hard to be as technologically savvy as Domino's. So, the first thing that Rob Lynch has to do is take away the stigma. He has to at least make it so they're on an even playing field and you feel good about the brand so you would consider ordering it. Because it isn't better. Any town has better pizza. All of these five-minute, you walk in and they run the pizza through an oven, you get to pick exactly what you want, and they have weird toppings -- all of those places, many of which don't deliver because the nature of their pizza does not hold up to delivery, and Papa John's has had to build a pizza that's going to be durable, which doesn't necessarily translate to taste. But the first thing you have to do is reset the brand. They're going to spend about $40 million in the second half of the year with ads starring Shaq. Shaq has a lot of saturation. He advertises an awful lot of products. On the other hand, he's unbelievably likable. So if Shaq's on TV telling you, \"Hey, I'm on the board of Papa John's. I like their pizza. It's convenient. Here's a big fat guy who everybody likes telling you about pizza,\" that is not a bad thing, and that should help the brand.",
    "The company is also spending another $40 million or so on its franchises, helping them by in some cases taking lower fees, in some cases not taking fees, and making an effort to help them modernize their stores and feel part of the family, to rebuild that trust that was lost.",
    "Sciple: Yeah. You mentioned that $40 million, ramping up Shaq as their brand ambassador, you look at pizza, marketing really is a huge differentiator. When Domino's really started their big upswing, it was that Domino's Pizza, \"Our pizza isn't very good, but we're working on it.\" And that really started the upswing. Seeing these significant investments in marketing, seeing them reposition themselves -- another thing, as well, as you've seen them scale up, when you talk about tech, their GPS delivery tracking. They're well behind Domino's there. But there is a presence there.",
    "Now, how optimistic are you, Dan, about the ability for these marketing tactics to succeed and make up some lost ground against Domino's and others?",
    "Kline: I would say I'm cautiously optimistic. Only because -- and we've talked about this with the Starbucks , Dunkin' Donuts comparison -- you don't have to be the leader, you just have to be better at following. Let Domino's pioneer drone delivery, all sorts of new technology. What you want Papa John's to do is to quickly be able to follow that. With a CEO who's more dynamic, who's trending -- they can do some stunts. Arby's did really well with limited-time offers. \"We're going to have venison for one day,\" and it sells out. I think they're going to do some things like that at Papa John's to jump-start the brand, to even get you to download the app. \"Oh, my God, they're going to have,\" I don't know what kind of pizza it is, \"Shaq's favorite recipe that his mom makes,\" or whatever it is, whatever excites the public. They can do it. A lot of technology that was once proprietary is now off the shelf. But there's a lot of work to be done.",
    "Sciple: Another optimistic thing I've seen is, Papa John's has embraced some of this influencer marketing stuff. They partnered up with the Epic Meal Time folks for some marketing things. It's a positive thing, as you see influencer marketing become bigger and bigger.",
    "Another concerning thing, or something to think about with Papa John's, particularly as NFL season is beginning this week, Papa John's two years ago lost their NFL contract. They've really had, as you mentioned, very poor comparable sales. But as we move into Q3, they are going to lap that NFL deal rolling off. Any optimism that, they've lost this marketing bump from the NFL, but now that those numbers aren't compared to that year over year, maybe the narrative can turn around?",
    "Kline: I think it's a challenge. In all the places where you used to see, \"Hey, Papa John's\" -- you and I on Sunday are watching a game in your apartment, which might actually happen this Sunday, that we'll probably go out somewhere. We're watching the game, and we're like, \"We're hungry,\" and we see a Papa John's commercial, so we order a Papa John's pizza. That just makes sense. Well, those are going to be Pizza Hut ads this year. So that's a gain for your competitor. And in general, with pizza, you don't eat a pizza and then go, \"Oh, hey, I should get another pizza from another company.\" There is a huge captive audience of people watching football on their couch.",
    "On the other hand, that was a big, expensive sponsorship. If they strategically use that money to advertise and go after other audiences that eat pizza, you can make that up. Maybe the NFL was a bit of a toxic place to be for a couple of years. There were a lot of controversies, and sort of every move any company made was politicized. So it might make more sense for Papa John's, which is trying to de-politicize its brand, to really just be everywhere. Throw it around to some basketball games; throw it to some baseball playoffs; whatever it is. Look for different audiences. I'll be curious to see what these commercials are. Is it Shaq endorsing the brand and saying, \"Hey, these are good people\"? I hope they drop the \"better pizza\" idea and maybe even make fun of it a little and spread convenience. \"Better pizza\" was a counter to Domino's and Pizza Hut. You could argue that maybe their pizza is better than those, but you can't argue that it's better than, say, Blaze Pizza, or any of the local places where pizzas are handmade and well done. They could make some progress if they're very selective and careful about how they spend their money.",
    "Sciple: Sure, yeah. I think this is very much a turnaround story. You see the board getting shaken up in a really significant way, when you see the No. 1 shareholder -- Papa John himself -- continuing to sell down shares, you have a whole new marketing strategy, a whole new brand ambassador. Really, a lot of question marks up in the air with this company. But as I mentioned earlier, the ability to shift your marketing strategy has been proven to work in the past by other pizza operators.",
    "Kline: You mentioned that they're lapping their comps. Just to give you an idea how bad it was, they were off 9.8% in that quarter at a time where Domino's was gaining share. You would expect when they report this quarter that they will have gained. But what you really have to look at is, if they're 2% up over last year, that's great; but that still leaves them 8% from where they were. So the question is, the next four quarters, they should probably report some pretty positive results, but can they actually get back to the point where they were? I'm not so sure. There's ever-increasing competition. Shaq is a great spokesperson, but, I don't know, I like his commercials, I think The General is a funny character, but I'm not switching my car insurance.",
    "Sciple: Yeah, I totally agree. I think in these next couple of quarters, you may get misled a little bit with these numbers as they lap comps that are maybe more favorable year over year.",
    "Dan, as you watch this company over the next couple of years, what events would have to take place for you to change your mind and overcome that skepticism that you have?",
    "Kline: Well, I'd like to see the new CEO really make the company feel like it's a new company. You mentioned the Domino's turnaround. Domino's came out and did a very bold, like, \"Hey, we know our pizza's not that good and we're working on it.\" You've sort of gotten some mea culpas from Papa John's. They ran those commercials where it showed how diverse their ownership was. But I don't want them to keep apologizing. I want them to own it and be something different. What is the brand identity for Papa John's? Is it the cheap pizza place? The convenient pizza place? The best pizza place of the chains? Is it the pizza place that's open until 4:00 a.m. so they can capture that 2:00 a.m.-to-4:00 a.m. market that Domino's doesn't get? I don't know what it is. I don't have any feelings about this brand. And I didn't grow up with Papa John's. It's not a New England brand. It was new to me when I first lived in New York. And in New York, who's eating pizza at Papa John's? It seemed unfathomable to me that the place existed. So I want to see them come out and have their \"We have the meats\" moment, where you go, \"OK. Shaq just delivered a tag line for Papa John's, and that changes everything about the brand.\" That's not easy to do, but it is possible.",
    "Sciple: Yeah. I'm excited to see how things play out. You can tell a story where this company really turns around; you can also tell the story where Domino's has really entrenched themselves, and it's really tough for them to be dislodged. We'll continue following this story. Dan, I'm sure we'll have you back on again soon!",
    "Kline: I'll talk to you soon, Nick!",
    "Sciple: Stay dry there!",
    "Kline: Thank you!",
    "Sciple: As always, people on the program may own companies discussed on the show, and The Motley Fool may have formal recommendations for or against the stocks discussed, so don't buy or sell anything based solely on what you hear. Thanks to Austin Morgan for his work behind the glass! For Dan Kline, I'm Nick Sciple. Thanks for listening, and Fool on!",
    "Daniel B. Kline has no position in any of the stocks mentioned. Nick Sciple has no position in any of the stocks mentioned. The Motley Fool owns shares of and recommends Starbucks. The Motley Fool recommends Dunkin' Brands Group. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 01:23:00"
}