{
  "url": "https://www.nasdaq.com/article/aurora-cannabis-q4-revenue-grows-sharply-but-misses-estimates-cm1210825",
  "title": "Aurora Cannabis Q4 Revenue Grows Sharply but Misses Estimates - Nasdaq.com",
  "text": [
    " Bellwether   marijuana stock Aurora Cannabis    (NYSE: ACB) released its Q4 of fiscal 2019 results after market   close on Wednesday. For the quarter, the company -- which reports in Canadian   dollars -- booked 98.9 million Canadian dollars in net revenue.   This was up by 52% over the previous quarter and 415% higher on a   year-over-year basis. It was also on the back of an 86%   quarter-over-quarter increase in production volume, to 29,034   kilos. The rise in production was due in no small measure to the   addition of two new cultivation facilities. Aurora's average net selling price per gram for consumer   cannabis fell 6% sequentially to land at CA$5.14. That for   medical cannabis held steady at CA$8.51.makeArticleAd();   Image source: Getty Images.  The highest share (47%) of the company's cannabis revenue, not   surprisingly, came from the consumer segment. Recreational   marijuana has been legal in Aurora's native Canada for nearly a   year. Medical cannabis comprised 31%, while wholesale bulk   product made up the remainder. In terms of profitability, Aurora's headline net loss for the   quarter came in at CA$2.3 million (less than CA$0.01 per share),   a vast improvement over the Q3 deficit of CA$160.2 million but   quite some distance from the Q4 2018 net profit of CA$79.9   million. On average, analysts who track the stock were expecting a   top-line result of CA$108 million, and a per-share adjusted net   loss of CA$0.06 (Aurora has not yet provided a per-share net loss   figure for Q4). The company had guided investors to expect   CA$100 million to CA$107 million on the top   line    , and production available for sale toward the upper end of the   25,000 to 30,000 kilos range. For the entirety of fiscal 2019, Aurora's net revenue was   CA$247.9 million, more than four times higher than the CA$55.2   million it posted in the previous year. The company produced   57,442 kilos of product in fiscal 2018, a 920% year-over-year   increase. On the bottom line the company flipped to a net loss of   CA$297.9 million from a net profit of CA$69.2 million in   2018. The company did not provide guidance for future periods in its   earnings release. Aurora's stock price is down by 9% in after-market trading in   the wake of the results announcement.   Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.         And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018. And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution. Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks. Simply click here to get the full story now.  Learn more     Eric Volkman      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Bellwether   marijuana stock Aurora Cannabis    (NYSE: ACB) released its Q4 of fiscal 2019 results after market   close on Wednesday.",
    "For the quarter, the company -- which reports in Canadian   dollars -- booked 98.9 million Canadian dollars in net revenue.   This was up by 52% over the previous quarter and 415% higher on a   year-over-year basis. It was also on the back of an 86%   quarter-over-quarter increase in production volume, to 29,034   kilos. The rise in production was due in no small measure to the   addition of two new cultivation facilities.",
    "Aurora's average net selling price per gram for consumer   cannabis fell 6% sequentially to land at CA$5.14. That for   medical cannabis held steady at CA$8.51.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "The highest share (47%) of the company's cannabis revenue, not   surprisingly, came from the consumer segment. Recreational   marijuana has been legal in Aurora's native Canada for nearly a   year. Medical cannabis comprised 31%, while wholesale bulk   product made up the remainder.",
    "In terms of profitability, Aurora's headline net loss for the   quarter came in at CA$2.3 million (less than CA$0.01 per share),   a vast improvement over the Q3 deficit of CA$160.2 million but   quite some distance from the Q4 2018 net profit of CA$79.9   million.",
    "On average, analysts who track the stock were expecting a   top-line result of CA$108 million, and a per-share adjusted net   loss of CA$0.06 (Aurora has not yet provided a per-share net loss   figure for Q4). The company had guided investors to expect   CA$100 million to CA$107 million on the top   line    , and production available for sale toward the upper end of the   25,000 to 30,000 kilos range.",
    "For the entirety of fiscal 2019, Aurora's net revenue was   CA$247.9 million, more than four times higher than the CA$55.2   million it posted in the previous year. The company produced   57,442 kilos of product in fiscal 2018, a 920% year-over-year   increase. On the bottom line the company flipped to a net loss of   CA$297.9 million from a net profit of CA$69.2 million in   2018.",
    "The company did not provide guidance for future periods in its   earnings release.",
    "Aurora's stock price is down by 9% in after-market trading in   the wake of the results announcement.",
    "  Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.         And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018. And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution. Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks. Simply click here to get the full story now.  Learn more  ",
    " Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.        ",
    "And make no mistake - it is coming.",
    "Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018.",
    "And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution.",
    "Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks.",
    "Simply click here to get the full story now.",
    " Learn more ",
    "  Eric Volkman      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:55:00"
}