{
  "url": "https://www.nasdaq.com/article/italys-new-executive-makes-old-pleas-to-eu-on-budget-migration-20190911-00497",
  "title": "Italy's new executive makes old pleas to EU on budget, migration - Nasdaq.com",
  "text": [
    "By Francesco Guarascio",
    "BRUSSELS, Sept 11 (Reuters) - The European Union should give Italy more time to cut debt and support a plan to reinvigorate investment, Prime Minister Giuseppe Conte said on Wednesday after a meeting in Brussels with the president-designate of the European Commission.",
    "On his first visit to Brussels after becoming head of a government backed by the anti-establishment 5-Star and centre-left Democratic Party (PD), Conte repeated calls for flexibility in EU fiscal rules and changes to migration regulations.",
    "\"Our target is to reduce the debt,\" Conte told reporters. \"But we want to do it through economic growth and investments,\" he said, adding that Italy would need \"some time\" to reach fiscal targets and invest in the green economy, digitalisation and the revival of its poorer southern regions.",
    "After Conte met the commission's next head, Ursula von der Leyen, an EU official said: \"They had a good exchange about the new political situation in Italy. And also about migration and economics. No concrete results.\"",
    "Conte said he was seeking a pact with the EU, so his government could carry out long-term reforms, implying that this may require flexible interpretation of fiscal requirements.",
    "Italian sources told Reuters on Tuesday the government was planning a 2020 budget deficit of 2.3% of output, above the current goal of 2.1%, and close to the 2.4% level that almost triggered an EU disciplinary procedure over this year's budget. ",
    "Conte did not indicate any deficit or debt target for the 2020 budget which Rome will have to submit to Brussels by mid-October. Under EU rules, a country's nominal deficit can rise as long as it stays below 3% of output and provided that structural expenditures are reduced to bring high public debts down.",
    "A Commission spokesman declined to comment on Conte's remarks.",
    "MIGRATION",
    "Conte also repeated calls for a revision of EU rules on asylum seekers, so that some migrants landing on Italian shores after crossing the Mediterranean would be transferred to other countries, reducing pressure on southern states which have borne the brunt of a decade of large migration flows.",
    "He said progress was being made towards establishing a temporary mechanism for that. Von der Leyen, who will take office in November, had said on Tuesday that migration rules needed overhauling.",
    "Conte conceded that some countries of the 28-nation bloc could oppose the mechanism. Eastern European states, led by Hungary and Poland, blocked similar initiatives in the past.",
    "Conte called for economic penalties for those who refuse to join the mechanism. He also reiterated frequent calls from Rome for an EU policy to repatriate migrants who do not qualify for refugee status.",
    "He also said an EU mission to patrol the Mediterranean, known as Sophia, could be revived once the mechanism on migrant redistribution becomes operational.",
    "The mission was downgraded in March after the previous Italian government prevented Sophia's patrols from disembarking rescued migrants.",
    "Conte was prime minister in that government, but the more prominent anti-migrant partner of that coalition executive, the far-right League, has now been replaced by the PD."
  ],
  "published_datetime": "2019-09-11 09:32:00"
}