{
  "url": "https://www.nasdaq.com/article/italys-cerved-hires-mediobanca-to-study-options-for-bad-loan-unit-20190903-00293",
  "title": "Italy's Cerved hires Mediobanca to study options for bad loan unit - Nasdaq.com",
  "text": [
    "MILAN, Sept 3 (Reuters) - Italian credit data and information group Cerved  has hired Mediobanca as an adviser to study options for its bad loan unit, as the market gears up for consolidation.",
    "\"Such an assessment is still at a preliminary stage and no decision has been taken,\" Cerved said in a statement on Tuesday.",
    "Italy's loan recovery industry is in ferment with players looking to bulk up in the face of slowing disposals by banks after years of massive bad loan sales and regulatory changes.",
    "Credito Fondiario, in turn, recently hired Goldman Sachs and Deutsche Bank to assess strategic options. ",
    "Cerved is evaluating possibilities after losing in June a 10-year bad loan management contract with Monte dei Paschi di Siena .",
    "Forced by regulators to speed up its balance sheet clean-up, the Tuscan bank chose to terminate the contract early, paying a hefty penalty fee, to have more freedom to shed bad debts. ",
    "Also, Cerved's joint attempt with U.S. funds Elliott and Bain Capital to bid for soured debts and a majority stake in a bad loan unit put up for sale by Eurobank  ran aground when the Greek bank in June entered exclusive talks with Pimco. ",
    "Cerved could now decide to sell its loan management division and concentrate on its credit information business, which it recently strengthened through a small acquisition. ",
    "\"Our concentration in terms of clients (of the bad loan management unit) is very low. As multi-client, we could be of interest for someone bigger which has, however, just one or two clients,\" Cerved CEO Andrea Mignanelli told Reuters last month.",
    "At 1013 GMT, shares in Cerved were up 2.8%, bucking a 0.3% drop in the Italian market .",
    "The group reported in July a 10% yearly rise in first-half revenues to 246 million euros ($274 million), with the loan management division accounting for 87 million, up 30.5% year-on-year.",
    "Cerved, which has a market value of nearly 1.5 billion euros, earlier this year caught the eye of buyout firm Advent, which however dropped its takeover bid after news of its offer leaked. ",
    "($1 = 0.8973 euros)"
  ],
  "published_datetime": "2019-09-03 07:00:00"
}