{
  "url": "https://www.nasdaq.com/article/5-cancer-fighting-stocks-to-add-to-your-portfolio-cm1206495",
  "title": "5 Cancer-Fighting Stocks to Add to Your Portfolio - Nasdaq.com",
  "text": [
    " Cancer has become a major health scare in the 21st century, with nearly every individual knowing someone or the other who has been affected. This life-threatening disease has attracted many big companies to invest in and develop solutions. Majority of the drug makers in the world are spending millions on developing treatment for oncology patients, with focus on the prevention, diagnosis and treatment. With still a diverse area left to explore and companies trying desperately to \"lead the market\" with its unique cancer-drug composition, investors can select stocks to gain attractive returns.  Cancer > 100 and Still Counting  Cancer in layman's term is a disease that is caused by the uncontrolled division of cells in the body. Doctors and researchers across the world have so far found more than 100 diseases, which can be collectively called cancer. The vast cancer-fighting industry has been broken down into several categories pre, in and post-cancer treatment. Companies that focus on prevention of cancer produce cessation products, for example smoking cessation products to reduce the risk of developing lung cancer. Others focus on diagnostics that involve analyzing and identification through tissue biopsies to determine the presence of cancerous cells.  The treatment of cancer remains the primary focus, whether it is invasive and non-invasive surgeries or chemotherapies. Some cancer patients need personalized medicines caused by mutation in DNA from the cancer cells. Developing a generic medicine for cancer has a lot of grey area to cover and decades of research work still waits.  Why Invest in Cancer-Fighting Stocks?  In 2018, IQVIA Institute for Human Data Science reported around $150 billion was spent on medicines to treat cancer and this would rise to $250 billion in 2023. The investment in cancer-fighting stocks attracts investors with the potential to generate higher returns over the long term and beat the market. So far this year, the biotech sector has seen a boom boosted by new drug discovery, approval of patents and most importantly, mega-mergers. The S&P Biotechnology Select Industry Index is up by 12% on a year-to-date basis and is still growing. The biotech space took a flight in January 2019 with the announcement of the merger of Bristol-Myers Squibb Company BMY  and Celgene Corporation CELG  , two leading oncological drug makers. Bristol-Myers Squibb has offered to acquire Celgene for $74 billion.  5 Stocks to Buy Now  With the growing rate of cancer patients every year, cancer-fighting stocks seem to be gaining immensely. Hence we have shortlisted five stocks that flaunt a Zacks Rank #1(Strong Buy) or 2 (Buy) and have a bright future with their strong patents and drug development.  Roche Holding AG  RHHBY   is a publicly traded pharmaceutical and diagnostic company. The company provides and develops drugs especially in oncology. On Aug 16, US Food and Drug Administration (FDA) approved Rozlytre for the treatment of metastatic non-small cell lung cancer. Rozlytrek holds a record of shrinking 78% tumors. Roche's expected earnings growth rate for the current year is 7.8%. The Zacks Consensus Estimate for current-year earnings has improved 3.7% over the past 60 days. Roche's stock carries a Zacks Rank #1.  Bristol-Myers Squibb Company   is a publicly traded biopharma company. FDA had authorized Empliciti, a vast portfolio of regime therapy in November 2018 made to fight plasma cell cancer. On Aug 28, the European Commission also approved the Empliciti drug for the treatment of adult patients with multiple myeloma, which boosted the portfolio further. Bristol-Myers Squibb's expected earnings growth rate for the current year is 7.5%. The Zacks Consensus Estimate for current-year earnings has improved 2.6% over the past 60 days. The stock carries a Zacks Rank #1. You can see  the complete list of today's Zacks #1 Rank stocks   here.    Abbott Laboratories ABT  is publicly traded offering cancer diagnostic equipment. The company has a portfolio of instrumental cancer-detecting laboratory systems that include, Alinity, Architect and Cell-Dyn. Abbott Lab's expected earnings growth rate for the current year is 12.5%. The Zacks Consensus Estimate for current-year earnings has improved 0.6% over the past 60 days. The stock carries a Zacks Rank #2.  Eli Lilly and Company LLY  is a publicly traded company that targets the treatment of cancer. The company still benefits from the first won FDA approval on Alimta in 2004, a drug for treating non-small cell lung cancer. After the $1.6 billion acquisition of ARMO Biosciences in 2018, Eli Lilly now has three cancer programs in the late-stage pipeline. Eli Lilly's expected earnings growth rate for the current year is 3.1%. The Zacks Consensus Estimate for current-year earnings has improved 1.1% over the past 60 days. Eli Lilly stock carries a Zacks Rank #2.  Novartis AG NVS  is a publicly traded pharmaceutical company with a massive portfolio of cancer-fighting drugs. In 2018, Tasigna, Novartis' chronic myeloid leukemia drug alone generated $1.9 billion from a total of $13.4 billion revenues in the cancer drug franchise. Novartis' expected earnings growth rate for the current year is 1.2%. The Zacks Consensus Estimate for current-year earnings has improved 2.8% over the past 60 days. Novartis stock carries a Zacks Rank #2.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Novartis AG (NVS): Free Stock Analysis Report   Eli Lilly and Company (LLY): Free Stock Analysis Report   Abbott Laboratories (ABT): Free Stock Analysis Report   Bristol-Myers Squibb Company (BMY): Free Stock Analysis Report   Roche Holding AG (RHHBY): Free Stock Analysis Report   Celgene Corporation (CELG): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Cancer has become a major health scare in the 21st century, with nearly every individual knowing someone or the other who has been affected. This life-threatening disease has attracted many big companies to invest in and develop solutions.",
    "Majority of the drug makers in the world are spending millions on developing treatment for oncology patients, with focus on the prevention, diagnosis and treatment. With still a diverse area left to explore and companies trying desperately to \"lead the market\" with its unique cancer-drug composition, investors can select stocks to gain attractive returns.",
    " Cancer > 100 and Still Counting ",
    "Cancer in layman's term is a disease that is caused by the uncontrolled division of cells in the body. Doctors and researchers across the world have so far found more than 100 diseases, which can be collectively called cancer. The vast cancer-fighting industry has been broken down into several categories pre, in and post-cancer treatment.",
    "Companies that focus on prevention of cancer produce cessation products, for example smoking cessation products to reduce the risk of developing lung cancer. Others focus on diagnostics that involve analyzing and identification through tissue biopsies to determine the presence of cancerous cells. ",
    "The treatment of cancer remains the primary focus, whether it is invasive and non-invasive surgeries or chemotherapies. Some cancer patients need personalized medicines caused by mutation in DNA from the cancer cells. Developing a generic medicine for cancer has a lot of grey area to cover and decades of research work still waits.",
    " Why Invest in Cancer-Fighting Stocks? ",
    "In 2018, IQVIA Institute for Human Data Science reported around $150 billion was spent on medicines to treat cancer and this would rise to $250 billion in 2023. The investment in cancer-fighting stocks attracts investors with the potential to generate higher returns over the long term and beat the market.",
    "So far this year, the biotech sector has seen a boom boosted by new drug discovery, approval of patents and most importantly, mega-mergers. The S&P Biotechnology Select Industry Index is up by 12% on a year-to-date basis and is still growing.",
    "The biotech space took a flight in January 2019 with the announcement of the merger of Bristol-Myers Squibb Company BMY  and Celgene Corporation CELG  , two leading oncological drug makers. Bristol-Myers Squibb has offered to acquire Celgene for $74 billion.",
    " 5 Stocks to Buy Now ",
    "With the growing rate of cancer patients every year, cancer-fighting stocks seem to be gaining immensely. Hence we have shortlisted five stocks that flaunt a Zacks Rank #1(Strong Buy) or 2 (Buy) and have a bright future with their strong patents and drug development.",
    " Roche Holding AG  RHHBY   is a publicly traded pharmaceutical and diagnostic company. The company provides and develops drugs especially in oncology. On Aug 16, US Food and Drug Administration (FDA) approved Rozlytre for the treatment of metastatic non-small cell lung cancer. Rozlytrek holds a record of shrinking 78% tumors.",
    "Roche's expected earnings growth rate for the current year is 7.8%. The Zacks Consensus Estimate for current-year earnings has improved 3.7% over the past 60 days. Roche's stock carries a Zacks Rank #1.",
    " Bristol-Myers Squibb Company   is a publicly traded biopharma company. FDA had authorized Empliciti, a vast portfolio of regime therapy in November 2018 made to fight plasma cell cancer. On Aug 28, the European Commission also approved the Empliciti drug for the treatment of adult patients with multiple myeloma, which boosted the portfolio further.",
    "Bristol-Myers Squibb's expected earnings growth rate for the current year is 7.5%. The Zacks Consensus Estimate for current-year earnings has improved 2.6% over the past 60 days. The stock carries a Zacks Rank #1. You can see  the complete list of today's Zacks #1 Rank stocks   here.  ",
    " Abbott Laboratories ABT  is publicly traded offering cancer diagnostic equipment. The company has a portfolio of instrumental cancer-detecting laboratory systems that include, Alinity, Architect and Cell-Dyn.",
    "Abbott Lab's expected earnings growth rate for the current year is 12.5%. The Zacks Consensus Estimate for current-year earnings has improved 0.6% over the past 60 days. The stock carries a Zacks Rank #2.",
    " Eli Lilly and Company LLY  is a publicly traded company that targets the treatment of cancer. The company still benefits from the first won FDA approval on Alimta in 2004, a drug for treating non-small cell lung cancer. After the $1.6 billion acquisition of ARMO Biosciences in 2018, Eli Lilly now has three cancer programs in the late-stage pipeline.",
    "Eli Lilly's expected earnings growth rate for the current year is 3.1%. The Zacks Consensus Estimate for current-year earnings has improved 1.1% over the past 60 days. Eli Lilly stock carries a Zacks Rank #2.",
    " Novartis AG NVS  is a publicly traded pharmaceutical company with a massive portfolio of cancer-fighting drugs. In 2018, Tasigna, Novartis' chronic myeloid leukemia drug alone generated $1.9 billion from a total of $13.4 billion revenues in the cancer drug franchise.",
    "Novartis' expected earnings growth rate for the current year is 1.2%. The Zacks Consensus Estimate for current-year earnings has improved 2.8% over the past 60 days. Novartis stock carries a Zacks Rank #2.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 07:02:00"
}