{
  "url": "https://www.nasdaq.com/article/concrete-steps-for-china-cement-giants-monster-carbon-footprint-smothers-climate-goals-20190912-00108",
  "title": "Concrete steps? For China cement giants, monster carbon footprint smothers climate goals - Nasdaq.com",
  "text": [
    "By David Stanway",
    "WUHU, China, Sept 12 (Reuters) - At its massive Baimashan plant near the Yangtze river in eastern China, cement giant Anhui Conch  has invested the best part of $10 million in new equipment to capture and store climate-warming greenhouse gas produced by its kilns.",
    "The pilot carbon capture and storage (CCS) project, installed last year in the city of Wuhu in Anhui province, separates and purifies 50,000 tonnes of carbon dioxide (CO2) a year, which Conch will sell to industrial consumers. It's a textbook example of the kind of high-tech scheme Beijing says can help it meet lofty goals to cut pollution.",
    "\"This is part of our social responsibility and if we only considered the economics we wouldn't have done it,\" said Jin Feng, who runs the Baimashan plant for Conch, a powerhouse worth about $32 billion by market value. \"The local market (for CO2) is limited so we have no plans to expand,\" he told Reuters, speaking during a recent tour of the facility.",
    "China, in the middle of a long building boom, is by far the world's biggest consumer of cement, with total production capacity at around 55% of the global total. The sector's environmental footprint is enormous, producing vast quantities of nitrogen oxides and sulphur dioxide as well as CO2.",
    "The global cement industry is responsible for around 7% of the world's greenhouse gas, according to industry estimates, both from the production of clinker - used to make cement - from limestone and from the use of fossil fuels. Six of the world's 10 biggest cement producers are in China.",
    "CCS is just one option when it comes to cutting emissions, said Cui Xingtai, vice-president at China's biggest cement producer by volume, the China National Building Materials Co. Ltd. (CNBM) .",
    "\"Conch has taken the lead in carbon capture and it is loss-making for them ... but we hope the entire industry can follow,\" he told Reuters, speaking on the sidelines of an industry conference.",
    "\"We are preparing to deploy this equipment. We also need to consider how to earn money from it.\"",
    "ALTERNATIVE FUELS",
    "With carbon capture still out of reach for the vast majority of China's roughly 3,400 cement firms, the government has so far focused on enforcing stricter emission standards, improving energy efficiency and replacing polluting capacity with more advanced plants.",
    "The government is also trying to persuade producers to make use of alternative fuels, including municipal solid waste, tyres or methane from landfills. Producers elsewhere have successfully raised alternative fuel ratios to around 20-30% - with Germany now as high as 68% - but according to an estimate by Huaxin Cement, China's fifth-largest producer, the domestic ratio is about 3%.",
    "Conch, which invested 60 million yuan ($8.47 million) in the Baimashan plant's CCS equipment, has converted 11 cement projects to municipal waste, with one 14 million tonnes per year plant in Tongling now incinerating all the trash produced by the city's residents.",
    "But overall progress has been slow: Conch has a total of more than 150 regional subsidiaries and a total production capacity of more than 200 million tonnes, around a 10th of China's total.",
    "While carbon capture could eventually play a bigger role in the sector, replacing fuel with trash could be the best short-term option to boost the cement makers' green credentials.",
    "\"The Chinese government sees the cement industry as having a role to play in disposing of municipal solid waste, and eliminating landfill,\" said Ian Riley, chief executive of the World Cement Association, speaking to Reuters during the visit to the Conch CCS facility. \"China creates 300 million tonnes a year (of municipal solid waste) and the cement industry could handle all of that.\"",
    "Chinese cement industry standards for sulphur dioxide and other pollutants are now tougher than Europe, according to CNBM's Cui, raising production costs by 70% in some regions. But alternative raw materials and energy sources are still needed, he said.",
    "\"It is very difficult, but the industry is working hard,\" he said.",
    "($1 = 7.0849 yuan)"
  ],
  "published_datetime": "2019-09-12 04:08:00"
}