{
  "url": "https://www.nasdaq.com/article/aes-vs-utl-which-stock-is-the-better-value-option-cm1207989",
  "title": "AES vs. UTL: Which Stock Is the Better Value Option? - Nasdaq.com",
  "text": [
    " Investors with an interest in Utility - Electric Power stocks have likely encountered both AES (AES) and Unitil (UTL). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look. The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits. Both AES and Unitil have a Zacks Rank of # 2 (Buy) right now. Investors should feel comfortable knowing that both of these stocks have an improving earnings outlook since the Zacks Rank favors companies that have witnessed positive analyst estimate revisions. But this is just one piece of the puzzle for value investors. Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels. The Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P/E ratio, P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value. AES currently has a forward P/E ratio of 11.43, while UTL has a forward P/E of 26.32. We also note that AES has a PEG ratio of 1.35. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. UTL currently has a PEG ratio of 6.04. Another notable valuation metric for AES is its P/B ratio of 1.86. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, UTL has a P/B of 2.44. These metrics, and several others, help AES earn a Value grade of A, while UTL has been given a Value grade of C. Both AES and UTL are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that AES is the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  The AES Corporation (AES): Free Stock Analysis Report   Unitil Corporation (UTL): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors with an interest in Utility - Electric Power stocks have likely encountered both AES (AES) and Unitil (UTL). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look.",
    "The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits.",
    "Both AES and Unitil have a Zacks Rank of # 2 (Buy) right now. Investors should feel comfortable knowing that both of these stocks have an improving earnings outlook since the Zacks Rank favors companies that have witnessed positive analyst estimate revisions. But this is just one piece of the puzzle for value investors.",
    "Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels.",
    "The Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P/E ratio, P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value.",
    "AES currently has a forward P/E ratio of 11.43, while UTL has a forward P/E of 26.32. We also note that AES has a PEG ratio of 1.35. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. UTL currently has a PEG ratio of 6.04.",
    "Another notable valuation metric for AES is its P/B ratio of 1.86. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, UTL has a P/B of 2.44.",
    "These metrics, and several others, help AES earn a Value grade of A, while UTL has been given a Value grade of C.",
    "Both AES and UTL are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that AES is the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:40:23"
}