{
  "url": "https://www.nasdaq.com/article/continental-resources-clr-down-107-since-last-earnings-report-can-it-rebound-cm1207364",
  "title": "Continental Resources (CLR) Down 10.7% Since Last Earnings Report: Can It Rebound? - Nasdaq.com",
  "text": [
    " It has been about a month since the las t earnings  report for Continental Resources (CLR). Shares have lost about 10.7% in that time frame, underperforming the S&P 500. Will the recent negative trend continue leading up to its next earnings release, or is Continental Resources due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important catalysts.  Continental Q2 Earnings Miss Estimates, Decline   Y/Y  Continental Resources reported second-quarter 2019 adjusted earnings of 59 cents per share, which missed the Zacks Consensus Estimate by a penny. Moreover, the bottom line fell from the year-ago quarter earnings of 73 cents. Revenues of $1,208.4 million beat the Zacks Consensus Estimate of $1,166 million. The figure also increased from $1,137.1 million in the year-ago quarter. The weak quarterly earnings can be attributed to lower commodity price realizations and higher operating expenses. This was partially offset by higher year-over-year oil and gas production.  Production Surges  Production from continuing operations averaged 331,414 barrels of oil equivalent per day (BOE/D) in the quarter, higher than 284,059 BOE/D in the year-ago period. Oil production in the quarter came in at 193,586 barrels per day (Bbls/d), up from 157,116 Bbls/d a year ago. Natural gas production jumped from 761,653 thousand cubic feet per day (Mcf/d) in second-quarter 2018 to 826,969 Mcf/d in the second quarter of 2019.  Price Realization Plunges  Average realized price for oil was $54.66 a barrel, down from $63.35 in the prior-year quarter. Natural gas was sold at $1.66 per Mcf, down from $2.65 in the year-ago quarter. Crude oil equivalent price in the quarter fell to $36.03 per barrel from $42.16 in the prior-year period.  Total Expenses Jump  Total operating expenses of $828.5 million in the second quarter rose from $745.8 million in the April-to-June quarter of 2018. Total production cost rose to $112.4 million from $90.2 million in the year-ago quarter. Exploration costs in the quarter were $3.1 million compared with $0.3 million in the year-ago period. Production expense per barrel of oil equivalent in second-quarter 2019 was $3.74, higher than the year-ago figure of $3.49.  Increasing Value for Investors  The company authorized a share buyback program valued at $1 billion, effective second-quarter 2019. Till Aug 2, the company bought back 2.4 million shares valued at $92 million. The share repurchase program is expected to run through 2020.  Capital Expenditure  In second-quarter 2019, total capital expenditure (excluding acquisitions) was around $688.8 million, of which nearly 83% was used in exploration and development drilling.  Balance Sheet  As of Jun 30, 2019, the company had total cash and cash equivalents of $206.5 million, as well as debt of $5,767.3 million (excluding current maturities), with a debt-to-capitalization ratio of 45.8%.  Guidance  Continental's 2019 capital spending is expected to be $2.6 billion. For 2019, production of oil is expected in the range of 195,000-200,000 barrels per day (Bbl/D) - higher than its prior projection of 190,000 to 200,000 Bbl/D -, while that of natural gas is projected in the band of 820,000-840,000 thousand cubic feet per day. The company expects production expense for 2019 in the range of $3.50-$4.00 per BOE. Continental plans to release seven rigs in the South region by the end of this year, owing to efficiency gains in Springer & Woodford.   How Have Estimates Been Moving Since Then?  It turns out, estimates review have trended downward during the past month. The consensus estimate has shifted -11.29% due to these changes.  VGM Scores  At this time, Continental Resources has an average Growth Score of C, a grade with the same score on the momentum front. Charting a somewhat similar path, the stock was allocated a grade of B on the value side, putting it in the top 40% for this investment strategy. Overall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. It's no surprise Continental Resources has a Zacks Rank #5 (Strong Sell). We expect a below average return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Continental Resources, Inc. (CLR): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "It has been about a month since the las t earnings  report for Continental Resources (CLR). Shares have lost about 10.7% in that time frame, underperforming the S&P 500.",
    "Will the recent negative trend continue leading up to its next earnings release, or is Continental Resources due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important catalysts.  Continental Q2 Earnings Miss Estimates, Decline   Y/Y  Continental Resources reported second-quarter 2019 adjusted earnings of 59 cents per share, which missed the Zacks Consensus Estimate by a penny. Moreover, the bottom line fell from the year-ago quarter earnings of 73 cents. Revenues of $1,208.4 million beat the Zacks Consensus Estimate of $1,166 million. The figure also increased from $1,137.1 million in the year-ago quarter. The weak quarterly earnings can be attributed to lower commodity price realizations and higher operating expenses. This was partially offset by higher year-over-year oil and gas production.  Production Surges  Production from continuing operations averaged 331,414 barrels of oil equivalent per day (BOE/D) in the quarter, higher than 284,059 BOE/D in the year-ago period. Oil production in the quarter came in at 193,586 barrels per day (Bbls/d), up from 157,116 Bbls/d a year ago. Natural gas production jumped from 761,653 thousand cubic feet per day (Mcf/d) in second-quarter 2018 to 826,969 Mcf/d in the second quarter of 2019.  Price Realization Plunges  Average realized price for oil was $54.66 a barrel, down from $63.35 in the prior-year quarter. Natural gas was sold at $1.66 per Mcf, down from $2.65 in the year-ago quarter. Crude oil equivalent price in the quarter fell to $36.03 per barrel from $42.16 in the prior-year period.  Total Expenses Jump  Total operating expenses of $828.5 million in the second quarter rose from $745.8 million in the April-to-June quarter of 2018. Total production cost rose to $112.4 million from $90.2 million in the year-ago quarter. Exploration costs in the quarter were $3.1 million compared with $0.3 million in the year-ago period. Production expense per barrel of oil equivalent in second-quarter 2019 was $3.74, higher than the year-ago figure of $3.49.  Increasing Value for Investors  The company authorized a share buyback program valued at $1 billion, effective second-quarter 2019. Till Aug 2, the company bought back 2.4 million shares valued at $92 million. The share repurchase program is expected to run through 2020.  Capital Expenditure  In second-quarter 2019, total capital expenditure (excluding acquisitions) was around $688.8 million, of which nearly 83% was used in exploration and development drilling.  Balance Sheet  As of Jun 30, 2019, the company had total cash and cash equivalents of $206.5 million, as well as debt of $5,767.3 million (excluding current maturities), with a debt-to-capitalization ratio of 45.8%.  Guidance  Continental's 2019 capital spending is expected to be $2.6 billion. For 2019, production of oil is expected in the range of 195,000-200,000 barrels per day (Bbl/D) - higher than its prior projection of 190,000 to 200,000 Bbl/D -, while that of natural gas is projected in the band of 820,000-840,000 thousand cubic feet per day. The company expects production expense for 2019 in the range of $3.50-$4.00 per BOE. Continental plans to release seven rigs in the South region by the end of this year, owing to efficiency gains in Springer & Woodford. ",
    " Continental Q2 Earnings Miss Estimates, Decline   Y/Y ",
    "Continental Resources reported second-quarter 2019 adjusted earnings of 59 cents per share, which missed the Zacks Consensus Estimate by a penny. Moreover, the bottom line fell from the year-ago quarter earnings of 73 cents.",
    "Revenues of $1,208.4 million beat the Zacks Consensus Estimate of $1,166 million. The figure also increased from $1,137.1 million in the year-ago quarter.",
    "The weak quarterly earnings can be attributed to lower commodity price realizations and higher operating expenses. This was partially offset by higher year-over-year oil and gas production.",
    " Production Surges ",
    "Production from continuing operations averaged 331,414 barrels of oil equivalent per day (BOE/D) in the quarter, higher than 284,059 BOE/D in the year-ago period. Oil production in the quarter came in at 193,586 barrels per day (Bbls/d), up from 157,116 Bbls/d a year ago.",
    "Natural gas production jumped from 761,653 thousand cubic feet per day (Mcf/d) in second-quarter 2018 to 826,969 Mcf/d in the second quarter of 2019.",
    " Price Realization Plunges ",
    "Average realized price for oil was $54.66 a barrel, down from $63.35 in the prior-year quarter. Natural gas was sold at $1.66 per Mcf, down from $2.65 in the year-ago quarter. Crude oil equivalent price in the quarter fell to $36.03 per barrel from $42.16 in the prior-year period.",
    " Total Expenses Jump ",
    "Total operating expenses of $828.5 million in the second quarter rose from $745.8 million in the April-to-June quarter of 2018. Total production cost rose to $112.4 million from $90.2 million in the year-ago quarter. Exploration costs in the quarter were $3.1 million compared with $0.3 million in the year-ago period.",
    "Production expense per barrel of oil equivalent in second-quarter 2019 was $3.74, higher than the year-ago figure of $3.49.",
    " Increasing Value for Investors ",
    "The company authorized a share buyback program valued at $1 billion, effective second-quarter 2019. Till Aug 2, the company bought back 2.4 million shares valued at $92 million. The share repurchase program is expected to run through 2020.",
    " Capital Expenditure ",
    "In second-quarter 2019, total capital expenditure (excluding acquisitions) was around $688.8 million, of which nearly 83% was used in exploration and development drilling.",
    " Balance Sheet ",
    "As of Jun 30, 2019, the company had total cash and cash equivalents of $206.5 million, as well as debt of $5,767.3 million (excluding current maturities), with a debt-to-capitalization ratio of 45.8%.",
    " Guidance ",
    "Continental's 2019 capital spending is expected to be $2.6 billion. For 2019, production of oil is expected in the range of 195,000-200,000 barrels per day (Bbl/D) - higher than its prior projection of 190,000 to 200,000 Bbl/D -, while that of natural gas is projected in the band of 820,000-840,000 thousand cubic feet per day. The company expects production expense for 2019 in the range of $3.50-$4.00 per BOE.",
    "Continental plans to release seven rigs in the South region by the end of this year, owing to efficiency gains in Springer & Woodford.",
    " How Have Estimates Been Moving Since Then? ",
    "It turns out, estimates review have trended downward during the past month. The consensus estimate has shifted -11.29% due to these changes.",
    " VGM Scores ",
    "At this time, Continental Resources has an average Growth Score of C, a grade with the same score on the momentum front. Charting a somewhat similar path, the stock was allocated a grade of B on the value side, putting it in the top 40% for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. It's no surprise Continental Resources has a Zacks Rank #5 (Strong Sell). We expect a below average return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:38"
}