{
  "url": "https://www.nasdaq.com/article/euro-slides-to-lowest-since-2017-on-investors-eye-ecb-cuts-dollar-strength-20190903-00339",
  "title": "Euro slides to lowest since 2017 on investors eye ECB cuts, dollar strength - Nasdaq.com",
  "text": [
    "By Olga Cotaga",
    "LONDON, Sept 3 (Reuters) - The euro plunged to a 28-month low against the dollar on Tuesday as investors priced in deeper negative interest rates for longer in the euro zone.",
    "The common currency's drop also came on the back of a strengthening dollar as the trade spat between Washington and Beijing intensified and traders turned to buying U.S. assets as safe-haven investments without hedging their dollar currency exposure, analysts said.",
    "The ECB benchmark rate now stands at minus 0.40% and it has  all but promised a monetary policy stimulus package as economic growth falters. Monday's PMI survey showed European manufacturing contracted for seven straight months.",
    "The euro  was last down by 0.3% at $1.0936. It fell to $1.0926 earlier, its lowest since mid-May 2017. A break below the key $1.1000 level last week had sparked heavier sell-offs.",
    "Against an index of its six major rivals, the dollar  rose to 99.37 on Tuesday, the highest since mid-May 2017, as investors became more gloomy about the global economy's prospects amid the U.S.-China trade dispute.",
    "Bloomberg News reported that Chinese and U.S. officials are struggling to agree a schedule for a round of trade negotiations that had been expected this month.",
    "Overseas investors dived into buying U.S. Treasuries, considered the most liquid and safe investment in tumultuous times.",
    "The 10-year Treasury bond yield fell 2.5 basis points to 1.48% on Tuesday, close to the low of $1.44% it reached last week that was last seen in mid-2016.",
    "The flows have boosted the dollar, but investors' decision to either buy Treasuries unhedged, or trim some of their currency hedges has intensified the gains in the greenback, said Richard Falkenhall, senior forex strategist at SEB.",
    "Higher government bonds in the United States compared with the rest of the developed world makes it worthless to buy U.S. government bonds to overseas investors if they also buy protection against unexpected swings in the U.S. currency.",
    "\"The dollar tends to outperform all other currencies except the yen\" when the global economy slows down, said Falkenhall.",
    "\"Everything is going in the same direction pointing to a stronger dollar,\" he said.",
    "EURO AND ITALY",
    "The euro could get some relief if the 5-Star Movement and the Democratic Party form a coalition government in Italy, analysts said. 5-Star members will vote on Tuesday on forming a coalition with PD.",
    "\"If the vote succeeds, the euro could gain somewhat,\" MUFG analysts said in a note, adding that \"Italian assets like bonds and stocks would likely rally somewhat further\".",
    "Elsewhere, the pound fell to its lowest in nearly three years on Tuesday as British lawmakers prepared to vote on the first stage of their plan to block Prime Minister Boris Johnson from pursuing a no-deal Brexit. GBP/",
    "Sterling was last down 0.4% at $1.2012  after falling to $1.1959, the lowest since October 2016, when it plunged to $1.1491 in a flash crash. Against the euro, sterling touched a two-week low of 91.47 pence ."
  ],
  "published_datetime": "2019-09-03 07:38:00"
}