{
  "url": "https://www.nasdaq.com/article/apple-returns-to-us-highgrade-bond-market-to-term-out-debt-20190904-01196",
  "title": "Apple returns to US high-grade bond market to term out debt - Nasdaq.com",
  "text": [
    "By William Hoffman",
    "NEW YORK, Sept 4 (IFR) - Apple returned to the US primary market on Wednesday for the first time since 2017, launching a US$7bn five-part bond in an effort to refinance debt and lock in exceptionally low interest rates.",
    "Apple, like much of the tech sector, disappeared from the US investment-grade primary after tax reform in 2017 made it easier for companies to repatriate cash from overseas back to the US.",
    "On this occasion, proceeds will manage debt maturities at Apple, which has US$10.3bn of debt coming due between the end of the second quarter until September 2020, according to Moody's.",
    "The tech giant was expected to have little trouble generating investor demand, mostly because bonds issued by the highly sought after Double A credit are hard to source in the secondary.",
    "If price progression was any gauge the buyside happily bought into Wednesday's deal too, even after much of the new concession was erased following a 17bp-22bp price tightening on three, five, seven 10 and 30-year tranches.",
    "The company launched a US$1.75bn 10-year at US Treasuries plus 78bp and a US$1.5bn 30-year at T+103bp.",
    "That is slightly wider than the T+72bp and T+100bp it achieved on similar tenors in November 2017.",
    "But the company is tapping the market at a time when US Treasury yields are much lower - 1.445% on the 10-year and 1.953% on the 30-year versus 2.37% and 2.79%, respectively, two years ago.",
    "Indeed, the current market environment proved too enticing as Apple sprung at the opportunity to retire high coupon debt and replace it when Treasuries are trading near their lows, said Jordan Chalfin, senior technology analyst for CreditSights.",
    "\"They have a decent amount of debt maturing and you'd expect them to just pay it as it comes due because they have so much cash but they are choosing to issue opportunistically and lock in low rates,\" he told IFR.",
    "Selling bonds is also a less cumbersome way of attending to upcoming maturities. With much of its US$83bn in net cash and cash equivalents tied up in corporate bonds, Apple would have to raise cash in the secondary market, which it did in the last quarter.",
    "\"This deal makes it so they don't have to sell their investments,\" Chalfin added.",
    "POTENTIAL RISKS",
    "Despite Apple's ability to generate enormous amount of cash - it is expected to rake in US$47bn in fiscal year 2020 - Moody's did highlight several risks.",
    "Chief among those risks is the escalating trade war between the US and China, which could impact its growth, profitability and supply chain moving forward.",
    "Additionally, Apple's cash flow is heavily reliant on consumer trends which can change with the winds.",
    "Some investors expressed a preference for tech companies with larger business ties such as Amazon's cloud services.",
    "\"In its devices business, Apple faces risks of managing short product cycles, abrupt changes in demand and need to adapt to shifting consumer preferences,\" Moody's noted in its report.",
    "Apple is also under scrutiny from ESG investors on its commitment to privacy.",
    "Among the top Silicon Valley tech companies, Apple has long been considered the most committed to consumer privacy, but some cracks in its armor are showing.",
    "The iPhone maker is the latest of the big five tech companies to be caught hiring contractors to listen into voice assistant recordings that often pick up personal information.",
    "\"Basically all the big tech companies were doing it to improve the AI,\" Chalfin said.",
    "\"It's certainly an issue but I don't think it materially impacts the credit.\""
  ],
  "published_datetime": "2019-09-04 02:43:00"
}