{
  "url": "https://www.nasdaq.com/article/why-american-eagle-outfitters-tyson-foods-and-usa-technologies-slumped-today-cm1207590",
  "title": "Why American Eagle Outfitters, Tyson Foods, and USA Technologies Slumped Today - Nasdaq.com",
  "text": [
    " Wednesday was a good day on Wall Street, as reduced   international tensions helped to give market participants new   hope that recent conflicts might get resolved favorably. Major   indexes rose roughly 1%, indicating widespread gains. Yet some   stocks weren't able to join in the rally due to company-specific   bad news.   American Eagle Outfitters    (NYSE: AEO) ,   Tyson Foods    (NYSE: TSN) , and   USA Technologies    (NASDAQ: USAT) were among the worst performers. Here's why they   did so poorly. American Eagle falls to earth Shares of   American Eagle Outfitters dropped 12%    after the apparel retailer reported its second-quarter financial   results. Revenue climbed 8% to hit a record and rise above the $1   billion mark. However, comparable sales were up a more modest 2%   from year-ago levels, and despite comps growth of 16% rise in the   Aerie store concept, American Eagle's namesake stores saw comps   fall 1% over the same period. The retailer said that seasonal   issues related to the back-to-school season played a role in   holding American Eagle back. The company's hopeful that the rest   of the year will go well, but investors will have to wait to see   if consumers help the retailer recover during the key holiday   season.   Image source: Getty Images.makeArticleAd();  Tyson makes cuts Tyson Foods saw its stock sink 8% following its announcement   tha   t earnings    for its fiscal fourth quarter wouldn't live up to prior   expectations. The   meat producer     said that volatility in the commodities markets, costs of   following enhanced food safety initiatives, a fire at one of its   processing plants, and some other challenges all combined to hurt   Tyson's prospects for fourth-quarter growth. CEO Noel White tried   to stay positive, noting that the company's outlook for fiscal   2020 remains positive. However, it could take a while for   investors to work through all the issues Tyson has before   longer-term gains become possible -- especially given   the competition that the meat company is now   facing    . USA Technologies seeks more time Finally, shares of   USA Technologies plunged 22%    . The payment and software services company said that it isn't   likely to meet a Sept. 9 deadline to file all required financial   reports with the U.S. Securities and Exchange Commission. USA   Technologies is late on its fiscal 2018 annual report and on   three subsequen   t quarterly   report    s, and it hopes to get current by Sept. 23. However, investors   are scared that since the company is out of compliance with   Nasdaq listing requirements, it might not be able to get   everything done before the stock gets delisted.   Offer from The Motley Fool: The 10 best stocks to buy     now            Motley Fool co-founders Tom and David Gardner have spent more     than a decade beating the market. In fact, the newsletter they     run,     Motley Fool Stock Advisor      , has quadrupled the S&P 500!* Tom and David just revealed their ten top stock picks for     investors to buy right now.  Click here to get access to the full       list!   *      Stock Advisor     returns as of June 1, 2019.     Dan Caplinger      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Wednesday was a good day on Wall Street, as reduced   international tensions helped to give market participants new   hope that recent conflicts might get resolved favorably. Major   indexes rose roughly 1%, indicating widespread gains. Yet some   stocks weren't able to join in the rally due to company-specific   bad news.   American Eagle Outfitters    (NYSE: AEO) ,   Tyson Foods    (NYSE: TSN) , and   USA Technologies    (NASDAQ: USAT) were among the worst performers. Here's why they   did so poorly.",
    "Shares of   American Eagle Outfitters dropped 12%    after the apparel retailer reported its second-quarter financial   results. Revenue climbed 8% to hit a record and rise above the $1   billion mark. However, comparable sales were up a more modest 2%   from year-ago levels, and despite comps growth of 16% rise in the   Aerie store concept, American Eagle's namesake stores saw comps   fall 1% over the same period. The retailer said that seasonal   issues related to the back-to-school season played a role in   holding American Eagle back. The company's hopeful that the rest   of the year will go well, but investors will have to wait to see   if consumers help the retailer recover during the key holiday   season.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Tyson Foods saw its stock sink 8% following its announcement   tha   t earnings    for its fiscal fourth quarter wouldn't live up to prior   expectations. The   meat producer     said that volatility in the commodities markets, costs of   following enhanced food safety initiatives, a fire at one of its   processing plants, and some other challenges all combined to hurt   Tyson's prospects for fourth-quarter growth. CEO Noel White tried   to stay positive, noting that the company's outlook for fiscal   2020 remains positive. However, it could take a while for   investors to work through all the issues Tyson has before   longer-term gains become possible -- especially given   the competition that the meat company is now   facing    .",
    "Finally, shares of   USA Technologies plunged 22%    . The payment and software services company said that it isn't   likely to meet a Sept. 9 deadline to file all required financial   reports with the U.S. Securities and Exchange Commission. USA   Technologies is late on its fiscal 2018 annual report and on   three subsequen   t quarterly   report    s, and it hopes to get current by Sept. 23. However, investors   are scared that since the company is out of compliance with   Nasdaq listing requirements, it might not be able to get   everything done before the stock gets delisted.",
    "  Offer from The Motley Fool: The 10 best stocks to buy     now            Motley Fool co-founders Tom and David Gardner have spent more     than a decade beating the market. In fact, the newsletter they     run,     Motley Fool Stock Advisor      , has quadrupled the S&P 500!* Tom and David just revealed their ten top stock picks for     investors to buy right now.  Click here to get access to the full       list!   *      Stock Advisor     returns as of June 1, 2019.  ",
    " Offer from The Motley Fool: The 10 best stocks to buy     now            Motley Fool co-founders Tom and David Gardner have spent more     than a decade beating the market. In fact, the newsletter they     run,     Motley Fool Stock Advisor      , has quadrupled the S&P 500!*",
    "Tom and David just revealed their ten top stock picks for     investors to buy right now.",
    " Click here to get access to the full       list! ",
    " *      Stock Advisor     returns as of June 1, 2019. ",
    "  Dan Caplinger      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 04:34:00"
}