{
  "url": "https://www.nasdaq.com/article/latam-stock-markets-underpinned-by-riskon-sentiment-fx-mixed-20190911-00551",
  "title": "Latam stock markets underpinned by risk-on sentiment; FX mixed - Nasdaq.com",
  "text": [
    "Sept 11 (Reuters) - Most Latin American stocks rose on Wednesday as the prospect of increased stimulus in major economies underpinned risk-on buying in emerging markets, with safe-haven plays such as gold and bonds taking a backseat.",
    "MSCI's index of Latin American stocks  added 1.5% to climb to a near one-month high, while currencies were mixed against a strong dollar.",
    "Investors perceived a conciliatory move from China to  exempt 16 types of U.S. products from additional retaliatory tariffs for a year as a positive step in the trade war between Washington and Beijing. ",
    "Investors are looking forward to the European Central Bank's monetary policy meeting on Thursday, where officials are widely expected to trim interest rates and introduce a stimulus package to shore up economic growth.",
    "Brazil's Bovespa index  gained about 0.9%, with consumer discretionary stocks accounting for most gains after data showed retail sales in July marked their biggest rise so far this year. ",
    "Financial services provider B3 SA Brasil Bolsa Balcao  rose 3% and was the biggest boost to the Bovespa, while apparel retailer Lojas Renner SA  rose about 2%.",
    "Stock indices in Mexico  and Colombia  gained  between 0.3% and 0.4%.",
    "Currencies in the region were more mixed, with Brazil's real  gaining 0.4%, while Colombia's peso  shed 0.3%.",
    "Colombia is slated to take out nearly 19.2 trillion pesos ($5.7 billion) in new debt to finance next year's budget, Finance Minister Alberto Carrasquilla told Congress on Tuesday, without specifying whether the funds would come from bonds, loans or other sources. ",
    "The Chilean peso  retreated more than 0.4% against the dollar, as the price of copper, the country's top export, continued to fall on weak demand for the metal. MET/L",
    "The Mexican peso  and the Colombian peso fell about 0.3% each. Both currencies had gained substantially over the last week, tracking robust oil prices. O/R",
    "Latin American stock indexes and currencies at 1417 GMT"
  ],
  "published_datetime": "2019-09-11 10:43:00"
}