{
  "url": "https://www.nasdaq.com/article/not-so-fast-central-banks-push-back-against-markets-greedy-for-stimulus-20190912-00043",
  "title": "Not so fast: central banks push back against markets greedy for stimulus - Nasdaq.com",
  "text": [
    "By Sujata Rao and Saikat Chatterjee",
    "Sept 12 (Reuters) - High on hopes of never-ending central bank stimulus and desperate for clarity on the size and timing of their next fix, financial markets look like they are being walked back from the more aggressive bets by officials wary of excessive exuberance.",
    "Bond yields have jumped back from record lows this week, with investors forced to unwind some of their more extreme positions as central bankers, from the U.S. Federal Reserve to Reserve Bank of Australia, indicated that in pricing swingeing cuts to policy rates, markets might just be getting it wrong.",
    "But there are signs also that central bankers across the developed world are reaching the limits of their patience - with markets as well as governments, which have for over a decade relied on monetary policy to save the day.",
    "This month investors were wrongfooted by central banks in    Sweden, Canada and Australia; none were expected to cut interest rates, but all sounded unexpectedly upbeat on the state of their economies.",
    "Sweden's Riksbank stuck to flagging rate hikes, while the Bank of Canada made no mention of policy easing plans, sending October rate cut bets to about 50% from nearly 70% ",
    "In fact, expectations for year-end rate cuts have been pared back almost across the board:",
    "As for the Fed, expectations of a half-point cut in September have receded to zero, while traders now price some 55 basis points (bps) of cuts by year-end versus 70 bps a month ago.",
    "Even at the European Central Bank, arguably the institution with the most reason to deliver stimulus, there are reports of growing dissent about the need to unleash another big bond-buying round just yet.",
    "This week, it will trim rates and announce some bond-buying,  but bond yields have nonetheless risen almost 20 bps and money markets have reined in bets on a bigger 20 bps cut this month.",
    "\"Central banks are saying 'look we are aware of the balance of risks but you may have got a bit ahead of yourselves',\" said Stewart Robertson, senior economist at Aviva Investors.",
    "\"The other thing is that although growth has slowed around the world it hasn't collapsed. So possibly things are not as dismal as some parts of financial markets have pencilled in.\"",
    "Central bankers have been at pains to stress this, pointing to robust labour markets and wage growth, alongside still strong retail sales that hint that consumption spending almost everywhere is holding up.",
    "While Fed research estimates a $200 billion hit to U.S. GDP by early 2020 from the trade war, U.S. companies are continuing to hire and wages and hours worked both rose in August. Fed boss Jerome Powell has said he expected the U.S. and world economies to avoid recession.",
    "And economic surprise indexes from Citi - essentially comparing how data compares to consensus forecasts - show positive surprises at a one-year high across G10 countries, with U.S. and British indexes rising into positive territory.",
    "G10",
    "Even in the euro zone, where the index is deep below zero, data surprises have ticked higher of late.",
    "\"We don't think the data is so bad. Markets over-reacted to the downside and went way past fair value, so now we are seeing a correction,\" Justin Onuekwusi, a portfolio manager at Legal & General Investment Management, said.",
    "CAN'T, NOT WON'T",
    "Central banks have made clear interest rates will stay near record lows for years more. But it's also evident that the decade-old rate cut and stimulus cycle is generating deep divisions within the banks themselves.",
    "For one, most of them reckon monetary policy may be coming up against the limits of what it can achieve and may even do harm. For instance, banks, already in poor shape, will not fare well under even lower interest rates.",
    "Then there is the issue of markets' addiction to stimulus -   economist and former U.S. Treasury official Lawrence Summers has warned of \"black hole monetary economics\" where small interest rate changes and more aggressive stimulus strategies have limited impact.",
    "Craig Inches, head of rates and cash at Royal London Asset Management, described central banks' as experiencing \"a sort of fatigue\".",
    "While each round of stimulus yields diminishing returns, there is also the risk that additional asset purchases will further reduce the free-float and liquidity of many bond markets, he said.",
    "\"Central banks have been calling for fiscal help for some time and saying monetary policy is not enough to get the economy back in shape,\" Inches said. \"Now they are pushing back to politicians to say the baton is over to you, you need to do more on fiscal policy.\"",
    "Politicians may finally be listening. Britain and the United States are mulling higher budget spending and even Germany may be on the brink of overcoming its long-held aversion to fiscal stimulus.",
    "\"The balance is still in favour of negative yields and rate cuts. But markets have had a healthy correction and people are saying that maybe it's not a one way bet anymore.\" Inches said."
  ],
  "published_datetime": "2019-09-12 02:00:00"
}