{
  "url": "https://www.nasdaq.com/article/why-these-bank-stocks-got-clobbered-in-august-cm1210319",
  "title": "Why These Bank Stocks Got Clobbered in August - Nasdaq.com",
  "text": [
    " What happened Shares of numerous bank stocks fell by double-digit   percentages during August, according to data provided by      S&P Global Market Intelligence    . These included smaller banks like   SVB Financial Group    (NASDAQ: SIVB) , online banker   Discover Financial Services    (NYSE: DFS) , regional banks like Cincinnati-based   Fifth Third Bancorp    (NASDAQ: FITB) and Buffalo-based   M&T Bank    (NYSE: MTB) , and international banks like Britain's   Barclays PLC    (NYSE: BCS) and the Netherlands'   ING Groep NV    (NYSE: ING) . It didn't seem to matter whether the stocks had been doing   well, like Discover's (which is still up more than 35% year to   date), or poorly, like Barclays' (down about 7% year to date).   None had been the subject of major negative news during the   month, although you could argue that Brexit uncertainty may have   affected European banks' shares more than the others. But a   potential Brexit is likely to have broader effects on the global   economy, and that was just one of the issues weighing on bank   stocks during the month.   The stock market hammered financial industry stocks in     August. Image source: Getty Images.makeArticleAd();  So what These stocks' performances looked surprisingly similar during   the month:          ^SPX    data by   YCharts.  Share prices followed the same pattern: a steep drop at the   beginning of the month gradually eased off as it progressed. This   was seen across the banking sector and was a result of a number   of factors. The first big catalyst for bank stocks' August decline   occurred on the last day of July, when the Federal Reserve board   voted to cut the federal funds rate by a quarter percentage   point. As a result, interest rates are now set to hover between   2% and 2.25%. That's good for borrowers, because the costs of   borrowing for credit cards, loans, and mortgages will be lower.   It's not so good for the banks that issue those cards, loans, and   mortgages, which will now see their margins contract on those   products, eating into their profits. Rate cuts by the Fed often   send bank stocks lower, and this appears to have been no   exception. It's possible that bank stocks could have bounced back from   the rate cut, but throughout the month, there were troubling   signs that the economy -- both in the U.S. and globally -- might   be showing signs of weakness. What else Fears of a recession began to emerge in August, and that also   weighed on bank stocks. Recessions, bad for the stock market in   general, are particularly tough on banks as consumers pull back   on big purchases that require new loans and mortgages. And some   borrowers may default on the debt they already have. On Aug. 14, the yield spread between the two-year and 10-year   U.S. Treasury notes flipped. That is, the yield on the   shorter-term notes was higher than on the longer-term benchmark   notes. The same thing occurred in the U.K. This so-called   inverted yield curve is widely considered to be a recession   indicator, and in fact has preceded the last seven U.S.   recessions, although the time between the inversion and the onset   of a recession has varied. And on Aug. 23, the U.S. and China escalated their ongoing   trade war, announcing tit-for-tat tariff increases. China said it   would put 5% to 10% tariffs on another set of U.S. goods, and   reinstate a 25% duty on American-made automobiles. The Trump   administration responded by raising an existing 10% duty on   Chinese goods to 15% in September and hiking a 25% tariff on   other goods to 30% in October. Added to this were concerns about the U.S. deficit, the   potential of the U.K. to \"crash out\" of the European Union under   Prime Minister Boris Johnson, and declines in German   manufacturing output and record negative bond yields. With all   that going on, the likelihood of further -- and possibly steeper   -- rate cuts from the Fed increased. All in all, it's a wonder   that bank stocks didn't fall further than they did. Now what The silver lining for investors is that these declines have   pushed these bank stocks into bargain territory. All are trading   at or near five-year-low earnings multiples. For example, M&T   is currently at a price-to-earnings ratio of 11.1, after having   been above 15 since 2014. Fifth Third and Discover are both   trading below 10 times earnings.   Despite a stellar second quarter    , SVB is trading at 9.8 times earnings, its lowest level since   the Great Recession. Meanwhile, European banks ING and Barclays   have P/E ratios below 8. But these low prices may be justified, at least in the short   term. If a U.S. or global recession hits, bank stocks are likely   to sink further. Even if a recession doesn't officially hit, but   market uncertainty continues, they could still see their shares   suffer. Still, for long-term investors, this may be a golden   opportunity to pick up some   shares of financial companies    on the cheap. Just be prepared to hold them for a while.   10 stocks we like better than Fifth Third     Bancorp       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Fifth Third Bancorp     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       SVB Financial provides credit and banking services to The     Motley Fool.     John Bromels      owns shares of Fifth Third Bancorp. The Motley Fool owns shares     of and recommends SVB Financial Group. The Motley Fool has a     disclosure policy      .  ",
    "Shares of numerous bank stocks fell by double-digit   percentages during August, according to data provided by      S&P Global Market Intelligence    . These included smaller banks like   SVB Financial Group    (NASDAQ: SIVB) , online banker   Discover Financial Services    (NYSE: DFS) , regional banks like Cincinnati-based   Fifth Third Bancorp    (NASDAQ: FITB) and Buffalo-based   M&T Bank    (NYSE: MTB) , and international banks like Britain's   Barclays PLC    (NYSE: BCS) and the Netherlands'   ING Groep NV    (NYSE: ING) .",
    "It didn't seem to matter whether the stocks had been doing   well, like Discover's (which is still up more than 35% year to   date), or poorly, like Barclays' (down about 7% year to date).   None had been the subject of major negative news during the   month, although you could argue that Brexit uncertainty may have   affected European banks' shares more than the others. But a   potential Brexit is likely to have broader effects on the global   economy, and that was just one of the issues weighing on bank   stocks during the month.",
    "  The stock market hammered financial industry stocks in     August. Image source: Getty Images.makeArticleAd(); ",
    "The stock market hammered financial industry stocks in     August. Image source: Getty Images.",
    "These stocks' performances looked surprisingly similar during   the month:",
    "    ^SPX    data by   YCharts. ",
    "Share prices followed the same pattern: a steep drop at the   beginning of the month gradually eased off as it progressed. This   was seen across the banking sector and was a result of a number   of factors.",
    "The first big catalyst for bank stocks' August decline   occurred on the last day of July, when the Federal Reserve board   voted to cut the federal funds rate by a quarter percentage   point. As a result, interest rates are now set to hover between   2% and 2.25%. That's good for borrowers, because the costs of   borrowing for credit cards, loans, and mortgages will be lower.   It's not so good for the banks that issue those cards, loans, and   mortgages, which will now see their margins contract on those   products, eating into their profits. Rate cuts by the Fed often   send bank stocks lower, and this appears to have been no   exception.",
    "It's possible that bank stocks could have bounced back from   the rate cut, but throughout the month, there were troubling   signs that the economy -- both in the U.S. and globally -- might   be showing signs of weakness.",
    "Fears of a recession began to emerge in August, and that also   weighed on bank stocks. Recessions, bad for the stock market in   general, are particularly tough on banks as consumers pull back   on big purchases that require new loans and mortgages. And some   borrowers may default on the debt they already have.",
    "On Aug. 14, the yield spread between the two-year and 10-year   U.S. Treasury notes flipped. That is, the yield on the   shorter-term notes was higher than on the longer-term benchmark   notes. The same thing occurred in the U.K. This so-called   inverted yield curve is widely considered to be a recession   indicator, and in fact has preceded the last seven U.S.   recessions, although the time between the inversion and the onset   of a recession has varied.",
    "And on Aug. 23, the U.S. and China escalated their ongoing   trade war, announcing tit-for-tat tariff increases. China said it   would put 5% to 10% tariffs on another set of U.S. goods, and   reinstate a 25% duty on American-made automobiles. The Trump   administration responded by raising an existing 10% duty on   Chinese goods to 15% in September and hiking a 25% tariff on   other goods to 30% in October.",
    "Added to this were concerns about the U.S. deficit, the   potential of the U.K. to \"crash out\" of the European Union under   Prime Minister Boris Johnson, and declines in German   manufacturing output and record negative bond yields. With all   that going on, the likelihood of further -- and possibly steeper   -- rate cuts from the Fed increased. All in all, it's a wonder   that bank stocks didn't fall further than they did.",
    "The silver lining for investors is that these declines have   pushed these bank stocks into bargain territory. All are trading   at or near five-year-low earnings multiples. For example, M&T   is currently at a price-to-earnings ratio of 11.1, after having   been above 15 since 2014. Fifth Third and Discover are both   trading below 10 times earnings.   Despite a stellar second quarter    , SVB is trading at 9.8 times earnings, its lowest level since   the Great Recession. Meanwhile, European banks ING and Barclays   have P/E ratios below 8.",
    "But these low prices may be justified, at least in the short   term. If a U.S. or global recession hits, bank stocks are likely   to sink further. Even if a recession doesn't officially hit, but   market uncertainty continues, they could still see their shares   suffer. Still, for long-term investors, this may be a golden   opportunity to pick up some   shares of financial companies    on the cheap. Just be prepared to hold them for a while.",
    "  10 stocks we like better than Fifth Third     Bancorp       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Fifth Third Bancorp     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Fifth Third     Bancorp       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Fifth Third Bancorp     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " SVB Financial provides credit and banking services to The     Motley Fool.     John Bromels      owns shares of Fifth Third Bancorp. The Motley Fool owns shares     of and recommends SVB Financial Group. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:44:00"
}