{
  "url": "https://www.nasdaq.com/article/ageing-angry-birds-hit-rovio-2019-outlook-shares-plummet-20190912-00116",
  "title": "Ageing Angry Birds hit Rovio 2019 outlook, shares plummet - Nasdaq.com",
  "text": [
    "By Tarmo Virki",
    "Sept 12 (Reuters) - The Finnish maker of Angry Birds games cut its 2019 earnings outlook on Thursday due to lower-than-expected revenue from brand licensing and from older games, wiping a fifth off the value of Rovio Entertainment's  share price.",
    "Rovio, whose Angry Birds celebrate their 10th anniversary this year, said it would invest more in promoting new games.",
    "Analysts on average had forecast a 10.4% operating profit margin on sales of 317 million euros, according to Refinitiv data. Last year, the company achieved an 11% margin on revenues of 281 million euros.",
    "Analysts said Thursday's announcement was a surprise as Rovio had reiterated its previous outlook just a month ago, although they said the original guidance had been challenging. ",
    "\"Reaching the previous guidance was uncertain and our forecast was at the lower end of the range. However, this new change in guidance is massive,\" said Kimmo Stenvall from OP Markets.",
    "Rovio said its new games Angry Birds Dream Blast and Sugar Blast were performing well and the company was investing more than earlier planned in their growth.",
    "\"We see a window of opportunity in the market to scale up our top games and we are seizing this opportunity,\" Rovio Chief Executive Kati Levoranta said in a statement.",
    "\"The increase in user acquisition investments naturally leads to a lower profitability for 2019 and 2020 as we work towards building growth and long-term cash flows,\" she said.",
    "Levoranta said the company aimed to keep a high level of user acquisition investments for the rest of the year and planned to launch two to three new games in the market this year.",
    "($1 = 0.9079 euros)"
  ],
  "published_datetime": "2019-09-12 04:15:00"
}