{
  "url": "https://www.nasdaq.com/article/dave-busters-is-putting-its-coins-in-the-wrong-game-cm1210758",
  "title": "Dave & Buster's Is Putting Its Coins in the Wrong Game - Nasdaq.com",
  "text": [
    " Every arcade-raised kid has spent a pocketful of tokens on a   game that never gets mastered, and that seems to be what    Dave & Buster's Entertainment    (NASDAQ: PLAY)  is doing these days with its business. The   chain of big-box entertainment centers that blend casual dining   with a high-tech video arcade is struggling, sending its stock   within pennies of a three-year low on Wednesday after posting   another disappointing financial report. Negative comps, a decline in net income, and hosing down its   full-year guidance for the second time in as many quarters are   not sitting well with investors, who are choosing other eateries   to satisfy their appetite for   restaurant stocks    . One potential silver lining is that profitability improved on a   per-share basis, but that's a facade created by its aggressive   share buybacks. Dave & Buster's points out that it has returned more than   $200 million to investors through the end of the second quarter   with stock repurchases and dividends, but the stock chart is   getting the last laugh. You can't brag about eating your own   cooking when that same appetite would've been so much better at   today's lower price points.makeArticleAd();   Image source: Dave & Buster's.  Let's play a game Dave & Buster's may have posted an 8% increase in revenue   and a 7% uptick in earnings per share, but there's more to the   two stories at opposite ends of the income statement. Yes, the   chain grew its top line by 8% to $344.6 million, but that was   with 11% more stores open now than it had a year earlier. Comps   at the 130-unit chain actually declined 1.8% for the quarter.   Negative store-level trends are a problem, as comps have declined   in   seven of the past eight    quarters. The 7% rise in net income per share -- going from $0.84 to   $0.90 -- is also not as applause-worthy as it sounds. Net income   actually declined from $33.8 million to $32.4 million over the   past year. The secret to this trick is that net income is being   divided by fewer shares outstanding as a result of the   buybacks. Dave & Buster's spent $149.1 million to repurchase 3.1   million shares in fiscal 2018, but that same money could wipe out   more than 3.6 million shares if spent today. The rules of the buyback game should be fairly straightforward   at Dave & Buster's:  Don't buy back stock when comps continue trending negative,     something that the chain expects to get worse during the latter     half of this fiscal year. Don't repurchase your shares when you're pruning back     guidance -- again -- and telling investors that the outlook is     getting worse given the competitive landscape of the industry,     and that turnaround initiatives are taking longer to pan     out. Don't go shopping for your own stock when your track record     of doing so has been lousy.  Dave & Buster's makes a living knowing how games work. It   just needs to get better at playing its own game. But after   fumbling seven of the past eight quarters, it remains to be seen   if it has enough change left over to see its own changes   through.   10 stocks we like better than Dave & Buster's     Entertainment       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Dave & Buster's     Entertainment wasn't one of them! That's right -- they think     these 10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Rick Munarriz      has no position in any of the stocks mentioned. The Motley Fool     recommends Dave & Buster's Entertainment. The Motley Fool     has a     disclosure policy      .  ",
    "Every arcade-raised kid has spent a pocketful of tokens on a   game that never gets mastered, and that seems to be what    Dave & Buster's Entertainment    (NASDAQ: PLAY)  is doing these days with its business. The   chain of big-box entertainment centers that blend casual dining   with a high-tech video arcade is struggling, sending its stock   within pennies of a three-year low on Wednesday after posting   another disappointing financial report.",
    "Negative comps, a decline in net income, and hosing down its   full-year guidance for the second time in as many quarters are   not sitting well with investors, who are choosing other eateries   to satisfy their appetite for   restaurant stocks    . One potential silver lining is that profitability improved on a   per-share basis, but that's a facade created by its aggressive   share buybacks.",
    "Dave & Buster's points out that it has returned more than   $200 million to investors through the end of the second quarter   with stock repurchases and dividends, but the stock chart is   getting the last laugh. You can't brag about eating your own   cooking when that same appetite would've been so much better at   today's lower price points.",
    "  Image source: Dave & Buster's. ",
    "Image source: Dave & Buster's.",
    "Dave & Buster's may have posted an 8% increase in revenue   and a 7% uptick in earnings per share, but there's more to the   two stories at opposite ends of the income statement. Yes, the   chain grew its top line by 8% to $344.6 million, but that was   with 11% more stores open now than it had a year earlier. Comps   at the 130-unit chain actually declined 1.8% for the quarter.   Negative store-level trends are a problem, as comps have declined   in   seven of the past eight    quarters.",
    "The 7% rise in net income per share -- going from $0.84 to   $0.90 -- is also not as applause-worthy as it sounds. Net income   actually declined from $33.8 million to $32.4 million over the   past year. The secret to this trick is that net income is being   divided by fewer shares outstanding as a result of the   buybacks.",
    "Dave & Buster's spent $149.1 million to repurchase 3.1   million shares in fiscal 2018, but that same money could wipe out   more than 3.6 million shares if spent today.",
    "The rules of the buyback game should be fairly straightforward   at Dave & Buster's:",
    "Dave & Buster's makes a living knowing how games work. It   just needs to get better at playing its own game. But after   fumbling seven of the past eight quarters, it remains to be seen   if it has enough change left over to see its own changes   through.",
    "  10 stocks we like better than Dave & Buster's     Entertainment       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Dave & Buster's     Entertainment wasn't one of them! That's right -- they think     these 10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Dave & Buster's     Entertainment       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Dave & Buster's     Entertainment wasn't one of them! That's right -- they think     these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Rick Munarriz      has no position in any of the stocks mentioned. The Motley Fool     recommends Dave & Buster's Entertainment. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 04:15:00"
}