{
  "url": "https://www.nasdaq.com/article/why-ball-corporation-stock-soared-in-august-cm1207919",
  "title": "Why Ball Corporation Stock Soared in August - Nasdaq.com",
  "text": [
    "Shares in beverage can packaging and aerospace component manufacturer Ball Corporation (NYSE: BLL) soared 12.5% in August, according to data provided by S&P Global Market Intelligence . The move is a bit unusual for two reasons.",
    "First, it wasn't really driven by the numbers in the second-quarter earnings (released at the start of the month) or the near-term outlook, but rather by the bullish long-term outlook given by management on the earnings call .",
    "Image source: Getty Images.",
    "Second, the recurring theme of industrial earnings in 2019 can be roughly characterized as \"aerospace good, most other industrial sectors deteriorating.\" However, it's the growth opportunities in Ball's beverage can packaging operations and outlook that are attracting the attention -- a good thing, because beverage packaging was responsible for 89% o f earnings in the first half, with the rest coming from aerospace.",
    "It's definitely about the long-term outlook, because earnings from overall beverage can packaging in the second quarter actually declined by $5 million to $293 million from the same period last year. CEO John Hayes explained this by saying, \"Our North and Central America segment was challenged with previously discussed U.S. aluminum scrap headwinds and sequential project start-up cost.\"",
    "Moreover, CFO Scott Morrison dampened full-year expectations for earnings before interest, tax, and depreciation ( EBITDA ) to meet management's target: \"With the North American scrap and operational headwinds that we faced in the first half, it makes the full year $2 billion of EBITDA challenging to hit.\" However, he did say Ball would \"exit this year on a $2 billion EBITDA run rate.\"",
    "Putting the near-term outlook to one side, management's commentary and long-term outlook suggested analysts should significantly upgrade their expectations. A few highlights from Hayes on the earnings call:",
    "The increase in growth expectations is being driven by an environmentally friendly move toward aluminum packaging as opposed to plastic and other packaging options.",
    "In fact, the challenge for the company seems to be on building out the capacity to meet future demand -- for example, Senior VP Daniel Fisher said \"every plant\" in its North America segment was running at full utilization. Capacity upgrades are already in progress, and Morrison served notice that Ball would be ramping up capital expenditures in the future in order to service growth.",
    "Management's bullish outlook seems to be backed by the sustainable trend toward sustainability and other environmental concerns -- the company is even launching an aluminum cup in order to meet anticipated demand. Moreover, the commentary is very positive.",
    "Investors can easily pencil in the impact of the company's exceeding its previously expected 10%-15% EPS growth rate, but Hayes' pronouncement that the long-term growth rate in beverage can packaging should now be seen as 4% rather than 2% suddenly takes Ball from being seen as sub-GDP growth company to looking like one capable of growing its top line in excess of GDP growth -- investors who like growth stocks take note! Throw in some margin expansion along the way and it's not hard to envision some positive scenarios.",
    "Trading on 26 times analyst expectations for EPS in 2020, Ball Corporation isn't a superficially cheap stock, but if it achieves management's expectation for 15%+ earnings growth in the next few years, then it will surely come into value range at some point. The question is the level of confidence that investors have in the brand-new world of aluminum packaging and even aluminum cups. For now, the market is feeling good about it.",
    "10 stocks we like better than Ball Corp\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Ball Corp wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Lee Samaha has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:22:00"
}