{
  "url": "https://www.nasdaq.com/article/gold-slips-from-six-year-peak-on-sinous-trade-optimism-20190905-00317",
  "title": "Gold slips from six year peak on Sino-U.S. trade optimism - Nasdaq.com",
  "text": [
    "By K. Sathya Narayanan",
    "Sept 5 (Reuters) - Gold retreated on Thursday as investors booked profits after the metal rallied to a six-year peak in the previous session and hopes of a thaw in U.S.-China trade ties spurred demand for riskier assets.",
    "Spot gold  fell 0.6% to $1,542.51 per ounce as of 1143 GMT, having scaled $1,557 on Wednesday, its highest since April 2013.",
    "\"The fact that they (U.S. and China) have agreed to restart talks probably has taken a little bit of steam off gold. We saw gold touching a high at $1,557, so it bounced down slightly; could just be an element of profit taking,\" said Philip Newman, a director at Metals Focus.",
    "China'sCommerce Ministry said its trade team would hold talks with U.S. counterparts in mid-September in preparation for high-level negotiations in early October, while the ministry spokesman said Beijing opposed any escalation in the trade war. ",
    "European shares rose to a one-month high, with further support coming from a decision by British lawmakers to vote against a no-deal Brexit and the withdrawal of an extradition bill that had triggered months of protests in Hong Kong. MKTS/GLOB",
    "However, \"just because the U.S. and China have agreed to restart talks, it doesn't detract from the extent to which that dispute has escalated and deepened, adding to a sense that global growth would slow,\" Newman said, adding there was still tremendous uncertainty about Brexit.",
    "Gold has jumped about 20% this year as the bruising trade war between the world's two largest economies has sparked fears of a deceleration in global economic growth and encouraged interest rate cuts by major central banks around the world.",
    "Analysts also said the likelihood of further easing in monetary policy and negative yielding debts around the world provided support for bullion, keeping it close to its recent six-year peak.",
    "Federal fund futures  imply traders see a 89% chance of a 25 basis point rate cut by the U.S. Federal Reserve this month.",
    "Lower interest rates and Treasury yields reduce the opportunity cost of holding non-yielding bullion.",
    "Among other precious metals, silver  eased about 1.7% to $19.25 per ounce, but was near a three-year high of $19.64 it touched in the previous session.",
    "Platinum  dipped 0.9% to $976.61, having touched its highest since February 2018 earlier in the session, while palladium  was up 0.1% to $1,555 per ounce, holding close to its highest in more than 1-1/2 months hit on Wednesday."
  ],
  "published_datetime": "2019-09-05 06:33:00"
}