{
  "url": "https://www.nasdaq.com/article/the-1-lng-stock-for-2020-cm1206967",
  "title": "The #1 LNG Stock for 2020 - Nasdaq.com",
  "text": [
    " By 2020,   Cheniere Energy    (NYSEMKT: LNG) hopes to be one of the top 5 global suppliers of   liquefied natural gas. To do that, the company is banking heavily   on two massive infrastructure projects, the Sabine Pass and   Corpus Christi export terminals. Both projects are over 1,000   acres. The terminals will be responsible for receiving, cooling,   and exporting natural gas from nearby plays such as the Permian   Basin in West Texas. Commonly referred to as LNG, liquefied natural gas is simply   natural gas in its liquid form. To liquefy natural gas, it must   be cooled to -260°F [-160°C], a process that condenses the gas to   occupy 1/600   th    of its original volume. Natural gas will not burn in its liquid   state, making LNG safe for international shipment. So, what makes LNG a valuable source of energy worth following   and potentially investing in?makeArticleAd();   Source: Getty Images  LNG frees energy-dependent countries, such as India, Japan,   and Korea, from pipelines. The ability to import LNG, turn it   back into a gas using what's called a regasification plant, and   then transport it through intrastate pipelines eliminates   dependence on a single natural gas source. Qatar, Australia, and   the United States are the 3 largest exporters of natural gas,   with several other mid-tier players. A competitive market driven   by several LNG exporters, multiple LNG transport vessel   manufacturers, and many spot markets provide the ingredients   necessary for a healthy energy source. Many Western European countries are chomping at the bit to   import affordable liquefied natural gas. As the main supplier of   natural gas to Europe, Russia has a near-monopoly on Western   European countries. This advantage creates pricing risk and   security risk for any country that imports natural gas. Home to long stretches of coastlines makes Western/Southern   European countries and Southeast Asian countries perfectly   positioned to construct LNG import terminals. Many already exist,   with several new regasification terminal projects under way. In   fact, the IEA projects that 50 countries will be importing LNG by   2025, up from just 10 at the start of this century . Cheniere's export terminals are strategically located right   along the Gulf of Mexico. The Sabine Pass LNG Terminal can house   up to six liquefaction trains capable of processing over 3.5   billion cubic feet per day (Bcfd) of natural gas.  LNG   plants consist of one or more trains responsible for cooling and   condensing natural gas. Whenever you hear LNG train, that's just   the part of the plant that liquefies the natural gas. The more   LNG trains, the more gas can be exported at any given time.   Currently, the Sabine Pass is the largest approved and   operational LNG export terminal in the United States. Driftwood   LNG's 4.0 Bcfd export terminal in Calcasieu Parish, LA has been   approved and is under construction.  Sources: *      https://www.ferc.gov/industries/gas/indus-act/lng/lng-existing-export.pdf  **      https://www.ferc.gov/industries/gas/indus-act/lng/lng-approved-export-new.pdf  Cheniere's Corpus Christi project is staging in its 3 LNG   trains. According to Cheniere, \"Train 1 is in operation, Train 2   is commissioning and is expected to be completed in 2H 2019, and   Train 3 is under construction with an expected completion date in   2H 2021.\"  A 23 mile, 48\" [122cm] pipeline connects The   Corpus Christi Liquefaction Project to several interstate and   intrastate pipelines, allowing the export terminal to receive   natural gas from several locations. Customers are already   lined up for the terminal's growing list of global buyers,   including Pertamina, Endesa, Iberdrola, Naturgy, Woodside, EDF,   EDP, Trafigura, and PetroChina. The scale and impact of Cheniere's projects are impressive,   but they come at heavy costs. The company has been on a spending   spree. Many of the projects won't see positive cash flows till   years after their first days of construction. As such, Cheniere's   price to earnings ratio (PE) currently sits at a whopping 95.7.   2020 should be much more reasonable, with a projected PE of   19.2.   10 stocks we like better than Cheniere Energy       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Cheniere Energy wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Daniel Foelber      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "By 2020,   Cheniere Energy    (NYSEMKT: LNG) hopes to be one of the top 5 global suppliers of   liquefied natural gas. To do that, the company is banking heavily   on two massive infrastructure projects, the Sabine Pass and   Corpus Christi export terminals. Both projects are over 1,000   acres. The terminals will be responsible for receiving, cooling,   and exporting natural gas from nearby plays such as the Permian   Basin in West Texas.",
    "Commonly referred to as LNG, liquefied natural gas is simply   natural gas in its liquid form. To liquefy natural gas, it must   be cooled to -260°F [-160°C], a process that condenses the gas to   occupy 1/600   th    of its original volume. Natural gas will not burn in its liquid   state, making LNG safe for international shipment.",
    "So, what makes LNG a valuable source of energy worth following   and potentially investing in?",
    "  Source: Getty Images ",
    "Source: Getty Images",
    "LNG frees energy-dependent countries, such as India, Japan,   and Korea, from pipelines. The ability to import LNG, turn it   back into a gas using what's called a regasification plant, and   then transport it through intrastate pipelines eliminates   dependence on a single natural gas source. Qatar, Australia, and   the United States are the 3 largest exporters of natural gas,   with several other mid-tier players. A competitive market driven   by several LNG exporters, multiple LNG transport vessel   manufacturers, and many spot markets provide the ingredients   necessary for a healthy energy source.",
    "Many Western European countries are chomping at the bit to   import affordable liquefied natural gas. As the main supplier of   natural gas to Europe, Russia has a near-monopoly on Western   European countries. This advantage creates pricing risk and   security risk for any country that imports natural gas.",
    "Home to long stretches of coastlines makes Western/Southern   European countries and Southeast Asian countries perfectly   positioned to construct LNG import terminals. Many already exist,   with several new regasification terminal projects under way. In   fact, the IEA projects that 50 countries will be importing LNG by   2025, up from just 10 at the start of this century .",
    "Cheniere's export terminals are strategically located right   along the Gulf of Mexico. The Sabine Pass LNG Terminal can house   up to six liquefaction trains capable of processing over 3.5   billion cubic feet per day (Bcfd) of natural gas.  LNG   plants consist of one or more trains responsible for cooling and   condensing natural gas. Whenever you hear LNG train, that's just   the part of the plant that liquefies the natural gas. The more   LNG trains, the more gas can be exported at any given time.   Currently, the Sabine Pass is the largest approved and   operational LNG export terminal in the United States. Driftwood   LNG's 4.0 Bcfd export terminal in Calcasieu Parish, LA has been   approved and is under construction.",
    "Sources: *      https://www.ferc.gov/industries/gas/indus-act/lng/lng-existing-export.pdf ",
    "**      https://www.ferc.gov/industries/gas/indus-act/lng/lng-approved-export-new.pdf ",
    "Cheniere's Corpus Christi project is staging in its 3 LNG   trains. According to Cheniere, \"Train 1 is in operation, Train 2   is commissioning and is expected to be completed in 2H 2019, and   Train 3 is under construction with an expected completion date in   2H 2021.\"  A 23 mile, 48\" [122cm] pipeline connects The   Corpus Christi Liquefaction Project to several interstate and   intrastate pipelines, allowing the export terminal to receive   natural gas from several locations. Customers are already   lined up for the terminal's growing list of global buyers,   including Pertamina, Endesa, Iberdrola, Naturgy, Woodside, EDF,   EDP, Trafigura, and PetroChina.",
    "The scale and impact of Cheniere's projects are impressive,   but they come at heavy costs. The company has been on a spending   spree. Many of the projects won't see positive cash flows till   years after their first days of construction. As such, Cheniere's   price to earnings ratio (PE) currently sits at a whopping 95.7.   2020 should be much more reasonable, with a projected PE of   19.2.",
    "  10 stocks we like better than Cheniere Energy       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Cheniere Energy wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Cheniere Energy       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Cheniere Energy wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Daniel Foelber      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 17:04:00"
}