{
  "url": "https://www.nasdaq.com/article/weak-data-brexit-woes-knock-european-stocks-off-1month-high-20190903-00929",
  "title": "Weak data, Brexit woes knock European stocks off 1-month high - Nasdaq.com",
  "text": [
    "    * Lawmakers seek to block no-deal Brexit",
    "* London's FTSE down after four-day run of gains ",
    "* U.S. manufacturing contracts for first time in 3 yrs (Updates to close)",
    "Sept 3 (Reuters) - European shares retreated from a 1-monthhigh on Tuesday as weak U.S. factory data added to worries aboutglobal growth, while uncertainty over Britain's chaotic exitfrom the European Union knocked the FTSE 100 lower after afour-day run of gains.",
    "The pan-European STOXX 600 index .STOXX dropped 0.2% atthe close after falling as much as 0.7% following the release ofdata showing U.S. manufacturing activity contracted for thefirst time in three years in August. urn:newsml:reuters.com:*:nL2N25R073",
    "The Institute for Supply Management's latest numbers came asstark evidence of the U.S.-China trade war taking a toll onglobal growth, sending risky assets such as oil and globalstocks lower. O/RMKTS/GLOB",
    "Europe had its own headache to deal with. After BritishPrime Minister Boris Johnson on Monday implicitly warnedlawmakers to back him on Brexit or face an election, an allianceof opposition lawmakers and rebels in Johnson's ConservativeParty began a bid to stop to block a no-deal exit. ",
    "A vote is expected after 2000 GMT. urn:newsml:reuters.com:*:nL5N25U0GW",
    "Johnson lost his working majority in parliament when one ofhis Conservative lawmakers defected to the pro-European UnionLiberal Democrats. urn:newsml:reuters.com:*:nL9N25G000",
    "London's mid-cap stocks .FTMC , traditionally harder hit byBrexit concerns, bounced off early lows to close down 0.1% whilethe blue-chip index .FTSE fell 0.2% as sterling rebounded. GBP/",
    "\"The likelihood of general election has just gone up giventhe fact that they no longer have the parliamentary majority,\"said Will James, senior investment director for Europeanequities at Aberdeen Standard Investments in London.",
    "\"If we see continued period of sterling strength, I wouldexpect domestically focused mid-cap FTSE 250 names tooutperform. People are currently are quite underweight on the UKnames than the more globally exposed large-cap names.\"",
    "STIMULUS PACKAGE",
    "European stocks gained some ground after Reuters reportedthat European Central Bank policymakers are leaning towards astimulus package that includes a rate cut, a beefed-up pledge tokeep rates low for longer and compensation for banks over theside-effects of negative rates, according to sources. urn:newsml:reuters.com:*:nL3N25U2YQ",
    "The ECB has all but promised to announce more stimulus afterits Sept 12 meeting to support a slowing eurozone economy, hitby an escalation in the U.S.-China trade war.",
    "After both sides imposed tariffs on each other's goods,Washington and Beijing officials are struggling to schedule ameeting this month to renew trade talks, Bloomberg reported onMonday. urn:newsml:reuters.com:*:nFWN25T09M",
    "The rising worries encouraged investors to shift away fromrisky equities to safe-haven assets such as government bonds,resulting in yields on German and Italian 10-year bonds hittinga record low. ",
    "Trade-sensitive shares of Germany.GDAXI and France.FCHI were down about 0.4% each, while Milan-listed shares .FTMIB closed down 0.3%.",
    "In Italy, members of 5-Star are holding a ballot on theparty's internet platform on Tuesday to decide whether the groupshould join forces with the Democratic Party, its traditionalfoe, and expectations are that 5-Star members will approve acoalition deal. urn:newsml:reuters.com:*:nR1N23K01P",
    "Defensive sectors such as utilities and telecoms were amongthe few sectors gaining in the STOXX 600, while oil and gascompanies led decliners with a 0.9% loss as oil prices sank. O/R",
    "Shares of Takeaway.comTKWY.AS dropped 5.9% after a topshareholder in Just EatJE.L said it would vote against theBritish food delivery company's proposed 9 billion pound ($11billion) merger with Takeaway.com. Shares of Just Eat slid 2.8%,dragging the retail index .SXRP down 0.4%. urn:newsml:reuters.com:*:nL5N25U1K5",
    "France's second largest telecoms operator Iliad ILD.PA fell 6.3%, the biggest decliner on the STOXX 600, after itreported a loss of 127,000 mobile subscribers to competitors inthe first half of the year. urn:newsml:reuters.com:*:nL5N25U1VX (Reporting by Sruthi Shankar and Medha Singh in Bengaluru,Editing by William Maclean) ((sruthi.shankar@thomsonreuters.com; within U.S. +1 646 2238780; outside U.S. +91 80 6749 6328))"
  ],
  "published_datetime": "2019-09-03 12:36:00"
}