{
  "url": "https://www.nasdaq.com/article/is-pilgrims-pride-ppc-outperforming-other-consumer-staples-stocks-this-year-cm1210448",
  "title": "Is Pilgrim's Pride (PPC) Outperforming Other Consumer Staples Stocks This Year? - Nasdaq.com",
  "text": [
    " Investors focused on the Consumer Staples space have likely heard of Pilgrim's Pride (PPC), but is the stock performing well in comparison to the rest of its sector peers? A quick glance at the company's year-to-date performance in comparison to the rest of the Consumer Staples sector should help us answer this question. Pilgrim's Pride is one of 176 companies in the Consumer Staples group. The Consumer Staples group currently sits at #6 within the Zacks Sector Rank. The Zacks Sector Rank considers 16 different groups, measuring the average Zacks Rank of the individual stocks within the sector to gauge the strength of each group. The Zacks Rank emphasizes earnings estimates and estimate revisions to find stocks with improving earnings outlooks. This system has a long record of success, and these stocks tend to be on track to beat the market over the next one to three months. PPC is currently sporting a Zacks Rank of #1 (Strong Buy). Over the past three months, the Zacks Consensus Estimate for PPC's full-year earnings has moved 8.74% higher. This is a sign of improving analyst sentiment and a positive earnings outlook trend. Our latest available data shows that PPC has returned about 99.48% since the start of the calendar year. In comparison, Consumer Staples companies have returned an average of 19.54%. As we can see, Pilgrim's Pride is performing better than its sector in the calendar year. To break things down more, PPC belongs to the Food - Meat Products industry, a group that includes 5 individual companies and currently sits at #12 in the Zacks Industry Rank. Stocks in this group have gained about 34.01% so far this year, so PPC is performing better this group in terms of year-to-date returns. Investors in the Consumer Staples sector will want to keep a close eye on PPC as it attempts to continue its solid performance.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Pilgrim's Pride Corporation (PPC): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors focused on the Consumer Staples space have likely heard of Pilgrim's Pride (PPC), but is the stock performing well in comparison to the rest of its sector peers? A quick glance at the company's year-to-date performance in comparison to the rest of the Consumer Staples sector should help us answer this question.",
    "Pilgrim's Pride is one of 176 companies in the Consumer Staples group. The Consumer Staples group currently sits at #6 within the Zacks Sector Rank. The Zacks Sector Rank considers 16 different groups, measuring the average Zacks Rank of the individual stocks within the sector to gauge the strength of each group.",
    "The Zacks Rank emphasizes earnings estimates and estimate revisions to find stocks with improving earnings outlooks. This system has a long record of success, and these stocks tend to be on track to beat the market over the next one to three months. PPC is currently sporting a Zacks Rank of #1 (Strong Buy).",
    "Over the past three months, the Zacks Consensus Estimate for PPC's full-year earnings has moved 8.74% higher. This is a sign of improving analyst sentiment and a positive earnings outlook trend.",
    "Our latest available data shows that PPC has returned about 99.48% since the start of the calendar year. In comparison, Consumer Staples companies have returned an average of 19.54%. As we can see, Pilgrim's Pride is performing better than its sector in the calendar year.",
    "To break things down more, PPC belongs to the Food - Meat Products industry, a group that includes 5 individual companies and currently sits at #12 in the Zacks Industry Rank. Stocks in this group have gained about 34.01% so far this year, so PPC is performing better this group in terms of year-to-date returns.",
    "Investors in the Consumer Staples sector will want to keep a close eye on PPC as it attempts to continue its solid performance.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:30:12"
}