{
  "url": "https://www.nasdaq.com/article/why-range-resources-stock-is-rallying-today-cm1210581",
  "title": "Why Range Resources Stock Is Rallying Today - Nasdaq.com",
  "text": [
    "  What happened  Shares of   Range Resources    (NYSE: RRC) spiked as much as 12.6% by 10:45 a.m. EDT on   Wednesday. Fueling the   energy company    's rally was an update on how it planned to work around the   temporary shutdown of   Energy Transfer    's (NYSE: ET) Mariner East pipeline system.  So what  Range Resources provided investors with an update on how an   outage of Energy Transfer's Mariner East pipeline will impact its   operations. The midstream giant needs to shut that system down so   that it can perform optimization work at its Marcus Hook export   terminal. That will allow it to more efficiently transport   natural gas liquids (NGLs) to end markets.   Image source: Getty Images.makeArticleAd();  Range Resources typically transports ethane via the Mariner   East 1 pipeline. However, it will instead sell those volumes as   part of its natural gas stream. Meanwhile, it will ship propane   on Mariner East 2 instead of the first pipeline, so the outage   will have a minimal impact on production and cash flow. Overall,   the company expects its third-quarter output to be between 2.22   and 2.23 BCFE/d, which is slightly less than its original   guidance of 2.25 to 2.26 BCFE/d. Further, Range assured investors   that it remains on track to spend at or below its $756 million   capital budget this year.  Now what  Infrastructure outages can have a significant impact on the   ability of oil and gas companies to get their production to   market centers. However, that won't be the case for Range   Resources as Energy Transfer shuts down Mariner East 1 this   month, since it has ways to work around that situation. The   shutdown should have minimal impact on the company's   third-quarter results.   10 stocks we like better than Range Resources       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Range Resources wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Matthew DiLallo      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   Range Resources    (NYSE: RRC) spiked as much as 12.6% by 10:45 a.m. EDT on   Wednesday. Fueling the   energy company    's rally was an update on how it planned to work around the   temporary shutdown of   Energy Transfer    's (NYSE: ET) Mariner East pipeline system.",
    "Range Resources provided investors with an update on how an   outage of Energy Transfer's Mariner East pipeline will impact its   operations. The midstream giant needs to shut that system down so   that it can perform optimization work at its Marcus Hook export   terminal. That will allow it to more efficiently transport   natural gas liquids (NGLs) to end markets.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Range Resources typically transports ethane via the Mariner   East 1 pipeline. However, it will instead sell those volumes as   part of its natural gas stream. Meanwhile, it will ship propane   on Mariner East 2 instead of the first pipeline, so the outage   will have a minimal impact on production and cash flow. Overall,   the company expects its third-quarter output to be between 2.22   and 2.23 BCFE/d, which is slightly less than its original   guidance of 2.25 to 2.26 BCFE/d. Further, Range assured investors   that it remains on track to spend at or below its $756 million   capital budget this year.",
    "Infrastructure outages can have a significant impact on the   ability of oil and gas companies to get their production to   market centers. However, that won't be the case for Range   Resources as Energy Transfer shuts down Mariner East 1 this   month, since it has ways to work around that situation. The   shutdown should have minimal impact on the company's   third-quarter results.",
    "  10 stocks we like better than Range Resources       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Range Resources wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Range Resources       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Range Resources wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Matthew DiLallo      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:40:00"
}