{
  "url": "https://www.nasdaq.com/article/stock-market-news-today-september-4th-2019-cm1207530",
  "title": "Stock Market News Today: September 4th, 2019 - Nasdaq.com",
  "text": [
    " Stocks rose on Wednesday, buoyed by simmering tensions in Hong   Kong. The extradition bill that led to protests in Hong Kong was   withdrawn, raising hopes that a period of sometimes violent   unrest would soon end.  Data source: Yahoo! Finance. Apparel retailer   American Eagle    (NYSE: AEO) and meat processor   Tyson Foods    (NYSE: TSN) couldn't be saved by a rising market, both taking   hits due to disappointing results and guidance. American Eagle gets hammered For a mall-based apparel retailer,   American Eagle is doing surprisingly well    . Comparable sales rose 2% in the second quarter, and the company   beat analyst expectations across the board. But it wasn't enough   to stop investors from throwing in the towel. The stock was down   about 15.1% at 1:05 p.m. EDT. American Eagle generated second-quarter revenue of $1.04   billion, up 8% year over year and $40 million ahead of the   average analyst estimate. While the core American Eagle brand   suffered a 1% decline in comparable sales, the fast-growing Aerie   brand notched a 16% increase. It was the 19th straight quarter of   double-digit growth for Aerie.   Image source: American Eagle.  The company admitted that its results were a bit below its own   expectations due to weak sales of certain seasonal categories and   a delayed back-to-school shopping period. \"The AE team has taken   quick action to strengthen the business and we are pleased to see   an improvement in third quarter-to-date sales,\" said CEO Jay   Schottenstein. American Eagle reported adjusted earnings per share of $0.39,   a full $0.07 higher than analysts were expecting. The company   expects third-quarter adjusted EPS between $0.47 and $0.49,   driven by comparable sales growth in the low to mid single   digits. The ongoing trade war between the U.S. and China could be one   reason for the negative reaction to American Eagle's results.   Apparel from China was hit by the tariffs that went into effect   on Sept. 1. These levies could hurt the company's bottom line if   it's forced to absorb some of the costs. Tyson cuts its guidance Shares of   meat processor    Tyson Foods have been on a tear this year, nearly doubling since   bottoming out in late 2018. But a warning from the company about   \"short-term challenges\" in the fourth quarter has investors   looking for the exit. The stock was down about 6.2% at 1:05 p.m.   EDT. Tyson is facing a few issues, including margin compression   related to grain derivatives, commodity market volatility,   implementation of enhanced food safety initiatives, a fire at a   beef processing plant, and sluggish operational improvements in   the chicken business. \"The discrete challenges we've encountered this quarter now   lead us to believe we will fall short of our previously stated   guidance,\" said Tyson CEO Noel White. For the full year, the   company now expects to produce adjusted earnings per share   between $5.30 and $5.75. That's down from a range of $5.75 to   $6.10, which Tyson reiterated just last month. The suddenness of this guidance cut should be concerning to   investors, but the company sees at least some of these challenges   not repeating in fiscal 2020. Tyson also expects more favorable   market conditions next year. Tyson stock has been a strong performer this year, but some of   those gains may vanish as the company struggles to maintain the   bottom line.   10 stocks we like better than Tyson Foods       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Tyson Foods wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Timothy Green      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Stocks rose on Wednesday, buoyed by simmering tensions in Hong   Kong. The extradition bill that led to protests in Hong Kong was   withdrawn, raising hopes that a period of sometimes violent   unrest would soon end.",
    "Data source: Yahoo! Finance.",
    "Apparel retailer   American Eagle    (NYSE: AEO) and meat processor   Tyson Foods    (NYSE: TSN) couldn't be saved by a rising market, both taking   hits due to disappointing results and guidance.",
    "For a mall-based apparel retailer,   American Eagle is doing surprisingly well    . Comparable sales rose 2% in the second quarter, and the company   beat analyst expectations across the board. But it wasn't enough   to stop investors from throwing in the towel. The stock was down   about 15.1% at 1:05 p.m. EDT.",
    "American Eagle generated second-quarter revenue of $1.04   billion, up 8% year over year and $40 million ahead of the   average analyst estimate. While the core American Eagle brand   suffered a 1% decline in comparable sales, the fast-growing Aerie   brand notched a 16% increase. It was the 19th straight quarter of   double-digit growth for Aerie.",
    "  Image source: American Eagle. ",
    "Image source: American Eagle.",
    "The company admitted that its results were a bit below its own   expectations due to weak sales of certain seasonal categories and   a delayed back-to-school shopping period. \"The AE team has taken   quick action to strengthen the business and we are pleased to see   an improvement in third quarter-to-date sales,\" said CEO Jay   Schottenstein.",
    "American Eagle reported adjusted earnings per share of $0.39,   a full $0.07 higher than analysts were expecting. The company   expects third-quarter adjusted EPS between $0.47 and $0.49,   driven by comparable sales growth in the low to mid single   digits.",
    "The ongoing trade war between the U.S. and China could be one   reason for the negative reaction to American Eagle's results.   Apparel from China was hit by the tariffs that went into effect   on Sept. 1. These levies could hurt the company's bottom line if   it's forced to absorb some of the costs.",
    "Shares of   meat processor    Tyson Foods have been on a tear this year, nearly doubling since   bottoming out in late 2018. But a warning from the company about   \"short-term challenges\" in the fourth quarter has investors   looking for the exit. The stock was down about 6.2% at 1:05 p.m.   EDT.",
    "Tyson is facing a few issues, including margin compression   related to grain derivatives, commodity market volatility,   implementation of enhanced food safety initiatives, a fire at a   beef processing plant, and sluggish operational improvements in   the chicken business.",
    "\"The discrete challenges we've encountered this quarter now   lead us to believe we will fall short of our previously stated   guidance,\" said Tyson CEO Noel White. For the full year, the   company now expects to produce adjusted earnings per share   between $5.30 and $5.75. That's down from a range of $5.75 to   $6.10, which Tyson reiterated just last month.",
    "The suddenness of this guidance cut should be concerning to   investors, but the company sees at least some of these challenges   not repeating in fiscal 2020. Tyson also expects more favorable   market conditions next year.",
    "Tyson stock has been a strong performer this year, but some of   those gains may vanish as the company struggles to maintain the   bottom line.",
    "  10 stocks we like better than Tyson Foods       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Tyson Foods wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Tyson Foods       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Tyson Foods wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Timothy Green      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:51:00"
}