{
  "url": "https://www.nasdaq.com/article/venezuela-gold-reserves-drop-by-1-bln-in-first-half-2019-20190903-00923",
  "title": "Venezuela gold reserves drop by $1 bln in first half 2019 - Nasdaq.com",
  "text": [
    "By Corina Pons and Mayela Armas",
    "CARACAS, Sept 3 (Reuters) - Gold reserves held by Venezuela's central bank fell by $1 billion in the first half of 2019, official data released this week showed, amid opposition accusations that the government is selling the precious metal abroad to raise revenue in the face of U.S. sanctions.",
    "The value of the gold bars in central bank vaults fell to $4.62 billion, down 18.5% from $5.67 billion dollars at the end of 2018 - the lowest in 75 years, according to bank data.",
    "The drop corresponds to a decline of 26.36 tons of gold from reserves, leaving the bank with about 102.40 tons. About one-third of that is held by the Bank of England.",
    "Ruling Socialist Party officials accuse the Bank of England of refusing to repatriate the gold due to sanctions. The Bank of England has declined to comment, citing internal policy.",
    "Venezuela's central bank did not immediately respond to a request for comment.",
    "Last year, Maduro's government began exporting gold produced by informal miners in the southern jungles to Turkey for the first time. The value of central bank gold had already fallen by $1 billion in the second half of 2018, according to bank reserves.",
    "Despite Trump administration sanctions and pressure on traders not to buy Venezuelan gold, more than 16 tons of it left bank vaults for unknown destinations, according to legislators and officials of the Maduro government. ",
    "Two government sources indicated this week that the bank has again started taking gold out of coffers in August, adding that soldiers have been posted at the bank's headquarters in the last two months in an unusual stepping of security.",
    "The sources did not specify the volume of gold that could leave the bank."
  ],
  "published_datetime": "2019-09-03 11:56:00"
}