{
  "url": "https://www.nasdaq.com/article/what-trade-fears-wall-street-is-back-in-rally-mode-20190905-00926",
  "title": "What trade fears? Wall Street is back in rally mode - Nasdaq.com",
  "text": [
    "By Noel Randewich",
    "Sept 5 (Reuters) - U.S. stocks surged on Thursday on expectations of a de-escalation in trade tensions after Washington and Beijing agreed to hold high-level talks next month, while strong economic data eased fears of a domestic slowdown.",
    "After fears of a deepening trade war caused a sell-off in late July and early August, leading to speculation that a decade-long bull market was ending, the S&P 500 has largely recovered and is now less than 2% short of its July 26 record high close. The benchmark index has climbed 2.4% in the past two sessions.",
    "Alternating signs of improvement and deterioration in the U.S.-China trade war, often based on tweets and comments from Trump, have repeatedly sparked volatility on Wall Street in recent months.  ",
    "\"Whether the talks occur or not, we'll see. And whether they are productive, we're skeptical. But the market loves it,\" said Tim Ghriskey, Chief Investment Strategist at Inverness Counsel in New York. ",
    "The S&P information technology index  rose 1.9%, while financials  jumped 2.1%, both rising the most among the 11 major S&P 500 sectors.",
    "The interest rate-sensitive S&P 500 Banks Index surged 2.9%, following a rise in U.S. Treasury yields. US/",
    "The ADP National Employment Report, considered a precursor to the Labor Department's more comprehensive jobs report, showed U.S. private employers' payrolls grew at the fastest pace in four months in August, led by big gains in service-sector jobs. ",
    "Another private survey showed growth in U.S. services sectors accelerated in August, rebounding from its weakest level in nearly three years, as new orders rose to their highest level since February amid trade worries. ",
    "The upbeat reports eased concerns of an economic downturn, which was exacerbated by data on Tuesday that showed a contraction in U.S. factory activity in August. Investors will keep a close watch on the crucial nonfarm payrolls data due on Friday.",
    "\"Manufacturing is in a bit of a global slump, but if you look at the other economic data, like the services and jobs reports, none of them point to an economy that is teetering on a recession,\" said Michael Antonelli, market strategist at Robert W. Baird in Milwaukee.",
    "At 2:16 p.m. ET, the Dow Jones Industrial Average  was up 1.52% at 26,756.37 points, while the S&P 500  gained 1.33% to 2,976.78.",
    "     The Nasdaq Composite  added 1.63% to 8,106.94.",
    "In deal news, insurer Prudential Financial Inc  agreed to acquire online insurance start-up Assurance IQ Inc for $2.35 billion. Shares of Prudential fell 2.9%. ",
    "Sectors viewed as defensive declined, with the S&P utilities index , real estate index  and consumer staples index  all lower.  ",
    "Advancing issues outnumbered declining ones on the NYSE by a 2.01-to-1 ratio; on Nasdaq, a 2.77-to-1 ratio favored advancers.",
    "The S&P 500 posted 55 new 52-week highs and no new lows; the Nasdaq Composite recorded 70 new highs and 38 new lows. "
  ],
  "published_datetime": "2019-09-05 02:37:00"
}