{
  "url": "https://www.nasdaq.com/article/cocacola-proves-it-still-has-sizzle-with-new-us2bn-bond-20190904-01090",
  "title": "Coca-Cola proves it still has sizzle with new US$2bn bond - Nasdaq.com",
  "text": [
    "By William Hoffman",
    "NEW YORK, Sept 4 (IFR) - Coca-Cola priced a US$2bn two-part senior unsecured bond on Wednesday amid a stampede of issuers accessing the markets to take advantage of low rates.",
    "The bond was split evenly between a five-year priced at Treasuries plus 47bp and a 10-year at Treasuries plus 67bp.",
    "Coca-Cola is yet another example of a company unexpectedly bringing forward refinancing plans in a week during which issuers have already brought US$53.9bn of deals in just two days of trading.",
    "For example, Coca-Cola has US$15.8bn of short-term commercial paper outstanding that it can term out, CreditSights noted in a report.",
    "\"Every investment banker out there is pounding on the doors of their coverage companies and saying you should print a bond deal right now,\" said Jason Shoup, head of credit strategy and portfolio manager at Legal & General Investment Management America.",
    "\"A lot of companies are taking advantage of those rates, pulling forward refinancing needs and it's resulting in this resurgence of supply.\"",
    "Coca-Cola's leverage is slightly elevated following its US$5.1bn acquisition of Costa Coffee.",
    "The storied soda maker is looking to diversify its portfolio and take on Starbucks and Nestle in the growing coffee segment as consumers move away from sugary sodas.",
    "While the acquisition has elevated Coca-Cola's leverage above three times, CreditSights views the deleveraging prospects at Coke as favorable to competitor PepsiCo.",
    "For example, PepsiCo announced a US$1.7bn acquisition of Pioneer Foods in July, a US$450m M&A deal for Muscle Milk in February and last year levered up with a US$3.2bn purchase of SodaStream.",
    "\"The Coca-Cola Company's A1 rating reflects the Coca-Cola system's leading position in the global carbonated soft drink industry, including its ownership of one of the most valuable consumer brands in the world,\" Moody's noted in its report.",
    "The two companies trade close to one another in the secondary but Coca-Cola managed to bring the new issuance inside of PepsiCo's two-part bond that priced in July.",
    "PepsiCo priced a 2.625% 10 year and a 3.375% 30-year at Treasuries plus 58bp and 80bp, respectively, according to MarketAxess. Those same notes on Wednesday were changing hands at G+67bp and G+92bp, respectively.",
    "\"We view both companies as core holds and are comfortable adding Coca-Cola exposure on the new issuance, preferring to go out the curve for the longer dated notes,\" CreditSights noted in the report."
  ],
  "published_datetime": "2019-09-04 04:25:00"
}