{
  "url": "https://www.nasdaq.com/article/kone-could-team-up-to-bid-for-thyssenkrupp-elevator-business-20190905-00791",
  "title": "Kone could team up to bid for Thyssenkrupp elevator business - Nasdaq.com",
  "text": [
    "By Edward Taylor, Christoph Steitz, Tom Käckenhoff and Arno Schuetze",
    "FRANKFURT/DUESSELDORF, Germany, Sept 5 (Reuters) - Finland'sKone  is considering teaming up with a private equity partner to pull off a bid for Thyssenkrupp's  elevator business, three people familiar with the matter said.",
    "Kone has long been interested in Elevator Technology (ET) - which analysts say could be worth as much as 17 billion euros ($19 billion) - and has been exploring options for a deal with the help of Bank of America , sources told Reuters in May. ",
    "No final decision has been made and Kone could still decide to submit an offer for the unit on its own, the people said.",
    "Thyssenkrupp has said that it could sell or list its elevator business, which is by far its most profitable division.",
    "Shares in the group, which will be kicked out of Germany's benchmark index later this month following a sharp fall in its market value, extended gains to close up 6.2% on the news that Kone was considering a bid with a partner.",
    "Due to its large overlap with ET, a bid by Kone is likely to raise antitrust issues and would require substantial remedies to get approval, the sources said, adding that teaming up with private equity players would be a way to sidestep concerns.",
    "Sources told Reuters on Wednesday that KKR , CVC , Bain and EQT were among those who received a letter from Thyssenkrupp asking them to express their interest in ET by the middle of the month. ",
    "PERFECT FIT",
    "Kone declined to comment on whether it would team up with a partner to make a bid. But the group's CEO, in an interview on Thursday, said ET would be a perfect strategic fit for Kone.",
    "\"We have evaluated different scenarios and take the view that a tie-up is possible from an antitrust point of view. Both companies would benefit,\" Henrik Ehrnrooth told Rheinische Post in an interview.",
    "He said Thyssenkrupp was stronger than Kone in North America, while Kone had a better position in Asia. \"In this combination we'd be faster and could tackle digital challenges more efficiently.\"",
    "In Kone's case, synergies are expected to be around 600 million euros annually, a person close to the deal said.",
    "Rival elevator makers are in a position to pay a significantly higher price for ET as they would benefit from cost savings in a potential merger. At the same time, they would face higher antitrust hurdles than private equity firms.",
    "Of the world's top elevator makers - which also include Otis  and Schindler  - Hitachi  would have the fewest antitrust issues, the people said.",
    "German industrial conglomerate Siemens , which has a strong building technologies business, is not interested in Thyssenkrupp's elevator unit and did not receive a letter on Wednesday, several people close to the matter said.",
    "While Siemens has looked at a possible expansion into the elevators business in the past, it dismissed that idea after finding that there would be little synergy with its other businesses, the people said.",
    "($1 = 0.9060 euros)"
  ],
  "published_datetime": "2019-09-05 11:34:00"
}