{
  "url": "https://www.nasdaq.com/article/japan-govt-eyes-record-budget-spending-fiscal-reform-in-doubt-20190905-00079",
  "title": "Japan govt eyes record budget spending, fiscal reform in doubt - Nasdaq.com",
  "text": [
    "By Tetsushi Kajimoto",
    "TOKYO, Sept 5 (Reuters) - Budget requests from Japan's ministries have hit a record amount  for the next fiscal year starting in April, the finance ministry said, highlighting the conflicting need to promote fiscal reform while propping up a flagging economy facing external risks.",
    "Fiscal reform is an urgent task for Japan, which is saddled with the industrial world's heaviest public debt at more than twice the size of its $5 trillion economy.",
    "The general-account spending requests for fiscal 2020 totalled a record 105 trillion yen ($996.30 billion), exceeding the previous high of 102.8 trillion yen sought for the current fiscal year.",
    "The rise was due to bulging welfare costs to support the ageing population, spending to service debt, and rising military outlays in response to China's growing military presence and North Korea's missile programme.",
    "\"To sustain public finances for the next generation, we need to manage both economic revival and fiscal reform,\" Kenichiro Ueno, a state minister of finance told reporters.",
    "\"We will do the utmost to scrutinise the budget requests so as not to be criticised as loosening fiscal discipline.\"  ",
    "The finance ministry will examine the requests and finalise the size of spending in December when it drafts the budget for fiscal 2020.",
    "Abe's government is set to proceed with a twice-delayed nationwide sales tax hike to 10% from 8% next month to pay for the cost of social welfare and fix tattered public finances. The last tax hike in 2014 hit consumers hard and caused deep downturn.",
    "The initial budget for the current fiscal year amounts to 101.5 trillion yen, with social security and debt-servicing accounting for more than half the overall spending plan.",
    "The finance ministry is seeking 24.97 trillion yen to pay for debt-servicing costs for fiscal 2020.",
    "The Ministry of Defence called for spending to rise 1.2% to a record 5.32 trillion yen for fiscal 2020 to pay for U.S.-made interceptor missiles, stealth fighters, and other equipment it wants to counter threats from North Korea and China. ",
    "($1 = 105.3900 yen)"
  ],
  "published_datetime": "2019-09-05 02:52:00"
}