{
  "url": "https://www.nasdaq.com/article/commit-to-purchase-elanco-animal-health-at-23-earn-72-annualized-using-options-cm1210700",
  "title": "Commit To Purchase Elanco Animal Health At $23, Earn 7.2% Annualized Using Options - Nasdaq.com",
  "text": [
    "Investors considering a purchase of Elanco Animal Health Inc (Symbol: ELAN) shares, but cautious about paying the going market price of $28.16/share, might benefit from considering selling puts among the alternative strategies at their disposal. One interesting put contract in particular, is the April 2020 put at the $23 strike, which has a bid at the time of this writing of $1.00. Collecting that bid as the premium represents a 4.3% return against the $23 commitment, or a 7.2% annualized rate of return (at Stock Options Channel we call this the YieldBoost  ).      Selling a put does not give an investor access to ELAN's upside potential the way owning shares would, because the put seller only ends up owning shares in the scenario where the contract is exercised. And the person on the other side of the contract would only benefit from exercising at the $23 strike if doing so produced a better outcome than selling at the going market price. ( Do options carry counterparty risk? This and six other common options myths debunked  ). So unless Elanco Animal Health Inc sees its shares fall 18.3% and the contract is exercised (resulting in a cost basis of $22.00 per share before broker commissions, subtracting the $1.00 from $23), the only upside to the put seller is from collecting that premium for the 7.2% annualized rate of return.  makeArticleAd();  Below is a chart showing the trailing twelve month trading history for Elanco Animal Health Inc, and highlighting in green where the $23 strike is located relative to that history:       The chart above, and the stock's historical volatility, can be a helpful guide in combination with fundamental analysis to judge whether selling the April 2020 put at the $23 strike for the 7.2% annualized rate of return represents good reward for the risks. We calculate the trailing twelve month volatility for Elanco Animal Health Inc (considering the last 244 trading day closing values as well as today's price of $28.16) to be 30%. For other put options contract ideas at the various different available expirations, visit the ELAN Stock Options  page of StockOptionsChannel.com.    In mid-afternoon trading on Wednesday, the put volume among S&P 500 components was 1.29M contracts, with call volume at 1.29M, for a put:call ratio of 0.74 so far for the day, which is above normal compared to the long-term median put:call ratio of .65. In other words, if we look at the number of call buyers and then use the long-term median to project the number of put buyers we'd expect to see, we're actually seeing more put buyers than expected out there in  options trading  so far today. Find out which 15 call and put options traders are talking about today  .   Top YieldBoost Puts of the S&P 500 »  ",
    "  Top YieldBoost Puts of the S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:53:57"
}