{
  "url": "https://www.nasdaq.com/article/trade-balance-hits-54-billion-hong-kong-cancels-extradition-cm1207309",
  "title": "Trade Balance Hits -$54 Billion; Hong Kong Cancels Extradition - Nasdaq.com",
  "text": [
    "  Wednesday, September 4, 2019  makeArticleAd();  Each month, we see new data on U.S. Trade Balances  . Throughout history, they have almost always posted reads in the negative, and since about the turn of the millennium have registered beneath $20 billion. As a matter of historical reference, 40 years ago the U.S. trade balance was right at $0 or close to it; this metric has been awash in red ink in what we may call \"modern times.\"    This morning, the trade deficit for July came in at -$54.0 billion - lower than the -$53.4 billion expected, but better than the downwardly revised total in June, which is now -$55.5 billion. These monthly figures have gotten notably worse since April, but are still better than December 2018, when we saw the trade deficit tumble to beneath $60 billion for the worst read since the days of the Great Recession.    Why these reports take on added interest these days is because of the ongoing trade war between the U.S. and China. Overall, U.S. exports rose 0.6% on the month, while imports were down slightly. But exports to China were down 3.3%, especially in Transportation Equipment, Agriculture and Machinery. Imports from China show Computer Equipment to have taken the worst hit as of July.   Hong Kong Ends Extradition Bid    Speaking of China, big news from overnight was that Chief Executive Carrie Lam - well respected by the powers on mainland China - has ended the proposal of extraditing arrestees in Hong Kong to the mainland, where prospects for a fair trial are far more opaque, to put it mildly. This proposal led to nearly three months of open protests in Hong Kong, which included a temporary shutting of the airport and more than 1100 protestors arrested.    This news sent the Hang Seng index (Hong Kong) up 3.9% yesterday, leading to what we see as something of a relief rally in markets around the world, including the U.S. Currently, the Dow looks to open up 230 points, the Nasdaq up 83 and the S&P 500 +26. This is a decent bounce-back from Tuesday's sell-off, but not enough to break even on the trading week yet.    Mark Vickery   Senior Editor    Questions or comments about this article and/or its author? Click here>>   Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.  See 7 breakthrough stocks now>>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   SPDR Dow Jones Industrial Average ETF (DIA): ETF Research Reports   SPDR S&P China ETF (GXC): ETF Research Reports   Invesco QQQ (QQQ): ETF Research Reports   SPDR S&P 500 ETF (SPY): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    " Wednesday, September 4, 2019  makeArticleAd();  Each month, we see new data on U.S. Trade Balances  . Throughout history, they have almost always posted reads in the negative, and since about the turn of the millennium have registered beneath $20 billion. As a matter of historical reference, 40 years ago the U.S. trade balance was right at $0 or close to it; this metric has been awash in red ink in what we may call \"modern times.\"    This morning, the trade deficit for July came in at -$54.0 billion - lower than the -$53.4 billion expected, but better than the downwardly revised total in June, which is now -$55.5 billion. These monthly figures have gotten notably worse since April, but are still better than December 2018, when we saw the trade deficit tumble to beneath $60 billion for the worst read since the days of the Great Recession.    Why these reports take on added interest these days is because of the ongoing trade war between the U.S. and China. Overall, U.S. exports rose 0.6% on the month, while imports were down slightly. But exports to China were down 3.3%, especially in Transportation Equipment, Agriculture and Machinery. Imports from China show Computer Equipment to have taken the worst hit as of July.   Hong Kong Ends Extradition Bid    Speaking of China, big news from overnight was that Chief Executive Carrie Lam - well respected by the powers on mainland China - has ended the proposal of extraditing arrestees in Hong Kong to the mainland, where prospects for a fair trial are far more opaque, to put it mildly. This proposal led to nearly three months of open protests in Hong Kong, which included a temporary shutting of the airport and more than 1100 protestors arrested.    This news sent the Hang Seng index (Hong Kong) up 3.9% yesterday, leading to what we see as something of a relief rally in markets around the world, including the U.S. Currently, the Dow looks to open up 230 points, the Nasdaq up 83 and the S&P 500 +26. This is a decent bounce-back from Tuesday's sell-off, but not enough to break even on the trading week yet.    Mark Vickery   Senior Editor    Questions or comments about this article and/or its author? Click here>> ",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    " See 7 breakthrough stocks now>> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:58:00"
}