{
  "url": "https://www.nasdaq.com/article/why-uber-stock-crashed-23-in-august-cm1210675",
  "title": "Why Uber Stock Crashed 23% in August - Nasdaq.com",
  "text": [
    "  What happened  Shares of   Uber Technologies    (NYSE: UBER) were moving in reverse last month after the   ridesharing pioneer reported another underwhelming quarter,   featuring slowing revenue growth and wide losses. As a result,   the stock fell 23% during August, according to data from   S&P Global Market Intelligence    . As the chart below shows, most of the stock's losses for the   month came during the second week of August after its   second-quarter earnings report came out.     makeArticleAd();     UBER    data by   YCharts    .  So what  Uber shares actually rose on Aug. 8, gaining 8%, to briefly   put it in positive territory for the month, after rival   Lyft    posted strong numbers in its second-quarter report.   Image source: Uber.  However, Uber promptly gave back those gains the following day   after its own report came out. Revenue in the quarter rose just   14% to $3.17 billion, badly missing estimates at $3.36 billion,   though gross bookings grew faster, increasing by 31%, or 37% in   constant currency, to $15.8 billion. Revenue, adjusted for   currency and a one-time driver award associated with the IPO, was   up 26%. More concerning may have been that the company's adjusted   EBITDA loss more than doubled in the period, increasing 125% to   $625 million, a sign that profitability is only getting further   away for the ride-hailing juggernaut. That translated into a   per-share loss of $4.72 versus analyst expectations of a $3.12   loss. The stock continued to decline following the report as news   emerged that Uber had instituted a hiring freeze, a warning sign   for a growth stock. And   WeWork    's IPO filing on Aug. 14 inspired skepticism from Wall Street,   causing investors to look at   IPO stocks    like both Uber and Lyft more harshly.  Now what  Uber shares have recovered modestly thus far in September   after hitting an all-time low on Sept. 3 even though the news   around the stock hasn't much improved. Uber said it would lay off   400 corporate employees in engineering and product, a sign the   company is trying to scale back its losses. Uber and Lyft also   appear to be on the losing end of a new California law that would   deem their drivers employees instead of independent contractors,   a result that will likely increase the companies' expenses. At this point, Uber looks like a broken IPO. Growth is sharply   decelerating, and it's still losing billions of dollars a year.   The company has plenty of ideas and several secondary businesses   in addition to its core ridesharing operation, but that doesn't   really matter if the numbers don't add up. If top-line growth   continues to slow, look for the stock to fall even lower.   10 stocks we like better than Uber     Technologies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Uber Technologies wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Jeremy Bowman      has no position in any of the stocks mentioned. The Motley Fool     recommends Uber Technologies. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   Uber Technologies    (NYSE: UBER) were moving in reverse last month after the   ridesharing pioneer reported another underwhelming quarter,   featuring slowing revenue growth and wide losses. As a result,   the stock fell 23% during August, according to data from   S&P Global Market Intelligence    .",
    "As the chart below shows, most of the stock's losses for the   month came during the second week of August after its   second-quarter earnings report came out.",
    "    UBER    data by   YCharts    .",
    "Uber shares actually rose on Aug. 8, gaining 8%, to briefly   put it in positive territory for the month, after rival   Lyft    posted strong numbers in its second-quarter report.",
    "  Image source: Uber. ",
    "Image source: Uber.",
    "However, Uber promptly gave back those gains the following day   after its own report came out. Revenue in the quarter rose just   14% to $3.17 billion, badly missing estimates at $3.36 billion,   though gross bookings grew faster, increasing by 31%, or 37% in   constant currency, to $15.8 billion. Revenue, adjusted for   currency and a one-time driver award associated with the IPO, was   up 26%.",
    "More concerning may have been that the company's adjusted   EBITDA loss more than doubled in the period, increasing 125% to   $625 million, a sign that profitability is only getting further   away for the ride-hailing juggernaut. That translated into a   per-share loss of $4.72 versus analyst expectations of a $3.12   loss.",
    "The stock continued to decline following the report as news   emerged that Uber had instituted a hiring freeze, a warning sign   for a growth stock. And   WeWork    's IPO filing on Aug. 14 inspired skepticism from Wall Street,   causing investors to look at   IPO stocks    like both Uber and Lyft more harshly.",
    "Uber shares have recovered modestly thus far in September   after hitting an all-time low on Sept. 3 even though the news   around the stock hasn't much improved. Uber said it would lay off   400 corporate employees in engineering and product, a sign the   company is trying to scale back its losses. Uber and Lyft also   appear to be on the losing end of a new California law that would   deem their drivers employees instead of independent contractors,   a result that will likely increase the companies' expenses.",
    "At this point, Uber looks like a broken IPO. Growth is sharply   decelerating, and it's still losing billions of dollars a year.   The company has plenty of ideas and several secondary businesses   in addition to its core ridesharing operation, but that doesn't   really matter if the numbers don't add up. If top-line growth   continues to slow, look for the stock to fall even lower.",
    "  10 stocks we like better than Uber     Technologies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Uber Technologies wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Uber     Technologies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Uber Technologies wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Jeremy Bowman      has no position in any of the stocks mentioned. The Motley Fool     recommends Uber Technologies. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:01:00"
}