{
  "url": "https://www.nasdaq.com/article/cme-group-cme-records-second-highest-monthly-adv-in-august-cm1207971",
  "title": "CME Group (CME) Records Second-Highest Monthly ADV in August - Nasdaq.com",
  "text": [
    "  CME Group CME  reported average daily volume (\"ADV\") of 24.3 million contracts for August 2019, up 53% year over year. This marks the second-highest monthly ADV. There were 22 trading days in August. Options volume of 4.7 million contracts per day in August 2019 improved 49% year over year.  makeArticleAd();  Interest rate volume of 13.7 million contracts per day shot up 59%. Of this, Treasury futures were a record 6.9 million, up 46% year over year. Metals volume of record 0.9 million contracts per day increased 41%.    Equity index volume of nearly 5 million contracts per day increased 109% whereas Agricultural volume of 1.5 million contracts per day witnessed an increase of 4% year over year. However, Energy volume of 2.5 million contracts increased 25% and Foreign exchange volumes contracted 7% to 0.8 million contracts per day.    The company witnessed 12 trading days with volume crossing more than 25 million contracts.    CME group boasts 90% market share of the global futures trading and clearing services. Given its sturdy market position with diverse derivative product lines and global reach, ADV should continue to retain the growth momentum. Also, increasing electronic trading volume adds scalability and hence leverage to CME Group's operating model. The company currently carries a Zacks Rank #3 (Hold).    Shares of CME Group have outperformed the industry  quarter to date. While the company has rallied 13.9%, the industry has registered 11.5% increase. Efforts to expand futures products in emerging markets, non-transaction related opportunities, OTC offerings, cross-sell through alliances, strong global presence and solid liquidity should help the stock retain the bull run.     Recently, Nasdaq NDAQ  reported solid volumes for August 2019. While U.S. equity options volume increased 5.4% year over year to 157 million contracts, European options and futures volume rose 33.9% year over year to 7.5 million contracts.   Stocks to Consider    Some better-ranked stocks from the finance sector are Cboe Global Markets CBOE  and CNA Financial CNA  , each carrying a Zacks Rank #2 (Buy). You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .    Cboe Global is one of the largest stock exchange operators by volume in the United States and a leading market globally for ETP trading. The company came up with positive surprise of 5.61% in the las t report  ed quarter.    CNA Financial provides commercial property and casualty insurance products, primarily in the United States. The company came up with a positive surprise of 6.93% in the last reported quarter.   It's Illegal in 42 States, But Investors Will Make Billions Legally    In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.    That's twice as much as they spend on marijuana, legally or otherwise.    Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.    See these 5 \"sin stocks\" now>>      Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   CNA Financial Corporation (CNA): Free Stock Analysis Report   Nasdaq, Inc. (NDAQ): Free Stock Analysis Report   Cboe Global Markets, Inc. (CBOE): Free Stock Analysis Report   CME Group Inc. (CME): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " CME Group CME  reported average daily volume (\"ADV\") of 24.3 million contracts for August 2019, up 53% year over year. This marks the second-highest monthly ADV. There were 22 trading days in August. Options volume of 4.7 million contracts per day in August 2019 improved 49% year over year.  makeArticleAd();  Interest rate volume of 13.7 million contracts per day shot up 59%. Of this, Treasury futures were a record 6.9 million, up 46% year over year. Metals volume of record 0.9 million contracts per day increased 41%.    Equity index volume of nearly 5 million contracts per day increased 109% whereas Agricultural volume of 1.5 million contracts per day witnessed an increase of 4% year over year. However, Energy volume of 2.5 million contracts increased 25% and Foreign exchange volumes contracted 7% to 0.8 million contracts per day.    The company witnessed 12 trading days with volume crossing more than 25 million contracts.    CME group boasts 90% market share of the global futures trading and clearing services. Given its sturdy market position with diverse derivative product lines and global reach, ADV should continue to retain the growth momentum. Also, increasing electronic trading volume adds scalability and hence leverage to CME Group's operating model. The company currently carries a Zacks Rank #3 (Hold).    Shares of CME Group have outperformed the industry  quarter to date. While the company has rallied 13.9%, the industry has registered 11.5% increase. Efforts to expand futures products in emerging markets, non-transaction related opportunities, OTC offerings, cross-sell through alliances, strong global presence and solid liquidity should help the stock retain the bull run.",
    "Recently, Nasdaq NDAQ  reported solid volumes for August 2019. While U.S. equity options volume increased 5.4% year over year to 157 million contracts, European options and futures volume rose 33.9% year over year to 7.5 million contracts.   Stocks to Consider    Some better-ranked stocks from the finance sector are Cboe Global Markets CBOE  and CNA Financial CNA  , each carrying a Zacks Rank #2 (Buy). You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .    Cboe Global is one of the largest stock exchange operators by volume in the United States and a leading market globally for ETP trading. The company came up with positive surprise of 5.61% in the las t report  ed quarter.    CNA Financial provides commercial property and casualty insurance products, primarily in the United States. The company came up with a positive surprise of 6.93% in the last reported quarter.   It's Illegal in 42 States, But Investors Will Make Billions Legally    In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.    That's twice as much as they spend on marijuana, legally or otherwise.    Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.    See these 5 \"sin stocks\" now>>   ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:09:00"
}