{
  "url": "https://www.nasdaq.com/article/3-ways-fintech-is-set-to-start-moving-jpm-stock-higher-cm1207437",
  "title": "3 Ways Fintech Is Set to Start Moving JPM Stock Higher - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "JPMorgan (NYSE: JPM ) only has added a little more than 8% so far this year. It's not a great one for JPM stock, but the future looks a lot different than the past for this company.",
    "InvestorPlace contributor Vince Martin recently discussed the pros and cons of buying Bank of America (NYSE: BAC ) at its current price-to-book. Meanwhile, JPM has a P/B that's 50% higher. You would think that would make JPM stock much less attractive. ",
    "Perhaps that's true if you're a value investor. However, the bank's use of fintech to grow its business suggests it deserves a premium valuation. Here are three reasons why. ",
    "JPM recently signed a five-year deal with Persado , a software startup that uses artificial intelligence to write marketing copy.",
    "Although this is bad news for humans that write marketing copy, the fact is, this kind of thing is ideally suited for artificial intelligence and machine learning. You feed it a bunch of data from marketing campaigns along with the copy used in those campaigns over and over until the computer figures out which words resonate with consumers and which don't.",
    "Presto. You save money on your marketing spend, but more importantly, you deliver better results. ",
    "JPMorgan's test found that Persado's machine learning tool generated better click rates than the copy written by humans. Sometimes, by as much as double. ",
    "The machine learning tool has over one million words available to it, all scored for emotional appeal, reported Quartz at Work. The tests were so successful that JPMorgan plans to use it for internal communications and for prompting customers to respond to offers, etc. ",
    "\"Persado's technology is incredibly promising,\" Kristin Lemkau, chief marketing officer at JPMorgan Chase, said in a statement. \"It rewrote copy and headlines that a marketer, using subjective judgment and their experience, likely wouldn't have. And they worked.\"",
    "For those who do write ad copy for JPM or other banks interested in using the technology, you can take heart in the fact that Persado's technology will free its marketing and advertising employees to spend time on higher-value strategic thinking. ",
    "It's been almost two years since JPMorgan acquired fintech startup WePay for as much as $400 million. The software company specialized in payment processing platforms for crowdfunding site GoFundMe and many others.",
    "At the time of the purchase, it wasn't certain whether JPM would operate the business as a separate entity, provide payment processing services to the bank's 4 million small and medium-sized businesses (SMBs), or connect its legacy banking with Silicon Valley innovation. ",
    "It seems that JPMorgan has chosen to keep WePay as a separate company while also integrating it with its 4 million SMBs.",
    "Last month, it announced that it had made a strategic investment in FreshBooks, a Toronto-based small business accounting software company with customers in more than 160 countries.",
    "\"Since earlier this year, our 4 million Chase for Business customers have been able to sign up for FreshBooks through our small business marketplace and we've seen lots of demand,\" said Bill Clerico, Head of SMB Product for Chase Merchant Services and CEO of WePay , the integrated payments business of JPMorgan Chase. \"Helping software companies like FreshBooks grow by serving our small business customer base is a key differentiator for us in the fast-growing integrated payments market.\"",
    "While large enterprises are sexier, it's the SMB crowd that will continue to grow the bank's profits in the years ahead. ",
    "On May 17, JPMorgan announced that it was buying medical payments technology company InstaMed for more than $500 million. InstaMed, which was founded by two former Accenture consultants, processed more than $94 billion in transactions in 2018, making it a major player in healthcare payments. ",
    "\"One of my favorite stats is approximately 90 percent of all health providers still use paper billing,\" The bank's head of wholesale payments, Takis Georgakopoulos, said at the time. \"What InstaMed has created is both the platform and the network that allows them to simplify and streamline payments across payers, providers and consumers across the ecosystem.\" ",
    "While Instamed will be separate from Haven, the non-profit healthcare initiative it formed last year with Amazon (NASDAQ: AMZN ) and Berkshire Hathaway (NYSE: BRK.A , NYSE: BRK.B ), it's indicative of JPMorgan's level of interest in the healthcare industry and how fintech can deliver greater efficiencies and cost savings. ",
    "JPMorgan has an $11 billion annual technology budget. The three fintech initiatives listed above are part of the bank's goal to use technology to help its customers operate more efficient businesses while simultaneously generating higher profits for JPM shareholders.",
    "I say it's a win/win for all stakeholders. ",
    "JPM stock might trade at 1.5 times book but the moves it's making behind the scenes suggest it's worth it. If you're a buy-and-hold investor, JPMorgan stock is a buy. ",
    "At the time of this writing Will Ashworth did not hold a position in any of the aforementioned securities.",
    "The post 3 Ways Fintech Is Set to Start Moving JPM Stock Higher appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:10:57"
}