{
  "url": "https://www.nasdaq.com/article/near-term-prospects-look-bright-for-consumer-loans-industry-cm1207372",
  "title": "Near-Term Prospects Look Bright for Consumer Loans Industry - Nasdaq.com",
  "text": [
    "The Zacks Consumer Loans industry comprises firms that offer mortgages, refinancing, home equity lines of credit, credit cards, auto loans, student loans and personal loans, among others. Business prospects of these companies are sensitive to the nation's overall economic health.\r\n In addition to offering the above-mentioned products and services that help generate interest income - a major part of their revenues- many of these consumer loan providers are involved inbusinesses like commercial lending, insurance, loan servicing and asset recovery for generating fee revenues.\r\n A couple of prominent stocks in this industry are Discover Financial Services (DFS) and Capital One (COF).\r\n Here are the three major themes in the industry:",
    "Zacks Industry Rank Reflects Bright Prospects\r\n The Zacks Consumer Loans industry is a 19-stock group within the broader Zacks Finance sector. The industry currently carries a Zacks Industry Rank #16, which places it at the top 6% of more than 250 Zacks industries.\r\n The group's Zacks Industry Rank , which is basically the average of the Zacks Rank of all the member stocks, indicates continued outperformance in the near term. Our research shows that the top 50% of the Zacks-ranked industries outperforms the bottom 50% by a factor of more than 2 to 1.\r\n The industry's positioning in the top 50% of the Zacks-ranked industries is a result of solid earnings outlook for the constituent companies in aggregate. Looking at the aggregate earnings estimate revisions, it appears that analysts are gradually gaining confidence in this group's earnings growth potential. In the past year, the industry's earnings estimates for the current year have been revised upward by 6.1%.\r\n Before we present a few stocks that you may want to consider for your portfolio, let's take a look at the industry's recent stock-market performance and valuation picture.Industry Underperforms Sector and S&P 500\r\n The Zacks Consumer Loans industry has underperformed both the Zacks S&P 500 composite and its own sector over the past three years.\r\n While the stocks in this industry have collectively gained 9.9% over this period, the Zacks S&P 500 composite and the Zacks Finance sector have rallied 32.6% and 14.5%, respectively.",
    "Three-Year Price Performance",
    "Industry's Valuation\r\n On the basis of price-to-tangible book ratio (P/TBV), which is commonly used for valuing consumer loan providers because of large variations in their earnings results from one quarter to the next, the industry currently trades at 1.04X. This compares to the highest level of 1.62X and median of 1.26X over the past five years.\r\n This compares with the S&P 500's trailing 12-month P/TBV of 11.01X, as the chart below shows.",
    "Price-to-Tangible Book Ratio (TTM)",
    "As finance stocks typically have a lower P/TBV ratio, comparing consumer loan providers with the S&P 500 may not make sense to many investors. But a comparison of the group's P/TBV ratio with that of its broader sector ensures that the group is trading at a decent discount. The Zacks Finance sector's trailing 12-month P/TBV of 3.66X for the same period is way above the Zacks Consumer Loanindustry's ratio, as the chart below shows.",
    "Price-to-Tangible Book Ratio (TTM)",
    "Bottom Line\r\n Consumer loan stocks are likely to continue benefiting from increasing loan demand, favorable operating environment and improving economy. Also, digitization of operations, efforts to diversify revenue sources, restructuring and solid asset quality (despite easing lending standards) will support profitability.\r\n One should particularly consider betting on the consumer loan stocks that depict an upbea t earnings outlook.\r\n We are presenting two stocks with a Zacks Rank #1 (Strong Buy) and three with a Zacks Rank #2 (Buy) that investors may consider betting on.\r\n You can see the complete list of today's Zacks #1 Rank stocks here .Navient Corporation (NAVI): The stock of this Wilmington, DE-based company has rallied 42.2% year to date. The Zacks Consensus Estimate for the current-year earnings has been revised 14.5% upward over the past 60 days. The stock currently sports a Zacks Rank #1.",
    "Price and Consensus: NAVI",
    "OneMain Holdings, Inc. (OMF): The stock of Evansville, IN-based company has gained 45.4% so far this year. The consensus estimate for current-year earnings has been revised 6.9% upward over the past 60 days. The stock sports a Zacks Rank 1.",
    "Price and Consensus: OMF",
    "Ally Financial Inc. (ALLY): The consensus estimate for this Detroit, MI-based company has moved 3.3% higher for current-year earnings over the past 60 days. This Zacks Rank #2 stock has rallied 36.3% year to date.",
    "Price and Consensus: ALLY",
    "Credit Acceptance Corporation (CACC): The stock of this Southfield, MI-based company has risen 16.5% year to date. The Zacks Consensus Estimate for the current-year earnings has been revised 2.2% upward over the past 60 days. The stock currently carries a Zacks Rank #2.",
    "Price and Consensus: CACC",
    "Santander Consumer USA Holdings Inc. (SC): The consensus estimate for this Dallas, TX-based company has moved 6.8% higher for current-year earnings over the past 30 days. This Zacks Rank #2 stock has surged 45.5% over the past two years.",
    "Price and Consensus: SC",
    "Biggest Tech Breakthrough in a Generation\r\n Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.\r\n A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.See 7 breakthrough stocks now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:19:00"
}