{
  "url": "https://www.nasdaq.com/article/brazil-tax-reform-jolted-as-key-economy-ministry-official-is-fired-20190911-00756",
  "title": "Brazil tax reform jolted as key Economy Ministry official is fired - Nasdaq.com",
  "text": [
    "By Marcela Ayres and Jamie McGeever",
    "BRASILIA, Sept 11 (Reuters) - A key figure in Brazil's plans to reform the country's complex tax system was fired on Wednesday, government sources told Reuters, reflecting disagreements in cabinet about the form legislation should take.",
    "The departure of Marcos Cintra, special secretary to Brazil's federal revenue service, was confirmed in a statement from the Economy Ministry.",
    "President Jair Bolosnaro later tweeted that Cintra was dismissed due to \"differences\" over the government's tax reform bill, particularly reintroducing a version of the CPMF.",
    "Bolsonaro tweeted that he will rule out a reintroduction of a CPMF tax or an increase in the tax burden, putting him at odds with Economy Minister Paulo Guedes, an ardent supporter of a transactions tax.",
    "\"The president is not a fan of that tax,\" said Vice President Hamilton Mourao, adding that Bolsonaro was angered that discussions over the levy had already started appearing on social media even though he had not signed off on it.",
    "In its statement, the Economy Ministry said Guedes and team were working on a new tax regime \"to simplify standards, reduce costs, lighten the tax burden on households and business.\"",
    "\"The proposal will only be released after the approval of Minister Paulo Guedes and President Jair Bolsonaro,\" it said, adding that Guedes thanked Cintra for his service and Jose de Assis Ferraz will temporarily assume the position.",
    "One source told Reuters that Guedes decided Cintra should be dismissed because he spoke about the issue publicly even though he had not fully drafted his proposals, and he never appeared in front of lawmakers to answer questions.",
    "Guedes has said that a new CPMF should be part of the reformed tax system. He and others argue that a financial transaction tax would be simple to implement and collect and provide a steady revenue stream.",
    "But critics say it is regressive and hits the poor hardest. The CPMF, which taxed all financial transactions including checks, was always unpopular, and opposition to it runs deep.",
    "Tax reform is the government's main economic priority in the second half of this year, after it pushed social security reform to the brink of full Congressional approval in the first half."
  ],
  "published_datetime": "2019-09-11 04:01:00"
}