{
  "url": "https://www.nasdaq.com/article/trump-blasts-fed-market-expects-deep-rate-cuts-inflation-data-hotter-than-expected-cm1210652",
  "title": "Trump Blasts Fed, Market Expects Deep Rate Cuts, Inflation Data Hotter Than Expected - Nasdaq.com",
  "text": [
    "The U.S. futures are up in early Wednesday trading as markets gear up for a round of very important central bank meetings. The ECB meets today and tomorrow, the FOMC next week, and both are expected to lower rates. President Trump continues to blast the FOMC, calling them \"boneheads\" in a Tweet earlier today and says they need to lower rates to zero or less. The FOMC is expected to cut as many as three times by the end of the year but the inflation data just doesn't support it much less a cut to zero.",
    "In today's news, the U.S. PPI came in hotter than expected at the headline and core levels. Headline PPI increased by 0.1% versus an expected UNCH while core increased by 0.3% versus an expected 0.2%. The year-over-year figures remain a little tepid at 1.8% and 1.9% but are hovering near the FOMC's target 2.0%. Deutsche Bank, in a surprising move, says the FOMC is likely to cut rates another 100 bps which is far more than the broad market expects.",
    "The Dow Jones Industrial Average is up about 0.20% with the S&P 500 and NASDAQ Composite close behind. The tech sector is in the lead with the XLK technology sector SPDR up a little more than 0.30%. The tech sector is trying to rebound from this week's losses but a general rotation out of growth names is going to keep it down longer-term. investors are now focusing on under-appreciated value plays and dividend payers.",
    "EU markets are up broadly on Wednesday as fears of a hard-Brexit recede. The FTSE 100 is in the lead at midday with a gain of 1.00% while the DAX and CAC trails at 0.85% and 0.50%. With Brexit in the background once again the ECB will be the main driver of price action the remainder of the week. The ECB is meeting now and will release its policy statement Thursday morning. The bank is expected to stimulate the economy in some way including but not limited to interest rate cuts.",
    "Banks are in the lead at midday with an average gain near 1.5% while Food&Beverage stocks decline -0.50%. The LSE shot to the top of the rankings, gaining 9.0%, after a bid from Hong Kong to buy the exchange.",
    "Asian stocks are mostly higher on Wednesday. The focus for many is the results of tomorrow's ECB meeting. The ECB is important but not the only driver of market action. The Hong Kong Hang Seng led the advance with a gain of 1.78% on strength in Apple's supply chain. The tech-giants Wednesday product unveiling is the root cause for optimism despite trade war woe. In trade news, China's Ministry of Finance says 16 U.S. products will be exempted from tariffs. The ministry also says China will buy more U.S. agricultural products, a move seen as a positive development in trade relations.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:03:59"
}