{
  "url": "https://www.nasdaq.com/article/is-encore-boston-harbor-a-bad-bet-for-wynn-resorts-cm1207073",
  "title": "Is Encore Boston Harbor a Bad Bet For Wynn Resorts? - Nasdaq.com",
  "text": [
    "  Wynn Resorts'    (NASDAQ: WYNN) $2.6 billion Encore Boston Harbor is one of the   most expensive resorts ever built in the U.S. outside of Las   Vegas. Its biggest draw is the only full casino in the Boston   area, and the 671 hotel rooms, 15 food and beverage venues, and a   26,000 square foot salon and fitness area will make this a   destination for a variety of guests. For the property to be a financial success for Wynn Resorts,   it needs to generate nearly $1 billion in revenue. I think at   least $260 million in annual EBITDA, a proxy for cash flow, or a   10% EBITDA return is what should be seen as a minimum return on   investment for the property. Ideally, management would like to   see a 20% return, but that may be a bridge too far. Here's what   we   might expect from the company's results in the   Boston area    .   Image source: Wynn Resorts.makeArticleAd();  The hotel Encore Boston Harbor's hotel is small at just 671 rooms, but   it's intended to be a very high-end resort. Standard rooms are   650 square feet, and there are 18 two-bedroom residences that are   3,350 square feet and two 5,800 square foot villas. In a   presentation to investors, Wynn compared Ritz Carlton's $595   nightly rate and Four Seasons' $775 per night, and given prices   of $1,000 around its opening, that may be a good range to   expect. If we assume the resort can command $600 in revenue per   available room, there would be nearly $150 million in potential   revenue from the hotel itself. That's not a bad foundation to   start from, but it's not going to be the biggest money maker for   the property. The casino According to Wynn Resorts' estimates, gross gaming revenue in   the Boston area -- including Massachusetts, Connecticut, and   Rhode Island -- was $2.6 billion over the past year. That's a   proxy for the market potential that Encore Boston Harbor will try   to tap into. We don't know exactly what revenue from the casino will be,   but there are 144 table games, and the most similar recent casino   opening at National Harbor generated $5,648 per day, which would   be about $300 million in casino revenue from tables. There are   also over 3,100 slot machines; National Harbor generated $340 per   slot machine per day, so that would be another $385 million of   revenue if results are similar. Given Wynn's high-end clientele and prime location in Boston,   I don't think the $685 million of gaming revenue outlined above   is out of the question. I think it's possible that gross   gaming revenue could be over $1 billion at Encore Boston Harbor,   which would then have 25% removed in taxes to get to net casino   revenue. At $750 million of net casino revenue, the resorts could   be very profitable. Other revenue generators There aren't great projections for how much money restaurants   and shopping could generate at Encore Boston Harbor, but if we   use Las Vegas as a guide it could be around the same as hotel   revenue. If we assume $150 million in revenue for these business   lines, it's a decent estimate to use for now. What management expects So far, I've laid out how Encore Boston Harbor could get to   around $1 billion in revenue, depending on what you expect from   the casino. In its estimates for investors, management laid out $900   million in revenue at the low end and $1.1 billion at the high   end, so you can see how management gets there. As for EBITDA,   management sees the low end at $225 million per year, with a high   end of $325 million per year. That's a relatively low return on   investment at the low end, and even the high end isn't going to   blow investors away. There's value in Wynn Resorts just having a presence on the   East Coast, and that needs to be factored in. But even with high   room rates and lucrative gambling tables, this isn't a   slam dunk investment for the company, and a lot   will have to go right for it to be considered a financial   success    .   10 stocks we like better than Wynn Resorts       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Wynn Resorts wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Travis Hoium      owns shares of Wynn Resorts. The Motley Fool has no position in     any of the stocks mentioned. The Motley Fool has a     disclosure policy      .  ",
    " Wynn Resorts'    (NASDAQ: WYNN) $2.6 billion Encore Boston Harbor is one of the   most expensive resorts ever built in the U.S. outside of Las   Vegas. Its biggest draw is the only full casino in the Boston   area, and the 671 hotel rooms, 15 food and beverage venues, and a   26,000 square foot salon and fitness area will make this a   destination for a variety of guests.",
    "For the property to be a financial success for Wynn Resorts,   it needs to generate nearly $1 billion in revenue. I think at   least $260 million in annual EBITDA, a proxy for cash flow, or a   10% EBITDA return is what should be seen as a minimum return on   investment for the property. Ideally, management would like to   see a 20% return, but that may be a bridge too far. Here's what   we   might expect from the company's results in the   Boston area    .",
    "  Image source: Wynn Resorts.makeArticleAd(); ",
    "Image source: Wynn Resorts.",
    "Encore Boston Harbor's hotel is small at just 671 rooms, but   it's intended to be a very high-end resort. Standard rooms are   650 square feet, and there are 18 two-bedroom residences that are   3,350 square feet and two 5,800 square foot villas. In a   presentation to investors, Wynn compared Ritz Carlton's $595   nightly rate and Four Seasons' $775 per night, and given prices   of $1,000 around its opening, that may be a good range to   expect.",
    "If we assume the resort can command $600 in revenue per   available room, there would be nearly $150 million in potential   revenue from the hotel itself. That's not a bad foundation to   start from, but it's not going to be the biggest money maker for   the property.",
    "According to Wynn Resorts' estimates, gross gaming revenue in   the Boston area -- including Massachusetts, Connecticut, and   Rhode Island -- was $2.6 billion over the past year. That's a   proxy for the market potential that Encore Boston Harbor will try   to tap into.",
    "We don't know exactly what revenue from the casino will be,   but there are 144 table games, and the most similar recent casino   opening at National Harbor generated $5,648 per day, which would   be about $300 million in casino revenue from tables. There are   also over 3,100 slot machines; National Harbor generated $340 per   slot machine per day, so that would be another $385 million of   revenue if results are similar.",
    "Given Wynn's high-end clientele and prime location in Boston,   I don't think the $685 million of gaming revenue outlined above   is out of the question. I think it's possible that gross   gaming revenue could be over $1 billion at Encore Boston Harbor,   which would then have 25% removed in taxes to get to net casino   revenue. At $750 million of net casino revenue, the resorts could   be very profitable.",
    "There aren't great projections for how much money restaurants   and shopping could generate at Encore Boston Harbor, but if we   use Las Vegas as a guide it could be around the same as hotel   revenue. If we assume $150 million in revenue for these business   lines, it's a decent estimate to use for now.",
    "So far, I've laid out how Encore Boston Harbor could get to   around $1 billion in revenue, depending on what you expect from   the casino.",
    "In its estimates for investors, management laid out $900   million in revenue at the low end and $1.1 billion at the high   end, so you can see how management gets there. As for EBITDA,   management sees the low end at $225 million per year, with a high   end of $325 million per year. That's a relatively low return on   investment at the low end, and even the high end isn't going to   blow investors away.",
    "There's value in Wynn Resorts just having a presence on the   East Coast, and that needs to be factored in. But even with high   room rates and lucrative gambling tables, this isn't a   slam dunk investment for the company, and a lot   will have to go right for it to be considered a financial   success    .",
    "  10 stocks we like better than Wynn Resorts       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Wynn Resorts wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Wynn Resorts       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Wynn Resorts wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Travis Hoium      owns shares of Wynn Resorts. The Motley Fool has no position in     any of the stocks mentioned. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:20:00"
}