{
  "url": "https://www.nasdaq.com/article/why-unum-group-unm-is-an-attractive-investment-option-now-cm1207433",
  "title": "Why Unum Group (UNM) is an Attractive Investment Option Now - Nasdaq.com",
  "text": [
    "  Unum Group UNM  is poised for long-term growth on the back of solid performance at Unum U.S. and Colonial Life segments, conservative pricing, reservation practices and a strong capital position. The company has an impressive VGM Score  of A. This style score helps finding stocks with the most attractive value, best growth potential and the most promising momentum.  makeArticleAd();  Unum Group's return on equity was 12.9%, in line with the industry average. Return on equity is a profitability measure that identifies the company's efficiency in utilizing its shareholders' funds.      The company has seen its estimates for 2019 and 2020 move 0.2% and 0.3% north in the past 60 days, reflecting investor optimism on the stock. Shares of the company have lost 13.1% year to date against its industry  's increase of 6.5%.      The company's Unum U.S. and Colonial Life segments should continue to deliver solid results, banking on disciplined sales trends, strong persistency in group lines and growth of new product lines like dental and vision.    The company should see sustained persistency across all Unum U.S. business lines. Management is firm in focus on shifting to a mix of businesses with higher growth and stable margins.    The company has a solid capital position cushioning its financial flexibility. Banking on this, the company increased its dividend for the 11th consecutive year as well as repurchased shares. The dividend yield of 4.5% betters the industry average of 20.4%. These make the stock a lucrative pick for yield-seeking investors.    This Zacks Rank #2 (Buy) leading disability income writer and the second-largest writer of voluntary business in the United States has a decent history of surpassing estimates in two of the last four quarters, the average beat being 1.94%.    The stock is trading at a discount to industry average. Price to book value of 0.56X is lower than the industry average of 1.13X. Also, the company carries a Value Score  of A. Value Score helps picking stocks with the most attractive value. Back-tested results show that stocks with a Value Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 offer the best investment opportunities.    The Zacks Consensus Estimate for 2019 earnings indicates 4.8% growth, higher than the company's expectation between 4% and 7%. The expected long-term earnings growth rate is pegged at 9%, better than the industry average of 6.6%.   Other Stocks to Consider    Some other top-ranked insurance stocks are Amerisafe AMSF  , CNA Financial CNA  and Cincinnati Financial CINF  .    Amerisafe underwrites workers' compensation insurance in the United States. The company delivered a positive surprise of 16.88% in the las t report  ed quarter. The stock sports a Zacks Rank of 1. You can see  the complete list of today's Zacks #1 Rank stocks   here  .  CNA Financial provides commercial property and casualty insurance products, primarily in the United States. The company came up with a positive surprise of 6.93% in the last reported quarter. The stock carries a Zacks Rank of 2.    Cincinnati Financial provides property casualty insurance products in the United States. The company pulled off a positive surprise of 32.81% in the last reported quarter. The stock is Zacks # Ranked.   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   AMERISAFE, Inc. (AMSF): Free Stock Analysis Report   Unum Group (UNM): Free Stock Analysis Report   Cincinnati Financial Corporation (CINF): Free Stock Analysis Report   CNA Financial Corporation (CNA): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Unum Group UNM  is poised for long-term growth on the back of solid performance at Unum U.S. and Colonial Life segments, conservative pricing, reservation practices and a strong capital position. The company has an impressive VGM Score  of A. This style score helps finding stocks with the most attractive value, best growth potential and the most promising momentum.  makeArticleAd();  Unum Group's return on equity was 12.9%, in line with the industry average. Return on equity is a profitability measure that identifies the company's efficiency in utilizing its shareholders' funds.      The company has seen its estimates for 2019 and 2020 move 0.2% and 0.3% north in the past 60 days, reflecting investor optimism on the stock. Shares of the company have lost 13.1% year to date against its industry  's increase of 6.5%.",
    "     The company's Unum U.S. and Colonial Life segments should continue to deliver solid results, banking on disciplined sales trends, strong persistency in group lines and growth of new product lines like dental and vision.    The company should see sustained persistency across all Unum U.S. business lines. Management is firm in focus on shifting to a mix of businesses with higher growth and stable margins.    The company has a solid capital position cushioning its financial flexibility. Banking on this, the company increased its dividend for the 11th consecutive year as well as repurchased shares. The dividend yield of 4.5% betters the industry average of 20.4%. These make the stock a lucrative pick for yield-seeking investors.    This Zacks Rank #2 (Buy) leading disability income writer and the second-largest writer of voluntary business in the United States has a decent history of surpassing estimates in two of the last four quarters, the average beat being 1.94%.    The stock is trading at a discount to industry average. Price to book value of 0.56X is lower than the industry average of 1.13X. Also, the company carries a Value Score  of A. Value Score helps picking stocks with the most attractive value. Back-tested results show that stocks with a Value Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 offer the best investment opportunities.    The Zacks Consensus Estimate for 2019 earnings indicates 4.8% growth, higher than the company's expectation between 4% and 7%. The expected long-term earnings growth rate is pegged at 9%, better than the industry average of 6.6%.   Other Stocks to Consider    Some other top-ranked insurance stocks are Amerisafe AMSF  , CNA Financial CNA  and Cincinnati Financial CINF  .    Amerisafe underwrites workers' compensation insurance in the United States. The company delivered a positive surprise of 16.88% in the las t report  ed quarter. The stock sports a Zacks Rank of 1. You can see  the complete list of today's Zacks #1 Rank stocks   here  . ",
    "CNA Financial provides commercial property and casualty insurance products, primarily in the United States. The company came up with a positive surprise of 6.93% in the last reported quarter. The stock carries a Zacks Rank of 2.    Cincinnati Financial provides property casualty insurance products in the United States. The company pulled off a positive surprise of 32.81% in the last reported quarter. The stock is Zacks # Ranked.   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:35:00"
}