{
  "url": "https://www.nasdaq.com/article/vera-bradley-inc-vra-q2-2020-earnings-call-transcript-cm1207505",
  "title": "Vera Bradley Inc (VRA) Q2 2020 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   Vera Bradley Inc    (NASDAQ: VRA)        Q2 2020 Earnings Call       Sep 4, 2019 ,   9:30 a.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Good day, and welcome to the Vera Bradley Second Quarter   Fiscal 2020 Earnings Conference Call. [Operator Instructions] At this time, I would like to turn the conference over to Mr.   Mark Dely, Chief Administrative Officer. Please go ahead,   sir.  Mark Dely    --   Chief Administrative Officer  Good morning, and welcome, everyone. We'd like to thank you   for joining us for Vera Bradley's second quarter call. Some of   the statements made on today's call during our prepared remarks   and in response to your questions may constitute forward-looking   statements made pursuant to and within the meaning of the safe   harbor provisions of the Private Securities Litigation Reform Act   of 1995 as amended. Such forward-looking statements are subject to both known and   unknown risks and uncertainties that could cause actual results   to differ materially from those that we expect. Please refer to   today's press release and the company's most recent Form 10-K,   filed with the SEC for a discussion of known risks and   uncertainties. Investors should not assume that the statements   made during the call will remain operative at a later time. We   undertake no obligation to update any information discussed on   the call. I'll now turn it over to Vera Bradley's CEO, Rob Wallstrom.   Rob?  Robert Wallstrom    --   President, Chief Executive Officer and Director  Thank you, Mark. Good morning, everyone, and thank you for   joining us on today's call. John Enwright, our CFO also joins me   today. Vera Bradley's comparable sales, full price selling and   customer count were all up again in the quarter. However, the   overall retail environment and the handbag market in particular   remain challenging. We have been most affected in the indirect   channel as our partners continue to feel the pressure of this   difficult retail environment, and therefore, our total indirect   sales fell slightly below our expectations. Additionally, gross   margins continue to be pressured by increasing tariffs and higher   international and domestic shipping costs. As you might recall, the first stage of Vision 2020 was to   restore the brand and company health and we continue to build   upon the progress we have made so far. During the first half of   this year, we once again improved quality of sales in our   full-line stores and verabradley.com by increasing comparable   full price selling in these two channels by approximately 10%.   This is on top of a 20-plus percentage increase in the first-six   months of last year. This is year two of our three year journey,   and we are keenly focused on expanding our customer base and   increasing both sales and profitability. As a reminder, our key areas of focus for fiscal 2020 are   number one growth. Our goal for the Vera Bradley brand is to   return to positive sales growth this year, and we are off to a   solid start in the first half, with comparable sales up 3.3%, in   line with our expectations and despite a challenging North   American handbag market. This improvement is being driven by   compelling, innovative product supported by targeted marketing   and customer engagement. Customer count is also up   year-over-year. Number two, operational excellence. We are investing in   technology, strengthening business processes and addressing   Chinese tariffs. During the second quarter, we began a two-year   process of replatforming our enterprise resource planning and   other key information systems to become more streamlined, nimble   and efficient in our technology and business processes. By the   end of this fiscal year, our production exposure in China will   drop to less than 25% from approximately 54% last year. Beginning   in the fourth quarter of this year, we will begin to see the   gross margin benefit of moving production to the Generalized   System of Preferences GSP countries. Number three, ownership. We will continue to reinforce our   culture as an ownership-based model, where every associate can   drive value creation to their individual and team efforts. And   once again, we receive best-in-class engagement scores during our   annual associates survey and we continue to have industry leading   customer service scores. Both underscore how our culture is a   prime asset and one that is key to our long-term growth plans. We   also continue to strengthen Vera Bradley's position as a unique   lifestyle brand with our second quarter acquisition of a majority   interest in Pura Vida Bracelets. Pura Vida is based in La Jolla, California and is rapidly   growing, digitally native, and highly engaging lifestyle brand   that deeply resonates with its loyal consumer following. The Pura   Vida brand has a differentiated and expanding offering of   bracelets, jewelry, and other lifestyle accessories. Vera Bradley   and Pura Vida are highly complementary businesses and have many   similarities, including devoted, emotionally connected, and   multi-generational customer base; alignment as casual,   comfortable, affordable, and fun lifestyle brands; positioning as   gifting and socially connected brands and strong entrepreneurial   cultures. We will share resources and knowledge to grow our   brands together. Pura Vida is a great strategic fit for us due to   their strong expertise in branding and social marketing   strategies, as well as robust competencies in e-commerce and   subscription-model selling. And, Pura Vida has already started to   utilize Vera Bradley's infrastructure and back office support   capabilities to nurture its growth. Now I will turn the call over to John to review the financial   results and outlook. John?  John Enwright    --   Executive Vice President and Chief Financial Officer  Thanks, Rob and good morning. Let me go over a few highlights   for the quarter. The financial performance for the current year   second quarter and six months, I will discuss, our non-GAAP and   exclude Pura Vida acquisition related expenses, including   transaction costs, inventory step-up amortization, and intangible   asset amortization, as well as expenses related to the   replatforming of information technology systems outlined in   today's release. The performance includes results for Pura Vida   for the stub period, which is July 17 through the end of the   quarter. Second quarter consolidated net revenues totaled $119.8   million for the current year second quarter, which included $5.4   million of net revenues from Pura Vida. Excluding Pura Vida, Vera   Bradley net revenues totaled $114.4 million, a 0.7% increase over   the $113.6 million in the prior year second quarter. Excluding   charges consolidated second quarter net income attributable to   Vera Bradley Incorporated totaled $8.7 million or $0.25 per   diluted share, which included approximately $0.01 of accretion   attributable to Pura Vida. For the prior year second quarter, we   posted net income of $9.3 million or $0.26 per diluted share. Current year second quarter Vera Bradley Direct segment   revenues totaled $94.4 million, a 3.7% increase over $91 million   in the prior year second quarter. Comparable sales increased 2.1%   for the quarter. As expected, comparable sales were negatively   impacted by the year-over-year reduction of approximately $3   million of clearance sales from the quarter, primarily affecting   e-commerce sales. Indirect segment revenues decreased 11.4% to   $20 million from $22.6 million in the prior year, reflecting a   reduction in orders and in the number of specialty and department   store accounts as well as inbound shipping delays. Excluding the inventory step-up amortization, gross profit   totaled $68.4 million or 57.1% of net revenues, compared to $65.7   million, or 57.9% in the prior year second quarter. Pura Vida   increase the current year second quarter non-GAAP gross margin by   20 basis points. As expected, improvement in full-price selling   and sourcing and operational efficiencies were more than offset   by the impact of Chinese tariffs and increased shipping   costs. Excluding the Pura Vida transaction costs, intangible asset   amortization and information technology replatforming charges,   SG&A expense was $57.8 million or 48.2% of net revenues in   the current year second quarter, compared to $53.8 million or   47.3% in the prior year second quarter. Pura Vida contributed   $2.4 million of SG&A expenses. Excluding these additional   expenses Vera Bradley SG&A expenses were higher than the   prior year primarily due to related new factory store openings   and variable expenses to drive revenues, but were within the   guidance range of $55 million to $56 million. For the six months consolidated net revenues totaled $210.8   million, which included $5.4 million of net revenues from Pura   Vida, compared to $200.2 million last year. Excluding charges the   company's consolidated net income attributable to Vera Bradley   Incorporated for the six months total $6.9 million, or $0.20 per   diluted share, which included approximately $0.01 of accretion   attributable to Pura Vida. For the prior year six months, the   company posted net income of $7.9 million or $0.22 per diluted   share. Direct segment revenues for the six months totaled $165.5   million, a 5.7% increase over the $156.6 million in the prior   year. Comparable sales increased 3.3% for the period. Full-price   selling in the full-line stores and on verabradley.com increased   approximately 10% for the six months. Indirect segment revenues   for the six months decreased 8.7% to $39.9 million from $43.7   million in the prior year, reflecting a reduction in orders from   both specialty accounts and certain key accounts, as well as   inbound shipping delays. Excluding the inventory step-up amortization, gross profit for   the six months totaled $118.8 million, or 56.4 % of net revenues,   compared to $114.4 million, or 57.1% of net revenues, in the   prior year. The inclusion of Pura Vida benefited the current year   non-GAAP gross margin percentage by approximately 10 basis   points. As expected, improvement in full-price selling and   sourcing and operational efficiencies were more than offset by   the impact of Chinese tariffs and increased shipping costs.   Excluding Pura Vida transaction costs, intangible asset   amortization and information technology replatforming charges,   SG&A expenses totaled $111.2 million, or 52.8% of net   revenues in the current year six months, compared to $104.5   million, or 52.2% of net revenues, in the prior year. Pura Vida   contributed $2.4 million of SG&A expenses. Now let me turn to the balance sheet. Net capital spending for   the second quarter and six months totaled $4.7 million, and $8.1   million respectively. During the second quarter, we repurchased   approximately $2.2 million of common stock, or 197,000 at an   average price of $11.34. At quarter end, we had approximately $42   million remaining under the $50 million share repurchase   authorization. Cash, cash equivalents, and investments as of August 3, 2019   totaled $70.5 million compared to $144.8 million at the end of   last year's second quarter. The reduction from the prior year is   related to the July 2019 acquisition of Pura Vida for   approximately $75 million in cash. We continue to have no debt   outstanding. Total quarter end inventory was $130.7 million,   which included $26.2 million of Pura Vida inventory. Excluding   Pura Vida our core brand inventory was $104.5 compared to $86.3   million at the end of the second quarter last year. The inventory   was at the high end of our guidance range about $95 million to   $105 million primarily due to the acceleration of quarter end   receipts in order to minimize the impact of tariffs. Now, let me take a couple of minutes to review our outlook for   the third quarter and full year. All forward-looking guidance   numbers that I will discuss are non-GAAP and include expected   Pura Vida performance. Prior numbers exclude Pura Vida. Full year   gross margin, SG&A and diluted EPS numbers exclude the   previously disclosed charges related to the acquisition of Pura   Vida and information technology systems replatforming charges, as   well as any additional purchase accounting adjustments related to   Pura Vida. For this third quarter, we expect net sales of $122 million to   $129 million, which includes estimated Pura Vida revenues of $23   million to $25 million. Prior year third quarter revenues totaled   $97.7 million. For the quarter, we expect Vera Bradley's Direct   segment net sales to increase in the low to mid-single digit   range, including low-single digit positive comparable sales. We   expect Vera Bradley indirect net sales will be flat to up in the   low-single digit range for the quarter. We expect our third   quarter gross margin will be between 57.5% and 57.9% compared to   last year's third quarter rate of 58.5%. Sourcing operational efficiencies are expected to be more than   offset by the impact of China tariffs. The inclusion of Pura Vida   should have a positive impact on the consolidated gross margin.   Third quarter SG&A expense is expected to range from $62.5   million to $64 million compared to last year's SG&A expense   of $51.9 million, reflecting incremental expenses associated with   new factory store locations and approximate $11 million of   estimated expenses related to Pura Vida operations. We expect   third quarter diluted EPS of $0.16 to $0.20, reflecting accretion   of approximately $0.05 from Pura Vida. Diluted EPS was $0.12 in   the prior year third quarter. We expect inventory to be in $120   million to $130 million range at the end of the third quarter,   compared to $96.3 million at the end of last year's third   quarter. Included in this estimate is approximate $20 million of   Pura Vida inventory. For full year, we expect net sales of $490 million to $505   million, which includes estimated Pura Vida revenues of $65   million to $70 million. Net revenues totaled $416.1 million last   year. The sales estimate reflects the removal of approximate $5   million of additional Vera Bradley clearance sales this year, $3   million in the second quarter and the balance in the fourth   quarter. Our full year revenue guidance assumes that Vera Bradley   Direct segment net sales will increase in the low to mid-single   digit range, compared with the prior year, including a low-single   digit increase in comparable sales. We expect that Vera Bradley   indirect net sales will be flat to down in the low-single digit   range for the full year. We expect our gross margin for fiscal   2020 will be between 57.4% to 57.6%, compared to 57.3% last   year. Sourcing and operational efficiencies are expected to be fully   offset by the impact of Chinese tariffs. The inclusion of Pura   Vida should have a positive impact on consolidated gross margin.   We expect SG&A expenses to total between $242 million to $246   million for the year, compared to $212 million last year.   Reflecting incremental expenses related to new factory store   locations, partially offset by full-line store closures.   Approximately $27 million to $28 million of the estimated   expenses relates to Pura Vida operations. We expect full year   diluted EPS will range from $0.86 to $0.93, which contains prior   Vera Bradley annual guidance of $0.67 to $0.74 plus accretion   from the Pura Vida acquisition. Diluted EPS last year totaled   $0.59. A note on tariffs. We estimate tariffs would negatively affect   gross margin by approximately 80 basis points for the year,   equating to about $0.08 per share. We expect capital expenditures   will total approximately $13 million compared to $8.1 million   last year, reflecting investments in new factory stores and   technology and logistic enhancements. We expect to generate $45   million to $55 million of operating cash flow in fiscal 2020,   which includes the benefit of Pura Vida. Rob?  Robert Wallstrom    --   President, Chief Executive Officer and Director  Thanks, John. We are off to a solid start in returning to   positive sales growth this year, with our year-to-date 3.3%   comparable sales increase. We are engaging our current customers   and bringing new customers to Vera Bradley with our compelling   and innovative product, supported by our marketing efforts and   customer experience initiatives. On the product line, we continue   to build dominance in our key franchise areas like travel,   campus, beach and gifts, as well as our top 10 items. Our back to   school selling period is under way and the sales of the backpacks   and lunch bags are exceeding last year. Newness for the season   includes our clearly colorful collection, larger school backpacks   and smaller fashion backpacks and slings. We have a lot of   innovation and newness to showcase this fall. Last month we launched Performance Twill. The rise of the   athleisure movement has made customers' purchasing decisions   increasingly driven by performance. Performance Twill is a   lightweight, durable, water-repellent and our newest definition   of a beautiful solution. This is our first launch in a series of   innovative performance fabrics. Also in August, we enhanced our   Signature duffel franchise by adding more sizes and shoulder   straps, and our innovative lay flat duffel will debut in   November. We will offer two small capsule collections this fall.   Our fun and playful cats meow capsule collection will launch this   month. And pretty posies pink, our pink capsule for breast cancer   awareness month will debut in October. Our special limited time   capsule collection centered around seasonal periods or novelty   add excitement and a sense of urgency for our customers to shop.   We will continue to innovate and add sustainability elements to   our products. Our reactive collection made of recycled plastic   bottles is our sustainable update to lighten up and will be   introduced in 2020. Offering limited edition collections in   collaborations with unique partners increases our brand exposure   and provides momentum to our growth. We have entered into several   high profile product collaborations this year. The Vera Bradley Plus Venus collection launched in April   continues to perform above expectations at Target. The collection   features a popular Vera Bradley design on a selection of   Gillette, Venus's core and special editions shaving products. In   May, we debut a collaborative drink wear and accessories   collection was Starbucks Asia Pacific. This collection has been   very successful and is helping us broaden our international brand   awareness and expand our reach. In July, Vera Bradley Plus Crocs   debut our limited edition footwear collection, which combined   Vera Bradley signature bright florals and paisley designs with   Crocs, World renowned comfort. Most styles and sizes sold out   almost immediately. Interestingly about 30% of the customers that   purchase Crocs on our website were new to our brand. Two weeks ago, we debuted our co-branded Vera Bradley plus   Pura Vida backpack. We partnered together to build the perfect   back-to-school backpack using Vera Bradley's best selling iconic   Campus Backpack silhouette and a print inspired by the   distinctive West Coast vibes of the Pura Vida lifestyle. The   backpack forgoes Vera Bradley's traditional quilted cotton and   instead features a unique cotton-linen slub yarn fabrication. We   think that Vera Bradley Plus Pura Vida iconic Campus Backpack   collaboration is the perfect way to celebrate our new   partnership. With each purchase of this backpack, customers   receive a complimentary Pura Vida original bracelet. Building off   the success of the last two extremely popular Disney   collaborations. This fall, we will once again partner with DISNEY   Theme Park merchandise to create another limited edition novelty   pattern and collection. Disney and Vera Bradley are a perfect   fit. We are both committed to creating memorable and fun customer   experiences, and we know that many of our Vera Bradley fans are   also huge Disney enthusiasts. Today, we announced another exciting collaboration, Harry   Potter. Vera Bradley's design team will collaborate with Warner   Bros. Consumer Products to create a Vera Bradley plus Harry   Potter back-to-campus and dorm line featuring bags, accessories,   stationery, drinkwear, tech products, bath and bedding, which   will launch in June 2020. A Vera Bradley Plus Harry Potter cozy   capsule featuring a fleece robe, slippers and a sheared throw   blanket will launch in November 2020, just in time for holiday   gifting. We are thrilled to partner with Warner Bros. Consumer   Products to create a magical fun collection that will appeal to   all generations. Additionally, we appreciate and support the messages of   diversity, acceptance, hope and equality that are woven   throughout the Harry Potter and Wizarding World works, as these   closely aligned with Vera Bradley's values. We know that many of   our Vera Bradley fans are also Wizarding World devotees who will   love these amazing products. Our ability to attract such amazing   partners like Gillette Venus, Starbucks, Crocs, Disney and Warner   Bros. Consumer Products is truly a testament to the strength and   wide appeal of our brand. All of these collaborations are also an   extension of our goal to offer beautiful solutions to our   customers. We are working with other iconic, internationally   known brands and other exciting future product   collaborations. Let's now turn to marketing. Our digital and marketing teams   are focused on accelerating our digital and customer growth. We   have completed the insourcing of our customer data science team,   added to our business analytics team and completed the rollout of   our new customer data platform. We are actively using the   insights we gain from our robust customer data to adjust our   marketing mix on a real-time basis. We are excited by the results   we are seeing from these investments in customer data and digital   media. In digital media, new customer visits have improved   year-over-year as has revenue directly derived from these   initiatives. Looking at the overall impact of these investments across our   channels, we saw a double-digit increase year-over-year and new   customers for the brand. We will continue to mine our customer   data and optimize our marketing spend for the back half of the   year. Brand collaborations and influencer engagement continue to   be important for the brand, and we saw a significant results in   the quarter. Our collaborations with Gillette, Starbucks and   Crocs all show a heightened strength and relevance of our brand   and generated enormous media buzz. Media impressions increased   more than 300% over last year's second quarter. As we reinforce our position as a total stakeholder focused   and socially conscious organization, marketing and social media   engagement plans are critical in this endeavor. We continue to   strengthen our community support and charitable initiatives under   the umbrella of the VB cares. We are identifying areas where we   can make a meaningful impact, particularly on the lives of women   and children. We are taking a stance for change and often invite   our customers to participate with clear calls to action. This   summer, we donated thousands of Vera Bradley beach towels to the   Fresh Air Fund, a not for profit agency that supports summer camp   experiences for children from the New York City's low income   communities. We are continuing our partnership with Blessings in   a Backpack for a second consecutive year. Blessings in a Backpack mobilizes communities, individuals and   resources to provide food for millions of elementary school   children across America, who might otherwise go hungry. Through   Blessings in a Backpack, we are donating 50,000 backpacks to   children in need throughout the US. We are also in the midst of   hosting several backpack packing events, school carnivals and   annual back-to-school distribution events in select markets   including New York, Los Angeles, Chicago, Nashville, Charlotte   and Panama City, Florida. Each event will culminate in backpack   giveaways, and some events will feature celebrity appearances,   including Misty Copeland, Principal Dancer. The American Ballet   Theatre, Dale Earnhardt, Jr., racing legend, and NBC Sports   motorsports analyst, Lauren Alaina, country music singer and   songwriter and many more. In August, we also launched an awareness in fundraising   campaign benefiting Blessings in a Backpack in our stores and on   verabradley.com. And with a minimum $10 donation to Blessings in   a Backpack, customers received a free Vera Bradley mini backpack   keychain to show their support for the organization. Through this   effort, our customers helped us raise over $70,000 for the   organization in the month of August. Activities supporting the   Vera Bradley Foundation for Breast Cancer go on all year, but   October is especially significant since it is Breast Cancer   Awareness Month. We will be offering special merchandise and   in-store events with the support of our customers, we expect to   raise over $2 million this year, and since the inception of the   foundation, we have raised over $32 million to fund advanced   breast cancer research at Indiana University's Comprehensive   Cancer Center. Moving on to distribution. Our goal is to grow sales in each   of our channels in fiscal 2020. In our full-line stores, we are   focusing on our highest potential stores enhancing the customer   experience, further localizing our assortments and adding more   compelling display windows. We are also testing alternative   vehicles to sell our full-line products, including pop-up shops   and airport vending machines, which will launch this fall. We   continue to rationalize and strengthen our full-line store base.   We closed five underperforming full-line stores in the first-six   months of the year and expect to close about five more this year.   This will bring our total store closings to 25 since the   beginning of fiscal 2018 and we could potentially close up to an   additional 15 following this fiscal year. At the end of the   quarter, we had 94 full-line stores. This year, we are working to maximize factory performance by   refining our pricing model and adding six new locations, five of   which have already opened. In addition, we are relocating and   expanding three of our best performing factory stores. The move   and expansion of Sevierville, Tennessee was complete in July. The   Larger Destin, Florida store opened in August and the Branson,   Missouri location -- relocation to a larger space will be   complete in October. At the end of the quarter, we had 62 factory   stores. We continue to focus on creating an engaging customer   experience in both our full-line and factory stores on   verabradley.com and our fulfillment operations and in our   customer service department. Our robust voice of customer   initiative and our new customer service model rolled out into our   full-line stores and once again drove industry leading customer   satisfaction scores in the quarter. In the specialty channel, we are focused on our top accounts   and reengaging lapsed customers. We are paring back our   distribution and department store arena to focus on the most   productive locations. Vera Bradley is currently represented in   about 450 department stores. Our brand is resilient, our team is   experienced and creative, and our future is exciting. Over the   last year, we have made significant progress in restoring our   company to health and have begun to return to growth. We are   looking forward to completing our Vision 20/20 journey and   beginning to focus on the years beyond. And we are very excited   about the Pura Vida acquisition and the potential growth of that   brand. Operator, we will now open the call to questions. Questions and Answers:  Operator  Thank you. [Operator Instructions] And our first question,   we'll hear from Mark Altschwager with Baird.  Mark Altschwager    --   Robert W. Baird -- Analyst  Great. Good morning. Thanks for taking my question. Rob, these   collaborations have been really interesting. I'm curious, if you   could talk a little bit more about what you've been learning so   far. Specifically, is there anything particularly surprising with   respect to the profile of the customer that you're attracting to   the brand? And does she look like you're the core customer or do   you think you're expanding the tent a bit?  Robert Wallstrom    --   President, Chief Executive Officer and Director  Good morning, Mark. Thanks for the question. No, we are   absolutely very excited by these collaborations. I think one   thing that has been probably extra exciting is the fact that all   of these collaborations, the results that we've seen across the   various channel, whether it's Starbucks, whether it's through   Gillette, Venus and Target, whether it's through Crocs, the   consumer response has just been kind of overwhelming both in   those channels as well as in our own channel. So we're -- it   really, I think, just points to the vibrancy of the brand and how   strong the brand is. We are also seeing as we look at the   customer file, we are attracting a new customer to the brand. And   you're really seeing it show up in our brand awareness, right?   Our brand awareness -- our aided brand awareness scores keep   going up year-after-year. And so we're really excited about what   this means for the brand as we go forward.  Mark Altschwager    --   Robert W. Baird -- Analyst  Thank you. And then, a lot of these product and marketing   initiatives have really been focused on the full-price business   and you're clearly seeing some nice success there. Curious how   the strategies are touching the factory business and what's   giving you the confidence in the sustainability and growth in the   factory channel?  Robert Wallstrom    --   President, Chief Executive Officer and Director  Yeah, Mark. We definitely are focusing the collaborations on   our full-price business, part of our strategy and Vision 20/20   was really to get strong growth for our full-price channel and   kind of move from the strong clearance focus. So our   collaborations are definitely focused on full price. But I do   believe that as brand awareness goes up, the brand becomes   stronger that, that also plays to demand in factory channel as   customers are out shopping the factory channel. And we've been   very pleased with how our factory stores have been performing in   the first half of the year. We've taken a very focused approach   in that channel, 95% of the product is made exclusively for it.   Very focused on key items, key fabrications and really making   sure that we're managing the promotional environment very tightly   and that strategy is paying off for us right now in factory. And   you're seeing us, as we're continuing to expand our top stores   that we believe we still have more growth opportunity in   factory.  Mark Altschwager    --   Robert W. Baird -- Analyst  Great. Thanks. And then switching gears for a moment to Pura   Vida. It looks like the new outlook incorporates about $60   million to $65 million in revenue for the back half. I mean,   that's about equal to the full year revenue in calendar '18 you   discussed back in June. So I'm wondering, as we update our   models, is there any further detail you can provide and how   you're thinking about the annualized contribution from Pura Vida   and the growth trajectory you're anticipating over the next   couple of years?  John Enwright    --   Executive Vice President and Chief Financial Officer  Hey, Mark. This is John. So yeah, the back half a year we   anticipated it actually to be about $65 million to $70 million,   which would basically be 100% of what happened in prior year. The   way we're thinking about it, and ultimately, we're not giving   guidance for next year. But we do anticipate significant growth   year-over-year this year and we'd expect nice growth over the   coming next two to three years associated with the brand. So on   average, you can think about the brand growing close to 50% this   year and we do expect to be a little bit less than I mean, kind   of the out years.  Mark Altschwager    --   Robert W. Baird -- Analyst  Thanks for all the detail and best of luck.  John Enwright    --   Executive Vice President and Chief Financial Officer  Thanks.  Robert Wallstrom    --   President, Chief Executive Officer and Director  Thanks, Mark.  Operator  Next, we'll move to Oliver Chen with Cowen and Company.  Oliver Chen    --   Cowen and Company -- Analyst  Hi. Thank you. Regarding the indirect channel, what are you   seeing in this channel and what are your thoughts about the   distribution footprint and what you expect going forward as it   can be a challenging channel that forecast and the inventory   management is a little bit different? Thank you.  Robert Wallstrom    --   President, Chief Executive Officer and Director  Thanks, Oliver. When you look at our indirect channel, there's   obviously a lot of different pieces. So the biggest chunk of that   is our indirect specialty channel. So let me talk about that   first. First of all, what they're feeling is a little bit of the   same pressure I think that we're seeing in department stores,   just the general retail environment has been challenging for   them. But we're actually encouraged by what we're seeing and what   we're hearing from them, that they're giving us very positive   feedback in terms of the Vera Bradley performance in their   channel, that they're seeing much improvement in terms of   full-price sell through, profitability. So there's definitely a lot of positivity particularly with   our best accounts. And we're just working through the challenges   that, that channels facing. But overall, we're feeling that,   that's an important part of not only our past but our future, so   our partnership with the specialty channel, we think continues to   be important, but there obviously is a lot of change that goes on   there with all the smaller stores, new ones coming in every year,   some going out and so it just takes a lot of focus from our team   to make sure that we focus in on that channel. So that's one. The second piece of it is the department store world. The   department store world, I think as we've all seen it's been under   pressure. I think handbags in particular has been under pressure   and the department store world quite often seems to follow a   trend. So we're looking at that and making sure that we're just   very focused in there. Our strategy behind department store   selling was always about new customer pickup and new customer   acquisition. And so as we're looking at that, we think we are   going to continue to fine-tune the store counts. In other word   might be tightening up that store count to make sure that we're   focusing on the most appropriate stores and the stores that can   really bring an additional new customer to the brand. So that   would be the second piece. And then the third piece, I think becomes the rest of the   channel. Our Amazon business is performing very well. We're   excited about what's happening in the e-commerce side of the   wholesale world so we're going to continue to expand in that   area. And then lastly, the smaller piece of our business, but in   liquidation that there is definitely a lot of liquidation handbag   product we have in the market today. And so there's definitely   some pressure on that side of the business in terms of   availability of liquidation, but for us, that's OK, because we've   been pulling down our clearance, we've been focusing less on it,   but there is some pressure on that side of the business also.  Oliver Chen    --   Cowen and Company -- Analyst  Yeah. As we think about what's happening in the industry, I   would love your thoughts on traffic and traffic trends and   volatility across a full-price versus outlet, as well as the   thoughts on liquidation, it's been very promotional in the   marketplace. What are your expectations for how your merchandise   margins may trend?  John Enwright    --   Executive Vice President and Chief Financial Officer  From a traffic perspective, we're seeing from a full-price   perspective, we're seeing a little bit softer than kind of our   factory business, but ultimately we anticipated that when we put   together our forecasts in our plan. So traffic has been down   roughly about 4% year-over-year. If we think about kind of our   merchandise margins as we move forward, I don't anticipate   significant changes from the first half of the year, in regards   to how promotional we're going to be in the back half of the   year, so I would think as we've built into our forward-looking   guidance for the third quarter and then for the year, we've taken   consideration to how we look at our promotional activity as well   as some of the input costs in any shipping costs associated with   that. So I think we've kind of we feel more comfortable   ultimately with our margin coming through the second quarter and   the impact, as Rob mentioned in the call is -- remarks in -- for   GSP, the benefit we'll see kind of in the back half of the year   most significantly in the fourth quarter for the GSP margin.  Robert Wallstrom    --   President, Chief Executive Officer and Director  I think the only thing I would add to it, John, as we talk   about our marketing team and our data science team and becoming   more and more analytical, one of the areas that we're definitely   placing a lot of that analytical focus is in the promotional   effectiveness. How do we really fine-tune the promotional   activity? How do we take the targeted approach, whether it's by   category or customer geography store? So we're becoming much more   micro focused in our promotional activity which we think will   help us move through this period of promotional activity.  Oliver Chen    --   Cowen and Company -- Analyst  On Pura Vida, there is a huge opportunity to really leverage   their digital expertise as well as your young customer base. What   should we monitor in terms of how you'll embrace that across your   organization at large?  Robert Wallstrom    --   President, Chief Executive Officer and Director  Yeah. No, Oliver, you're definitely pointing to one of the   areas where we think that there is real synergy. So our teams are   working together to really learn from what Pura Vida has done.   I'm really focusing on how do we improve the effectiveness,   particularly with our younger customer and so a lot of what Pura   Vida has done is really done a great job of engaging that youth   customer which has always been such an important part of our   brand. So if you think about what is the focus? I would say,   there is really three key areas. One is on social media. They've   done a great job this year of basically doubling their Instagram   following and we think that there's a lot to learn from them on   the social media side. The second is moving our marketing into much more of a   user-generated content/influencer generated content experience.   So you're going to see more authenticity coming through our media   over the next 12 months. And then, I think lastly and also   importantly is, just looking at website and the different   capabilities, with different tools they're using that they're   being more forward and being on the Shopify platform, that   they're taken advantage of a lot more of the innovation that's   happening in the e-commerce world. And we're expecting to   leverage a lot of those learnings, particularly as we move   through our technology program and join them on the Shopify plus   platform.  Oliver Chen    --   Cowen and Company -- Analyst  Thank you. And lastly, regarding products, you made some great   updates to some of your classic silhouettes. How is the customer   response then? And what are your thoughts on balancing changes to   your core versus layering in newness and managing risk as well as   innovation?  Robert Wallstrom    --   President, Chief Executive Officer and Director  Great question, Oliver. So a couple things. I think, one, we   are continuing to see strength in our core and our really our   hero products in terms of things like our campus backpacks and   duffels and things that were traditionally known for. In one way   that we're driving innovation through just those core items is   using fabrication, so that we can keep those products even   feeling fresh. But you're right that there definitely is this   balance between bringing newness to the market as well as keeping   our heritage going. And as we look at newness, we are trying new   silhouettes, a great example of a big success was we brought in   our sling backpack during the second quarter, which we had --   never had a sling in our line. It far exceeded our expectations   and that really reinforced our belief that our customers becoming   more and more, what I call, silhouette focused and functional   focused as opposed to just pattern focus. So I think that becomes   really critical. The other thing that you're seeing us do is, as we talked   about November with our duffel franchise, bringing in the lay   flat technology, it's a great way of really updating something   that is so iconic for us. But I will tell you that this new lay   flat design is great. I think our customers are absolutely going   to be -- that I personally am a big fan and using it all the   time. And the other one that we talked about is Performance   Twill. And what's interesting with our Performance Twill launch,   we put it out of market in August and then with the launch this   week, we're focusing even more on the website, not only is it a   great new fabrication, but we are really trying to balance both   heritage items, which you're going to see, as well as new design.   So, for example, in our Performance Twill, not only was our   campus backpack, one of our best sellers, but the other thing was   we designed to do work tote that we really listened and built   some innovation in that the customer was asking for and that's   been another surprise winner. So our customer wants us to balance   both heritage and innovation.  Oliver Chen    --   Cowen and Company -- Analyst  Thank you. Best regards.  Robert Wallstrom    --   President, Chief Executive Officer and Director  Thanks, Oliver.  Operator  [Operator Instructions] Next, we will move to Steve Marotta   with CL King & Associates.  Steve Marotta    --   CL King & Associates -- Analyst  Good morning, Rob and John, as far as Pura Vida, Can you talk   a little bit about...  Robert Wallstrom    --   President, Chief Executive Officer and Director  Steve, we can't really hear you. Can you speak up more?  Steve Marotta    --   CL King & Associates -- Analyst  Is it a little bit better?  Robert Wallstrom    --   President, Chief Executive Officer and Director  That's little bit better.  Steve Marotta    --   CL King & Associates -- Analyst  Maybe, this is better?  Robert Wallstrom    --   President, Chief Executive Officer and Director  Much better, yes.  Steve Marotta    --   CL King & Associates -- Analyst  All right. Can you talk a little bit about Pura Vida's   accretion from an earnings standpoint in any sort of seasonality   that's associated with that acquisition? In other words, it is   adding $0.20 this year. Is there a first half loss that might be   incorporated as we think about our next year numbers?  John Enwright    --   Executive Vice President and Chief Financial Officer  Steve, this is John. So did you say is there a first year with   loss that we should think about? I just want to make sure I heard   the question.  Steve Marotta    --   CL King & Associates -- Analyst  First half.  John Enwright    --   Executive Vice President and Chief Financial Officer  So the answer to that question is no. Ultimately, they have   some seasonality in their business. It's fairly similar to our   seasonality where they do have a nice summer business close to   kind of our back-to-school business, as well as a holiday season   business. So as you pointed out, we expect accretion close to   about $0.20 in the back half of this year, and as you kind of   model it out for next year and we'll obviously more guidance in a   few months in regards to what we expect for next year. But I   wouldn't anticipate any kind of reduction in the first half the   year from EPS obviously, which is going to be -- we anticipate   accretion in the first half.  Robert Wallstrom    --   President, Chief Executive Officer and Director  Yeah. I think one way to think about it is that the   profitability and the way their business model works, since it's   a low overhead business and a lot of its marketing and sales,   that the flow-through relative to the sales is not super   differences in over seasons.  John Enwright    --   Executive Vice President and Chief Financial Officer  Yeah.  Robert Wallstrom    --   President, Chief Executive Officer and Director  I think you're going to see a little bit smoother earnings   flow than maybe you see in some retail businesses because there's   not a big fixed cost base that you're leveraging now in fourth   quarter. So we'll obviously give more guidance next year, but   it's definitely a very healthy business and very accretive.  Steve Marotta    --   CL King & Associates -- Analyst  Okay. That's helpful. And just reiterating your China   exposure. You mentioned it was 54% last year, 25% that you spoke   about, that's a run rate at the end of the year, correct, that's   not the blended rate for the entire year?  Robert Wallstrom    --   President, Chief Executive Officer and Director  No, that's actually the blended rate of the total purchases   that we had made out of China this year when we're roughly about   25% or a little bit less than that and we anticipate that we're   going to move that down a little bit next year.  Steve Marotta    --   CL King & Associates -- Analyst  Okay. All right. That's very good. And were there any   incremental tariffs associated with this September 1, upping to   that 5% to 25% to 30%?  John Enwright    --   Executive Vice President and Chief Financial Officer  Yeah. There is incremental tariffs associated with kind of the   September 1, for List 4. So we had product that was being   excluded from tariffs when it was List 3. So now all the products   that we purchase out of China will have tariffs as of December   15, once they implement the incremental tariffs associated with   the broken up List 4 between September 1 and December 15. So by   the end of the year, if there are no changes, we will have   incremental tariffs for 100% of our purchases out of China.  Steve Marotta    --   CL King & Associates -- Analyst  Okay. That's helpful. Thank you very much.  Operator  And at this time, that will conclude the question-and-answer   session, I would like to turn the call back over to Rob Wallstrom   for any additional or closing remarks.  Robert Wallstrom    --   President, Chief Executive Officer and Director  Thank you very much for joining us on today's call. We are   very pleased with the progress we have made since we launched   Vision 20/20. Although the current North American handbag market   is challenging, we are steadfastly focused on the future and on   delivering growth in revenue, profit and shareholder value. Don't   forget to sign up for our Investor and Analysts Day in our SoHo   store on Thursday, October 3. Griffin Thall and Paul Goodman,   Pura Vida's Founders will be there along with members of the Vera   Bradley management team, including Beatrice Mac Cabe, our Chief   Creative Officer and Daren Hull, our Chief Customer Officer. So   if you are interested contact Julia Bentley, our Vice President   of Investor Relations at jbentley@verabradley.com. Thank you for   your time.  Operator  [Operator Closing Remarks]  Duration: 46 minutes  Call participants:  Mark Dely    --   Chief Administrative Officer   Robert Wallstrom    --   President, Chief Executive Officer and Director   John Enwright    --   Executive Vice President and Chief Financial Officer   Mark Altschwager    --   Robert W. Baird -- Analyst   Oliver Chen    --   Cowen and Company -- Analyst   Steve Marotta    --   CL King & Associates -- Analyst   More VRA analysis   All earnings call transcripts        10 stocks we like better than Vera Bradley     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Vera   Bradley wasn't one of them! That's right -- they think   these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " Vera Bradley Inc    (NASDAQ: VRA)        Q2 2020 Earnings Call       Sep 4, 2019 ,   9:30 a.m. ET ",
    " Operator ",
    "Good day, and welcome to the Vera Bradley Second Quarter   Fiscal 2020 Earnings Conference Call. [Operator Instructions]",
    "At this time, I would like to turn the conference over to Mr.   Mark Dely, Chief Administrative Officer. Please go ahead,   sir.",
    " Mark Dely    --   Chief Administrative Officer ",
    "Good morning, and welcome, everyone. We'd like to thank you   for joining us for Vera Bradley's second quarter call. Some of   the statements made on today's call during our prepared remarks   and in response to your questions may constitute forward-looking   statements made pursuant to and within the meaning of the safe   harbor provisions of the Private Securities Litigation Reform Act   of 1995 as amended.",
    "Such forward-looking statements are subject to both known and   unknown risks and uncertainties that could cause actual results   to differ materially from those that we expect. Please refer to   today's press release and the company's most recent Form 10-K,   filed with the SEC for a discussion of known risks and   uncertainties. Investors should not assume that the statements   made during the call will remain operative at a later time. We   undertake no obligation to update any information discussed on   the call.",
    "I'll now turn it over to Vera Bradley's CEO, Rob Wallstrom.   Rob?",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "Thank you, Mark. Good morning, everyone, and thank you for   joining us on today's call. John Enwright, our CFO also joins me   today. Vera Bradley's comparable sales, full price selling and   customer count were all up again in the quarter. However, the   overall retail environment and the handbag market in particular   remain challenging. We have been most affected in the indirect   channel as our partners continue to feel the pressure of this   difficult retail environment, and therefore, our total indirect   sales fell slightly below our expectations. Additionally, gross   margins continue to be pressured by increasing tariffs and higher   international and domestic shipping costs.",
    "As you might recall, the first stage of Vision 2020 was to   restore the brand and company health and we continue to build   upon the progress we have made so far. During the first half of   this year, we once again improved quality of sales in our   full-line stores and verabradley.com by increasing comparable   full price selling in these two channels by approximately 10%.   This is on top of a 20-plus percentage increase in the first-six   months of last year. This is year two of our three year journey,   and we are keenly focused on expanding our customer base and   increasing both sales and profitability.",
    "As a reminder, our key areas of focus for fiscal 2020 are   number one growth. Our goal for the Vera Bradley brand is to   return to positive sales growth this year, and we are off to a   solid start in the first half, with comparable sales up 3.3%, in   line with our expectations and despite a challenging North   American handbag market. This improvement is being driven by   compelling, innovative product supported by targeted marketing   and customer engagement. Customer count is also up   year-over-year.",
    "Number two, operational excellence. We are investing in   technology, strengthening business processes and addressing   Chinese tariffs. During the second quarter, we began a two-year   process of replatforming our enterprise resource planning and   other key information systems to become more streamlined, nimble   and efficient in our technology and business processes. By the   end of this fiscal year, our production exposure in China will   drop to less than 25% from approximately 54% last year. Beginning   in the fourth quarter of this year, we will begin to see the   gross margin benefit of moving production to the Generalized   System of Preferences GSP countries.",
    "Number three, ownership. We will continue to reinforce our   culture as an ownership-based model, where every associate can   drive value creation to their individual and team efforts. And   once again, we receive best-in-class engagement scores during our   annual associates survey and we continue to have industry leading   customer service scores. Both underscore how our culture is a   prime asset and one that is key to our long-term growth plans. We   also continue to strengthen Vera Bradley's position as a unique   lifestyle brand with our second quarter acquisition of a majority   interest in Pura Vida Bracelets.",
    "Pura Vida is based in La Jolla, California and is rapidly   growing, digitally native, and highly engaging lifestyle brand   that deeply resonates with its loyal consumer following. The Pura   Vida brand has a differentiated and expanding offering of   bracelets, jewelry, and other lifestyle accessories. Vera Bradley   and Pura Vida are highly complementary businesses and have many   similarities, including devoted, emotionally connected, and   multi-generational customer base; alignment as casual,   comfortable, affordable, and fun lifestyle brands; positioning as   gifting and socially connected brands and strong entrepreneurial   cultures. We will share resources and knowledge to grow our   brands together. Pura Vida is a great strategic fit for us due to   their strong expertise in branding and social marketing   strategies, as well as robust competencies in e-commerce and   subscription-model selling. And, Pura Vida has already started to   utilize Vera Bradley's infrastructure and back office support   capabilities to nurture its growth.",
    "Now I will turn the call over to John to review the financial   results and outlook. John?",
    " John Enwright    --   Executive Vice President and Chief Financial Officer ",
    "Thanks, Rob and good morning. Let me go over a few highlights   for the quarter. The financial performance for the current year   second quarter and six months, I will discuss, our non-GAAP and   exclude Pura Vida acquisition related expenses, including   transaction costs, inventory step-up amortization, and intangible   asset amortization, as well as expenses related to the   replatforming of information technology systems outlined in   today's release. The performance includes results for Pura Vida   for the stub period, which is July 17 through the end of the   quarter.",
    "Second quarter consolidated net revenues totaled $119.8   million for the current year second quarter, which included $5.4   million of net revenues from Pura Vida. Excluding Pura Vida, Vera   Bradley net revenues totaled $114.4 million, a 0.7% increase over   the $113.6 million in the prior year second quarter. Excluding   charges consolidated second quarter net income attributable to   Vera Bradley Incorporated totaled $8.7 million or $0.25 per   diluted share, which included approximately $0.01 of accretion   attributable to Pura Vida. For the prior year second quarter, we   posted net income of $9.3 million or $0.26 per diluted share.",
    "Current year second quarter Vera Bradley Direct segment   revenues totaled $94.4 million, a 3.7% increase over $91 million   in the prior year second quarter. Comparable sales increased 2.1%   for the quarter. As expected, comparable sales were negatively   impacted by the year-over-year reduction of approximately $3   million of clearance sales from the quarter, primarily affecting   e-commerce sales. Indirect segment revenues decreased 11.4% to   $20 million from $22.6 million in the prior year, reflecting a   reduction in orders and in the number of specialty and department   store accounts as well as inbound shipping delays.",
    "Excluding the inventory step-up amortization, gross profit   totaled $68.4 million or 57.1% of net revenues, compared to $65.7   million, or 57.9% in the prior year second quarter. Pura Vida   increase the current year second quarter non-GAAP gross margin by   20 basis points. As expected, improvement in full-price selling   and sourcing and operational efficiencies were more than offset   by the impact of Chinese tariffs and increased shipping   costs.",
    "Excluding the Pura Vida transaction costs, intangible asset   amortization and information technology replatforming charges,   SG&A expense was $57.8 million or 48.2% of net revenues in   the current year second quarter, compared to $53.8 million or   47.3% in the prior year second quarter. Pura Vida contributed   $2.4 million of SG&A expenses. Excluding these additional   expenses Vera Bradley SG&A expenses were higher than the   prior year primarily due to related new factory store openings   and variable expenses to drive revenues, but were within the   guidance range of $55 million to $56 million.",
    "For the six months consolidated net revenues totaled $210.8   million, which included $5.4 million of net revenues from Pura   Vida, compared to $200.2 million last year. Excluding charges the   company's consolidated net income attributable to Vera Bradley   Incorporated for the six months total $6.9 million, or $0.20 per   diluted share, which included approximately $0.01 of accretion   attributable to Pura Vida. For the prior year six months, the   company posted net income of $7.9 million or $0.22 per diluted   share.",
    "Direct segment revenues for the six months totaled $165.5   million, a 5.7% increase over the $156.6 million in the prior   year. Comparable sales increased 3.3% for the period. Full-price   selling in the full-line stores and on verabradley.com increased   approximately 10% for the six months. Indirect segment revenues   for the six months decreased 8.7% to $39.9 million from $43.7   million in the prior year, reflecting a reduction in orders from   both specialty accounts and certain key accounts, as well as   inbound shipping delays.",
    "Excluding the inventory step-up amortization, gross profit for   the six months totaled $118.8 million, or 56.4 % of net revenues,   compared to $114.4 million, or 57.1% of net revenues, in the   prior year. The inclusion of Pura Vida benefited the current year   non-GAAP gross margin percentage by approximately 10 basis   points. As expected, improvement in full-price selling and   sourcing and operational efficiencies were more than offset by   the impact of Chinese tariffs and increased shipping costs.   Excluding Pura Vida transaction costs, intangible asset   amortization and information technology replatforming charges,   SG&A expenses totaled $111.2 million, or 52.8% of net   revenues in the current year six months, compared to $104.5   million, or 52.2% of net revenues, in the prior year. Pura Vida   contributed $2.4 million of SG&A expenses.",
    "Now let me turn to the balance sheet. Net capital spending for   the second quarter and six months totaled $4.7 million, and $8.1   million respectively. During the second quarter, we repurchased   approximately $2.2 million of common stock, or 197,000 at an   average price of $11.34. At quarter end, we had approximately $42   million remaining under the $50 million share repurchase   authorization.",
    "Cash, cash equivalents, and investments as of August 3, 2019   totaled $70.5 million compared to $144.8 million at the end of   last year's second quarter. The reduction from the prior year is   related to the July 2019 acquisition of Pura Vida for   approximately $75 million in cash. We continue to have no debt   outstanding. Total quarter end inventory was $130.7 million,   which included $26.2 million of Pura Vida inventory. Excluding   Pura Vida our core brand inventory was $104.5 compared to $86.3   million at the end of the second quarter last year. The inventory   was at the high end of our guidance range about $95 million to   $105 million primarily due to the acceleration of quarter end   receipts in order to minimize the impact of tariffs.",
    "Now, let me take a couple of minutes to review our outlook for   the third quarter and full year. All forward-looking guidance   numbers that I will discuss are non-GAAP and include expected   Pura Vida performance. Prior numbers exclude Pura Vida. Full year   gross margin, SG&A and diluted EPS numbers exclude the   previously disclosed charges related to the acquisition of Pura   Vida and information technology systems replatforming charges, as   well as any additional purchase accounting adjustments related to   Pura Vida.",
    "For this third quarter, we expect net sales of $122 million to   $129 million, which includes estimated Pura Vida revenues of $23   million to $25 million. Prior year third quarter revenues totaled   $97.7 million. For the quarter, we expect Vera Bradley's Direct   segment net sales to increase in the low to mid-single digit   range, including low-single digit positive comparable sales. We   expect Vera Bradley indirect net sales will be flat to up in the   low-single digit range for the quarter. We expect our third   quarter gross margin will be between 57.5% and 57.9% compared to   last year's third quarter rate of 58.5%.",
    "Sourcing operational efficiencies are expected to be more than   offset by the impact of China tariffs. The inclusion of Pura Vida   should have a positive impact on the consolidated gross margin.   Third quarter SG&A expense is expected to range from $62.5   million to $64 million compared to last year's SG&A expense   of $51.9 million, reflecting incremental expenses associated with   new factory store locations and approximate $11 million of   estimated expenses related to Pura Vida operations. We expect   third quarter diluted EPS of $0.16 to $0.20, reflecting accretion   of approximately $0.05 from Pura Vida. Diluted EPS was $0.12 in   the prior year third quarter. We expect inventory to be in $120   million to $130 million range at the end of the third quarter,   compared to $96.3 million at the end of last year's third   quarter. Included in this estimate is approximate $20 million of   Pura Vida inventory.",
    "For full year, we expect net sales of $490 million to $505   million, which includes estimated Pura Vida revenues of $65   million to $70 million. Net revenues totaled $416.1 million last   year. The sales estimate reflects the removal of approximate $5   million of additional Vera Bradley clearance sales this year, $3   million in the second quarter and the balance in the fourth   quarter. Our full year revenue guidance assumes that Vera Bradley   Direct segment net sales will increase in the low to mid-single   digit range, compared with the prior year, including a low-single   digit increase in comparable sales. We expect that Vera Bradley   indirect net sales will be flat to down in the low-single digit   range for the full year. We expect our gross margin for fiscal   2020 will be between 57.4% to 57.6%, compared to 57.3% last   year.",
    "Sourcing and operational efficiencies are expected to be fully   offset by the impact of Chinese tariffs. The inclusion of Pura   Vida should have a positive impact on consolidated gross margin.   We expect SG&A expenses to total between $242 million to $246   million for the year, compared to $212 million last year.   Reflecting incremental expenses related to new factory store   locations, partially offset by full-line store closures.   Approximately $27 million to $28 million of the estimated   expenses relates to Pura Vida operations. We expect full year   diluted EPS will range from $0.86 to $0.93, which contains prior   Vera Bradley annual guidance of $0.67 to $0.74 plus accretion   from the Pura Vida acquisition. Diluted EPS last year totaled   $0.59.",
    "A note on tariffs. We estimate tariffs would negatively affect   gross margin by approximately 80 basis points for the year,   equating to about $0.08 per share. We expect capital expenditures   will total approximately $13 million compared to $8.1 million   last year, reflecting investments in new factory stores and   technology and logistic enhancements. We expect to generate $45   million to $55 million of operating cash flow in fiscal 2020,   which includes the benefit of Pura Vida.",
    "Rob?",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "Thanks, John. We are off to a solid start in returning to   positive sales growth this year, with our year-to-date 3.3%   comparable sales increase. We are engaging our current customers   and bringing new customers to Vera Bradley with our compelling   and innovative product, supported by our marketing efforts and   customer experience initiatives. On the product line, we continue   to build dominance in our key franchise areas like travel,   campus, beach and gifts, as well as our top 10 items. Our back to   school selling period is under way and the sales of the backpacks   and lunch bags are exceeding last year. Newness for the season   includes our clearly colorful collection, larger school backpacks   and smaller fashion backpacks and slings. We have a lot of   innovation and newness to showcase this fall.",
    "Last month we launched Performance Twill. The rise of the   athleisure movement has made customers' purchasing decisions   increasingly driven by performance. Performance Twill is a   lightweight, durable, water-repellent and our newest definition   of a beautiful solution. This is our first launch in a series of   innovative performance fabrics. Also in August, we enhanced our   Signature duffel franchise by adding more sizes and shoulder   straps, and our innovative lay flat duffel will debut in   November. We will offer two small capsule collections this fall.   Our fun and playful cats meow capsule collection will launch this   month.",
    "And pretty posies pink, our pink capsule for breast cancer   awareness month will debut in October. Our special limited time   capsule collection centered around seasonal periods or novelty   add excitement and a sense of urgency for our customers to shop.   We will continue to innovate and add sustainability elements to   our products. Our reactive collection made of recycled plastic   bottles is our sustainable update to lighten up and will be   introduced in 2020. Offering limited edition collections in   collaborations with unique partners increases our brand exposure   and provides momentum to our growth. We have entered into several   high profile product collaborations this year.",
    "The Vera Bradley Plus Venus collection launched in April   continues to perform above expectations at Target. The collection   features a popular Vera Bradley design on a selection of   Gillette, Venus's core and special editions shaving products. In   May, we debut a collaborative drink wear and accessories   collection was Starbucks Asia Pacific. This collection has been   very successful and is helping us broaden our international brand   awareness and expand our reach. In July, Vera Bradley Plus Crocs   debut our limited edition footwear collection, which combined   Vera Bradley signature bright florals and paisley designs with   Crocs, World renowned comfort. Most styles and sizes sold out   almost immediately. Interestingly about 30% of the customers that   purchase Crocs on our website were new to our brand.",
    "Two weeks ago, we debuted our co-branded Vera Bradley plus   Pura Vida backpack. We partnered together to build the perfect   back-to-school backpack using Vera Bradley's best selling iconic   Campus Backpack silhouette and a print inspired by the   distinctive West Coast vibes of the Pura Vida lifestyle. The   backpack forgoes Vera Bradley's traditional quilted cotton and   instead features a unique cotton-linen slub yarn fabrication. We   think that Vera Bradley Plus Pura Vida iconic Campus Backpack   collaboration is the perfect way to celebrate our new   partnership. With each purchase of this backpack, customers   receive a complimentary Pura Vida original bracelet. Building off   the success of the last two extremely popular Disney   collaborations. This fall, we will once again partner with DISNEY   Theme Park merchandise to create another limited edition novelty   pattern and collection. Disney and Vera Bradley are a perfect   fit. We are both committed to creating memorable and fun customer   experiences, and we know that many of our Vera Bradley fans are   also huge Disney enthusiasts.",
    "Today, we announced another exciting collaboration, Harry   Potter. Vera Bradley's design team will collaborate with Warner   Bros. Consumer Products to create a Vera Bradley plus Harry   Potter back-to-campus and dorm line featuring bags, accessories,   stationery, drinkwear, tech products, bath and bedding, which   will launch in June 2020. A Vera Bradley Plus Harry Potter cozy   capsule featuring a fleece robe, slippers and a sheared throw   blanket will launch in November 2020, just in time for holiday   gifting. We are thrilled to partner with Warner Bros. Consumer   Products to create a magical fun collection that will appeal to   all generations.",
    "Additionally, we appreciate and support the messages of   diversity, acceptance, hope and equality that are woven   throughout the Harry Potter and Wizarding World works, as these   closely aligned with Vera Bradley's values. We know that many of   our Vera Bradley fans are also Wizarding World devotees who will   love these amazing products. Our ability to attract such amazing   partners like Gillette Venus, Starbucks, Crocs, Disney and Warner   Bros. Consumer Products is truly a testament to the strength and   wide appeal of our brand. All of these collaborations are also an   extension of our goal to offer beautiful solutions to our   customers. We are working with other iconic, internationally   known brands and other exciting future product   collaborations.",
    "Let's now turn to marketing. Our digital and marketing teams   are focused on accelerating our digital and customer growth. We   have completed the insourcing of our customer data science team,   added to our business analytics team and completed the rollout of   our new customer data platform. We are actively using the   insights we gain from our robust customer data to adjust our   marketing mix on a real-time basis. We are excited by the results   we are seeing from these investments in customer data and digital   media. In digital media, new customer visits have improved   year-over-year as has revenue directly derived from these   initiatives.",
    "Looking at the overall impact of these investments across our   channels, we saw a double-digit increase year-over-year and new   customers for the brand. We will continue to mine our customer   data and optimize our marketing spend for the back half of the   year. Brand collaborations and influencer engagement continue to   be important for the brand, and we saw a significant results in   the quarter. Our collaborations with Gillette, Starbucks and   Crocs all show a heightened strength and relevance of our brand   and generated enormous media buzz. Media impressions increased   more than 300% over last year's second quarter.",
    "As we reinforce our position as a total stakeholder focused   and socially conscious organization, marketing and social media   engagement plans are critical in this endeavor. We continue to   strengthen our community support and charitable initiatives under   the umbrella of the VB cares. We are identifying areas where we   can make a meaningful impact, particularly on the lives of women   and children. We are taking a stance for change and often invite   our customers to participate with clear calls to action. This   summer, we donated thousands of Vera Bradley beach towels to the   Fresh Air Fund, a not for profit agency that supports summer camp   experiences for children from the New York City's low income   communities. We are continuing our partnership with Blessings in   a Backpack for a second consecutive year.",
    "Blessings in a Backpack mobilizes communities, individuals and   resources to provide food for millions of elementary school   children across America, who might otherwise go hungry. Through   Blessings in a Backpack, we are donating 50,000 backpacks to   children in need throughout the US. We are also in the midst of   hosting several backpack packing events, school carnivals and   annual back-to-school distribution events in select markets   including New York, Los Angeles, Chicago, Nashville, Charlotte   and Panama City, Florida. Each event will culminate in backpack   giveaways, and some events will feature celebrity appearances,   including Misty Copeland, Principal Dancer. The American Ballet   Theatre, Dale Earnhardt, Jr., racing legend, and NBC Sports   motorsports analyst, Lauren Alaina, country music singer and   songwriter and many more.",
    "In August, we also launched an awareness in fundraising   campaign benefiting Blessings in a Backpack in our stores and on   verabradley.com. And with a minimum $10 donation to Blessings in   a Backpack, customers received a free Vera Bradley mini backpack   keychain to show their support for the organization. Through this   effort, our customers helped us raise over $70,000 for the   organization in the month of August. Activities supporting the   Vera Bradley Foundation for Breast Cancer go on all year, but   October is especially significant since it is Breast Cancer   Awareness Month. We will be offering special merchandise and   in-store events with the support of our customers, we expect to   raise over $2 million this year, and since the inception of the   foundation, we have raised over $32 million to fund advanced   breast cancer research at Indiana University's Comprehensive   Cancer Center.",
    "Moving on to distribution. Our goal is to grow sales in each   of our channels in fiscal 2020. In our full-line stores, we are   focusing on our highest potential stores enhancing the customer   experience, further localizing our assortments and adding more   compelling display windows. We are also testing alternative   vehicles to sell our full-line products, including pop-up shops   and airport vending machines, which will launch this fall. We   continue to rationalize and strengthen our full-line store base.   We closed five underperforming full-line stores in the first-six   months of the year and expect to close about five more this year.   This will bring our total store closings to 25 since the   beginning of fiscal 2018 and we could potentially close up to an   additional 15 following this fiscal year. At the end of the   quarter, we had 94 full-line stores.",
    "This year, we are working to maximize factory performance by   refining our pricing model and adding six new locations, five of   which have already opened. In addition, we are relocating and   expanding three of our best performing factory stores. The move   and expansion of Sevierville, Tennessee was complete in July. The   Larger Destin, Florida store opened in August and the Branson,   Missouri location -- relocation to a larger space will be   complete in October. At the end of the quarter, we had 62 factory   stores. We continue to focus on creating an engaging customer   experience in both our full-line and factory stores on   verabradley.com and our fulfillment operations and in our   customer service department. Our robust voice of customer   initiative and our new customer service model rolled out into our   full-line stores and once again drove industry leading customer   satisfaction scores in the quarter.",
    "In the specialty channel, we are focused on our top accounts   and reengaging lapsed customers. We are paring back our   distribution and department store arena to focus on the most   productive locations. Vera Bradley is currently represented in   about 450 department stores. Our brand is resilient, our team is   experienced and creative, and our future is exciting. Over the   last year, we have made significant progress in restoring our   company to health and have begun to return to growth. We are   looking forward to completing our Vision 20/20 journey and   beginning to focus on the years beyond. And we are very excited   about the Pura Vida acquisition and the potential growth of that   brand.",
    "Operator, we will now open the call to questions.",
    " Operator ",
    "Thank you. [Operator Instructions] And our first question,   we'll hear from Mark Altschwager with Baird.",
    " Mark Altschwager    --   Robert W. Baird -- Analyst ",
    "Great. Good morning. Thanks for taking my question. Rob, these   collaborations have been really interesting. I'm curious, if you   could talk a little bit more about what you've been learning so   far. Specifically, is there anything particularly surprising with   respect to the profile of the customer that you're attracting to   the brand? And does she look like you're the core customer or do   you think you're expanding the tent a bit?",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "Good morning, Mark. Thanks for the question. No, we are   absolutely very excited by these collaborations. I think one   thing that has been probably extra exciting is the fact that all   of these collaborations, the results that we've seen across the   various channel, whether it's Starbucks, whether it's through   Gillette, Venus and Target, whether it's through Crocs, the   consumer response has just been kind of overwhelming both in   those channels as well as in our own channel. So we're -- it   really, I think, just points to the vibrancy of the brand and how   strong the brand is. We are also seeing as we look at the   customer file, we are attracting a new customer to the brand. And   you're really seeing it show up in our brand awareness, right?   Our brand awareness -- our aided brand awareness scores keep   going up year-after-year. And so we're really excited about what   this means for the brand as we go forward.",
    " Mark Altschwager    --   Robert W. Baird -- Analyst ",
    "Thank you. And then, a lot of these product and marketing   initiatives have really been focused on the full-price business   and you're clearly seeing some nice success there. Curious how   the strategies are touching the factory business and what's   giving you the confidence in the sustainability and growth in the   factory channel?",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "Yeah, Mark. We definitely are focusing the collaborations on   our full-price business, part of our strategy and Vision 20/20   was really to get strong growth for our full-price channel and   kind of move from the strong clearance focus. So our   collaborations are definitely focused on full price. But I do   believe that as brand awareness goes up, the brand becomes   stronger that, that also plays to demand in factory channel as   customers are out shopping the factory channel. And we've been   very pleased with how our factory stores have been performing in   the first half of the year. We've taken a very focused approach   in that channel, 95% of the product is made exclusively for it.   Very focused on key items, key fabrications and really making   sure that we're managing the promotional environment very tightly   and that strategy is paying off for us right now in factory. And   you're seeing us, as we're continuing to expand our top stores   that we believe we still have more growth opportunity in   factory.",
    " Mark Altschwager    --   Robert W. Baird -- Analyst ",
    "Great. Thanks. And then switching gears for a moment to Pura   Vida. It looks like the new outlook incorporates about $60   million to $65 million in revenue for the back half. I mean,   that's about equal to the full year revenue in calendar '18 you   discussed back in June. So I'm wondering, as we update our   models, is there any further detail you can provide and how   you're thinking about the annualized contribution from Pura Vida   and the growth trajectory you're anticipating over the next   couple of years?",
    " John Enwright    --   Executive Vice President and Chief Financial Officer ",
    "Hey, Mark. This is John. So yeah, the back half a year we   anticipated it actually to be about $65 million to $70 million,   which would basically be 100% of what happened in prior year. The   way we're thinking about it, and ultimately, we're not giving   guidance for next year. But we do anticipate significant growth   year-over-year this year and we'd expect nice growth over the   coming next two to three years associated with the brand. So on   average, you can think about the brand growing close to 50% this   year and we do expect to be a little bit less than I mean, kind   of the out years.",
    " Mark Altschwager    --   Robert W. Baird -- Analyst ",
    "Thanks for all the detail and best of luck.",
    " John Enwright    --   Executive Vice President and Chief Financial Officer ",
    "Thanks.",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "Thanks, Mark.",
    " Operator ",
    "Next, we'll move to Oliver Chen with Cowen and Company.",
    " Oliver Chen    --   Cowen and Company -- Analyst ",
    "Hi. Thank you. Regarding the indirect channel, what are you   seeing in this channel and what are your thoughts about the   distribution footprint and what you expect going forward as it   can be a challenging channel that forecast and the inventory   management is a little bit different? Thank you.",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "Thanks, Oliver. When you look at our indirect channel, there's   obviously a lot of different pieces. So the biggest chunk of that   is our indirect specialty channel. So let me talk about that   first. First of all, what they're feeling is a little bit of the   same pressure I think that we're seeing in department stores,   just the general retail environment has been challenging for   them. But we're actually encouraged by what we're seeing and what   we're hearing from them, that they're giving us very positive   feedback in terms of the Vera Bradley performance in their   channel, that they're seeing much improvement in terms of   full-price sell through, profitability.",
    "So there's definitely a lot of positivity particularly with   our best accounts. And we're just working through the challenges   that, that channels facing. But overall, we're feeling that,   that's an important part of not only our past but our future, so   our partnership with the specialty channel, we think continues to   be important, but there obviously is a lot of change that goes on   there with all the smaller stores, new ones coming in every year,   some going out and so it just takes a lot of focus from our team   to make sure that we focus in on that channel. So that's one.",
    "The second piece of it is the department store world. The   department store world, I think as we've all seen it's been under   pressure. I think handbags in particular has been under pressure   and the department store world quite often seems to follow a   trend. So we're looking at that and making sure that we're just   very focused in there. Our strategy behind department store   selling was always about new customer pickup and new customer   acquisition. And so as we're looking at that, we think we are   going to continue to fine-tune the store counts. In other word   might be tightening up that store count to make sure that we're   focusing on the most appropriate stores and the stores that can   really bring an additional new customer to the brand. So that   would be the second piece.",
    "And then the third piece, I think becomes the rest of the   channel. Our Amazon business is performing very well. We're   excited about what's happening in the e-commerce side of the   wholesale world so we're going to continue to expand in that   area. And then lastly, the smaller piece of our business, but in   liquidation that there is definitely a lot of liquidation handbag   product we have in the market today. And so there's definitely   some pressure on that side of the business in terms of   availability of liquidation, but for us, that's OK, because we've   been pulling down our clearance, we've been focusing less on it,   but there is some pressure on that side of the business also.",
    " Oliver Chen    --   Cowen and Company -- Analyst ",
    "Yeah. As we think about what's happening in the industry, I   would love your thoughts on traffic and traffic trends and   volatility across a full-price versus outlet, as well as the   thoughts on liquidation, it's been very promotional in the   marketplace. What are your expectations for how your merchandise   margins may trend?",
    " John Enwright    --   Executive Vice President and Chief Financial Officer ",
    "From a traffic perspective, we're seeing from a full-price   perspective, we're seeing a little bit softer than kind of our   factory business, but ultimately we anticipated that when we put   together our forecasts in our plan. So traffic has been down   roughly about 4% year-over-year. If we think about kind of our   merchandise margins as we move forward, I don't anticipate   significant changes from the first half of the year, in regards   to how promotional we're going to be in the back half of the   year, so I would think as we've built into our forward-looking   guidance for the third quarter and then for the year, we've taken   consideration to how we look at our promotional activity as well   as some of the input costs in any shipping costs associated with   that. So I think we've kind of we feel more comfortable   ultimately with our margin coming through the second quarter and   the impact, as Rob mentioned in the call is -- remarks in -- for   GSP, the benefit we'll see kind of in the back half of the year   most significantly in the fourth quarter for the GSP margin.",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "I think the only thing I would add to it, John, as we talk   about our marketing team and our data science team and becoming   more and more analytical, one of the areas that we're definitely   placing a lot of that analytical focus is in the promotional   effectiveness. How do we really fine-tune the promotional   activity? How do we take the targeted approach, whether it's by   category or customer geography store? So we're becoming much more   micro focused in our promotional activity which we think will   help us move through this period of promotional activity.",
    " Oliver Chen    --   Cowen and Company -- Analyst ",
    "On Pura Vida, there is a huge opportunity to really leverage   their digital expertise as well as your young customer base. What   should we monitor in terms of how you'll embrace that across your   organization at large?",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "Yeah. No, Oliver, you're definitely pointing to one of the   areas where we think that there is real synergy. So our teams are   working together to really learn from what Pura Vida has done.   I'm really focusing on how do we improve the effectiveness,   particularly with our younger customer and so a lot of what Pura   Vida has done is really done a great job of engaging that youth   customer which has always been such an important part of our   brand. So if you think about what is the focus? I would say,   there is really three key areas. One is on social media. They've   done a great job this year of basically doubling their Instagram   following and we think that there's a lot to learn from them on   the social media side.",
    "The second is moving our marketing into much more of a   user-generated content/influencer generated content experience.   So you're going to see more authenticity coming through our media   over the next 12 months. And then, I think lastly and also   importantly is, just looking at website and the different   capabilities, with different tools they're using that they're   being more forward and being on the Shopify platform, that   they're taken advantage of a lot more of the innovation that's   happening in the e-commerce world. And we're expecting to   leverage a lot of those learnings, particularly as we move   through our technology program and join them on the Shopify plus   platform.",
    " Oliver Chen    --   Cowen and Company -- Analyst ",
    "Thank you. And lastly, regarding products, you made some great   updates to some of your classic silhouettes. How is the customer   response then? And what are your thoughts on balancing changes to   your core versus layering in newness and managing risk as well as   innovation?",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "Great question, Oliver. So a couple things. I think, one, we   are continuing to see strength in our core and our really our   hero products in terms of things like our campus backpacks and   duffels and things that were traditionally known for. In one way   that we're driving innovation through just those core items is   using fabrication, so that we can keep those products even   feeling fresh. But you're right that there definitely is this   balance between bringing newness to the market as well as keeping   our heritage going. And as we look at newness, we are trying new   silhouettes, a great example of a big success was we brought in   our sling backpack during the second quarter, which we had --   never had a sling in our line. It far exceeded our expectations   and that really reinforced our belief that our customers becoming   more and more, what I call, silhouette focused and functional   focused as opposed to just pattern focus. So I think that becomes   really critical.",
    "The other thing that you're seeing us do is, as we talked   about November with our duffel franchise, bringing in the lay   flat technology, it's a great way of really updating something   that is so iconic for us. But I will tell you that this new lay   flat design is great. I think our customers are absolutely going   to be -- that I personally am a big fan and using it all the   time. And the other one that we talked about is Performance   Twill. And what's interesting with our Performance Twill launch,   we put it out of market in August and then with the launch this   week, we're focusing even more on the website, not only is it a   great new fabrication, but we are really trying to balance both   heritage items, which you're going to see, as well as new design.   So, for example, in our Performance Twill, not only was our   campus backpack, one of our best sellers, but the other thing was   we designed to do work tote that we really listened and built   some innovation in that the customer was asking for and that's   been another surprise winner. So our customer wants us to balance   both heritage and innovation.",
    " Oliver Chen    --   Cowen and Company -- Analyst ",
    "Thank you. Best regards.",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "Thanks, Oliver.",
    " Operator ",
    "[Operator Instructions] Next, we will move to Steve Marotta   with CL King & Associates.",
    " Steve Marotta    --   CL King & Associates -- Analyst ",
    "Good morning, Rob and John, as far as Pura Vida, Can you talk   a little bit about...",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "Steve, we can't really hear you. Can you speak up more?",
    " Steve Marotta    --   CL King & Associates -- Analyst ",
    "Is it a little bit better?",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "That's little bit better.",
    " Steve Marotta    --   CL King & Associates -- Analyst ",
    "Maybe, this is better?",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "Much better, yes.",
    " Steve Marotta    --   CL King & Associates -- Analyst ",
    "All right. Can you talk a little bit about Pura Vida's   accretion from an earnings standpoint in any sort of seasonality   that's associated with that acquisition? In other words, it is   adding $0.20 this year. Is there a first half loss that might be   incorporated as we think about our next year numbers?",
    " John Enwright    --   Executive Vice President and Chief Financial Officer ",
    "Steve, this is John. So did you say is there a first year with   loss that we should think about? I just want to make sure I heard   the question.",
    " Steve Marotta    --   CL King & Associates -- Analyst ",
    "First half.",
    " John Enwright    --   Executive Vice President and Chief Financial Officer ",
    "So the answer to that question is no. Ultimately, they have   some seasonality in their business. It's fairly similar to our   seasonality where they do have a nice summer business close to   kind of our back-to-school business, as well as a holiday season   business. So as you pointed out, we expect accretion close to   about $0.20 in the back half of this year, and as you kind of   model it out for next year and we'll obviously more guidance in a   few months in regards to what we expect for next year. But I   wouldn't anticipate any kind of reduction in the first half the   year from EPS obviously, which is going to be -- we anticipate   accretion in the first half.",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "Yeah. I think one way to think about it is that the   profitability and the way their business model works, since it's   a low overhead business and a lot of its marketing and sales,   that the flow-through relative to the sales is not super   differences in over seasons.",
    " John Enwright    --   Executive Vice President and Chief Financial Officer ",
    "Yeah.",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "I think you're going to see a little bit smoother earnings   flow than maybe you see in some retail businesses because there's   not a big fixed cost base that you're leveraging now in fourth   quarter. So we'll obviously give more guidance next year, but   it's definitely a very healthy business and very accretive.",
    " Steve Marotta    --   CL King & Associates -- Analyst ",
    "Okay. That's helpful. And just reiterating your China   exposure. You mentioned it was 54% last year, 25% that you spoke   about, that's a run rate at the end of the year, correct, that's   not the blended rate for the entire year?",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "No, that's actually the blended rate of the total purchases   that we had made out of China this year when we're roughly about   25% or a little bit less than that and we anticipate that we're   going to move that down a little bit next year.",
    " Steve Marotta    --   CL King & Associates -- Analyst ",
    "Okay. All right. That's very good. And were there any   incremental tariffs associated with this September 1, upping to   that 5% to 25% to 30%?",
    " John Enwright    --   Executive Vice President and Chief Financial Officer ",
    "Yeah. There is incremental tariffs associated with kind of the   September 1, for List 4. So we had product that was being   excluded from tariffs when it was List 3. So now all the products   that we purchase out of China will have tariffs as of December   15, once they implement the incremental tariffs associated with   the broken up List 4 between September 1 and December 15. So by   the end of the year, if there are no changes, we will have   incremental tariffs for 100% of our purchases out of China.",
    " Steve Marotta    --   CL King & Associates -- Analyst ",
    "Okay. That's helpful. Thank you very much.",
    " Operator ",
    "And at this time, that will conclude the question-and-answer   session, I would like to turn the call back over to Rob Wallstrom   for any additional or closing remarks.",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    "Thank you very much for joining us on today's call. We are   very pleased with the progress we have made since we launched   Vision 20/20. Although the current North American handbag market   is challenging, we are steadfastly focused on the future and on   delivering growth in revenue, profit and shareholder value. Don't   forget to sign up for our Investor and Analysts Day in our SoHo   store on Thursday, October 3. Griffin Thall and Paul Goodman,   Pura Vida's Founders will be there along with members of the Vera   Bradley management team, including Beatrice Mac Cabe, our Chief   Creative Officer and Daren Hull, our Chief Customer Officer. So   if you are interested contact Julia Bentley, our Vice President   of Investor Relations at jbentley@verabradley.com. Thank you for   your time.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 46 minutes ",
    " Mark Dely    --   Chief Administrative Officer ",
    " Robert Wallstrom    --   President, Chief Executive Officer and Director ",
    " John Enwright    --   Executive Vice President and Chief Financial Officer ",
    " Mark Altschwager    --   Robert W. Baird -- Analyst ",
    " Oliver Chen    --   Cowen and Company -- Analyst ",
    " Steve Marotta    --   CL King & Associates -- Analyst ",
    " More VRA analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than Vera Bradley     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Vera   Bradley wasn't one of them! That's right -- they think   these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 03:23:16"
}