{
  "url": "https://www.nasdaq.com/article/top-ranked-income-stocks-to-buy-for-september-4th-cm1207446",
  "title": "Top Ranked Income Stocks to Buy for September 4th - Nasdaq.com",
  "text": [
    "Here are four stocks with buy rank and strong income characteristics for investors to consider today, September 4th:",
    "Fortress Transportation and Infrastructure Investors LLC (FTAI) : This owner and acquirer of high quality transportation equipment and infrastructure has witnessed the Zacks Consensus Estimate for its current year earnings increasing 41% over the last 60 days.",
    "Fortress Transportation and Infrastructure Investors LLC price-consensus-chart | Fortress Transportation and Infrastructure Investors LLC Quote",
    "This Zacks Rank #1 (Strong Buy) company has a dividend yield of 8.9%, compared with the industry average of 0%. Its five-year avera ge dividend yield is 8.2%.",
    "Fortress Transportation and Infrastructure Investors LLC dividend-yield-ttm | Fortress Transportation and Infrastructure Investors LLC Quote",
    "CrossAmerica Partners LP (CAPL): This distributor of motor fuels has witnessed the Zacks Consensus Estimate for its current year earnings increasing 4.4% over the last 60 days.",
    "CrossAmerica Partners LP price-consensus-chart | CrossAmerica Partners LP Quote",
    "This Zacks Rank #2 (Buy) company has a dividend yield of 12.1%, compared with the industry average of 11.1%. Its five-year average dividend yield is 9.8%.",
    "CrossAmerica Partners LP dividend-yield-ttm | CrossAmerica Partners LP Quote",
    "Delek Logistics Partners, LP (DKL): This logistics and marketing assets operator for crude oil, intermediate and refined products has witnessed the Zacks Consensus Estimate for its current year earnings increasing 1.5% over the last 60 days.",
    "Delek Logistics Partners, L.P. price-consensus-chart | Delek Logistics Partners, L.P. Quote",
    "This Zacks Rank #2 company has a dividend yield of 11.4%, compared with the industry average of 8.1%. Its five-year average dividend yield is 8.1%.",
    "Delek Logistics Partners, L.P. dividend-yield-ttm | Delek Logistics Partners, L.P. Quote",
    "Foresight Energy LP (FELP): This producer of thermal coal has witnessed the Zacks Consensus Estimate for its current year earnings increasing 22.2% over the last 60 days.",
    "Foresight Energy LP price-consensus-chart | Foresight Energy LP Quote",
    "This Zacks Rank #2 company has a dividend yield of 29.4%, compared with the industry average of 0%. Its five-year average dividend yield is 11.4%.",
    "Foresight Energy LP dividend-yield-ttm | Foresight Energy LP Quote",
    "See the full list of top ranked stocks here.",
    "Find more top income stocks with some of our great premium screens.",
    "Biggest Tech Breakthrough in a Generation",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "See 7 breakthrough stocks now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:43:00"
}