{
  "url": "https://www.nasdaq.com/article/google-revamps-movies-tv-show-search-on-mobile-cm1207686",
  "title": "Google Revamps Movies & TV Show Search on Mobile - Nasdaq.com",
  "text": [
    "   Google    is rolling out a new way to search for movies and TV shows on   mobile devices. Launching in the U.S. first, the new search gives   mobile phone users a full-screen experience with personalized   recommendations that can be fine-tuned with Tinder-style   swiping. \"When you search for things like \"good shows to watch\" or   \"what to watch\" on mobile, you can tap the start button in the   \"Top picks for you\" carousel to begin rating TV shows and   movies,\" explained   Google    Search product manager Matt Sheets in a blog post. Users can also tell Google about the streaming providers they   are subscribed to, and then get a personalized list of available   results based on their subscriptions. Services included in this   list range from Netflix to Amazon Prime to Vudu to Google's own   services.makeArticleAd(); The new search functionality also aims to help with more   specific queries that go beyond your typical genre list,   explained Sheets. \"Even when you're hankering for something   specific, like 'horror movies from the 80s' or 'adventure   documentaries about climbing,' Search will give you options,\" he   wrote.   More from Variety    Google's YouTube to Pay $170 Million to         Settle FTC Charge It Collected Kids' Data Illegally   Google Said to Face Antitrust Probe From         Numerous State Attorneys   YouTube Yanks 210 Channels for Spreading         Propaganda Against Hong Kong Protests     ",
    " Google    is rolling out a new way to search for movies and TV shows on   mobile devices. Launching in the U.S. first, the new search gives   mobile phone users a full-screen experience with personalized   recommendations that can be fine-tuned with Tinder-style   swiping.",
    "\"When you search for things like \"good shows to watch\" or   \"what to watch\" on mobile, you can tap the start button in the   \"Top picks for you\" carousel to begin rating TV shows and   movies,\" explained   Google    Search product manager Matt Sheets in a blog post.",
    "Users can also tell Google about the streaming providers they   are subscribed to, and then get a personalized list of available   results based on their subscriptions. Services included in this   list range from Netflix to Amazon Prime to Vudu to Google's own   services.",
    "The new search functionality also aims to help with more   specific queries that go beyond your typical genre list,   explained Sheets. \"Even when you're hankering for something   specific, like 'horror movies from the 80s' or 'adventure   documentaries about climbing,' Search will give you options,\" he   wrote.",
    "  More from Variety    Google's YouTube to Pay $170 Million to         Settle FTC Charge It Collected Kids' Data Illegally   Google Said to Face Antitrust Probe From         Numerous State Attorneys   YouTube Yanks 210 Channels for Spreading         Propaganda Against Hong Kong Protests   ",
    " More from Variety ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 06:00:04"
}