{
  "url": "https://www.nasdaq.com/article/samsung-to-launch-galaxy-fold-in-skorea-on-sept-6-priced-2000-20190905-00788",
  "title": "Samsung to launch Galaxy Fold in S.Korea on Sept. 6 priced $2,000 - Nasdaq.com",
  "text": [
    "By Ju-min Park and Douglas Busvine",
    "SEOUL/BERLIN, Sept 5 (Reuters) - Samsung Electronics Co Ltd  on Thursday said its first foldable smartphone, the Galaxy Fold, will be available in South Korea from Sept. 6 with fifth-generation (5G) mobile connectivity.",
    "The world's largest smartphone vendor said the device would be priced at 2.398 million won($1,977). It will go on sale in Britain, France and Germany in less than two weeks, with a U.S. release also planned.",
    "The remodeled version of the Galaxy Fold, which opens like a book to reveal a 7.3-inch infinity display, now has the screen's protective layer tucked under the bezel at its edge.",
    "There are protective caps at the end of the hinges and, when the device is closed, there is a smaller gap between the hinge and the body of the phone to keep out dust, Samsung's European sales chief Mark Notton said at the IFA tech fair in Berlin.",
    "Samsung has promised to usher in a new age of foldables as part of its effort to showcase innovation in a saturated smartphone market.",
    "The device's main screen can show up to three apps simultaneously, allowing a user to multitask. When it is closed the display is replicated on an external screen - a feature known as app continuity.",
    "5G OPTION",
    "Samsung is launching 5G versions of the Galaxy Fold in Britain and Germany, where operators are starting to roll out the super-fast networks in some cities. An LTE version will be offered in France.",
    "The company announced in July it would be ready to sell the Galaxy Fold in September after making changes including strengthening the hinges, which early reviewers had found to be problematic. ",
    "Samsung will provide a program for Fold users in which the company covers 70% of cost of a display screen repair once within a year, according to its statement.",
    "\"Consumers have responded positively to larger screens, and the Galaxy Fold's revolutionary form factor offers a bigger, more immersive screen without sacrificing portability,\" said DJ Koh, chief executive of IT & Mobile Communications Division at Samsung Electronics.",
    "Last month, Chinese rival Huawei Technologies Co Ltd  delayed the planned September launch of its Mate X foldable phone, its second postponement this year, as it battles a U.S. trade blacklist that threatens the tech giant's access to crucial U.S. technologies from Alphabet Inc'sGoogle that run on the Android operating system. ",
    "SK Telecom Co Ltd , South Korea's biggest mobile carrier by subscribers, also on Thursday said it expected Galaxy Fold sales to boost its number of 5G subscribers, offering discounts and insurance plans for the high-priced folding phone.",
    "($1 = 1,212.6600 won)"
  ],
  "published_datetime": "2019-09-05 11:35:00"
}