{
  "url": "https://www.nasdaq.com/article/5-top-stock-trades-for-thursday-t-uber-lyft-iwm-rh-cm1210809",
  "title": "5 Top Stock Trades for Thursday: T, UBER, LYFT, IWM, RH - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Equities continue to stretch higher as the week wears on, with U.S. stocks once again pushing higher. Let's look at a few top stock trades from Wednesday.",
    "Earlier this week, shares of AT&T (NYSE: T ) were poised for big gains thanks to news of activist investor Elliott Management acquiring an equity stake . However, the stock faded for most of Monday's session, although it still ended higher on the day. ",
    "On Wednesday, shares took out Monday's high and are moving nicely to the upside. ",
    "The rally on Monday broke T stock over channel resistance (blue line). So long as it maintains above $37 - which was weekly resistance and can be seen here - then it's okay on the long side. ",
    "Side note: Look at that awesome volume accumulation (blue circle)!",
    "Uber (NYSE: UBER ) and Lyft (NASDAQ: LYFT ) stock actually traded higher, despite recent California legislation that's expected to hurt the ride-hailing companies' bottom line . ",
    "Rallying on bad news is actually a good thing. For Uber, the stock has also broken over channel resistance. However, shares are being rejected by the 20-day moving average, and still face likely resistance at $36. ",
    "Here's what to watch for now. ",
    "Shares need to hold above former channel resistance and not make new lows. That will at least be constructive price action for the bulls. Additionally, let's see if Uber stock can reclaim the 20-day moving average. It tried on Wednesday but was rejected. If it does, $36 is on the table. ",
    "Lyft has a very similar setup to Uber - what a shocker. ",
    "For Lyft though, it's not quite as far out of the woods is Uber. Shares were also rejected by the 20-day moving average and while they're currently above channel resistance, it's not a lay-up that it stays that way. ",
    "Like Uber, Lyft stock needs to avoid making new lows. A close over $48 and the 20-day moving average could trigger a rally up to the 50-day moving average. ",
    "The iShares Russell 2000 ETF (NYSEARCA: IWM ) has been a beast this week, something InvestorPlace readers were tipped off to earlier this week in the Stock Market Today column .",
    "In any regard, the IWM is running into some potential resistance between $156.50 and $158. Over the latter and the bulls can look to squeeze the ETF up to the May highs near $160.50. ",
    "The IWM has lagged the S&P 500 , Dow Jones Industrial Average and the Nasdaq both year-to-date and over the past 12 months. If it can continue gaining momentum, perhaps it will look to close some of that gap. ",
    "On the downside, bulls need to see $150 hold as support. ",
    "The company delivered another beat-and-raise quarter and yet, Restoration Hardware (NYSE: RH ) actually opened lower on the day. Rising more than 6.5% by the close though, buyers really stepped up. ",
    "As shares technically become overbought, there is additional concern as it runs into possible channel resistance. It's possible that it breaks out over this area, but if not, the bull case is not over. ",
    "So long as RH holds over $158, it looks good on the long side. That marks the prior high from March. I would love to see trendline No. 2 buoy the name from here. Should it fail as support, $150 could be on the table. ",
    "Bret Kenwell is the manager and author of Future Blue Chips and is on Twitter @BretKenwell . As of this writing, Bret Kenwell is long T. ",
    "The post 5 Top Stock Trades for Thursday: T, UBER, LYFT, IWM, RH appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:33:09"
}