{
  "url": "https://www.nasdaq.com/article/white-house-urges-biofuel-industry-to-take-deal-boosting-blending-mandates-20190911-00850",
  "title": "White House urges biofuel industry to take deal boosting blending mandates - Nasdaq.com",
  "text": [
    "By Stephanie Kelly and Jarrett Renshaw",
    "NEW YORK, Sept 11 (Reuters) - White House officials on Wednesday urged U.S. biofuel producers and oil refiners to accept a deal to lift biofuel blending mandates in 2020, saying overlong negotiations could make it hard to enact the change in time for next year, sources familiar with the discussions said.",
    "The White House is trying to soothe farmers infuriated by the Trump administration's decision in August to exempt 31 oil refineries from their requirement to blend biofuels under the U.S. Renewable Fuel Standard, which the agriculture industry says is undermining the market for corn-based ethanol as farmers are losing export sales from the U.S. trade war with China.",
    "Members of the White House National Economic Council first delivered their message in a closed-door meeting on Wednesday morning with representatives from major biofuel companies like Louis Dreyfus and Renewable Energy Group, four sources said.",
    "During the meeting, the White House officials urged biofuel company representatives to accept a Trump administration proposal to boost biofuel blending quotas next year by 5%, even though it fell short of the industry's wishes, three of the sources told Reuters, asking not to be named.",
    "The officials told the biofuel representatives they hoped for their support for a deal by Friday, saying any delays could make it hard for the administration to follow required regulatory procedures to make a change to blending mandates before next year.",
    "Later in the afternoon, the officials met with representatives from oil refiners including Marathon Petroleum Corp .",
    "A spokesman for the White House declined comment.",
    "The administration had told biofuel producers it would be willing to lift the amount of biofuels that oil refiners must blend into the fuel pool by 1 billion gallons in 2020 above current proposed levels of about 20 billion to help the industry weather a downturn and to compensate for the waivers.",
    "While biofuel producers want an increase in blending mandates next year, they also want assurance that such an increase is not a once-off measure - something the White House has so far declined to provide.",
    "'REALLOCATION'",
    "Biofuel producers say the administration should force large oil refineries to make up for any exempted gallons through a process called \"reallocation,\" which would ensure the increases to biofuel blending mandates recur annually in proportion to the number of waivers.",
    "The oil industry opposes increased biofuel mandates because the fuels compete with their refined products.",
    "A fourth source said the meeting had a constructive tone and that White House officials mainly listened to industry complaints that the administration's proposal was insufficient.",
    "During the afternoon meeting with oil refiner representatives, the administration said it wanted the industry's reaction to the proposed 2020 hike within the next day, two sources familiar with the discussions said.",
    "\"We remain hopeful that President Trump will move swiftly to protect farmers and biofuel workers, but efforts to reverse the damage will be meaningless unless the agency acts now to stop the bleeding,\" the National Corn Growers Association, the American Soybean Association, Growth Energy, the Renewable Fuels Association, the National Biodiesel Board, and Fuels America said in a joint statement after Wednesday's meeting.",
    "The Environmental Protection Agency proposed in June that the volume of biofuels that refiners must blend in 2020 should be just over 20 billion gallons, including 15 billion gallons of ethanol. The rule, including any changes the administration wishes to make, must be finalized by the end of November to take effect in 2020.",
    "Under the RFS, small oil refineries of 75,000 barrels per day of capacity or less can apply for waivers from the EPA if compliance would cause them disproportionate financial hardship.",
    "The EPA has handed several times more waivers to refineries under Trump than former President Barack Obama, including to facilities owned by companies like Exxon Mobil Corp , Chevron Corp , and billionaire Carl Icahn, according to Reuters reporting."
  ],
  "published_datetime": "2019-09-11 03:16:00"
}