{
  "url": "https://www.nasdaq.com/article/better-than-expected-ppi-data-for-august-cm1210378",
  "title": "Better-Than-Expected PPI Data for August - Nasdaq.com",
  "text": [
    " This morning, new monthly  Producer Price Index (PPI)   numbers have hit the tape, signifying whether inflation is finally beginning to creep into the domestic economy. Short answer: no, or at least not really. A headline of +0.1% for August is roughly ahead of the breakeven analysts were expecting, and down from the unrevised +0.2% from July. Ex-food & energy costs - a means of stripping out volatile month-to-month costs - came in at +0.3%, in-line and with no revisions from the previous month. Trade overall month over month reached +0.4%, double the 0.2% expected. Those looking for weakness based on the U.S.-China trade war did not find it here last month. Year over year, Final Demand came in at +1.8%, a tick above expectations. Year over year, ex-food & energy was +2.3%, above the 2.1% in July. The core read on trade, year over year, wound up at +1.9%. While these are all slightly warmer than expectations, we're not exactly looking at rampant inflation making its way into the economy, even with historically low interest rates. Consider this another sign that next week's rate cut is still forthcoming. The overarching theme here is that we continue to see a deceleration of industrial production on a global scale. Whether this results in a worldwide economic recession depends very much on how the U.K.'s Brexit (mis)adventure resolves, along with the nimbleness of the ECB as it changes leadership, and of course the ongoing trade war between the world's two largest economies. Tomorrow we have the other shoe drop:  Consumer Price Index (CPI)  . So while today we see what producers had been able to charge for goods and services last month, next we see what retail purchasers had been spending. Currently, we expect these figures to be somewhat above the lukewarm PPI numbers from this morning. In recent months, we've seen the consumer's appetite for purchases pulling at least its own weight in strengthening the overall economy.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  To read this article on Zacks.com click here.   Zacks Investment Research ",
    "This morning, new monthly  Producer Price Index (PPI)   numbers have hit the tape, signifying whether inflation is finally beginning to creep into the domestic economy. Short answer: no, or at least not really. A headline of +0.1% for August is roughly ahead of the breakeven analysts were expecting, and down from the unrevised +0.2% from July.",
    "Ex-food & energy costs - a means of stripping out volatile month-to-month costs - came in at +0.3%, in-line and with no revisions from the previous month. Trade overall month over month reached +0.4%, double the 0.2% expected. Those looking for weakness based on the U.S.-China trade war did not find it here last month.",
    "Year over year, Final Demand came in at +1.8%, a tick above expectations. Year over year, ex-food & energy was +2.3%, above the 2.1% in July. The core read on trade, year over year, wound up at +1.9%. While these are all slightly warmer than expectations, we're not exactly looking at rampant inflation making its way into the economy, even with historically low interest rates. Consider this another sign that next week's rate cut is still forthcoming.",
    "The overarching theme here is that we continue to see a deceleration of industrial production on a global scale. Whether this results in a worldwide economic recession depends very much on how the U.K.'s Brexit (mis)adventure resolves, along with the nimbleness of the ECB as it changes leadership, and of course the ongoing trade war between the world's two largest economies.",
    "Tomorrow we have the other shoe drop:  Consumer Price Index (CPI)  . So while today we see what producers had been able to charge for goods and services last month, next we see what retail purchasers had been spending. Currently, we expect these figures to be somewhat above the lukewarm PPI numbers from this morning. In recent months, we've seen the consumer's appetite for purchases pulling at least its own weight in strengthening the overall economy.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:09:00"
}