{
  "url": "https://www.nasdaq.com/article/european-shares-pressured-by-brexit-concerns-asia-weighed-down-by-new-tariffs-cm1206875",
  "title": "European Shares Pressured by Brexit Concerns; Asia Weighed Down by New Tariffs - Nasdaq.com",
  "text": [
    "Stocks are trading lower in Europe as we approach the U.S. cash market opening. The European markets are primarily being pressured by Brexit concerns. According to reports, British opposition lawmakers are making a bid to seize control of the House of Commons and force a stop to the move that would allow the U.K. to leave the European Union with a deal on October, the so-called \"hard Brexit\".",
    "At 13:12 GMT, the U.K.'s FTSE 100 is trading 7258.08, down 23.86 or 0.33%. Germany's Dax is at 11916.36, down 37.42 or -0.31% and France's CAC is at 5465.26, down 27.78 or -0.51%.",
    "Although there are some concerns over an escalation of the trade dispute between the United States and China due to the imposition of fresh tariffs by both parties over the weekend, the primary focus for European stock traders is Brexit.",
    "Earlier in the session, rebel lawmakers applied for an emergency debate in parliament in the hope of thwarting a no-deal Brexit.",
    "According to British law, if the request for the debate is granted by the House Speaker John Bercow, opposition lawmakers could have a vote on Tuesday evening to wrestle control of parliamentary business away from the government. This move would be viewed as a \"de facto confidence vote on Prime Minister Boris Johnson and his Brexit strategy,\" according to CNBC. This could push the Brexit deadline from October 31 to January 31, 2020.",
    "The focus would then shift to Johnson, who would call for a snap general election on October 14 if a cross-party group of MPs (Members of Parliament), including some rebels from within Johnson's own ruling Conservative Party, succeed with a legislative bill to block a no-deal departure.",
    "Shares in the Asia Pacific region finished mixed on Tuesday with Japan and China the lone winners.",
    "Formal U.S.-China trade negotiations are set to resume this week after the two economic powerhouses implemented more tariffs on September 1. One analyst says he doesn't expect much progress to be made with this round of talks.",
    "Tapas Strickland, director of economics and markets at the National Australia Bank, wrote in a morning note, \"US-China still remain no closer to easing tensions with a date for negotiators to meet in September yet to be determined.\"",
    "\"With the 70 th anniversary of the founding of the People's Republic of China on October 1, we do not expect much progress on trade in the near-term as China's focus increasingly turns towards the anniversary celebrations and then the Party's Fourth Plenum scheduled also for October,\" Strickland.",
    "Early Tuesday, the Reserve Bank of Australia ( RBA ) kept its cash rate at 1% as expected. The RBA previously cut interest rates in June and July. Since then it has adopted a \"wait and see\" stance.",
    "\"It is reasonable to expect that an extended period of low interest rates will be required in Australia to make progress in reducing unemployment and achieve more assured progress toward the inflation target,\" Governor Philip Lowe said in a statement.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:38:32"
}