{
  "url": "https://www.nasdaq.com/article/westrock-to-reconfigure-north-charleston-mill-to-cut-costs-cm1210388",
  "title": "WestRock to Reconfigure North Charleston Mill to Cut Costs - Nasdaq.com",
  "text": [
    "  WestRock Company WRK  recently announced its plan to reconfigure the company's North Charleston, SC paper mill, in a bid to enhance the mill's operating efficiency and long-term competitiveness. This reconfiguration is likely to increase the company's annual EBITDA by around $40 million, mainly owing to operating-cost reduction from the shut-down of one of the three paper machines and related infrastructure.  makeArticleAd();  Notably, this move will reduce linerboard capacity by approximately 288,000 tons. This will help the company balance supply with customer demand.    Interestingly, WestRock's action to reduce operating costs and capital requirements of the North Charleston mill will significantly boost its long-term competitiveness, while also focusing on manufacturing more high-value differentiated DuraSorb and KraftPak products. Once the reconfiguration process concludes, the mill's production capacity will total roughly 605,000 tons a year.    Nevertheless, this reconfiguration initiative is expected to retrench nearly 260 jobs at the mill over a five-month period, starting January 2020. WestRock is working to provide support and resources to the to-be-affected employees and their families. WestRock was formed by the merger of MeadWestvaco and Rock-Tenn in July 2015, with the company realizing strategic benefits of the merger. Last November, WestRock completed the acquisition of rival KapStone Paper and Packaging Corp. The integration for the same is on track, and the company anticipates cost synergies and performance improvement of around $200 million by the end of fiscal 2021. The acquisition will help the company strengthen its presence in Western United States as well as boost competitiveness in the growing agricultural markets in the region. WestRock will also be able to broaden its portfolio of paper grades, enabling it to tap into the kraft bag market with the inclusion of KapStone's complementary specialty kraft-paper offerings.    The company intends to invest approximately $1.4 billion of capital in its business in fiscal 2019. The strategic projects in the fiscal include the installation of a state-of-the-art kraft linerboard machine at Florence, SC mill; an upgradation of the Tres Barras mill in the Brazilian state of Santa Catarina; completion of new world-class Porto Feliz corrugated box plant in the Sao Paolo, Brazil; installation of a curtain coater at Mahrt, AL mill; and installation of a headbox and upgrade of other areas of a paper machine at the Covington, VA mill.  WestRock Company Price and Consensus         WestRock Company price-consensus-chart    |   WestRock Company Quote    Zacks Rank & Key Picks    WestRock currently carries a Zacks Rank #3 (Hold).    Some better-ranked stocks in the basic materials space are Kinross Gold Corporation KGC  , Alamos Gold Inc. AGI  and Arconic Inc. ARNC  , all sporting a Zacks Rank #1 (Strong Buy), currently. You can see  the complete list of today's Zacks #1 Rank stocks   here.     Kinross has an expected earnings growth rate of a whopping 160% for 2019. The company's shares have surged 70.2% in the past year.    Alamos Gold has an outstanding projected earnings growth rate of 320% for the current year. The company's shares have rallied 43.4% in a year's time.    Arconic has an estimated earnings growth rate of 50% for the current year. Its shares have moved up 18.6% in the past year.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Kinross Gold Corporation (KGC): Free Stock Analysis Report   Alamos Gold Inc. (AGI): Free Stock Analysis Report   Arconic Inc. (ARNC): Free Stock Analysis Report   WestRock Company (WRK): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " WestRock Company WRK  recently announced its plan to reconfigure the company's North Charleston, SC paper mill, in a bid to enhance the mill's operating efficiency and long-term competitiveness. This reconfiguration is likely to increase the company's annual EBITDA by around $40 million, mainly owing to operating-cost reduction from the shut-down of one of the three paper machines and related infrastructure.  makeArticleAd();  Notably, this move will reduce linerboard capacity by approximately 288,000 tons. This will help the company balance supply with customer demand.    Interestingly, WestRock's action to reduce operating costs and capital requirements of the North Charleston mill will significantly boost its long-term competitiveness, while also focusing on manufacturing more high-value differentiated DuraSorb and KraftPak products. Once the reconfiguration process concludes, the mill's production capacity will total roughly 605,000 tons a year.    Nevertheless, this reconfiguration initiative is expected to retrench nearly 260 jobs at the mill over a five-month period, starting January 2020. WestRock is working to provide support and resources to the to-be-affected employees and their families.",
    "WestRock was formed by the merger of MeadWestvaco and Rock-Tenn in July 2015, with the company realizing strategic benefits of the merger. Last November, WestRock completed the acquisition of rival KapStone Paper and Packaging Corp. The integration for the same is on track, and the company anticipates cost synergies and performance improvement of around $200 million by the end of fiscal 2021. The acquisition will help the company strengthen its presence in Western United States as well as boost competitiveness in the growing agricultural markets in the region. WestRock will also be able to broaden its portfolio of paper grades, enabling it to tap into the kraft bag market with the inclusion of KapStone's complementary specialty kraft-paper offerings.    The company intends to invest approximately $1.4 billion of capital in its business in fiscal 2019. The strategic projects in the fiscal include the installation of a state-of-the-art kraft linerboard machine at Florence, SC mill; an upgradation of the Tres Barras mill in the Brazilian state of Santa Catarina; completion of new world-class Porto Feliz corrugated box plant in the Sao Paolo, Brazil; installation of a curtain coater at Mahrt, AL mill; and installation of a headbox and upgrade of other areas of a paper machine at the Covington, VA mill.",
    " WestRock Company Price and Consensus ",
    "       WestRock Company price-consensus-chart    |   WestRock Company Quote  ",
    " WestRock Company price-consensus-chart    |   WestRock Company Quote ",
    " Zacks Rank & Key Picks    WestRock currently carries a Zacks Rank #3 (Hold).    Some better-ranked stocks in the basic materials space are Kinross Gold Corporation KGC  , Alamos Gold Inc. AGI  and Arconic Inc. ARNC  , all sporting a Zacks Rank #1 (Strong Buy), currently. You can see  the complete list of today's Zacks #1 Rank stocks   here.     Kinross has an expected earnings growth rate of a whopping 160% for 2019. The company's shares have surged 70.2% in the past year.    Alamos Gold has an outstanding projected earnings growth rate of 320% for the current year. The company's shares have rallied 43.4% in a year's time.    Arconic has an estimated earnings growth rate of 50% for the current year. Its shares have moved up 18.6% in the past year.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:07:00"
}