{
  "url": "https://www.nasdaq.com/article/5-stocks-with-high-net-income-ratio-to-grab-now-cm1210855",
  "title": "5 Stocks with High Net Income Ratio to Grab Now - Nasdaq.com",
  "text": [
    "Investors always have a keen eye for companies having a high level of profitability regardless of the market condition. And profitability analysis is the best measure of a company's ability to offer sturdy returns to its investors.",
    "There are a variety of profitability ratios that can help investors find highly profitable stocks, but the most successful and frequently used one is net income ratio or net profit margin.",
    "Net Income Ratio",
    "Net income ratio gives us the exact profitability level of a company. It reflects the percentage of net income to total sales revenues. Using net income ratio, one can determine a company's efficiency in meeting operating and non-operating expenses from revenues. A higher net income ratio usually implies a company's ability to generate ample revenues and successfully manage all business functions.",
    "Screening Parameters",
    "Net income ratio is not the only indicator of future winners. So, we have added a few more criteria to arrive at a winning strategy.",
    "Zacks Rank Equal to #1:  No matter whether good market or bad, stocks with a Zacks Rank #1 (Strong Buy) have a proven history of outperformance. You can see  the complete list of today's Zacks #1 Rank stocks here .",
    "Trailing 12-Month Sales and Net Income Growth Higher than X Industry:  Stocks that have witnessed higher-than-industry sales and net income growth in the past 12 months are well positioned to perform well.",
    "Trailing 12-Month Net Income Ratio Higher than X Industry:  High net income ratio indicates a company's solid profitability.",
    "Percentage Rating 'Strong Buy' greater than 70:  This indicates that 70% of the current broker recommendations for the stock are 'Strong Buy.'",
    "These few parameters narrowed down the universe of over 7,099 stocks to only 10.",
    "Here are five of the 10 stocks that qualified the screen:",
    "ACM Research, Inc.ACMR  is a provider of single-wafer wet cleaning equipment used by manufacturers of advanced semiconductors. Its 12-month net profit margin is 13.2%.",
    "FibroGen, Inc.FGEN is the owner and operator of a biopharmaceutical company. Its 12-month net profit margin is 13.9%.",
    "Funko, Inc.FNKO is a pop culture consumer products company. Its 12-month net profit margin is 2%.",
    "Matrix Service CompanyMTRX is engaged in designing, building and maintenance of infrastructure related to North America's energy and industrial markets. Its 12-month net profit margin is 2%.",
    "PetIQ, Inc.PETQ is a pet medication and wellness company. Its 12-month net profit margin is 0.7%.",
    "You can get the rest of the stocks on this list by signing up now for your 2-week free trial to the Research Wizard and start using this screen in your own trading. Further, you can also create your own strategies and test them first before taking the investment plunge.",
    "The Research Wizard is a great place to begin. It's easy to use. Everything is in plain language. And it's very intuitive. Start your Research Wizard trial today. And the next time you read an economic report, open up the Research Wizard, plug your finds in, and see what gems come out.",
    "Click here to sign up for a free trial to the Research Wizard today .",
    "Disclosure: Officers, directors and/or employees of Zacks Investment Research may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material. An affiliated investment advisory firm may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material.",
    "Disclosure: Performance information for Zacks' portfolios and strategies are available at: https://www.zacks.com/performance.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 07:08:00"
}