{
  "url": "https://www.nasdaq.com/article/mexican-president-says-referendums-could-decide-fate-of-expresidents-20190903-00953",
  "title": "Mexican president says referendums could decide fate of ex-presidents - Nasdaq.com",
  "text": [
    "By Dave Graham",
    "MEXICO CITY, Sept 3 (Reuters) - Mexican President Andres Manuel Lopez Obrador said on Tuesday the public should have the right to choose whether ex-presidents should face trial once a bill has passed Congress making it easier to hold referendums.",
    "Speaking after an official said an investigation had been opened on a 2014 scandal that battered the reputation of his predecessor, Enrique Pena Nieto, Lopez Obrador said he did not want to pursue former presidents in court.",
    "\"And once (the constitution) has been reformed and these referendums can be held, if the people ask for it and want ex-presidents to stand trial, that right is guaranteed,\" Lopez Obrador said at his regular morning news conference.",
    "On Monday, Irma Sandoval, head of the Public Administration Ministry, said the government had filed a criminal complaint against a number of former officials over the case of a luxury house acquired by Pena Nieto's then-wife, Angela Rivera.",
    "In November 2014, it emerged that Rivera was purchasing the house from a government contractor, sparking accusations that Pena Nieto was caught in a conflict of interest.",
    "Pena Nieto was later cleared by a government-led investigation that critics derided as a whitewash, and the episode did lasting damage to his authority.",
    "Sandoval did not identify the ex-officials now under scrutiny, but when asked whether the investigation led toward Pena Nieto, she responded: \"We could say that, yes.\"",
    "Lopez Obrador, who took office in December, spent years campaigning against corruption in Mexican politics. But he disappointed supporters when he said he did not want to rake through the past after winning election in July 2018.",
    "Still, in recent weeks, expectations have risen that Lopez Obrador is serious about tackling corruption.",
    "Prosecutors have launched investigations of two top officials from the previous administration for alleged misuse of public funds, Emilio Lozoya, former boss of state oil firm Pemex, and ex-Social Development Minister Rosario Robles.",
    "Both have denied any wrongdoing. Still, a lawyer for Lozoya said that Pena Nieto was aware of his client's actions at Pemex. Pena Nieto has rejected any suggestion of wrongdoing.",
    "Lopez Obrador says Pena Nieto is not under investigation. But he likes to stress that political corruption came from the top down in Mexico, and underlined the point again on Tuesday.",
    "\"The juiciest deals done under the aegis of public office got the nod of the presidents,\" he told the news conference."
  ],
  "published_datetime": "2019-09-03 13:05:00"
}