{
  "url": "https://www.nasdaq.com/article/the-tide-is-changing-so-are-our-chances-cm1207634",
  "title": "The Tide Is Changing & So Are Our Chances - Nasdaq.com",
  "text": [
    "   It's been a rocky few months. Uncertainty and summer has held the market at bay but since the announcement of a revision down in the trade deficit and mainland China withdrawing the extradition bill, things are picking up. The announcement that the fed would be cutting rates adds a bit of excitement to the upcoming meeting. Japan and the US have finally settled on a trade deal and there's also an upcoming employment situation report which should also be good news. We also touch on Tilray's (TLRY) CEO Brendan Kennedy's ambition of becoming the world's largest cannabis distributor as well as make a dive into some interesting picks in the Battleground. Watch this week's episode to see just which stocks we profile! To get recent Zacks video updates, be sure to subscribe to our Youtube channel and participate by leaving any comments or questions.  Biggest Tech Breakthrough in a Generation  makeArticleAd();  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   AT&T Inc. (T): Free Stock Analysis Report   ProShares S&P 500 Dividend Aristocrats ETF (NOBL): ETF Research Reports   SPDR S&P 500 ETF (SPY): ETF Research Reports   Matrix Service Company (MTRX): Free Stock Analysis Report   Innovative Industrial Properties, Inc. (IIPR): Free Stock Analysis Report   Tilray, Inc. (TLRY): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "It's been a rocky few months. Uncertainty and summer has held the market at bay but since the announcement of a revision down in the trade deficit and mainland China withdrawing the extradition bill, things are picking up. The announcement that the fed would be cutting rates adds a bit of excitement to the upcoming meeting. Japan and the US have finally settled on a trade deal and there's also an upcoming employment situation report which should also be good news. We also touch on Tilray's (TLRY) CEO Brendan Kennedy's ambition of becoming the world's largest cannabis distributor as well as make a dive into some interesting picks in the Battleground. Watch this week's episode to see just which stocks we profile! To get recent Zacks video updates, be sure to subscribe to our Youtube channel and participate by leaving any comments or questions.",
    " Biggest Tech Breakthrough in a Generation  makeArticleAd();  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:43:00"
}