{
  "url": "https://www.nasdaq.com/article/safricas-sanlam-could-invest-in-egypt-within-1-year-20190905-00178",
  "title": "S.Africa's Sanlam could invest in Egypt within 1 year - Nasdaq.com",
  "text": [
    "JOHANNESBURG, Sept 5 (Reuters) - South Africa's largest insurer Sanlam Ltd  could invest in Egypt in the next year, CEO Ian Kirk told Reuters on Thursday, following interim results bolstered by its pan-African strategy.",
    "Sanlam has previously said it wanted to take a stake in an Egyptian firm, but it had yet to find a suitable partner.",
    "CEO Kirk told Reuters it was now looking at a number of potential companies.",
    "He was speaking after Sanlam reported a 32% drop in profits largely due to one-off costs, including a 1.7 billion rand ($111.57 million) expense related to a black economic empowerment transaction and a 200 million rand amortisation charge.",
    "Sanlam's headline earnings per share - the main profit measure in South Africa - for the six months to June 30 fell to 170.7 cents from 251 cents a year earlier.  ",
    "Its shares were up 2.67% at 0813 GMT following the results, which were slightly better than the 35% profit fall which the company had flagged in August. ",
    "Sanlam's net result from financial services - its measure of operating profit - rose 13%, which the insurer described as a \"credible\" performance considering an ailing economy in South Africa and volatility in global markets amid a Sino-U.S. trade war and other uncertainties such as Brexit.",
    "It said its results were buoyed by its newly acquired Moroccan unit SAHAM Finances, which it brought for $1 billion in March 2018 in the 101-year-old company's largest-ever purchase.",
    "The acquisition of the firm, which operates in 26 countries via 65 subsidiaries across the continent, is part of Sanlam's drive to become a pan-African insurance group. It is already one of the largest insurers by assets on the continent.",
    "Continental operations have proven valuable assets for South African financial services firms, helping to offset stagnant growth at home.",
    "\"This is the number one priority for the group,\" Kirk said, adding the SAHAM Finances integration was on track while realising returns on the deal would take a little bit longer.",
    "The unit's net result from financial services was down 7%, however its growth was a key contributor to the Sanlam's operational performance.",
    "While some of its other African operations enjoyed a turnaround in profitability, Kirk said the company had to write down the value of its 2015 investment in Zimbabwe by around 188 million rand in the first half of the year.",
    "Rival insurer Old Mutual  had to ringfence its Zimbabwean unit after severe foreign currency shortages and rapidly rising inflation meant it could not get its capital out of the country. ",
    "($1 = 15.2369 rand)"
  ],
  "published_datetime": "2019-09-05 02:17:00"
}