{
  "url": "https://www.nasdaq.com/article/why-lyft-stock-dropped-20-last-month-cm1210511",
  "title": "Why Lyft Stock Dropped 20% Last Month - Nasdaq.com",
  "text": [
    "  What happened  Shares of   Lyft    (NASDAQ: LYFT) decelerated again last month, losing 20% according   to data from   S&P Global Market Intelligence    . The company actually delighted investors with its   second-quarter earnings report, but that was not enough to buck   the tide in the market against high-priced   IPO stocks    like Lyft and rival   Uber    (NYSE: UBER) . Additionally, investors balked as the We Company,   the parent of WeWork, filed for its IPO, putting further pressure   on Uber and Lyft. As you can see from the chart below, it was an eventful month   for Lyft stock, which moved up and down several times, but in the   end finished down 20% for the month of August.     makeArticleAd();     LYFT    data by   YCharts   So what  Lyft shares popped briefly on August 8 after its   second-quarter earnings report came out, as shares finished up 3%   after gaining nearly 10% at one point during the session. The   company topped its own guidance with another quarter of strong   revenue growth, with sales jumping 72% to $867 million. It also   raised its full-year revenue growth forecast to between 61% and   62% from a previous range of 52% to 53%, a promising sign.   Image source: Lyft.  However, the following session the stock gave up all those   gains and then some after rival Uber posted disappointing numbers   indicating slowing ridesharing growth and a wide loss. For   reasons that seem   misguided    , the market has traded these two stocks in tandem, so good news   or bad news for one is treated as the same for the other.   However, the reality is that they are direct competitors fighting   each other for market share. The following week, Lyft stock tumbled again after WeWork   parent the We Company   filed to go public    , revealing a number of problems, including poor corporate   governance and wide losses. The filing seemed to confirm to   investors that IPO stocks like Uber and Lyft are overvalued. Finally, Lyft passed an important test on August 19 when its   lockup period expired, allowing insiders to sell. Those investors   largely held the stock, however, and the price remained   steady.  Now what  Lyft shares have continued to limp through September, hitting   an all-time low yesterday as the company faces regulations in   California that would force Lyft, Uber, and their peers to   classify drivers as employees rather than independent   contractors, a move that would increase Lyft's expenses and could   pave the way for similar legislation in other states. With fast growth and huge losses from the company, investors   can expect continued volatility from Lyft, but last month's   plunge in both its stock and Uber's makes it clear that the   honeymoon period for these IPO stocks is over.   10 stocks we like better than Lyft       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Lyft wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Jeremy Bowman      has no position in any of the stocks mentioned. The Motley Fool     recommends Uber Technologies. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   Lyft    (NASDAQ: LYFT) decelerated again last month, losing 20% according   to data from   S&P Global Market Intelligence    . The company actually delighted investors with its   second-quarter earnings report, but that was not enough to buck   the tide in the market against high-priced   IPO stocks    like Lyft and rival   Uber    (NYSE: UBER) . Additionally, investors balked as the We Company,   the parent of WeWork, filed for its IPO, putting further pressure   on Uber and Lyft.",
    "As you can see from the chart below, it was an eventful month   for Lyft stock, which moved up and down several times, but in the   end finished down 20% for the month of August.",
    "    LYFT    data by   YCharts ",
    "Lyft shares popped briefly on August 8 after its   second-quarter earnings report came out, as shares finished up 3%   after gaining nearly 10% at one point during the session. The   company topped its own guidance with another quarter of strong   revenue growth, with sales jumping 72% to $867 million. It also   raised its full-year revenue growth forecast to between 61% and   62% from a previous range of 52% to 53%, a promising sign.",
    "  Image source: Lyft. ",
    "Image source: Lyft.",
    "However, the following session the stock gave up all those   gains and then some after rival Uber posted disappointing numbers   indicating slowing ridesharing growth and a wide loss. For   reasons that seem   misguided    , the market has traded these two stocks in tandem, so good news   or bad news for one is treated as the same for the other.   However, the reality is that they are direct competitors fighting   each other for market share.",
    "The following week, Lyft stock tumbled again after WeWork   parent the We Company   filed to go public    , revealing a number of problems, including poor corporate   governance and wide losses. The filing seemed to confirm to   investors that IPO stocks like Uber and Lyft are overvalued.",
    "Finally, Lyft passed an important test on August 19 when its   lockup period expired, allowing insiders to sell. Those investors   largely held the stock, however, and the price remained   steady.",
    "Lyft shares have continued to limp through September, hitting   an all-time low yesterday as the company faces regulations in   California that would force Lyft, Uber, and their peers to   classify drivers as employees rather than independent   contractors, a move that would increase Lyft's expenses and could   pave the way for similar legislation in other states.",
    "With fast growth and huge losses from the company, investors   can expect continued volatility from Lyft, but last month's   plunge in both its stock and Uber's makes it clear that the   honeymoon period for these IPO stocks is over.",
    "  10 stocks we like better than Lyft       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Lyft wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Lyft       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Lyft wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Jeremy Bowman      has no position in any of the stocks mentioned. The Motley Fool     recommends Uber Technologies. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:06:00"
}