{
  "url": "https://www.nasdaq.com/article/atwood-alexis-among-12-authors-to-compete-for-canadas-giller-prize-20190903-01003",
  "title": "Atwood, Alexis among 12 authors to compete for Canada's Giller Prize - Nasdaq.com",
  "text": [
    "By Kelsey Johnson",
    "OTTAWA, Sept 3 (Reuters) - Canadian author Margaret Atwood, who penned the novels that inspired the hit television series \"Alias Grace\" and \"The Handmaid's Tale\", is among 12 writers listed on Tuesday for Canada's top literary award for fiction.",
    "Created in 1994, the Giller Prize recognizes excellence in Canadian fiction. The award has been backed by Canadian bank Scotiabank since 2005, with the top winner earning C$100,000($75,330). ",
    "\"The Testaments\" is the sequel to Atwood's famous 1985 dystopian novel \"The Handmaid's Tale\". The upcoming novel was also short-listed this week for the Booker Prize for fiction.",
    "Also among those up for the Giller Prize is Toronto-based author Andre Alexis for \"Days by Moonlight,\" published by Coach House Books. Alexis won the Giller Prize in 2015 for his novel \"Fifteen Dogs.\"",
    "The prize's short-list of five authors will be released on Sept. 30, with the winner revealed at a Toronto gala on Nov. 18.",
    "The complete long-list, which a jury narrowed down from 117 submissions, is as follows:",
    "Andre Alexis - \"Days of Moonlight,\" published by Coach House Books",
    "Margaret Atwood - \"The Testaments,\" published by McClelland & Stewart",
    "David Bezmozgis - \"Immigrant City,\" published by HarperCollins Publishers Ltd",
    "Michael Christie - \"Greenwood,\" published by McClelland & Stewart",
    "Megan Gail Coles - \"Small Game Hunting at the Local Coward Gun Club,\" published by House of Anansi Press",
    "Michael Crummey - \"The Innocents,\" published by Doubleday Canada",
    "Adam Foulds - \"Dream Sequence,\" published by Biblioasis",
    "K.D. Miller - \"Late Breaking,\" published by Biblioasis",
    "Alix Ohlin - \"Dual Citizens,\" published by House of Anansi Press",
    "Steven Price - \"Lampedusa,\" published by McClelland & Stewart",
    "Zalika Reid-Benta - \"Frying Plantain,\" published by Astoria, an imprint of House of Anansi Press",
    "Ian Williams - \"Reproduction,\" published by Random House Canada",
    "($1 = 1.3275 Canadian dollars)"
  ],
  "published_datetime": "2019-09-03 14:08:00"
}