{
  "url": "https://www.nasdaq.com/article/lam-researchs-45-dividend-hike-boosts-shareholder-return-cm1206704",
  "title": "Lam Research's 4.5% Dividend Hike Boosts Shareholder Return - Nasdaq.com",
  "text": [
    " As a shareholder-friendly measure, Lam Research Corporation LRCX  recently announced a hike in dividend payout. The move indicates the company's sound financial position and intention to utilize free cash for enhancing its shareholders' returns. The company raised quarterly dividend by 4.5% to $1.15 per share from $1.10. This new dividend, approved by its board of directors, will be paid on Oct 16, 2019 to stockholders of record as of Oct 1. Shares of Lam Research have returned 24.9% over a year against the industry  's 1.9% decline.    We believe that portfolio strength, robust liquidity, strong balance sheet and cash flow generation ability will support its shareholder-friendly initiatives. This will help the stock to sustain momentum in the remainder of fiscal 2019 and beyond.  Impressive Fundamentals Drive Growth  Lam Research topped the Zacks Consensus Estimate in all the trailing four quarters, with an average of 6.52%. In the las t report  ed quarter, the company reported non-GAAP earnings of $3.62 per share, which outpaced the Zacks Consensus Estimate by 22 cents. Further, revenues of 2.36 billion surpassed the Zacks Consensus Estimate by 0.47%. Management remains positive about both etch and deposition technologies, which will likely continue to expand its presence in the serviceable addressable market. Moreover, rising adoption of 3D architectures continues to drive the performance of non-memory segments. Further, advanced packaging technology inflections are acting as tailwinds. Moreover, aggressive share buyback will fuel the bottom line. The company expects non-GAAP earnings for the fiscal first quarter to be $3.00 (+/- 20 cents) per share and revenues to be $2.15 billion (+/- $150 million).    Lam Research Corporation Price and Consensus         Lam Research Corporation   price-consensus-chart    |   Lam Research Corporation Quote    Cash Flow Generation Remains Strong  In the last reported quarter, cash and cash equivalents, short-term investments, as well as restricted cash and investment balance were $5.4 billion, down from $6.1 billion in the fiscal third quarter. Moreover, Lam Research generated $880.5 million cash from operations in the last reported quarter. The company also paid $164.9 million in cash dividends.  Zacks Rank & Stocks to Consider  Currently, Lam Research has a Zacks Rank #3 (Hold). Some better-ranked stocks in the broader technology sector include Alphabet Inc. GOOGL  , Itron, Inc. ITRI  and Teradyne, Inc. TER  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   . Long-term earnings growth for Alphabet, Itron and Teradyne is currently projected at 17.5%, 25% and 11.4%, respectively.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Alphabet Inc. (GOOGL): Free Stock Analysis Report   Lam Research Corporation (LRCX): Free Stock Analysis Report   Itron, Inc. (ITRI): Free Stock Analysis Report   Teradyne, Inc. (TER): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "As a shareholder-friendly measure, Lam Research Corporation LRCX  recently announced a hike in dividend payout. The move indicates the company's sound financial position and intention to utilize free cash for enhancing its shareholders' returns.",
    "The company raised quarterly dividend by 4.5% to $1.15 per share from $1.10. This new dividend, approved by its board of directors, will be paid on Oct 16, 2019 to stockholders of record as of Oct 1.",
    "Shares of Lam Research have returned 24.9% over a year against the industry  's 1.9% decline.",
    "We believe that portfolio strength, robust liquidity, strong balance sheet and cash flow generation ability will support its shareholder-friendly initiatives. This will help the stock to sustain momentum in the remainder of fiscal 2019 and beyond.",
    " Impressive Fundamentals Drive Growth ",
    "Lam Research topped the Zacks Consensus Estimate in all the trailing four quarters, with an average of 6.52%.",
    "In the las t report  ed quarter, the company reported non-GAAP earnings of $3.62 per share, which outpaced the Zacks Consensus Estimate by 22 cents. Further, revenues of 2.36 billion surpassed the Zacks Consensus Estimate by 0.47%.",
    "Management remains positive about both etch and deposition technologies, which will likely continue to expand its presence in the serviceable addressable market.",
    "Moreover, rising adoption of 3D architectures continues to drive the performance of non-memory segments. Further, advanced packaging technology inflections are acting as tailwinds.",
    "Moreover, aggressive share buyback will fuel the bottom line. The company expects non-GAAP earnings for the fiscal first quarter to be $3.00 (+/- 20 cents) per share and revenues to be $2.15 billion (+/- $150 million).",
    " Lam Research Corporation Price and Consensus ",
    "     Lam Research Corporation   price-consensus-chart    |   Lam Research Corporation Quote  ",
    " Lam Research Corporation   price-consensus-chart    |   Lam Research Corporation Quote ",
    " Cash Flow Generation Remains Strong ",
    "In the last reported quarter, cash and cash equivalents, short-term investments, as well as restricted cash and investment balance were $5.4 billion, down from $6.1 billion in the fiscal third quarter.",
    "Moreover, Lam Research generated $880.5 million cash from operations in the last reported quarter. The company also paid $164.9 million in cash dividends.",
    " Zacks Rank & Stocks to Consider ",
    "Currently, Lam Research has a Zacks Rank #3 (Hold). Some better-ranked stocks in the broader technology sector include Alphabet Inc. GOOGL  , Itron, Inc. ITRI  and Teradyne, Inc. TER  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    "Long-term earnings growth for Alphabet, Itron and Teradyne is currently projected at 17.5%, 25% and 11.4%, respectively.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:09:00"
}