{
  "url": "https://www.nasdaq.com/article/top-ranked-value-stocks-to-buy-for-september-3rd-cm1206825",
  "title": "Top Ranked Value Stocks to Buy for September 3rd - Nasdaq.com",
  "text": [
    "Here are four stocks with buy rank and strong value characteristics for investors to consider today, September 3rd:",
    "Qudian Inc. (QD): This online small consumer credit products provider has a Zacks Rank #1 (Strong Buy), and seen the Zacks Consensus Estimate for its current year earnings rising 23.4% over the last 60 days.",
    "Qudian Inc. Sponsored ADR price-consensus-chart | Qudian Inc. Sponsored ADR Quote",
    "Qudian has a price-to-earnings ratio (P/E) of 3.70, compared with 8.20 for the industry. The company possesses a  Value Score  of B.",
    "Qudian Inc. Sponsored ADR pe-ratio-ttm | Qudian Inc. Sponsored ADR Quote",
    "Anixter International Inc. (AXE) : This enterprise cabling and security solutions provider has a Zacks Rank #1, and seen the Zacks Consensus Estimate for its current year earnings rising 12.3% over the last 60 days.",
    "Anixter International Inc. price-consensus-chart | Anixter International Inc. Quote",
    "Anixter International has a price-to-earnings ratio (P/E) of 8.65, compared with 10.00 for the industry. The company possesses a Value Score of A.",
    "Anixter International Inc. pe-ratio-ttm | Anixter International Inc. Quote",
    "Mr. Cooper Group Inc. (COOP) : This transaction-based services provider has a Zacks Rank #1, and seen the Zacks Consensus Estimate for its current year earnings rising 46.7% over the last 60 days.",
    "MR. COOPER GROUP INC price-consensus-chart | MR. COOPER GROUP INC Quote",
    "Mr. Cooper has a price-to-earnings ratio (P/E) of 4.00, compared with 8.20 for the industry. The company possesses a Value Score of A.",
    "MR. COOPER GROUP INC pe-ratio-ttm | MR. COOPER GROUP INC Quote",
    "China Southern Airlines Company Limited (ZNH): This airlines transportation services provider has a Zacks Rank #2 (Buy), and seen the Zacks Consensus Estimate for its current year earnings rising 17.5% over the last 60 days.",
    "China Southern Airlines Company Limited price-consensus-chart | China Southern Airlines Company Limited Quote",
    "China Southern Airlines Company has a price-to-earnings ratio (P/E) of 5.75 compared with 10.10 for the industry. The company possesses a Value Score of A.",
    "China Southern Airlines Company Limited pe-ratio-ttm | China Southern Airlines Company Limited Quote",
    "See the  full list of top ranked stocks here .",
    "Learn more about the  Value score and how it is calculated here .",
    "Legalizing THIS Could Be Even Bigger than Marijuana",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "See these 5 \"sin stocks\" now >>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:19:00"
}