{
  "url": "https://www.nasdaq.com/article/disneys-deal-with-target-is-much-ado-about-nothing-cm1207483",
  "title": "Disney's Deal With Target Is Much Ado About Nothing - Nasdaq.com",
  "text": [
    " News that   Disney    (NYSE: DIS) would open   dozens of store-in-store boutiques    inside   Target    (NYSE: TGT) was greeted as something magical. The power of Disney   franchises coupled with a resurgent Target could only benefit   both companies. While the partnership likely won't hurt either of them, the   purported benefits of the deal hardly seem momentous. Even though   a broad selection of merchandise that will be on sale in Target   was previously exclusive only to Disney's own retail stores, the   vast majority of goods are available elsewhere. Target may be   enjoying a nice bounce due to consumers responding to its   new marketing strategies    , but adding in a bunch of Disney tchotchkes won't move the   needle far, either. The real benefit for Target may be the opening of a store on   the outskirts of Walt Disney World in Florida in 2021, though it   hardly seems enough for investors to get so worked up over.makeArticleAd();   Image source: Target.    Down this road before At a time when   store closures    are likely to hit 12,000 this year, about 60% more than in 2018,   store-in-store boutiques are a concept that allows a retailer to   expand without really having to spend any money. Disney has over   200 retail locations in North America, so the 25 boutiques it   will be opening in Target this year, followed by 40 more next   year, amount to something like a 33% increase in retail coverage,   but without having to be out of pocket all that much on the   expansion. Even though Disney gets more exposure for its merchandise,   that doesn't necessarily help the retailer that houses the   boutiques.   J.C. Penney    (NYSE: JCP) has an expansive agreement with Disney that began   back in 2012 and which has grown to over   500 store-in-store locations    . Although the partnership was once hailed as one of the great   turnaround ideas from the Ron Johnson era at the retailer -- and   one of his few ideas that survived the subsequent purge when he   was ousted -- the boutiques haven't kept the retailer from   teetering on the edge of bankruptcy. Disney Chairman of Parks, Experiences, and Products Bob Chapek   told reporters on a call regarding the partnership with Target   that Disney felt the deal with J.C. Penney was still successful   for the entertainment giant and that deal would not be affected   by the new one. No doubt J.C. Penney is thankful for any traffic the   partnership drives and any sales it makes, but it's certainly not   transformational enough to lift the retailer out of the financial   morass in which it's stuck. Target's arrangement, being vastly   smaller than Disney's arrangement with J.C. Penney, will also not   move sales enough to matter. The daily grind goes on vacation There is one benefit that Target will have beyond the store in   Disney World that's unavailable to J.C. Penney: The   750-square-foot Disney boutiques in the Target stores will   feature specific \"Disney Store\" signage and will reportedly be   more \"experiential,\" with seating areas where families can sit   and watch movie and theme park clips. Some 450 products from the Disney, Pixar, Marvel, and   Star Wars    franchises will be featured and timed ahead of the launch of the   upcoming   Frozen 2    and   Star Wars: The Rise of Skywalker    films. They will also have a presence on Target's website and   through its mobile app. Arguably, the more important news is the plan to build a   Target store at the western entrance to Disney World in a   mixed-use development called Flamingo Crossings. Amid hotels,   time-shares, and apartments, there is also a variety of retail   options going up, including a new   Walgreens    and Speedway gas station. It seems a prime spot for families   needing groceries or other merchandise while spending time at the   theme park, even though a vacation -- particularly a trip to   Disney -- used to mean an escape from one's real-life grind. Now   it is a central component of the experience. Ultimately a positive though mundane deal The partnership   is    a   positive development    for both companies, one that expands the relationship the two   have had for years. But as a deal that drives meaningful sales   growth, there seems a lot to be desired. The store-in-store concept is, if not played out, no longer   special, as it's something many retailers are toying with. And   because the merchandise line is mostly available elsewhere, there   is a lack of singularity that warrants the enthusiasm. It may be   incrementally positive to Disney and Target, but it's hardly a   game changer.   10 stocks we like better than Target       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Target wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Rich Duprey      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Walt Disney. The Motley Fool has     the following options: long January 2021 $60 calls on Walt     Disney and short October 2019 $125 calls on Walt Disney. The     Motley Fool has a     disclosure policy      .  ",
    "News that   Disney    (NYSE: DIS) would open   dozens of store-in-store boutiques    inside   Target    (NYSE: TGT) was greeted as something magical. The power of Disney   franchises coupled with a resurgent Target could only benefit   both companies.",
    "While the partnership likely won't hurt either of them, the   purported benefits of the deal hardly seem momentous. Even though   a broad selection of merchandise that will be on sale in Target   was previously exclusive only to Disney's own retail stores, the   vast majority of goods are available elsewhere. Target may be   enjoying a nice bounce due to consumers responding to its   new marketing strategies    , but adding in a bunch of Disney tchotchkes won't move the   needle far, either.",
    "The real benefit for Target may be the opening of a store on   the outskirts of Walt Disney World in Florida in 2021, though it   hardly seems enough for investors to get so worked up over.",
    "  Image source: Target. ",
    "Image source: Target.",
    "At a time when   store closures    are likely to hit 12,000 this year, about 60% more than in 2018,   store-in-store boutiques are a concept that allows a retailer to   expand without really having to spend any money. Disney has over   200 retail locations in North America, so the 25 boutiques it   will be opening in Target this year, followed by 40 more next   year, amount to something like a 33% increase in retail coverage,   but without having to be out of pocket all that much on the   expansion.",
    "Even though Disney gets more exposure for its merchandise,   that doesn't necessarily help the retailer that houses the   boutiques.   J.C. Penney    (NYSE: JCP) has an expansive agreement with Disney that began   back in 2012 and which has grown to over   500 store-in-store locations    . Although the partnership was once hailed as one of the great   turnaround ideas from the Ron Johnson era at the retailer -- and   one of his few ideas that survived the subsequent purge when he   was ousted -- the boutiques haven't kept the retailer from   teetering on the edge of bankruptcy.",
    "Disney Chairman of Parks, Experiences, and Products Bob Chapek   told reporters on a call regarding the partnership with Target   that Disney felt the deal with J.C. Penney was still successful   for the entertainment giant and that deal would not be affected   by the new one.",
    "No doubt J.C. Penney is thankful for any traffic the   partnership drives and any sales it makes, but it's certainly not   transformational enough to lift the retailer out of the financial   morass in which it's stuck. Target's arrangement, being vastly   smaller than Disney's arrangement with J.C. Penney, will also not   move sales enough to matter.",
    "There is one benefit that Target will have beyond the store in   Disney World that's unavailable to J.C. Penney: The   750-square-foot Disney boutiques in the Target stores will   feature specific \"Disney Store\" signage and will reportedly be   more \"experiential,\" with seating areas where families can sit   and watch movie and theme park clips.",
    "Some 450 products from the Disney, Pixar, Marvel, and   Star Wars    franchises will be featured and timed ahead of the launch of the   upcoming   Frozen 2    and   Star Wars: The Rise of Skywalker    films. They will also have a presence on Target's website and   through its mobile app.",
    "Arguably, the more important news is the plan to build a   Target store at the western entrance to Disney World in a   mixed-use development called Flamingo Crossings. Amid hotels,   time-shares, and apartments, there is also a variety of retail   options going up, including a new   Walgreens    and Speedway gas station. It seems a prime spot for families   needing groceries or other merchandise while spending time at the   theme park, even though a vacation -- particularly a trip to   Disney -- used to mean an escape from one's real-life grind. Now   it is a central component of the experience.",
    "The partnership   is    a   positive development    for both companies, one that expands the relationship the two   have had for years. But as a deal that drives meaningful sales   growth, there seems a lot to be desired.",
    "The store-in-store concept is, if not played out, no longer   special, as it's something many retailers are toying with. And   because the merchandise line is mostly available elsewhere, there   is a lack of singularity that warrants the enthusiasm. It may be   incrementally positive to Disney and Target, but it's hardly a   game changer.",
    "  10 stocks we like better than Target       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Target wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Target       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Target wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Rich Duprey      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Walt Disney. The Motley Fool has     the following options: long January 2021 $60 calls on Walt     Disney and short October 2019 $125 calls on Walt Disney. The     Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:05:00"
}