{
  "url": "https://www.nasdaq.com/article/heres-how-stocks-reacted-to-dorians-mayhem-cm1207951",
  "title": "Here's How Stocks Reacted to Dorian's Mayhem - Nasdaq.com",
  "text": [
    " After ravaging the Bahamas, Hurricane Dorian is all set to unleash its fury on East Coast the United States on Sep 5. This event in turn has impacted several industries. While shares of cruise companies and hotels fell as tourism stalled, insurance shares dropped as the companies had to release funds for damage relief. Meanwhile, shares of building materials, freights and home improvement products rose as demand for such products increased due to the property damage in wake of a hurricane.  Tracking Hurricane Dorian  After wreaking havoc in the Bahamas, Hurricane Dorian shifted its course toward the coast of Florida on Sep 3. The hurricane had weakened after hitting the Bahamas but has since gained strength, recording maximum wind speeds of 115mph. On Sep 4, the National Hurricane Center (NHC) reported that Dorian has been upgraded to Category 3 and is shifting north toward the coasts of Georgia, South Carolina and North Carolina accompanied by strong winds, heavy rains, and high storm surges. Per NHC, Dorian is the most powerful storm to hit the Atlantic since 1935 Labor Day hurricane. The increase in Dorian's strength has raised the risk of storm hazards. The storm is anticipated to hit South Carolina coastline by Sep 5 and move toward North Carolina making landfall in the first half of Sep 6. Dorian has hurricane-force winds extending outward more than 60 miles from the center and a wind force that extend outward up to 195 miles. If Dorian makes a landfall in North Carolina it will be the first Category 3 hurricane to strike since Hurricane Fran in 1996.  How the Stocks Reacted to Hurricane Dorian's   Impact?  Northern Abaco Islands and Grand Bahama has suffered severe damage due to Dorian. In fact, according to the International Red Cross more than 13,000 properties are either damaged or destroyed. Without a doubt, travel and tourism industry which includes hotels and cruises bore the brunt of Hurricane Dorian. Shares of both Norwegian Cruise Line Holdings Ltd NCLH  and Royal Caribbean Cruises Ltd RCL  dropped nearly 2% on Sep 3 as the companies have multiple cruise ship destinations at The Bahamas. At the same time, the overall insurance industry has also suffered due to the hurricane. Per analysts at Swiss investment bank UBS Group AG, insurance companies collectively will incur a loss of at least $25 billion owing to Dorian. Utilities companies had to close production owing to disruption caused by strong winds and surge in water level, which led to their decline. Notably, shares of NextEra Energy Inc. NEE  closed 0.6% lower on Sep 4 as the storm looms over the eastern coast. But shares of building supplies, home improvement and freight industries gained as Dorian left behind damaged properties, which raised demand for their products and shipments. Shares of both Lowe's Companies, Inc. LOW  and Home Depot Inc HD  rose 0.7% on Sep 4. Also shares of building supplies like Owens Corning OC  and Beacon Roofing Supply, Inc. BECN  rose 0.5% and 0.2%, respectively, on the same day. Low's shares carry Zacks Rank #2 (Buy).You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   . Freight companies like USA Truck, Inc. USAK  , J.B. Hunt Transport Services, Inc. JBHT  and XPO Logistics, Inc. XPO  closed higher 3.6%, 2% and 1.7%, respectively.  It's Illegal in 42 States, But Investors Will Make   Billions Legally  In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year. That's twice as much as they spend on marijuana, legally or otherwise. Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.   See these 5 \"sin stocks\" now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  XPO Logistics, Inc. (XPO): Free Stock Analysis Report   J.B. Hunt Transport Services, Inc. (JBHT): Free Stock Analysis Report   USA Truck, Inc. (USAK): Free Stock Analysis Report   NextEra Energy, Inc. (NEE): Free Stock Analysis Report   Owens Corning Inc (OC): Free Stock Analysis Report   Lowe's Companies, Inc. (LOW): Free Stock Analysis Report   The Home Depot, Inc. (HD): Free Stock Analysis Report   Beacon Roofing Supply, Inc. (BECN): Free Stock Analysis Report   Royal Caribbean Cruises Ltd. (RCL): Free Stock Analysis Report   Norwegian Cruise Line Holdings Ltd. (NCLH): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "After ravaging the Bahamas, Hurricane Dorian is all set to unleash its fury on East Coast the United States on Sep 5. This event in turn has impacted several industries.",
    "While shares of cruise companies and hotels fell as tourism stalled, insurance shares dropped as the companies had to release funds for damage relief. Meanwhile, shares of building materials, freights and home improvement products rose as demand for such products increased due to the property damage in wake of a hurricane.",
    " Tracking Hurricane Dorian ",
    "After wreaking havoc in the Bahamas, Hurricane Dorian shifted its course toward the coast of Florida on Sep 3. The hurricane had weakened after hitting the Bahamas but has since gained strength, recording maximum wind speeds of 115mph.",
    "On Sep 4, the National Hurricane Center (NHC) reported that Dorian has been upgraded to Category 3 and is shifting north toward the coasts of Georgia, South Carolina and North Carolina accompanied by strong winds, heavy rains, and high storm surges. Per NHC, Dorian is the most powerful storm to hit the Atlantic since 1935 Labor Day hurricane.",
    "The increase in Dorian's strength has raised the risk of storm hazards. The storm is anticipated to hit South Carolina coastline by Sep 5 and move toward North Carolina making landfall in the first half of Sep 6.",
    "Dorian has hurricane-force winds extending outward more than 60 miles from the center and a wind force that extend outward up to 195 miles. If Dorian makes a landfall in North Carolina it will be the first Category 3 hurricane to strike since Hurricane Fran in 1996.",
    " How the Stocks Reacted to Hurricane Dorian's   Impact? ",
    "Northern Abaco Islands and Grand Bahama has suffered severe damage due to Dorian. In fact, according to the International Red Cross more than 13,000 properties are either damaged or destroyed.",
    "Without a doubt, travel and tourism industry which includes hotels and cruises bore the brunt of Hurricane Dorian. Shares of both Norwegian Cruise Line Holdings Ltd NCLH  and Royal Caribbean Cruises Ltd RCL  dropped nearly 2% on Sep 3 as the companies have multiple cruise ship destinations at The Bahamas.",
    "At the same time, the overall insurance industry has also suffered due to the hurricane. Per analysts at Swiss investment bank UBS Group AG, insurance companies collectively will incur a loss of at least $25 billion owing to Dorian.",
    "Utilities companies had to close production owing to disruption caused by strong winds and surge in water level, which led to their decline. Notably, shares of NextEra Energy Inc. NEE  closed 0.6% lower on Sep 4 as the storm looms over the eastern coast.",
    "But shares of building supplies, home improvement and freight industries gained as Dorian left behind damaged properties, which raised demand for their products and shipments.",
    "Shares of both Lowe's Companies, Inc. LOW  and Home Depot Inc HD  rose 0.7% on Sep 4. Also shares of building supplies like Owens Corning OC  and Beacon Roofing Supply, Inc. BECN  rose 0.5% and 0.2%, respectively, on the same day. Low's shares carry Zacks Rank #2 (Buy).You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "Freight companies like USA Truck, Inc. USAK  , J.B. Hunt Transport Services, Inc. JBHT  and XPO Logistics, Inc. XPO  closed higher 3.6%, 2% and 1.7%, respectively.",
    " It's Illegal in 42 States, But Investors Will Make   Billions Legally ",
    "In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    "That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "  See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:27:00"
}