{
  "url": "https://www.nasdaq.com/article/wall-street-advances-as-china-extends-trade-olive-branch-20190911-00671",
  "title": "Wall Street advances as China extends trade olive branch - Nasdaq.com",
  "text": [
    "By Stephen Culp",
    "NEW YORK, Sept 11 (Reuters) - Wall Street was pushed higher on Wednesday by tariff-sensitive technology and industrial shares after China extended an olive branch ahead of next month's trade negotiations with the United States.",
    "Apple Inc  led the charge, buoying all three major stock averages the day after it unveiled its latest iPhone upgrade and announced the launch date of its Apple TV+ streaming service. Its shares gained 2.6%, lifting the company's value above the $1 trillion mark.",
    "China announced tariff exemptions for a basket of U.S. goods, a move viewed by many investors as a show of good faith just days ahead of planned talks aimed at resolving the long-running trade war, which has rattled markets and bruised world economies. ",
    "However, a senior White House adviser urged investors to be patient in an effort to curb expectations for the trade talks scheduled to take place next month in Washington. ",
    "\"There's an element of improved trade optimism,\" said Chuck Carlson,  chief executive at Horizon Investment Services in Hammond, Indiana. \"But the bigger element is what we've seen over the last few days where investors are more willing to put more money into the value side of the equation.\"",
    "\"To see value (stocks) having some nice days speaks to this idea of improving breadth in the market,\" Carlson added.",
    "In a series of morning tweets, President Donald Trump called on the U.S. Federal Reserve to slash interest rates into negative territory, a move typically seen as a last-ditch effort revive sluggish economies. ",
    "\"It's been this raging friction between Trump and the Fed,\" said Mark Luschini, chief investment strategist at Janney Montgomery Scott in Philadelphia. \"At the moment the market ... still believes the Fed's going to act independently and not allow itself to be politicized regardless of what Trump may be saying or tweeting.\"",
    "Markets still expect the Fed to cut interest rates by 25 basis points at the conclusion of its monetary policy meeting next week.",
    "U.S. Treasury yields rose for the third straight session ahead of the European Central Bank's (ECB) meeting. ",
    "The Dow Jones Industrial Average  rose 139.52 points, or 0.52%, to 27,048.95, the S&P 500  gained 13.42 points, or 0.45%, to 2,992.81 and the Nasdaq Composite  added 63.58 points, or 0.79%, to 8,147.73.",
    "Of the 11 major sectors in the S&P 500, all but energy  and real estate  were in the black.",
    "Chipmaker Micron Technology Inc  rose 2.0% after Longbow Research upgraded the stock to \"buy.\" ",
    "The Philadelphia SE Semiconductor Index  was up 1.1%.",
    "Oilfield services firm Baker Hughes A GE Co  saw the biggest percentage drop in the S&P 500, falling 6.1%, following news that parent General Electric  would sell $3 billion in Baker Hughes shares, resulting in a loss of GE's majority stake. ",
    "Positive trade news sent shares of Boeing Co  3.4% higher, providing the biggest boost to the Dow. The planemaker is the largest U.S. exporter by dollar value.",
    "Advancing issues outnumbered declining ones on the NYSE by a 2.18-to-1 ratio; on Nasdaq, a 2.75-to-1 ratio favored advancers.",
    "The S&P 500 posted 22 new 52-week highs and no new lows; the Nasdaq Composite recorded 47 new highs and 11 new lows."
  ],
  "published_datetime": "2019-09-11 02:27:00"
}