{
  "url": "https://www.nasdaq.com/article/turkey-plans-to-return-1-million-syrians-warns-of-new-migrant-wave-in-europe-20190905-00210",
  "title": "Turkey plans to return 1 million Syrians, warns of new migrant wave in Europe - Nasdaq.com",
  "text": [
    "By Nevzat Devranoglu and Tuvan Gumrukcu",
    "ANKARA, Sept 5 (Reuters) - Turkey plans to resettle 1 million refugees in northern Syria and may reopen the route for migrants into Europe if it does not receive adequate international support for the plan, President Tayyip Erdogan said on Thursday.",
    "Turkey, which hosts 3.6 million Syrian refugees, controls parts of north Syria where it says 350,000 Syrians have already returned. It is setting up a \"safe zone\" with the United States in the northeast where Erdogan said many more could be moved.",
    "The comments come as Turkey mounts pressure on Washington for further concessions on the depth and oversight of the planned safe zone in the northeast, and as it comes under increasing pressure in Syria's northwest Idlib region where a Russian-backed government offensive has pressed north. ",
    "Only a small minority of Syrians in Turkey are from the northern strip roughly proposed for re-settlement, according to Turkish government data.",
    "\"We are saying we should form such a safe zone that we, as Turkey, can build towns here in lieu of the tent cities here. Let's carry them to the safe zones there,\" Erdogan said",
    "\"Give us logistical support and we can go build housing at 30 km (20 miles) depth in northern Syria. This way, we can provide them with humanitarian living conditions.\"",
    "\"This either happens or otherwise we will have to open the gates,\" Erdogan said. \"Either you will provide support, or excuse us, but we are not going to carry this weight alone. We have not been able to get help from the international community, namely the European Union.\"",
    "RENEWED CONFLICT      ",
    "Under a deal agreed between the EU and Turkey in March 2016, Ankara agreed to stem the flow of migrants into Europe in return for billions of euros in aid.",
    "However, the number of migrant arrivals in neighbouring Greece spiked last month. A week ago, more than a dozen migrant boats carrying 600 people arrived, the first simultaneous arrival of its kind in three years.",
    "Last month, Interior Minister Suleyman Soylu said only 17% of refugees in Turkey hail from northeast regions controlled by the U.S.-backed Syrian Kurdish YPG militia, which Ankara considers a terrorist group. Of that region, the proposed safe zone would cover only a fraction. ",
    "Last week, senior Syrian Kurdish official Badran Jia Kurd said it is necessary to re-settle refugees in their home towns. \"Settling hundreds of thousands of Syrians, who are from outside our areas, here would be unacceptable,\" he said of the north east. ",
    "In Idlib, where Turkey has troops and where Ankara in 2017 agreed with Moscow and Tehran to reduce fighting, months of renewed conflict intensified in recent weeks and raised prospects of another wave of refugees at Turkey's borders.",
    "After a truce collapsed in early August, the Russian-backed Syrian army has gained significant ground against rebel forces, some of whom are backed by Turkey. ",
    "Nicholas Danforth, Istanbul-based senior visiting fellow at the German Marshall Fund, said warning about refugees in the context of the safe zone allows Erdogan to pressure both Europe and the United States at once. ",
    "\"What seems clear is that it would be impossible to settle that many refugees in any zone achieved through negotiations with the United States and the YPG,\" he said.",
    "\"This looks like an attempt to build pressure for more U.S. concessions on the safe zone, where some refugees could then be resettled for purposes of domestic (Turkish) public relations.\""
  ],
  "published_datetime": "2019-09-05 05:56:00"
}