{
  "url": "https://www.nasdaq.com/article/wall-street-just-upgraded-this-cannabis-stock-but-its-far-from-a-buy-cm1206790",
  "title": "Wall Street Just Upgraded This Cannabis Stock, but It's Far From a Buy - Nasdaq.com",
  "text": [
    "Many years from now, it's quite possible investors will look back on the cannabis industry as this generation's greatest growth trend . After the industry logged $3.4 billion in legal global sales in 2014, Wall Street forecast sales of anywhere from $50 billion to as high as $200 billion by 2029/2030. That's a robust double-digit annual growth percentage that's bound to get Wall Street and investors excited.",
    "Then again, the past couple of months have been anything but exciting for marijuana stocks investors. With few exceptions , pot stocks have been taken to the woodshed since April began, with supply issues in Canada and high tax rates in recreationally legal U.S. states weighing on their performance. Of course, for one Wall Street firm, this weakness looks like the opportunity to buy.",
    "Image source: Getty Images.",
    "Last week, investment firm Seaport Global upgraded the largest marijuana stock in the world by market cap, Canopy Growth (NYSE: CGC) . Shares of Canopy have shed more than half of their value since late April, which Seaport believes provides an intriguing opportunity for investors. Covering analyst Brett Hundley lifted Canopy Growth's rating to buy from neutral, and set a target price of $31, representing about 25% upside from when the rating was changed.",
    "According to Hundley and his firm in a research note sent out to clients, the bar is \"increasingly achievable\" for Canopy, with the North American cannabis industry providing a safety net for the company. As a refresher, Canopy Growth has legally pushed into the U.S. hemp market via a hemp-processing license in New York state, as well as the acquisition of ebbu, a Colorado-based intellectual property (IP) company with IP for cannabis- and hemp-based products.",
    "Furthermore, Hundley opines that Canopy's cash position gives it an edge over its peers. The company ended its most recent quarter with almost $2.4 billion in cash and cash equivalents , which is far more than every other pot stock, with the exception of Cronos Group , which has less cash than Canopy but quite the war chest of its own. Said Hundley, \"In addition, forecasted cash for Canopy cannot be valued on a 1-for-1 basis; it will likely be multiplicative.\"",
    "Considering Canopy's groundbreaking equity investment from Constellation Brandsfor $4 billion , as well as its more than 70,000 kilos of domestic supply deals and its push into the U.S., I can understand why Seaport is bullish. Unfortunately, I still believe Hundley and his team are jumping the gun on Canopy Growth.",
    "Image source: Getty Images.",
    "Even though Seaport Global admits that it has tempered its sales and profit projections in the near term, it's as if it's overlooking the importance of operating results. With Canada legalizing recreational weed, operating results actually matter now. And there's absolutely no sugarcoating the fact that Canopy's quarterly reports have been awful . In the most recent quarter, Canopy's cannabis sales were more or less flat yet again, while its gross margin retraced all the way to 15%. As potentially one of the last major marijuana stocks to push into recurring profitability, Canopy certainly doesn't look like a buy on a fundamental basis.",
    "To build on this point, it's also worth noting that Canada's supply issues aren't a quick fix. Regulatory agency Health Canada has been bogged down by hundreds of cultivation, processing, and sales applications, and despite changes to the cultivation application process , it's going to take a number of quarters for the agency to whittle down its backlog. Between this application backlog, a shortage of compliant packaging, and select provinces being slow to open physical licensed cannabis stores, there's no immediate remedy to Canopy Growth's supply issues.",
    "There's also nothing on the immediate horizon to suggest that the U.S. is going to change its cannabis policy at the federal level. Although medical marijuana is legal in 33 states, and 11 have passed legislation allowing adult-use consumption, Canopy can't partake in state-level marijuana growth, given that it would jeopardize its listing status on the New York Stock Exchange. As long as Republicans control the Senate -- or I should more specifically say, Sen. Mitch McConnell (R-Ky.) remains Senate Majority Leader -- all cannabis reform bills will fail to move forward . That means less of an impact from the U.S. in the near-to-intermediate term.",
    "Image source: Getty Images.",
    "Investors also can't overlook the fact that Canopy Growth doesn't have a permanent solution at CEO right now. The company's visionary, Bruce Linton, was fired as co-CEO in early July , and acting CEO Mark Zekulin will be stepping down once Canopy's board has found a permanent leader. With Constellation Brands essentially packing Canopy's board with two of its own execs and two independent directors, Canopy Growth has gone from a gung-ho marijuana growth stock to a company without any potential leadership from the pot industry.",
    "Finally, I believe it's important to recognize that while Canopy Growth has done a very good job of establishing a production, research, or export presence in more than a dozen international markets , these overseas ventures aren't likely to pay off until domestic demand is satisfied. And given the many supply issues noted above, it could be a while before that happens.",
    "Canopy Growth may have a handful of well-known brands and a healthy (yet shrinking) cash pile, but there's little meat on the bone for fundamentally focused investors to get excited about. Canopy has the opportunity to be great one day, but it's simply not worthy of a buy rating right now.",
    "Here's The Marijuana Stock You've Been Waiting For A little-known Canadian company just unlocked what some experts think could be the key to profiting off the coming marijuana boom. ",
    "And make no mistake - it is coming.",
    "Cannabis legalization is sweeping over North America - 10 states plus Washington, D.C., have all legalized recreational marijuana over the last few years, and full legalization came to Canada in October 2018.",
    "And one under-the-radar Canadian company is poised to explode from this coming marijuana revolution.",
    "Because a game-changing deal just went down between the Ontario government and this powerhouse company...and you need to hear this story today if you have even considered investing in pot stocks.",
    "Simply click here to get the full story now.",
    "Learn more",
    "Sean Williams has no position in any of the stocks mentioned. The Motley Fool recommends Constellation Brands. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 07:51:00"
}