{
  "url": "https://www.nasdaq.com/article/tailored-brands-inc-tlrd-q2-2019-earnings-call-transcript-cm1210822",
  "title": "Tailored Brands, Inc. (TLRD) Q2 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   Tailored Brands, Inc.    (NYSE: TLRD)        Q2 2019 Earnings Call       Sep 11, 2019 ,   5:00 p.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Greetings, and welcome to the Tailored Brands Q2 2019 Results   Conference Call. At this time, all participants are in a   listen-only mode. A question-and-answer session will follow the   formal presentation. [Operator Instructions] Please note this conference is being recorded. I'd now turn   the conference over to your host, Julie MacMedan, Vice President,   Investor Relations. Miss. MacMedan, you may begin.  Julie MacMedan    --   Investor Relations  Thank you and good afternoon everyone. Welcome to Tailored   Brands second quarter 2019 results conference call. This call is   being webcast and a replay will be available on the company's   Investor Relations website, ir.tailorbrands.com. Please note that   comments made during the conference call contain forward-looking   statements within the meaning of the United States federal   securities laws. These statements are subject to significant   business, economic and competitive risks, uncertainties and   contingencies, many of which are beyond our control. Any   forward-looking statements are not guarantees of future   performance, and actual results may differ materially from those   in such forward looking statements. Please refer to today's   earnings release, our annual report on Form 10-k and quarterly   reports on Form 10-Q to understand these risks and uncertainties.   You could access all of these reports on the Tailored Brands IR   website. In addition, the information on this call speaks only as of   today September 11, 2019. And we assume no obligation to publicly   update or revise our forward looking statements. Throughout this   conference call, management will be discussing results on an   adjusted basis. A reconciliation of non-GAAP financial measures   to the most directly comparable GAAP financial measures, and our   explanation of why the non-GAAP financial measures may be useful   are discussed in today's earnings release. With me today are our president and CEO, Dinesh Lathi and our   CFO, Jack Calandra. I would now like to turn the call over to   Dinesh.  Dinesh Lathi    --   President and Chief Executive Officer  Thank you Julie, and good afternoon everyone. Earlier today,   we released our results for the second quarter of 2019. And I'm   pleased to report that our earnings per share of $0.82 exceeded   the high end of the guidance range we provided in June of $0.65   to $0.70. As Jack will describe in greater detail, our   outperformance on the bottom-line was the result of topline sales   that were in-line with guidance, coupled with expense   favorability, primarily in lower marketing spend and lower   incentive compensation costs. While delivering at or above guidance on the top and bottom   line is important, and reflects the substantial and collective   effort of our nearly 20000 colleagues, no one at Tailored Brands   will be satisfied until we have transformed our customer facing   experience to one that can generate sustainable bottom and   topline growth. Back in March, I indicated that we had work ahead of us to   transform our customer facing experience and that the   transformation would take time. Our Q2 comps and our outlook for   Q3 reflect the facts that we are in the midst of a   transformation, that transformations take time and that we are   executing our transformation in a challenging retail environment.   Despite these challenges, we are confident in and excited about   our business because of the way the customer is responding to our   initiatives. To that end, before turning it over to Jack, who will cover   the financials in more detail, I want to update you on our   progress on transforming the customer experience. Roughly six   months ago, we identified three areas that we believed were going   to be critical to transforming the customer experience. They are   personalized products and services, inspiring and seamless   experiences in and across every channel and brands that stand for   something more than just price. Personalized products and   services are a priority because the customer is not only   demanding personalization in his online experiences, but is   increasingly demanding it offline as well. In our transformation   journey, the early stages of delivering personalization have been   focused around two things. The first is custom clothing and the   second is merchandising that better reflects how he dresses for   work and special occasions today. Our custom business continues   to grow at healthy double-digit rates at the multi $100 million   scale. In Q2, we averaged over 6 million a week in custom   suiting, up from over 4 million a week in Q2 2018. We are leaning into the positive response to customers by   continuing to push innovation in this category. In July, we   introduced the opportunity for customers to choose from a set of   fun, non-traditional linings featuring icons, florals and   tropical patterns for their custom garments. We've seen a strong   response since the launch of the program, and the good news is   that these digitally printed linings have a short lead time   allowing us to test into new designs without needing to acquire   significant inventory upfront. The positive customer response to statement lining led us to   consider other jacket mining innovations, and last week we   announced that we had entered into a multi-year licensing   agreement with the National Football League. This agreement   enables us to offer sports fans the ability to customize their   suits and sport coats with linings depicting most of their   favorite NFL teams. We are very excited to continue to develop this NFL offering   as part of our goal to deliver the ultimate personalized   experience for our customers. We are also working to innovate the   process of buying a custom garment. Last quarter, we shared with   you that we were in beta on Custom Builder, a tablet based app   designed to assist our wardrobe consultants and customers with   the in-store custom buying experience. Since then, we have rolled out the app across our entire Men's   Wearhouse fleet and the majority of our Joseph A. Bank slate.   Feedback from our wardrobe consultants has been incredibly   positive and we are already seeing an improved customer   experience and gains in consultant efficiency due to a more   engaging and quicker sales process. For example, stored customer   profiles and new features allow consultants to seamlessly   duplicate a customer's specific measurements and choices in a   second or third fabric for a multiple unit purchase, saving   substantial time for both the consultant and the customer. Later   this month, we will launch Custom Builder to the balance of   Joseph A. Bank stores and across all more stores in Canada. In addition to custom clothing, we've also talked about the   opportunity to present the customer an assortment which better   reflects the way he is dressing today for work and special   occasions. Despite challenging traffic trends in our polished   casual categories, we saw sequential improvement at Men's   Wearhouse and we were pleased with the performance of sportswear   and dress shirts at Joseph A. Bank. Polished casual strength was driven in part by new product   introductions such as dinner jackets, seasonal red and aubergine   sport coats, short sleeve and full transitional long sleeve sport   shirts and shoes led by new, more casual and comfortable styles.   The one exception was sport coats to Joseph A. Bank which were so   popular that unfortunately we could not keep up with demand. The good news is that we have our new fall sport coats in   stores as well as new alternative completer pieces for a business   casual outfit that includes cardigan and zip sweaters, knit   bomber and trucker jackets and less structured sport coats. The second strategic initiative we discussed was creating   inspiring and seamless omni-channel experiences. On our store   experience, we're making progress on several fronts. Last quarter   we shared that we were running tests to measure the impact of   enhanced fixtures, in-store graphics and product presentation.   The results came in during Q2 and we learned which types of   stores responded highly to each aspect of the investment. We are in the process of rolling out those elements of the   design to the stores in the fleet that match the winning profile.   We've also been experimenting with labor in our stores. We   believe that helping them look and feel their best for the   moments that matter requires a personal touch. So we experimented   with additional labor on the weekends. That experiment was a winner. We saw a meaningful lift in   sales with the test stores that more than paid for the additional   labor. And we are in the process of scaling this new labor model   more broadly. On the e-commerce front, we continue to be pleased   with the pace at which our e-commerce teams are improving the   online experience for our customers. Our e-commerce sales   penetration is much lower than our retail peers and I am really   excited about the potential to close this gap. Over the past six   months, we have focused on elevating our e-commerce experience to   achieve our goal of delivering an inspiring and seamless   omni-channel experience. We believe successful execution of this   strategy presents a large unlock for our business on both the top   and bottom line. Last quarter we talked about how we had   implemented agile software development methods to dramatically   increase the number of tests we are running. Whereas Q1 was very   much about implementing these new working methods, Q2 was where   we started to see dramatic business impact. The change in   trajectory of our e-commerce business since the beginning of the   summer has been fantastic and is due in part to both the growth   in traffic associated with our increased investment in digital   marketing and a robust test roadmap that has yielded substantial   conversion rate enhancements versus the control experience. An example of one of the features that we've scaled based on   test results is serving customers with weather based product   recommendations. Based on what we can discern about a customer's   location, they will see a message above the top navigation,   customize to the weather in their location, such as, dress for 62   degrees, shop now. Once they click on that message, we take them   directly to weather appropriate products like a quarter zip   pullover. We are also focused on streamlining the design on both mobile   and desktop to give products and call to action more prominence.   This means adjusting navigation, product imagery, spacing and   font sizes to help the shopper quickly find what they are looking   for. Getting customers to products faster is driving higher   conversion. E-com is an area where we continue to be really excited about   and the results we are seeing are strong confirmation that we are   starting to deliver what our customer wants. The third strategic   initiative we discussed was evolving our brands to stand for   something more than just price. The focus of this initiative is   twofold. First, to engage our customers in the media channels   they frequent, and second, to tell the stories of our brands so   that customers better understand what they are getting for their   dollar. On the channel shift, we've made significant progress.   Our marketing spend in digital channels is up 31% compared to Q2   of last year. Based on the foundational work and testing we conducted   through Q1, we are confident in our ability to put dollars to   work in digital channels at greater efficiency than we are   achieving in broadcast channels. We are pleased to report that by   increasing our digital marketing efforts, we have seen increases   in purchase intent for suits and business casual at both brands,   particularly among millennials. And we plan to step up our   digital spend in Q3 relative to Q2. Last quarter, we also talked   about the launch of new advertising campaigns at both Men's   Wearhouse and Joseph A. Bank. And we're pleased to see that these   campaigns, which had a brand storytelling orientation, are   resonating more with the important millennial segment when   compared to more price promotion oriented spots. We have been   leveraging the new brand campaign content through numerous   channels such as broadcast, digital, our e-comm sites and our   Joseph A. Bank fall catalog. Looking ahead, our goal is to focus   in on specific stories we know our customers care about and   amplify them across all marketing touch points. We are also looking forward to leveraging the strong brand   recognition that the National Football League brings to us   through our new licensing agreement. Finally, in addition to the   progress we've made on our customer facing initiatives, we've   also made some significant new additions to our senior ranks at   the Men's Wearhouse and Moores. These leaders were universally   attracted to the opportunity and the challenges of transforming   our customer experience and each of them brings a track record of   delivering impact and outcomes in their respective domains. Mary Ann McGrath joins us as SVP and chief marketing officer   from Williams-Sonoma Inc. where she led the transformation of   multiple brands to a digitally focused, data driven marketing   approach and drove significant sales and customer growth. Jerry   Brandehoff joins us as SVP and general merchandise manager from   PVH Corporation, where he led the North American Calvin Klein   jeans and sportswear business after a distinguished career in   merchandising at leading specialty retailers. And finally, Sharmila Sudhakar comes on board as VP of   e-commerce from walmart.com's home decor business, where she   drove meaningful topline growth and profitability for the home   division. We are delighted to have them onboard and we are   already benefiting from their new perspectives and ideas, their   execution orientation and their customer obsession. With that   context of progress on our customer facing strategic initiatives,   I'll now turn the call over to Jack, who, in addition to   discussing the financials for the quarter in more detail, will   also cover our updated capital allocation framework, our cost   savings initiatives and our guidance for Q3 2019.  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  Thanks Dinesh and good afternoon, everyone. Today, I'll review   our updated capital allocation strategy, the expected impact of   recently enacted tariffs, second quarter financial results and   guidance for the third quarter. I will also share with you the   progress we're making on our multi-year cost savings and   operational excellence programs. I'd like to start with the   recently completed sale of corporate apparel and the updated   capital allocation strategy we announced in today's release. We   were pleased to sell the corporate apparel business on August   16th in order to focus on core retail operations in the US and   Canada and strengthen the balance sheet. The sale also improves   both our pro forma leverage ratio and operating margin. We expect   to present the sale as a discontinued operation beginning in the   third quarter. Of the $62 million sale price, we have received   approximately $50 million cash after working capital adjustments   and will receive an additional $6 million in the first quarter of   fiscal 2020. We are reinvesting these proceeds in the business,   and this frees up funds previously slated for capital   expenditures to pay down debt. In addition, today we announced the suspension of the $0.18   per share quarterly cash dividend starting in Q4. On an annual   basis, this will make available about $36 million to be used for   a combination of share buybacks and accelerated debt reduction.   This change does not impact the previously approved $0.18   quarterly cash dividend payable on September 27th. I want to take a moment to explain why we are making this   change. Simply put, we strongly believe given the current stock   price and dividend yield, that there is a more efficient way to   allocate capital and that redeploying cash from the dividend into   a combination of share buybacks and debt reduction will enhance   long term value creation for all stakeholders. For executing   share buybacks, we have $48 million available under an existing   repurchase authorization from our board. I also want to reiterate our unwavering commitment to paying   down debt and strengthening the balance sheet. Over the past 2.5   years, we have made significant progress on debt reduction,   reducing total debt by over $440 million with a focus on the 7%   senior notes that mature in July 2022. We also extended the   maturity on our largest tranche of debt, the $884 million term   loan to 2025. Although our debt to EBITDA ratio has increased   this year due to business performance, we remain committed to   reducing debt to EBITDA to 3 times over the medium term. Now, I'd   like to provide our current assessment of how tariffs on imports   from China impact the business. As a reminder, the first three   lists of tariffs largely do not impact the goods we source and   any financial impact from those tariffs is immaterial. The fourth   list to watch a 15% tariff is being applied is comprised of two   groupings, the first of which went into effect September 1st and   the remainder of which goes into effect December 15th. Most of   our product falls into that first grouping. This has been a   somewhat fluid process, but we believe we can absorb the list for   tariffs within the existing product cost structure with minimal   impact to the bottom-line this year. This is due to both   diversifying our sourcing and working with our vendor partners in   China to help mitigate the impact of the tariffs. We had already   reduced the percent of direct source product from China from   approximately 30% in 2017 to 23% last year. For 2019, we expect   to lower that further to between 18% and 20%. Turning now to the second quarter results, I'd like to make   sure everyone knows that I will be discussing adjusted numbers   today, which eliminates certain items that are not indicative of   core business results. Please refer to our press release for more   details. Total sales for the second quarter were $789 million,   down 4.1%. Retail sales were down 4.1%, with comp sales down   3.6%. The non-comp spread of negative 0.5% was largely explained   by headwinds of 40 basis points from foreign exchange and was   primarily due to the weakening pound and its impact on corporate   apparel sales. Moving to gross margin, consolidated gross margin was $337   million, a decrease of $36 million. As a percent of sales,   consolidated gross margin decreased 260 basis points to 42.6%,   primarily due to lower retail segment gross margin rate. Retail   segment gross margin rate was down 290 basis points to 43.7%. The   decline was primarily due to a 180 basis point decrease in retail   clothing gross margin rate driven by increased promotional   activity versus last year and a 90 basis point deleveraging of   our occupancy costs. Turning to expenses, advertising expense decreased $5 million   and was down 50 basis points as a percent of sales to 4.2%,   reflecting a shift from broadcast to online spend as we optimize   channel mix as well as a shift of some marketing spending to Q3.   SG&A decreased $9 million largely due to lower incentive and   share based compensation expense. As a percent of sales, SG&A   was flat at 29.4%. Operating income of $71 million compared to   $93 million last year. As a percent of sales, operating income   decreased 220 basis points to 9%. Net interest expense was $18   million, down $3 million compared to last year, reflecting a   year-over-year reduction in total debt. The effective tax rate was 21.2% compared to 23.9% last year,   and second quarter diluted earnings per share were $0.82 compared   to a $1.07 last year. Turning now to the balance sheet and cash   flow. We ended the quarter with total liquidity of $421 million,   which includes $402 million available on the revolving credit   facility and $19 million of cash. At quarter end, inventories were up $60 million or 8% versus   last year. The majority of the increase is from higher levels of   raw materials, including fabric. While fabric inventory is higher   than planned. It is current and in support of basic replenishment   product. Within finished goods, an inventory increase in Men's   Wearhouse was largely offset by a decrease at Joseph A. Bank. The   increase at Men's Wearhouse was associated with strategic   investments in polished casual categories, including sport coats,   sportswear and shoes, a pull forward, of fall receipts and lower   sales than planned in the suits division. Importantly, the   quality of finished goods inventory as measured by inventory age   is significantly improved at both Men's Warehouse and Joseph A.   Bank versus last year. Debt at quarter end was approximately $1.2   billion, down $62 million versus a year ago. On a trailing 12   month basis, debt to EBITDA was 3.9 times. As I mentioned   previously, paying down debt continues to be a high priority. Year-to-date cash flow from operations was $33 million   compared to $198 million last year. The decrease reflects lower   ne   t earnings    , an increase in inventories and rental product purchases and   changes in accounts payable and accrued expenses, primarily due   to timing. First half capital expenditures were $39 million, up   $14 million versus last year and consistent with plan. While we   still expect a modest increase in full year CapEx versus last   year's $82 million, we will continue to react responsibly to   conditions and opportunities in the business. With respect to   real estate, during the quarter, we closed a net seven stores   consisting of six Joseph A. Bank stores and one Men's Wearhouse   and Tux store. The total number of stores at quarter end was   1,455. Turning now to guidance, as we discussed last quarter, our   plan is to continue to provide quarterly guidance for the   remainder of this fiscal year. We expect third quarter earnings   per share of $0.40 to $0.45, excluding the impact of any share   repurchases. Our third quarter guidance assumes the following.   For comp sales, we expect Men's Wearhouse down 3% to 5%, Joseph   A. Bank down 2% to 4%, K&G down 2% to 4% and Moores down 4%   to 6%. We expect rental comp to be down about 6% as we lapped   last year's big vanity wedding date in August. We expect an effective tax rate of 23% to 24%. With respect to   real estate, we expect net closures of seven stores across both   Men's Wearhouse and Joseph A. Bank. And finally, this outlook   excludes expected costs for third party domain experts and other   options associated with our cost savings and operational   excellence programs. Before I turn the call back to Dinesh, I want to give an   update on where we are in delivering against our multi-year cost   savings and operational excellence program. During the first half of 2019, we leveraged the expertise of a   third party to help us analyze large elements of our cost   structure and make recommendations for improvement. We've already   implemented some of these cost savings measures. That said, the   bigger opportunities require thoughtful and rigorous analysis to   ensure we continue to deliver a superior customer experience. While we still have work to do to assess their impact on our   business, we feel good about the progress we are making. We have   identified the following major areas of cost savings and   efficiencies. First, marketing, we've begun implementing a more   effective marketing mix as we shift from broadcast to digital to   tell our brand stories which over time we expect will be   reflected in reduced spending relative to sales. Second store   footprint. We've previously discussed that we believe we have an   opportunity to rethink the number of stores in the fleet and the   location of those stores and to do so in an analytically rigorous   manner. By the end of this fiscal year, we will complete a   comprehensive fleet analysis. Given over 98% of our stores   deliver a positive four wall contribution, this is much more   complex than just clothes, money, losing stores. We are working   with a third party to build sophisticated models that will help   us make decisions that maximize cross brand cross-channel market   level profitability. Third, supply chain. In the second quarter,   we consolidated our Canadian infrastructure by closing one of our   two distribution centers. The closed distribution center is an   owned facility and was recently listed for sale, the proceeds   from which will be applied to our updated capital allocation   framework. In closing, while there is more work to do, we are making good   progress and I'm encouraged by the potential to take significant   cost out of the business. In the meantime, we are focused on   shareholder value creation through investing in our growth   strategies, tightly managing expenses, strengthening our balance   sheet and repurchasing stock. Thank you. And now I'll turn the   call back to Dinesh to wrap up.  Dinesh Lathi    --   President and Chief Executive Officer  Thanks, Jack. To wrap up, on our last call, I indicated that   we were on a journey to transform our customer facing experience   to one that can generate sustainable and profitable growth, and   that we would continue to execute and invest in a focused manner   with a clear goal of continuing to generate cash while we   transform the experience. Transformations take time. And we have much work ahead of us   to reinvigorate our topline performance. However, as you've heard   on this call, we are seeing the early signs of customer response   to our transformational strategies of providing personalized   products and services, inspiring and seamless experiences in and   across every channel and brands that stand for more than just   price. We are launching new, personalized and innovative products for   fall. We are driving more traffic to enhance e-commerce   experience and we continue to shift more advertising spend from   broadcast to digital, where we are seeing positive return on   investment as we reach customers and more relevant channels. And   while we work to scale these and other transformative initiatives   into reliable sources of growth and profit, we are delivering on   and remain committed to focused investment and execution that   generates cash. Meeting our financial commitments while making healthy   progress against our transformation roadmap is the result of our   team members recognizing that this is not business as usual and   not accepting the status quo. They are changing the way the   company executes for the better by being anchored in and obsessed   with the customer by investing for long term and sustainable   value creation by an analysis to guide decisions and by moving   with an urgency that reflects our conviction and confidence in   our ability to own the customer's loyalty and advocacy. I'm   incredibly proud of the progress the team has made despite the   challenging retail environment and couldn't be more excited about   the positive customer response we are seeing and what it means   for the journey ahead. With that, let's open the line for   questions. Questions and Answers:  Operator  At this time, we will be conducting a question answer   session. [Operator Instructions] Our first question is from Susan Anderson, B. Riley FBR.   Please proceed with your question.  Luke Hatton    --   B. Riley FBR -- Analyst  Good afternoon. This is Luke Hatton on for Susan. So you   talked about the increased promotional activities in the retail   clothing line being one of the main drivers of the gross margin   deleverage. I was wondering if you could provide a more detail on   was this promotional activity similar across the brands and then   sort of how did it track against your expectations coming into   the quarter?  Dinesh Lathi    --   President and Chief Executive Officer  Hi, it's Dinesh, I'll take that one. Yeah as far as the way it   tracked across the quarter, you'll remember when we provided the   Q2 guidance, a couple of the inputs that we were using to form   that guidance were were both traffic and what we were seeing in   the promotional environment at that time. And as you saw with our   results coming in line with guidance that we provided, I   characterized the environment as promotional, but not out of line   with what our expectations were. And that's one of the reasons we   were able to deliver within guidance. As far as within the brand themselves, I wouldn't characterize   them as meaningful differences in terms of each brand being more   or less promotional than the other. I'd say the promotional   activity was similar across both brands and consistent with what   we saw last year. Although we continue to and will continue to   push on testing new handles and new price points. But the   frequency was similar to last year.  Luke Hatton    --   B. Riley FBR -- Analyst  Got it, thank you. And then sort of looking out into the third   quarter, I know you don't provide specific gross margin or   SG&A guidance, but given the similar level of comp declines,   should we be thinking about that in a sort of tracking the same   way for the third quarter here?  Dinesh Lathi    --   President and Chief Executive Officer  Yeah, I think that's fair. Our guidance for Q3 combines a   number of inputs. But one is obviously the traffic trends that   we've observed for the start of the quarter. Another is our view   of what the promotional environment will be like. And then the   third is the timing of certain strategic cost savings and   customer facing initiatives reaching scale. As far as the   promotional activity and the traffic as I think, those were   similar to what we were seeing in Q2.  Luke Hatton    --   B. Riley FBR -- Analyst  Got it. And if I can just sneak in one quick one. So on real   estate initiative that you just spoke on, can you just give us a   sense of sort of what the average lease term looks like in the   portfolio right now and if you're seeing any sort of rent   concessions from landlords in your recent discussions? Thank   you.  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  Yeah. Hi, Luke. This is Jack. So lease terms vary by brand. I   would say in our Men's Wearhouse business, those terms tend to be   a little bit longer in Joseph A. Bank, probably a little bit   shorter where we're doing more short term renewals. But I would   remind you that every year about 15% to 20% of our fleet comes up   for lease action. And so we've got a fairly high degree of   flexibility to impact the fleet on a regular basis.  Luke Hatton    --   B. Riley FBR -- Analyst  Great. Thank you and good luck next quarter.  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  Thank you.  Operator  Our next question is from Paul Trussell, Deutsche Bank. Please   proceed with your question.  Paul Trussell    --   Deutsche Bank -- Analyst  Good afternoon. I wanted to -- just maybe dig a little bit   more there on the third quarter guidance. You spoke positively   about some some green shoots you've seen in regards to some of   your initiatives. Just maybe reconcile for us, you know, a very   similar cadence of comps across each of the banners as we think   about the third quarter.  Dinesh Lathi    --   President and Chief Executive Officer  Hey Paul, it's Dinesh. Thanks for the question. As you think   about the green shoots that we talked about and that comp   guidance we gave for Q3, I guess I'd start by reminding you that   we are in the midst of a transformation and the transformation   transformations take time. We're approaching this with a test and   learn mindset. That means we're running experiments at a small   number of stores that won't impact the financial results, whether   the test is a winner or loser. The reason we're so excited is   because we're starting to see signs of positive customer response   to a lot of these tests, whether they be in merchandising stores,   e-commerce or marketing. It's the scaling of these tests that's   going to drive the top and bottom line impact. And some of them   like e-commerce, you'll be able to scale very quickly. And that's   one of the reasons we talked about the growth we're seeing in the   e-commerce business and what we're so excited about. Others like   stores or new merchandise, those are going to take more time   given things like production lead times and the nature of   physical store rollouts and so that the impact they have will be   happening later. What we did say though also was while the   customer facing transformation is taking place, we've also   committed to really being focused about our execution and where   we're investing with an eye toward generating cash. And that   includes things that can have a nearer term impact on the   bottom-line, like the cost savings initiatives that Jack   discussed, as well as continuing to get sharper on our basic   business practices, whether that's things like pricing or   buying. And so that the guidance for Q3, particularly at the comp   level, reflects both of those things, the nature and timeline of   transformations and the fact that we continue to get sharper in   our execution and we'll continue to keep you posted on our   progress.  Paul Trussell    --   Deutsche Bank -- Analyst  Thank you for that color. And maybe you can just spend a   minute giving a bit more detail on the capital allocation   decision made here, especially as it relates to the dividend   decision and also help us understand what -- the decisions you're   going to -- how you're going to decide to when to buy stock   versus paying down debt. Thank you.  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  Yeah. Hi, Paul. This is Jack. So as I mentioned in my prepared   remarks and given where the stock prices and the dividend yield,   we strongly believe that there's a more efficient way of   deploying capital than through the dividend. Want to make it   clear that funds freed up from the dividend, as you mentioned   will be deployed into a mix of share repurchases and accelerated   debt reduction. And also just to make clear that the funds that   we received from the sale of corporate apparel will be entirely   will be entirely applied to debt reduction. In terms of how we   will toggle between those two opportunities, you know, we'll   consider a number of variables in deciding how to allocate funds   between the two. I would say given our transformation strategies,   the confidence we have in them and our assessment of their risk   adjusted outcomes, we do believe that the stock is undervalued   based on a DCF methodology and we will continue to look at where   the stock is relative to those to that valuation, as well as   where the bonds and the term loan are trading relative to one   another to make that decision and it's a decision that we will   obviously be revisiting frequently as we move through the months   ahead.  Paul Trussell    --   Deutsche Bank -- Analyst  Got it. You know, looking at Moores and K&G, you know,   those are segments we spent a little bit less time speaking to,   maybe just remind us what's the connectivity there between those   divisions and MW and banks? How should we view those businesses   in terms of core assets and just kind of looking under the hood,   you know, talk about some of the trends and initiatives going on   within those businesses.  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  Paul, first, with respect to what you talked about on core   businesses and in prior calls as you know we've talked about the   fact that we saw synergies associated with operating our Men's   Wearhouse, Joseph A. Bank, Moores and K&G consumer retail   businesses and that we did not see synergies associated with   operating the dry cleaning business or the corporate apparel   business. We've obviously sold both the dry cleaning business and   the corporate apparel business. But our view with respect to our   consumer retail businesses hasn't changed. We continue to see   synergies associated with operating the Men's Wearhouse, Joseph   A. Bank, Moores and K&G. And so those remain core businesses.   And as far as the initiatives and when we talk about the various   e-com initiatives, marketing initiatives, those are things that   are being leveraged across the portfolio, merchandising   initiatives, and again, that's just a further example of the fact   that there are synergies in operating these four different retail   businesses.  Paul Trussell    --   Deutsche Bank -- Analyst  Thank you. And lastly from me, just as we think about SG&A   and advertising dollars, down quite a bit in 2Q. Maybe just hold   our hand a little bit more as we think about, you wanted to make   some maybe strategic investments, but also obviously still   looking at different ways to save on costs. How should we think   about these line items going forward?  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  Sure Paul. So this is Jack again. As you mentioned, we don't   guide on either advertising spend or SG&A. But to be helpful,   let me start with advertising. We expect to see this continued   mix shift from broadcast to online digital and that obviously   provides some efficiencies. But as I mentioned in my comments,   some of the Q2 save versus versus last year was pushed into Q3.   So I wouldn't expect as much a leverage in Q3 advertising expense   as you saw in Q2. With regard to SG&A, we'll continue to see   dollar savings versus last year from some of those same items   like incentive compensation and also, you know, the other cost   savings actions that we've taken that are outside of some of   these bigger strategic actions, for which we're still doing some   work on. But, in the areas of non merchandise procurement, our   international shipping, travel and entertainment, these are all   areas that we've attacked this year. Those savings help offset   some organic cost increases in the business. But as I look to Q3,   I would expect, sort of flattish dollars in SG&A, but   deleverage given the lower sales.  Paul Trussell    --   Deutsche Bank -- Analyst  Thanks for the color. Best of luck.  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  Thanks, Paul.  Operator  Our next question is from Carla Casella, J.P. Morgan. Please   proceed with your question.  Carla Casella    --   J.P. Morgan -- Analyst  Hi. One more question on the capital allocation first on --   did you give an actual leverage target? You mentioned your focus   on keeping leverage neutral or bringing it down, but did you give   the actual leverage target or timeframe?  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  Yeah. So Carla, this is Jack. Our leverage target of getting   to a debt to EBITDA ratio of three times in the medium term is   unchanged. That's still our target. As I mentioned, that ratio   has creeped up a little bit this year with the softer business   performance, but we are still focused on getting to that three   times in the medium term.  Carla Casella    --   J.P. Morgan -- Analyst  Okay. And then on your third quarter guidance, that excludes   corporate apparel, correct?  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  The third quarter guidance excludes corporate apparel.   Correct.  Carla Casella    --   J.P. Morgan -- Analyst  Okay. And in my -- if I'm looking at given the EPS guidance   you gave that to me looks like it implies EBITDA in the down low   $70 millions. Is that accurate?  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  Yeah, we don't guide to EBITDA. But certainly I think given   the components that we've shared around EPS and the tax rate and   some of the comments I've made around, you know, some of the   other items, I think that you can probably model that number.  Carla Casella    --   J.P. Morgan -- Analyst  Okay. And then you now include rental. I'm assuming that   includes both tux and suit. Can you give us some sense for how   much of that rental income is suit versus tux at this point? And   is there any major difference between those two business in term   of economic standpoint?  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  Yeah. I don't have the exact numbers off the top of my head,   Carla. But within the rental business, it is still predominantly   a tux business, not a suit rental business. And I am not aware   that the economics between those -- between renting a suit and   renting a tux are very different.  Carla Casella    --   J.P. Morgan -- Analyst  Okay. And then just one cash flow question. There's a there's   a big -- about a $100 million use of cash in you working capital   that for other liabilities. What is that related to? I was   assuming it has something to do with the lease liability changes,   which has another offset in the cash flow statement. But just   wondering if there's something else going on there in that other   liabilities line items.  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  No, I think you've captured -- it's the implementation of   lease accounting and to your point, you should see an offset for   that elsewhere in the cash flow statement.  Carla Casella    --   J.P. Morgan -- Analyst  Okay. And one more debt reduction question. So you you   mentioned that the $62 million from the corporate apparel will go   toward debt reduction. What are your options in terms of reducing   debt? Do you have to buy back in the market and what's your   thought on term loans versus bonds given where they're   trading?  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  Sure. So we have the option of both repurchasing the notes on   the open market as well as executing a call, as you know, at a   premium of 1.0175 [Phonetic]. So we have the option of doing   either of those in terms of the senior notes. In terms of   thinking about the term loan versus the notes, I would say at   current prices, the yields on those instruments are pretty   comparable. And obviously the notes come due in July 2022,   whereas the term loan we've extended to April of 2025. So I think   our bias would be given the similar yields, our bias would be on   the shorter maturity senior notes.  Carla Casella    --   J.P. Morgan -- Analyst  Okay. Great. Thank you.  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  Thank you.  Operator  Our next question is from Janet Kloppenburg, JJK Research.   Please proceed with your question.  Janet Kloppenburg    --   JJK Research -- Analyst  Hi, everybody. Just a couple of questions on the suit   business. Sounds like custom is really strong. Is the promotional   activity you're talking about in the off the rack suit business?   And Dinesh, do you think that's coming more from the lack of   demand for suits because of the casualisation trend or because   department stores or off price retailers are trying to gain share   and using price as a mechanism. And then I had a follow-on.  Dinesh Lathi    --   President and Chief Executive Officer  Yeah, I'll take the second one, Janet. Then you're gonna have   to remind me of the first one, what you're asking about on   custom. But as far as the promotional activity, yeah, we are   seeing heavy promotional activity in suits. And that is something   that we saw in Q2. That's something that informed our Q2 guide   and it's something that we actually saw materialize through the   quarter, and it's also influencing our Q3 guide. That is -- it's   going to be driven in part by traffic, which we've talked about   is it remains challenged I'd say for retail as a whole. And then   also you've met -- you referenced correctly this trend of   casualisation which is obviously -- it works against off the rack   suits. I would mention, though, that there is also a trend toward   personalization. And given that we're playing in custom suits,   that's actually a trend that helps us and it's one of the drivers   behind the healthy growth. We continue to see in our custom   suiting business, even while that business is tracking at a multi   $100 million scale.  Janet Kloppenburg    --   JJK Research -- Analyst  Okay. And then in terms of the inventory, it sounds like it's   a little heavy at the Men's Warehouse, maybe the content is   skewed more to suits Jack, I think that's the way you said it in   some finished goods as well. How do you see that working out,   getting in line with where it should be? And should we assume   that the gross margin -- retail segment gross margin compression   we saw in the second quarter is likely to continue for the   remainder of the year?  Dinesh Lathi    --   President and Chief Executive Officer  I get it. I'll pick the first part of that as far as inventory   is impacting the gross margin. As Jack indicated in his prepared   remarks, the inventories, while higher than last year, are also   of a higher quality as measured by ageing. And he also indicated   a meaningful portion of those were associated, a meaningful   portion of the increase I should say is associated with raw   materials for basic replenishment program. So because of the   nature of that inventory, we haven't modeled in any extraordinary   promotional activity in Q3, meaning our promotional efforts in Q3   will continue to be guided by the competitive environment we need   to participate in and not by the current state and levels of our   inventory.  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  Yeah. And Janet, this is Jack. I would just add to that. So   just look looking forward, as you know, we don't guide to   inventory, but to be helpful, I would say we expect some   improvement in the third quarter -- in the end of third quarter   inventories. So we'll expect -- I would expect that increase   versus last year to come down and therefore for the spread   between inventory and sales to improve and then to expect more   significant improvement by the end of the fourth quarter.  Janet Kloppenburg    --   JJK Research -- Analyst  And do you see this gross margin pressure moderating as your   inventory content skews more to the sport coats and the just   casual, which I think you're expecting to really be impactful on   the spring season?  Dinesh Lathi    --   President and Chief Executive Officer  Yeah, the gross margins are obviously lower in our polished   casual segments than they are in our suit segments. And so   obviously as the mix shifts and that'll impact gross margin. The   offset to that, though, Janet, is the frequency associated with   polished casual purchases is obviously much faster and much   higher than that associated with foods. And so even as you might   see an impact on gross margin, we think there's an opportunity   for SG&A leverage associated with higher transaction velocity   in polished casual.  Janet Kloppenburg    --   JJK Research -- Analyst  So, should we expect gross margins to continue to be under   pressure for the next couple of quarters? And am I right that you   inventory content will be where you want it to be in the spring   season?  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  Yes, so with regard Janet to gross margin, I would expect many   of the gross margin headwinds that we experienced in the second   quarter will continue into the third quarter. Dinesh talked about   some of these just in terms of the level of promotional intensity   and competitiveness out in the market, and we expect that to   continue with the increased penetration of custom, as you   remember that's a lower gross margin rate at higher gross margin   dollars. And obviously with the comps that we've guided to, there   will be some occupancy deleverage. So I would expect that the   gross margin headwinds that we saw in Q2 to largely carry into Q3   and that's been contemplated in our guidance.  Janet Kloppenburg    --   JJK Research -- Analyst  Okay. Thank you so much.  Jack P. Calandra    --   Executive Vice President, Chief Financial Officer  Thank you.  Operator  We have reached the end of the question and answer session.   And I will now turn the call back over to Dinesh Lathi, President   and CEO for closing remarks.  Dinesh Lathi    --   President and Chief Executive Officer  Thank you everyone for joining us today. We appreciate your   ongoing interest in and support for the important work of   transforming our business. We look forward to sharing our   continued progress with you next quarter. Thank you.  Operator  [Operator Closing Remarks]  Duration: 54 minutes  Call participants:  Julie MacMedan    --   Investor Relations   Dinesh Lathi    --   President and Chief Executive Officer   Jack P. Calandra    --   Executive Vice President, Chief Financial Officer   Luke Hatton    --   B. Riley FBR -- Analyst   Paul Trussell    --   Deutsche Bank -- Analyst   Carla Casella    --   J.P. Morgan -- Analyst   Janet Kloppenburg    --   JJK Research -- Analyst   More TLRD analysis   All earnings call transcripts        10 stocks we like better than Tailored Brands   Inc     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Tailored Brands   Inc wasn't one of them! That's right -- they think   these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " Tailored Brands, Inc.    (NYSE: TLRD)        Q2 2019 Earnings Call       Sep 11, 2019 ,   5:00 p.m. ET ",
    " Operator ",
    "Greetings, and welcome to the Tailored Brands Q2 2019 Results   Conference Call. At this time, all participants are in a   listen-only mode. A question-and-answer session will follow the   formal presentation. [Operator Instructions]",
    "Please note this conference is being recorded. I'd now turn   the conference over to your host, Julie MacMedan, Vice President,   Investor Relations. Miss. MacMedan, you may begin.",
    " Julie MacMedan    --   Investor Relations ",
    "Thank you and good afternoon everyone. Welcome to Tailored   Brands second quarter 2019 results conference call. This call is   being webcast and a replay will be available on the company's   Investor Relations website, ir.tailorbrands.com. Please note that   comments made during the conference call contain forward-looking   statements within the meaning of the United States federal   securities laws. These statements are subject to significant   business, economic and competitive risks, uncertainties and   contingencies, many of which are beyond our control. Any   forward-looking statements are not guarantees of future   performance, and actual results may differ materially from those   in such forward looking statements. Please refer to today's   earnings release, our annual report on Form 10-k and quarterly   reports on Form 10-Q to understand these risks and uncertainties.   You could access all of these reports on the Tailored Brands IR   website.",
    "In addition, the information on this call speaks only as of   today September 11, 2019. And we assume no obligation to publicly   update or revise our forward looking statements. Throughout this   conference call, management will be discussing results on an   adjusted basis. A reconciliation of non-GAAP financial measures   to the most directly comparable GAAP financial measures, and our   explanation of why the non-GAAP financial measures may be useful   are discussed in today's earnings release.",
    "With me today are our president and CEO, Dinesh Lathi and our   CFO, Jack Calandra. I would now like to turn the call over to   Dinesh.",
    " Dinesh Lathi    --   President and Chief Executive Officer ",
    "Thank you Julie, and good afternoon everyone. Earlier today,   we released our results for the second quarter of 2019. And I'm   pleased to report that our earnings per share of $0.82 exceeded   the high end of the guidance range we provided in June of $0.65   to $0.70. As Jack will describe in greater detail, our   outperformance on the bottom-line was the result of topline sales   that were in-line with guidance, coupled with expense   favorability, primarily in lower marketing spend and lower   incentive compensation costs.",
    "While delivering at or above guidance on the top and bottom   line is important, and reflects the substantial and collective   effort of our nearly 20000 colleagues, no one at Tailored Brands   will be satisfied until we have transformed our customer facing   experience to one that can generate sustainable bottom and   topline growth.",
    "Back in March, I indicated that we had work ahead of us to   transform our customer facing experience and that the   transformation would take time. Our Q2 comps and our outlook for   Q3 reflect the facts that we are in the midst of a   transformation, that transformations take time and that we are   executing our transformation in a challenging retail environment.   Despite these challenges, we are confident in and excited about   our business because of the way the customer is responding to our   initiatives.",
    "To that end, before turning it over to Jack, who will cover   the financials in more detail, I want to update you on our   progress on transforming the customer experience. Roughly six   months ago, we identified three areas that we believed were going   to be critical to transforming the customer experience. They are   personalized products and services, inspiring and seamless   experiences in and across every channel and brands that stand for   something more than just price. Personalized products and   services are a priority because the customer is not only   demanding personalization in his online experiences, but is   increasingly demanding it offline as well. In our transformation   journey, the early stages of delivering personalization have been   focused around two things. The first is custom clothing and the   second is merchandising that better reflects how he dresses for   work and special occasions today. Our custom business continues   to grow at healthy double-digit rates at the multi $100 million   scale. In Q2, we averaged over 6 million a week in custom   suiting, up from over 4 million a week in Q2 2018.",
    "We are leaning into the positive response to customers by   continuing to push innovation in this category. In July, we   introduced the opportunity for customers to choose from a set of   fun, non-traditional linings featuring icons, florals and   tropical patterns for their custom garments. We've seen a strong   response since the launch of the program, and the good news is   that these digitally printed linings have a short lead time   allowing us to test into new designs without needing to acquire   significant inventory upfront.",
    "The positive customer response to statement lining led us to   consider other jacket mining innovations, and last week we   announced that we had entered into a multi-year licensing   agreement with the National Football League. This agreement   enables us to offer sports fans the ability to customize their   suits and sport coats with linings depicting most of their   favorite NFL teams.",
    "We are very excited to continue to develop this NFL offering   as part of our goal to deliver the ultimate personalized   experience for our customers. We are also working to innovate the   process of buying a custom garment. Last quarter, we shared with   you that we were in beta on Custom Builder, a tablet based app   designed to assist our wardrobe consultants and customers with   the in-store custom buying experience.",
    "Since then, we have rolled out the app across our entire Men's   Wearhouse fleet and the majority of our Joseph A. Bank slate.   Feedback from our wardrobe consultants has been incredibly   positive and we are already seeing an improved customer   experience and gains in consultant efficiency due to a more   engaging and quicker sales process. For example, stored customer   profiles and new features allow consultants to seamlessly   duplicate a customer's specific measurements and choices in a   second or third fabric for a multiple unit purchase, saving   substantial time for both the consultant and the customer. Later   this month, we will launch Custom Builder to the balance of   Joseph A. Bank stores and across all more stores in Canada.",
    "In addition to custom clothing, we've also talked about the   opportunity to present the customer an assortment which better   reflects the way he is dressing today for work and special   occasions. Despite challenging traffic trends in our polished   casual categories, we saw sequential improvement at Men's   Wearhouse and we were pleased with the performance of sportswear   and dress shirts at Joseph A. Bank.",
    "Polished casual strength was driven in part by new product   introductions such as dinner jackets, seasonal red and aubergine   sport coats, short sleeve and full transitional long sleeve sport   shirts and shoes led by new, more casual and comfortable styles.   The one exception was sport coats to Joseph A. Bank which were so   popular that unfortunately we could not keep up with demand.",
    "The good news is that we have our new fall sport coats in   stores as well as new alternative completer pieces for a business   casual outfit that includes cardigan and zip sweaters, knit   bomber and trucker jackets and less structured sport coats.",
    "The second strategic initiative we discussed was creating   inspiring and seamless omni-channel experiences. On our store   experience, we're making progress on several fronts. Last quarter   we shared that we were running tests to measure the impact of   enhanced fixtures, in-store graphics and product presentation.   The results came in during Q2 and we learned which types of   stores responded highly to each aspect of the investment.",
    "We are in the process of rolling out those elements of the   design to the stores in the fleet that match the winning profile.   We've also been experimenting with labor in our stores. We   believe that helping them look and feel their best for the   moments that matter requires a personal touch. So we experimented   with additional labor on the weekends.",
    "That experiment was a winner. We saw a meaningful lift in   sales with the test stores that more than paid for the additional   labor. And we are in the process of scaling this new labor model   more broadly. On the e-commerce front, we continue to be pleased   with the pace at which our e-commerce teams are improving the   online experience for our customers. Our e-commerce sales   penetration is much lower than our retail peers and I am really   excited about the potential to close this gap. Over the past six   months, we have focused on elevating our e-commerce experience to   achieve our goal of delivering an inspiring and seamless   omni-channel experience. We believe successful execution of this   strategy presents a large unlock for our business on both the top   and bottom line. Last quarter we talked about how we had   implemented agile software development methods to dramatically   increase the number of tests we are running. Whereas Q1 was very   much about implementing these new working methods, Q2 was where   we started to see dramatic business impact. The change in   trajectory of our e-commerce business since the beginning of the   summer has been fantastic and is due in part to both the growth   in traffic associated with our increased investment in digital   marketing and a robust test roadmap that has yielded substantial   conversion rate enhancements versus the control experience.",
    "An example of one of the features that we've scaled based on   test results is serving customers with weather based product   recommendations. Based on what we can discern about a customer's   location, they will see a message above the top navigation,   customize to the weather in their location, such as, dress for 62   degrees, shop now. Once they click on that message, we take them   directly to weather appropriate products like a quarter zip   pullover.",
    "We are also focused on streamlining the design on both mobile   and desktop to give products and call to action more prominence.   This means adjusting navigation, product imagery, spacing and   font sizes to help the shopper quickly find what they are looking   for. Getting customers to products faster is driving higher   conversion.",
    "E-com is an area where we continue to be really excited about   and the results we are seeing are strong confirmation that we are   starting to deliver what our customer wants. The third strategic   initiative we discussed was evolving our brands to stand for   something more than just price. The focus of this initiative is   twofold. First, to engage our customers in the media channels   they frequent, and second, to tell the stories of our brands so   that customers better understand what they are getting for their   dollar. On the channel shift, we've made significant progress.   Our marketing spend in digital channels is up 31% compared to Q2   of last year.",
    "Based on the foundational work and testing we conducted   through Q1, we are confident in our ability to put dollars to   work in digital channels at greater efficiency than we are   achieving in broadcast channels. We are pleased to report that by   increasing our digital marketing efforts, we have seen increases   in purchase intent for suits and business casual at both brands,   particularly among millennials. And we plan to step up our   digital spend in Q3 relative to Q2. Last quarter, we also talked   about the launch of new advertising campaigns at both Men's   Wearhouse and Joseph A. Bank. And we're pleased to see that these   campaigns, which had a brand storytelling orientation, are   resonating more with the important millennial segment when   compared to more price promotion oriented spots. We have been   leveraging the new brand campaign content through numerous   channels such as broadcast, digital, our e-comm sites and our   Joseph A. Bank fall catalog. Looking ahead, our goal is to focus   in on specific stories we know our customers care about and   amplify them across all marketing touch points.",
    "We are also looking forward to leveraging the strong brand   recognition that the National Football League brings to us   through our new licensing agreement. Finally, in addition to the   progress we've made on our customer facing initiatives, we've   also made some significant new additions to our senior ranks at   the Men's Wearhouse and Moores. These leaders were universally   attracted to the opportunity and the challenges of transforming   our customer experience and each of them brings a track record of   delivering impact and outcomes in their respective domains.",
    "Mary Ann McGrath joins us as SVP and chief marketing officer   from Williams-Sonoma Inc. where she led the transformation of   multiple brands to a digitally focused, data driven marketing   approach and drove significant sales and customer growth. Jerry   Brandehoff joins us as SVP and general merchandise manager from   PVH Corporation, where he led the North American Calvin Klein   jeans and sportswear business after a distinguished career in   merchandising at leading specialty retailers.",
    "And finally, Sharmila Sudhakar comes on board as VP of   e-commerce from walmart.com's home decor business, where she   drove meaningful topline growth and profitability for the home   division. We are delighted to have them onboard and we are   already benefiting from their new perspectives and ideas, their   execution orientation and their customer obsession. With that   context of progress on our customer facing strategic initiatives,   I'll now turn the call over to Jack, who, in addition to   discussing the financials for the quarter in more detail, will   also cover our updated capital allocation framework, our cost   savings initiatives and our guidance for Q3 2019.",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "Thanks Dinesh and good afternoon, everyone. Today, I'll review   our updated capital allocation strategy, the expected impact of   recently enacted tariffs, second quarter financial results and   guidance for the third quarter. I will also share with you the   progress we're making on our multi-year cost savings and   operational excellence programs. I'd like to start with the   recently completed sale of corporate apparel and the updated   capital allocation strategy we announced in today's release. We   were pleased to sell the corporate apparel business on August   16th in order to focus on core retail operations in the US and   Canada and strengthen the balance sheet. The sale also improves   both our pro forma leverage ratio and operating margin. We expect   to present the sale as a discontinued operation beginning in the   third quarter. Of the $62 million sale price, we have received   approximately $50 million cash after working capital adjustments   and will receive an additional $6 million in the first quarter of   fiscal 2020. We are reinvesting these proceeds in the business,   and this frees up funds previously slated for capital   expenditures to pay down debt.",
    "In addition, today we announced the suspension of the $0.18   per share quarterly cash dividend starting in Q4. On an annual   basis, this will make available about $36 million to be used for   a combination of share buybacks and accelerated debt reduction.   This change does not impact the previously approved $0.18   quarterly cash dividend payable on September 27th.",
    "I want to take a moment to explain why we are making this   change. Simply put, we strongly believe given the current stock   price and dividend yield, that there is a more efficient way to   allocate capital and that redeploying cash from the dividend into   a combination of share buybacks and debt reduction will enhance   long term value creation for all stakeholders. For executing   share buybacks, we have $48 million available under an existing   repurchase authorization from our board.",
    "I also want to reiterate our unwavering commitment to paying   down debt and strengthening the balance sheet. Over the past 2.5   years, we have made significant progress on debt reduction,   reducing total debt by over $440 million with a focus on the 7%   senior notes that mature in July 2022. We also extended the   maturity on our largest tranche of debt, the $884 million term   loan to 2025. Although our debt to EBITDA ratio has increased   this year due to business performance, we remain committed to   reducing debt to EBITDA to 3 times over the medium term. Now, I'd   like to provide our current assessment of how tariffs on imports   from China impact the business. As a reminder, the first three   lists of tariffs largely do not impact the goods we source and   any financial impact from those tariffs is immaterial. The fourth   list to watch a 15% tariff is being applied is comprised of two   groupings, the first of which went into effect September 1st and   the remainder of which goes into effect December 15th. Most of   our product falls into that first grouping. This has been a   somewhat fluid process, but we believe we can absorb the list for   tariffs within the existing product cost structure with minimal   impact to the bottom-line this year. This is due to both   diversifying our sourcing and working with our vendor partners in   China to help mitigate the impact of the tariffs. We had already   reduced the percent of direct source product from China from   approximately 30% in 2017 to 23% last year. For 2019, we expect   to lower that further to between 18% and 20%.",
    "Turning now to the second quarter results, I'd like to make   sure everyone knows that I will be discussing adjusted numbers   today, which eliminates certain items that are not indicative of   core business results. Please refer to our press release for more   details. Total sales for the second quarter were $789 million,   down 4.1%. Retail sales were down 4.1%, with comp sales down   3.6%. The non-comp spread of negative 0.5% was largely explained   by headwinds of 40 basis points from foreign exchange and was   primarily due to the weakening pound and its impact on corporate   apparel sales.",
    "Moving to gross margin, consolidated gross margin was $337   million, a decrease of $36 million. As a percent of sales,   consolidated gross margin decreased 260 basis points to 42.6%,   primarily due to lower retail segment gross margin rate. Retail   segment gross margin rate was down 290 basis points to 43.7%. The   decline was primarily due to a 180 basis point decrease in retail   clothing gross margin rate driven by increased promotional   activity versus last year and a 90 basis point deleveraging of   our occupancy costs.",
    "Turning to expenses, advertising expense decreased $5 million   and was down 50 basis points as a percent of sales to 4.2%,   reflecting a shift from broadcast to online spend as we optimize   channel mix as well as a shift of some marketing spending to Q3.   SG&A decreased $9 million largely due to lower incentive and   share based compensation expense. As a percent of sales, SG&A   was flat at 29.4%. Operating income of $71 million compared to   $93 million last year. As a percent of sales, operating income   decreased 220 basis points to 9%. Net interest expense was $18   million, down $3 million compared to last year, reflecting a   year-over-year reduction in total debt.",
    "The effective tax rate was 21.2% compared to 23.9% last year,   and second quarter diluted earnings per share were $0.82 compared   to a $1.07 last year. Turning now to the balance sheet and cash   flow. We ended the quarter with total liquidity of $421 million,   which includes $402 million available on the revolving credit   facility and $19 million of cash.",
    "At quarter end, inventories were up $60 million or 8% versus   last year. The majority of the increase is from higher levels of   raw materials, including fabric. While fabric inventory is higher   than planned. It is current and in support of basic replenishment   product. Within finished goods, an inventory increase in Men's   Wearhouse was largely offset by a decrease at Joseph A. Bank. The   increase at Men's Wearhouse was associated with strategic   investments in polished casual categories, including sport coats,   sportswear and shoes, a pull forward, of fall receipts and lower   sales than planned in the suits division. Importantly, the   quality of finished goods inventory as measured by inventory age   is significantly improved at both Men's Warehouse and Joseph A.   Bank versus last year. Debt at quarter end was approximately $1.2   billion, down $62 million versus a year ago. On a trailing 12   month basis, debt to EBITDA was 3.9 times. As I mentioned   previously, paying down debt continues to be a high priority.",
    "Year-to-date cash flow from operations was $33 million   compared to $198 million last year. The decrease reflects lower   ne   t earnings    , an increase in inventories and rental product purchases and   changes in accounts payable and accrued expenses, primarily due   to timing. First half capital expenditures were $39 million, up   $14 million versus last year and consistent with plan. While we   still expect a modest increase in full year CapEx versus last   year's $82 million, we will continue to react responsibly to   conditions and opportunities in the business. With respect to   real estate, during the quarter, we closed a net seven stores   consisting of six Joseph A. Bank stores and one Men's Wearhouse   and Tux store. The total number of stores at quarter end was   1,455.",
    "Turning now to guidance, as we discussed last quarter, our   plan is to continue to provide quarterly guidance for the   remainder of this fiscal year. We expect third quarter earnings   per share of $0.40 to $0.45, excluding the impact of any share   repurchases. Our third quarter guidance assumes the following.   For comp sales, we expect Men's Wearhouse down 3% to 5%, Joseph   A. Bank down 2% to 4%, K&G down 2% to 4% and Moores down 4%   to 6%. We expect rental comp to be down about 6% as we lapped   last year's big vanity wedding date in August.",
    "We expect an effective tax rate of 23% to 24%. With respect to   real estate, we expect net closures of seven stores across both   Men's Wearhouse and Joseph A. Bank. And finally, this outlook   excludes expected costs for third party domain experts and other   options associated with our cost savings and operational   excellence programs.",
    "Before I turn the call back to Dinesh, I want to give an   update on where we are in delivering against our multi-year cost   savings and operational excellence program.",
    "During the first half of 2019, we leveraged the expertise of a   third party to help us analyze large elements of our cost   structure and make recommendations for improvement. We've already   implemented some of these cost savings measures. That said, the   bigger opportunities require thoughtful and rigorous analysis to   ensure we continue to deliver a superior customer experience.",
    "While we still have work to do to assess their impact on our   business, we feel good about the progress we are making. We have   identified the following major areas of cost savings and   efficiencies. First, marketing, we've begun implementing a more   effective marketing mix as we shift from broadcast to digital to   tell our brand stories which over time we expect will be   reflected in reduced spending relative to sales. Second store   footprint. We've previously discussed that we believe we have an   opportunity to rethink the number of stores in the fleet and the   location of those stores and to do so in an analytically rigorous   manner. By the end of this fiscal year, we will complete a   comprehensive fleet analysis. Given over 98% of our stores   deliver a positive four wall contribution, this is much more   complex than just clothes, money, losing stores. We are working   with a third party to build sophisticated models that will help   us make decisions that maximize cross brand cross-channel market   level profitability. Third, supply chain. In the second quarter,   we consolidated our Canadian infrastructure by closing one of our   two distribution centers. The closed distribution center is an   owned facility and was recently listed for sale, the proceeds   from which will be applied to our updated capital allocation   framework.",
    "In closing, while there is more work to do, we are making good   progress and I'm encouraged by the potential to take significant   cost out of the business. In the meantime, we are focused on   shareholder value creation through investing in our growth   strategies, tightly managing expenses, strengthening our balance   sheet and repurchasing stock. Thank you. And now I'll turn the   call back to Dinesh to wrap up.",
    " Dinesh Lathi    --   President and Chief Executive Officer ",
    "Thanks, Jack. To wrap up, on our last call, I indicated that   we were on a journey to transform our customer facing experience   to one that can generate sustainable and profitable growth, and   that we would continue to execute and invest in a focused manner   with a clear goal of continuing to generate cash while we   transform the experience.",
    "Transformations take time. And we have much work ahead of us   to reinvigorate our topline performance. However, as you've heard   on this call, we are seeing the early signs of customer response   to our transformational strategies of providing personalized   products and services, inspiring and seamless experiences in and   across every channel and brands that stand for more than just   price.",
    "We are launching new, personalized and innovative products for   fall. We are driving more traffic to enhance e-commerce   experience and we continue to shift more advertising spend from   broadcast to digital, where we are seeing positive return on   investment as we reach customers and more relevant channels. And   while we work to scale these and other transformative initiatives   into reliable sources of growth and profit, we are delivering on   and remain committed to focused investment and execution that   generates cash.",
    "Meeting our financial commitments while making healthy   progress against our transformation roadmap is the result of our   team members recognizing that this is not business as usual and   not accepting the status quo. They are changing the way the   company executes for the better by being anchored in and obsessed   with the customer by investing for long term and sustainable   value creation by an analysis to guide decisions and by moving   with an urgency that reflects our conviction and confidence in   our ability to own the customer's loyalty and advocacy. I'm   incredibly proud of the progress the team has made despite the   challenging retail environment and couldn't be more excited about   the positive customer response we are seeing and what it means   for the journey ahead. With that, let's open the line for   questions.",
    " Operator ",
    "At this time, we will be conducting a question answer   session.",
    "[Operator Instructions]",
    "Our first question is from Susan Anderson, B. Riley FBR.   Please proceed with your question.",
    " Luke Hatton    --   B. Riley FBR -- Analyst ",
    "Good afternoon. This is Luke Hatton on for Susan. So you   talked about the increased promotional activities in the retail   clothing line being one of the main drivers of the gross margin   deleverage. I was wondering if you could provide a more detail on   was this promotional activity similar across the brands and then   sort of how did it track against your expectations coming into   the quarter?",
    " Dinesh Lathi    --   President and Chief Executive Officer ",
    "Hi, it's Dinesh, I'll take that one. Yeah as far as the way it   tracked across the quarter, you'll remember when we provided the   Q2 guidance, a couple of the inputs that we were using to form   that guidance were were both traffic and what we were seeing in   the promotional environment at that time. And as you saw with our   results coming in line with guidance that we provided, I   characterized the environment as promotional, but not out of line   with what our expectations were. And that's one of the reasons we   were able to deliver within guidance.",
    "As far as within the brand themselves, I wouldn't characterize   them as meaningful differences in terms of each brand being more   or less promotional than the other. I'd say the promotional   activity was similar across both brands and consistent with what   we saw last year. Although we continue to and will continue to   push on testing new handles and new price points. But the   frequency was similar to last year.",
    " Luke Hatton    --   B. Riley FBR -- Analyst ",
    "Got it, thank you. And then sort of looking out into the third   quarter, I know you don't provide specific gross margin or   SG&A guidance, but given the similar level of comp declines,   should we be thinking about that in a sort of tracking the same   way for the third quarter here?",
    " Dinesh Lathi    --   President and Chief Executive Officer ",
    "Yeah, I think that's fair. Our guidance for Q3 combines a   number of inputs. But one is obviously the traffic trends that   we've observed for the start of the quarter. Another is our view   of what the promotional environment will be like. And then the   third is the timing of certain strategic cost savings and   customer facing initiatives reaching scale. As far as the   promotional activity and the traffic as I think, those were   similar to what we were seeing in Q2.",
    " Luke Hatton    --   B. Riley FBR -- Analyst ",
    "Got it. And if I can just sneak in one quick one. So on real   estate initiative that you just spoke on, can you just give us a   sense of sort of what the average lease term looks like in the   portfolio right now and if you're seeing any sort of rent   concessions from landlords in your recent discussions? Thank   you.",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "Yeah. Hi, Luke. This is Jack. So lease terms vary by brand. I   would say in our Men's Wearhouse business, those terms tend to be   a little bit longer in Joseph A. Bank, probably a little bit   shorter where we're doing more short term renewals. But I would   remind you that every year about 15% to 20% of our fleet comes up   for lease action. And so we've got a fairly high degree of   flexibility to impact the fleet on a regular basis.",
    " Luke Hatton    --   B. Riley FBR -- Analyst ",
    "Great. Thank you and good luck next quarter.",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "Thank you.",
    " Operator ",
    "Our next question is from Paul Trussell, Deutsche Bank. Please   proceed with your question.",
    " Paul Trussell    --   Deutsche Bank -- Analyst ",
    "Good afternoon. I wanted to -- just maybe dig a little bit   more there on the third quarter guidance. You spoke positively   about some some green shoots you've seen in regards to some of   your initiatives. Just maybe reconcile for us, you know, a very   similar cadence of comps across each of the banners as we think   about the third quarter.",
    " Dinesh Lathi    --   President and Chief Executive Officer ",
    "Hey Paul, it's Dinesh. Thanks for the question. As you think   about the green shoots that we talked about and that comp   guidance we gave for Q3, I guess I'd start by reminding you that   we are in the midst of a transformation and the transformation   transformations take time. We're approaching this with a test and   learn mindset. That means we're running experiments at a small   number of stores that won't impact the financial results, whether   the test is a winner or loser. The reason we're so excited is   because we're starting to see signs of positive customer response   to a lot of these tests, whether they be in merchandising stores,   e-commerce or marketing. It's the scaling of these tests that's   going to drive the top and bottom line impact. And some of them   like e-commerce, you'll be able to scale very quickly. And that's   one of the reasons we talked about the growth we're seeing in the   e-commerce business and what we're so excited about. Others like   stores or new merchandise, those are going to take more time   given things like production lead times and the nature of   physical store rollouts and so that the impact they have will be   happening later. What we did say though also was while the   customer facing transformation is taking place, we've also   committed to really being focused about our execution and where   we're investing with an eye toward generating cash. And that   includes things that can have a nearer term impact on the   bottom-line, like the cost savings initiatives that Jack   discussed, as well as continuing to get sharper on our basic   business practices, whether that's things like pricing or   buying.",
    "And so that the guidance for Q3, particularly at the comp   level, reflects both of those things, the nature and timeline of   transformations and the fact that we continue to get sharper in   our execution and we'll continue to keep you posted on our   progress.",
    " Paul Trussell    --   Deutsche Bank -- Analyst ",
    "Thank you for that color. And maybe you can just spend a   minute giving a bit more detail on the capital allocation   decision made here, especially as it relates to the dividend   decision and also help us understand what -- the decisions you're   going to -- how you're going to decide to when to buy stock   versus paying down debt. Thank you.",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "Yeah. Hi, Paul. This is Jack. So as I mentioned in my prepared   remarks and given where the stock prices and the dividend yield,   we strongly believe that there's a more efficient way of   deploying capital than through the dividend. Want to make it   clear that funds freed up from the dividend, as you mentioned   will be deployed into a mix of share repurchases and accelerated   debt reduction. And also just to make clear that the funds that   we received from the sale of corporate apparel will be entirely   will be entirely applied to debt reduction. In terms of how we   will toggle between those two opportunities, you know, we'll   consider a number of variables in deciding how to allocate funds   between the two. I would say given our transformation strategies,   the confidence we have in them and our assessment of their risk   adjusted outcomes, we do believe that the stock is undervalued   based on a DCF methodology and we will continue to look at where   the stock is relative to those to that valuation, as well as   where the bonds and the term loan are trading relative to one   another to make that decision and it's a decision that we will   obviously be revisiting frequently as we move through the months   ahead.",
    " Paul Trussell    --   Deutsche Bank -- Analyst ",
    "Got it. You know, looking at Moores and K&G, you know,   those are segments we spent a little bit less time speaking to,   maybe just remind us what's the connectivity there between those   divisions and MW and banks? How should we view those businesses   in terms of core assets and just kind of looking under the hood,   you know, talk about some of the trends and initiatives going on   within those businesses.",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "Paul, first, with respect to what you talked about on core   businesses and in prior calls as you know we've talked about the   fact that we saw synergies associated with operating our Men's   Wearhouse, Joseph A. Bank, Moores and K&G consumer retail   businesses and that we did not see synergies associated with   operating the dry cleaning business or the corporate apparel   business. We've obviously sold both the dry cleaning business and   the corporate apparel business. But our view with respect to our   consumer retail businesses hasn't changed. We continue to see   synergies associated with operating the Men's Wearhouse, Joseph   A. Bank, Moores and K&G. And so those remain core businesses.   And as far as the initiatives and when we talk about the various   e-com initiatives, marketing initiatives, those are things that   are being leveraged across the portfolio, merchandising   initiatives, and again, that's just a further example of the fact   that there are synergies in operating these four different retail   businesses.",
    " Paul Trussell    --   Deutsche Bank -- Analyst ",
    "Thank you. And lastly from me, just as we think about SG&A   and advertising dollars, down quite a bit in 2Q. Maybe just hold   our hand a little bit more as we think about, you wanted to make   some maybe strategic investments, but also obviously still   looking at different ways to save on costs. How should we think   about these line items going forward?",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "Sure Paul. So this is Jack again. As you mentioned, we don't   guide on either advertising spend or SG&A. But to be helpful,   let me start with advertising. We expect to see this continued   mix shift from broadcast to online digital and that obviously   provides some efficiencies. But as I mentioned in my comments,   some of the Q2 save versus versus last year was pushed into Q3.   So I wouldn't expect as much a leverage in Q3 advertising expense   as you saw in Q2. With regard to SG&A, we'll continue to see   dollar savings versus last year from some of those same items   like incentive compensation and also, you know, the other cost   savings actions that we've taken that are outside of some of   these bigger strategic actions, for which we're still doing some   work on. But, in the areas of non merchandise procurement, our   international shipping, travel and entertainment, these are all   areas that we've attacked this year. Those savings help offset   some organic cost increases in the business. But as I look to Q3,   I would expect, sort of flattish dollars in SG&A, but   deleverage given the lower sales.",
    " Paul Trussell    --   Deutsche Bank -- Analyst ",
    "Thanks for the color. Best of luck.",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "Thanks, Paul.",
    " Operator ",
    "Our next question is from Carla Casella, J.P. Morgan. Please   proceed with your question.",
    " Carla Casella    --   J.P. Morgan -- Analyst ",
    "Hi. One more question on the capital allocation first on --   did you give an actual leverage target? You mentioned your focus   on keeping leverage neutral or bringing it down, but did you give   the actual leverage target or timeframe?",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "Yeah. So Carla, this is Jack. Our leverage target of getting   to a debt to EBITDA ratio of three times in the medium term is   unchanged. That's still our target. As I mentioned, that ratio   has creeped up a little bit this year with the softer business   performance, but we are still focused on getting to that three   times in the medium term.",
    " Carla Casella    --   J.P. Morgan -- Analyst ",
    "Okay. And then on your third quarter guidance, that excludes   corporate apparel, correct?",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "The third quarter guidance excludes corporate apparel.   Correct.",
    " Carla Casella    --   J.P. Morgan -- Analyst ",
    "Okay. And in my -- if I'm looking at given the EPS guidance   you gave that to me looks like it implies EBITDA in the down low   $70 millions. Is that accurate?",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "Yeah, we don't guide to EBITDA. But certainly I think given   the components that we've shared around EPS and the tax rate and   some of the comments I've made around, you know, some of the   other items, I think that you can probably model that number.",
    " Carla Casella    --   J.P. Morgan -- Analyst ",
    "Okay. And then you now include rental. I'm assuming that   includes both tux and suit. Can you give us some sense for how   much of that rental income is suit versus tux at this point? And   is there any major difference between those two business in term   of economic standpoint?",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "Yeah. I don't have the exact numbers off the top of my head,   Carla. But within the rental business, it is still predominantly   a tux business, not a suit rental business. And I am not aware   that the economics between those -- between renting a suit and   renting a tux are very different.",
    " Carla Casella    --   J.P. Morgan -- Analyst ",
    "Okay. And then just one cash flow question. There's a there's   a big -- about a $100 million use of cash in you working capital   that for other liabilities. What is that related to? I was   assuming it has something to do with the lease liability changes,   which has another offset in the cash flow statement. But just   wondering if there's something else going on there in that other   liabilities line items.",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "No, I think you've captured -- it's the implementation of   lease accounting and to your point, you should see an offset for   that elsewhere in the cash flow statement.",
    " Carla Casella    --   J.P. Morgan -- Analyst ",
    "Okay. And one more debt reduction question. So you you   mentioned that the $62 million from the corporate apparel will go   toward debt reduction. What are your options in terms of reducing   debt? Do you have to buy back in the market and what's your   thought on term loans versus bonds given where they're   trading?",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "Sure. So we have the option of both repurchasing the notes on   the open market as well as executing a call, as you know, at a   premium of 1.0175 [Phonetic]. So we have the option of doing   either of those in terms of the senior notes. In terms of   thinking about the term loan versus the notes, I would say at   current prices, the yields on those instruments are pretty   comparable. And obviously the notes come due in July 2022,   whereas the term loan we've extended to April of 2025. So I think   our bias would be given the similar yields, our bias would be on   the shorter maturity senior notes.",
    " Carla Casella    --   J.P. Morgan -- Analyst ",
    "Okay. Great. Thank you.",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "Thank you.",
    " Operator ",
    "Our next question is from Janet Kloppenburg, JJK Research.   Please proceed with your question.",
    " Janet Kloppenburg    --   JJK Research -- Analyst ",
    "Hi, everybody. Just a couple of questions on the suit   business. Sounds like custom is really strong. Is the promotional   activity you're talking about in the off the rack suit business?   And Dinesh, do you think that's coming more from the lack of   demand for suits because of the casualisation trend or because   department stores or off price retailers are trying to gain share   and using price as a mechanism. And then I had a follow-on.",
    " Dinesh Lathi    --   President and Chief Executive Officer ",
    "Yeah, I'll take the second one, Janet. Then you're gonna have   to remind me of the first one, what you're asking about on   custom. But as far as the promotional activity, yeah, we are   seeing heavy promotional activity in suits. And that is something   that we saw in Q2. That's something that informed our Q2 guide   and it's something that we actually saw materialize through the   quarter, and it's also influencing our Q3 guide. That is -- it's   going to be driven in part by traffic, which we've talked about   is it remains challenged I'd say for retail as a whole. And then   also you've met -- you referenced correctly this trend of   casualisation which is obviously -- it works against off the rack   suits. I would mention, though, that there is also a trend toward   personalization. And given that we're playing in custom suits,   that's actually a trend that helps us and it's one of the drivers   behind the healthy growth. We continue to see in our custom   suiting business, even while that business is tracking at a multi   $100 million scale.",
    " Janet Kloppenburg    --   JJK Research -- Analyst ",
    "Okay. And then in terms of the inventory, it sounds like it's   a little heavy at the Men's Warehouse, maybe the content is   skewed more to suits Jack, I think that's the way you said it in   some finished goods as well. How do you see that working out,   getting in line with where it should be? And should we assume   that the gross margin -- retail segment gross margin compression   we saw in the second quarter is likely to continue for the   remainder of the year?",
    " Dinesh Lathi    --   President and Chief Executive Officer ",
    "I get it. I'll pick the first part of that as far as inventory   is impacting the gross margin. As Jack indicated in his prepared   remarks, the inventories, while higher than last year, are also   of a higher quality as measured by ageing. And he also indicated   a meaningful portion of those were associated, a meaningful   portion of the increase I should say is associated with raw   materials for basic replenishment program. So because of the   nature of that inventory, we haven't modeled in any extraordinary   promotional activity in Q3, meaning our promotional efforts in Q3   will continue to be guided by the competitive environment we need   to participate in and not by the current state and levels of our   inventory.",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "Yeah. And Janet, this is Jack. I would just add to that. So   just look looking forward, as you know, we don't guide to   inventory, but to be helpful, I would say we expect some   improvement in the third quarter -- in the end of third quarter   inventories. So we'll expect -- I would expect that increase   versus last year to come down and therefore for the spread   between inventory and sales to improve and then to expect more   significant improvement by the end of the fourth quarter.",
    " Janet Kloppenburg    --   JJK Research -- Analyst ",
    "And do you see this gross margin pressure moderating as your   inventory content skews more to the sport coats and the just   casual, which I think you're expecting to really be impactful on   the spring season?",
    " Dinesh Lathi    --   President and Chief Executive Officer ",
    "Yeah, the gross margins are obviously lower in our polished   casual segments than they are in our suit segments. And so   obviously as the mix shifts and that'll impact gross margin. The   offset to that, though, Janet, is the frequency associated with   polished casual purchases is obviously much faster and much   higher than that associated with foods. And so even as you might   see an impact on gross margin, we think there's an opportunity   for SG&A leverage associated with higher transaction velocity   in polished casual.",
    " Janet Kloppenburg    --   JJK Research -- Analyst ",
    "So, should we expect gross margins to continue to be under   pressure for the next couple of quarters? And am I right that you   inventory content will be where you want it to be in the spring   season?",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "Yes, so with regard Janet to gross margin, I would expect many   of the gross margin headwinds that we experienced in the second   quarter will continue into the third quarter. Dinesh talked about   some of these just in terms of the level of promotional intensity   and competitiveness out in the market, and we expect that to   continue with the increased penetration of custom, as you   remember that's a lower gross margin rate at higher gross margin   dollars. And obviously with the comps that we've guided to, there   will be some occupancy deleverage. So I would expect that the   gross margin headwinds that we saw in Q2 to largely carry into Q3   and that's been contemplated in our guidance.",
    " Janet Kloppenburg    --   JJK Research -- Analyst ",
    "Okay. Thank you so much.",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    "Thank you.",
    " Operator ",
    "We have reached the end of the question and answer session.   And I will now turn the call back over to Dinesh Lathi, President   and CEO for closing remarks.",
    " Dinesh Lathi    --   President and Chief Executive Officer ",
    "Thank you everyone for joining us today. We appreciate your   ongoing interest in and support for the important work of   transforming our business. We look forward to sharing our   continued progress with you next quarter. Thank you.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 54 minutes ",
    " Julie MacMedan    --   Investor Relations ",
    " Dinesh Lathi    --   President and Chief Executive Officer ",
    " Jack P. Calandra    --   Executive Vice President, Chief Financial Officer ",
    " Luke Hatton    --   B. Riley FBR -- Analyst ",
    " Paul Trussell    --   Deutsche Bank -- Analyst ",
    " Carla Casella    --   J.P. Morgan -- Analyst ",
    " Janet Kloppenburg    --   JJK Research -- Analyst ",
    " More TLRD analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than Tailored Brands   Inc     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Tailored Brands   Inc wasn't one of them! That's right -- they think   these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:23:25"
}