{
  "url": "https://www.nasdaq.com/article/exxon-ceo-risks-fueling-unholy-investor-alliance-20190904-01159",
  "title": "Exxon CEO risks fueling unholy investor alliance - Nasdaq.com",
  "text": [
    "By Antony Currie",
    "(The author is a Reuters Breakingviews columnist.)",
    "NEW YORK, Sept 4 (Reuters Breakingviews) - Executives often signal when they are on the defensive, such as blaming short sellers. Sidestepping the elephant in the room is as sure a tell as any. Exxon Mobil  Chief Executive Darren Woods has done just that by rationalizing the oil giant's business-as-usual strategy in the face of climate risks.",
    "But he used those arguments to justify doing little to change the company's business. Woods argues the world needs oil production to increase almost 8% a year, and gas by some 6%, to satisfy the demands of a growing population because alternatives like wind and solar will neither be big nor reliable enough to do the job. But that's a circular logic, as new technologies always need investment to scale up. And it punts responsibility for carbon emissions away from fossil-fuel companies and onto the people creating the energy demand.",
    "Such a stance is likely to enrage activist shareholders who have for years tried to force Exxon to disclose the potential impact of climate change on its business. Some may be spoiling for a fight after the company blocked the New York state pension fund and the Church of England from putting a resolution on climate preparedness to a vote at this year's annual meeting.",
    "Owners who focus on traditional financial metrics have little reason to be impressed, either. Exxon's total return to shareholders has been in the red over the past one, three and five years. That caused it to drop out of the top 10 companies by value in the S&P 500 Index last month, the first time that has happened since the index was created 90 years ago. And its return on capital employed may hit just 8% in 2019, according to Refinitiv data.",
    "That's not indicative of a company that has done a good job of investing - and may persuade these shareholders to forge an unholy activist alliance with their climate-focused brethren.",
    "\nOn Twitter\n",
    "CONTEXT NEWS",
    "- Exxon Mobil Chief Executive Darren Woods told investors on Sept. 4 that he is open to buying a driller in the Permian Basin of West Texas and New Mexico. Speaking at an industry conference, he said \"if there is an opportunity to acquire something that brings value, unique value to Exxon Mobil, we'll be in a position to transact on that.\"",
    "- He also said that while \"society wants less carbon emissions...sources of new energy must be reliable and affordable.\" Citing past examples from wind and solar power to mobile phones to oil, Woods also said that \"technologies can take decades to fully develop and gain widespread adoption.\""
  ],
  "published_datetime": "2019-09-04 05:45:00"
}