{
  "url": "https://www.nasdaq.com/article/us-manufacturing-shrinks-sector-etfs-that-grew-cm1207455",
  "title": "U.S. Manufacturing Shrinks: Sector ETFs That Grew - Nasdaq.com",
  "text": [
    " The ISM Manufacturing PMI in the United States dropped to 49.1 in August 2019 from 51.2 in the previous month, falling shy of market expectations of 51.1. The latest reading marks the first month of contraction in the manufacturing sector in more than three years  . A 35-month long stretch of expansion came to a halt in August. In fact, the momentum of expansion slowed in the last four months  . The new order index slumped 3.6 points from a month earlier to 47.2, and the employment index fell 4.3 points to 47.4. In addition, the production index slipped 1.3 points to 49.5, and the supplier deliveries index dropped 1.9 points to 51.4, per trading economics  . The U.S.-China trade war has been responsible  for such a debacle as there was steep contraction in new export orders. Supply chain adjustments as a result of moving manufacturing base from China have probably been a drag  on manufacturing data. Overall sentiment touched its lowest level in 2019, per tradingeconomics. Investors should note that the China government enacted higher tariffs on Sep 1 on the proportion of goods that only make up \"about  one third of the more than 5,000 product lines  listed in the latest announcement.\" Majority of the duties will be implemented on Dec 15. Meanwhile, Trump said that he would \"raise tariffs on $250 billion worth of Chinese exports to  30% from 25% in October  .\" Moreover, tariffs planned on a further $300 billion in Chinese goods have been revised to 15% from 10%. Still, out of the 18 manufacturing industries, nine reported growth in August. Below we highlight a few such sector ETFs.  Vanguard Industrials Index Fund ETF Shares ( VIS )  The machinery industry has also seen growth. The fund has considerable weights in the machinery, equipment and engineering products and should benefit from the August data (read: Mixed Q2 Earnings Releases Put Spotlight on Industrial ETFs  ).  Consumer Discretionary Select Sector SPDR   Fund  XLY  Textile Mills and Furniture & Related Products were among the ones that have seen growth in the month. The underlying Consumer Discretionary Select Sector Index seeks to provide an effective representation of the consumer discretionary sector of the S&P 500 Index. Home Depot - the world's largest home improvement retailer - takes the second spot in the fund with about 11.29% exposure. So, investors can take a look at this fund (read: ETFs to Buy as Americans' Confidence Nears 19-Year High  ).  Invesco Dynamic Food & Beverage ETF ( PBJ )  Food, Beverage & Tobacco Products recorded growth in the month. This puts focus on PBJ, the fund which comprises stocks of 30 U.S. food and beverage companies. These are companies that are principally engaged in the manufacture, sale or distribution of food and beverage products, agricultural products and products related to the development of new food technologies. Starbucks, Tyson Foods and Hershey are the top three holdings of the fund.  VanEck Vectors Coal ETF  KOL  Petroleum & Coal Products industry saw expansion. The underlying MVIS Global Coal Index tracks the overall performance of companies involved in coal operation, transportation of coal, from production of coal mining equipment as well as from storage and trade. However, the overall outlook for the space is downbeat (read: Worst Sector ETFs of August  ).  Want key ETF info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.   Get it free >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeAd('4','300x250','mktsnews','vanguard','','');  Vanguard Industrials ETF (VIS): ETF Research Reports   VanEck Vectors Coal ETF (KOL): ETF Research Reports   Consumer Discretionary Select Sector SPDR Fund (XLY): ETF Research Reports   Invesco Dynamic Food & Beverage ETF (PBJ): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    "The ISM Manufacturing PMI in the United States dropped to 49.1 in August 2019 from 51.2 in the previous month, falling shy of market expectations of 51.1. The latest reading marks the first month of contraction in the manufacturing sector in more than three years  . A 35-month long stretch of expansion came to a halt in August. In fact, the momentum of expansion slowed in the last four months  .",
    "The new order index slumped 3.6 points from a month earlier to 47.2, and the employment index fell 4.3 points to 47.4. In addition, the production index slipped 1.3 points to 49.5, and the supplier deliveries index dropped 1.9 points to 51.4, per trading economics  .",
    "The U.S.-China trade war has been responsible  for such a debacle as there was steep contraction in new export orders. Supply chain adjustments as a result of moving manufacturing base from China have probably been a drag  on manufacturing data. Overall sentiment touched its lowest level in 2019, per tradingeconomics.",
    "Investors should note that the China government enacted higher tariffs on Sep 1 on the proportion of goods that only make up \"about  one third of the more than 5,000 product lines  listed in the latest announcement.\" Majority of the duties will be implemented on Dec 15.",
    "Meanwhile, Trump said that he would \"raise tariffs on $250 billion worth of Chinese exports to  30% from 25% in October  .\" Moreover, tariffs planned on a further $300 billion in Chinese goods have been revised to 15% from 10%.",
    "Still, out of the 18 manufacturing industries, nine reported growth in August. Below we highlight a few such sector ETFs.",
    " Vanguard Industrials Index Fund ETF Shares ( VIS ) ",
    "The machinery industry has also seen growth. The fund has considerable weights in the machinery, equipment and engineering products and should benefit from the August data (read: Mixed Q2 Earnings Releases Put Spotlight on Industrial ETFs  ).",
    " Consumer Discretionary Select Sector SPDR   Fund  XLY ",
    "Textile Mills and Furniture & Related Products were among the ones that have seen growth in the month. The underlying Consumer Discretionary Select Sector Index seeks to provide an effective representation of the consumer discretionary sector of the S&P 500 Index.",
    "Home Depot - the world's largest home improvement retailer - takes the second spot in the fund with about 11.29% exposure. So, investors can take a look at this fund (read: ETFs to Buy as Americans' Confidence Nears 19-Year High  ).",
    " Invesco Dynamic Food & Beverage ETF ( PBJ ) ",
    "Food, Beverage & Tobacco Products recorded growth in the month. This puts focus on PBJ, the fund which comprises stocks of 30 U.S. food and beverage companies. These are companies that are principally engaged in the manufacture, sale or distribution of food and beverage products, agricultural products and products related to the development of new food technologies. Starbucks, Tyson Foods and Hershey are the top three holdings of the fund.",
    " VanEck Vectors Coal ETF  KOL ",
    "Petroleum & Coal Products industry saw expansion. The underlying MVIS Global Coal Index tracks the overall performance of companies involved in coal operation, transportation of coal, from production of coal mining equipment as well as from storage and trade. However, the overall outlook for the space is downbeat (read: Worst Sector ETFs of August  ).",
    " Want key ETF info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.   Get it free >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 01:00:00"
}