{
  "url": "https://www.nasdaq.com/article/asian-shares-up-as-brexit-hong-kong-progress-lifts-mood-20190904-01216",
  "title": "Asian shares up as Brexit, Hong Kong progress lifts mood - Nasdaq.com",
  "text": [
    "By Stanley White",
    "TOKYO, Sept 5 (Reuters) - Asian stocks perked up on Thursday, as apparent progress in the political crises in Britain and Hong Kong gave investor confidence a shot in the arm, with easing fears of a hard Brexit lifting the battered pound.",
    "Sterling held onto gains against the dollar in Asia after rallying by its most in more than five months on Wednesday as lawmakers voted to prevent Prime Minister Boris Johnson taking Britain out of the European Union without a deal on Oct. 31.",
    "MSCI's broadest index of Asia-Pacific shares outside Japan  was up 0.24%. U.S. Treasury yields extended gains in Asia and the yield curve steepened, both signs that investors were willing to take on riskier assets.",
    "Still, there was scepticism over how long the positive mood would last with Britain's divorce from the EU and political unrest in Hong Kong not yet completely resolved.",
    "\"In a world of negative news, a bunch of things came together and we had something positive,\" said Shane Oliver, head of investment strategy and chief economist at AMP Capital Investors in Sydney.",
    "\"We should see some follow through in Asia. There is reduced risk of a no-deal Brexit, but Brexit is still all over the place. Some protesters in Hong Kong say they're still not satisfied.\"",
    "Shares rallied on Wednesday in New York, with the S&P 500  gaining 1.08%.",
    "U.S. stock futures  fell 0.03% in early Asian trade, but a 1.09% increase in Japan's Nikkei  and 0.33% increase in Australian shares  highlighted the improvement in market sentiment.",
    "The 10-year yield  rose to 1.4758%, while two-year yields  rose to 1.4519%.",
    "The spread between two- and 10-year Treasury yields , the most commonly used measure of the yield curve, rose to its highest since Aug. 21 on Wednesday but narrowed slightly in Asian trade.",
    "The curve inverted on Aug. 14 for the first time since 2007 when long-term yields traded below short-term yields, which is a widely accepted indicator of coming recession.",
    "More than three years since the United Kingdom voted 52-48% to leave the EU, it is still unclear on what terms, or indeed whether, Brexit will take place on the Oct. 31 deadline.",
    "The global economy is already struggling with the threat of recession due to a bruising trade war between the United States and China.",
    "Blocking the path to a no-deal Brexit relieves concern about another potential drag on global growth, but Britain is still headed for a snap election, which could introduce more political uncertainty about who will lead Britain out of the EU. ",
    "Hong Kong leader Carrie Lam on Wednesday withdrew an extradition bill that had triggered months of often violent protests in the Chinese-ruled city, sparking a late rally in Hong Kong stocks.",
    "Traders will watch closely to see whether shares in Hong Kong  are able to extend those gains or whether they fall on concerns about relations with Beijing.",
    "U.S. West Texas Intermediate crude  lost 0.34% to $56.07 per barrel in Asia on Thursday. Crude futures surged 4.3% on Wednesday, the biggest daily gain since July 10, due to positive economic data from China and easing geopolitical concerns."
  ],
  "published_datetime": "2019-09-04 09:01:00"
}