{
  "url": "https://www.nasdaq.com/article/slf-crosses-above-average-analyst-target-cm1210077",
  "title": "SLF Crosses Above Average Analyst Target - Nasdaq.com",
  "text": [
    "In recent trading, shares of Sun Life Financial Inc (Symbol: SLF) have crossed above the average analyst 12-month target price of $43.14, changing hands for $43.27/share. When a stock reaches the target an analyst has set, the analyst logically has two ways to react: downgrade on valuation, or, re-adjust their target price to a higher level. Analyst reaction may also depend on the fundamental business developments that may be responsible for driving the stock price higher - if things are looking up for the company, perhaps it is time for that target price to be raised.      There are 8 different analyst targets contributing to that average for Sun Life Financial Inc, but the average is just that - a mathematical average. There are analysts with lower targets than the average, including one looking for a price of $40.70. And then on the other side of the spectrum one analyst has a target as high as $45.60. The standard deviation is $1.618.  makeArticleAd();  But the whole reason to look at the average  SLF price target in the first place is to tap into a \"wisdom of crowds\" effort, putting together the contributions of all the individual minds who contributed to the ultimate number, as opposed to what just one particular expert believes. And so with SLF crossing above that average target price of $43.14/share, investors in SLF have been given a good signal to spend fresh time assessing the company and deciding for themselves: is $43.14 just one stop on the way to an even higher  target, or has the valuation gotten stretched to the point where it is time to think about taking some chips off the table? Below is a table showing the current thinking of the analysts that cover Sun Life Financial Inc:       The average rating presented in the last row of the above table above is from 1 to 5 where 1 is Strong Buy and 5 is Strong Sell. This article used data provided by Zacks Investment Research via Quandl.com  . Get the latest Zacks research report on SLF - FREE  .   10 ETFs With Most Upside To Analyst Targets »  ",
    "  10 ETFs With Most Upside To Analyst Targets » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:20:42"
}