{
  "url": "https://www.nasdaq.com/article/rising-pe-an-often-ignored-trick-to-pick-5-winning-stocks-cm1210858",
  "title": "Rising P/E: An Often-Ignored Trick to Pick 5 Winning Stocks - Nasdaq.com",
  "text": [
    "Trying hands at bargain stocks that have a low price-to-earnings (P/E) ratio is a common practice. The perception is that the lower the P/E, the higher will be the value of the stock. This inference is drawn on the simple logic that a stock's current market price does not justify (is not equivalent to) its higher earnings and therefore has room to run.",
    "But have you ever given it a thought that stocks with a rising P/E can also be worth buying. We'll tell you why this often-overlooked approach may go a long way to cherry pick some solid stocks. ",
    "Why Rising P/E a Valuable Tool?",
    "Investors should note that stock price moves in tandem with earnings performance. If earnings come in stronger, the price of a stock shoots up. Solid quarterly earnings and the forward guidance boos t earnings forecasts, leading to stronger demand for the stock and an uptrend in its price.",
    "So, if the price is rising steadily, it means that investors are assured of the stock's fundamental strength and expect some strong positives out of it. Suppose an investor wants to buy a stock with a P/E ratio of 30, it means that he is willing to shell out $30 for only $1 worth o f earnings . This is because the investor expects earnings of the company to rise at a faster pace in the future on the back of strong fundamentals.",
    "Also, studies have revealed that stocks have seen their P/E ratios jump over 100% from their breakout point in the cycle. So, if you can pick stocks early in their breakout cycle, you can end up seeing considerable gains.",
    "The Winning Strategy",
    "In order to shortlist stocks that are exhibiting an increasing P/E, we chose the following as our primary screening parameters.",
    "EPS growth estimate for the current year is greater than or equal to last year's actual growth",
    "Percentage change in last year EPS should be greater than or equal to zero",
    "(These two criteria point to flat earnings or a growth trend over the years.)",
    "Percentage change in price over four weeks greater than the percentage change in price over 12 weeks",
    "Percentage change in price over 12 weeks greater than percentage change in price over 24 weeks",
    "(These two criteria show that price of the stock is increasing consistently over the said timeframes.)",
    "Percentage price change for four weeks relative to the S&P 500 greater than the percentage price change for 12 weeks relative to the S&P 500",
    "Percentage price change for 12 weeks relative to the S&P 500 greater than the percentage price change for 24 weeks relative to the S&P 500",
    "(Here, the case for consistent price gains gets even stronger as it displays percentage price changes relative to the S&P 500.)",
    "Percentage price change for 12 weeks is 20% higher than or equal to the percentage price change for 24 weeks, but it should not exceed 100%",
    "(A 20% increase in the price of a stock from the breakout point gives cues of an impending uptrend. But a jump of over 100% indicates that there is limited scope for further upside and that the stock might be due for a reversal.)",
    "In addition, we place a few other criteria that lead us to some likely outperformers.",
    "Zacks Rank less than or equal to 2: Only companies with a Zacks Rank #1 (Strong Buy) and Zacks Rank #2 (Buy) can get through.",
    "Average 20-day Volume greater than or equal to 50,000: High trading volume implies that the stocks have adequate liquidity.",
    "Just these few criteria narrowed down the universe from over 7,700 stocks to just 57.",
    "Here are five out of the 57 stocks:",
    "Columbia Sportswear Company (COLM): The Zacks Rank #2 (Buy) company is a global leader in design, sourcing, marketing and distribution of active outdoor apparel and footwear, with operations in North America, Europe and Asia. The fund belongs to a top-ranked Zacks industry (top 11%). You can see the complete list of today's Zacks #1 Rank stocks here .",
    "Fossil Group Inc. (FOSL):  This Zacks Rank #2 company is involved in designing, marketing and distribution of consumer fashion accessories. The stock belongs to a top-ranked Zacks industry (top 22%).  ",
    "Alexion Pharmaceuticals Inc. (ALXN): Thisis a Zacks Rank #2 global biopharmaceutical company. The stock hails from a top-ranked Zacks industry (top 31%). ",
    "Eli Lilly and Company (LLY): Thishealthcare company belongs to a top-ranked Zacks industry (top 17%). It carries a Zacks Rank #2.",
    "Shoe Carnival Inc. (SCVL): This is one of the nation's largest family footwear retailers, offering a broad assortment of moderately priced dress, casual and athletic footwear for men, women and children with emphasis on national and regional name brands. The stock comes from a top-ranked Zacks industry (top 22%) and carries a Zacks Rank #2.",
    "You can get the rest of the stocks on this list by signing up now for your 2-week free trial to the Research Wizard and start using this screen in your own trading. Further, you can also create your own strategies and test them first before taking the investment plunge.",
    "The Research Wizard is a great place to begin. It's easy to use. Everything is in plain language. And it's very intuitive. Start your Research Wizard trial today. And the next time you read an economic report, open up the Research Wizard, plug your finds in, and see what gems come out.",
    "Click here to sign up for a free trial to the Research Wizard today .",
    "Disclosure: Officers, directors and/or employees of Zacks Investment Research may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material. An affiliated investment advisory firm may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material.",
    "Disclosure: Performance information for Zacks' portfolios and strategies are available at:https://www.zacks.com/performance .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 06:29:00"
}