{
  "url": "https://www.nasdaq.com/article/us-officials-urge-caution-as-solomons-considers-cutting-taiwan-link-20190912-00039",
  "title": "U.S. officials urge caution as Solomons considers cutting Taiwan link - Nasdaq.com",
  "text": [
    "By Jonathan Barrett",
    "SYDNEY, Sept 12 (Reuters) - U.S. officials have warned the Solomon Islands to be wary of Chinese funding promises and not to be pressed into cutting ties with Taiwan, in comments highlighting increasing big-power competition for influence in the South Pacific.",
    "The U.S. warnings were made this week in the Solomons capital of Honiara, on the island of Guadacanal, in comments to reporters, after several of the island nation's senior lawmakers said they wanted to switch their diplomatic links to Beijing from Taiwan. ",
    "The U.S. officials, in their comments, did not explicitly call for the retention of the Taiwan alliance, according to a recording obtained by Reuters, but they urged caution.",
    "Catherine Ebert-Gray, the U.S. Ambassador to Papua New Guinea, Solomon Islands and Vanuatu said the decision the Solomons Islands faced was tough and \"very, very important\".",
    "\"We want to encourage the prime minister and all the people of Solomon Islands and members of parliament to not feel pressured in making this decision, to ask for details about funding, about projects, whether these are loans or they're grants,\" Ebert-Gray said.",
    "The Solomons, a former British protectorate, an archipelago of just over 600,000 people, has been investigating a possible switch in ties since a general election in April.",
    "China, which claims self-ruled and democratic Taiwan as its own and views it as a wayward province, has offered the Solomons financial assistance if it were to switch. ",
    "The United States has criticised China for pushing poor countries into debt, mainly through lending for large-scale infrastructure projects, and accused China of using \"predatory economics\" to destabilise the Indo-Pacific region.",
    "China denies that. ",
    "\"When we come into a country we look at how we can partner through a grant system - we don't do loans,\" Washington-based Ann Marie Yastishock, the deputy assistant administrator, Asia, at the U.S. Agency for International Development (USAID), told the gathering in Honiara.",
    "The United States has traditionally left diplomacy in the South Pacific to its regional partners, including Australia, New Zealand and Japan.",
    "The U.S. officials said they had also met senior Solomons lawmakers, including new Prime Minister Manasseh Sogavare.",
    "'FORCEFUL'",
    "The heads of both a parliamentary task force in the Solomons and a ministerial team convened to talk with Beijing have expressed support for switching diplomatic recognition to Beijing, although there remains opposition among the public and student population. ",
    "The number of nations recognising Taiwan has been dwindling, with El Salvador in Central America, Burkina Faso in West Africa and the Dominican Republic in the Caribbean, all switching to Beijing last year.",
    "China's foreign ministry did not immediately respond to questions. It has declined to comment directly on the Solomon Islands, saying China is willing to have relations with all countries based on the \"one-China\" principle.",
    "Solomon Islands government officials were not immediately available for comment. USAID and the U.S. embassy in Papua New Guinea did not immediately comment.",
    "While the United States upholds the \"one-China\" policy, recognising Beijing and not Taipei, it assists Taiwan, which includes significant sales of arms to the island.",
    "Graeme Smith, from the department of Pacific affairs at The Australian National University, said the Trump administration was more activist than its predecessors in its overt support for Taiwan, especially as China's assertiveness grows.",
    "\"The U.S. has certainly been forceful in being the only country to threaten consequences if countries switch,\" Smith said.",
    "Pacific islands control vast swaths of resource-rich ocean, and strategically located ports, forming a formidable maritime boundary between the Americas and Asia. ",
    "Anti-graft agency Transparency Solomon Islands has also urged caution in changing ties over concerns that the Solomons will not be able to hold firm against Beijing's interests, given the island's lack of suitable governance structures.",
    "Taiwan's representative office in the Solomon Islands said on Wednesday its presence had been a force for good.",
    "\"Many countries in the Pacific, including the Solomon Islands, are proud to be free and democratic,\" it said."
  ],
  "published_datetime": "2019-09-12 01:58:00"
}