{
  "url": "https://www.nasdaq.com/article/3-fast-growing-gaming-stocks-to-buy-for-under-20-cm1206508",
  "title": "3 Fast-Growing Gaming Stocks to Buy For Under $20 - Nasdaq.com",
  "text": [
    "It’s no question that the gaming industry is taking off. According to Newzoo, the global games market is expected to grow from $137.9 billion in 2018 to $180.1 billion in 2021.",
    "With that in mind, investors are looking to capitalize on opportunities within this constantly evolving space. When looking for the most compelling investments in this industry, analysts tell investors that 3 gaming stocks look especially poised to outperform.",
    "Let’s take a closer look at these 3 fast-growing gaming stocks.   ",
    "Glu Mobile develops and publishes mobile games specifically for smartphones and tablets. Given the fact that shares are down 45% year-to-date, some analysts argue this gaming stock is undervalued.",
    "The company’s second quarter earnings results seem to support this argument. On August 1, GLUU reported that it generated $101.9 million worth of bookings, the largest in its history. It also saw its sixth consecutive quarter of adjusted EBITDA profitability as well as launched two new games including WWE Universe and Diner Dash Adventures.",
    "Adding to the good news, GLUU has made significant efforts to expand its user base to include female gamers who are typically underrepresented. It released the Design Home and the Kendall and Kylie game back in 2016, with the company stating that several more games for this target audience are in development.",
    "One analyst points out that GLUU’s strategy of focusing more on games they fully own rather than celebrity licensed properties will pay off in the long-term.",
    "“We believe there are multiple potential positive catalysts for the stock in 2020,” Wedbush analyst Michael Pachter stated. As a result, he reiterated his Buy rating and lowered the price target from $9 to $8 on August 2. The three-star analyst notes that the current share price of $4.44 presents a buying opportunity as he sees 80% upside potential for the stock.",
    "All in all, the rest of the Street remains bullish on GLUU. It boasts a ‘Strong Buy’ analyst consensus and a $9 average price target, suggesting 92% upside potential.",
    "The next gaming stock on our list has also had a bit of a rough going since its May 3 IPO. That being said, the online casino game company still offers investors plenty of upside potential.",
    "Some analysts are picking SciPlay based on the results from its latest quarter. The company announced on August 1 that Q2 revenue reached $118.1 million, up 18% year-over-year which was more than double the market growth rate according to estimates from Eilers and Krejcik. It doesn’t hurt that profits and cash flow also gained year-over-year.",
    "Management attributes this growth to its strong product offerings. Its largest game in terms of revenue, Jackpot Party, performed well with over 28% year-over-year growth. Adding to the good news, three of SCPL’s games are ranked in the top 30 in the Social Casino Category on Apple’s App Store, and six games are ranked in the top 30 on Google Play for Top Grossing Casino Games.",
    "The company has also placed a substantial focus on analytics in an attempt to drive margin improvement.",
    " All of these factors as well as several secular tailwinds in mobile gaming, digital gaming and online gambling should benefit SCPL according to five-star analyst Drew Crum. On August 5, the Stifel Nicolaus analyst reiterated his Buy rating while slightly lowering the price target from $18.50 to $17. Even with the price target cut, Crum believes shares could surge 79% in the next twelve months.",
    "Wall Street appears to mirror the analyst’s sentiment. SCPL has a ‘Strong Buy’ analyst consensus and an $18 average price target, implying 85% upside potential.",
    "Investors like the last gaming stock on our list based on the fact that it isn’t solely relying its past hits such as Assassin’s Creed or Rainbow Six Siege.",
    "The company has tried to avoid ending up in a rut by expanding its game lineup. UBSFY announced that it would be releasing a light-hearted Greek mythology adventure game, Gods & Monsters, at the beginning of next year.",
    "“We cherish our fans that are following our brands like Assassin’s Creed or Ghost Recon going forward. But we feel that it’s also a good moment now to invest into new IPs,” Ubisoft EMEA manager Alain Corre said.",
    "More good news came on June 11 when the company unveiled its Uplay+ game subscription service for PC and Stadia starting at $15 per month. The platform will be released on September 3 and will include access to over 100 games, including the premium versions of the latest releases and their associated add-ons as well as the option for users to be included in every beta and early access program.",
    "All of these positive developments played into KeyBanc analyst Tyler Parker’s decision to resume his coverage of UBSFY with a Buy rating and a €94 price target on July 29.",
    "The rest of Wall Street is on the same page. With 2 Buy ratings vs no Holds or Sells received over the last three months, UBSFY boasts a ‘Moderate Buy’ analyst consensus.",
    "Find analysts’ favorite stocks with the Top Analysts’ Stocks tool ",
    "By Maya Sasson for TipRanks.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:59:44"
}