{
  "url": "https://www.nasdaq.com/article/enough-with-the-hoodies-and-lycra-can-ralph-laurens-sustainability-drive-bring-denim-back-cm1207684",
  "title": "Enough with the Hoodies and Lycra. Can Ralph Lauren’s Sustainability Drive Bring Denim Back? - Nasdaq.com",
  "text": [
    " Just like the Champion and Vans Brands,   Ralph Lauren    (NYSE: RL) is hoping for a second coming in the retail universe,   and it might just happen. Buoyed partly by consumer confidence in   a stronger economy, retail is a booming sector, and brands that   once lagged are now looming large thanks to Gen Z-er's love for   retro. Apparel is currently in the top 20% of the 250-plus industries   that Zacks ranks. And, according to Zacks, the top 50% of   industries that it ranks outperforms the bottom 50% by a factor   of more than 2 to 1. Still, before you go long on Ralph, consider   that the company has a long way to go before it is likely to   claim victory in the competitive retail space.   Image source: Getty imagesmakeArticleAd();   A rebirth of blue  Let's face it, there's only so much lycra and polyester that   one can wear in a season, and denim has been cast aside in a   cruel and crazy hoodie and yoga pant-obsessed decade. Thus, Ralph   Lauren might have a clever and cunning plan by attempting to   revive denim. In August, the company launched a global advertising campaign   focused on denim, titled \"Wear Your Story.\" The concept is based   on the nostalgia of wearing denim for those of us who are,   unfortunately, that old. Advertising features demographic   representatives such as a student, father, mother, and yogi. A \"Family Campaign\" launched in April was similarly   demographic-inclusive highlighting multi-generational and   same-sex couples in the spring 2019 Polo collection. As for denim, new designs are sustainably sourced with   personalized printing to order. The younger crowd will appreciate   the bespoke trend as well as the firm's Better Cotton Initiative,   a step toward sustainably sourcing 100% of the brand's denim and   reducing water use by 20% across all operations and value chain   by 2025. Ralph Lauren is one of 32 leading global fashion textile   companies to commit to a climate, biodiversity, and ocean   pact. Perhaps the biggest and latest coup was highlighting   sustainability in its designs of ball person's uniforms at the   2019 US Open Tennis tournament. Now that was a good choice as far   as marketing initiatives are concerned, and totally aiming at the   right consumer group.  Ralph Lauren is climbing but confusing  Still, Lauren needs to redefine its consumer. And there is a   theory that this might happen just as the Gen Z favorites such as   Champion and    Lululemon    begin    begin to decline. Brands like Vans and Champion have staged a comeback thanks to   the Gen Z's love of social media followers and their influencers.   Whatever brand royalty-think Beyoncé and Jay-Z-are wearing on   Instagram today is next week's cash cow. Ralph Lauren, on the other hand, is side-stepping this   phenomenon and relying on tried and true traditional marketing.   So far, however, the iconic brand has failed to show a   significant uptick in consumer awareness or demand, perhaps due   to a lack of creativity in its typical choice of channels to   reach its market, such as mobile. Another hurdle to overcome is that the brand is also confusing   for consumers. According to Ralph Lauren, it targets the   upper-middle to upper classes who have a sizable disposable   income. The company also touts a clothing range for \"the sportier   end of the spectrum\" (think polo and rugby enthusiasts) while its   lines are \"classic, elegant, and sophisticated\" yet \"formal.\" So, which is it? Sporty or formal? I'm confused. And   emphasizing polo and rugby seems to totally target elites, not   the upper-middle class. So what is the effect of Lauren's new initiatives, and will   they   pay off    if there is a fall-off in athleisure?  Financials and a potential payoff  It turns out that Ralph Lauren is already showing positive   signs. After a 7% decline in revenues in 2019, the company   announced expected   1% growth    for this year at its third-quarter earnings report. Not great.   However, the most recen   t quarterly   report    showed an earnings surprise of 6.63%. Also, expected earnings of $0.93 per share in the third   quarter were actually $1.07, delivering a surprise of 15.05%. For   EPS, the company has surpassed consensus EPS estimates four times   over the past four months. There was also a 21% jump in digital commerce revenue that   compensated for flat brick-and-mortar sales. Most interestingly,   a sign of confidence was a buyback of 400 million shares in the   first three-quarters of fiscal 2019 and an announcement that the   company plans to spend a billion dollars on buybacks through   fiscal 2020. These latest numbers are turning heads. Bottom line, if you find yourself tolerating a long checkout   line to buy a new pair of jeans, consider going long on some   Ralph stock while you're at it. Just check the numbers before you   do.   10 stocks we like better than Ralph Lauren     Corp       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Ralph Lauren Corp wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Caroline Banton      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Lululemon Athletica. The Motley     Fool has a     disclosure policy      .  ",
    "Just like the Champion and Vans Brands,   Ralph Lauren    (NYSE: RL) is hoping for a second coming in the retail universe,   and it might just happen. Buoyed partly by consumer confidence in   a stronger economy, retail is a booming sector, and brands that   once lagged are now looming large thanks to Gen Z-er's love for   retro.",
    "Apparel is currently in the top 20% of the 250-plus industries   that Zacks ranks. And, according to Zacks, the top 50% of   industries that it ranks outperforms the bottom 50% by a factor   of more than 2 to 1. Still, before you go long on Ralph, consider   that the company has a long way to go before it is likely to   claim victory in the competitive retail space.",
    "  Image source: Getty imagesmakeArticleAd(); ",
    "Image source: Getty images",
    "Let's face it, there's only so much lycra and polyester that   one can wear in a season, and denim has been cast aside in a   cruel and crazy hoodie and yoga pant-obsessed decade. Thus, Ralph   Lauren might have a clever and cunning plan by attempting to   revive denim.",
    "In August, the company launched a global advertising campaign   focused on denim, titled \"Wear Your Story.\" The concept is based   on the nostalgia of wearing denim for those of us who are,   unfortunately, that old. Advertising features demographic   representatives such as a student, father, mother, and yogi.",
    "A \"Family Campaign\" launched in April was similarly   demographic-inclusive highlighting multi-generational and   same-sex couples in the spring 2019 Polo collection.",
    "As for denim, new designs are sustainably sourced with   personalized printing to order. The younger crowd will appreciate   the bespoke trend as well as the firm's Better Cotton Initiative,   a step toward sustainably sourcing 100% of the brand's denim and   reducing water use by 20% across all operations and value chain   by 2025. Ralph Lauren is one of 32 leading global fashion textile   companies to commit to a climate, biodiversity, and ocean   pact.",
    "Perhaps the biggest and latest coup was highlighting   sustainability in its designs of ball person's uniforms at the   2019 US Open Tennis tournament. Now that was a good choice as far   as marketing initiatives are concerned, and totally aiming at the   right consumer group.",
    "Still, Lauren needs to redefine its consumer. And there is a   theory that this might happen just as the Gen Z favorites such as   Champion and    Lululemon    begin    begin to decline.",
    "Brands like Vans and Champion have staged a comeback thanks to   the Gen Z's love of social media followers and their influencers.   Whatever brand royalty-think Beyoncé and Jay-Z-are wearing on   Instagram today is next week's cash cow.",
    "Ralph Lauren, on the other hand, is side-stepping this   phenomenon and relying on tried and true traditional marketing.   So far, however, the iconic brand has failed to show a   significant uptick in consumer awareness or demand, perhaps due   to a lack of creativity in its typical choice of channels to   reach its market, such as mobile.",
    "Another hurdle to overcome is that the brand is also confusing   for consumers. According to Ralph Lauren, it targets the   upper-middle to upper classes who have a sizable disposable   income. The company also touts a clothing range for \"the sportier   end of the spectrum\" (think polo and rugby enthusiasts) while its   lines are \"classic, elegant, and sophisticated\" yet \"formal.\"",
    "So, which is it? Sporty or formal? I'm confused. And   emphasizing polo and rugby seems to totally target elites, not   the upper-middle class.",
    "So what is the effect of Lauren's new initiatives, and will   they   pay off    if there is a fall-off in athleisure?",
    "It turns out that Ralph Lauren is already showing positive   signs. After a 7% decline in revenues in 2019, the company   announced expected   1% growth    for this year at its third-quarter earnings report. Not great.   However, the most recen   t quarterly   report    showed an earnings surprise of 6.63%.",
    "Also, expected earnings of $0.93 per share in the third   quarter were actually $1.07, delivering a surprise of 15.05%. For   EPS, the company has surpassed consensus EPS estimates four times   over the past four months.",
    "There was also a 21% jump in digital commerce revenue that   compensated for flat brick-and-mortar sales. Most interestingly,   a sign of confidence was a buyback of 400 million shares in the   first three-quarters of fiscal 2019 and an announcement that the   company plans to spend a billion dollars on buybacks through   fiscal 2020. These latest numbers are turning heads.",
    "Bottom line, if you find yourself tolerating a long checkout   line to buy a new pair of jeans, consider going long on some   Ralph stock while you're at it. Just check the numbers before you   do.",
    "  10 stocks we like better than Ralph Lauren     Corp       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Ralph Lauren Corp wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Ralph Lauren     Corp       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Ralph Lauren Corp wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Caroline Banton      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Lululemon Athletica. The Motley     Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 04:37:00"
}