{
  "url": "https://www.nasdaq.com/article/walmart-to-stop-selling-ammunition-for-handguns-assaultstyle-weapons-20190903-00991",
  "title": "Walmart to stop selling ammunition for handguns, assault-style weapons - Nasdaq.com",
  "text": [
    "By Nivedita Balu",
    "Sept 3 (Reuters) - Walmart Inc , the nation's largest retailer, said on Tuesday it would stop selling ammunition for handguns and some assault-style rifles in all its stores across the United States, calling for national action on gun safety after a string of mass shootings, including two at Walmart stores in Texas and Mississippi.",
    "Walmart is among U.S. companies, such as Delta Air Lines  and Bank of America , that increasingly are responding to the debate over guns and gun safety as mass shootings have proliferated, risking backlash from powerful national gun owners' groups while elected leaders consider options.",
    "McMillon said the decision follows his visit to El Paso, Texas, on Aug. 6, three days after a gunman went on a rampage at a Walmart store there, killing 22 people.",
    "Walmart is also urging that background checks be strengthened and that the reauthorization of a national assault weapons ban \"should be debated to determine its effectiveness,\" McMillon said in the letter, in which he described himself as a gun owner and said that company founder Sam Walton was \"an avid outdoorsman who had a passion for quail hunting.\"",
    "Walmart will stop selling handgun sales in Alaska, the only state where it still sells hand guns, and asked customers not to openly carry firearms in its stores, even in states that allow \"open carry\" of guns. The halt on the ammunition and handgun sales will come into effect when current inventory is sold out.",
    "PRAISE AND CRITICISM",
    "Everytown for Gun Safety, a gun control advocacy group, applauded the actions, saying, \"Walmart has its finger on the pulse of what Americans want.\"",
    "The National Rifle Association (NRA), a pro-gun group with deep political ties, said Walmart was succumbing to pressure from \"anti-gun elites.\"",
    "\"Lines at Walmart will soon be replaced by lines at other retailers who are more supportive of America's fundamental freedoms,\" it said.",
    "The company said its latest actions would reduce its share of the ammunition market from around 20% to a range of about 6% to 9%, and would trend toward the lower end of that range over time.",
    "U.S. gun and ammunition stores had total sales of about $11 billion last year, of which 19% was ammunition, according to market research firm IBISWorld.",
    "The move reflects growing corporate activism on guns.",
    "Walmart, like rival Dick's Sporting Goods , had already ended sales of assault rifles and raised the minimum age for gun purchases to 21.",
    "Bank of America last year said it would no longer lend to companies making military-style firearms for civilians, and airlines Delta and United last year said they were no longer offering discounted rates to the NRA.",
    "The latest move will leave Walmart focused on weapons for hunting, including deer rifles, shotguns and related ammunition.",
    "\"The general principle is if we don't sell the firearm we wouldn't sell the ammunition,\" a spokesman for Walmart told Reuters.",
    "Walmart will stop selling all handgun ammunition and some short-barrel rifle ammunition such as the .223 caliber and 5.56 caliber after clearing current stock. Walmart did not comment on sales of other caliber ammunition.",
    "While short-barrel ammunition is commonly used in some hunting rifles for small animals such as prairie dogs, it can also be used in military-style weapons with high-capacity magazines.",
    "Just last month, Walmart said it would not change its policy on selling firearms even as it took down signs and playable demos of violent video games.",
    "On Friday, McMillon in his letter to employees said he would send letters urging action on \"common sense measures\" to the White House and the Congressional leadership."
  ],
  "published_datetime": "2019-09-03 14:06:00"
}