{
  "url": "https://www.nasdaq.com/article/american-outdoor-brands-dims-hopes-for-a-rebound-cm1207663",
  "title": "American Outdoor Brands Dims Hopes for a Rebound - Nasdaq.com",
  "text": [
    " Any hoped for   upbeat surprises    in   American Outdoor Brands    ' (NASDAQ: AOBC) quarterly report were shot down by higher dealer   inventories outweighing positive trends in consumer demand. The   firearms market remains very soft, and distributors remain   cautious as a result. With buyers having taken advantage of discounts that were   ending at the end of the previous quarter, as the industry headed   into the seasonally slow summer months, there was little   motivation for dealers and distributors to buy more. And though   consumers were showing more interest in buying guns, it was not a   strong enough sentiment to warrant adding more merchandise.   Image source: Getty Images.makeArticleAd();  On target for disappointment American Outdoor Brands reported that revenue in its fiscal   first quarter fell 11% to $123.7 million, well below analyst   expectations of $127 million. Firearms sales were down 9% for the   period while outdoor products were down 11%, but gross margins   rose due to cost savings and inventory adjustments despite   unfavorable product mix and increased promotional   costs. Firearms represent 75% of American Outdoor's revenue;   outdoor gear sales, the rest. Earnings based on generally accepted accounting principles (   GAAP    ) showed a loss of $0.04 per share, but when adjusted for   acquisitions, they were $0.07 per share, in line with Wall   Street's expectations. Management isn't expecting the second quarter to be much   better, and in terms of profits, the outlook is much worse than   what analysts had been forecasting. American Outdoor is looking   for net sales of $140 million to $150 million, down from almost   $162 million last year. However, earnings are only expected to be   in a range of $0.03 to $0.07 per share, well below last year's   $0.20 per share, which is what Wall Street was also predicting   for the second quarter. Across-the-board headwinds Part of the problem is obviously the weak firearms   market    . In the wake of mass shootings, the industry is seeing growing   reluctance to sell firearms.   Dick's Sporting Goods    is considering doing away with its hunt department entirely.   Having eliminated the segment in 125 stores, it has found sales   and profits were higher with the categories it replaced it with,   so it is now wondering whether it needs the business at all.   Walmart    also just announced it would stop selling ammunition for handguns   and certain rifles and will ask customers not to openly carry   firearms in its stores. The trade war with China is also taking its toll. Much of the   gear the rugged-outdoors company sells is currently sourced from   China, where its supply chain is quite sophisticated. Other Asian   countries that it could consider moving to can't acquire or   procure all the material and components American Outdoor needs,   meaning it would take a long time to make a transition. It's also   uncertain how long the tariff situation is going to last. CEO James Debney told analysts on the   earnings conference call    that while his team is doing its best to mitigate the increases,   \"as the tariff situation continues to escalate, opportunities to   offset that impact have begun to rapidly diminish.\" American Outdoor says it is running out of concessions it is   able to wring out of its vendors, and it needs to be careful not   to raise prices too much lest it become uncompetitive. Maybe some distant hope Basically, the gunmaker is in a wait-and-see mode. It is   looking to the back half of fiscal 2020 -- starting in November   -- for business to pick up. In firearms, there will be full swing   for the hunting season and then the holidays. With a broad range   of new products getting introduced later this year, which are   typically a big driver of sales, American Outdoor is expecting   big things to come. Buyer demand seems to have finally begun a recovery, with   three consecutive quarters of higher adjusted National Instant   Criminal Background Check system checks, but the increases have   been fairly anemic, and there's no groundswell on the   horizon. And tariffs remain a big wild card because there are more   increases scheduled to come in September, October, and December.   Although there is some hope of resolution as China now says it   won't retaliate right away because its own economy is slowing   down due to the trade tensions, it still means things may   get worse for American Outdoor Brands before they get better --   and even then gains may not be so great.   10 stocks we like better than American Outdoor Brands     Corporation       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and American Outdoor Brands     Corporation wasn't one of them! That's right -- they think     these 10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Rich Duprey      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Any hoped for   upbeat surprises    in   American Outdoor Brands    ' (NASDAQ: AOBC) quarterly report were shot down by higher dealer   inventories outweighing positive trends in consumer demand. The   firearms market remains very soft, and distributors remain   cautious as a result.",
    "With buyers having taken advantage of discounts that were   ending at the end of the previous quarter, as the industry headed   into the seasonally slow summer months, there was little   motivation for dealers and distributors to buy more. And though   consumers were showing more interest in buying guns, it was not a   strong enough sentiment to warrant adding more merchandise.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "American Outdoor Brands reported that revenue in its fiscal   first quarter fell 11% to $123.7 million, well below analyst   expectations of $127 million. Firearms sales were down 9% for the   period while outdoor products were down 11%, but gross margins   rose due to cost savings and inventory adjustments despite   unfavorable product mix and increased promotional   costs. Firearms represent 75% of American Outdoor's revenue;   outdoor gear sales, the rest.",
    "Earnings based on generally accepted accounting principles (   GAAP    ) showed a loss of $0.04 per share, but when adjusted for   acquisitions, they were $0.07 per share, in line with Wall   Street's expectations.",
    "Management isn't expecting the second quarter to be much   better, and in terms of profits, the outlook is much worse than   what analysts had been forecasting. American Outdoor is looking   for net sales of $140 million to $150 million, down from almost   $162 million last year. However, earnings are only expected to be   in a range of $0.03 to $0.07 per share, well below last year's   $0.20 per share, which is what Wall Street was also predicting   for the second quarter.",
    "Part of the problem is obviously the weak firearms   market    . In the wake of mass shootings, the industry is seeing growing   reluctance to sell firearms.   Dick's Sporting Goods    is considering doing away with its hunt department entirely.   Having eliminated the segment in 125 stores, it has found sales   and profits were higher with the categories it replaced it with,   so it is now wondering whether it needs the business at all.   Walmart    also just announced it would stop selling ammunition for handguns   and certain rifles and will ask customers not to openly carry   firearms in its stores.",
    "The trade war with China is also taking its toll. Much of the   gear the rugged-outdoors company sells is currently sourced from   China, where its supply chain is quite sophisticated. Other Asian   countries that it could consider moving to can't acquire or   procure all the material and components American Outdoor needs,   meaning it would take a long time to make a transition. It's also   uncertain how long the tariff situation is going to last.",
    "CEO James Debney told analysts on the   earnings conference call    that while his team is doing its best to mitigate the increases,   \"as the tariff situation continues to escalate, opportunities to   offset that impact have begun to rapidly diminish.\"",
    "American Outdoor says it is running out of concessions it is   able to wring out of its vendors, and it needs to be careful not   to raise prices too much lest it become uncompetitive.",
    "Basically, the gunmaker is in a wait-and-see mode. It is   looking to the back half of fiscal 2020 -- starting in November   -- for business to pick up. In firearms, there will be full swing   for the hunting season and then the holidays. With a broad range   of new products getting introduced later this year, which are   typically a big driver of sales, American Outdoor is expecting   big things to come.",
    "Buyer demand seems to have finally begun a recovery, with   three consecutive quarters of higher adjusted National Instant   Criminal Background Check system checks, but the increases have   been fairly anemic, and there's no groundswell on the   horizon.",
    "And tariffs remain a big wild card because there are more   increases scheduled to come in September, October, and December.   Although there is some hope of resolution as China now says it   won't retaliate right away because its own economy is slowing   down due to the trade tensions, it still means things may   get worse for American Outdoor Brands before they get better --   and even then gains may not be so great.",
    "  10 stocks we like better than American Outdoor Brands     Corporation       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and American Outdoor Brands     Corporation wasn't one of them! That's right -- they think     these 10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than American Outdoor Brands     Corporation       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and American Outdoor Brands     Corporation wasn't one of them! That's right -- they think     these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Rich Duprey      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:19:00"
}