{
  "url": "https://www.nasdaq.com/article/mideast--factors-to-watch--september-5-20190905-00038",
  "title": "MIDEAST - Factors to watch - September 5 - Nasdaq.com",
  "text": [
    "DUBAI, Sept 5 (Reuters) - Here are some factors that may affect Middle East stock markets on Thursday. Reuters has not verified the press reports and does not vouch for their accuracy.",
    "INTERNATIONAL/REGIONAL",
    "* Oil prices rise after U.S. confirms trade talks with China to start O/R",
    "* PRECIOUS- Gold slips as China-U.S. trade talk hopes lift risk appetite ",
    "* MIDEAST STOCKS- Banks boost Saudi index; wide sell-off weighs on Egypt",
    "* Turkey says it faces up to $3 bln in trade losses with Britain under no-deal Brexit ",
    "* No trade mechanism until Iran passes terrorism financing laws - French diplomat ",
    "* Turkey's lira boosted by prospects of easing at home and abroad ",
    "* Lebanon PM targets deficit of 7% of GDP next year -CNBC ",
    "* Russia, OPEC sources say Saudi shake-up won't affect oil pact ",
    "* Iran to release seven crew members of detained British tanker - state TV ",
    "* Stena Impero tanker owner says Iran to free seven of crew being held ",
    "* Iran's Rouhani says next nuclear deal breaches will have \"extraordinary\" effects - TV ",
    "* Eastern Libyan oilfield al-Bayda closes due to maintenance-engineers ",
    "* Turkish August trade deficit narrows slightly to $2.45 bln -ministry ",
    "* Morocco's trade deficit deepens 4.3% year/year Jan-July  ",
    "EGYPT",
    "* Egypt stock market aims for two more listings, short-selling before year-end ",
    "* Egypt's net foreign reserves rise to nearly $45 bln in August -cenbank ",
    "* Egypt's Palm Hills Says CEO Mohamed Sultan Resigns ",
    "* Egypt's Palm Hills Q2 Consol Profit Rises ",
    "* Egytrans Board Approves To Sell 2.2 Mln Treasury Shares ",
    "SAUDI ARABIA",
    "* Saudi Arabia could slash growth estimates as contraction looms ",
    "* Fund manager BlackRock opens office in Saudi Arabia",
    "* Saudi's Rumayyan takes control of Aramco IPO executive committee ",
    "* Russian Agri Minister, Saudi's Falih to discuss Russia-Saudi trade ",
    "* Saudi's CHUBB Arabia Appoints Kamran Mazhar As Acting CEO ",
    "* Fitch Says Saudi Islamic Banking Dominant; Asset Quality Weakened ",
    "UNITED ARAB EMIRATES",
    "* UAE's ADNOC signs $600 mln agreement with Singapore's GIC ",
    "* Aabar's bonds drop on 'adverse' audit, despite Abu Dhabi backing ",
    "* Emirates Announces New Executive Leadership Appointments ",
    "* Emaar head says was not aware of plans for new Dubai property planning body ",
    "* POLL-Dubai house prices to fall sharply ",
    "* TABLE-UAE's Fujairah oil inventory data for week ended Sept 2",
    "* CORRECTED-Emaar does not expect change to its business after committee formed -chairman ",
    "QATAR",
    "* Qatar Petroleum cuts August prices for marine and land crude ",
    "BAHRAIN",
    "* Bahrain's Alba raising $1.5 billion in bank debt -sources "
  ],
  "published_datetime": "2019-09-05 12:47:00"
}