{
  "url": "https://www.nasdaq.com/article/will-insiders-be-tempted-to-buy-more-sm-at-the-new-52-week-low-cm1206811",
  "title": "Will Insiders Be Tempted To Buy More SM At The New 52-Week Low? - Nasdaq.com",
  "text": [
    "In trading on Tuesday, shares of SM Energy Co. (Symbol: SM) touched a new 52-week low of $8.46/share. That's a $25.30 share price drop, or -74.94% decline from the 52-week high of $33.76 set back on 10/04/2018. Large percentage drops always require that the stock post even larger percentage gains from the low in order to recover the old price point, and for SM that means the stock would have to gain 299.05% to get back to the 52-week high. For a move like that, SM Energy Co. would need fundamental strength at the business level. Here's a rhetorical question: Who knows more about fundamentals at the business level than the company's own insiders? So let's take a look to see whether any company insiders were taking the other side of the trade as SM shares were being sold down to this new 52-week low, focusing on the most recent trailing six month period. As summarized by the table below, SM has seen 3 different instances of insiders buying over the past six months.     makeArticleAd();  In the short run, while the new 52-week low suggests the stock is at the cheapest price and perhaps therefore the best bargain it has been over the last 52 weeks, the low print also means anyone who has purchased the stock over that timeframe is staring at an unrealized loss. Oftentimes, that factor drives a stock's technical analysis metrics by creating overhead resistance, with investors who bought higher now anxious to reverse their trade once they are back to breakeven. The chart below shows where SM has traded over the past year, with the 50-day and 200-day moving averages included.       Time will tell whether the insider purchases foretell a future rebound for SM shares, which are presently showing a last trade of $8.86/share, slightly above the new 52-week low.   Ten Bargains You Can Buy Cheaper Than The   Insiders Did »  ",
    "Here's a rhetorical question: Who knows more about fundamentals at the business level than the company's own insiders? So let's take a look to see whether any company insiders were taking the other side of the trade as SM shares were being sold down to this new 52-week low, focusing on the most recent trailing six month period. As summarized by the table below, SM has seen 3 different instances of insiders buying over the past six months.",
    "  Ten Bargains You Can Buy Cheaper Than The   Insiders Did » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:49:45"
}