{
  "url": "https://www.nasdaq.com/article/us-safety-regulator-cites-driver-error-tesla-autopilot-design-in-crash-report-20190904-00895",
  "title": "U.S. safety regulator cites driver error, Tesla Autopilot design in crash report - Nasdaq.com",
  "text": [
    "By David Shepardson",
    "WASHINGTON, Sept 4 (Reuters) - The National Transportation Safety Board (NTSB) on Wednesday cited driver errors and Tesla Inc's  Autopilot design as the probable cause of a January 2018 crash of a Model S into a parked fire truck on a highway in California.",
    "The safety board, which previously criticized Tesla's driver assistance system Autopilot after a 2016 fatal crash in Florida, said that the system's design \"permitted the driver to disengage from the driving task\" in the Culver City, California, crash. The NTSB said on Tuesday that Autopilot allowed the driver to keep his hands off the wheel for the vast majority of the nearly 14 minutes of the trip. ",
    "in the incident. The NTSB cited the driver's \"inattention and overreliance\" on the advanced driver assistance system.",
    "Tesla's Autopilot was engaged during at least three fatal U.S. crashes, including one involving a 2018 Model 3 in Delray Beach, Florida, and a crash in Mountain View, California, of a Model X. Both incidents, which occurred in March 2018, remain under investigation by the NTSB and the National Highway Traffic Safety Administration (NHTSA). The NTSB makes safety recommendations, while the NHTSA can order a recall if it deems a defect poses an unreasonable risk to safety.",
    "The Center for Auto Safety, a consumer watchdog group, said on Wednesday the NTSB report should prompt NHTSA to \"do its job and recall these vehicles ... A vehicle that enables a driver to not pay attention, or fall asleep, while accelerating into a parked fire truck is defective and dangerous.\"",
    "NHTSA did not immediately comment.",
    "Tesla said in an emailed statement that since the 2018 crash \"we have made updates to our system including adjusting the time intervals between hands-on warnings and the conditions under which they're activated.\"",
    "The company added that Tesla owners have driven billions of miles with Autopilot engaged and says its data \"indicates that drivers using Autopilot remain safer than those operating without assistance.\"",
    "The crashes raised questions about the driver-assistance",
    "system's ability to detect hazards and sparked safety concerns  about systems that can perform driving tasks for extended stretches of time with little or no human intervention, but which cannot completely replace human drivers.",
    "After the fatal 2016 Florida crash, NTSB asked six automakers with advanced driver assistance systems - Tesla, Volkswagen AG VOWG_p.DE, BMW AG , Nissan Motor Co , Daimler AG  and Volvo Car - to \"develop applications to more effectively sense the driver's level of engagement and alert the driver when engagement is lacking while automated vehicle control systems are in use.\"",
    "\"All manufacturers except Tesla have responded to the NTSB explaining their current systems and their efforts to reduce misuse and keep drivers engaged,\" the NTSB said.",
    "While Tesla drivers say they are able to avoid holding the",
    "steering wheel for extended periods while using Autopilot, Tesla",
    "advises drivers to keep their hands on the wheel and pay",
    "attention while using the system.",
    "The 2014 Model S Autopilot system was engaged continuously",
    "for the final 13 minutes 48 seconds of the January 2018 trip and the driver kept his hands off the wheel for all but 51",
    "seconds of the final drive segment and received numerous alerts",
    "to place his hands back on the wheel, the NTSB said. Had he been paying close attention \"he could have taken evasive action to avoid or mitigate the collision.\""
  ],
  "published_datetime": "2019-09-04 01:05:00"
}