{
  "url": "https://www.nasdaq.com/article/tanzania-seizes-ivory-tusks-equivalent-to-117-elephants-killed-20190905-00172",
  "title": "Tanzania seizes ivory tusks equivalent to 117 elephants killed - Nasdaq.com",
  "text": [
    "DAR ES SALAAM, Sept 5 (Reuters) - Tanzania has seized ivory tusks equivalent to killing at least 117 elephants, its tourism minister said, part of its drive to stamp out organised criminal networks involved in years of industrial-scale poaching.",
    "The elephant population in Tanzania, famed for its wildlife reserves, shrank from 110,000 in 2009 to barely 43,000 in 2014, according to a 2015 census, with conservation groups blaming rampant poaching. The government says numbers have now started to recover.",
    "Demand for ivory from Asian countries such as China and Vietnam, where it is turned into jewels and ornaments, has driven the surge in poaching across Africa.",
    "\"The arrest of Nyoni has brought us to a stage where we can say we have taken into custody all the hardcore poachers on our wanted list, except for a few who have left the country,\" Kigwangalla said.",
    "\"Nyoni and his accomplices' consignment is worth 4 billion shillings ($1.74 million) and involved the killing of 117 elephants going back to 2015 and earlier,\" he said.",
    "Neither Likwema nor his accomplices were immediately reachable for comment.",
    "Pictures Kigwangalla posted on his Twitter account showed him inspecting a row consisting of 75 whole tusks and some 338 smaller pieces of ivory.",
    "The government said in July its anti-poaching efforts had led to a recovery in elephant numbers, which rose to over 60,000 at present.",
    "A Tanzanian court in February sentenced a prominent Chinese businesswoman dubbed the \"Ivory Queen\" to 15 years in prison for smuggling the tusks of more than 350 elephants to Asia, marking a major victory for the government. ",
    "($1 = 2,294.0000 Tanzanian shillings)"
  ],
  "published_datetime": "2019-09-05 05:18:00"
}