{
  "url": "https://www.nasdaq.com/article/us-stockswall-street-rises-on-apple-trade-optimism-20190911-00621",
  "title": "US STOCKS-Wall Street rises on Apple, trade optimism - Nasdaq.com",
  "text": [
    " (For a live blog on the U.S. stock market, click LIVE/ ortype LIVE/ in a news window)",
    "* Apple biggest boost to tech sector",
    "* China exempts 16 types of U.S. goods from tariffs",
    "* Indexes up: Dow 0.37%, S&P 500 0.39%, Nasdaq 0.76%  (Updates market action, adds comments)",
    "By Uday Sampath Kumar",
    "Sept 11 (Reuters) - U.S. stocks rose on Wednesday, lifted byApple a day after the launch of its latest iPhones and as Chinamoved to ease trade tensions with the United States by exemptingcertain goods from additional retaliatory tariffs.",
    "Apple IncAAPL.O rose 2.60%, boosting all three majorindexes by the most, as it also rolled out a streaming TVservice at a price that undercuts Walt Disney CoDIS.N andNetflix Inc NFLX.O . urn:newsml:reuters.com:*:nL2N2610X7",
    "The gains took Apple's market valuation above $1 trillionand lifted the wider technology sector .SPLRCT by 0.68%, thebiggest boost among the 11 major S&P 500 sectors.",
    "Tech stocks bounced from a drop in the previous session,which saw investors moving to more value-oriented stocks fromgrowth shares.",
    "Adding to the positive momentum, China's finance ministrymoved to exempt 16 types of U.S. goods, including lubricants andsome animal feed ingredients, from additional retaliatorytariffs, ahead of a planned meeting between trade negotiators. urn:newsml:reuters.com:*:nL3N2621DV",
    "While on the surface, the move is seen as a friendly gestureto thaw relations with the United States, analysts are skepticalabout how much it will move the needle in resolving a protractedtrade war that has hurt the global economy.",
    "The nature of the goods that are being exempted are staplesand indicates that China's decision is likely more to do withsupporting its own economy rather than extending an olive branchto the United States, Ed Egilinsky, head of alternativeinvestments at Direxion said.",
    "\"There's a big difference between today's move and sittingdown at the negotiating table and actually ironing out a deal.\"    ",
    "Comments from a senior White House adviser on Tuesday urginginvestors to be patient about resolving the dispute furtherdownplayed expectations that a trade deal would be agreed thisyear. urn:newsml:reuters.com:*:nL2N2611SF",
    "Investors held out on big bets ahead of stimulus decisionsfrom central banks to stem a global slowdown. The U.S. FederalReserve and the European Central Bank are expected to cutinterest rates at their policy meetings over the next two weeks.",
    "U.S. President Donald Trump on Wednesday renewed his attackson Fed Chairman Jerome Powell, saying that the central bankshould get interest rates down to \"ZERO, or less.\"",
    "At 11:56 a.m. ET, the Dow Jones Industrial Average .DJI was up 99.22 points, or 0.37%, at 27,008.65, the S&P 500 .SPX was up 11.71 points, or 0.39%, at 2,991.10 and the NasdaqComposite .IXIC was up 61.37 points, or 0.76%, at 8,145.52.   ",
    "Among other stocks, shares of Micron Technology IncMU.O rose 2.49% after Longbow Research upgraded its stock to\"buy\". urn:newsml:reuters.com:*:nL3N2622HJ",
    "Baker Hughes shares BHGE.N fell 3.63%, the most among S&P500 companies, after parent General ElectricGE.N looked tosell a majority stake in the oilfield services provider. urn:newsml:reuters.com:*:nL3N2613UN",
    "Advancing issues outnumbered decliners for a 1.90-to-1 ratioon the NYSE and a 2.25-to-1 ratio on the Nasdaq.",
    "The S&P index recorded 22 new 52-week highs and no new low,while the Nasdaq recorded 43 new highs and nine new lows. (Reporting by Uday Sampath in Bengaluru; Editing by SaumyadebChakrabarty, Arun Koyyur and Shounak Dasgupta) ((UdaySampath.Kumar@thomsonreuters.com; within U.S.+1 646 2238780; Twitter: @sampath_uday; Reuters Messaging:UdaySampath.Kumar.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-11 12:25:00"
}