{
  "url": "https://www.nasdaq.com/article/iphone-11-event-wont-be-big-for-apple-stock-cm1207598",
  "title": "iPhone 11 Event Won’t Be Big for Apple Stock - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "The biggest new feature of the 2019 iPhones may be the price. Apple (NASDAQ: AAPL ) mavens are expressing disappointment over rumors indicating benchmarks on the iPhone 11 are \"disturbingly\" low.",
    "Specifications on the phones, to be formally announced Sept. 10, have been leaking to the media for days . The main improvements seem to be new cameras, with storage starting at 64 gigabytes and prices starting at $750. The high-end iPhone 11 Pro Max will start at $1,100 with up to 512 gigabytes of storage.",
    "Tech reporters are hoping that a new iPad will be announced at the event, or at least an Apple Watch . Otherwise they fear they'll be bored.",
    "But it's the new Apple strategy that should be making headlines.",
    "Apple has been losing sales and share for three years now, but it may finally be doing something about it. That something won't be announced next week. It would be a new iPhone SE, similar in size to the iPhone 8 from 2017, aimed at competing on price against Huaweiand other Asian phone makers .",
    "Half of Apple's iPhone sales come on older or cheaper models of the product, especially in the developing world. A new iPhone SE would finally sunset the iPhone 7 design and cost about $500 to purchase new. Apple's current user base consists of about 900 million phones. Analysts believe 270 million could be upgraded, and perhaps resold by Apple.",
    "AAPL will make about 75 million iPhone 11 models for the current launch period, according to Wedbush analyst Daniel Ives, who sees pent-up demand for the product.",
    "But if Apple is serious about competing on price again in markets like India and Southeast Asia, it could be a sea change for the company given the other moves it has made.",
    "Increasingly Apple's success is tied to its services, which represented 21% of revenues according to its most recent quarterly report .",
    "Apple draws almost twice as much revenue from services as it does from the Macintosh, and more than twice what it makes from the iPad or wearables like the Apple Watch. Apple reported 64% margins on that service revenue, against 30% for products.",
    "Apple's capital spending is estimated at $14 billion for 2019, down $2 billion from last year. But that may be misleading. Unlike the other \"Cloud Czars,\" Apple puts a lot of its capital to work on manufacturing plants. It also makes a lot of use of Amazon's (NASDAQ: AMZN ) Web Services  and Alphabet's (NASDAQ: GOOG , NASDAQ: GOOGL ) Google Cloud .",
    "The company runs its own data centers in the U.S. and Europe, contracting out its Chinese operations .  The bottom line is that Apple runs some data through its own servers and some data through third parties, giving it a global footprint at minimal cost.",
    "This is not a secret . Apple has introduced a host of new paid services this year, including a news app, Apple TV and the Apple Card credit card. They run best on Apple hardware. Android users barely know they exist.",
    "Tech analysts focus on the new iPhones. Investors need to focus on the whole line - and on service revenue.",
    "Under Tim Cook Apple has learned to squeeze increasing amounts of lifetime revenue from each Apple customer, thanks to its services, which are phenomenally profitable.",
    "Getting customers in the door is thus more important than making money off the initial sale. Analysts should be focused on the average revenue per user of Apple's user base, not the bright, shiny objects executives hold up next Tuesday.",
    "Dana Blankenhorn is a financial and technology journalist. He is the author of the environmental story, Bridget O'Flynn and the Bear, available at the Amazon Kindle store. Write him at danablankenhorn@gmail.comor follow him on Twitter at @danablankenhorn . As of this writing he owned shares in AAPL and AMZN.",
    "The post iPhone 11 Event Won't Be Big for Apple Stock appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:40:11"
}