{
  "url": "https://www.nasdaq.com/article/planet-fitness-news-why-plnt-stock-is-looking-weak-today-cm1206969",
  "title": "Planet Fitness News: Why PLNT Stock Is Looking Weak Today - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Planet Fitness news for Tuesday about a  downgrade has PLNT stock down.",
    "The downgrade for Planet Fitness (NYSE: PLNT ) comes from Berenberg analyst Alex Maroccia. This has the firm taking PLNT stock from its previous rating of \"Buy\" and giving it a new rating of \"Hold.\" The majority of analysts still maintain a \"Buy\" rating for the stock.",
    "The Planet Fitness news for today doesn't stock with just a downgrade for PLNT stock. Maroccia is also dropping Berenberg's price target for the stock as well. This has the firm giving PLNT stock a new price target of $69.00, reports Schaeffer's Investment Research .",
    "How does that new price target compare to the old one? It's a major drop. The previous price target from Berenberg for Planet Fitness stock was $80.00. That means this new price target is almost 14% lower than the previous one.",
    "The Planet Fitness news also doesn't have the new price target comparing well to its closing price on Friday, which was the last day of trading before the downgrade. The stock closed at $70.61 on Friday. That has the new price target coming in at roughly 2% lower than the previous closing price.",
    "So what exactly is the reason for the negative Planet Fitness news? The concern that Berenberg has about the company include not having enough near-term catalyst .",
    "PLNT stock was down 4% as of Tuesday afternoon. However, the stock is up 31% since the start of the year.",
    "As of this writing, William White did not hold a position in any of the aforementioned securities.",
    "The post Planet Fitness News: Why PLNT Stock Is Looking Weak Today appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:23:58"
}