{
  "url": "https://www.nasdaq.com/article/venezuelans-in-argentina-get-to-grips-with-crisis--again-20190905-00228",
  "title": "Venezuelans in Argentina get to grips with crisis - again - Nasdaq.com",
  "text": [
    "By Cassandra Garrison",
    "BUENOS AIRES, Sept 5 (Reuters) - Andreina Pirrone left Venezuela for Argentina six years ago as her country was spiraling towards the worst humanitarian crisis in its history. She did not know what the future would hold, but she was certain it would be brighter.",
    "Pirrone, an employee at a pasta factory in Buenos Aires, is now feeling a sense of deja vu, as her adopted home teeters towards its own economic crisis, with inflation running at over 50% and the peso currency plunging amid default fears.",
    "\"It is not something I would like to go through again. I worked very hard to get my family out of there and now to have possibly brought them to the same situation is terrible,\" said Pirrone, whose mother and sister have since joined her in Argentina.",
    "She said it would be complicated to leave Argentina but that she would consider it if things got worse, especially with a change of government likely towards the end of the year.",
    "\"I did not leave Venezuela to fall back into another type of similar government, so yes, I would leave.\"",
    "Argentina's center-right President Mauricio Macri was soundly beaten in a primary vote in August, making it highly likely that October's election will be won by the main Peronist opposition ticket, which includes divisive populist ex-President Cristina Fernandez de Kirchner.",
    "Argentina, the No. 4 destination for Venezuelan migrants, has been in recession and firefighting economic crises since last year. The shock primary result sparked a further market crash, with the peso losing over a quarter of its value against the dollar in August alone.",
    "In response, Macri rolled out plans to delay debt repayments and imposed capital controls to protect the peso. For some expatriate Venezuelans, that brought back reminders of home, which has long been under currency controls that many blame as the root causes of the country's economic malaise.",
    "\"Really, the first thing you think is to leave,\" said Alejandro Dugarte, an employee at a digital payments firm in Buenos Aires, who left Venezuela three years ago.",
    "\"We already lived it. Living it again is not my plan,\" told Reuters from the living room of the Buenos Aires apartment he shares with his girlfriend, adding that he did not yet have concrete plans of where, when or even whether he would move.",
    "PARADISE VS CHAOS",
    "In recent years, an estimated 4.3 million Venezuelans have fled an economic collapse in their home country that has fueled a humanitarian crisis and shortages of food and medicine. Most have scattered across South America.",
    "The sound of Venezuelan salsa music and scent of arepa cakes grilling have become familiar to cities across the region, including Buenos Aires. Nearly 650,000 registered Venezuelan migrants have settled in Argentina in the last few years.",
    "Juan Jose Granados Hernandez said he sold eggs on his father's farm in Venezuela until the money no longer stretched to feed everyone at home. Now, he is a delivery cyclist for on-demand apps Rappi and Glovo in Buenos Aires.",
    "\"Venezuela is in total chaos. Here, it is still a paradise compared with Venezuela,\" he said, adding that Macri had \"opened the doors\" to Venezuelans.",
    "Fears of political upheaval, though, have spooked some Venezuelans. Fernandez de Kirchner, the vice presidential opposition candidate who led the country between 2007-2015, was once an ideological ally of Venezuelan President Nicolas Maduro.",
    "Her running mate Alberto Fernandez has criticized regional demands for Maduro to step down and said if elected he would join Mexico and Uruguay in promoting talks between Maduro and the opposition. ",
    "That would represent a major policy shift that would end nearly four years of strident criticism of Maduro under Macri.",
    "Maduro has blamed Venezuela's economic woes on U.S. sanctions and said they have led some Venezuelans to try their luck in other countries, but that the extent of the crisis and number of migrants has been exaggerated.",
    "Venezuelans were wary of a return to Fernandez de Kirchner's leftist policies because they had a \"fear and terror of everything that has to do with socialism,\" said Sofia Nunes, a Venezuelan journalist who has lived in Argentina for five years and works for local news site Urgente24. She has appeared on Argentine television criticizing the situation in Venezuela.",
    "She said she had talked to her friends about leaving Argentina, but could not imagine rebuilding her life again.",
    "\"Where would I go? To suffer again, where?\" she said."
  ],
  "published_datetime": "2019-09-05 06:00:00"
}