{
  "url": "https://www.nasdaq.com/article/sterling-rallies-for-second-day-as-nodeal-brexit-fears-ebb-20190905-00230",
  "title": "Sterling rallies for second day as no-deal Brexit fears ebb - Nasdaq.com",
  "text": [
    "By Saikat Chatterjee",
    "LONDON, Sept 5 (Reuters) - The pound rallied to a one-week high on Thursday after lawmakers voted to force Prime Minister Johnson to seek a three-month delay to Brexit if he failed to secure a transition agreement with the European Union.",
    "Political uncertainty remained high -- Johnson renewed his   efforts to seek an election next month after a first attempt was defeated on Wednesday -- but market watchers were relieved that at least a no-deal Brexit seemed to be averted.",
    "The British currency  rose 0.4% to above $1.23, its highest since Aug. 28 and building on an overnight 1.4% surge, its biggest one-day jump since March. ",
    "The pound has been shunned by investors in recent weeks as  concern grew that Britain would crash out of the EU without a deal. On Monday, it fell to below $1.20.",
    "UBS analysts said a delay to Brexit until January 2020 and an election after October could push the pound as high as $1.30, a four-month high.",
    "\"A delay for both Brexit and general election will continue to send the pound higher,\" said Neil Jones, head of hedge-fund currency sales at Mizuho Bank.",
    "The rally reverberated through the derivative markets as well. Two-month implied volatility gauges for pound options,  which cover the Oct. 31 deadline for Britain's EU exit, fell. The drop in expected price swings for the pound indicated markets were unwinding extreme short-term negative bets.",
    "Despite the rebound, the British currency remained more than 8% below March's 2019 highs of nearly $1.34, on fears an election is the only way to break the political deadlock.",
    "\"However, with the results from any election so hard to forecast and the difficulty of still fixing on a deal, we think further pound rallies are likely to be limited until we have clarity on outcomes,\" said John Marley, a senior FX consultant at FX risk management specialist, SmartCurrencyBusiness.    ",
    "Against the euro , the British currency gained 0.3% to 89.74 pence.",
    "Sterling vs. the U.S. dollar since 1960 (graphic)."
  ],
  "published_datetime": "2019-09-05 06:17:00"
}