{
  "url": "https://www.nasdaq.com/article/ciena-cien-q3-earnings-revenues-top-estimates-up-yy-cm1208135",
  "title": "Ciena (CIEN) Q3 Earnings & Revenues Top Estimates, Up Y/Y - Nasdaq.com",
  "text": [
    "Ciena CorporationCIEN reported solid third-quarter fiscal 2019 (ended Jul 31, 2019) financial results, wherein both the bottom line and the top line surpassed the respective Zacks Consensus Estimate, and increased year over year. The performance was driven by market share gains on the back of technology leadership and diversified customer base in high-growth markets.Net Income\r\n On a GAAP basis, net income for the quarter was $86.7 million or 55 cents per share compared with $50.8 million or 34 cents per share in the year-ago quarter. The year-over-year improvement was mainly due to higher operating income.\r\n Adjusted net income came in at $112.3 million or 71 cents per share compared with $74.3 million or 48 cents per share in the prior-year quarter. The bottom line beat the Zacks Consensus Estimate by 14 cents.Ciena Corporation Price, Consensus and EPS Surprise",
    "Ciena Corporation price-consensus-eps-surprise-chart | Ciena Corporation Quote",
    "Revenues\r\n Quarterly total revenues increased 17.3% year over year to $960.6 million, primarily driven by higher product sales. Markedly, Ciena had two 10%-plus customers in the quarter, which represented 25% of revenues. The top line surpassed the consensus estimate of $931 million.\r\n Geographically, revenues from North America were $617 million, up 24.1% year over year, driven by additional share gains across diverse customer base, including new wins and increasing traction of packet and software portfolios. Revenues from Europe, Middle East and Africa were $169.5 million, up 38.7%. Caribbean and Latin America totaled $39.3 million, up 42.9%. Asia Pacific revenues were $134.8 million, down 21.7%.Segment Results\r\n Revenues from Networking Platforms increased 17.5% year over year to $796.1 million. Software and Software-Related Services revenues were $47.8 million compared with $41.2 million in the prior-year quarter. Revenues from Global Services were $116.7 million compared with $100.2 million a year ago.Other Details\r\n Gross margin was 44.2% compared with 42.9% in the year-ago quarter. Operating expenses were $299.1 million, up from $266.3 million. Operating income increased to $125.3 million from $85.3 million. Operating margin was 13% compared with 10.4% in the prior-year quarter. Adjusted EBITDA was $178 million, up from $136.1 million.\r\n During the reported quarter, Ciena repurchased about 1.1 million shares for an aggregate amount of $45.4 million.Cash Flow & Liquidity\r\n During the first nine months of fiscal 2019, Ciena generated $173.1 million of net cash from operating activities compared with $161.2 million in the year-ago period. As of Jul 31, 2019, the company had $723.2 million in cash and equivalents with $681.9 million of net long-term debt.Zacks Rank & Stocks to Consider\r\n Ciena currently has a Zacks Rank #3 (Hold). A few better-ranked stocks in the broader industry are Nokia Corp. NOK , Viasat, Inc. VSAT and Sonim Technologies, Inc. SONM , each carrying a Zacks Rank #2 (Buy). You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here .\r\n Nokia surpassed earnings estimates thrice in the trailing four quarters, the average positive surprise being 89.3%.\r\n Viasat surpassed earnings estimates in each of the trailing four quarters, the average surprise being 230.6%.\r\n Sonim has long-term earnings growth expectation of 25%.It's Illegal in 42 States, But Investors Will Make Billions Legally\r\n In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.\r\n That's twice as much as they spend on marijuana, legally or otherwise.\r\n Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:45:00"
}