{
  "url": "https://www.nasdaq.com/article/stock-market-news-boeing-faces-new-delays-bitcoin-etf-coming-cm1206888",
  "title": "Stock Market News: Boeing Faces New Delays; Bitcoin ETF Coming - Nasdaq.com",
  "text": [
    "Tuesday morning brought a holiday hangover to the stock market, with significant losses to start the shortened week on Wall Street. Concerns about new tariffs that took effect over the weekend continue to hurt sentiment, and fears about past seasonal trends that have included substantial sell-offs in the months of September and October aren't helping investors feel more confident. As of 10:30 a.m. EDT, the Dow Jones Industrial Average (DJINDICES: ^DJI) was down 382 points to 26,021. The S&P 500 (SNPINDEX: ^GSPC) fell 29 points to 2,898, and the Nasdaq Composite (NASDAQINDEX: ^IXIC) declined 84 points to 7,878.",
    "Hurting the Dow this morning was Boeing (NYSE: BA) , which saw its stock lose ground amid more bad news for the beleaguered aircraft manufacturer. Meanwhile, on the cryptocurrency front, a long-awaited announcement concerning a possible exchange-traded fund for investing in bitcoin could open up the market to a new group of institutional investors -- but not necessarily to individuals.",
    "Shares of Boeing were down 3% after the aerospace gian t report edly ran into more resistance concerning the grounding of its 737 MAX aircraft lines. Boeing has been working with federal regulators to get approval to get the planes flying again, but according to The Wall Street Journal , those talks aren't going well. Many fear that the tension could lead to an extended delay in the 737 MAX's return to service at least into early 2020.",
    "Image source: Boeing.",
    "Already, Boeing's customers have had to deal with the complications stemming from the grounding. American Airlines Group (NASDAQ: AAL) and United Continental Holdings (NASDAQ: UAL) recently canceled their planned 737 MAX flights through early to mid-December, taking the key Thanksgiving travel season off the table but still leaving open the hope that the planes might be available for the Christmas and New Year's holidays.",
    "Boeing also faces the prospect of seeing customers start to shuffle orders. Rival Airbus has seen its business pick up as a result of Boeing's woes, and that trend could continue if the 737 MAX stays grounded indefinitely. It takes a long time for order shuffling to result in actual delivery changes, but investors have counted on Boeing being able to get the 737 MAX back in the air quickly to regain customer confidence. If that doesn't happen, then further declines in the stock could lie ahead.",
    "Bitcoin prices were up about 3% as cryptocurrency investors  responded to news that an ETF granting access to the bitcoin market will open soon. Yet for those individuals who had hoped to take advantage, there'll be a longer wait.",
    "ETF providers VanEck Securities and SolidX Management announced that they would make shares of their VanEck SolidX Bitcoin Trust available to a select set of investors on Thursday. However, the companies expect to open the ETF using a rule from the U.S. Securities and Exchange Commission that allows for certain offerings to avoid the extensive regulatory requirements that have prevented bitcoin ETFs from coming onto the market before now.",
    "Under that rule, VanEck and SolidX will do a private placement of bitcoin ETF shares to qualified institutional buyers. That will allow investment without going through the SEC registration process. Unfortunately, it also means that ordinary investors won't have access to shares of VanEck SolidX Bitcoin Trust.",
    "Bitcoin's rise in 2019 has been impressive, and it's gotten a lot more investors interested in cryptocurrencies again. Yet at least for now, the ease of investing in bitcoin through an ETF still won't be available to individual investors -- even if some hope that VanEck and SolidX's move could push things in the right direction in the future.",
    "10 stocks we like better than Boeing\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Boeing wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Dan Caplinger owns shares of Boeing. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:39:38"
}