{
  "url": "https://www.nasdaq.com/article/jazz-jazz-down-74-since-last-earnings-report-can-it-rebound-cm1208041",
  "title": "Jazz (JAZZ) Down 7.4% Since Last Earnings Report: Can It Rebound? - Nasdaq.com",
  "text": [
    " A month has gone by since the las t earnings  report for Jazz Pharmaceuticals (JAZZ). Shares have lost about 7.4% in that time frame, underperforming the S&P 500. Will the recent negative trend continue leading up to its next earnings release, or is Jazz due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important drivers.  Jazz Pharmaceuticals Q2 Earnings and Sales Beat   Estimates  Jazz Pharmaceuticals delivered adjusted earnings of $4.05 per share for the second quarter of 2019, which surpassed the Zacks Consensus Estimate of $3.57. Earnings rose 16% from the year-ago figure driven by higher sales and lower operating expense. Total revenues in the reported quarter rose 6.7% year over year to $534.1 million and also beat the Zacks Consensus Estimate of $508.31 million. This can be attributed to higher sales of Xyrem, Vyxeos and Defitelio, partially offset by lower sales of Erwinaze.  Quarter in Detail  Net product sales in the reported quarter increased 5.5% from the year-ago quarter to $523.4 million. Royalties and contract revenues rose 144% to $10.7 million in the quarter. Xyremsales rose 16% year over year to $413.2 million in the quarter. Sales were driven by 5% rise in bottle volume growth. The average number of active Xyrem patients increased 6% in the quarter. Volume trends for Xyrem have improved in the past few quarters supported by the company's disease awareness education efforts, driving diagnosis of new narcolepsy patientsErwinaze/Erwinase revenues were $27.6 million, down 53% year over year. Jazz is facing challenges in building sufficient inventory levels for Erwinaze due to constrained manufacturing capacity. This resulted in supply disruptions and hurt sales of Erwinaze in 2017 as well as in 2018. Sales were higher in the first quarter of 2019 due to higher availability of products compared to prior periods. The company expects inter-quarter variability in sales of Erwinaze to continue in 2019. Defitelio sales rose 14% year over year to $46.1 million in the quarter, aided by strong demand and a shipment to Japan following the drug's approval in the country. Defitelio product sales vary from quarter to quarter in both in the United States and EU markets because Defitelio treats an ultra-rare acute condition - hepatic veno-occlusive disease. Vyxeos generated sales of $31.4 million, up 12.2% from the year-ago period primarily due to the rolling launch in EU initiated in September 2018 and strong adoption in first-line setting in the United States. The company has focused its resources to drive adoption of Vyxeos through intensive education and outreach initiatives. Other product sales declined 60% to $5.2 million. Adjusted selling, general and administrative (SG&A) expenses rose 12.8% to $155.3 million owing to higher expenses related to business expansion and costs to support the launch of Sunosi in the United States. Adjusted research and development (R&D) expenses increased 9.8% to $56.5 million, primarily due to escalating expenses related to development of the company's pipeline and partnered programs.  2019 Guidance  The company updated its previously issued guidance for total revenues including the expected sales range for certain products. It continues to expect earnings in the range of $14.30-$15.00 per share in 2019. However, the company now expects total revenues to be higher in the range of $2.07-$2.15 billion compared with the previous range of $2.05-$2.13 billion. Total product sales are predicted in the range of $2.055-$2.125 billion (previously $2.04-$2.11 billion) in 2019. The company raised the guidance for Xyrem sales to the range of $1.55-$1.59 billion from $1.53-$1.57 billion. Erwinaze/Erwinase sales are forecast in the band of $160-$195 million. Defitelio's net sales prediction for 2019 is in the band of $155-$180 million. Vyxeos net sales are expected to in the range of $120-$150 million. While adjusted SG&A expenses are anticipated in the range of $620 million to $650 million, adjusted R&D expenses are expected to be in the band of $235 million to $265 million.   How Have Estimates Been Moving Since Then?  In the past month, investors have witnessed a downward trend in fresh estimates.  VGM Scores  Currently, Jazz has an average Growth Score of C, a grade with the same score on the momentum front. However, the stock was allocated a grade of A on the value side, putting it in the top quintile for this investment strategy. Overall, the stock has an aggregate VGM Score of A. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Jazz has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Jazz Pharmaceuticals PLC (JAZZ): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "A month has gone by since the las t earnings  report for Jazz Pharmaceuticals (JAZZ). Shares have lost about 7.4% in that time frame, underperforming the S&P 500.",
    "Will the recent negative trend continue leading up to its next earnings release, or is Jazz due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important drivers.  Jazz Pharmaceuticals Q2 Earnings and Sales Beat   Estimates  Jazz Pharmaceuticals delivered adjusted earnings of $4.05 per share for the second quarter of 2019, which surpassed the Zacks Consensus Estimate of $3.57. Earnings rose 16% from the year-ago figure driven by higher sales and lower operating expense. Total revenues in the reported quarter rose 6.7% year over year to $534.1 million and also beat the Zacks Consensus Estimate of $508.31 million. This can be attributed to higher sales of Xyrem, Vyxeos and Defitelio, partially offset by lower sales of Erwinaze.  Quarter in Detail  Net product sales in the reported quarter increased 5.5% from the year-ago quarter to $523.4 million. Royalties and contract revenues rose 144% to $10.7 million in the quarter. Xyremsales rose 16% year over year to $413.2 million in the quarter. Sales were driven by 5% rise in bottle volume growth. The average number of active Xyrem patients increased 6% in the quarter. Volume trends for Xyrem have improved in the past few quarters supported by the company's disease awareness education efforts, driving diagnosis of new narcolepsy patientsErwinaze/Erwinase revenues were $27.6 million, down 53% year over year. Jazz is facing challenges in building sufficient inventory levels for Erwinaze due to constrained manufacturing capacity. This resulted in supply disruptions and hurt sales of Erwinaze in 2017 as well as in 2018. Sales were higher in the first quarter of 2019 due to higher availability of products compared to prior periods. The company expects inter-quarter variability in sales of Erwinaze to continue in 2019. Defitelio sales rose 14% year over year to $46.1 million in the quarter, aided by strong demand and a shipment to Japan following the drug's approval in the country. Defitelio product sales vary from quarter to quarter in both in the United States and EU markets because Defitelio treats an ultra-rare acute condition - hepatic veno-occlusive disease. Vyxeos generated sales of $31.4 million, up 12.2% from the year-ago period primarily due to the rolling launch in EU initiated in September 2018 and strong adoption in first-line setting in the United States. The company has focused its resources to drive adoption of Vyxeos through intensive education and outreach initiatives. Other product sales declined 60% to $5.2 million. Adjusted selling, general and administrative (SG&A) expenses rose 12.8% to $155.3 million owing to higher expenses related to business expansion and costs to support the launch of Sunosi in the United States. Adjusted research and development (R&D) expenses increased 9.8% to $56.5 million, primarily due to escalating expenses related to development of the company's pipeline and partnered programs.  2019 Guidance  The company updated its previously issued guidance for total revenues including the expected sales range for certain products. It continues to expect earnings in the range of $14.30-$15.00 per share in 2019. However, the company now expects total revenues to be higher in the range of $2.07-$2.15 billion compared with the previous range of $2.05-$2.13 billion. Total product sales are predicted in the range of $2.055-$2.125 billion (previously $2.04-$2.11 billion) in 2019. The company raised the guidance for Xyrem sales to the range of $1.55-$1.59 billion from $1.53-$1.57 billion. Erwinaze/Erwinase sales are forecast in the band of $160-$195 million. Defitelio's net sales prediction for 2019 is in the band of $155-$180 million. Vyxeos net sales are expected to in the range of $120-$150 million. While adjusted SG&A expenses are anticipated in the range of $620 million to $650 million, adjusted R&D expenses are expected to be in the band of $235 million to $265 million. ",
    " Jazz Pharmaceuticals Q2 Earnings and Sales Beat   Estimates ",
    "Jazz Pharmaceuticals delivered adjusted earnings of $4.05 per share for the second quarter of 2019, which surpassed the Zacks Consensus Estimate of $3.57. Earnings rose 16% from the year-ago figure driven by higher sales and lower operating expense.",
    "Total revenues in the reported quarter rose 6.7% year over year to $534.1 million and also beat the Zacks Consensus Estimate of $508.31 million. This can be attributed to higher sales of Xyrem, Vyxeos and Defitelio, partially offset by lower sales of Erwinaze.",
    " Quarter in Detail ",
    "Net product sales in the reported quarter increased 5.5% from the year-ago quarter to $523.4 million. Royalties and contract revenues rose 144% to $10.7 million in the quarter.",
    "Xyremsales rose 16% year over year to $413.2 million in the quarter. Sales were driven by 5% rise in bottle volume growth. The average number of active Xyrem patients increased 6% in the quarter.",
    "Volume trends for Xyrem have improved in the past few quarters supported by the company's disease awareness education efforts, driving diagnosis of new narcolepsy patientsErwinaze/Erwinase revenues were $27.6 million, down 53% year over year. Jazz is facing challenges in building sufficient inventory levels for Erwinaze due to constrained manufacturing capacity. This resulted in supply disruptions and hurt sales of Erwinaze in 2017 as well as in 2018. Sales were higher in the first quarter of 2019 due to higher availability of products compared to prior periods. The company expects inter-quarter variability in sales of Erwinaze to continue in 2019.",
    "Defitelio sales rose 14% year over year to $46.1 million in the quarter, aided by strong demand and a shipment to Japan following the drug's approval in the country. Defitelio product sales vary from quarter to quarter in both in the United States and EU markets because Defitelio treats an ultra-rare acute condition - hepatic veno-occlusive disease.",
    "Vyxeos generated sales of $31.4 million, up 12.2% from the year-ago period primarily due to the rolling launch in EU initiated in September 2018 and strong adoption in first-line setting in the United States. The company has focused its resources to drive adoption of Vyxeos through intensive education and outreach initiatives.",
    "Other product sales declined 60% to $5.2 million.",
    "Adjusted selling, general and administrative (SG&A) expenses rose 12.8% to $155.3 million owing to higher expenses related to business expansion and costs to support the launch of Sunosi in the United States.",
    "Adjusted research and development (R&D) expenses increased 9.8% to $56.5 million, primarily due to escalating expenses related to development of the company's pipeline and partnered programs.",
    " 2019 Guidance ",
    "The company updated its previously issued guidance for total revenues including the expected sales range for certain products.",
    "It continues to expect earnings in the range of $14.30-$15.00 per share in 2019. However, the company now expects total revenues to be higher in the range of $2.07-$2.15 billion compared with the previous range of $2.05-$2.13 billion.",
    "Total product sales are predicted in the range of $2.055-$2.125 billion (previously $2.04-$2.11 billion) in 2019. The company raised the guidance for Xyrem sales to the range of $1.55-$1.59 billion from $1.53-$1.57 billion. Erwinaze/Erwinase sales are forecast in the band of $160-$195 million.",
    "Defitelio's net sales prediction for 2019 is in the band of $155-$180 million. Vyxeos net sales are expected to in the range of $120-$150 million.",
    "While adjusted SG&A expenses are anticipated in the range of $620 million to $650 million, adjusted R&D expenses are expected to be in the band of $235 million to $265 million.",
    " How Have Estimates Been Moving Since Then? ",
    "In the past month, investors have witnessed a downward trend in fresh estimates.",
    " VGM Scores ",
    "Currently, Jazz has an average Growth Score of C, a grade with the same score on the momentum front. However, the stock was allocated a grade of A on the value side, putting it in the top quintile for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of A. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Jazz has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:31:27"
}