{
  "url": "https://www.nasdaq.com/article/3-big-opportunities-in-ai-chips-and-semiconductor-etfs-cm1210641",
  "title": "3 Big Opportunities in AI Chips and Semiconductor ETFs - Nasdaq.com",
  "text": [
    "‘Great software shines brightest with great hardware underneath’ ~ Google",
    "The growing use of Artificial Intelligence (AI) has created demand for chips that can process AI tasks at a faster pace while using less power. The importance of AI chips is aptly defined in a white paper by the Beijing Innovation Center for Future Chips and Tsinghua University, wherein it states: ‘It is no exaggeration to say, “No chip, no AI” given the irreplaceable role of AI chip as the cornerstone for AI development and its strategic significance.’",
    "AI chips are seen as a catalyst for AI development as well as the semiconductor sector. The new wave of technology is a great opportunity not just for semiconductor vendors but even technology giants and start-ups who are working on innovation in AI chips by taking different approaches to chip acceleration as well as deployment methods.",
    "Here’s a look at the exchange-traded funds (ETFs) that allow investors to invest in a portfolio of such companies while going through some recent updates.",
    "Launched in 2001, the iShares PHLX Semi Semiconductor ETF (SOXX) provides exposure to U.S. companies that design, manufacture and distribute semiconductors. The ETF tracks the PHLX Semiconductor Sector Index and maintains a portfolio of 30 stocks. It is the biggest ETF within this space in terms of assets with $1.71 billion as assets under management. It has an expense ratio of 0.47% and has reported 37.63% year-to-date returns. The top ten holdings add up to almost 62% of the portfolio, and include the following names:",
    "Its top holding Nvidia(NVDA), one of the leading AI accelerators, launched an AI data center platform last year that delivers the most advanced inference acceleration for voice, video, image and recommendation services. Xavier and Voltas are some of its prominent products. In April this year, Lam Research (LRCX)announced that it had set a new benchmark for productivity in semiconductor processing using its self-maintaining equipment. ",
    "VanEck Vectors Semiconductor ETF (SMH) is the second-largest ETF within the space in terms of assets under management. The fund, which was launched in 2011, tracks the MVIS US Listed Semiconductor 25 Index, which is a modified market cap-weighted index comprising of the largest and most liquid U.S. listed companies that derive at least 50% of their revenues from semiconductors. The fund holds a compact portfolio of 25 stocks with majority geographical exposure to the U.S., followed by Taiwan and The Netherlands. The fund has $1.31 billion as assets under management with 0.35% as the expense ratio. It has posted 37.5% returns year-to-date. The top stock holdings have a high concentration at close to 65%; it includes names such as:",
    "Going by the dictum that the right intelligence at the right time is crucial, Intel (INTC) has built dedicated accelerators like the Intel Nervana NNPs. Last month, Intel revealed details of Intel Nervana neural network processors, with the NNP-T for training and the NNP-I for inference. Earlier this year, one of the fund’s other holdings, Qualcomm (QCOM), announced the 4th Generation Qualcomm AI Engine to support the surge of on-device AI voice, camera and AR user experiences based on the Qualcomm Snapdragon 855 Mobile Platform. Further, to meet the explosive demand for AI inference processing in the Cloud, it announced the Qualcomm Cloud AI 100. Qualcomm is treading on its vision of ‘making on-device AI ubiquitous.’",
    "The third-biggest ETF in this space is the SPDR S&P Semiconductor ETF (XSD) that provides an unconcentrated industry exposure across large, mid- and small-cap stocks within the semiconductor segment. The fund was launched in 2006 and has $340.54 million as assets under management. The fund has an expense ratio of 0.35% and has delivered 42.69% year-to-date returns. The ETF is designed to replicate the performance of the S&P Semiconductor Select Industry Index, which is an equal-weighted index which balances the allocation towards holdings and thus reduces the concentration. The fund has around 35% in the top ten stocks, which include:",
    "In February this year, Applied Materials (AMAT)partnered with IBM (IBM) on AI chip technology. This coincided with the launch of IBM Research AI Hardware Center. While Lattice Semiconductor (LSCC)released a new version of sensAI solution stack with a 10x performance boost and other features.",
    "Some of the other ETFs from this space are Invesco Dynamic Semiconductors ETF (PSI), First Trust Nasdaq Semiconductor ETF (FTXL) and Global X Scientific Beta Europe ETF (SCID).",
    "It is estimated that AI-related semiconductors could account for almost 20% of all demand by 2025, which would translate into about $67 billion in revenue. With opportunities emerging at both data centers and the edge, AI accelerators are seen as a solution to keep up with the parallelism required of AI algorithms. IDC estimates that the market of AI accelerators for the internet of things (IoT) edge and primary clients is about to reach 6.1 billion in shipments by 2020. With numerous types of AI chips available for acceleration such as GPUs, FPGA and application-specific integrated circuits (ASIC), companies are competing to capture a share in the growing AI chip market, which is expected to reach $91.18 billion by 2025. This is a fast-growing segment of the $480 billion semiconductor market that investors can play.   ",
    "Disclaimer: The author has no position in any stocks mentioned. Investors should consider the above information not as a de facto recommendation, but as an idea for further consideration. ",
    "Excludes leveraged and inverse ETFs",
    "ETF data as of September 9, 2019, based on fact sheets.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:00:32"
}