{
  "url": "https://www.nasdaq.com/article/yuan-to-weaken-further-as-us-and-china-dig-in-on-trade-war-20190904-01229",
  "title": "Yuan to weaken further as U.S. and China dig in on trade war - Nasdaq.com",
  "text": [
    "By Sumanto Mondal and Hari Kishan",
    "BENGALURU, Sept 5 (Reuters) - Chinese authorities will maintain their tight grip on the yuan and allow it to weaken further against the dollar to fight an ongoing trade war with Washington and a slowing domestic economy, a Reuters poll of strategists showed.",
    "In response to U.S. tariffs on $30 billion of Chinese imports that came into effect this week, the People's Bank of China set its yuan mid-point at an 11-1/2-year low versus the dollar.",
    "The latest Aug. 29-Sept. 4 Reuters poll of nearly 60 strategists showed the yuan is expected to trade around 7.19 to the dollar in six months, over 0.5% weaker than Wednesday's 7.15, before readjusting to 7.16 in a year.",
    "That marks the third month in a row where analysts have lowered their yuan outlook.",
    "\"For currency markets, the last month's tariff-inspired yuan fall is much more important than it would have been were China still a minor player in global trade,\" said Kit Juckes, FX strategist at Societe Generale in London. \"U.S. President Donald Trump will have to wait longer - perhaps a lot longer - before he gets the weaker dollar he craves.\"",
    "Nearly two-thirds of analysts who answered an additional question said China would fight the U.S. trade war by depreciating the yuan further.",
    "\"There's a risk the U.S. retaliates to yuan weakness, or to other currencies falling as a result of the yuan weakening. More tariffs could see more yuan weakness and more risk President Trump reacts to that, too. Dominos can fall over,\" added Juckes.",
    "The most pessimistic 12-month view, 7.75 per dollar in the latest and previous surveys taken after the yuan breached the 7 per dollar rate, is the weakest since polling began more than a decade ago for the currency. That suggests a clear bias towards a further downgrade.",
    "While a weaker yuan is good for the world's largest exporter of manufactured goods, a weaker currency is likely to be limited in its ability to cushion the blow from import taxes imposed by the United States.",
    "\"Weakening the yuan can't benefit exporters if the tariffs are so high that they lose the orders altogether,\" noted Tim Condon at ING in Singapore.",
    "To counter the economic slump, the PBOC reformed its key interest rates last month, establishing the loan prime rate as its main policy rate, aimed at lowering real interest rates for companies as part of broader market reforms. ",
    "About 70% of respondents who answered a separate question said China's decision to change its interest rate system was not a step towards allowing the yuan to trade more freely."
  ],
  "published_datetime": "2019-09-04 10:05:00"
}