{
  "url": "https://www.nasdaq.com/article/new-strong-sell-stocks-for-september-11th-cm1210591",
  "title": "New Strong Sell Stocks for September 11th - Nasdaq.com",
  "text": [
    " Here are 5 stocks added to the Zacks Rank #5 (Strong Sell) List today:  The Bank of N.T. Butterfield & Son Limited NTB  is a full-service bank and wealth manager. The Zacks Consensus Estimate for its current year earnings has been revised 0.6% downward over the last 30 days.  CareTrust REIT, Inc. CTRE  is a self-administered, publicly-traded real estate investment trust. The Zacks Consensus Estimate for its current year earnings has been revised 0.7% downward over the last 30 days.  First Busey Corporation BUSE  is a holding company for Busey Bank and Investors' Security Trust Company. The Zacks Consensus Estimate for its current year earnings has been revised 0.5% downward over the last 30 days.  Ulta Beauty, Inc. ULTA  is a retailer of cosmetics, fragrance, skin care products and hair care products. The Zacks Consensus Estimate for its current year earnings has been revised 7% downward over the last 30 days.  Versum Materials, Inc. VSM  is a specialty materials and equipment supplier to the semiconductor industry. The Zacks Consensus Estimate for its current year earnings has been revised 2.1% downward over the last 30 days. View the entire  Zacks Rank #5 List  .   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Bank of N.T. Butterfield & Son Limited (The) (NTB): Free Stock Analysis Report   First Busey Corporation (BUSE): Free Stock Analysis Report   Versum Materials Inc. (VSM): Free Stock Analysis Report   Ulta Beauty Inc. (ULTA): Free Stock Analysis Report   CareTrust REIT, Inc. (CTRE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Here are 5 stocks added to the Zacks Rank #5 (Strong Sell) List today:",
    " The Bank of N.T. Butterfield & Son Limited NTB  is a full-service bank and wealth manager. The Zacks Consensus Estimate for its current year earnings has been revised 0.6% downward over the last 30 days.",
    " CareTrust REIT, Inc. CTRE  is a self-administered, publicly-traded real estate investment trust. The Zacks Consensus Estimate for its current year earnings has been revised 0.7% downward over the last 30 days.",
    " First Busey Corporation BUSE  is a holding company for Busey Bank and Investors' Security Trust Company. The Zacks Consensus Estimate for its current year earnings has been revised 0.5% downward over the last 30 days.",
    " Ulta Beauty, Inc. ULTA  is a retailer of cosmetics, fragrance, skin care products and hair care products. The Zacks Consensus Estimate for its current year earnings has been revised 7% downward over the last 30 days.",
    " Versum Materials, Inc. VSM  is a specialty materials and equipment supplier to the semiconductor industry. The Zacks Consensus Estimate for its current year earnings has been revised 2.1% downward over the last 30 days.",
    "View the entire  Zacks Rank #5 List  .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 12:05:00"
}