{
  "url": "https://www.nasdaq.com/article/german-software-firm-teamviewers-ipo-already-oversubscribed-20190912-00194",
  "title": "German software firm TeamViewer's IPO already oversubscribed - Nasdaq.com",
  "text": [
    "BERLIN, Sept 12 (Reuters) - The initial public offering for German software company TeamViewer was immediately oversubscribed when its shares went on offer on Thursday, putting it on track to reach the 5.5 billion euro ($6.1 billion) valuation it is seeking.",
    "One of the bookrunners handling what is one of the biggest IPOs in Europe this year said the books were oversubscribed on the full deal, including the greenshoe and upsize options.",
    "TeamViewer sells software for online meetings and remote desktop access, with more than 20 million support sessions taking place each day on its platform. Unlike many other tech companies going public, TeamViewer is already profitable.",
    "TeamViewer said the price range implied a total market capitalisation of between 4.7 billion and 5.5 billion euros, with the free float ranging from 30% to 42% of the firm's shares depending on the total offer size.",
    "The offer period is set to run from Sept. 12-24, with the first day of trading planned for Sept. 25.",
    "After a steady stream of stock market listings last year, IPOs have slowed in Germany in 2019, with Volkswagen VOWG_p.DE truck unit Traton  being the only sizeable Frankfurt of the year.",
    "Permira  bought TeamViewer for 870 million euros in 2014 and Permira'sGermany head Joerg Rockenhaeuser said the investor wanted to remain a major shareholder after the IPO.",
    "TeamViewer says that its addressable market, currently worth 10 billion euros will grow to 30 billion in 2023, as companies invest in digitally controlling their production machines and the trend of employees working from home intensifies.",
    "Listed peers include Zoom Video Communications Inc , Okta Inc  and Slack Technologies Inc , which listed on the New York Stock Exchange in June at a blockbuster valuation of more than 50 times its revenue. ",
    "Goldman Sachs and Morgan Stanley are organising the IPO with the help of Bank of America, Barclays and RBC Capital Markets, while Lilja & Co is acting as IPO adviser.",
    "($1 = 0.9070 euros)"
  ],
  "published_datetime": "2019-09-12 06:35:00"
}