{
  "url": "https://www.nasdaq.com/article/burlington-stores-burl-is-an-incredible-growth-stock-3-reasons-why-cm1207243",
  "title": "Burlington Stores (BURL) is an Incredible Growth Stock: 3 Reasons Why - Nasdaq.com",
  "text": [
    " Investors seek growth stocks to capitalize on above-average growth in financials that help these securities grab the market's attention and produce exceptional returns. But finding a growth stock that can live up to its true potential can be a tough task. By their very nature, these stocks carry above-average risk and volatility. Moreover, if a company's growth story is over or nearing its end, betting on it could lead to significant loss. However, the Zacks Growth Style Score (part of the Zacks Style Scores  system), which looks beyond the traditional growth attributes to analyze a company's real growth prospects, makes it pretty easy to find cutting-edge growth stocks. Our proprietary system currently recommends Burlington Stores (BURL) as one such stock. This company not only has a favorable Growth Score, but also carries a top Zacks Rank. Studies have shown that stocks with the best growth features consistently outperform the market. And for stocks that have a combination of a Growth Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 (Buy), returns are even better. Here are three of the most important factors that make the stock of this discount retailer a great growth pick right now.  Earnings Growth  Arguably nothing is more important than earnings growth, as surging profit levels is what most investors are after. And for growth investors, double-digi t earnings  growth is definitely preferable, and often an indication of strong prospects (and stock price gains) for the company under consideration. While the historical EPS growth rate for Burlington Stores is 38.6%, investors should actually focus on the projected growth. The company's EPS is expected to grow 11.5% this year, crushing the industry average, which calls for EPS growth of 9.3%.  Cash Flow Growth  Cash is the lifeblood of any business, but higher-than-average cash flow growth is more beneficial and important for growth-oriented companies than for mature companies. That's because, high cash accumulation enables these companies to undertake new projects without raising expensive outside funds. Right now, year-over-year cash flow growth for Burlington Stores is 29.7%, which is higher than many of its peers. In fact, the rate compares to the industry average of 9.4%. While investors should actually consider the current cash flow growth, it's worth taking a look at the historical rate too for putting the current reading into proper perspective. The company's annualized cash flow growth rate has been 22.3% over the past 3-5 years versus the industry average of 7.4%.  Promising Earnings Estimate Revisions  Superiority of a stock in terms of the metrics outlined above can be further validated by looking at the trend in earnings estimate revisions. A positive trend is of course favorable here. Empirical research shows that there is a strong correlation between trends in earnings estimate revisions and near-term stock price movements. There have been upward revisions in current-year earnings estimates for Burlington Stores. The Zacks Consensus Estimate for the current year has surged 3% over the past month.  Bottom Line  Burlington Stores has not only earned a Growth Score of A based on a number of factors, including the ones discussed above, but it also carries a Zacks Rank #2 because of the positive earnings estimate revisions. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  . This combination indicates that Burlington Stores is a potential outperformer and a solid choice for growth investors.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Burlington Stores, Inc. (BURL): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors seek growth stocks to capitalize on above-average growth in financials that help these securities grab the market's attention and produce exceptional returns. But finding a growth stock that can live up to its true potential can be a tough task.",
    "By their very nature, these stocks carry above-average risk and volatility. Moreover, if a company's growth story is over or nearing its end, betting on it could lead to significant loss.",
    "However, the Zacks Growth Style Score (part of the Zacks Style Scores  system), which looks beyond the traditional growth attributes to analyze a company's real growth prospects, makes it pretty easy to find cutting-edge growth stocks.",
    "Our proprietary system currently recommends Burlington Stores (BURL) as one such stock. This company not only has a favorable Growth Score, but also carries a top Zacks Rank.",
    "Studies have shown that stocks with the best growth features consistently outperform the market. And for stocks that have a combination of a Growth Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 (Buy), returns are even better.",
    "Here are three of the most important factors that make the stock of this discount retailer a great growth pick right now.",
    " Earnings Growth ",
    "Arguably nothing is more important than earnings growth, as surging profit levels is what most investors are after. And for growth investors, double-digi t earnings  growth is definitely preferable, and often an indication of strong prospects (and stock price gains) for the company under consideration.",
    "While the historical EPS growth rate for Burlington Stores is 38.6%, investors should actually focus on the projected growth. The company's EPS is expected to grow 11.5% this year, crushing the industry average, which calls for EPS growth of 9.3%.",
    " Cash Flow Growth ",
    "Cash is the lifeblood of any business, but higher-than-average cash flow growth is more beneficial and important for growth-oriented companies than for mature companies. That's because, high cash accumulation enables these companies to undertake new projects without raising expensive outside funds.",
    "Right now, year-over-year cash flow growth for Burlington Stores is 29.7%, which is higher than many of its peers. In fact, the rate compares to the industry average of 9.4%.",
    "While investors should actually consider the current cash flow growth, it's worth taking a look at the historical rate too for putting the current reading into proper perspective. The company's annualized cash flow growth rate has been 22.3% over the past 3-5 years versus the industry average of 7.4%.",
    " Promising Earnings Estimate Revisions ",
    "Superiority of a stock in terms of the metrics outlined above can be further validated by looking at the trend in earnings estimate revisions. A positive trend is of course favorable here. Empirical research shows that there is a strong correlation between trends in earnings estimate revisions and near-term stock price movements.",
    "There have been upward revisions in current-year earnings estimates for Burlington Stores. The Zacks Consensus Estimate for the current year has surged 3% over the past month.",
    " Bottom Line ",
    "Burlington Stores has not only earned a Growth Score of A based on a number of factors, including the ones discussed above, but it also carries a Zacks Rank #2 because of the positive earnings estimate revisions.",
    "You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .",
    "This combination indicates that Burlington Stores is a potential outperformer and a solid choice for growth investors.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:45:06"
}