{
  "url": "https://www.nasdaq.com/article/should-value-investors-buy-target-tgt-stock-cm1210351",
  "title": "Should Value Investors Buy Target (TGT) Stock? - Nasdaq.com",
  "text": [
    " Here at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks. Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks. Looking at the history of these trends, perhaps none is more beloved than value investing. This strategy simply looks to identify companies that are being undervalued by the broader market. Value investors use tried-and-true metrics and fundamental analysis to find companies that they believe are undervalued at their current share price levels. Zacks has developed the innovative Style Scores system to highlight stocks with specific traits. For example, value investors will be interested in stocks with great grades in the \"Value\" category. When paired with a high Zacks Rank, \"A\" grades in the Value category are among the strongest value stocks on the market today. One company to watch right now is Target (TGT). TGT is currently holding a Zacks Rank of #2 (Buy) and a Value grade of A. The stock is trading with a P/E ratio of 17.04, which compares to its industry's average of 23.24. Over the past 52 weeks, TGT's Forward P/E has been as high as 17.34 and as low as 10.95, with a median of 13.71. Investors should also recognize that TGT has a P/B ratio of 4.66. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. This company's current P/B looks solid when compared to its industry's average P/B of 11.40. Over the past 12 months, TGT's P/B has been as high as 4.74 and as low as 2.88, with a median of 3.71. Value investors also use the P/S ratio. The P/S ratio is is calculated as price divided by sales. This is a prefered metric because revenue can't really be manipulated, so sales are often a truer performance indicator. TGT has a P/S ratio of 0.72. This compares to its industry's average P/S of 0.8. Finally, investors should note that TGT has a P/CF ratio of 9.84. This figure highlights a company's operating cash flow and can be used to find firms that are undervalued when considering their impressive cash outlook. This stock's P/CF looks attractive against its industry's average P/CF of 22.77. TGT's P/CF has been as high as 10.01 and as low as 5.67, with a median of 7.70, all within the past year. Value investors will likely look at more than just these metrics, but the above data helps show that Target is likely undervalued currently. And when considering the strength of its earnings outlook, TGT sticks out at as one of the market's strongest value stocks.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Target Corporation (TGT): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Here at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks. Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks.",
    "Looking at the history of these trends, perhaps none is more beloved than value investing. This strategy simply looks to identify companies that are being undervalued by the broader market. Value investors use tried-and-true metrics and fundamental analysis to find companies that they believe are undervalued at their current share price levels.",
    "Zacks has developed the innovative Style Scores system to highlight stocks with specific traits. For example, value investors will be interested in stocks with great grades in the \"Value\" category. When paired with a high Zacks Rank, \"A\" grades in the Value category are among the strongest value stocks on the market today.",
    "One company to watch right now is Target (TGT). TGT is currently holding a Zacks Rank of #2 (Buy) and a Value grade of A. The stock is trading with a P/E ratio of 17.04, which compares to its industry's average of 23.24. Over the past 52 weeks, TGT's Forward P/E has been as high as 17.34 and as low as 10.95, with a median of 13.71.",
    "Investors should also recognize that TGT has a P/B ratio of 4.66. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. This company's current P/B looks solid when compared to its industry's average P/B of 11.40. Over the past 12 months, TGT's P/B has been as high as 4.74 and as low as 2.88, with a median of 3.71.",
    "Value investors also use the P/S ratio. The P/S ratio is is calculated as price divided by sales. This is a prefered metric because revenue can't really be manipulated, so sales are often a truer performance indicator. TGT has a P/S ratio of 0.72. This compares to its industry's average P/S of 0.8.",
    "Finally, investors should note that TGT has a P/CF ratio of 9.84. This figure highlights a company's operating cash flow and can be used to find firms that are undervalued when considering their impressive cash outlook. This stock's P/CF looks attractive against its industry's average P/CF of 22.77. TGT's P/CF has been as high as 10.01 and as low as 5.67, with a median of 7.70, all within the past year.",
    "Value investors will likely look at more than just these metrics, but the above data helps show that Target is likely undervalued currently. And when considering the strength of its earnings outlook, TGT sticks out at as one of the market's strongest value stocks.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:10:21"
}