{
  "url": "https://www.nasdaq.com/article/south-africa-to-hold-rates-on-sept-19-awaiting-ratings-review-20190912-00029",
  "title": "South Africa to hold rates on Sept. 19, awaiting ratings review - Nasdaq.com",
  "text": [
    "By Vuyani Ndaba",
    "JOHANNESBURG, Sept 12 (Reuters) - The South African Reserve Bank will keep its repo rate unchanged on Sept. 19 despite a benign inflation outlook, a Reuters poll found, and any further rate cuts will likely hinge on a potentially game-changing credit rating review in November.",
    "On Tuesday, Moody's sounded optimistic it would offer a reprieve from a credit rating cut to junk status - at least in the short term - but as it awaits that final decision, the SARB will for now hold back from providing stimulus to an economy heavily in distress. ",
    "Moody's is the only major ratings agency that still reckons South Africa's debt denominated in rands is investment grade. If downgraded to \"junk\", passive funds would automatically sell and cause a significant weakening of the currency.",
    "So, 20 of 25 economists surveyed by Reuters in the past week expected the repo rate to be kept on hold at 6.50% next week when the Bank holds its penultimate meeting of the year, with a cut to 6.25% not expected until May 2020.",
    "\"We expect the SARB to pause at the upcoming MPC meeting,\" said Elna Moolman, an economist at Standard Bank, citing the Moody's review, an upcoming budget and how a long-awaited turnaround plan for Eskom pans out as reasons.",
    "However, economists have said rate cuts won't necessarily change the face of a structurally hamstrung economy but rather soften the blow. A 25 basis point cut is predicted by the remaining five economists this month.",
    "The central bank has room to move as inflation is expected to average 4.3 percent this year, just below the midpoint of the Bank's 3-6% target range.",
    "\"Given the low inflation environment of contained electricity and food prices, another rate cut to 6.25% is likely in H1 2020, especially if we see a further escalation of the U.S.-China trade war,\" said Francesca Beausang, a senior economist at Continuum Economics.",
    "Ministers from Beijing and Washington are likely to meet in early October, presenting an opportunity for a trade deal but discussions have gone awry before and the rand could see some volatility before then.",
    "In the meantime the rand  is expected to keep clawing back losses made since the year began. EMRG/POLL",
    "Growth is expected at 0.6 percent this year, accelerating to 1.3 percent next year, still not quite enough to get more South Africans into work. Almost a third of the labour force in Africa's most industrialized nation is jobless.",
    "President Cyril Ramaphosa's ascension to power last year promised to attract much needed foreign investment that would create more jobs, but that has not yet happened."
  ],
  "published_datetime": "2019-09-12 01:15:00"
}