{
  "url": "https://www.nasdaq.com/article/apollo-global-apo-looks-good-stock-adds-53-in-session-cm1208128",
  "title": "Apollo Global (APO) Looks Good: Stock Adds 5.3% in Session - Nasdaq.com",
  "text": [
    "Apollo Global Management, LLCAPO was a big mover last session, as the company saw its shares rise more than 5% on the day. The move came on solid volume too with far more shares changing hands than in a normal session. This continues the recent uptrend for the company-as the stock is now up 23.3% in the past one-month time frame.\r\n The company has seen no changes when it comes to estimate revision over the past few weeks, while the Zacks Consensus Estimate for the current quarter has also remained unchanged. The recent price action is encouraging though, so make sure to keep a close watch on this firm in the near future.\r\n Apollo Global currently has a Zacks Rank #3 (Hold) while its Earnings ESP is 0.00%.  ",
    "Apollo Global Management, LLC Price",
    "Apollo Global Management, LLC price | Apollo Global Management, LLC Quote",
    "Investors interested in the Financial - Investment Management industry may consider Virtus Investment Partners, Inc. VRTS which has a Zacks Rank #1 (Strong Buy).\r\n Is APO going up? Or down? Predict to see what others think: Up or Down",
    "It's Illegal in 42 States, But Investors Will Make Billions Legally\r\n In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.\r\n That's twice as much as they spend on marijuana, legally or otherwise.\r\n Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.\r\n See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:18:00"
}