{
  "url": "https://www.nasdaq.com/article/turkeys-central-bank-cuts-rates-325-points-in-second-easing-move-20190912-00261",
  "title": "Turkey's central bank cuts rates 325 points in second easing move - Nasdaq.com",
  "text": [
    "By Daren Butler and Ezgi Erkoyun",
    "ISTANBUL, Sept 12 (Reuters) - Turkey's central bank cut its policy rate by 325 basis points to 16.5% on Thursday, delivering its second aggressive policy easing in less than two months as it seeks to boost a recession-hit economy and put last year's currency crisis behind it.",
    "The bank cited a recent decline in inflation and a global shift to easier monetary policy as it lowered its benchmark one-week repo rate  from 19.75%, marking its latest step away from the emergency settings adopted last year.",
    "\"At this point the current monetary policy stance, to a large part, is considered to be consistent with the projected disinflation path,\" the central bank said in a statement.",
    "The \"inflation outlook continued to improve\" and in August \"displayed a significant fall\", it added.",
    "The Turkish lira lost some 30% of its value against the dollar last year and inflation soared to a 15-year high above 25%. Inflation has since eased to 15% and is expected to fall briefly to single digits in October thanks to the \"base effect\" measurement against last year's spike.",
    "The decline in inflation and a shift among the world's major central banks to more accommodation has stemmed further losses in the lira this year and paved the way for the Turkish rate cuts, which are set to continue until year end according to economists.",
    "The lira  firmed to 5.6825 against the dollar after the announcement from 5.7500 beforehand, and was up about 1% on the day on relief that the central bank did not slash rates far more than initially expected.",
    "According to a Reuters poll on Tuesday, economists expected the bank to lower rates by a median of 250 basis points. However before the decision, swap-market traders were expecting a cut of between 300 and 400 points. ",
    "Central bank governor Murat Uysal, appointed by Turkish President Tayyip Erdogan in early July after his predecessor did not follow policy instructions, has said policy will aim to deliver a \"reasonable\" real interest rate.",
    "Erdogan is a self-described \"enemy\" of high interest rates and has said they, along with inflation, would fall to single digits in a short time.",
    "On Thursday, the central bank said a \"cautious\" policy stance was necessary to keep the \"disinflation process on track.\" It added that inflation will likely slide \"slightly below\" its year-end forecast of 13.9%, which it made in July.",
    "Ankara has attempted to boost lending by state banks to reinvigorate an economy that entered a recession last year and experienced contractions in the first two quarters of this year."
  ],
  "published_datetime": "2019-09-12 07:11:00"
}