{
  "url": "https://www.nasdaq.com/article/why-oil-and-gas-stocks-are-popping-today-cm1207555",
  "title": "Why Oil and Gas Stocks Are Popping Today - Nasdaq.com",
  "text": [
    "  What happened  Oil prices bounced back on Wednesday. The U.S. oil benchmark,   WTI, surged more than 4% to around $55 a barrel, which reversed   yesterday's 2.1% slide, and then some. This rally fueled a rebound in most   energy stocks    . Leading the way was   Whiting Petroleum    (NYSE: WLL) ,   Antero Resources    (NYSE: AR) , and   Nabors Industries    (NYSE: NBR) , which were all up more than 10% by 2:30 p.m.   EDT.  So what  Fueling today's rally in the oil market was growing   geopolitical optimism and forecasts that U.S. oil inventory   levels will continue falling. Most analysts expect that the U.S.   Government will report a 3 million barrel decline in crude oil   storage levels this week. That would mark the third straight   drop, which would imply that demand growth remains healthy.makeArticleAd();   Image source: Getty Images.  With oil making a big move today, oil and gas stocks are   following suit. That's because they make more money at higher    oil   prices    . Whiting and Antero both have lots of leverage to the oil   market, which is why they were among the biggest movers. Whiting gets 81% of its production from oil and natural gas   liquids (NGLs), which derive their value from crude prices.   That's the fourth-highest percentage in its peer group. Because   of that, when crude makes a big move, it will have a notable   impact on Whiting's cash flow as long as it's sustainable. Antero Resources, meanwhile, primarily produces natural gas.   However, it's also the nation's second-largest NGL producer.   Because of that, it has significant exposure to the oil market,   which causes volatility in its cash flow when crude prices   fluctuate. With oil heading higher today, its cash flow could   improve as long as this trend continues. Nabors Industries, on the other hand, doesn't produce any oil   or natural gas. Instead, it operates rigs that drill new wells   for producers. Demand for Nabors' rigs tends to ebb and flow with   oil prices. Given that crude had been in a   slump over the past few months    , the rig market has softened. While Nabors currently expects   that trend to continue throughout the third quarter, a bounce   back in oil prices due to improving market conditions would   likely put an end to that slide.  Now what  The primary driver of today's rebound in the oil market wasn't   data but hope. Because of that, crude prices could quickly   reverse course if the government's storage numbers don't decline   as much as analysts expect or if macro-economic data   deteriorates. That's why investors should avoid buying oil stocks solely   based on today's optimism. Instead, they should wait to see if   the data supports the view that market conditions are improving   before buying, to potentially profit on a rebound.   10 stocks we like better than Whiting     Petroleum       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Whiting Petroleum wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Matthew DiLallo      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Oil prices bounced back on Wednesday. The U.S. oil benchmark,   WTI, surged more than 4% to around $55 a barrel, which reversed   yesterday's 2.1% slide, and then some.",
    "This rally fueled a rebound in most   energy stocks    . Leading the way was   Whiting Petroleum    (NYSE: WLL) ,   Antero Resources    (NYSE: AR) , and   Nabors Industries    (NYSE: NBR) , which were all up more than 10% by 2:30 p.m.   EDT.",
    "Fueling today's rally in the oil market was growing   geopolitical optimism and forecasts that U.S. oil inventory   levels will continue falling. Most analysts expect that the U.S.   Government will report a 3 million barrel decline in crude oil   storage levels this week. That would mark the third straight   drop, which would imply that demand growth remains healthy.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "With oil making a big move today, oil and gas stocks are   following suit. That's because they make more money at higher    oil   prices    . Whiting and Antero both have lots of leverage to the oil   market, which is why they were among the biggest movers.",
    "Whiting gets 81% of its production from oil and natural gas   liquids (NGLs), which derive their value from crude prices.   That's the fourth-highest percentage in its peer group. Because   of that, when crude makes a big move, it will have a notable   impact on Whiting's cash flow as long as it's sustainable.",
    "Antero Resources, meanwhile, primarily produces natural gas.   However, it's also the nation's second-largest NGL producer.   Because of that, it has significant exposure to the oil market,   which causes volatility in its cash flow when crude prices   fluctuate. With oil heading higher today, its cash flow could   improve as long as this trend continues.",
    "Nabors Industries, on the other hand, doesn't produce any oil   or natural gas. Instead, it operates rigs that drill new wells   for producers. Demand for Nabors' rigs tends to ebb and flow with   oil prices. Given that crude had been in a   slump over the past few months    , the rig market has softened. While Nabors currently expects   that trend to continue throughout the third quarter, a bounce   back in oil prices due to improving market conditions would   likely put an end to that slide.",
    "The primary driver of today's rebound in the oil market wasn't   data but hope. Because of that, crude prices could quickly   reverse course if the government's storage numbers don't decline   as much as analysts expect or if macro-economic data   deteriorates.",
    "That's why investors should avoid buying oil stocks solely   based on today's optimism. Instead, they should wait to see if   the data supports the view that market conditions are improving   before buying, to potentially profit on a rebound.",
    "  10 stocks we like better than Whiting     Petroleum       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Whiting Petroleum wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Whiting     Petroleum       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Whiting Petroleum wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Matthew DiLallo      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 04:09:00"
}