{
  "url": "https://www.nasdaq.com/article/why-is-editas-edit-down-55-since-last-earnings-report-cm1208052",
  "title": "Why Is Editas (EDIT) Down 5.5% Since Last Earnings Report? - Nasdaq.com",
  "text": [
    " It has been about a month since the las t earnings  report for Editas Medicine (EDIT). Shares have lost about 5.5% in that time frame, underperforming the S&P 500. Will the recent negative trend continue leading up to its next earnings release, or is Editas due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important drivers.  Editas Misses on Q2 Earnings & Sales  Editas incurred a loss of 69 cents per share in the second quarter of 2019, wider than the Zacks Consensus Estimate of 59 cents but narrower than the year-ago quarter's loss of 82 cents. Collaboration and other research and development revenues comprising the company's total revenues, came in at $2.3 million, down 68.9% year over year. Moreover, the top line missed the Zacks Consensus Estimate of $6 million. Editas has no approved product in its portfolio at the moment. The company generates collaboration revenues and other research and development revenues. Collaboration revenues declined in the quarter due to lower revenues recognized under Editas' collaboration with Celgene.  Quarter in Detail  In the reported quarter, research and development expenses were $23.6 million, down 27.8% from the year-ago figure, mainly owing to lower spending associated with the sublicensing and success payment expenses. General and administrative expenses were almost flat year over year at $14.4 million.   How Have Estimates Been Moving Since Then?  It turns out, fresh estimates have trended downward during the past month. The consensus estimate has shifted -7% due to these changes.  VGM Scores  Currently, Editas has a subpar Growth Score of D, however its Momentum Score is doing a lot better with a B. However, the stock was allocated a grade of F on the value side, putting it in the fifth quintile for this investment strategy. Overall, the stock has an aggregate VGM Score of F. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending downward for the stock, and the magnitude of this revision indicates a downward shift. Notably, Editas has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Editas Medicine, Inc. (EDIT): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "It has been about a month since the las t earnings  report for Editas Medicine (EDIT). Shares have lost about 5.5% in that time frame, underperforming the S&P 500.",
    "Will the recent negative trend continue leading up to its next earnings release, or is Editas due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important drivers.  Editas Misses on Q2 Earnings & Sales  Editas incurred a loss of 69 cents per share in the second quarter of 2019, wider than the Zacks Consensus Estimate of 59 cents but narrower than the year-ago quarter's loss of 82 cents. Collaboration and other research and development revenues comprising the company's total revenues, came in at $2.3 million, down 68.9% year over year. Moreover, the top line missed the Zacks Consensus Estimate of $6 million. Editas has no approved product in its portfolio at the moment. The company generates collaboration revenues and other research and development revenues. Collaboration revenues declined in the quarter due to lower revenues recognized under Editas' collaboration with Celgene.  Quarter in Detail  In the reported quarter, research and development expenses were $23.6 million, down 27.8% from the year-ago figure, mainly owing to lower spending associated with the sublicensing and success payment expenses. General and administrative expenses were almost flat year over year at $14.4 million. ",
    " Editas Misses on Q2 Earnings & Sales ",
    "Editas incurred a loss of 69 cents per share in the second quarter of 2019, wider than the Zacks Consensus Estimate of 59 cents but narrower than the year-ago quarter's loss of 82 cents.",
    "Collaboration and other research and development revenues comprising the company's total revenues, came in at $2.3 million, down 68.9% year over year. Moreover, the top line missed the Zacks Consensus Estimate of $6 million.",
    "Editas has no approved product in its portfolio at the moment. The company generates collaboration revenues and other research and development revenues. Collaboration revenues declined in the quarter due to lower revenues recognized under Editas' collaboration with Celgene.",
    " Quarter in Detail ",
    "In the reported quarter, research and development expenses were $23.6 million, down 27.8% from the year-ago figure, mainly owing to lower spending associated with the sublicensing and success payment expenses.",
    "General and administrative expenses were almost flat year over year at $14.4 million.",
    " How Have Estimates Been Moving Since Then? ",
    "It turns out, fresh estimates have trended downward during the past month. The consensus estimate has shifted -7% due to these changes.",
    " VGM Scores ",
    "Currently, Editas has a subpar Growth Score of D, however its Momentum Score is doing a lot better with a B. However, the stock was allocated a grade of F on the value side, putting it in the fifth quintile for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of F. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending downward for the stock, and the magnitude of this revision indicates a downward shift. Notably, Editas has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:31:24"
}