{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-caterpillar-general-motors-citigroup-northrop-grumman-and-walgreens-boots-cm1210314",
  "title": "The Zacks Analyst Blog Highlights: Caterpillar, General Motors, Citigroup, Northrop Grumman and Walgreens Boots - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 11, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Caterpillar CAT  , General Motors GM  , Citigroup C  , Northrop Grumman NOC  and Walgreens Boots Alliance WBA  .  Here are highlights from Monday's Analyst Blog:    Top Analyst Reports for Caterpillar, General Motors and     Citigroup   The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Caterpillar, General Motors and Citigroup. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today. You can see    all of    today's research reports here     >>>     Caterpillar  's shares have outperformed the Zacks Construction and Mining industry (0.2% vs. 0.1%) in the year-to-date period. The Zacks analyst thinks that Caterpillar's global machine sales growth rate has been on a downward spiral over the past few months, which is concerning. Notably, the company's July global retail sales growth of 4% was marked as the lowest so far this year. The company anticipates earnings per share on the lower end of its guidance of $12.06-$13.06 and sales growth to be modest for 2019. In the Construction Industries segment, North America will likely aid growth while China will be a headwind. Improving commodity prices will support capital expenditure in the mining sector, which will drive the Resource Industries segment. Investments in expanded offerings and services, and digital initiatives like e-commerce will also fuel growth. Its cost-reduction efforts will help sustain margins despite material cost inflation owing to tariffs. (You can    read the full research report on Caterpillar here     >>>    ). Shares of General Motors  have outperformed the Zacks Domestic Automotive industry over the past six months, gaining 2.5% vs -2%. The Zacks analyst believes that strong demand for profitable trucks and SUVs is aiding General Motors' revenues. The company's hot-selling brands in America like Chevrolet Silverado, Equinox and GMC Sierra are driving the top line. The firm is increasing capacity investment in emerging markets to enhance global sales, and is undertaking several initiatives to make its vehicles more advanced, safer and fuel efficient. However, high cost of raw materials and rising tariffs amid heightening U.S.-Sino trade tiff may put pressure on the firm's profitability. As it is, the company's negative free cash flows and high debt load are causes of worry. Further, frequent recalls act as a headwind. As such, investors are recommended to wait for a better entry point. (You can    read the full research report on General Motors here     >>>    ).  Citigroup  's shares have gained 10.4% over the past six months, outperforming the Zacks Major Regional Banks industry, which has gained 2.6% over the same period. The Zacks analyst believes that Citigroup's streamlining efforts, along with strategic investments in core business, bode well for the long term. Also, a declining cost base supports its bottom-line improvement. Steady capital-deployment activities are also commendable. However, pending litigation issues might keep legal expenses elevated. Further, decline in fee income is a concern for the company. Recently, at an investors' conference, chief financial officer Mark Mason commented that trading and investment banking revenues are expected to decline in third-quarter 2019. Further, NII outlook has also been lowered amid more Fed rate cut expectations. (You can    read the full research report on Citigroup here     >>>    ). Other noteworthy reports we are featuring today include Northrop Grumman and Walgreens Boots Alliance.  More Stock News: This Is Bigger than the iPhone!  It could become the mother of all technological revolutions. Apple sold a mere 1 billion iPhones in 10 years but a new breakthrough is expected to generate more than 27 billion devices in just 3 years, creating a $1.7 trillion market. Zacks has just released a Special Report that spotlights this fast-emerging phenomenon and 6 tickers for taking advantage of it. If you don't buy now, you may kick yourself in 2020.    Click here for the 6 trades >>    Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Citigroup Inc. (C): Free Stock Analysis Report   Northrop Grumman Corporation (NOC): Free Stock Analysis Report   General Motors Company (GM): Free Stock Analysis Report   Caterpillar Inc. (CAT): Free Stock Analysis Report   Walgreens Boots Alliance, Inc. (WBA): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 11, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Caterpillar CAT  , General Motors GM  , Citigroup C  , Northrop Grumman NOC  and Walgreens Boots Alliance WBA  .",
    " Here are highlights from Monday's Analyst Blog: ",
    "  Top Analyst Reports for Caterpillar, General Motors and     Citigroup  ",
    "The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Caterpillar, General Motors and Citigroup. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.",
    "You can see    all of    today's research reports here     >>>   ",
    " Caterpillar  's shares have outperformed the Zacks Construction and Mining industry (0.2% vs. 0.1%) in the year-to-date period. The Zacks analyst thinks that Caterpillar's global machine sales growth rate has been on a downward spiral over the past few months, which is concerning.",
    "Notably, the company's July global retail sales growth of 4% was marked as the lowest so far this year. The company anticipates earnings per share on the lower end of its guidance of $12.06-$13.06 and sales growth to be modest for 2019. In the Construction Industries segment, North America will likely aid growth while China will be a headwind.",
    "Improving commodity prices will support capital expenditure in the mining sector, which will drive the Resource Industries segment. Investments in expanded offerings and services, and digital initiatives like e-commerce will also fuel growth. Its cost-reduction efforts will help sustain margins despite material cost inflation owing to tariffs.",
    "(You can    read the full research report on Caterpillar here     >>>    ).",
    "Shares of General Motors  have outperformed the Zacks Domestic Automotive industry over the past six months, gaining 2.5% vs -2%. The Zacks analyst believes that strong demand for profitable trucks and SUVs is aiding General Motors' revenues.",
    "The company's hot-selling brands in America like Chevrolet Silverado, Equinox and GMC Sierra are driving the top line. The firm is increasing capacity investment in emerging markets to enhance global sales, and is undertaking several initiatives to make its vehicles more advanced, safer and fuel efficient.",
    "However, high cost of raw materials and rising tariffs amid heightening U.S.-Sino trade tiff may put pressure on the firm's profitability. As it is, the company's negative free cash flows and high debt load are causes of worry. Further, frequent recalls act as a headwind. As such, investors are recommended to wait for a better entry point.",
    "(You can    read the full research report on General Motors here     >>>    ).",
    " Citigroup  's shares have gained 10.4% over the past six months, outperforming the Zacks Major Regional Banks industry, which has gained 2.6% over the same period.",
    "The Zacks analyst believes that Citigroup's streamlining efforts, along with strategic investments in core business, bode well for the long term. Also, a declining cost base supports its bottom-line improvement.",
    "Steady capital-deployment activities are also commendable. However, pending litigation issues might keep legal expenses elevated. Further, decline in fee income is a concern for the company. Recently, at an investors' conference, chief financial officer Mark Mason commented that trading and investment banking revenues are expected to decline in third-quarter 2019. Further, NII outlook has also been lowered amid more Fed rate cut expectations.",
    "(You can    read the full research report on Citigroup here     >>>    ).",
    "Other noteworthy reports we are featuring today include Northrop Grumman and Walgreens Boots Alliance.",
    " More Stock News: This Is Bigger than the iPhone! ",
    "It could become the mother of all technological revolutions. Apple sold a mere 1 billion iPhones in 10 years but a new breakthrough is expected to generate more than 27 billion devices in just 3 years, creating a $1.7 trillion market.",
    "Zacks has just released a Special Report that spotlights this fast-emerging phenomenon and 6 tickers for taking advantage of it. If you don't buy now, you may kick yourself in 2020.",
    "   Click here for the 6 trades >>   ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:00:00"
}