{
  "url": "https://www.nasdaq.com/article/this-may-be-the-simplest-way-to-pick-winning-stocks-cm1206929",
  "title": "This May Be The Simplest Way To Pick Winning Stocks - Nasdaq.com",
  "text": [
    " What's the first rule of successful real estate investing? Of   course, you just said to yourself, \"location, location,   location.\" Well, when it comes successful equity trading, the   first rule that should come to your mind is \"price, price,   price.\" More specifically, it is the share price performance of a   stock or ETF relative to other stocks and ETFs traded in the   market that is the most important metric to put in your   favor. If a security you are looking to buy has a proven track record   of outperforming others in the broad market, or within its   specific industry group, then that tells you others on Wall   Street think there is something special about it that makes it   worth buying. This \"something special\" could be a variety of things,   including a proven track record of strong revenue and earnings   growth, e.g., Walt Disney (NYSE:      DIS    ); a breakout product or game-changing service, e.g., Netflix   (Nasdaq:      NFLX    ); or a high-demand personal technology product, e.g., Apple   (Nasdaq:      AAPL    ). Whatever the reason, or combination of reasons, the price   performance relative to the rest of the market will tell you more   about what the market thinks about that security than any other   fundamental ratio or so-called \"valuation\" metric you will ever   use. The chief way to assess share price performance relative to   the rest of the market is an indicator called   relative strength (   RS    )    . This indicator assigns a numerical score to a stock based on   its price performance relative to other stocks in the market. The RS rank gives you a great sense of how strong a stock has   performed compared to the rest of the market. And though past   performance isn't a guarantee of future results, a stock or ETF   with a strong RS rank is far more likely to continue   outperforming the rest of the market than those with a low RS   rank. So, what is a \"strong\" RS rank? RS ranges from 0 (weakest) to   100 (strongest). When I look for stocks to trade, I want to see a   RS rank of at least 70, meaning it has outperformed 70% of all   other stocks in the market over the past six months. The 70 threshold here is the minimum level, and the reason why   is because with so many stocks to choose from, why try to pick   one that hasn't shown market-beating performance? Think of it like trying to bet on professional sports. When   you are looking to pick winning teams, do you look at the teams   with losing records first and hope they pull off an upset? Or, do   you look at teams with winning track records and bet on those to   win based on their relatively better records? Any successful sports gambler will tell you the odds of   success are greater when you bet on teams with a winning record.   Sure, you may be the victim of a big upset occasionally, but most   of the time betting on the team with the better record   (particularly over time) will net you the best results. Well,   it's the same for equity trading, and in this sport, RS is the   way to keep track of a winning record in the markets. Now, over the past several decades, there have been numerous   academic studies demonstrating the importance of relative   strength when it comes to successful stock selection. The latest   study is the work of Prof. Eugene F. Fama at the University of   Chicago. In his Nobel Prize-winning research, Fama showed that   relative strength was one of the three factors identified as the   biggest drivers of stock prices. Before Prof. Fama, there was James P. O'Shaughnessy, who   studied 46 years of market history and concluded that stocks with   high relative strength significantly outperformed the overall   stock market. Other high-profile research advocating for the use of relative   strength includes market luminaries such as   Investor's Business Daily    chairman and founder William O'Neil, famed investor Jesse   Livermore, and market pros H.M. Gartley and Robert Levy. For traders looking to identify winning stocks, the most   important thing is price, price, price. Once you've put that   factor on your side via a strong RS rank, the rest of your   undertaking becomes a whole lot easier.   Related Articles   The Absolute Best Retirement Strategy We've       Ever Found   If You're A Growth Investor, Read This...   The \"Win-Win\" Strategy Buffett Used To Make       $7.5 Million Instantly   ",
    "What's the first rule of successful real estate investing? Of   course, you just said to yourself, \"location, location,   location.\" Well, when it comes successful equity trading, the   first rule that should come to your mind is \"price, price,   price.\"",
    "More specifically, it is the share price performance of a   stock or ETF relative to other stocks and ETFs traded in the   market that is the most important metric to put in your   favor.",
    "If a security you are looking to buy has a proven track record   of outperforming others in the broad market, or within its   specific industry group, then that tells you others on Wall   Street think there is something special about it that makes it   worth buying.",
    "This \"something special\" could be a variety of things,   including a proven track record of strong revenue and earnings   growth, e.g., Walt Disney (NYSE:      DIS    ); a breakout product or game-changing service, e.g., Netflix   (Nasdaq:      NFLX    ); or a high-demand personal technology product, e.g., Apple   (Nasdaq:      AAPL    ).",
    "Whatever the reason, or combination of reasons, the price   performance relative to the rest of the market will tell you more   about what the market thinks about that security than any other   fundamental ratio or so-called \"valuation\" metric you will ever   use.",
    "The chief way to assess share price performance relative to   the rest of the market is an indicator called   relative strength (   RS    )    . This indicator assigns a numerical score to a stock based on   its price performance relative to other stocks in the market.",
    "The RS rank gives you a great sense of how strong a stock has   performed compared to the rest of the market. And though past   performance isn't a guarantee of future results, a stock or ETF   with a strong RS rank is far more likely to continue   outperforming the rest of the market than those with a low RS   rank.",
    "So, what is a \"strong\" RS rank? RS ranges from 0 (weakest) to   100 (strongest). When I look for stocks to trade, I want to see a   RS rank of at least 70, meaning it has outperformed 70% of all   other stocks in the market over the past six months.",
    "The 70 threshold here is the minimum level, and the reason why   is because with so many stocks to choose from, why try to pick   one that hasn't shown market-beating performance?",
    "Think of it like trying to bet on professional sports. When   you are looking to pick winning teams, do you look at the teams   with losing records first and hope they pull off an upset? Or, do   you look at teams with winning track records and bet on those to   win based on their relatively better records?",
    "Any successful sports gambler will tell you the odds of   success are greater when you bet on teams with a winning record.   Sure, you may be the victim of a big upset occasionally, but most   of the time betting on the team with the better record   (particularly over time) will net you the best results. Well,   it's the same for equity trading, and in this sport, RS is the   way to keep track of a winning record in the markets.",
    "Now, over the past several decades, there have been numerous   academic studies demonstrating the importance of relative   strength when it comes to successful stock selection. The latest   study is the work of Prof. Eugene F. Fama at the University of   Chicago. In his Nobel Prize-winning research, Fama showed that   relative strength was one of the three factors identified as the   biggest drivers of stock prices.",
    "Before Prof. Fama, there was James P. O'Shaughnessy, who   studied 46 years of market history and concluded that stocks with   high relative strength significantly outperformed the overall   stock market.",
    "Other high-profile research advocating for the use of relative   strength includes market luminaries such as   Investor's Business Daily    chairman and founder William O'Neil, famed investor Jesse   Livermore, and market pros H.M. Gartley and Robert Levy.",
    "For traders looking to identify winning stocks, the most   important thing is price, price, price. Once you've put that   factor on your side via a strong RS rank, the rest of your   undertaking becomes a whole lot easier.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\n© Copyright 2001-2016 StreetAuthority, LLC. All Rights Reserved.\n"
  ],
  "published_datetime": "2019-09-03 15:30:00"
}