{
  "url": "https://www.nasdaq.com/article/roku-got-rocked-but-should-bounce-back-cm1210483",
  "title": "Roku Got Rocked but Should Bounce Back - Nasdaq.com",
  "text": [
    " There was plenty of fallout on Tuesday following   Apple    's (NASDAQ: AAPL) surprising move to price its upcoming   streaming-video service aggressively. Apple TV+ will hit the   market in November at   $4.99 a month    , half of what some were expecting. It will also offer buyers of   new Apple devices a free one-year subscription to the   service. It's easy to see why Apple's promotional pricing took its toll   on   Netflix    (NASDAQ: NFLX)  and   Disney    (NYSE: DIS) , with each stock down 2.2% in Tuesday's trading.   Whether Apple is disrupting the value proposition of premium   streaming platforms or locking up anyone buying an iOS or Mac for   at least a year, Netflix and Disney can't be pleased. However,   the real loser in this arena was   Roku    (NASDAQ: ROKU) , as its stock took a 10.5% hit on Tuesday.   Image source: Roku.makeArticleAd();  For those about to Roku We can't pin all of Roku's slide on Apple. As one of this   year's hottest stocks -- a five-bagger in 2019 when the trading   day began -- Roku was already taking a breather by Tuesday's   opening bell. The shares were down 5% before Apple even started   its media presentation. However, the stock's slide through the   final three hours of the day clearly had Apple TV+ written all   over it. The market's knee-jerk reaction may seem overdone but is   understandable on the surface. Apple TV+ will be on Roku's   operating system, but if Apple is heavily recruiting on its end   for new users -- exactly what's happening by giving the hundreds   of millions of annual buyers of Apple gadgetry a free year --   there won't be a need to offer Roku referrals for leads. Disney+ is already doing a good job of locking folks up for   two to three years through deeply discounted promotions for its   D23 fan club and credit card holders willing to prepay. If Apple   and Disney won't be lining Roku's coffers the way that other   services do to stand out, it's easy to see why retail investors   are having second thoughts about the potential exponential growth   of Roku's platform revenue. Thankfully for Roku investors, there's more to this story.   Apple and Disney are active marketers across all media outlets.   Of course, they're going to be some of the more active   advertisers on Roku, especially since both will be launching just   ahead of the active holiday shopping season. They need to make up   for lost time by making sure that they do more than market to the   biggest fans of their brands, and that's where Roku will   help. The more promising scenario -- and this one benefits Roku   and    Netflix -- is that the one-two launch of Apple TV+ and Disney+ in   the first half of November will push more people to cut the cord.   You can be sure that Roku streaming players and third-party smart   TVs powered by Roku's operating system will be among the biggest   sellers in consumer electronics over the holidays. A lot of people will be cancelling their costly cable and   satellite television plans by Christmas and early into 2020, and   that's a rising streaming tide that will lift all ships. If   you're still paying for cable television, it's fair to say that   you can afford a package of several of the leading streaming   services and still come out ahead financially. There may be some   rumblings right now when it comes to investing in   consumer discretionary stocks     -- with fears on how the slices will be carved out -- but   the narrative changes when you realize that the pie itself is   about to get a whole lot bigger. You're going to need a bigger   bib. A potential price war among the major streaming services   actually benefits Roku, as it drives more people to the platform.   Streaming services were already cheap relative to traditional   pay-TV options, but if the technology gets even cheaper, you're   going to see the same migration that we've seen across all major   tech innovations that have struck a chord -- or in this case,   perhaps a   cord    -- with the masses. Investors bailing on Netflix, Disney, and Roku got the Apple   TV+ event all wrong, but only time will tell.   10 stocks we like better than Roku       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Roku wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Rick Munarriz      owns shares of Apple, Netflix, Roku, and Walt Disney. The     Motley Fool owns shares of and recommends Apple, Netflix, Roku,     and Walt Disney. The Motley Fool has the following options:     long January 2021 $60 calls on Walt Disney, short October 2019     $125 calls on Walt Disney, short January 2020 $155 calls on     Apple, long January 2020 $150 calls on Apple, short January     2020 $155 calls on Apple, and long January 2020 $150 calls on     Apple. The Motley Fool has a     disclosure policy      .  ",
    "There was plenty of fallout on Tuesday following   Apple    's (NASDAQ: AAPL) surprising move to price its upcoming   streaming-video service aggressively. Apple TV+ will hit the   market in November at   $4.99 a month    , half of what some were expecting. It will also offer buyers of   new Apple devices a free one-year subscription to the   service.",
    "It's easy to see why Apple's promotional pricing took its toll   on   Netflix    (NASDAQ: NFLX)  and   Disney    (NYSE: DIS) , with each stock down 2.2% in Tuesday's trading.   Whether Apple is disrupting the value proposition of premium   streaming platforms or locking up anyone buying an iOS or Mac for   at least a year, Netflix and Disney can't be pleased. However,   the real loser in this arena was   Roku    (NASDAQ: ROKU) , as its stock took a 10.5% hit on Tuesday.",
    "  Image source: Roku.makeArticleAd(); ",
    "Image source: Roku.",
    "We can't pin all of Roku's slide on Apple. As one of this   year's hottest stocks -- a five-bagger in 2019 when the trading   day began -- Roku was already taking a breather by Tuesday's   opening bell. The shares were down 5% before Apple even started   its media presentation. However, the stock's slide through the   final three hours of the day clearly had Apple TV+ written all   over it.",
    "The market's knee-jerk reaction may seem overdone but is   understandable on the surface. Apple TV+ will be on Roku's   operating system, but if Apple is heavily recruiting on its end   for new users -- exactly what's happening by giving the hundreds   of millions of annual buyers of Apple gadgetry a free year --   there won't be a need to offer Roku referrals for leads.",
    "Disney+ is already doing a good job of locking folks up for   two to three years through deeply discounted promotions for its   D23 fan club and credit card holders willing to prepay. If Apple   and Disney won't be lining Roku's coffers the way that other   services do to stand out, it's easy to see why retail investors   are having second thoughts about the potential exponential growth   of Roku's platform revenue.",
    "Thankfully for Roku investors, there's more to this story.   Apple and Disney are active marketers across all media outlets.   Of course, they're going to be some of the more active   advertisers on Roku, especially since both will be launching just   ahead of the active holiday shopping season. They need to make up   for lost time by making sure that they do more than market to the   biggest fans of their brands, and that's where Roku will   help.",
    "The more promising scenario -- and this one benefits Roku   and    Netflix -- is that the one-two launch of Apple TV+ and Disney+ in   the first half of November will push more people to cut the cord.   You can be sure that Roku streaming players and third-party smart   TVs powered by Roku's operating system will be among the biggest   sellers in consumer electronics over the holidays.",
    "A lot of people will be cancelling their costly cable and   satellite television plans by Christmas and early into 2020, and   that's a rising streaming tide that will lift all ships. If   you're still paying for cable television, it's fair to say that   you can afford a package of several of the leading streaming   services and still come out ahead financially. There may be some   rumblings right now when it comes to investing in   consumer discretionary stocks     -- with fears on how the slices will be carved out -- but   the narrative changes when you realize that the pie itself is   about to get a whole lot bigger. You're going to need a bigger   bib.",
    "A potential price war among the major streaming services   actually benefits Roku, as it drives more people to the platform.   Streaming services were already cheap relative to traditional   pay-TV options, but if the technology gets even cheaper, you're   going to see the same migration that we've seen across all major   tech innovations that have struck a chord -- or in this case,   perhaps a   cord    -- with the masses.",
    "Investors bailing on Netflix, Disney, and Roku got the Apple   TV+ event all wrong, but only time will tell.",
    "  10 stocks we like better than Roku       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Roku wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Roku       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Roku wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Rick Munarriz      owns shares of Apple, Netflix, Roku, and Walt Disney. The     Motley Fool owns shares of and recommends Apple, Netflix, Roku,     and Walt Disney. The Motley Fool has the following options:     long January 2021 $60 calls on Walt Disney, short October 2019     $125 calls on Walt Disney, short January 2020 $155 calls on     Apple, long January 2020 $150 calls on Apple, short January     2020 $155 calls on Apple, and long January 2020 $150 calls on     Apple. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:45:00"
}