{
  "url": "https://www.nasdaq.com/article/3-ipos-to-watch-for-by-the-end-of-the-year-cm1206916",
  "title": "3 IPOs to Watch For by the End of the Year - Nasdaq.com",
  "text": [
    "  This article was     first published by MyWallSt.   Which 2 pot stocks will beat the market? Find out in our       free guide!   In 2018, we saw 190 companies become listed on U.S. exchanges,   and 2019 is proving to be no different. This year has been a   hectic one for IPOs, with companies such as   Uber    (NYSE: UBER) ,   Pinterest    (NYSE: PINS) ,   Beyond Meat    (NASDAQ: BYND) , and   Slack    (NYSE: WORK) going public so far. The year is far from over   though, with many companies potentially going public in the next   four months.   Image source: Unsplash.makeArticleAd();  These three companies plan on going public soon and should   definitely be watched by investors.  1. Airbnb  Airbnb has taken the hotel and hospitality industry by storm.   Launched over 10 years ago, it now hosts over 2 million people a   night, for a total of 400 million people since the company was   founded in 2008. Airbnb is available in 191 countries, 100,000   cities, and offers roughly 6 million different places to stay.   Thanks to its cheap and easy-to-use service, Airbnb has become a   household name. In 2018, Airbnb saw a 62.5% increase in guest arrivals, with   Mexico City and Beijing up 79% and 91%, respectively. Even though   Airbnb is a privately traded company, reports have shown that in   2018's third quarter, Airbnb turned over $1 billion in revenue,   with some analysts expecting revenue to hit $8.5 billion by 2021.   A portion of this growth comes from Airbnb's more recent venture,   Airbnb Experiences. Launched over three years ago, this service   offers over 5,000 experiences in 60 cities across the globe,   growing 2,500% in 2018. Unlike many companies that have gone   public recently, Airbnb has also reported a positive earnings   before interest, taxes, depreciation, and amortization (EBITDA)   for the past two years. This has been aided by the experiences   segment, with some experiences earning more than $200,000   each. The growth of Airbnb has not gone unnoticed by traditional   competitors such as   Booking.com    (NASDAQ: BKNG) and   TripAdvisor    (NASDAQ: TRIP) , which now face a significant threat. A recent   survey from Morgan Stanley indicated that 42% of Airbnb users had   replaced a traditional hotel service with Airbnb's digital   service. This is no surprise, with hotels costing 6% to 17% more   than an Airbnb. While Airbnb has not yet announced when it intends to go   public, an IPO is certainly on the table for the end of 2019. In   a statement, co-founder Nathan Blecharczyk said: \"We have already   said that we are taking the steps to be ready to go public in   2019. That doesn't mean we will go public in 2019.\"  2. Instacart  Apoorva Mehta, CEO of the popular grocery delivery company   Instacart, said at the start of this year that \"   an IPO is definitely on the horizon    .\" Founded by a former Amazon employee, Instacart reached an $8   billion valuation in 2018 after raising $271 million in funding   last November. While online grocery shopping makes up only 10% of consumer   spending, the industry has seen significant growth in recent   times. From 2016 to 2018, the online grocery market doubled, and   it is expected that between 2018 and 2023, the market will   quadruple, with 1 in 5 Americans predicted to buy groceries   online. Although Instacart's revenue and profitability are not   publicly disclosed, the company appears to be growing. Founded in   2012, Instacart now serves over 15,000 grocery stores in 4,000   cities and has formed partnerships with companies such as   Kroger    , ALDI, Sam's Club, and   Walmart    Canada. As of 2018, Instacart had over 30,000 customers and has   been investing heavily in research and development, announcing   the opening of a second R&D headquarters in Toronto,   Canada. In an industry as explosive as online grocery shopping,   Instacart faces great competition from companies such as Walmart,   Amazon    , and   Target    . These popular companies have already carved out a name in the   space, and it is apparent that customers will use their delivery   service first. According to a study by Second Measure, Walmart --   one of Instacart's largest competitors -- has 62% more online   shoppers. Amazon, through Prime Now and Amazon Fresh, currently   makes up 30% of all online grocery shopping, and Target's Shipt   saw 92% more orders in January 2019 compared to January 2018.   Despite such intense competition, Instacart may have a   significant role to play, providing smaller, regional retailers   with logistical expertise and e-commerce options.  3. SmileDirectClub  SmileDirectClub is another company that will definitely go   public in 2019 after filing a form S-1 in August. SmileDirectClub   provides clear teeth aligners, a replacement for traditional   train-track-style braces. Unlike their main competitor,   Align Technology    's (NASDAQ: ALGN) Invisalign, however, SmileDirectClub's aligners   can be fitted either at home or in \"SmileShop\" stores, and thus   cost roughly 60% less than Invisalign. This affordability and ease of use has made them a significant   threat to Align, which actually owns 19% of SmileDirectClub.   Despite being part owners, their relationship has not always been   healthy, with Align forced to close its physical stores due to a   non-compete violation with SmileDirectClub. A deal struck last   year between SmileDirectClub and   CVS    will see the products offered in hundreds of CVS stores across   the U.S. This partnership will increase customer awareness for   SmileDirectClub and should prove to be a big success against   competitors. SmileDirectClub recently received a valuation of $3.2 billion   and has had over 300,000 customers since its founding in 2014.   With the global orthodontics market set to reach $2.6 billion in   2023, it is no surprise that SmileDirectClub has a lot of room to   grow, especially at a time when consumers demand things cheaply   and efficiently. In 2018, SmileDirectClub's revenue grew 184% to   $398 million. Although SmileDirectClub has a unique position in the market   and is seeing huge revenue growth, investors should be wary as   dentists have taken issue with its product. Dentists have filed   complaints in 36 states as they believe the process of teeth   straightening is an important medical procedure and requires   numerous checkups. Government intervention in the dental industry   could prove to be dangerous for SmileDirectClub's business model.   Nevertheless, this soon-to-be-public company is seeing impressive   growth, and investors should definitely keep a close eye.   Image source: MyWallSt.     One of these pot stocks is         already +100% this year. What are you waiting for?     Read MyWallSt's     full     disclosure policy here      .    10 stocks we like better than Uber     Technologies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Uber Technologies wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. The Motley Fool owns shares of and recommends Align     Technology, Amazon, Booking Holdings, and TripAdvisor. The     Motley Fool owns shares of Pinterest and Slack Technologies.     The Motley Fool recommends CVS Health and Uber Technologies.     The Motley Fool has a     disclosure policy      .  ",
    " This article was     first published by MyWallSt.   Which 2 pot stocks will beat the market? Find out in our       free guide!  ",
    "In 2018, we saw 190 companies become listed on U.S. exchanges,   and 2019 is proving to be no different. This year has been a   hectic one for IPOs, with companies such as   Uber    (NYSE: UBER) ,   Pinterest    (NYSE: PINS) ,   Beyond Meat    (NASDAQ: BYND) , and   Slack    (NYSE: WORK) going public so far. The year is far from over   though, with many companies potentially going public in the next   four months.",
    "  Image source: Unsplash.makeArticleAd(); ",
    "Image source: Unsplash.",
    "These three companies plan on going public soon and should   definitely be watched by investors.",
    "Airbnb has taken the hotel and hospitality industry by storm.   Launched over 10 years ago, it now hosts over 2 million people a   night, for a total of 400 million people since the company was   founded in 2008. Airbnb is available in 191 countries, 100,000   cities, and offers roughly 6 million different places to stay.   Thanks to its cheap and easy-to-use service, Airbnb has become a   household name.",
    "In 2018, Airbnb saw a 62.5% increase in guest arrivals, with   Mexico City and Beijing up 79% and 91%, respectively. Even though   Airbnb is a privately traded company, reports have shown that in   2018's third quarter, Airbnb turned over $1 billion in revenue,   with some analysts expecting revenue to hit $8.5 billion by 2021.   A portion of this growth comes from Airbnb's more recent venture,   Airbnb Experiences. Launched over three years ago, this service   offers over 5,000 experiences in 60 cities across the globe,   growing 2,500% in 2018. Unlike many companies that have gone   public recently, Airbnb has also reported a positive earnings   before interest, taxes, depreciation, and amortization (EBITDA)   for the past two years. This has been aided by the experiences   segment, with some experiences earning more than $200,000   each.",
    "The growth of Airbnb has not gone unnoticed by traditional   competitors such as   Booking.com    (NASDAQ: BKNG) and   TripAdvisor    (NASDAQ: TRIP) , which now face a significant threat. A recent   survey from Morgan Stanley indicated that 42% of Airbnb users had   replaced a traditional hotel service with Airbnb's digital   service. This is no surprise, with hotels costing 6% to 17% more   than an Airbnb.",
    "While Airbnb has not yet announced when it intends to go   public, an IPO is certainly on the table for the end of 2019. In   a statement, co-founder Nathan Blecharczyk said: \"We have already   said that we are taking the steps to be ready to go public in   2019. That doesn't mean we will go public in 2019.\"",
    "Apoorva Mehta, CEO of the popular grocery delivery company   Instacart, said at the start of this year that \"   an IPO is definitely on the horizon    .\" Founded by a former Amazon employee, Instacart reached an $8   billion valuation in 2018 after raising $271 million in funding   last November.",
    "While online grocery shopping makes up only 10% of consumer   spending, the industry has seen significant growth in recent   times. From 2016 to 2018, the online grocery market doubled, and   it is expected that between 2018 and 2023, the market will   quadruple, with 1 in 5 Americans predicted to buy groceries   online.",
    "Although Instacart's revenue and profitability are not   publicly disclosed, the company appears to be growing. Founded in   2012, Instacart now serves over 15,000 grocery stores in 4,000   cities and has formed partnerships with companies such as   Kroger    , ALDI, Sam's Club, and   Walmart    Canada. As of 2018, Instacart had over 30,000 customers and has   been investing heavily in research and development, announcing   the opening of a second R&D headquarters in Toronto,   Canada.",
    "In an industry as explosive as online grocery shopping,   Instacart faces great competition from companies such as Walmart,   Amazon    , and   Target    . These popular companies have already carved out a name in the   space, and it is apparent that customers will use their delivery   service first. According to a study by Second Measure, Walmart --   one of Instacart's largest competitors -- has 62% more online   shoppers. Amazon, through Prime Now and Amazon Fresh, currently   makes up 30% of all online grocery shopping, and Target's Shipt   saw 92% more orders in January 2019 compared to January 2018.   Despite such intense competition, Instacart may have a   significant role to play, providing smaller, regional retailers   with logistical expertise and e-commerce options.",
    "SmileDirectClub is another company that will definitely go   public in 2019 after filing a form S-1 in August. SmileDirectClub   provides clear teeth aligners, a replacement for traditional   train-track-style braces. Unlike their main competitor,   Align Technology    's (NASDAQ: ALGN) Invisalign, however, SmileDirectClub's aligners   can be fitted either at home or in \"SmileShop\" stores, and thus   cost roughly 60% less than Invisalign.",
    "This affordability and ease of use has made them a significant   threat to Align, which actually owns 19% of SmileDirectClub.   Despite being part owners, their relationship has not always been   healthy, with Align forced to close its physical stores due to a   non-compete violation with SmileDirectClub. A deal struck last   year between SmileDirectClub and   CVS    will see the products offered in hundreds of CVS stores across   the U.S. This partnership will increase customer awareness for   SmileDirectClub and should prove to be a big success against   competitors.",
    "SmileDirectClub recently received a valuation of $3.2 billion   and has had over 300,000 customers since its founding in 2014.   With the global orthodontics market set to reach $2.6 billion in   2023, it is no surprise that SmileDirectClub has a lot of room to   grow, especially at a time when consumers demand things cheaply   and efficiently. In 2018, SmileDirectClub's revenue grew 184% to   $398 million.",
    "Although SmileDirectClub has a unique position in the market   and is seeing huge revenue growth, investors should be wary as   dentists have taken issue with its product. Dentists have filed   complaints in 36 states as they believe the process of teeth   straightening is an important medical procedure and requires   numerous checkups. Government intervention in the dental industry   could prove to be dangerous for SmileDirectClub's business model.   Nevertheless, this soon-to-be-public company is seeing impressive   growth, and investors should definitely keep a close eye.",
    "  Image source: MyWallSt. ",
    "Image source: MyWallSt.",
    "   One of these pot stocks is         already +100% this year. What are you waiting for?   ",
    " Read MyWallSt's     full     disclosure policy here      . ",
    "  10 stocks we like better than Uber     Technologies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Uber Technologies wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Uber     Technologies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Uber Technologies wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. The Motley Fool owns shares of and recommends Align     Technology, Amazon, Booking Holdings, and TripAdvisor. The     Motley Fool owns shares of Pinterest and Slack Technologies.     The Motley Fool recommends CVS Health and Uber Technologies.     The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:57:00"
}