{
  "url": "https://www.nasdaq.com/article/baidu-inc-bidu-outpaces-stock-market-gains-what-you-should-know-cm1210784",
  "title": "Baidu Inc. (BIDU) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Baidu Inc. (BIDU) closed at $111.79 in the latest trading session, marking a +1.26% move from the prior day. This change outpaced the S&P 500's 0.72% gain on the day. At the same time, the Dow added 0.85%, and the tech-heavy Nasdaq gained 1.06%. Heading into today, shares of the web search company had gained 13.37% over the past month, outpacing the Computer and Technology sector's gain of 2.17% and the S&P 500's gain of 2.25% in that time. BIDU will be looking to display strength as it nears its nex t earnings  release. In tha t report  , analysts expect BIDU to post earnings of $1.76 per share. This would mark a year-over-year decline of 36.46%. Our most recent consensus estimate is calling for quarterly revenue of $4.02 billion, down 2.08% from the year-ago period. For the full year, our Zacks Consensus Estimates are projecting earnings of $5 per share and revenue of $15.67 billion, which would represent changes of -48.13% and +2.25%, respectively, from the prior year. It is also important to note the recent changes to analyst estimates for BIDU. These revisions help to show the ever-changing nature of near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model. Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Within the past 30 days, our consensus EPS projection has moved 29.88% higher. BIDU currently has a Zacks Rank of #3 (Hold). Digging into valuation, BIDU currently has a Forward P/E ratio of 22.07. This valuation marks a discount compared to its industry's average Forward P/E of 26.57. Also, we should mention that BIDU has a PEG ratio of 7.98. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Internet - Services industry currently had an average PEG ratio of 2.38 as of yesterday's close. The Internet - Services industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 173, putting it in the bottom 33% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Baidu, Inc. (BIDU): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Baidu Inc. (BIDU) closed at $111.79 in the latest trading session, marking a +1.26% move from the prior day. This change outpaced the S&P 500's 0.72% gain on the day. At the same time, the Dow added 0.85%, and the tech-heavy Nasdaq gained 1.06%.",
    "Heading into today, shares of the web search company had gained 13.37% over the past month, outpacing the Computer and Technology sector's gain of 2.17% and the S&P 500's gain of 2.25% in that time.",
    "BIDU will be looking to display strength as it nears its nex t earnings  release. In tha t report  , analysts expect BIDU to post earnings of $1.76 per share. This would mark a year-over-year decline of 36.46%. Our most recent consensus estimate is calling for quarterly revenue of $4.02 billion, down 2.08% from the year-ago period.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of $5 per share and revenue of $15.67 billion, which would represent changes of -48.13% and +2.25%, respectively, from the prior year.",
    "It is also important to note the recent changes to analyst estimates for BIDU. These revisions help to show the ever-changing nature of near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.",
    "Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Within the past 30 days, our consensus EPS projection has moved 29.88% higher. BIDU currently has a Zacks Rank of #3 (Hold).",
    "Digging into valuation, BIDU currently has a Forward P/E ratio of 22.07. This valuation marks a discount compared to its industry's average Forward P/E of 26.57.",
    "Also, we should mention that BIDU has a PEG ratio of 7.98. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Internet - Services industry currently had an average PEG ratio of 2.38 as of yesterday's close.",
    "The Internet - Services industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 173, putting it in the bottom 33% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:50:10"
}