{
  "url": "https://www.nasdaq.com/article/when-does-patience-run-out-for-boeing-stock-cm1210768",
  "title": "When Does Patience Run Out for Boeing Stock? - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Investors have given Boeing  (NYSE: BA ) stock a long leash. Boeing stock has traded mostly sideways since March, despite the fact that news over that stretch hasn't seemed particularly positive.",
    "Of course, Boeing stock fell sharply after the second 737 MAX crash in March. Since then, the company hasn't given investors much to be excited about.",
    "Boeing Co took a $5 billion charge with Q2 earnings . Management targets for the return of the 737 MAX to service seem hugely optimistic, and the 777X faces potential delays as well. The defense side of the business has come under criticism for performance under a key Air Force contract.",
    "And yet investors have shrugged off those worries. A brief dip in August reversed quickly. Wall Street remains reasonably supportive, with an average price target of $411 suggesting 12% upside.",
    "The willingness of investors and analysts to support Boeing Co stock does make some sense. As I wrote last month, Boeing Co probably gets back to earnings growth at some point . But it seemed then like investor patience with BA stock was starting to give way, and if Boeing keeps missing its targets, it may do so again.",
    "As noted, the grounding of the MAX fleet hit Q2 earnings - and will continue to hit profits going forward. Boeing announced on Tuesday that it had delivered just 18 aircraft in August, less than 30% of what it did the year before.",
    "To be sure, that figure isn't necessarily surprising, though year-to-date deliveries are lagging analyst expectations. But deliveries aren't the only issue. As detailed on the Q2 conference call , Boeing is still producing 42 737s a month, even with the MAX fleet grounded. And CEO Dennis Muilenberg said on that call that if the MAX didn't return to service by the end of the year, production potentially could be suspended.",
    "Increasingly, that looks like it will be the case. Southwest Airlines (NYSE: LUV ) has canceled MAX flights into 2020 . American Airlines Group (NYSE: AAL ) has pulled the MAX from its schedule through December. E.U. regulators are insisting on their own test flight .",
    "Meanwhile, Boeing still hasn't updated its prediction from the Q2 call for a return to service early in the fourth quarter. That doesn't inspire confidence. If the MAX slips into 2020, it will cost the company billions in dollars in airline reimbursements, storage fees and incremental production costs. It may also cost Boeing Co the confidence of investors.",
    "What is frustrating about BA stock at the moment is that the 737 MAX isn't the only issue. The 777X is facing delays as well. Issues with engines produced by General Electric (NYSE: GE ) admittedly are the key problem. But Boeing had a failure with a so-called \"load test\" this week, which could further push its release into 2020.",
    "On the defense side, the company's KC-46 aerial refueling tanker continues to struggle. Debris continues to be left on planes, leading to increased inspections and delayed deliveries. Acting Secretary of the Air Force Matthew Donovan said this summer that Boeing Co management had referred to the issues as \" embarrassing \".",
    "The problems, which truly come down to execution, color Boeing's ability to get future U.S. military contracts. With intense competition from the likes of Lockheed Martin (NYSE: LMT ), the KC-46 only seems to add to the worries here.",
    "But, again, investors have largely shrugged off all of those concerns over the last six months. And there's one reason why: as an analyst put it earlier this year, Boeing is almost too big to fail .",
    "After all, worldwide demand for air travel is only going to rise going forward amid the rise of the middle class in developing nations. Backlogs at both Boeing and rival Airbus (OTCMKTS: EADSY ) extend into the 2030s. And there simply is no competition, even though China is trying to break that duopoly .",
    "But even in the context of a roughly $200 billion market cap, a few billion dollars in penalties, fines and costs matter. So does pushing revenue - and profits - out a few quarters or a few years. Even if Boeing can avoid the worst-case scenario - a permanent grounding of the MAX - the costs are piling up. At some point, that's going to matter.",
    "As of this writing, Vince Martin did not hold a position in any of the aforementioned securities.",
    "The post When Does Patience Run Out for Boeing Stock? appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:39:35"
}