{
  "url": "https://www.nasdaq.com/article/occidental-petroleum-oxy-stock-sinks-as-market-gains-what-you-should-know-cm1210793",
  "title": "Occidental Petroleum (OXY) Stock Sinks As Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Occidental Petroleum (OXY) closed the most recent trading day at $46.29, moving -0.3% from the previous trading session. This move lagged the S&P 500's daily gain of 0.72%. Elsewhere, the Dow gained 0.85%, while the tech-heavy Nasdaq added 1.06%. Heading into today, shares of the oil and gas exploration and production company had gained 3.73% over the past month, outpacing the Oils-Energy sector's gain of 2.86% and the S&P 500's gain of 2.25% in that time. Wall Street will be looking for positivity from OXY as it approaches its nex t earnings  report date. In tha t report  , analysts expect OXY to post earnings of $0.70 per share. This would mark a year-over-year decline of 60.45%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $5.10 billion, down 17.49% from the year-ago period. For the full year, our Zacks Consensus Estimates are projecting earnings of $2.94 per share and revenue of $20.86 billion, which would represent changes of -41.32% and +10.47%, respectively, from the prior year. It is also important to note the recent changes to analyst estimates for OXY. Recent revisions tend to reflect the latest near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 11.29% lower. OXY is currently sporting a Zacks Rank of #3 (Hold). Digging into valuation, OXY currently has a Forward P/E ratio of 15.78. This represents a premium compared to its industry's average Forward P/E of 14.96. It is also worth noting that OXY currently has a PEG ratio of 3.16. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. OXY's industry had an average PEG ratio of 1.66 as of yesterday's close. The Oil and Gas - Integrated - United States industry is part of the Oils-Energy sector. This group has a Zacks Industry Rank of 206, putting it in the bottom 20% of all 250+ industries. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Occidental Petroleum Corporation (OXY): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Occidental Petroleum (OXY) closed the most recent trading day at $46.29, moving -0.3% from the previous trading session. This move lagged the S&P 500's daily gain of 0.72%. Elsewhere, the Dow gained 0.85%, while the tech-heavy Nasdaq added 1.06%.",
    "Heading into today, shares of the oil and gas exploration and production company had gained 3.73% over the past month, outpacing the Oils-Energy sector's gain of 2.86% and the S&P 500's gain of 2.25% in that time.",
    "Wall Street will be looking for positivity from OXY as it approaches its nex t earnings  report date. In tha t report  , analysts expect OXY to post earnings of $0.70 per share. This would mark a year-over-year decline of 60.45%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $5.10 billion, down 17.49% from the year-ago period.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of $2.94 per share and revenue of $20.86 billion, which would represent changes of -41.32% and +10.47%, respectively, from the prior year.",
    "It is also important to note the recent changes to analyst estimates for OXY. Recent revisions tend to reflect the latest near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 11.29% lower. OXY is currently sporting a Zacks Rank of #3 (Hold).",
    "Digging into valuation, OXY currently has a Forward P/E ratio of 15.78. This represents a premium compared to its industry's average Forward P/E of 14.96.",
    "It is also worth noting that OXY currently has a PEG ratio of 3.16. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. OXY's industry had an average PEG ratio of 1.66 as of yesterday's close.",
    "The Oil and Gas - Integrated - United States industry is part of the Oils-Energy sector. This group has a Zacks Industry Rank of 206, putting it in the bottom 20% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:45:26"
}