{
  "url": "https://www.nasdaq.com/article/financial-sector-update-for-09112019-bancschwbenma-cm1210705",
  "title": "Financial Sector Update for 09/11/2019: BANC,SCHW,BEN,MA - Nasdaq.com",
  "text": [
    "Top Financial Stocks",
    "JPM +0.06%",
    "BAC -0.09%",
    "WFC +0.83%",
    "C -0.28%",
    "USB -0.12%",
    "Financial stocks added to their small gains this afternoon, with the NYSE Financial Index climbing over 0.3% in late trade while shares of financial companies in the S&P 500 were climbing almost 0.4%. The Philadelphia Housing Index was rising about 1.4%.",
    "Among financial stocks moving on news:",
    "(+) Banc of California ( BANC  ) declined nearly 4% on Wednesday after saying it will record a $0.54 per share charge against its Q3 financial results because of a bad borrower involved in short-term loans to fund the purchase of liquor licenses in California. The bank said it issued a $35 million loan in November 2017 to ANI Development, which had its assets frozen by the US Securities and Exchange Commission on August 29 after ANI was linked to a $300 million fraud scheme.",
    "In other sector news:",
    "(+) Franklin Resources ( BEN  ) rose over 3% this afternoon. The company reported a preliminary 4.4% drop in assets under management during August compared with the year-ago period, falling to $690.6 billion.",
    "(+)   Charles Schwab  ( SCHW  ) was nearly 2% higher following reports the discount broker is planning to eliminate about 600 jobs, or roughly 3% of its total headcount. The job cuts will affect all employee grade-levels, a company spokeswoman told Reuters.",
    "(-) Mastercard ( MA  ) declined fractionally Wednesday after the credit card issuer said it was teaming up with enterprise blockchain software firm R3 to develop a new blockchain-powered cross-border payments product. The new product will focus on linking global payments infrastructures and banks with a clearing and settlement network to be operated by the company, Mastercard said.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-11 03:54:27"
}