{
  "url": "https://www.nasdaq.com/article/bristol-myers-squibb-bmy-outpaces-stock-market-gains-what-you-should-know-cm1210797",
  "title": "Bristol-Myers Squibb (BMY) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " In the latest trading session, Bristol-Myers Squibb (BMY) closed at $49.24, marking a +1.4% move from the previous day. This move outpaced the S&P 500's daily gain of 0.72%. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%. Prior to today's trading, shares of the biopharmaceutical company had gained 4.45% over the past month. This has outpaced the Medical sector's loss of 1.41% and the S&P 500's gain of 2.25% in that time. BMY will be looking to display strength as it nears its nex t earnings  release. On that day, BMY is projected to report earnings of $1.06 per share, which would represent a year-over-year decline of 2.75%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $5.83 billion, up 2.36% from the year-ago period. BMY's full-year Zacks Consensus Estimates are calling for earnings of $4.28 per share and revenue of $24.07 billion. These results would represent year-over-year changes of +7.54% and +6.69%, respectively. Investors might also notice recent changes to analyst estimates for BMY. These recent revisions tend to reflect the evolving nature of short-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.47% higher. BMY is currently a Zacks Rank #1 (Strong Buy). Looking at its valuation, BMY is holding a Forward P/E ratio of 11.34. Its industry sports an average Forward P/E of 13.8, so we one might conclude that BMY is trading at a discount comparatively. Investors should also note that BMY has a PEG ratio of 2.39 right now. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Large Cap Pharmaceuticals was holding an average PEG ratio of 2 at yesterday's closing price. The Large Cap Pharmaceuticals industry is part of the Medical sector. This industry currently has a Zacks Industry Rank of 43, which puts it in the top 17% of all 250+ industries. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Be sure to follow all of these stock-moving metrics, and many more, on Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Bristol-Myers Squibb Company (BMY): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "In the latest trading session, Bristol-Myers Squibb (BMY) closed at $49.24, marking a +1.4% move from the previous day. This move outpaced the S&P 500's daily gain of 0.72%. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%.",
    "Prior to today's trading, shares of the biopharmaceutical company had gained 4.45% over the past month. This has outpaced the Medical sector's loss of 1.41% and the S&P 500's gain of 2.25% in that time.",
    "BMY will be looking to display strength as it nears its nex t earnings  release. On that day, BMY is projected to report earnings of $1.06 per share, which would represent a year-over-year decline of 2.75%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $5.83 billion, up 2.36% from the year-ago period.",
    "BMY's full-year Zacks Consensus Estimates are calling for earnings of $4.28 per share and revenue of $24.07 billion. These results would represent year-over-year changes of +7.54% and +6.69%, respectively.",
    "Investors might also notice recent changes to analyst estimates for BMY. These recent revisions tend to reflect the evolving nature of short-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.47% higher. BMY is currently a Zacks Rank #1 (Strong Buy).",
    "Looking at its valuation, BMY is holding a Forward P/E ratio of 11.34. Its industry sports an average Forward P/E of 13.8, so we one might conclude that BMY is trading at a discount comparatively.",
    "Investors should also note that BMY has a PEG ratio of 2.39 right now. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Large Cap Pharmaceuticals was holding an average PEG ratio of 2 at yesterday's closing price.",
    "The Large Cap Pharmaceuticals industry is part of the Medical sector. This industry currently has a Zacks Industry Rank of 43, which puts it in the top 17% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Be sure to follow all of these stock-moving metrics, and many more, on Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:45:23"
}