{
  "url": "https://www.nasdaq.com/article/why-fireeye-stock-gave-up-11-in-august-cm1207106",
  "title": "Why FireEye Stock Gave Up 11% in August - Nasdaq.com",
  "text": [
    " What happened  FireEye    (NASDAQ: FEYE) investors trailed the market last month as the   stock lost 11% compared to a 2% decrease in the   S&P 500    , according to data provided by      S&P Global Market Intelligence    . The slump pushed shares to a roughly 20% decline so far in   2019 against a 16% increase in the broader market.   Image source: Getty Images.makeArticleAd();  So what August's drop came as investors digested mixed earnings   results from the   cybersecurity    specialist. Sales landed just above the outlook that CEO Kevin   Mandia and his team had issued for the period. Yet profitability   posted a surprising dip as expenses jumped. FireEye   posted a loss    of $0.33 per share compared to a loss of $0.38 per share a year   ago. Now what Mandia highlighted the company's strengthening billings metric   for new products. That success is being offset by rising costs,   though, and by the retirement of a few legacy products that also   carried high profit margins. These dynamics add up to a   weaker-than-expected 2019 outlook, and so FireEye's stock might   remain stuck behind the market until these operating and   financial conditions improve.   10 stocks we like better than FireEye       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and FireEye wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Demitrios Kalogeropoulos      has no position in any of the stocks mentioned. The Motley Fool     recommends FireEye. The Motley Fool has a     disclosure policy      .  ",
    " FireEye    (NASDAQ: FEYE) investors trailed the market last month as the   stock lost 11% compared to a 2% decrease in the   S&P 500    , according to data provided by      S&P Global Market Intelligence    .",
    "The slump pushed shares to a roughly 20% decline so far in   2019 against a 16% increase in the broader market.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "August's drop came as investors digested mixed earnings   results from the   cybersecurity    specialist. Sales landed just above the outlook that CEO Kevin   Mandia and his team had issued for the period. Yet profitability   posted a surprising dip as expenses jumped. FireEye   posted a loss    of $0.33 per share compared to a loss of $0.38 per share a year   ago.",
    "Mandia highlighted the company's strengthening billings metric   for new products. That success is being offset by rising costs,   though, and by the retirement of a few legacy products that also   carried high profit margins. These dynamics add up to a   weaker-than-expected 2019 outlook, and so FireEye's stock might   remain stuck behind the market until these operating and   financial conditions improve.",
    "  10 stocks we like better than FireEye       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and FireEye wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than FireEye       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and FireEye wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Demitrios Kalogeropoulos      has no position in any of the stocks mentioned. The Motley Fool     recommends FireEye. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 07:56:00"
}