{
  "url": "https://www.nasdaq.com/article/why-workhorse-group-stock-plunged-16-this-morning-cm1207485",
  "title": "Why Workhorse Group Stock Plunged 16% This Morning - Nasdaq.com",
  "text": [
    "  What happened  Shares of start-up battery-electric vehicle manufacturer   Workhorse Group    (NASDAQ: WKHS) plunged more than 16% in early trading Wednesday   -- on no apparent bad news. The stock has recovered a bit since.   It's down \"only\" about 10.9% as of 1:20 p.m. EDT, but still, the   big drop on no obvious bad news is a bit disconcerting. So what is going on here?   Image source: Getty Images.makeArticleAd();   So what  Here at The Motley Fool, we haven't written a lot about   Workhorse Group -- not since July, at least, when the stock   posted an impressive 18.6% jump on speculation that the company   could be in line to win a big contract from the   United States Postal Service    . Now seems a good time to quickly run down what's up (and down)   at Workhorse -- and three things jump right out. First and foremost,   there's the growth potential    . Workhorse Group got a lot of press a few years ago when it was   announced the company had won a contract to sell   125 hybrid electric delivery trucks    to   UPS    . The potential has only gotten bigger as investors speculate   that Workhorse could soon win an even bigger order from the USPS,   which is looking for someone to replace its ancient fleet of   Grumman postal trucks with 180,000 more efficient electric   vehicles -- an order that could be worth as much as $6.3 billion   over a term of five to seven years. Tied into that potential is the belief that Workhorse might be   preparing to buy a factory from   General Motors    (the Lordstown Complex) for as much as $300 million -- a big   price tag for a company that doesn't have even $25 million to its   name. And finally, there's Workhorse's plan to issue 15.7 million   new shares of common stock to raise some of the funds it would   need to make the Lordstown purchase -- a share issuance that was   announced just last month.  Now what  As analysts and investors bet on the likelihood of any of   these three events happening and the value of each event,   Workhorse shares are alternately surging and falling. Which   specific event is behind today's decline in share price? It could   be that folks are starting to worry the company won't win the   USPS contract or that the Lordstown purchase comes at too high a   cost. If I had to bet, though, I'd say it's most likely investors   are simply recalling that Workhorse told the SEC it would sell   its 15.7 million shares for no more than $3.52 apiece. With   Workhorse stock closing north of $4 a share last night, that   implies that new investors will be getting a much better deal on   the shares than existing Workhorse shareholders did -- often a   disheartening event for existing shareholders. The closer the share issuance comes to happening, the more   likely investors will be to examine their shares and wonder   whether they're actually worth as much as they're selling   for.   10 stocks we like better than Workhorse Group       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Workhorse Group wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Rich Smith      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of start-up battery-electric vehicle manufacturer   Workhorse Group    (NASDAQ: WKHS) plunged more than 16% in early trading Wednesday   -- on no apparent bad news. The stock has recovered a bit since.   It's down \"only\" about 10.9% as of 1:20 p.m. EDT, but still, the   big drop on no obvious bad news is a bit disconcerting.",
    "So what is going on here?",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Here at The Motley Fool, we haven't written a lot about   Workhorse Group -- not since July, at least, when the stock   posted an impressive 18.6% jump on speculation that the company   could be in line to win a big contract from the   United States Postal Service    . Now seems a good time to quickly run down what's up (and down)   at Workhorse -- and three things jump right out.",
    "First and foremost,   there's the growth potential    . Workhorse Group got a lot of press a few years ago when it was   announced the company had won a contract to sell   125 hybrid electric delivery trucks    to   UPS    . The potential has only gotten bigger as investors speculate   that Workhorse could soon win an even bigger order from the USPS,   which is looking for someone to replace its ancient fleet of   Grumman postal trucks with 180,000 more efficient electric   vehicles -- an order that could be worth as much as $6.3 billion   over a term of five to seven years.",
    "Tied into that potential is the belief that Workhorse might be   preparing to buy a factory from   General Motors    (the Lordstown Complex) for as much as $300 million -- a big   price tag for a company that doesn't have even $25 million to its   name. And finally, there's Workhorse's plan to issue 15.7 million   new shares of common stock to raise some of the funds it would   need to make the Lordstown purchase -- a share issuance that was   announced just last month.",
    "As analysts and investors bet on the likelihood of any of   these three events happening and the value of each event,   Workhorse shares are alternately surging and falling. Which   specific event is behind today's decline in share price? It could   be that folks are starting to worry the company won't win the   USPS contract or that the Lordstown purchase comes at too high a   cost.",
    "If I had to bet, though, I'd say it's most likely investors   are simply recalling that Workhorse told the SEC it would sell   its 15.7 million shares for no more than $3.52 apiece. With   Workhorse stock closing north of $4 a share last night, that   implies that new investors will be getting a much better deal on   the shares than existing Workhorse shareholders did -- often a   disheartening event for existing shareholders.",
    "The closer the share issuance comes to happening, the more   likely investors will be to examine their shares and wonder   whether they're actually worth as much as they're selling   for.",
    "  10 stocks we like better than Workhorse Group       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Workhorse Group wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Workhorse Group       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Workhorse Group wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Rich Smith      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:01:00"
}