{
  "url": "https://www.nasdaq.com/article/crushing-it-argentine-farmers-cheer-china-soymeal-deal-while-us-growers-fret-20190911-00686",
  "title": "Crushing it: Argentine farmers cheer China soymeal deal while U.S. growers fret - Nasdaq.com",
  "text": [
    "By Hugh Bronstein and Tom Polansek",
    "BUENOS AIRES/CHICAGO, Sept 11 (Reuters) - Argentine soy farmers and crushers expect a boost in demand next year after the South American grains giant won long-sought  approval from China to export soymeal to the world's biggest consumer of the livestock feed.",
    "Argentina, the top international supplier of soymeal,  announced on Tuesday that China would allow imports for the first time following decades of talks. It was a breakthrough amid a whipsawing trade war between Washington and Beijing that has hit U.S. growers. ",
    "\"This news is huge for our country given the magnitude and potential of the new market,\" the Rosario grains exchange said. The majority of Argentina's soy is grown and crushed in the area around Rosario, on the banks of the Parana River.",
    "\"(It) will allow exports to the Asian country to kick in effectively from next year.\"",
    "China consumes an estimated 67.3 million tonnes of soymeal each year to feed its giant hog herd, the Rosario exchange said, though it has imported only small amounts of the processed soy product, preferring to crush the beans domestically.",
    "This has meant that while China has been the top buyer of raw Argentine soybeans, it has long resisted opening up to  soymeal. Argentina's top export markets for the feed are currently Europe, Vietnam, and Indonesia.",
    "Gustavo Idigoras, president of Argentina's CIARA-CEC chamber of grains exporting companies, said he did not expect Argentina to \"export an important volume to China in the first year.\"",
    "\"But for us, having 2 or 3 million tonnes in the market in 2020 would be symbolic in terms of building confidence and developing future business,\" he said.",
    "MESSAGE FOR TRUMP",
    "Argentine soy industry insiders said the U.S.-China trade war had helped make Argentine soymeal exports more alluring as Beijing looks to diversify its supply and to send a message to the United States that it had other options on the table.",
    "The pact, which came together faster than many expected, could help local crushers make up lost ground on U.S. rivals, who have benefited from lower domestic prices linked to a glut of U.S. beans. U.S. farmers, meanwhile, lamented the deal.",
    "\"Of course we're sorry to see it,\" said Ron Heck, a corn and soy farmer in Perry, Iowa, adding he expects that China may pay more than world market prices for Argentine soymeal to avoid buying crops from the United States.",
    "\"China has shown a willingness to pay extra to punish the United States, which falls on me.\"",
    "Max Fisher, director of economics and government relations for the U.S. National Grain and Feed Association, said the deal showed China was looking to avoid U.S. soybeans.",
    "\"It tells me China is attempting to avoid soybeans and gain leverage in the trade negotiations by having an additional supply of soybean meal available to their livestock industry.\"",
    "Argentina could export a total 31 million tonnes of meal from beans harvested in the upcoming 2019/20 season. The amount China will take is still unclear, depending on demand linked to swine flu currently hitting the country's hog herd and Beijing's political will to shift away from local supplies toward imports.",
    "FIRST SHIPMENTS NEXT YEAR",
    "Santiago del Solar, chief of staff to Argentina's agriculture minister, said the deal was \"simple good news.\"",
    "\"We know that last year the possibility of selling soymeal to China was zero. Now we've opened the market, which is good for the whole value chain,\" he told Reuters. \"By the time of our  next soy harvest in March, April and May we hope we will have the paperwork done and have the first shipments.\"",
    "Adding China to the mix in 2020 should lend some stability to a farm sector hurting from political and economic uncertainty,  with business-friendly President Mauricio Macri heading for likely defeat in Argentina's October election.",
    "Front-runner opposition candidate Alberto Fernandez is running with Cristina Fernandez de Kirchner, a former president who was locked in an feud with the farm sector over taxes and export caps during her two terms, between 2007 and 2015.",
    "\"Every new market for our flagship product is good for the economic health of the country,\" said Ezequiel De Freijo, head economist at the Argentine Rural society, which represents some of the country's biggest growers.",
    "Argentine farmers, worried by the volatile political and economic risks, had already said they were likely to boost soy planting this year over more expensive corn. "
  ],
  "published_datetime": "2019-09-11 03:07:00"
}