{
  "url": "https://www.nasdaq.com/article/why-genesco-gco-might-be-well-poised-for-a-surge-cm1210571",
  "title": "Why Genesco (GCO) Might be Well Poised for a Surge - Nasdaq.com",
  "text": [
    " Genesco (GCO) could be a solid choice for investors given the company's remarkably improving earnings outlook. While the stock has been a strong performer lately, this trend might continue since analysts are still raising their earnings estimates for the company. The rising trend in estimate revisions, which is a result of growing analyst optimism on the earnings prospects of this seller of footwear, hats, clothing and accessories, should get reflected in its stock price. After all, empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements. Our stock rating tool -- the Zacks Rank -- has this insight at its core. The five-grade Zacks Rank system, which ranges from a Zacks Rank #1 (Strong Buy) to a Zacks Rank #5 (Strong Sell), has an impressive  externally-audited track record of outperformance  , with Zacks #1 Ranked stocks generating an average annual return of +25% since 2008. For Genesco, there has been strong agreement among the covering analysts in raising earnings estimates, which has helped push consensus estimates considerably higher for the next quarter and full year. The chart below shows the evolution of forward 12-month Zacks Consensus EPS estimate:  12 Month EPS      Current-Quarter Estimate Revisions  The earnings estimate of $1.10 per share for the current quarter represents a change of +15.79% from the number reported a year ago. Over the last 30 days, the Zacks Consensus Estimate for Genesco has increased 14.06% because one estimate has moved higher while one has gone lower.  Current-Year Estimate Revisions  For the full year, the earnings estimate of $4.01 per share represents a change of +22.26% from the year-ago number. In terms of estimate revisions, the trend for the current year also appears quite encouraging for Genesco. Over the past month, two estimates have moved higher compared to no negative revisions, helping the consensus estimate increase 9.28%.  Favorable Zacks Rank  The promising estimate revisions have helped Genesco earn a Zacks Rank #1 (Strong Buy). The Zacks Rank is a tried-and-tested rating tool that helps investors effectively harness the power o f earnings  estimate revisions and make the right investment decision. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  . Our research shows that stocks with Zacks Rank #1 (Strong Buy) and 2 (Buy) significantly outperform the S&P 500.  Bottom Line  Investors have been betting on Genesco because of its solid estimate revisions, as evident from the stock's 20.1% gain over the past four weeks. As its earnings growth prospects might push the stock higher, you may consider adding it to your portfolio right away.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Genesco Inc. (GCO): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Genesco (GCO) could be a solid choice for investors given the company's remarkably improving earnings outlook. While the stock has been a strong performer lately, this trend might continue since analysts are still raising their earnings estimates for the company.",
    "The rising trend in estimate revisions, which is a result of growing analyst optimism on the earnings prospects of this seller of footwear, hats, clothing and accessories, should get reflected in its stock price. After all, empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements. Our stock rating tool -- the Zacks Rank -- has this insight at its core.",
    "The five-grade Zacks Rank system, which ranges from a Zacks Rank #1 (Strong Buy) to a Zacks Rank #5 (Strong Sell), has an impressive  externally-audited track record of outperformance  , with Zacks #1 Ranked stocks generating an average annual return of +25% since 2008.",
    "For Genesco, there has been strong agreement among the covering analysts in raising earnings estimates, which has helped push consensus estimates considerably higher for the next quarter and full year.",
    "The chart below shows the evolution of forward 12-month Zacks Consensus EPS estimate:",
    " 12 Month EPS ",
    " Current-Quarter Estimate Revisions ",
    "The earnings estimate of $1.10 per share for the current quarter represents a change of +15.79% from the number reported a year ago.",
    "Over the last 30 days, the Zacks Consensus Estimate for Genesco has increased 14.06% because one estimate has moved higher while one has gone lower.",
    " Current-Year Estimate Revisions ",
    "For the full year, the earnings estimate of $4.01 per share represents a change of +22.26% from the year-ago number.",
    "In terms of estimate revisions, the trend for the current year also appears quite encouraging for Genesco. Over the past month, two estimates have moved higher compared to no negative revisions, helping the consensus estimate increase 9.28%.",
    " Favorable Zacks Rank ",
    "The promising estimate revisions have helped Genesco earn a Zacks Rank #1 (Strong Buy). The Zacks Rank is a tried-and-tested rating tool that helps investors effectively harness the power o f earnings  estimate revisions and make the right investment decision. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .",
    "Our research shows that stocks with Zacks Rank #1 (Strong Buy) and 2 (Buy) significantly outperform the S&P 500.",
    " Bottom Line ",
    "Investors have been betting on Genesco because of its solid estimate revisions, as evident from the stock's 20.1% gain over the past four weeks. As its earnings growth prospects might push the stock higher, you may consider adding it to your portfolio right away.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:20:02"
}