{
  "url": "https://www.nasdaq.com/article/explainerhow-important-is-hong-kong-to-the-rest-of-china-20190904-01189",
  "title": "EXPLAINER-How important is Hong Kong to the rest of China? - Nasdaq.com",
  "text": [
    "By Noah Sin",
    "HONG KONG, Sept 5 (Reuters) - Concerns over Hong Kong's political and economic future are growing as pro-democracy protests drag on and turn increasingly violent, and China makes clear that forceful intervention is possible.",
    "An intervention by Chinese troops could seriously damage Hong Kong's standing as a stable international financial centre and a gateway for global capital flowing into the world's second-largest economy. No other Chinese city, not even Shanghai, could step into that role in the foreseeable future.",
    "WHY DOES CHINA NEED HONG KONG AS IT IS?",
    "While China still has extensive capital controls and often intervenes in its financial markets and banking system, Hong Kong is one of the most open economies in the world and one of the biggest markets for equity and debt financing.",
    "The size of Hong Kong's economy may only be equivalent to 2.7% of mainland China's now, down from 18.4% in 1997 when it reverted to Chinese rule, but the territory punches above its weight due to its world-class financial and legal systems.",
    "All that is possible due to its unique system of governance.",
    "Under the 'one country, two systems' formula agreed as part of Britain's handover of the territory to China, Hong Kong is guaranteed liberties which are unavailable on the mainland such as freedom of expression and an independent judiciary.",
    "These freedoms give Hong Kong a special status internationally, allowing it to negotiate trade and investment agreements independently from Beijing -- for instance, it does not have to pay the tariffs that the United States is imposing on Chinese imports.",
    "They also mean foreign investors have more faith in Hong Kong's legal and governance systems. China's legal system is accountable to the Communist Party.",
    "WHAT IS AT STAKE?",
    "China uses Hong Kong's currency, equity and debt markets to attract foreign funds, while international companies use Hong Kong as a launchpad to expand into mainland China. The bulk of foreign direct investment (FDI) in China continues to be channeled through the city.",
    "Most of China's biggest firms, from state-owned Industrial and Commercial Bank of China , to private firms like Tencent Holdings , have listed in Hong Kong, often as a springboard to global expansion.",
    "Last year, Chinese companies raised $64.2 billion globally - almost a third of the worldwide total - via initial public offerings (IPOs), but just $19.7 billion of that came from listings in Shanghai or Shenzhen, according to data from Refinitiv, compared with $35 billion in Hong Kong.",
    "\"Connect\" schemes linking the Hong Kong bourse with those in Shanghai and Shenzhen also provide the main gateway for foreigners to buy mainland stocks. ",
    "Chinese businesses also tapped Hong Kong's debt market for 33% of their $165.9 billion in offshore U.S. dollar funding last year, Refinitiv data shows.",
    "Chinese banks hold more assets in Hong Kong -- $1.1 trillion in 2018 -- than lenders from any other region, according to Hong Kong Monetary Authority's data compiled by Natixis. That figure equates to roughly 9% of China's GDP.",
    "Losing such a massive financing channel risks destabilising the already slowing Chinese economy, hurting confidence that the Communist Party can continue to deliver prosperity after a strong, decades-long track record.",
    "Among other deep linkages, Hong Kong's port continues to handle a hefty share of China's exports and imports, and the city was also China's largest trade partner in services in 2018 with its market share of over 20% topping the U.S.'s 17%, China'sCommerce Ministry says.",
    "Hong Kong also has been pivotal to China's longer-term ambition to turn the yuan into a widely-used international currency, competing with the U.S. dollar. While still a long way out, achieving that goal would increase the world's stake in China's success, as well as Beijing's influence.",
    "HOW COULD IT ALL UNRAVEL?",
    "Beijing has said it would not sit idly by if the unrest in Hong Kong threatened Chinese security and sovereignty. Chinese officials have said the events in Hong Kong were an internal matter and denounced foreign interference.",
    "But many world leaders have urged restraint.",
    "Some U.S. senators have threatened to amend the 1992 Hong Kong Policy Act and stop treating it as a separate customs area from the mainland. That hinges on their assessment that Hong Kong is sufficiently independent from Beijing. Any action by mainland troops is likely to be a decisive factor in making that call.",
    "Even if Beijing doesn't resort to the so-called \"nuclear option\" of using troops, signs of more open and direct interference in Hong Kong's affairs and continued street clashes could prompt global investors to seek other low-tax financial centres with highly-respected legal systems, such as Singapore."
  ],
  "published_datetime": "2019-09-04 07:00:00"
}