{
  "url": "https://www.nasdaq.com/article/iran-to-develop-centrifuges-for-faster-uranium-enrichment-20190904-01133",
  "title": "Iran to develop centrifuges for faster uranium enrichment - Nasdaq.com",
  "text": [
    "By Parisa Hafezi and Arshad Mohammed",
    "DUBAI/WASHINGTON, Sept 4 (Reuters) - Iran on Wednesday said it would take another step away from a 2015 nuclear deal by starting to develop centrifuges to speed up its uranium enrichment but it also gave European powers two more months to try to save the multilateral pact.",
    "Separately, the United States refused to ease its economic sanctions on Iran, imposed fresh ones designed to choke off the smuggling of Iranian oil and rebuffed, but did not rule out, a French plan to give Tehran a $15 billion credit line.",
    "The friction has intensified since U.S. President Donald Trump last year withdrew from the 2015 international accord under which Iran had agreed to rein in its atomic program in exchange for relief from economic sanctions.",
    "Washington has since renewed and intensified its sanctions, slashing Iran's crude oil sales by more than 80%.",
    "Trump again said he was open to the possibility of meeting Iranian President Hassan Rouhani but made clear he had no intention of easing sanctions. ",
    "\"That's not happening,\" he said. \"That won't be happening.\"",
    "In a televised address, Rouhani said Iran from Friday will begin developing centrifuges to speed up the enrichment of uranium, which can produce fuel for power plants or for atomic bombs, as the next step in reducing its nuclear commitments. ",
    "Under the accord, Iran was allowed to keep restricted quantities of first-generation centrifuges at two nuclear plants. The successful development of more advanced centrifuges would enable it to produce material for a potential nuclear bomb several times faster.",
    "\"From Friday, we will witness research and development on different kinds of centrifuges and new centrifuges and also whatever is needed for enriching uranium in an accelerated way,\" Rouhani said. \"All limitations on our Research and Development will be lifted on Friday.\"",
    "Iran says it is only enriching uranium to fuel nuclear power plants, but the United States has long suspected the program ultimately aims to produce weapons.",
    "Since Washington's withdrawal from the pact Tehran has made two other moves in violation of the deal, although Iran says it still aims to save the agreement.",
    "Rouhani had threatened to take further measures by Sept. 5 unless France and the other European signatories of the pact did more to protect Iran from the impact of the U.S. penalties, which have drastically reduced Iran's foreign oil sales.",
    "\"It is unlikely that we will reach a result with Europe by today or tomorrow ... Europe will have another two months to fulfil its commitments,\" Rouhani said, according to state TV.",
    "But Rouhani also said Iran's new measures will be \"peaceful, under surveillance of the U.N. nuclear watchdog and reversible\" if European powers keep their promises.",
    "Iranian officials, meanwhile, appeared to give a guarded welcome to a French proposal to save the pact by offering Iran about $15 billion in credit lines until the end of the year if Tehran returned to full compliance. ",
    "The United States was cool to the idea but did not categorically reject it.",
    "\"We did sanctions today. There will be more sanctions coming. We can't make it any more clear that we are committed to this campaign of maximum pressure and we are not looking to grant any exceptions or waivers,\" Brian Hook, the U.S. special representative for Iran, told reporters.",
    "Washington on Wednesday blacklisted what it called an \"oil for terror\" network of firms, ships and people it suspects are  directed by Iran'sIslamic Revolutionary Guard Corps (IRGC) with supplying Syria with oil worth hundreds of millions of dollars. ",
    "The United States also issued a new international shipping advisory about IRGC's use of \"deceptive practices\" to violate U.S. sanctions and warned those who do business with blacklisted entities that they may suffer U.S. sanctions.",
    "Washington also offered a reward of up to $15 million for information that disrupts the IRGC's financial operations and its elite paramilitary and espionage arm, the Quds Force.",
    "The steps intensified the U.S. campaign to eliminate Iran's oil exports as a way to pressure it to restrict its nuclear and missile programs as well as its support for regional proxies.",
    "In a possible olive branch to the West, Sweden said Iran had released seven of the 23 crew members of the British-flagged tanker Stena Impero that was seized earlier this summer.",
    "The IRGC detained the Swedish-owned Stena Impero on July 19 in the Strait of Hormuz waterway for alleged marine violations, two weeks after Britain detained an Iranian tanker off the territory of Gibraltar. That vessel was released in August."
  ],
  "published_datetime": "2019-09-04 17:25:00"
}