{
  "url": "https://www.nasdaq.com/article/apple-watch-sleep-tracking-could-come-as-soon-as-next-week-cm1206853",
  "title": "Apple Watch Sleep Tracking Could Come as Soon as Next Week - Nasdaq.com",
  "text": [
    " Sleep tracking is among the most notable features the   Apple    (NASDAQ: AAPL) Watch lacks, even as smaller rival   Fitbit    (NYSE: FIT) has offered it for years. One technical challenge is   that Apple Watch's battery life is significantly shorter than   Fitbit devices, requiring most users to charge their Apple   smartwatches overnight while they sleep. It became abundantly   clear that the Mac maker was interested in sleep tracking after   its 2017 acquisition of Beddit, which makes dedicated sleep   tracking hardware. Apple could add the feature as soon as next week.   Apple Watch can currently only track sleep with third-party     apps. Image source: Apple.makeArticleAd();  Catching up with Fitbit  9to5Mac    reports that Apple is preparing to add sleep tracking to its   smartwatch via a software update, potentially announcing the   feature at its   iPhone event    next week. No dedicated hardware or sensors will be required,   according to the report. Apple has internally code-named the   sleep tracking function \"Burrito\" and the feature is expected to   be called \"Time in Bed tracking.\" A new Sleep app on the device will assess sleep quality based   on movement and heart rate, among other inputs. The sleep data   will be aggregated within the Health app that Apple is turning   into a comprehensive digital health platform. In order to address   the charging conundrum, Apple might proactively remind users to   charge their devices before going to bed. Even though no specialized hardware is necessary, Apple could   potentially reserve sleep tracking as an exclusive feature for   Apple Watch Series 5, which wouldn't be the first time the   company has made such a move.   Bloomberg    previously reported in February that Apple was working to add   sleep tracking to the Apple Watch by 2020. Another service opportunity? Sleep tracking has been one of Fitbit's most prominent   differentiators. When it   announced the Versa 2    last week, Fitbit said that 64% of respondents to a recent survey   indicated that quality sleep was a priority for their health and   fitness. The company notes it has analyzed over 10.5 billion   nights of sleep tracked in order to improve its sleep tracking   capabilities. Beyond free tools, Fitbit is also including more   sophisticated sleep tracking features as part of Fitbit   Premium, its new personalized fitness service that costs $10 per   month. Adding sleep tracking to the Apple Watch will help the   Cupertino tech giant catch up in at least one department where it   is lagging the competition, although there are third-party Apple   Watch apps that offer sleep tracking. Considering Apple's ongoing   push into services and its expansion into   healthcare    , it wouldn't be all that surprising if the company eventually   introduced a health-oriented subscription offering to add to its   growing list of first-party services that it wants users to sign   up for.   10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Evan Niu, CFA      owns shares of Apple. The Motley Fool owns shares of and     recommends Apple and Fitbit. The Motley Fool has the following     options: short January 2020 $155 calls on Apple and long     January 2020 $150 calls on Apple. The Motley Fool has a     disclosure policy      .  ",
    "Sleep tracking is among the most notable features the   Apple    (NASDAQ: AAPL) Watch lacks, even as smaller rival   Fitbit    (NYSE: FIT) has offered it for years. One technical challenge is   that Apple Watch's battery life is significantly shorter than   Fitbit devices, requiring most users to charge their Apple   smartwatches overnight while they sleep. It became abundantly   clear that the Mac maker was interested in sleep tracking after   its 2017 acquisition of Beddit, which makes dedicated sleep   tracking hardware.",
    "Apple could add the feature as soon as next week.",
    "  Apple Watch can currently only track sleep with third-party     apps. Image source: Apple.makeArticleAd(); ",
    "Apple Watch can currently only track sleep with third-party     apps. Image source: Apple.",
    " 9to5Mac    reports that Apple is preparing to add sleep tracking to its   smartwatch via a software update, potentially announcing the   feature at its   iPhone event    next week. No dedicated hardware or sensors will be required,   according to the report. Apple has internally code-named the   sleep tracking function \"Burrito\" and the feature is expected to   be called \"Time in Bed tracking.\"",
    "A new Sleep app on the device will assess sleep quality based   on movement and heart rate, among other inputs. The sleep data   will be aggregated within the Health app that Apple is turning   into a comprehensive digital health platform. In order to address   the charging conundrum, Apple might proactively remind users to   charge their devices before going to bed.",
    "Even though no specialized hardware is necessary, Apple could   potentially reserve sleep tracking as an exclusive feature for   Apple Watch Series 5, which wouldn't be the first time the   company has made such a move.   Bloomberg    previously reported in February that Apple was working to add   sleep tracking to the Apple Watch by 2020.",
    "Sleep tracking has been one of Fitbit's most prominent   differentiators. When it   announced the Versa 2    last week, Fitbit said that 64% of respondents to a recent survey   indicated that quality sleep was a priority for their health and   fitness. The company notes it has analyzed over 10.5 billion   nights of sleep tracked in order to improve its sleep tracking   capabilities. Beyond free tools, Fitbit is also including more   sophisticated sleep tracking features as part of Fitbit   Premium, its new personalized fitness service that costs $10 per   month.",
    "Adding sleep tracking to the Apple Watch will help the   Cupertino tech giant catch up in at least one department where it   is lagging the competition, although there are third-party Apple   Watch apps that offer sleep tracking. Considering Apple's ongoing   push into services and its expansion into   healthcare    , it wouldn't be all that surprising if the company eventually   introduced a health-oriented subscription offering to add to its   growing list of first-party services that it wants users to sign   up for.",
    "  10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Evan Niu, CFA      owns shares of Apple. The Motley Fool owns shares of and     recommends Apple and Fitbit. The Motley Fool has the following     options: short January 2020 $155 calls on Apple and long     January 2020 $150 calls on Apple. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:11:00"
}