{
  "url": "https://www.nasdaq.com/article/foxconns-gou-quits-taiwans-kmt-paving-way-for-presidential-bid-20190912-00021",
  "title": "Foxconn's Gou quits Taiwan's KMT, paving way for presidential bid - Nasdaq.com",
  "text": [
    "TAIPEI, Sept 12 (Reuters) - Terry Gou, the founder of Apple supplier Foxconn , quit Taiwan's main opposition party on Thursday, paving the way for a possible bid to stand in a presidential election as an independent, complicating President Tsai Ing-wen's prospects.",
    "Gou, Taiwan's richest person with a net worth of $7.6 billion according to Forbes, has extensive business interests in China and is in known for his close ties with Beijing leaders.",
    "He is also known for asserting that self-ruled Taiwan is part of \"one China\", a cherished principle for China, while acknowledging Taipei and Beijing have their own interpretations of what that means.",
    "Gou announced his intention to contest the presidential election in April as the candidate for the China-friendly opposition Kuomintang (KMT). But he lost his bid to win the party's nomination in July.",
    "That raised speculation he would enter the presidential race as an independent but Gou's aide, Tsai Chin-yu, told reporters in Taipei his decision to resign as a member of the KMT was not linked to a decision on whether to run for president.",
    "She cited disappointment with the leadership of a party which she said had become \"outdated\".",
    "\"Effective today, Mr Terry Gou quits the Kuomintang,\" the aide said.",
    "The KMT said it \"deeply regretted\" Gou's decision and urged unity within the party to win the election.",
    "Two people familiar with Gou's thinking said the 68-year-old billionaire was set to announce his bid to become president as an independent candidate by a Sept. 17 deadline for nominations.",
    "Gou would appeal to voters who are dissatisfied with Taiwan's economy and in favour of closer ties with Beijing, one of the sources said.",
    "Relations with Beijing, which have cooled since Tsai became president in 2016, are bound to dominate Taiwan's election.",
    "Beijing suspects Tsai of pushing for Taiwan's formal independence although she denies that.",
    "Beijing considers democratic Taiwan a wayward province and has never renounced the use of force to take it over.",
    "Analysts say Gou's links to China might put off some voters, especially those who are increasingly wary of Beijing's ambitions to absorb the island.",
    "Gou stepped down as chief of Foxconn this year, handing over the running of the company to an operations committee. But he retained a seat on the board of the company, formally known as Hon Hai Precision Industry Co Ltd.",
    "Shares of Foxconn rose 1.6% on Thursday, beating the benchmark index's  0.3% rise. They are down about 20% since Gou announced his presidential bid in mid- April.",
    "Analysts say a bid by Gou to become president as an independent could split the KMT, whose presidential candidate, Han Kuo-yu, is struggling in opinion polls."
  ],
  "published_datetime": "2019-09-12 12:57:00"
}