{
  "url": "https://www.nasdaq.com/article/asia-pacific-shares-jump-as-us-and-china-agree-to-resume-high-level-trade-talks-cm1207682",
  "title": "Asia Pacific Shares Jump as US and China Agree to Resume High-Level Trade Talks - Nasdaq.com",
  "text": [
    "The major Asia Pacific stock indexes are trading sharply higher on Thursday on the news that the U.S. and China had agreed to meet in early October for another round of trade negotiations. The rallies come on top of yesterday's strong gains that were fueled by a surge in Hong Kong following the withdrawal of a controversial extradition bill. Positive developments in Italy and the lifting of some uncertainty in the U.K. over Brexit also underpinned the markets.",
    "At 04:16 GMT, Japan's Nikkei 225 Index is trading 21132.56, up 483.42 or +2.34%. Hong Kong's Hang Seng Index closed at 26624.25, up 101.02 or +0.38% and South Korea's KOSPI Index is at 2012.80, up 24.27 or +1.22%.",
    "In China, the Shanghai Index settled at 3003.44, up 46.03 or 1.56% and Australia's S&P/ASX 200 Index is trading at 6607.40, up 54.40 or +0.83%.",
    "On Thursday, China's Commerce Ministry issued a statement saying that Liu He, China's top negotiator on trade, spoke with U.S. Trade Representative Robert Lighthizer and Treasury Secretary Steven Mnuchin and both sides agreed to hold another round of trade negotiations in Washington, D.C., towards the beginning of October.",
    "In Hong Kong, Chief Executive Carrie Lam on Wednesday fully withdrew a controversial extradition bill that had sparked protests for months. Despite the positive reaction to the news, some analysts feel that \"damage has been done\" and the problems are not going to go away.",
    "In Rome, Italian Prime Minister Giuseppe Conte unveiled his new cabinet on Wednesday, uniting two rival political parties in an unlikely coalition that is expected to improve ties with the European Union and adopt a softer stance on immigration, according to Reuters.",
    "In the UK, Brexit is still up in the air, with possible outcomes ranging from a no-deal exit to abandoning the whole endeavor, prompting some to sound a note of caution. However, some say that the fact that a hard Brexit has, for now, been removed as an immediate risk gave markets some cheer.",
    "After the announcement of the resumption of trade talks between the United States and China in early October, the Australian and New Zealand Dollars rose on economic optimism and the Japanese Yen fell as investors shed safe-haven positions for more attractive higher-yielding currencies.",
    "In other news, Australia reported a weaker-than-expected trade surplus for the month of July, but the trade talk news offset any expected weakness. The Australian trade surplus narrowed to A$ 7,268 million in July from June's surplus of A$ 8,036 million. Investors were looking for a trade surplus of A$ 7,400 million.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 12:51:10"
}