{
  "url": "https://www.nasdaq.com/article/how-the-uk-should-negotiate-brexit-cm1207685",
  "title": "How the UK Should Negotiate Brexit - Nasdaq.com",
  "text": [
    "Let me start out by saying I have no personal interest in Brexit other than it creates volatility and opportunities to trade. However, I have a strong view on the art of negotiating, which UK politicians could use a lesson in.",
    "To put it bluntly, the side willing to walk away from the negotiating table has the upper hand. I call this the art of negotiating.",
    "I learned this many years ago when working as the chief forex and money manager at a branch of an American bank in Singapore.",
    "In those days every purchase at a small shop or from a vendor on the street seemed to be a negotiation, I found that unless I really needed an item I would get a better price if I was willing to walk away from yet another bargaining session over the price. Inevitably the salesperson would call me back as I turned my back to walk away or even chase me down the street offering a better price.",
    "So let’s fast forward to the political circus over Brexit.",
    "One way to gauge Brexit sentiment is by following the value of GBPUSD and EURUSD in the forex market as the UK parliament has tied the hands of PM Johnson by taking away the threat of a no deal exit from the EU. I am not saying the U.K. should leave with no deal but the threat would at least give negotiators leverage in discussions with the EU.",
    "Now that this has been taken away and yet another deadline pushed out by three months what incentive is there for the EU to bend in negotiations as it has the upper hand?",
    "Of course there is still time to find an alternative to the Irish backstop, which remains the sticking point in any agreement. . However, if it was so easy to find a solution by fitting a square peg in a round hold it would have been done already.",
    "In any case, it would have been interesting to see if the EU would have blinked if it faced the risk of a hard Brexit on October 31.  However, UK MPs have taken this off the table and by doing so, they given the government little leverage in Brexit negotiations.",
    "It is apparent they have not learned the art of negotiating, which is to operate from a position of strength rather than weakness.  This suggests, any agreement, if one at all, would likely be on terms more favorable to the EU. ",
    "Jay Meisler",
    "Co-founder, global-view.com",
    "jay@global-view.com",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 07:00:24"
}