{
  "url": "https://www.nasdaq.com/article/amid-us-vaping-crackdown-juul-enters-china-with-online-store-openings-20190912-00052",
  "title": "Amid US vaping crackdown, Juul enters China with online store openings - Nasdaq.com",
  "text": [
    "SHANGHAI, Sept 12 (Reuters) - U.S. e-cigarettes maker Juul Labs Inc, which faces a widening crackdown on vaping at home, has entered China, with online storefronts on e-commerce sites owned by Alibaba Group  and JD.com  to tap the world's largest market of smokers.",
    "Juul, in which tobacco giant Altria Group  owns a 35% stake, has been launching its products in international markets such as South Korea, Indonesia and Philippines. It recently raised over $750 million in an expanded funding round.",
    "The U.S. government announced plans on Wednesday to remove all flavoured e-cigarettes from store shelves, as officials warned that sweet flavours had drawn millions of children into nicotine addiction.",
    "A notice published on Juul's official virtual store on Tmall, an Alibaba e-commerce site, said it had opened on Sept. 9. Juul also had a similar store on JD.com, another major Chinese online retailer.",
    "On Tmall, a Juul device with two flavour pods sells for 299 yuan (about $40). Flavours include mint, mango and strawberry.",
    "Juul, Tmall and JD.com did not immediately respond to requests for comment on Thursday.",
    "China, which is the world's largest single market for tobacco consumption with over 300 million smokers, represents a market with both opportunity and risk for the company.",
    "It is already home to dozens of Chinese competitors with names such as Relx, Yooz, and SNOW+ that have taken tens of millions of dollars in venture capital funding from high-profile investors. Like Juul, the competitors have adopted the concept of producing discrete devices that vaporise potent nicotine salts.",
    "China's government has perennially launched anti-smoking campaigns in an effort to improve public health. Earlier this year it released a draft document suggesting that China's laws regulating e-cigarettes will eventually largely resemble those in Europe.",
    "China's tobacco industry, meanwhile, is tightly controlled by the government-run monopoly China Tobacco, which maintains complete oversight on the sale, production and distribution of tobacco products. Beijing relies on tobacco sales for a sizeable percentage of China's overall tax revenue."
  ],
  "published_datetime": "2019-09-12 02:31:00"
}