{
  "url": "https://www.nasdaq.com/article/have-we-hit-peak-sirius-xm-cm1206809",
  "title": "Have We Hit Peak Sirius XM? - Nasdaq.com",
  "text": [
    "There comes a time when a longtime growth darling burns out. Sirius XM Holdings (NASDAQ: SIRI)  seems to be -- on the surface -- nearing the end of its rock star days.",
    "User growth is slowing, with total subscribers rising a mere 2.5% over the past year. The acquisition of Pandora earlier this year is inflating top-line results in the near term, but if it wasn't for that timely purchase, this would be the fifth consecutive year of sluggish single-digit growth. Revenue gains have decelerated in five of the past six years.",
    "One can argue that you haven't peaked if you're still taking steps in the right direction, but bears have long argued that the trends are not Sirius XM's friends. Auto sales are tailing off, particularly among younger drivers, who would fuel the next generation of its subscribers.",
    "You also have a growing percentage of vehicles on the road raising the bar as connected cars, allowing drivers to bypass pricey premium radio subscriptions and instead stream podcasts and cheaper music services right from their Bluetooth-enabled smartphones.",
    "Then we get to the stock. It has been one of the hottest over the past decade, and it's been surprisingly consistent on an annual basis. You have to go all the way back to 2008 to find a year in which Sirius XM shares didn't deliver positive results. The stock is on track to stretch that streak to 11 consecutive years of investor gains, but it's not beating the market in 2019. It's starting to feel mortal, but this doesn't mean that this is the end of the party.",
    "Howard Stern and co-host Robin Quivers with Madonna, a guest on his Sirius XM show. Image source: Sirius XM Holdings.",
    "Let's try to mow down some of the skepticism. It's true that growth is decelerating, and that's not a surprise for a company that until now has been limited by the reach of its satellites and already has more than 34.3 million subscribers. But that's not the only lever it has to boost its business.",
    "Average revenue per user has risen 4% over the past year, padding subscriber growth. Sirius XM has been able to improve its monetization by passing through rising music royalties, and now with Pandora in its arsenal, it will have yet another way to upsell subscribers on more full-featured plans. Pricing elasticity may get tested -- especially if consumers and investors alike brace for a recession -- but there's no denying the appeal of the platform on its commercial-saddled channels to marketers trying to reach an audience of folks with disposable income.",
    "Trends in car ownership and connected cars are problematic, but this is also why the Pandora deal was so important. Sirius XM now has a strong position in streaming audio, a good place to be with the mobile revolution on the rise. Satellite radio will continue to be a cash cow, delivering high-quality programming to drivers who love the convenience of a traditional dashboard experience. Even if that platform peaks, it will continue to bankroll growth through Pandora and other initiatives. It's just scratching the surface on that front.",
    "The past decade has been ridiculously rewarding for Sirius XM investors, and those aren't the kind of gains that investors can expect in the years ahead. But it is now a steady, quarterly dividend-paying media giant that will likely have a few tricks up its sleeve if subscriber trends ever max out. We're not at peak Sirius XM. We may not even be close to a peak if we approach it (with all due apologies to its star Howard Stern) as the king of all media.",
    "10 stocks we like better than Sirius XM Radio\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Sirius XM Radio wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Rick Munarriz owns shares of Sirius XM Holdings. The Motley Fool recommends Sirius XM Holdings. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:05:00"
}