{
  "url": "https://www.nasdaq.com/article/deltas-dal-august-traffic-data-solid-on-strong-demand-cm1208132",
  "title": "Delta's (DAL) August Traffic Data Solid on Strong Demand - Nasdaq.com",
  "text": [
    "Delta Air LinesDAL reported impressive traffic figures for August. Consolidated traffic, measured in revenue passenger miles (RPMs), increased 5% to 23.53 billion on strong demand for air travel.\r\n Consolidated capacity (or available seat miles/ASMs) also climbed 3.7% to 26.4 billion on a year-over-year basis. With traffic growth outpacing capacity expansion, load factor (percentage of seats filled by passengers) expanded 110 basis points (bps) to 89.1%.\r\n Additionally, the carrier recorded an on-time performance (mainline) of 83.2% and a completion factor (mainline) of 99.8%. Delta's passenger count rose 5% to 19.2 million in the month.\r\n On a year-to-date basis, Delta registered RPMs of 162.09 billion (up 5.5%) and ASMs of 186.99 billion (up 4.5%). As a result, load factor improved 80 bps to 86.7%.",
    "Delta Air Lines, Inc. Price",
    "Delta Air Lines, Inc. price | Delta Air Lines, Inc. Quote",
    "Cowen and Company Conference Update\r\n At the Cowen and Company 12th Annual Global Transportation Conference held on Sep 4, Delta provided an upbeat outlook for not only the third quarter but the full year as well. On the back of strong demand for Delta's services and rising revenues, the company is hopeful about achieving its third-quarter earnings and revenue targets. For the September quarter, earnings (excluding special items) are anticipated between $2.10 and $2.40 per share (the mid-point of the guided range - $2.25 - is much higher than the year-ago reported figure of $1.8but tad lower than the Zacks Consensus Estimate of $2.26). Meanwhile, total unit revenues on an adjusted basis, are estimated to increase 1.5-3.5%.\r\n Additionally, the carrier is confident about registering 6-7% top-line growth and a 25% surge in earnings per share in 2019 besides generating solid margins. The company expects pre-tax income and operating cash flow of $6 billion and $8.5 billion, respectively, in the current year. However, on the flip side, rising passenger numbers, high labor costs and weather-related adversities are putting pressure on the company's non-fuel unit costs. Evidently, non-fuel unit costs are projected to rise 1-2% year over year in the third quarter.\r\n Meanwhile, at the aforementioned conference, Delta's rival United Airlines UAL stated that it expects third-quarter passenger unit revenues to be near the mid-point of the guided range of an increase between 0.5% and 2.5%. The view includes a 50-basis point negative impact from weak demand scenario in China including Hong Kong. Additionally, the company maintains its expectations for current-quarter adjusted pre-tax margin in the 10-12% range. Also, the estimate for 2019 adjusted earnings is reiterated between $10.50 and $12 per share. The mid-point of the guided range - $11.25 - is lower than the Zacks Consensus Estimate of $11.7.Zacks Rank & Key Picks\r\n Delta carries a Zacks Rank #3 (Hold). Some better-ranked stocks in the same space are Allegiant Travel Company ALGT and Copa Holdings, S.A. CPA , both sporting a Zacks Rank #1 (Strong Buy). You can see the complete list of today's Zacks #1 Rank stocks here .\r\n Shares of Allegiant and Copa have gained more than 7% and 32%, respectively, in a year's time.It's Illegal in 42 States, But Investors Will Make Billions Legally\r\n In addition to the companies you read about above, today you get details on the newly-legalized\r\n industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.\r\n That's twice as much as they spend on marijuana, legally or otherwise.\r\n Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:05:00"
}