{
  "url": "https://www.nasdaq.com/article/genuine-parts-company-gpc-ex-dividend-date-scheduled-for-september-05-2019-cm1207124",
  "title": "Genuine Parts Company (GPC) Ex-Dividend Date Scheduled for September 05, 2019 - Nasdaq.com",
  "text": [
    "Genuine Parts Company ( GPC  ) will begin trading ex-dividend on September 05, 2019. A cash dividend payment of $0.762 per share is scheduled to be paid on October 01, 2019. Shareholders who purchased GPC prior to the ex-dividend date are eligible for the cash dividend payment. This marks the 3rd quarter that GPC has paid the same dividend. At the current stock price of $90.8, the dividend yield is 3.36%.",
    "The previous trading day's last sale of GPC was $90.8, representing a -21.18% decrease from the 52 week high of $115.20 and a 4.06% increase over the 52 week low of $87.26.",
    "GPC is a part of the Capital Goods sector, which includes companies such as Copart, Inc. ( CPRT  ) and CarMax Inc ( KMX  ). GPC's current earnings per share, an indicator of a company's profitability, is $5.38. Zacks Investment Research reports GPC's forecasted earnings growth in 2019 as .42%, compared to an industry average of 1.8%.",
    "For more information on the declaration, record and payment dates, visit the GPC Dividend History  page. Our  Dividend Calendar  has the full list of stocks that have an ex-dividend today.",
    " Interested in gaining exposure to GPC through an Exchange Traded Fund [ETF]?   The following ETF(s) have GPC as a top-10 holding:  First Trust Nasdaq Transportation ETF (   FTXR    ) NuShares Enhanced Yield US Aggregate Bond ETF (   NUMV    ) SPDR Russell 1000 Low Volatility Focus ETF (   ONEV    ).  ",
    "The top-performing ETF of this group is ONEV with an increase of 1.43% over the last 100 days. FTXR has the highest percent weighting of GPC at 7.36%.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:00:04"
}