{
  "url": "https://www.nasdaq.com/article/cvs-fundamentals-matter-cm1210364",
  "title": "CVS: Fundamentals Matter - Nasdaq.com",
  "text": [
    "At a time when the news is flowing quickly, it is easy for investors to lose sight of the fundamentals that should drive long-term investment. Whatever your political proclivities, it seems there is a story out there to scare you, whether it's Elizabeth Warren's  wealth tax proposal  or Donald Trump's  descent into insult territory  with his attacks on his own appointee at the Fed. That all leads to lots of speculation about the possible effects on relatively few stocks, but if you keep your attention there, you are probably missing out. ",
    "While all of this is going on, some corporations are doing what corporations do: pursuing profit and growth, and investing in their future. As hard as it sometimes is to tear yourself away from the personal attacks and scare stories that define modern American politics, there are some stories that, in investing terms, are far more important. Take, for example, the quiet revolution in healthcare enacted at CVS (CVS). ",
    "The company has invested over the last few years to position itself as a kind of \"soup to nuts\" healthcare company. You can now go to a Minute Clinic located in a CVS store for diagnosis and treatment, pick up the prescription that is written for you there, and pay for the whole thing with your Aetna insurance, now owned by CVS. Even the lesser-known part of the entire process, pharmacy benefit management, is controlled by CVS through their subsidiary, Caremark. ",
    "The merger with Aetna has received all the media attention recently, as a federal judge just approved the deal, but one could argue that the revolution was really made possible by the Minute Clinics. They were a solution to a very real problem and increasingly looked like a genius move by the company. People with minor ailments don't want the hassle of making an appointment to see their regular doctor if they have one. In the past, some turned to the emergency room, but overcrowding and ridiculous expense made that very unappealing.  ",
    "Minute clinics are highly visible and offer easy, fast, inexpensive access to basic care. From CVS's point of view, they also make it far more likely that consumers will use the in-house pharmacy, and buy anything else they need, dressings, supplements, etc. from the store. I am not sure if it's official policy, but I have noticed when I have used a Minute Clinic that the physician assistants who assisted me were so helpful that they took me to the place in the store where the things they have just suggested are kept. I am not sure if that is just great service or a subtle way to increase the revenue from my visit, but either way, I spent some extra dollars at CVS. ",
    "In reality, Caremark is the biggest revenue source in the company now, but that revenue is only sustainable if patients use the other, more visible services and Minute Clinics make that more likely. The idea of one company controlling every aspect of your regular healthcare needs may be scary to some, but for many people, it simplifies the incredibly confusing experience of going for and paying for treatment. ",
    "So, what does all this mean for investors? ",
    "As you can see, despite the long-term advantages of CVS's vertical expansion strategy, the stock has spent most of the last year in a dramatic decline. One of the main drivers of that was the Aetna deal. There was uncertainty about whether or not it would go through and concern about the amount of debt that resulted from it. Both of those things are less worrisome now. A federal judge has approved the deal, and the company has laid out and begun a clear plan to pay down the debt. ",
    "What we are left with is a company that is growing revenue and profit and pays a decent three percent dividend, yet is still trading at a substantial discount to the S&P 500 average P/E. Those are the things that matter, and CVS looks like a good long-term investment because of them. ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:47:38"
}