{
  "url": "https://www.nasdaq.com/article/3-money-milestones-everyone-should-reach-by-40-cm1207380",
  "title": "3 Money Milestones Everyone Should Reach by 40 - Nasdaq.com",
  "text": [
    " Age 40 might be the new 30, but that doesn't let you off the   hook from meeting some important financial goals. Here are three   key milestones you should aim to hit by the time your   40th birthday rolls around.  1. Have a healthy emergency fund  Unplanned expenses can pop up at any point in life, but the   older you are, the more likely you are to own items, like a home   or a car, that cost you a bundle out of the blue. Furthermore,   you never know when you might get sick and rack up a host of   medical bills or lose your job and struggle to find a new one for   months. That's why you need an   emergency fund    -- money in savings to cover you for such events. Ideally, your emergency fund should contain enough cash to pay   for three to six months of essential living expenses. If you're a   homeowner and have children or other dependents, it generally   pays to aim for the higher end of that range for added   protection.makeArticleAd();   IMAGE SOURCE: GETTY IMAGES.  Building an emergency fund isn't something most of us can do   overnight, so if you're nearing age 40 without much cash in the   bank, start making serious lifestyle changes that allow you to   boost your savings.   Set up a budget    to see where you're overspending, and cut back on expenses with   wiggle room, like leisure and dining out. At the same time,   consider a   side job    if your primary source of income doesn't allow you to build   savings. Putting in a few extra hours a week could help you boost   your cash reserves rather quickly.  2. Kick your credit card debt  Carrying a credit card balance means throwing money away on   interest each month -- money that could instead be used to fund   your   retirement savings plan    , pay for much-needed home repairs and improvements, or help put   your kids through college. If you have credit card debt, you   should definitely aim to eliminate it by the time you turn   40. To accomplish this goal, start by ordering your balances from   highest to lowest interest rate so that you know to pay them off   in that order. Another option?   Transfer your various balances    onto a single credit card with a lower interest rate to   streamline the repayment process and save money at the same   time. Of course, you'll need cash to pay off that debt, but that's   where the aforementioned advice comes in. Cutting back on living   expenses will free up money to chip away at your balances, as   will working a second job on top of your primary one.   Furthermore, if you take on a side gig and therefore have less   free time, you may also be less tempted to spend recklessly going   forward.  3. Buy life insurance  The younger you are when you purchase a   life insurance policy    , the more likely you are to lock in an affordable rate on your   premiums. If you have people in your life who depend on you   financially, or who stand to lose out financially if you were to   pass, then it absolutely pays to buy life insurance. That said, you don't need a huge policy with a $1 million   death benefit. A modest policy to replace a few years' worth of   income and pay off your mortgage, for example, may suffice for   your family. Term life insurance, which covers you for a limited but   potentially lengthy period of time, is generally a more   affordable option than permanent life insurance, which covers you   indefinitely. That said, permanent life insurance accumulates a   cash value that term life insurance does not. That cash value is   something you can borrow against or withdraw from as the need   arises, so be sure to weigh your options to see what makes the   most sense for you and your loved ones. Tackling these important money moves by the time you turn 40   will give you something to be proud of when that big birthday   rolls around. Just as importantly, it'll make you a more   financially secure person, which is no doubt something worth   celebrating.   The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .   The Motley Fool has a     disclosure policy      .  ",
    "Age 40 might be the new 30, but that doesn't let you off the   hook from meeting some important financial goals. Here are three   key milestones you should aim to hit by the time your   40th birthday rolls around.",
    "Unplanned expenses can pop up at any point in life, but the   older you are, the more likely you are to own items, like a home   or a car, that cost you a bundle out of the blue. Furthermore,   you never know when you might get sick and rack up a host of   medical bills or lose your job and struggle to find a new one for   months. That's why you need an   emergency fund    -- money in savings to cover you for such events.",
    "Ideally, your emergency fund should contain enough cash to pay   for three to six months of essential living expenses. If you're a   homeowner and have children or other dependents, it generally   pays to aim for the higher end of that range for added   protection.",
    "  IMAGE SOURCE: GETTY IMAGES. ",
    "IMAGE SOURCE: GETTY IMAGES.",
    "Building an emergency fund isn't something most of us can do   overnight, so if you're nearing age 40 without much cash in the   bank, start making serious lifestyle changes that allow you to   boost your savings.   Set up a budget    to see where you're overspending, and cut back on expenses with   wiggle room, like leisure and dining out. At the same time,   consider a   side job    if your primary source of income doesn't allow you to build   savings. Putting in a few extra hours a week could help you boost   your cash reserves rather quickly.",
    "Carrying a credit card balance means throwing money away on   interest each month -- money that could instead be used to fund   your   retirement savings plan    , pay for much-needed home repairs and improvements, or help put   your kids through college. If you have credit card debt, you   should definitely aim to eliminate it by the time you turn   40.",
    "To accomplish this goal, start by ordering your balances from   highest to lowest interest rate so that you know to pay them off   in that order. Another option?   Transfer your various balances    onto a single credit card with a lower interest rate to   streamline the repayment process and save money at the same   time.",
    "Of course, you'll need cash to pay off that debt, but that's   where the aforementioned advice comes in. Cutting back on living   expenses will free up money to chip away at your balances, as   will working a second job on top of your primary one.   Furthermore, if you take on a side gig and therefore have less   free time, you may also be less tempted to spend recklessly going   forward.",
    "The younger you are when you purchase a   life insurance policy    , the more likely you are to lock in an affordable rate on your   premiums. If you have people in your life who depend on you   financially, or who stand to lose out financially if you were to   pass, then it absolutely pays to buy life insurance.",
    "That said, you don't need a huge policy with a $1 million   death benefit. A modest policy to replace a few years' worth of   income and pay off your mortgage, for example, may suffice for   your family.",
    "Term life insurance, which covers you for a limited but   potentially lengthy period of time, is generally a more   affordable option than permanent life insurance, which covers you   indefinitely. That said, permanent life insurance accumulates a   cash value that term life insurance does not. That cash value is   something you can borrow against or withdraw from as the need   arises, so be sure to weigh your options to see what makes the   most sense for you and your loved ones.",
    "Tackling these important money moves by the time you turn 40   will give you something to be proud of when that big birthday   rolls around. Just as importantly, it'll make you a more   financially secure person, which is no doubt something worth   celebrating.",
    "  The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      . ",
    " The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .",
    " The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:11:00"
}