{
  "url": "https://www.nasdaq.com/article/us-stocksrobust-economic-data-easing-trade-worries-push-wall-street-higher-20190905-00886",
  "title": "US STOCKS-Robust economic data, easing trade worries push Wall Street higher - Nasdaq.com",
  "text": [
    " (For a live blog on the U.S. stock market, click LIVE/ ortype LIVE/ in a news window.)",
    "* U.S., China to hold high-level talks in October",
    "* Technology stocks boost; defensive sectors fall",
    "* U.S. services sector growth rises; private jobs jump",
    "* Indexes up: Dow 1.49%, S&P 1.21%, Nasdaq 1.45%  (Updates to early afternoon)",
    "By Uday Sampath Kumar",
    "Sept 5 (Reuters) - U.S. stocks hit a one-month high onThursday on hopes of a de-escalation in trade tensions afterWashington and Beijing agreed to hold high-level talks nextmonth, while strong economic data eased concerns of a domesticslowdown.",
    "The benchmark S&P 500 .SPX surpassed its 50-day movingaverage, a key indicator for short-term momentum, and is nowjust 1.76% away from its record high.",
    "Earlier, China'sCommerce Ministry said its trade team wouldlay the groundwork with their U.S. counterparts in mid-Septemberfor the October talks, providing relief for markets around theglobe that have been bruised by the drawn-out trade war. urn:newsml:reuters.com:*:nL3N25W0JF",
    "Technology stocks .SPLRCT provided the biggest boost toS&P 500, rising 1.72%, while financials .SPSY jumped 1.96%,the most among the 11 major S&P sectors.",
    "Interest rate-sensitive banks .SPXBK surged 2.62%,following a rise in U.S. Treasury yields. US/",
    "\"The trade news was the spark that lit this rally and thenthe economic data extended it,\" said Michael Antonelli, marketstrategist at Robert W. Baird in Milwaukee. ",
    "The ADP National Employment Report, considered a precursorto the Labor Department's more comprehensive jobs report, showedU.S. private employers' payrolls grew at the fastest pace infour months in August, led by big gains in service-sector jobs. urn:newsml:reuters.com:*:nL2N25W0EW",
    "Another private survey showed growth in the U.S. servicessectors accelerated in August, rebounding from its weakest levelin nearly three years, as new orders rose to their highest levelsince February amid trade worries. urn:newsml:reuters.com:*:nL2N25V14B",
    "\"Manufacturing is in a bit of a global slump, but if youlook at the other economic data, like the services and jobsreports, none of them point to an economy that is teetering on arecession,\" Antonelli said. ",
    "The upbeat reports eased concerns of an economic downturn,which was exacerbated by data on Tuesday that showed acontraction in U.S. factory activity in August. Investors willkeep a close watch on the crucial nonfarm payrolls data due onFriday. ",
    "At 13:06 ET, the Dow Jones Industrial Average .DJI was up392.12 points, or 1.49%, at 26,747.59, the S&P 500 .SPX was up35.56 points, or 1.21%, at 2,973.34 and the Nasdaq Composite .IXIC was up 116.06 points, or 1.45%, at 8,092.94.",
    "In deal news, insurer Prudential Financial IncPRU.N agreed to acquire online insurance startup Assurance IQ Inc for$2.35 billion. Shares of Prudential fell 2.6%.",
    "Among losers were the defensive utilities .SPLRCU , realestate .SPLRCR and consumer staples .SPLRCS sectors.  ",
    "Advancing issues outnumbered decliners by a 1.95-to-1 ratioon the NYSE and by a 2.70-to-1 ratio on the Nasdaq.",
    "The S&P index recorded 54 new 52-week highs and no new lows,while the Nasdaq recorded 67 new highs and 35 new lows.",
    "\n<^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\nMarkets indices   https://tmsnrt.rs/2PYeCn0\n    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^> (Reporting by Uday Sampath in Bengaluru; Editing by AnilD'Silva and Arun Koyyur) ((UdaySampath.Kumar@thomsonreuters.com; within U.S.+1 646 2238780; Twitter: @sampath_uday; Reuters Messaging:UdaySampath.Kumar.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-05 01:32:00"
}