{
  "url": "https://www.nasdaq.com/article/heres-why-gw-pharmaceuticals-dropped-12-in-august-cm1210516",
  "title": "Here’s Why GW Pharmaceuticals Dropped 12% in August - Nasdaq.com",
  "text": [
    " What happened Shares of   GW Pharmaceuticals    (NASDAQ: GWPH) dropped 12.2% in August, according to data   provided by      S&P Global Market Intelligence,    after the company posted fairly solid   second-quarter results    . So what Sales of Epidiolex, a cannabidiol (CBD) drug derived from   marijuana, more than doubled from the first quarter to the second   quarter with over 12,000 patients having received the drug and a   \"vast majority\" remaining on the therapy, according to the   company. On the bottom line, GW Pharmaceuticals posted a profit of   $0.21 per share, although that was entirely due to selling a Rare   Pediatric Priority Review Voucher. If a company doesn't need the   voucher, which can be turned in for a faster FDA review, it can   be sold -- as GW Pharmaceuticals did for a little over $104   million.makeArticleAd(); The company's operating loss improved to $29.3 million from   $81.4 million in the year-ago quarter. Overall, this seems to be a sell-the-news issue for the   cannabis-focused biotech    . It took about a week to erase the post-earnings gains, and then   it was downhill from there. The fact that GW Pharmaceuticals was   one of the   best-performing cannabis stocks on the market so   far in 2019    probably contributed to the decline. Even after the rough month,   it's still up over 45% for the year.   Image source: Getty Images.  Now what With growth likely to continue, this move could be a good   opportunity for investors to buy GW Pharmaceuticals on the   cheap(er). In July, the company gained a positive opinion from the   European Medicines Agency's Committee for Medicinal Products for   Human Use for Epidiolex as a treatment for Lennox-Gastaut   syndrome and Dravet syndrome. In the EU, the drug will go by the   brand name Epidyolex. The European Commission should give the rubber-stamp final   approval in the next few weeks. GW Pharmaceuticals will be able   to launch in some European countries quickly, but many countries   will require negotiations with national healthcare organizations   before the company can start benefiting from the additional   approval.   10 stocks we like better than GW     Pharmaceuticals       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and GW Pharmaceuticals wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Brian Orelli      and The Motley Fool have no position in any of the stocks     mentioned. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   GW Pharmaceuticals    (NASDAQ: GWPH) dropped 12.2% in August, according to data   provided by      S&P Global Market Intelligence,    after the company posted fairly solid   second-quarter results    .",
    "Sales of Epidiolex, a cannabidiol (CBD) drug derived from   marijuana, more than doubled from the first quarter to the second   quarter with over 12,000 patients having received the drug and a   \"vast majority\" remaining on the therapy, according to the   company.",
    "On the bottom line, GW Pharmaceuticals posted a profit of   $0.21 per share, although that was entirely due to selling a Rare   Pediatric Priority Review Voucher. If a company doesn't need the   voucher, which can be turned in for a faster FDA review, it can   be sold -- as GW Pharmaceuticals did for a little over $104   million.",
    "The company's operating loss improved to $29.3 million from   $81.4 million in the year-ago quarter.",
    "Overall, this seems to be a sell-the-news issue for the   cannabis-focused biotech    . It took about a week to erase the post-earnings gains, and then   it was downhill from there. The fact that GW Pharmaceuticals was   one of the   best-performing cannabis stocks on the market so   far in 2019    probably contributed to the decline. Even after the rough month,   it's still up over 45% for the year.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "With growth likely to continue, this move could be a good   opportunity for investors to buy GW Pharmaceuticals on the   cheap(er).",
    "In July, the company gained a positive opinion from the   European Medicines Agency's Committee for Medicinal Products for   Human Use for Epidiolex as a treatment for Lennox-Gastaut   syndrome and Dravet syndrome. In the EU, the drug will go by the   brand name Epidyolex.",
    "The European Commission should give the rubber-stamp final   approval in the next few weeks. GW Pharmaceuticals will be able   to launch in some European countries quickly, but many countries   will require negotiations with national healthcare organizations   before the company can start benefiting from the additional   approval.",
    "  10 stocks we like better than GW     Pharmaceuticals       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and GW Pharmaceuticals wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than GW     Pharmaceuticals       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and GW Pharmaceuticals wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Brian Orelli      and The Motley Fool have no position in any of the stocks     mentioned. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:05:00"
}