{
  "url": "https://www.nasdaq.com/article/coal-industry-players-continue-to-fight-a-losing-battle-cm1210620",
  "title": "Coal Industry Players Continue to Fight a Losing Battle - Nasdaq.com",
  "text": [
    "The Zacks Coal industry comprises companies that are involved in the discovery and mining of coal. Depending on the deposit, coal is mined by either opencast or underground mining. Coal is valued for its energy content and used worldwide to generate electricity and in steel and cement manufacturing.\r\n However, the importance of coal and the coal industry has declined in the United States over the past few years, with natural gas and renewable sources creating more downside pressure.\r\n Let's take a look at the industry's three major themes:",
    "Zacks Industry Rank Indicates Weak Prospect\r\n The Zacks Coal industry is a 14 stock group within the broader Zacks Oil and Energy sector. The industry currently carries a Zacks Industry Rank #228, which places it at the bottom 11% of more than 250 Zacks industries.\r\n The group's Zacks Industry Rank , which is basically the average of the Zacks Rank of all the member stocks, indicates strong performance in the near term. Our research shows that the top 50% of the Zacks-ranked industries outperforms the bottom 50% by a factor of more than 2 to 1.\r\n The industry's position in the bottom 11% of the Zacks-ranked industries is a result of negative earnings outlook for the constituent companies in aggregate. Looking at the aggregate earnings estimate revisions, it appears that analysts are gradually losing confidence in this group's earnings growth potential. Since December 2018, the industry's earnings estimate for the current year has gone down by nearly 45%.                                \r\n Before we present a few coal stocks that you may want to consider, let's take a look at the industry's recent stock-market performance and valuation picture.Industry Lags S&P 500 & Sector\r\n The Zacks Coal industry has underperformed the Zacks S&P 500 composite and the Zacks Oil and Gas sector over the last 12 months.\r\n The stocks in the coal industry have collectively declined 44.1% compared with the Zacks Oil-Energy sector's decrease of 19.9%.  In contrast, the Zacks S&P 500 composite has gained 2%.One Year Price Performance",
    "Coal Industry's Current Valuation\r\n Since coal companies have a lot of debt on their balance sheet, it makes sense to value them based on the EV/EBITDA (Enterprise Value/ Earnings before Interest Tax Depreciation and Amortization) ratio.\r\n The industry is currently trading at trailing 12-month EV/EBITDA of 3.96X compared with the Zacks S&P 500 composite's 11.1X and the sector's 4.66X.\r\n Over the past five years, the industry has traded as high as 7.28X, as low as 2.88X and at the median of 4.4X.Enterprise Value-to EBITDA (EV/EBITDA) Ratio vs S&P 500",
    "Enterprise Value-to EBITDA (EV/EBITDA) Ratio vs Sector",
    "To Sum Up\r\n The coal industry has already seen its share of difficulties, with dropping demand, rising competition from other energy sources and increasing emission awareness taking a toll on the industry over the past few years. At present, higher volumes of coal are produced from mines with minimum human intervention, which also has a negative impact on job growth in the coal industry.\r\n The change in policy by the current U.S. administration is assisting coal-fired plants and creating demand for the commodity but the expected drop in U.S. coal exports is likely to create more challenges for the industry. Amid such difficulties, coal companies are trying to reduce operating costs, idle high cost mines, produce more low cost mines and enter into collaborations to remain competitive.\r\n To offset the negative impact of clean natural gas and renewable sources on coal demand, Peabody Energy Corporation (BTU) and Arch Coal Inc. (ARCH) have decided to form a joint venture by merging some of their most-productive coal mines in Powder River Basin and Colorado.  The objective is to lower operating costs and operate low cost mines to keep coal competitive as an energy source.\r\n At present, among the coal stocks under our coverage, only Yanzhou Coal Mining Company Limited (YZCAY) sports a Zacks Rank #1 (Strong Buy) and the majority of coal stocks carry a Zacks Rank#3 (Hold). You can see the complete list of today's Zacks #1 Rank stocks here.\r\n Zoucheng, China based Yanzhou Coal Mining Company Limited has returned 34.4% year to date and its curren t dividend yield is 6.57%. The Zacks Consensus Estimate has remained unchanged over the past month.",
    "Price & Consensus: YZCAY",
    "Brookwood, AL, based Warrior Met Coal, Inc. (HCC) has lost 6.6% year to date and its current dividend yield is 0.9%. The Zacks Consensus Estimate has remained unchanged over the past month.Price & Consensus: HCC",
    "\r\n Canonsburg, PA based CONSOL Coal Resources LP (CCR) has lost 19% year to date and its current dividend yield is 15.25%. The Zacks Consensus Estimate has remained unchanged over the past month.",
    "Price & Consensus: CCR",
    "Looking for Stocks with Skyrocketing Upside?\r\n Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.\r\n Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "See the pot trades we're targeting>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:45:00"
}