{
  "url": "https://www.nasdaq.com/article/nissan-china-head-turnaround-executive-among-top-candidates-for-ceo-20190912-00096",
  "title": "Nissan China head, turnaround executive among top candidates for CEO - Nasdaq.com",
  "text": [
    "By Norihiko Shirouzu, Laurence Frost and Gilles Guillaume",
    "SEATTLE/PARIS, Sept 12 (Reuters) - The head of Nissan Motor Co'sChina business and an executive tasked with leading its revival have emerged as two of the top candidates to take over as the next CEO of the troubled Japanese automaker, four people familiar with the matter said.",
    "Discussions are still underway and nothing has been decided, said the people, all of whom spoke on condition of anonymity. There is also a possibility that another candidate could still be successful, with temporary Chief Executive Yasuhiro Yamauchi seen as one possibility, according to two sources.",
    "Two of the top candidates are Makoto Uchida, in charge of Nissan's operations in China, its biggest market, and Jun Seki, who previously headed the China business and is now spearheading an internal team charged with Nissan's recovery.",
    "Uchida, who has worked on purchasing for the alliance, is seen as being favoured by Renault and Renault-friendly members of Nissan's board, while Seki is preferred by those from the Nissan side, two of the people familiar with the matter said.",
    "\"Renault is much more familiar with Uchida,\" one of the people, a Nissan insider, said. \"The Renault side thinks Uchida is much easier to control than Seki.\"",
    "Nissan did not immediately respond to a request for comment.",
    "Other board members are throwing their weight behind Seki, partially due to politics but also because he is seen as having more well rounded experience as an auto executive, the two said.",
    "\"Seki is much more personable and well liked within Nissan and trusted by his peers and those under him,\" the Nissan insider said.",
    "SHORT LEAD TIME",
    "The nominations committee, which includes board members, is considering the candidates from a list of around 10, according to another person familiar with the deliberations. The board will ultimately vote on the next CEO.",
    "\"Given the short lead time, the next CEO most likely wouldn't be someone too far from the existing power structure,\" said Andre Lindeque, representative director of Turnpoint Consulting, an automotive recruiting agency in Tokyo.",
    "\"The focus on improved corporate governance may allow them the leeway to elevate someone who does not pose too much disruption to the leadership team.\"",
    "Nissan said this week that Chief Executive Hiroto Saikawa will resign on Sept. 16, bowing to pressure after he admitted to being improperly overpaid by around $440,000. It marks more  upheaval at a company battered by a plunge in profit and the dramatic arrest of former chairman Carlos Ghosn last year.",
    "Yamauchi will take over as temporary chief executive and the nominations committee has said it wants a permanent replacement appointed by the end of October.",
    "Yamauchi is also seen as possible candidate especially if the board wants to stress continuity, two sources said.",
    "Nissan managers favour Yamauchi, one of the people said.",
    "Yamauchi, 63, is widely seen as a bridge between the alliance partners, and the near four-decade Nissan veteran is known to be well-regarded at Renault where he serves as a board member."
  ],
  "published_datetime": "2019-09-12 03:44:00"
}