{
  "url": "https://www.nasdaq.com/article/is-profunds-biotech-ultra-sector-investor-bipix-a-strong-mutual-fund-pick-right-now-cm1207718",
  "title": "Is ProFunds Biotech Ultra Sector Investor (BIPIX) a Strong Mutual Fund Pick Right Now? - Nasdaq.com",
  "text": [
    "Having trouble finding a Sector - Health fund? Well, ProFunds Biotech Ultra Sector Investor (BIPIX) would not be a good potential starting point right now. BIPIX bears a Zacks Mutual Fund Rank of 4 (Sell), which is based on nine forecasting factors like size, cost, and past performance.",
    "Objective",
    "We note that BIPIX is a Sector - Health fund, and this area is also loaded with various options. Sector - Health mutual funds give investors an opportunity to focus on one of the largest sectors of the American economy, healthcare. Funds in this category can include everything from for-profit hospitals to pharmaceutical companies and medical device manufacturers.",
    "History of Fund/Manager",
    "ProFunds is responsible for BIPIX, and the company is based out of Columbus, OH. ProFunds Biotech Ultra Sector Investor debuted in June of 2000. Since then, BIPIX has accumulated assets of about $209.72 million, according to the most recently available information. Michael Neches is the fund's current manager and has held that role since October of 2013.",
    "Performance",
    "Obviously, what investors are looking for in these funds is strong performance relative to their peers. BIPIX has a 5-year annualized total return of 3.25% and it sits in the middle third among its category peers. If you're interested in shorter time frames, do not dismiss looking at the fund's 3-year annualized total return of 1.41%, which places it in the middle third during this time-frame.",
    "When looking at a fund's performance, it is also important to note the standard deviation of the returns. The lower the standard deviation, the less volatility the fund experiences. Over the past three years, BIPIX's standard deviation comes in at 29.52%, compared to the category average of 13.24%. The standard deviation of the fund over the past 5 years is 31.23% compared to the category average of 13.55%. This makes the fund more volatile than its peers over the past half-decade.",
    "Risk Factors",
    "Investors cannot discount the risks to this segment though, as it is always important to remember the downside for any potential investment. In BIPIX's case, the fund lost 28.69% in the most recent bear market and outperformed its peer group by 4%. This might suggest that the fund is a better choice than its peers during a bear market.",
    "Nevertheless, investors should also note that the fund has a 5-year beta of 1.87, which means it is hypothetically more volatile than the market at large. Because alpha represents a portfolio's performance on a risk-adjusted basis relative to a benchmark, which is the S&P 500 in this case, one should pay attention to this metric as well. Over the past 5 years, the fund has a negative alpha of -11.83. This means that managers in this portfolio find it difficult to pick securities that generate better-than-benchmark returns.",
    "Expenses",
    "Costs are increasingly important for mutual fund investing, and particularly as competition heats up in this market. And all things being equal, a lower cost product will outperform its otherwise identical counterpart, so taking a closer look at these metrics is key for investors. In terms of fees, BIPIX is a no load fund. It has an expense ratio of 1.45% compared to the category average of 1.28%. So, BIPIX is actually more expensive than its peers from a cost perspective.",
    "This fund requires a minimum initial investment of $15,000, while there is no minimum for each subsequent investment.",
    "Bottom Line",
    "Overall, ProFunds Biotech Ultra Sector Investor ( BIPIX ) has a low Zacks Mutual Fund rank, and in conjunction with its comparatively similar performance, worse downside risk, and higher fees, ProFunds Biotech Ultra Sector Investor ( BIPIX ) looks like a poor potential choice for investors right now.",
    "Don't stop here for your research on Sector - Health funds. We also have plenty more on our site in order to help you find the best possible fund for your portfolio. Make sure to check out www.zacks.com/funds/mutual-funds for more information about the world of funds, and feel free to compare BIPIX to its peers as well for additional information. Want to learn even more? We have a full suite of tools on stocks that you can use to find the best choices for your portfolio too, no matter what kind of investor you are.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 07:00:06"
}