{
  "url": "https://www.nasdaq.com/article/qaindia-will-use-monetary-not-fiscal-easing-to-revive-growth--ts-lombard-20190903-00865",
  "title": "Q&A-India will use monetary, not fiscal, easing to revive growth - TS Lombard - Nasdaq.com",
  "text": [
    "By Aaron Saldanha",
    "Sept 3 (Reuters) - India's economy will rely on further monetary easing to kick-start sagging growth as budgetary constraints rule out significant fiscal stimulus, Shumita Deveshwar, Director of India Research at TS Lombard, said on Tuesday.",
    "The Reserve Bank of India (RBI) cut the key repo rate  to a more than nine-year low of 5.40% at its last meeting, and markets are pricing in further cuts this year as growth in Asia's third largest economy slows.",
    "Data on Friday showed economic growth slowing to a more than 6-year low of 5% year-on-year in the April-June quarter , heightening speculation of an extra burst of fiscal stimulus from Prime Minister Narendra Modi's newly re-elected administration. ",
    "The following are excerpts from the Reuters Global Markets Forum chat. To join the forum, click here:",
    "Question: Considering the recent growth data, how many more basis points of cuts do you expect this year from the RBI?",
    "Answer: I think we could see up to 50 basis points more. The RBI has been easing very aggressively, and considering the negative surprise of lower-than-expected growth in the first quarter of fiscal year 2020 and dim prospects of a strong recovery anytime soon, the RBI will continue to ease.",
    "Q: What form do you think a possible fiscal stimulus package could take? How much of an impact could it have on the fiscal deficit?",
    "A: Despite slowing growth, the government has done little by way of any additional fiscal stimulus than what was already previously announced. So it seems it has limited room to maneuver as far as fiscal space is concerned amid worries expressed by some in the RBI that the public sector borrowing requirement is already quite large at around 8-9% of the GDP.",
    "Even the large transfer of the RBI's reserves is going to be used for bank recapitalization and for meeting the shortfall in the budgeted tax revenue. ",
    "So there is hardly any direct fiscal stimulus that seems to be forthcoming... It will need a very large fiscal stimulus to come out of the current slowdown, and the government clearly does not seem to have the space to do so, and is, therefore, doing very little fiscally.",
    "Q: So, do you see possible stimulus in or after mid-2020 if the economic growth continues to be tepid?",
    "A: I think the government is heavily leaning on the RBI for jumpstarting the economy, and we have seen the RBI comply in terms of aggressive monetary easing, the large transfer of reserves and easier norms for the banking sector. ",
    "Any fiscal stimulus will be limited because there simply isn't the space for the government to do so, unless it wants to blow its targets completely. That is a risk we cannot fully discount, but for now it seems monetary policy is where the onus is.",
    "Q: Has the large transfer by the RBI to the government altered international investors' view of the central bank?",
    "A: In my view, the big worry as far as the RBI's transfer of its capital reserves is concerned is the precedent that it sets for the future. For one, the transfer is now not on the RBI's discretion, but it is based on a formula. ",
    "This time around, the maximum possible amount was drawn from the RBI as permitted by that formula. The RBI board decided on the lower end of the contingency risk buffer. What then will prevent future governments from demanding the maximum possible transfer from the RBI - that is the question.",
    "This interview was conducted in the Reuters Global Markets Forum, a chatroom hosted on the Refinitiv Eikon Messenger platform."
  ],
  "published_datetime": "2019-09-03 09:36:00"
}