{
  "url": "https://www.nasdaq.com/article/heres-why-you-should-hold-on-to-dexcom-dxcm-stock-now-cm1206624",
  "title": "Here's Why You Should Hold on to DexCom (DXCM) Stock Now - Nasdaq.com",
  "text": [
    "  DexCom, Inc. DXCM  is well poised for growth on the back of lucrative glucose monitoring market, solid international market presence and robust product portfolio. However, contraction in margin remains a woe.  makeArticleAd();  The stock carries a Zacks Rank #3 (Hold).   Price Performance    Shares of DexCom have gained 17.5%, against the industry  's decline of 5.5% in a year's time. Moreover, the S&P 500 Index declined 0.3% in the same timeframe.     What's Deterring the Stock?    Increase in expenses tends to weigh on the company's margins. In the second quarter, DexCom generated gross margin (as a percentage of revenues) of 65.9%, which contracted 360 bps on a year-over-year basis. Margins were under pressure owing to an inventory change, and shift toward OUS and Medicare.    DexCom continues to bear the brunt of intense competition in the blood glucose monitoring devices market as it is subject to rapid change and can be substantially affected by new product introductions. This in turn is likely to mar the company's overall performance.   What's Favoring the Stock?    DexCom continues to gain from the lucrative and growing glucose monitoring market that presents substantial commercial opportunity. Per an article of Research and Markets, the blood glucose monitoring devices market is expected to witness a CAGR of over 9% between 2018 and 2024.    Moreover, the company boasts of a robust product portfolio, which in turn has been bolstering overall performance. Per management, the company is well poised to achieve long-term target on the back of the expansion of the rollout of G6 and improved access to CGM. With this growing demand in mind, the company is on track to meet its goal of doubling G6 capacity by the end of 2019.    Per management, DexCom remains optimistic regarding CGM as a diagnostic tool. Also, the company recently submitted its G6 Pro product, which it expects to launch in 2020.    DexCom continues to benefit from strong international presence and is eyeing the sizeable markets of Korea, India, China and Japan. If we go by statistics then more than half of the diabetic population in developing nations remain undiagnosed. Consequently, the company can boost sales by expanding into overseas territory, where the momentum is anticipated to continue in the future.    Additionally, the company's strategic collaborations and buyouts continue to bolster growth. DexCom has collaborative agreements with several companies, which should not only bring in cash in the form of milestone payments and royalties but should also help expand product use.   Which Way Are Estimates Headed?    For 2019, the Zacks Consensus Estimate for revenues is pegged at $1.36 billion, indicating an improvement of 32.2% from the year-ago period. The same for earnings stands at 94 cents per share, suggesting growth of 213.3% from the year-ago reported figure.   Key Picks    Some better-ranked stocks from the broader medical space are Baxter International Inc. BAX  , Amedisys, Inc. AMED  and CONMED Corporation CNMD  , each carrying a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 (Strong Buy) Rank   stocks here  .  Baxter has a long-term earnings growth rate of 12.8%.    Amedisys has a long-term earnings growth rate of 16.3%.    CONMED has a long-term earnings growth rate 14.9%.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   DexCom, Inc. (DXCM): Free Stock Analysis Report   Baxter International Inc. (BAX): Free Stock Analysis Report   Amedisys, Inc. (AMED): Free Stock Analysis Report   CONMED Corporation (CNMD): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " DexCom, Inc. DXCM  is well poised for growth on the back of lucrative glucose monitoring market, solid international market presence and robust product portfolio. However, contraction in margin remains a woe.  makeArticleAd();  The stock carries a Zacks Rank #3 (Hold).   Price Performance    Shares of DexCom have gained 17.5%, against the industry  's decline of 5.5% in a year's time. Moreover, the S&P 500 Index declined 0.3% in the same timeframe.",
    "    What's Deterring the Stock?    Increase in expenses tends to weigh on the company's margins. In the second quarter, DexCom generated gross margin (as a percentage of revenues) of 65.9%, which contracted 360 bps on a year-over-year basis. Margins were under pressure owing to an inventory change, and shift toward OUS and Medicare.    DexCom continues to bear the brunt of intense competition in the blood glucose monitoring devices market as it is subject to rapid change and can be substantially affected by new product introductions. This in turn is likely to mar the company's overall performance.   What's Favoring the Stock?    DexCom continues to gain from the lucrative and growing glucose monitoring market that presents substantial commercial opportunity. Per an article of Research and Markets, the blood glucose monitoring devices market is expected to witness a CAGR of over 9% between 2018 and 2024.    Moreover, the company boasts of a robust product portfolio, which in turn has been bolstering overall performance. Per management, the company is well poised to achieve long-term target on the back of the expansion of the rollout of G6 and improved access to CGM. With this growing demand in mind, the company is on track to meet its goal of doubling G6 capacity by the end of 2019.    Per management, DexCom remains optimistic regarding CGM as a diagnostic tool. Also, the company recently submitted its G6 Pro product, which it expects to launch in 2020.    DexCom continues to benefit from strong international presence and is eyeing the sizeable markets of Korea, India, China and Japan. If we go by statistics then more than half of the diabetic population in developing nations remain undiagnosed. Consequently, the company can boost sales by expanding into overseas territory, where the momentum is anticipated to continue in the future.    Additionally, the company's strategic collaborations and buyouts continue to bolster growth. DexCom has collaborative agreements with several companies, which should not only bring in cash in the form of milestone payments and royalties but should also help expand product use.   Which Way Are Estimates Headed?    For 2019, the Zacks Consensus Estimate for revenues is pegged at $1.36 billion, indicating an improvement of 32.2% from the year-ago period. The same for earnings stands at 94 cents per share, suggesting growth of 213.3% from the year-ago reported figure.   Key Picks    Some better-ranked stocks from the broader medical space are Baxter International Inc. BAX  , Amedisys, Inc. AMED  and CONMED Corporation CNMD  , each carrying a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 (Strong Buy) Rank   stocks here  . ",
    "Baxter has a long-term earnings growth rate of 12.8%.    Amedisys has a long-term earnings growth rate of 16.3%.    CONMED has a long-term earnings growth rate 14.9%.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:50:00"
}