{
  "url": "https://www.nasdaq.com/article/box-stock-surges-on-starboard-stake-cm1207603",
  "title": "Box Stock Surges on Starboard Stake - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Box stock is on the move Wednesday following news of an investment from Starboard Value.",
    "The news about the stake in Box (NYSE: BOX ) from Starboard comes via a filing with the U.S. Securities and Exchange Commission (SEC). In this filing, the investor reveals that they now have 11 million shares of BOX stock.",
    "That 11 million shares of Box stock gives Starboard Value a nice stake in the company. It now has a roughly 7% stake , which is enough for it to throw its weight around when it comes to decision making.",
    "So why exactly does all of this matter so much to Box stock. Starboard Value isn't just a normal investor. It is a known activist investor that that seeks to make major changes at companies that executives might not be happy about. Even if it isn't good for executives, these changes may turn out good for investors.",
    "\"While we do not comment on interactions with our investors, Box is committed to maintaining an active and engaged dialogue with stockholders,\" Box said in a statement regarding the news. \"The Board of Directors and management team are focused on delivering growth and profitability to drive long-term stockholder value as we continue to pioneer the Cloud Content Management market.\"",
    "Box is a company that offers cloud content management and file sharing services for companies. It was founded by Aaron Levie and Dylan Smith in 2004. Levie is the current CEO of the company and Smith is the CFO.",
    "BOX stock was up 11% as of Wednesday afternoon. However, the stock is down 19% since the start of the year.",
    "As of this writing, William White did not hold a position in any of the aforementioned securities.",
    "The post Box Stock Surges on Starboard Stake appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:20:24"
}