{
  "url": "https://www.nasdaq.com/article/after-hours-most-active-for-sep-3-2019-avp-ko-cmcsa-eca-esgu-foe-t-nem-feye-podd-qqq-aaba-cm1206931",
  "title": "After Hours Most Active for Sep 3, 2019 : AVP, KO, CMCSA, ECA, ESGU, FOE, T, NEM, FEYE, PODD, QQQ, AABA - Nasdaq.com",
  "text": [
    "The NASDAQ 100 After Hours Indicator  is up 1.9 to 7,611.41. The total After hours volume is currently 64,756,828 shares traded.       The following are the  most active stocks for the after hours session  :  makeArticleAd();    Avon Products, Inc. ( AVP  ) is unchanged at $4.19, with 4,347,495 shares traded. AVP's current last sale is 104.75% of the target price of $4.    Coca-Cola Company (The) ( KO  ) is unchanged at $55.30, with 3,066,883 shares traded. KO's current last sale is 98.75% of the target price of $56.    Comcast Corporation ( CMCSA  ) is unchanged at $43.88, with 2,722,634 shares traded. As reported by Zacks, the current mean recommendation for CMCSA is in the \"buy range\".    Encana Corporation ( ECA  ) is unchanged at $4.37, with 2,593,772 shares traded. As reported by Zacks, the current mean recommendation for ECA is in the \"buy range\".    iShares ESG MSCI USA ETF ( ESGU  ) is -0.0193 at $63.92, with 2,260,000 shares traded. This represents a 24.47% increase from its 52 Week Low.    Ferro Corporation ( FOE  ) is unchanged at $10.09, with 2,180,719 shares traded. FOE's current last sale is 56.06% of the target price of $18.    AT&T Inc. ( T  ) is +0.01 at $35.39, with 1,746,013 shares traded. As reported by Zacks, the current mean recommendation for T is in the \"buy range\".    Newmont Goldcorp Corporation ( NEM  ) is unchanged at $40.39, with 1,728,737 shares traded. Over the last four weeks they have had 3 up revisions for the earnings forecast, for the fiscal quarter ending Sep 2019. The consensus EPS forecast is $0.43. As reported by Zacks, the current mean recommendation for NEM is in the \"buy range\".    FireEye, Inc. ( FEYE  ) is unchanged at $13.00, with 1,689,732 shares traded. As reported by Zacks, the current mean recommendation for FEYE is in the \"buy range\".    Insulet Corporation ( PODD  ) is -2.98 at $164.97, with 1,405,155 shares traded. Over the last four weeks they have had 5 up revisions for the earnings forecast, for the fiscal quarter ending Dec 2019. The consensus EPS forecast is $0.13. , following a 52-week high recorded in today's regular session.    Invesco QQQ Trust, Series 1 ( QQQ  ) is unchanged at $185.65, with 1,331,577 shares traded. This represents a 29.41% increase from its 52 Week Low.    Altaba Inc. ( AABA  ) is +0.04 at $69.48, with 1,055,261 shares traded. AABA's current last sale is 89.08% of the target price of $78.",
    "    The following are the  most active stocks for the after hours session  :",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:29:49"
}