{
  "url": "https://www.nasdaq.com/article/adtalems-rusm-partners-with-csudh-boosts-physician-diversity-cm1210494",
  "title": "Adtalem's RUSM Partners With CSUDH, Boosts Physician Diversity - Nasdaq.com",
  "text": [
    "  Adtalem Global Education Inc.'s ATGE  health care institution, Ross University School of Medicine (\"RUSM\"), has partnered with California State University, Dominguez Hills (\"CSUDH\"), to enable Hispanic students attend medical school. Notably, this will also increase the Hispanic-American doctors in the United States. Per the terms of the agreement, the partnership will also provide an educational pathway program for CSUDH's graduates to study medicine at RUSM. Eligible graduates will receive a scholarship for the first semester covering full tuition in the RUSM campus in Barbados.  Adtalem's Endeavors to Address Diversity in   Medicine  RUSM - one of the medical and veterinary schools of Adtalem - has a diverse student population, of which, more than one-fourth of the total students are Hispanic. Of the total U.S. physicians, Hispanic Americans account for only 5%. RUSM remains well positioned to address the paucity of Hispanic and Latinx physicians, and the significant roles they play in the healthcare industry. Notably, due to the changing demographics in the overall healthcare in United States and the underrepresentation of culturally different people in healthcare, RUSM  has partnered with Hispanic Serving Institution and Historically Black Colleges and Universities through novel student engagements, support programs and senior-level commitments. This will help increase the diversity of the nation's physicians. Notably, in the fiscal fourth quarter, revenues at the Medical and Healthcare segment grew 5.2 % year over year. This uptick was driven by a 6.9% and a 3% increase in revenues at Chamberlain and Medical and Veterinary schools, respectively.  Price Performance  makeArticleAd();  In a year's time, shares of Adtalem have declined 8.3% against its industry  's 24.4% growth. However, the above-mentioned initiatives are expected to aid the company's revenues and profitability going forward.      In particular, Adtalem's health care and international institutions have shown significant improvement in recent times. Overall, initiatives for achieving strong multi-year organic growth, cost-saving initiatives and transformation strategy should drive growth.   Zacks Rank & Key Picks    Currently, Adtalem carries a Zacks Rank #3 (Hold). Some better-ranked stocks from the same industry include K12, Inc. LRN  , Lincoln Educational Services Corporation LINC  and Bright Horizons Family Solutions Inc. BFAM  . While K12 and Lincoln sport a Zacks Rank #1 (Strong Buy), Bright Horizons carries a Zacks Rank #2 (Buy). You can  the complete list of today's Zacks #1 Rank stocks here  .    K12, Lincoln and Bright Horizons have an impressive long-term earnings growth rate of 15%,15% and 10.1%, respectively.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   K12 Inc (LRN): Free Stock Analysis Report   Bright Horizons Family Solutions Inc. (BFAM): Free Stock Analysis Report   Lincoln Educational Services Corporation (LINC): Free Stock Analysis Report   Adtalem Global Education Inc. (ATGE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Adtalem Global Education Inc.'s ATGE  health care institution, Ross University School of Medicine (\"RUSM\"), has partnered with California State University, Dominguez Hills (\"CSUDH\"), to enable Hispanic students attend medical school. Notably, this will also increase the Hispanic-American doctors in the United States.",
    "Per the terms of the agreement, the partnership will also provide an educational pathway program for CSUDH's graduates to study medicine at RUSM. Eligible graduates will receive a scholarship for the first semester covering full tuition in the RUSM campus in Barbados.",
    " Adtalem's Endeavors to Address Diversity in   Medicine ",
    "RUSM - one of the medical and veterinary schools of Adtalem - has a diverse student population, of which, more than one-fourth of the total students are Hispanic. Of the total U.S. physicians, Hispanic Americans account for only 5%.",
    "RUSM remains well positioned to address the paucity of Hispanic and Latinx physicians, and the significant roles they play in the healthcare industry. Notably, due to the changing demographics in the overall healthcare in United States and the underrepresentation of culturally different people in healthcare, RUSM  has partnered with Hispanic Serving Institution and Historically Black Colleges and Universities through novel student engagements, support programs and senior-level commitments. This will help increase the diversity of the nation's physicians.",
    "Notably, in the fiscal fourth quarter, revenues at the Medical and Healthcare segment grew 5.2 % year over year. This uptick was driven by a 6.9% and a 3% increase in revenues at Chamberlain and Medical and Veterinary schools, respectively.",
    " Price Performance  makeArticleAd();  In a year's time, shares of Adtalem have declined 8.3% against its industry  's 24.4% growth. However, the above-mentioned initiatives are expected to aid the company's revenues and profitability going forward.",
    "     In particular, Adtalem's health care and international institutions have shown significant improvement in recent times. Overall, initiatives for achieving strong multi-year organic growth, cost-saving initiatives and transformation strategy should drive growth.   Zacks Rank & Key Picks    Currently, Adtalem carries a Zacks Rank #3 (Hold). Some better-ranked stocks from the same industry include K12, Inc. LRN  , Lincoln Educational Services Corporation LINC  and Bright Horizons Family Solutions Inc. BFAM  . While K12 and Lincoln sport a Zacks Rank #1 (Strong Buy), Bright Horizons carries a Zacks Rank #2 (Buy). You can  the complete list of today's Zacks #1 Rank stocks here  .    K12, Lincoln and Bright Horizons have an impressive long-term earnings growth rate of 15%,15% and 10.1%, respectively.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:10:00"
}