{
  "url": "https://www.nasdaq.com/article/japans-july-machinery-orders-slip-as-trade-woes-hit-business-spending-20190911-00914",
  "title": "Japan's July machinery orders slip as trade woes hit business spending - Nasdaq.com",
  "text": [
    "By Daniel Leussink",
    "TOKYO, Sept 12 (Reuters) - Japan's machinery orders slipped in July, albeit at a slower-than-expected pace, as slowing global demand and protracted trade tensions hit corporate investment in the world's third-largest economy.",
    "Cabinet Office data on Thursday showed core orders, a highly volatile data series regarded as an indicator of capital spending in the coming six to nine months, fell 6.6% in July from the previous month.",
    "Policymakers have been counting on resilience in corporate spending to offset the effects of slowing global demand and the bitter trade war between the United States and China, the world's two largest economies.",
    "Japan revised down its second quarter gross domestic product growth on Monday, reflecting a downgrade in capital expenditure figures as the trade war hit corporate demand. ",
    "\"There are some signs of weakness among manufacturers,\" said Yoshiki Shinke, chief economist at Dai-ichi Life Research Institute.",
    "\"It will be hard for manufacturers to increase business spending thanks to weakness in exports and production.\"",
    "Business confidence among Japanese manufacturers has soured to hit the weakest level in 6-1/2 years, the Reuters Tankan poll for September showed on Thursday, underscoring fears about the economic outlook. ",
    "Amid the risks to the outlook, speculation is growing that the Bank of Japan could ease policy at next week's board meeting to prevent a possible spike in the yen and dampen the impact from weaker external demand.",
    "As the fallout from the U.S.-China trade war broadens, central bank policymakers are more open to discussing the possibility of expanding stimulus at their board meeting on Sept 18-19, sources familiar with its thinking said. ",
    "The BOJ also has to factor in signs of domestic weakness such as slower household spending that suggest consumers could tighten their purse strings even before a planned sales tax hike to 10% comes in next month.",
    "Consumer confidence deteriorated in the wake of the previous tax hike to 8% from 5% in April 2014. That, in turn, caused an economic slump.",
    "The decline in July orders partly reflected the base effect of strong demand from transportation equipment makers in the previous month. Those orders had lifted service-sector orders sharply in June.",
    "\"Overall, core orders advanced for a second month on a year-to-year basis so that's not all that bad. It's not a bad sign for the outlook,\" said Akiyoshi Takumori, chief economist at  Sumitomo Mitsui DS Asset Management.",
    "The Cabinet Office maintained its assessment on machinery orders to say they are showing a pick up.",
    "By sector, core orders from manufacturers advanced 5.4% in July from the previous month, rising for the first time since April, while those from the service-sector fell 15.6%, the Cabinet Office data showed.",
    "Compared with a year earlier, core orders, which exclude those of ships and electricity, advanced 0.3% in July and defying expectations for a 4.5% contraction."
  ],
  "published_datetime": "2019-09-11 08:29:00"
}