{
  "url": "https://www.nasdaq.com/article/apple-to-issue-bonds-after-taking-a-break-from-borrowing-cm1207516",
  "title": "Apple to Issue Bonds After Taking a Break From Borrowing - Nasdaq.com",
  "text": [
    " Ever since tax reform was passed in the U.S. in the final   weeks of 2017,   Apple    (NASDAQ: AAPL) hasn't needed to issue new debt. After all, a   crucial piece of the tax legislation imposed a mandatory deemed   repatriation tax on foreign reserves, which freed multinational   corporations to   bring that cash home    because taxes had now been paid. Before then, Apple had preferred to keep the bulk of its cash   hoard abroad, taking on increasing amounts of debt to fund its   massive capital return program that has now seen the company give   back nearly $400 billion to shareholders between share   repurchases and dividends. Since then, Apple has been slowly   paying down its debt, letting bonds mature without issuing new   ones.   Data source: SEC filings. Chart by author. Calendar quarters     shown.makeArticleAd();  For the first time since the passage of tax reform, Apple has   signaled that it will be issuing fresh bonds. Returning to the bond market The Cupertino   tech giant    has filed a preliminary prospectus with the SEC, detailing   five tranches of notes that it plans to offer in the near future.   Certain key details, such as the principal amount that Apple is   raising, have not yet been finalized.   CEO Tim Cook. Image source: Apple.  It's also unclear if the tranches will carry fixed or floating   interest rates. Apple often offers a combination of fixed and   floating rate instruments, and sometimes converts fixed notes to   floaters (and vice versa)   using interest rate swaps    in order to better manage interest rate risk depending on market   conditions. The notes will mature in 2022, 2024, 2026, 2029, and   2049. In terms of how the company will deploy the proceeds, the Mac   maker says it plans to use the money for \"general corporate   purposes, including repurchases of our common stock and payment o   f   dividends    under our program to return capital to shareholders, funding for   working capital, capital expenditures, acquisitions and repayment   of debt.\" Apple boosted its share repurchase authorization by $75   billion in April, which is the usual time each year the company   provides annual updates to its capital return program. Rates coming down The news comes a little over a month after the Federal Reserve   cut interest rates for the first time since the Great   Recession, which monetary policymakers said at the time was done   in part to help mitigate risks associated with President Trump's   trade war with China. Borrowing costs are already at historical   lows but are coming down further and Apple wants to take   advantage of low interest rates. Over the past year and a half, Apple has been pursuing a \"   net cash neutral    \" goal that will bring its cash position roughly in line with   total debt. \"We retired $3 billion of term debt and reduced   commercial paper by $2 billion during the quarter, leaving us   with total debt of $108 billion,\" CFO Luca Maestri said on the   last       earnings call    . \"As a result, net cash was $102 billion at the end of the   quarter, and we continue on our path to reaching a net cash   neutral position over time.\"   10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Evan Niu, CFA      owns shares of Apple. The Motley Fool owns shares of and     recommends Apple. The Motley Fool has the following options:     short January 2020 $155 calls on Apple and long January 2020     $150 calls on Apple. The Motley Fool has a     disclosure policy      .  ",
    "Ever since tax reform was passed in the U.S. in the final   weeks of 2017,   Apple    (NASDAQ: AAPL) hasn't needed to issue new debt. After all, a   crucial piece of the tax legislation imposed a mandatory deemed   repatriation tax on foreign reserves, which freed multinational   corporations to   bring that cash home    because taxes had now been paid.",
    "Before then, Apple had preferred to keep the bulk of its cash   hoard abroad, taking on increasing amounts of debt to fund its   massive capital return program that has now seen the company give   back nearly $400 billion to shareholders between share   repurchases and dividends. Since then, Apple has been slowly   paying down its debt, letting bonds mature without issuing new   ones.",
    "  Data source: SEC filings. Chart by author. Calendar quarters     shown.makeArticleAd(); ",
    "Data source: SEC filings. Chart by author. Calendar quarters     shown.",
    "For the first time since the passage of tax reform, Apple has   signaled that it will be issuing fresh bonds.",
    "The Cupertino   tech giant    has filed a preliminary prospectus with the SEC, detailing   five tranches of notes that it plans to offer in the near future.   Certain key details, such as the principal amount that Apple is   raising, have not yet been finalized.",
    "  CEO Tim Cook. Image source: Apple. ",
    "CEO Tim Cook. Image source: Apple.",
    "It's also unclear if the tranches will carry fixed or floating   interest rates. Apple often offers a combination of fixed and   floating rate instruments, and sometimes converts fixed notes to   floaters (and vice versa)   using interest rate swaps    in order to better manage interest rate risk depending on market   conditions. The notes will mature in 2022, 2024, 2026, 2029, and   2049.",
    "In terms of how the company will deploy the proceeds, the Mac   maker says it plans to use the money for \"general corporate   purposes, including repurchases of our common stock and payment o   f   dividends    under our program to return capital to shareholders, funding for   working capital, capital expenditures, acquisitions and repayment   of debt.\"",
    "Apple boosted its share repurchase authorization by $75   billion in April, which is the usual time each year the company   provides annual updates to its capital return program.",
    "The news comes a little over a month after the Federal Reserve   cut interest rates for the first time since the Great   Recession, which monetary policymakers said at the time was done   in part to help mitigate risks associated with President Trump's   trade war with China. Borrowing costs are already at historical   lows but are coming down further and Apple wants to take   advantage of low interest rates.",
    "Over the past year and a half, Apple has been pursuing a \"   net cash neutral    \" goal that will bring its cash position roughly in line with   total debt. \"We retired $3 billion of term debt and reduced   commercial paper by $2 billion during the quarter, leaving us   with total debt of $108 billion,\" CFO Luca Maestri said on the   last       earnings call    . \"As a result, net cash was $102 billion at the end of the   quarter, and we continue on our path to reaching a net cash   neutral position over time.\"",
    "  10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Evan Niu, CFA      owns shares of Apple. The Motley Fool owns shares of and     recommends Apple. The Motley Fool has the following options:     short January 2020 $155 calls on Apple and long January 2020     $150 calls on Apple. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 03:14:00"
}