{
  "url": "https://www.nasdaq.com/article/cheesecake-factorys-expansion-efforts-bode-well-costs-high-cm1207289",
  "title": "Cheesecake Factory's Expansion Efforts Bode Well, Costs High - Nasdaq.com",
  "text": [
    " The past six months have been an encouraging one for the Retail-Restaurants  industry. However, Cheesecake Factory CAKE  , which belongs to the same industry has been struggling of late. The stock has lost 17.1% against the industry  's 19.8% rally.    makeArticleAd();  Currently, the company is banking on sales building efforts, men innovation, digitalization and expansion strategy to revive its performance. Let's delve deeper into the factors that substantiate its Zacks Rank #3 (Hold).   Key Catalysts    Cheesecake Factory is making efforts to expand in domestic and international markets. As of Jul 31, 2019, the company operated 219 full-service company-owned restaurants domestically. Of which, 202 outlets were under The Cheesecake Factory brand, 14 under the Grand Lux café brand and two under the RockSugar Southeast Asian Kitchen. Internationally, the company operates 22 The Cheesecake Factory restaurants under licensing agreements.      Moreover, the company is foraying into lucrative markets like the Middle East, North Africa, Central and Eastern Europe, Russia, Turkey, Mexico, Kuwait and Lebanon and Chile. In 2019, the company plans to open five company-owned restaurants including one in Oxnard, CA. Overall, management believes that there is potential for 300 Cheesecake Factory locations this year, expecting to drive at least 3%-unit growth.    Brand revitalization efforts apart, Cheesecake Factory is focused on menu innovation, operational improvement and enhancement of customer service platform. On the menu innovation front, the Super Foods program has increased consumer awareness of brands. In the Southeast, the company introduced brown bread in grocery stores with nationwide distribution capabilities.    Meanwhile, Cheesecake Factory's consumer packaged goods business continues to drive growth owing to the new branded refrigerated puddings in partnership with Lakeview Farms. Going forward, the company intends to carry on with menu innovation by adding new Super Food items as well as the famous indulgences of The Cheesecake Factory in its portfolio.    Furthermore, the digital wave has hit the U.S. fast-casual restaurant space as more and more restaurants are deploying technology to enhance the guest experience. In line with this, Cheesecake Factory's technology-enabled initiatives are doing well with feedback on its mobile payment app, CakePay. The company also signed an exclusive national delivery partnership with DoorDash and expects to reap benefits from these collaborative marketing opportunities.    Moving ahead, Cheesecake Factory is set to grow its off-premise, online-ordering business via carry-out, delivery and catering. Resultantly, in the second quarter of 2019, off-premise business reached 16% of total sales.   Major Concerns    High costs remain a concern for the company. Pre-opening costs of outlets, given the company's unit expansion plans, expenses related to sales initiatives and higher labor expenses, are adding to the costs and likely to hurt profits. In 2018, labor expense ratio was 35.8%, up 140 bps from the previous year that was primarily driven by higher hourly labor including more wages, overtime and training costs. During second-quarter fiscal 2019, the labor expense ratio was 36.2%, up 20 bps from the year-ago quarter.    Cheesecake Factory projects food inflation and Wage inflation to be around 2% and 6%, respectively, this year.   Key Picks    A few better-ranked stocks worth considering in the same space include Dave & Buster's Entertainment, Inc. PLAY  , Restaurant Brands International Inc. QSR  and The Wendy's Company WEN  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here.     Dave & Buster Entertainment, Restaurant Brands and the Wendy's have an impressive long-term earnings growth of 15%, 10% and 14.3%, respectively.   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   The Cheesecake Factory Incorporated (CAKE): Free Stock Analysis Report   Restaurant Brands International Inc. (QSR): Free Stock Analysis Report   Dave & Buster's Entertainment, Inc. (PLAY): Free Stock Analysis Report   The Wendy's Company (WEN): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "The past six months have been an encouraging one for the Retail-Restaurants  industry. However, Cheesecake Factory CAKE  , which belongs to the same industry has been struggling of late. The stock has lost 17.1% against the industry  's 19.8% rally.",
    "   makeArticleAd();  Currently, the company is banking on sales building efforts, men innovation, digitalization and expansion strategy to revive its performance. Let's delve deeper into the factors that substantiate its Zacks Rank #3 (Hold).   Key Catalysts    Cheesecake Factory is making efforts to expand in domestic and international markets. As of Jul 31, 2019, the company operated 219 full-service company-owned restaurants domestically. Of which, 202 outlets were under The Cheesecake Factory brand, 14 under the Grand Lux café brand and two under the RockSugar Southeast Asian Kitchen. Internationally, the company operates 22 The Cheesecake Factory restaurants under licensing agreements.      Moreover, the company is foraying into lucrative markets like the Middle East, North Africa, Central and Eastern Europe, Russia, Turkey, Mexico, Kuwait and Lebanon and Chile. In 2019, the company plans to open five company-owned restaurants including one in Oxnard, CA. Overall, management believes that there is potential for 300 Cheesecake Factory locations this year, expecting to drive at least 3%-unit growth.    Brand revitalization efforts apart, Cheesecake Factory is focused on menu innovation, operational improvement and enhancement of customer service platform. On the menu innovation front, the Super Foods program has increased consumer awareness of brands. In the Southeast, the company introduced brown bread in grocery stores with nationwide distribution capabilities.    Meanwhile, Cheesecake Factory's consumer packaged goods business continues to drive growth owing to the new branded refrigerated puddings in partnership with Lakeview Farms. Going forward, the company intends to carry on with menu innovation by adding new Super Food items as well as the famous indulgences of The Cheesecake Factory in its portfolio.    Furthermore, the digital wave has hit the U.S. fast-casual restaurant space as more and more restaurants are deploying technology to enhance the guest experience. In line with this, Cheesecake Factory's technology-enabled initiatives are doing well with feedback on its mobile payment app, CakePay. The company also signed an exclusive national delivery partnership with DoorDash and expects to reap benefits from these collaborative marketing opportunities.    Moving ahead, Cheesecake Factory is set to grow its off-premise, online-ordering business via carry-out, delivery and catering. Resultantly, in the second quarter of 2019, off-premise business reached 16% of total sales.   Major Concerns    High costs remain a concern for the company. Pre-opening costs of outlets, given the company's unit expansion plans, expenses related to sales initiatives and higher labor expenses, are adding to the costs and likely to hurt profits.",
    "In 2018, labor expense ratio was 35.8%, up 140 bps from the previous year that was primarily driven by higher hourly labor including more wages, overtime and training costs. During second-quarter fiscal 2019, the labor expense ratio was 36.2%, up 20 bps from the year-ago quarter.    Cheesecake Factory projects food inflation and Wage inflation to be around 2% and 6%, respectively, this year.   Key Picks    A few better-ranked stocks worth considering in the same space include Dave & Buster's Entertainment, Inc. PLAY  , Restaurant Brands International Inc. QSR  and The Wendy's Company WEN  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here.     Dave & Buster Entertainment, Restaurant Brands and the Wendy's have an impressive long-term earnings growth of 15%, 10% and 14.3%, respectively.   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:18:00"
}