{
  "url": "https://www.nasdaq.com/article/africafxkenyas-currency-seen-easing-zambia-uganda-stable-20190905-00740",
  "title": "AFRICA-FX-Kenya's currency seen easing, Zambia, Uganda stable - Nasdaq.com",
  "text": [
    "LUSAKA, Sept 5 (Reuters) - Kenya's shilling is expected to soften against the dollar in the coming week, while the currencies of Zambia, Uganda and Nigeria hold steady.",
    "KENYA",
    "Commercial banks quoted the shilling at 103.80/104.00 per dollar on Thursday, compared with 103.45/65 at last Thursday's close.",
    "\"There is still dollar demand and there is a lot of liquidity on the money market side... They've been mopping up excess liquidity,\" said a senior trader at a commercial bank, referring to central bank money market operations.",
    "ZAMBIA",
    "The kwacha  is expected to continue trading sideways against the dollar, driven by matching demand and supply of hard currency.",
    "On Thursday, commercial banks quoted the currency of Africa's second-largest copper producer at 13.1100 per dollar from a close of 13.0600 a week ago.",
    "\"Our view is that we continue to trade within the current range,\" the local branch of South Africa'sFirst National Bank (FNB) said in a note.",
    "UGANDA",
    "The Ugandan shilling  is forecast to be steady amid sagging appetite for hard currency from goods' importers.",
    "On Thursday, commercial banks in the capital Kampala quoted the shilling at 3,675/3,685, compared to last Thursday's close of 3,685/3,695.",
    "\"Importer demand has been subdued for quite a while largely because of the slow pace of sales on their side and I don't think this will change soon,\" said a Kampala-based independent foreign exchange trader.",
    "He said in the coming days the shilling was likely to trade around 3,675 with a slight bias on the stronger side.",
    "NIGERIA",
    "Nigeria's naira  is seen stable next week after the currency firmed this week amidst ample dollar liquidity from foreign investors as the central bank increases its offer of open market securities, traders said.",
    "The naira was quoted at 362 per dollar on Thursday from 363 a week earlier. The currency was quoted at 360 on exchange bureaus and at 306.90 on the official market, backed by the central bank. Nigeria operates a multiple currency regime.",
    "Foreign inflows, which dried up last month due to low yields, has started to come back after the central bank stepped up sales of open market bills. The bank launched a 400 billion naira ($1.1 billion) open market (OMO) auction on Thursday to target investors.",
    "($1 = 305.9500 naira)"
  ],
  "published_datetime": "2019-09-05 10:42:00"
}