{
  "url": "https://www.nasdaq.com/article/stocks-rise-as-overseas-risks-abate-cm1207434",
  "title": "Stocks Rise as Overseas Risks Abate - Nasdaq.com",
  "text": [
    " Market Movers ",
    " Mike's Commentary ",
    " Click the image for larger view ",
    " Click the image for larger view ",
    "         Nasdaq's Market Intelligence Desk (MID)        Team includes: ",
    "  Charles Brown       is Associate Vice President on The Market Intelligence Desk     with over 20 years of equity capital markets experience.     Charlie has extensive knowledge of equity trading on both floor     and screen based marketplaces. Charlie assists with the     management of The Market Intelligence Desk and works with     Nasdaq listed companies providing them with insightful     objective trading analysis.",
    "  Steven Brown       is a Managing Director on the Market Intelligence Desk (MID) at     Nasdaq with over twenty years of experience in equities. With a     focus on client retention he currently covers the Financial,     Energy and Media sectors.",
    "  Christopher Dearborn       is a Managing Director on the Market Intelligence Desk (MID) at     Nasdaq. Chris has over two decades of equity market experience     including floor and screen based trading, corporate access,     IPOs and asset allocation. Chris is responsible for providing     timely, accurate and objective market and trading-related     information to Nasdaq-listed companies.",
    "  Brian Joyce, CMT       is a Managing Director on the Market Intelligence Desk     (MID) at Nasdaq. Before joining Nasdaq Brian spent 16 years as     an institutional trader executing equity and options orders for     both the buy side and sell side. He also provided trading ideas     and wrote technical analysis commentary for an institutional     research offering. Brian focuses on helping Nasdaq's Financial,     Healthcare and Transportation companies, among others,     understand the trading in their stock. Brian is a Chartered     Market Technician (CMT).",
    "  Michael Sokoll, CFA       is Associate Vice President on the Market Intelligence     Desk (MID) at Nasdaq with over 25 years of equity market     experience. In this role, he manages a team of professionals     responsible for providing NASDAQ-listed companies with     real-time trading analysis and objective market     information.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 12:40:00"
}