{
  "url": "https://www.nasdaq.com/article/baidu-inc-bidu-stock-sinks-as-market-gains-what-you-should-know-cm1207600",
  "title": "Baidu Inc. (BIDU) Stock Sinks As Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " In the latest trading session, Baidu Inc. (BIDU) closed at $102.54, marking a -0.02% move from the previous day. This change lagged the S&P 500's daily gain of 1.08%. Elsewhere, the Dow gained 0.91%, while the tech-heavy Nasdaq added 1.31%. Prior to today's trading, shares of the web search company had gained 2.89% over the past month. This has outpaced the Computer and Technology sector's loss of 1.68% and the S&P 500's loss of 0.68% in that time. Investors will be hoping for strength from BIDU as it approaches its nex t earnings  release. The company is expected to report EPS of $1.76, down 36.46% from the prior-year quarter. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $4.02 billion, down 2.08% from the year-ago period. BIDU's full-year Zacks Consensus Estimates are calling for earnings of $5 per share and revenue of $15.67 billion. These results would represent year-over-year changes of -48.13% and +2.25%, respectively. Investors should also note any recent changes to analyst estimates for BIDU. These revisions typically reflect the latest short-term business trends, which can change frequently. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Our research shows that these estimate changes are directly correlated with near-term stock prices. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 16.7% higher. BIDU is currently sporting a Zacks Rank of #3 (Hold). Looking at its valuation, BIDU is holding a Forward P/E ratio of 20.5. This represents a discount compared to its industry's average Forward P/E of 26.51. Meanwhile, BIDU's PEG ratio is currently 7.41. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Internet - Services was holding an average PEG ratio of 2.56 at yesterday's closing price. The Internet - Services industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 172, putting it in the bottom 33% of all 250+ industries. The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Baidu, Inc. (BIDU): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "In the latest trading session, Baidu Inc. (BIDU) closed at $102.54, marking a -0.02% move from the previous day. This change lagged the S&P 500's daily gain of 1.08%. Elsewhere, the Dow gained 0.91%, while the tech-heavy Nasdaq added 1.31%.",
    "Prior to today's trading, shares of the web search company had gained 2.89% over the past month. This has outpaced the Computer and Technology sector's loss of 1.68% and the S&P 500's loss of 0.68% in that time.",
    "Investors will be hoping for strength from BIDU as it approaches its nex t earnings  release. The company is expected to report EPS of $1.76, down 36.46% from the prior-year quarter. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $4.02 billion, down 2.08% from the year-ago period.",
    "BIDU's full-year Zacks Consensus Estimates are calling for earnings of $5 per share and revenue of $15.67 billion. These results would represent year-over-year changes of -48.13% and +2.25%, respectively.",
    "Investors should also note any recent changes to analyst estimates for BIDU. These revisions typically reflect the latest short-term business trends, which can change frequently. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Our research shows that these estimate changes are directly correlated with near-term stock prices. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 16.7% higher. BIDU is currently sporting a Zacks Rank of #3 (Hold).",
    "Looking at its valuation, BIDU is holding a Forward P/E ratio of 20.5. This represents a discount compared to its industry's average Forward P/E of 26.51.",
    "Meanwhile, BIDU's PEG ratio is currently 7.41. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Internet - Services was holding an average PEG ratio of 2.56 at yesterday's closing price.",
    "The Internet - Services industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 172, putting it in the bottom 33% of all 250+ industries.",
    "The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:50:21"
}