{
  "url": "https://www.nasdaq.com/article/3-under-the-radar-stocks-ready-to-bounce-cm1206954",
  "title": "3 Under-the-Radar Stocks Ready to Bounce - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Just because headlines are terrorizing Wall Street of late, it doesn't mean that investors should be crippled by them. Even amidst this geopolitical whirlwind of uncertainties, there are stocks to buy now. Today we focus on three mega-caps that are proven winners but deserve more attention from investors now. These are Alphabet (NASDAQ: GOOGL , NASDAQ: GOOGL ), Apple (NASDAQ: AAPL ) and Caterpillar (NYSE: CAT ).",
    "Since the short-term price action in the S&P 500 is still in flux and since there is the possibility of another dip near term, we will consider both sides of the argument for GOOGL, AAPL and CAT stock. But for now, my thesis is still bullish so I expect a resumption to new highs once the headlines abate.",
    "This is not the same as saying that I expect the politicians to resolve the conflicts. We can make new highs even while the economic push-pull is ongoing.",
    "This is a short week on Wall Street due to Labor day, but it won't be short of excitement. In addition to the Hong Kong standoff and the new tariffs hitting this weekend, investors have to contend with headlines from the release of many important reports. Mid-week the Federal Reserve will release its Beige Book. These are their reports from the economic front lines in each region. Then on Friday, the government will release its official non-farm payroll for the month.",
    "These are important events because they are line items that the Fed uses to determine their next move on rates. So in effect, the direction in the stock market will depend heavily on this week's progression of headlines.",
    "Simply stated, GOOGL stock is trading in a tight range, so a move is coming. The idea is to chase the breaches of either sides of the lines.",
    "For the long term, Alphabet stock's fundamentals are solid. Short of a big, sustainable equity market crash, or severe negative change in its operations, GOOGL stock is headed higher for years to come. Meanwhile, there are short-term technical signals to watch.",
    "GOOGL stock spiked 10% on earnings but faded back down into the $1,160 per share neckline. Since then, it has consolidated well inside a $60 range, and therein lies the opportunity.",
    "Usually when a stock ping-pongs inside a tight box, it resolves itself with a big move once it breaks out of it. In this case, the GOOGL stock traders have not yet committed to the direction of said move. So the best trade setup is to wait for the actual breach of either side of the range and chase it in that direction.",
    "So this is a tactical trade on GOOGL stock. If the bulls break above $1,211 per share, then they can rally $30 then another $40 from there. Keep in mind that this is the entire span of the GOOGL stock 7% dip on April earnings.",
    "I prefer betting on upside then shorting, But the opposite is also true. So conversely, if the bears are able to push GOOGL stock below $1,150 per share, they could target $1,080 per share. Incidentally, there is a gap there from early July. Also there is likely to be some support around $1119.",
    "Although these are tactical trade setups, those interested in owning Alphabet stock for the longer-term can use the upside scenario for timing. Or, I wait for the dip to happen then add the bullish fundamental position in it.",
    "AAPL stock is also technically trading in a tight range so here too we should anticipate a move soon. While I am optimistic that it is still in great shape to break through the recent highs, there is also risk below.",
    "Last week, AAPL announced an event on Sept. 10. The stock often fades after the fact, so onus is on the bulls to prove that this time it's different. Otherwise, AAPL stock is vulnerable to a 7% correction with some supports at $201 and $198. But if $192.50 fails then Apple could fall another $11 from there.",
    "While the Apple fundamentals are not as strong as they used to be, the company still has many more years of prosperity. Currently there is a blemish on that from it being in the direct line of fire in this economic war between the US and China. But eventually it trades on its own merits.",
    "The Apple stock price-to-earnings ratio sells at a discount to its peers. Furthermore, management is finally making tangible headway in diversifying their income statement from the iPhone. \"Apple services\" is the buzzword for the next decade, so AAPL is still a stock to buy for the long term.",
    "Just like GOOGL, the short-term AAPL stock trade is binary and stuck inside a range. The bullish setup is to buy Apple stock when it breaks through $212 - or better yet, $214.50 per share. Those should be triggers to invite more momentum buyers. There are resistance zones above but with a little bit of headline luck the buyers could pierce through them.",
    "It is also important that if the bulls sustain the buying through $210. Otherwise it would trigger some technical selling that could develop into a nasty multi-leg correction to test the March and May lows.",
    "Coming into the Labor Day weekend, CAT stock had a great three day bounce off $112 per share. But it is best to wait for confirmation that it can continue its uptrend especially into a binary week like this. So the better setup is to chase CAT stock above $120 or better yet $122 per share for a $10 rally potential.",
    "Caterpillar stock is way too cheap, but that alone is not reason enough to chase it. For many reasons, the bulls have failed to sustain rallies causing many fake-out losses. It is enticing because it sells at only an 11 price-to-earnings ratio and it yields 3.5% in dividends. So those who own the CAT stock are indeed suffering from the price action. But they are at least getting some reward from a yield that is twice that of 10-year bonds.",
    "The threats to CAT stock stem first from the overall fears that we are headed into a global recession and second from the threat to Caterpillar from the economic war rhetoric. In the past year we've seen this affect the stock price negatively several times.",
    "The company is still executing well on plans, but the stock is still acting like death. Even though fundamentally the company looks good, short-term it is best to watch for technical pitfalls.",
    "First is that the $120 zone is resistance. This is a long-term pivot area and the bulls recently lost it. So onus is on them to prove that they can recover it. It won't be easy since the CAT stock bears are likely emboldened by the price action.",
    "The pattern that developed since the October correction of 2018 resembles a big bearish head and shoulders. If that's the case, then CAT stock has about $20 more to fall. But the bears will have to work for it. Because they would have to slice through a thick layer of support.",
    "The bulls have the bounce levels from the December 2018 and August of this year correction bottoms in Caterpillar stock. This is also the 50% retracement from the 2-year long and 200% rally of 2016. Those who believe in Fibonacci will tell you that the 50% retracement is reliable support.",
    "More to that, this is also a monthly pivot zone that dates back to 2011. Clearly the bulls and bears like to fight it out there so this creates congestion.",
    "Those who are long CAT stock here should know that there is a real threat that if $110 fails. It could lose $25 per share from there. Incidentally, this measured target is also the five year point-of-control. But conversely, any resolution on the tariff front could launch a roaring rally to $133 per share.",
    "So of the three stocks today, this is the one that needs a miracle headline the most to get it out of its current funk. So depending on the investor's time frames, traders should use stops. If the goal is to trade CAT stock, then you shouldn't turn it into an investment. Losing $116.34 could fill the gap and overshoot to Aug. 28 lows. Below $112 per share, there's plenty of room the fall.",
    "Even though the fundamentals for GOOGL, AAPL and CAT stocks suggest that these are stocks to buy, the short-term price action is tactical due to extraneous reasons.",
    "But in the end, I expect that the fear of trade wars and recessions to abate.  So I am inclined to trade the upside scenarios either by chasing the breakouts, or buying the measured targets from the short term dips this week. Tactically, there is something for both bulls and bears to trade in all three stocks here.",
    "Nicolas Chahine is the managing director of  SellSpreads.com . As of this writing, he did not hold a position in any of the aforementioned securities. Join his live chat room for free  here .",
    "The post 3 Under-the-Radar Stocks Ready to Bounce appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:09:12"
}