{
  "url": "https://www.nasdaq.com/article/why-stitch-fix-stock-lost-27-in-august-cm1207923",
  "title": "Why Stitch Fix Stock Lost 27% in August - Nasdaq.com",
  "text": [
    "Stitch Fix (NASDAQ: SFIX) trailed the market by a wide margin last month, dropping 27% compared to a 2% decline in the S&P 500 , according to S&P Global Market Intelligence . The slump pushed year-to-date returns back to single digits, whereas the stock had nearly doubled at one point earlier in the year.",
    "Image source: Getty Images.",
    "The tech stock has been unusually volatile since its fiscal third-quarter earnings release in mid-July. Tha t report showed strong growth in key metrics like revenue and active users, in addition to healthy gross profitability. On the other hand, Stitch Fix swung to a loss in the period as it spent heavily on marketing and preparation for its international rollout. Shares were further pressured in August by worries about competition from Amazon 's personal styling service.",
    "There's no indication yet that Stitch Fix is losing ground to Amazon or other rivals attracted to its apparel niche. On the contrary, metrics that reflect customer satisfaction have been rising for several consecutive quarters.",
    "Investors should get more clarity about the company's growth prospects when it announces fourth-quarter results in early October. But concerns over competitive threats are likely to persist as long as Stitch Fix keeps expanding at a market-thumping rate that's convincing more apparel companies to target the personal styling segment.",
    "Find out why Stitch Fixis one of the 10 best stocks to buy now",
    "Motley Fool co-founders Tom and David Gardner have spent more than a decade beating the market. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "Tom and David just revealed their ten top stock picks for investors to buy right now. Stitch Fix is on the list -- but there are nine others you may be overlooking.",
    "Click here to get access to the full list!",
    "*Stock Advisor returns as of June 1, 2019",
    "John Mackey, CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Demitrios Kalogeropoulos owns shares of Amazon. The Motley Fool owns shares of and recommends Amazon and Stitch Fix. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:15:00"
}