{
  "url": "https://www.nasdaq.com/article/daily-dividend-report-zbh-tss-thg-kw-clf-cm1206856",
  "title": "Daily Dividend Report: ZBH, TSS, THG, KW, CLF - Nasdaq.com",
  "text": [
    "Zimmer Biomet Holdings ( ZBH  ) has approved the payment of a quarterly cash dividend to stockholders for the third quarter of 2019. The cash dividend of $0.24 per share is payable on October 31, 2019 to stockholders of record as of the close of business on September 30, 2019.      TSYS ( TSS  ) announced that its board of directors has approved a quarterly cash dividend of $0.13 per share on TSYS common stock, payable September 27, 2019, to TSYS shareholders of record as of the close of business on September 13, 2019.  makeArticleAd();    The Hanover Insurance Group ( THG  ) has declared a quarterly dividend of $0.60 per share on the issued and outstanding common stock of the company, payable September 27, 2019, to shareholders of record at the close of business on September 13, 2019.      Kennedy Wilson ( KW  ) announced that the company will pay a dividend of $0.21 per share to common shareholders of record as of September 30, 2019 with a payment date of October 3, 2019. This quarterly dividend equates to an annual dividend of $0.84 per common share.      Cleveland-Cliffs ( CLF  ) declared a regular quarterly cash dividend on the Company's common shares of $0.06 per share. In addition to the regular dividend, the Board of Directors also declared a special cash dividend of $0.04 per share, for a total dividend distribution of $0.10 per share. Both the regular and special cash dividend will be payable on October 15, 2019, to shareholders of record as of the close of business on October 4, 2019.        VIDEO: Daily Dividend Report: ZBH, TSS, THG, KW,     CLF   ",
    "   VIDEO: Daily Dividend Report: ZBH, TSS, THG, KW,     CLF  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:17:49"
}