{
  "url": "https://www.nasdaq.com/article/more-instant-income-with-cisco-systems-cm1207427",
  "title": "More Instant Income With Cisco Systems - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "The trade war with China is still pushing technology stocks down, and that gives us another chance to sell a covered call on Cisco Systems  (NASDAQ: CSCO ).",
    "We've been managing a long stock position in CSCO since August, and we've already successfully sold one covered call on the stock. CSCO has lost a little more value since mid-August, and we have another opportunity to collect income on the stock.",
    "The U.S. stock market pulled back yesterday after the Institute of Supply Management's (ISM) Manufacturing Purchasing Managers' Index (PMI) came in at 49.1 - showing the manufacturing sector in the United States is contracting.",
    "You see, the ISM Manufacturing PMI indicator is a diffusion index, which means it is based on a scale of 0 to 100, with 50 being the balanced midpoint. Any number above 50 on the scale indicates expansion in manufacturing activity. The farther above 50 the index goes, the stronger the expansion.",
    "Conversely, any number below 50 indicates contraction in manufacturing activity. The farther below 50 the index goes, the stronger the contraction. This is the first time since 2016 that the ISM Manufacturing PMI has dropped below 50.",
    "Most analysts are blaming this contraction in manufacturing on President Trump's trade war with China, and traders seem to agree. Traders are responding by reducing their exposure to tech stocks because many technology companies generate a lot of revenue in China.",
    "CSCO is starting to drop as investors look to other sectors, and its technical picture makes a strong case for a new covered call trade.",
    "As traders have been reducing their exposure to CSCO, the stock has dropped back down to support just above $46. CSCO has confirmed, once again, that $49 is going to be a strong resistance level, making it a good strike price for a covered call. This price level served as resistance during the last four months of 2018, and it held as resistance again on Aug. 22.",
    "The stock tried to recover and bounce higher after the company's disappointing earnings announcement on Aug. 14, but it didn't have enough bullish momentum to stay above $49. We expect this resistance level to hold in the near term.",
    "If it holds, we could roll out this round of covered calls for even more income in the future.",
    "To find out which CSCO covered calls we're selling-and to get access to our full portfolio of income-generating trades- sign up for a risk-free trial of Strategic Trader today .",
    "InvestorPlace advisers John Jagerson and S. Wade Hansen, both Chartered Market Technician (CMT) designees, are co-founders of LearningMarkets.com, as well as the co-editors of  Strategic Trader .",
    "The post More Instant Income With Cisco Systems appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:58:54"
}