{
  "url": "https://www.nasdaq.com/article/masimo-masi-introduces-pathway-boosts-patient-monitoring-cm1207966",
  "title": "Masimo (MASI) Introduces Pathway, Boosts Patient Monitoring - Nasdaq.com",
  "text": [
    "  Masimo Corporation MASI  recently announced Pathway, which is a feature for the Root Patient Monitoring and Connectivity Platform. Pathway is likely to aid clinicians in simplifying decision making associated with newborn resuscitation. With this new feature, Masimo will not only add to its SET Pulse Oximeter Technology but also bolster patient monitoring, which in turn will drive growth.  makeArticleAd();  Notably, Masimo's Root Patient Monitoring and Connectivity Platform helps in making patient care workflows simpler through an easy-to-internet display and multiple network/connectivity options putting together multiple streams of data.   Few Words About Pathway    This new feature offers clinicians a way to visualize a hospital's recommended resuscitation protocol for a newborn's oxygen saturation (SpO2) while monitoring the same and the pulse rate during the first 10 minutes after birth. Pathway has been introduced to simplify clinician workflow and enhance protocol adherence during this crucial period.   Masimo's Root Platform at a Glance    Notably, Masimo's Root platform is a very powerful, expandable patient monitoring and connectivity hub that brings together a range of technologies, devices, and systems to offer multimodal monitoring and connectivity solutions in a single, clinician-centric platform.    Pathway's visualization on Root platform works in tandem with continuous SpO2 monitoring powered by Masimo SET Measure-through Motion and Low Perfusion technology, which has exhibited its efficiency in over 100 independent and objective studies outperforming other pulse oximetry technologies.   Masimo: A Leading Player in Pulse Oximetry    Masimo is a global pioneer in the field of highly-advanced non-invasive monitoring technologies. The company's flagship Signal Extraction Technology (SET) pulse oximetry or SET pulse oximeter solution successfully eliminates the limitations of conventional mediums. Masimo's rainbow SET technology has been gaining traction driven by rapid product development.    When it comes to newborn health, SET has been proven to help clinicians lower severe retinopathy of prematurity in neonates and in multiple studies.   Consequently, this new feature is likely to be an important addition to the SET Pulse Oximeter Technology.   Patient Monitoring in Focus    Masimo is touted to be the most innovative company in the patient monitoring space. According to report by Research and Markets  , the  global market  for patient monitoring devices will witness a CAGR of 8.2% to nearly $30.7 billion by 2022. Growing economy, rise in the prevalence of chronic diseases and increasing adoption of cost-effective remote patient monitoring devices will drive growth in this market.    The company remains committed toward enhancing patient monitoring and its efforts reflect the same. In non-invasive patient monitoring, the company's Patient SafetyNet, Rainbow acoustic monitoring, SedLine brain function monitoring, Capnography and gas monitoring deserve mention.   Additionally, Masimo's program to improve opioid safety via innovative monitoring technology for both post-surgical wards and home use deserves mention in this regard.   Zacks Rank and Price Performance    Currently Masimo carries a Zacks Rank #2 (Buy). Shares of Masimo have gained 28.2% in a year's time, against the industry  's decline of 5.3%. The stock also outpaced the S&P 500 Index's rally of 0.4% in the same timeframe.     Other Key Picks    Some other top-ranked stocks from the broader medical space are Baxter International Inc. BAX  , Amedisys, Inc. AMED  and CONMED Corporation CNMD  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .  Baxter has a long-term earnings growth rate of 12.8%.    Amedisys has a long-term earnings growth rate of 16.3%.    CONMED has a long-term earnings growth rate 14.9%.  It's Illegal in 42 States, But Investors Will Make   Billions Legally  In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year. That's twice as much as they spend on marijuana, legally or otherwise. Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.   See these 5 \"sin stocks\" now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Masimo Corporation (MASI): Free Stock Analysis Report   Baxter International Inc. (BAX): Free Stock Analysis Report   Amedisys, Inc. (AMED): Free Stock Analysis Report   CONMED Corporation (CNMD): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Masimo Corporation MASI  recently announced Pathway, which is a feature for the Root Patient Monitoring and Connectivity Platform. Pathway is likely to aid clinicians in simplifying decision making associated with newborn resuscitation. With this new feature, Masimo will not only add to its SET Pulse Oximeter Technology but also bolster patient monitoring, which in turn will drive growth.  makeArticleAd();  Notably, Masimo's Root Patient Monitoring and Connectivity Platform helps in making patient care workflows simpler through an easy-to-internet display and multiple network/connectivity options putting together multiple streams of data.   Few Words About Pathway    This new feature offers clinicians a way to visualize a hospital's recommended resuscitation protocol for a newborn's oxygen saturation (SpO2) while monitoring the same and the pulse rate during the first 10 minutes after birth. Pathway has been introduced to simplify clinician workflow and enhance protocol adherence during this crucial period.   Masimo's Root Platform at a Glance    Notably, Masimo's Root platform is a very powerful, expandable patient monitoring and connectivity hub that brings together a range of technologies, devices, and systems to offer multimodal monitoring and connectivity solutions in a single, clinician-centric platform.    Pathway's visualization on Root platform works in tandem with continuous SpO2 monitoring powered by Masimo SET Measure-through Motion and Low Perfusion technology, which has exhibited its efficiency in over 100 independent and objective studies outperforming other pulse oximetry technologies.   Masimo: A Leading Player in Pulse Oximetry    Masimo is a global pioneer in the field of highly-advanced non-invasive monitoring technologies. The company's flagship Signal Extraction Technology (SET) pulse oximetry or SET pulse oximeter solution successfully eliminates the limitations of conventional mediums. Masimo's rainbow SET technology has been gaining traction driven by rapid product development.    When it comes to newborn health, SET has been proven to help clinicians lower severe retinopathy of prematurity in neonates and in multiple studies.   Consequently, this new feature is likely to be an important addition to the SET Pulse Oximeter Technology.   Patient Monitoring in Focus    Masimo is touted to be the most innovative company in the patient monitoring space. According to report by Research and Markets  , the  global market  for patient monitoring devices will witness a CAGR of 8.2% to nearly $30.7 billion by 2022. Growing economy, rise in the prevalence of chronic diseases and increasing adoption of cost-effective remote patient monitoring devices will drive growth in this market.    The company remains committed toward enhancing patient monitoring and its efforts reflect the same. In non-invasive patient monitoring, the company's Patient SafetyNet, Rainbow acoustic monitoring, SedLine brain function monitoring, Capnography and gas monitoring deserve mention.   Additionally, Masimo's program to improve opioid safety via innovative monitoring technology for both post-surgical wards and home use deserves mention in this regard.   Zacks Rank and Price Performance    Currently Masimo carries a Zacks Rank #2 (Buy). Shares of Masimo have gained 28.2% in a year's time, against the industry  's decline of 5.3%. The stock also outpaced the S&P 500 Index's rally of 0.4% in the same timeframe.",
    "    Other Key Picks    Some other top-ranked stocks from the broader medical space are Baxter International Inc. BAX  , Amedisys, Inc. AMED  and CONMED Corporation CNMD  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  . ",
    "Baxter has a long-term earnings growth rate of 12.8%.    Amedisys has a long-term earnings growth rate of 16.3%.    CONMED has a long-term earnings growth rate 14.9%.",
    " It's Illegal in 42 States, But Investors Will Make   Billions Legally ",
    "In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    "That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "  See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:16:00"
}