{
  "url": "https://www.nasdaq.com/article/is-meritor-mtor-a-great-value-stock-right-now-cm1207211",
  "title": "Is Meritor (MTOR) a Great Value Stock Right Now? - Nasdaq.com",
  "text": [
    " The proven Zacks Rank system focuses on earnings estimates and estimate revisions to find winning stocks. Nevertheless, we know that our readers all have their own perspectives, so we are always looking at the latest trends in value, growth, and momentum to find strong picks. Of these, value investing is easily one of the most popular ways to find great stocks in any market environment. Value investors use tried-and-true metrics and fundamental analysis to find companies that they believe are undervalued at their current share price levels. Luckily, Zacks has developed its own Style Scores system in an effort to find stocks with specific traits. Value investors will be interested in the system's \"Value\" category. Stocks with both \"A\" grades in the Value category and high Zacks Ranks are among the strongest value stocks on the market right now. Meritor (MTOR) is a stock many investors are watching right now. MTOR is currently sporting a Zacks Rank of #2 (Buy), as well as a Value grade of A. The stock holds a P/E ratio of 5.04, while its industry has an average P/E of 11. Over the last 12 months, MTOR's Forward P/E has been as high as 7.71 and as low as 4.75, with a median of 6.29. Value investors also use the P/S ratio. The P/S ratio is is calculated as price divided by sales. This is a popular metric because sales are harder to manipulate on an income statement, so they are often considered a better performance indicator. MTOR has a P/S ratio of 0.31. This compares to its industry's average P/S of 0.42. Finally, our model also underscores that MTOR has a P/CF ratio of 3.88. This data point considers a firm's operating cash flow and is frequently used to find companies that are undervalued when considering their solid cash outlook. MTOR's current P/CF looks attractive when compared to its industry's average P/CF of 6.20. MTOR's P/CF has been as high as 8.91 and as low as 3.80, with a median of 5.59, all within the past year. These are only a few of the key metrics included in Meritor's strong Value grade, but they help show that the stock is likely undervalued right now. When factoring in the strength of its earnings outlook, MTOR looks like an impressive value stock at the moment.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Meritor, Inc. (MTOR): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "The proven Zacks Rank system focuses on earnings estimates and estimate revisions to find winning stocks. Nevertheless, we know that our readers all have their own perspectives, so we are always looking at the latest trends in value, growth, and momentum to find strong picks.",
    "Of these, value investing is easily one of the most popular ways to find great stocks in any market environment. Value investors use tried-and-true metrics and fundamental analysis to find companies that they believe are undervalued at their current share price levels.",
    "Luckily, Zacks has developed its own Style Scores system in an effort to find stocks with specific traits. Value investors will be interested in the system's \"Value\" category. Stocks with both \"A\" grades in the Value category and high Zacks Ranks are among the strongest value stocks on the market right now.",
    "Meritor (MTOR) is a stock many investors are watching right now. MTOR is currently sporting a Zacks Rank of #2 (Buy), as well as a Value grade of A. The stock holds a P/E ratio of 5.04, while its industry has an average P/E of 11. Over the last 12 months, MTOR's Forward P/E has been as high as 7.71 and as low as 4.75, with a median of 6.29.",
    "Value investors also use the P/S ratio. The P/S ratio is is calculated as price divided by sales. This is a popular metric because sales are harder to manipulate on an income statement, so they are often considered a better performance indicator. MTOR has a P/S ratio of 0.31. This compares to its industry's average P/S of 0.42.",
    "Finally, our model also underscores that MTOR has a P/CF ratio of 3.88. This data point considers a firm's operating cash flow and is frequently used to find companies that are undervalued when considering their solid cash outlook. MTOR's current P/CF looks attractive when compared to its industry's average P/CF of 6.20. MTOR's P/CF has been as high as 8.91 and as low as 3.80, with a median of 5.59, all within the past year.",
    "These are only a few of the key metrics included in Meritor's strong Value grade, but they help show that the stock is likely undervalued right now. When factoring in the strength of its earnings outlook, MTOR looks like an impressive value stock at the moment.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:10:12"
}