{
  "url": "https://www.nasdaq.com/article/ardelyx-ardx-gains-on-tenapanors-success-in-pivotal-study-cm1207423",
  "title": "Ardelyx (ARDX) Gains on Tenapanor's Success in Pivotal Study - Nasdaq.com",
  "text": [
    "  Ardelyx, Inc. ARDX  announced that its lead pipeline candidate, tenapanor, met primary and all key secondary endpoints in a pivotal phase III study - AMPLIFY. Notably, the study evaluated the candidate in combination with phosphate binders as a treatment for hyperphosphatemia, an elevated level of phosphate in the blood, in patients with chronic kidney disease on dialysis. Following the news, shares of the company surged 71.2% on Aug 3. So far this year, the stock has skyrocketed 225.2% compared with the industry  's 6.1% growth.    Data from the AMPLIFY study, evaluating tenapanor combination regimen in patients with uncontrolled hyperphosphatemia following treatment with phosphate binders, showed a statistically significant reduction in serum phosphorus from baseline after 4 weeks of treatment, which was the study's primary endpoint. Tenapanor combination regimen reduced serum levels by 0.84 mg/dL compared with 0.19 mg/dL achieved by phosphate binders alone. Moreover, 49.1% patients receiving tenapanor regimen achieved serum levels less than 5.5 mg/dL versus 23.1% for phosphate binders alone. Patients in the tenapanor arm of the study achieved 22-24% reduction in FGF23 levels, which are associated with increased risk of major cardiovascular events compared to phosphate binder arm. Elevated levels of serum phosphorus may lead to cardiovascular events and bone fracture in patients receiving dialysis. An estimated 18% of patients receiving dialysis die every year in the United States. Data from the AMPLIFY study shows that tenapanor has potential in this segment. Ardelyx is also evaluating tenapanor as monotherapy in another phase III study - PHREEDOM - as a treatment for hyperphosphatemia in patients with end-stage renal disease and receiving dialysis. Top-line data from the study is expected in the fourth quarter of 2019. The company expects to file regulatory applications following the PHREEDOM data seeking approval for tenapanor monotherapy and combination therapy. In the United States, tenapanor is under review as a potential treatment for irritable bowel syndrome with constipation (IBS-C). A decision from the FDA is expected next week. However, we note that Ironwood Pharmaceuticals IRWD  / Allergan's AGN  Linzess holds a strong position in the IBS-C segment and is likely to pose challenges to tenapanor following a potential approval. Earlier this year, Bausch Health BHC  added IBS-C drug, Trulance, to its marketed portfolio with the acquisition of Synergy Pharmaceuticals. Ardelyx is also developing another pipeline candidate, RDX013, as a treatment for hyperkalemia - a condition of elevated level of potassium in the blood.   Ardelyx, Inc. Price        Ardelyx, Inc. price    |   Ardelyx, Inc. Quote    Zacks Rank  Ardelyx currently carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Allergan plc (AGN): Free Stock Analysis Report   Ironwood Pharmaceuticals, Inc. (IRWD): Free Stock Analysis Report   Ardelyx, Inc. (ARDX): Free Stock Analysis Report   Bausch Health Cos Inc. (BHC): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " Ardelyx, Inc. ARDX  announced that its lead pipeline candidate, tenapanor, met primary and all key secondary endpoints in a pivotal phase III study - AMPLIFY. Notably, the study evaluated the candidate in combination with phosphate binders as a treatment for hyperphosphatemia, an elevated level of phosphate in the blood, in patients with chronic kidney disease on dialysis.",
    "Following the news, shares of the company surged 71.2% on Aug 3. So far this year, the stock has skyrocketed 225.2% compared with the industry  's 6.1% growth.",
    "Data from the AMPLIFY study, evaluating tenapanor combination regimen in patients with uncontrolled hyperphosphatemia following treatment with phosphate binders, showed a statistically significant reduction in serum phosphorus from baseline after 4 weeks of treatment, which was the study's primary endpoint. Tenapanor combination regimen reduced serum levels by 0.84 mg/dL compared with 0.19 mg/dL achieved by phosphate binders alone. Moreover, 49.1% patients receiving tenapanor regimen achieved serum levels less than 5.5 mg/dL versus 23.1% for phosphate binders alone. Patients in the tenapanor arm of the study achieved 22-24% reduction in FGF23 levels, which are associated with increased risk of major cardiovascular events compared to phosphate binder arm.",
    "Elevated levels of serum phosphorus may lead to cardiovascular events and bone fracture in patients receiving dialysis. An estimated 18% of patients receiving dialysis die every year in the United States. Data from the AMPLIFY study shows that tenapanor has potential in this segment.",
    "Ardelyx is also evaluating tenapanor as monotherapy in another phase III study - PHREEDOM - as a treatment for hyperphosphatemia in patients with end-stage renal disease and receiving dialysis. Top-line data from the study is expected in the fourth quarter of 2019. The company expects to file regulatory applications following the PHREEDOM data seeking approval for tenapanor monotherapy and combination therapy.",
    "In the United States, tenapanor is under review as a potential treatment for irritable bowel syndrome with constipation (IBS-C). A decision from the FDA is expected next week.",
    "However, we note that Ironwood Pharmaceuticals IRWD  / Allergan's AGN  Linzess holds a strong position in the IBS-C segment and is likely to pose challenges to tenapanor following a potential approval.",
    "Earlier this year, Bausch Health BHC  added IBS-C drug, Trulance, to its marketed portfolio with the acquisition of Synergy Pharmaceuticals. Ardelyx is also developing another pipeline candidate, RDX013, as a treatment for hyperkalemia - a condition of elevated level of potassium in the blood.",
    "  Ardelyx, Inc. Price        Ardelyx, Inc. price    |   Ardelyx, Inc. Quote  ",
    " Ardelyx, Inc. Price ",
    " Ardelyx, Inc. price    |   Ardelyx, Inc. Quote ",
    " Zacks Rank ",
    "Ardelyx currently carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:31:00"
}