{
  "url": "https://www.nasdaq.com/article/target-stock-wont-be-swayed-by-adding-disney-shops-cm1207271",
  "title": "Target Stock Won’t be Swayed by Adding Disney Shops - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Kudos to Target (NYSE: TGT ) for thinking outside the box and teaming up with Disney (NYSE: DIS ). But for shareholders expecting a meaningfully higher Target stock price stemming from the venture, think again. The high-profile partnership, in the end, isn't likely to add measurable revenue growth to the mix even at a larger scale.",
    "On the flip side, the plan to set up mini Disney stores within select Target locales is an encouraging sign that the retailer is willing to explore seemingly unusual ideas. Other efforts of the ilk have paid off.",
    "That makes TGT stock at least worth putting on your radar, if it wasn't already.",
    "Between Walmart (NYSE: WMT ) and Amazon (NASDAQ: AMZN ), it's not surprising Target has been kept at bay. Amazon is just better at e-commerce, and Walmart is overwhelmingly bigger.",
    "Nothing is ever permanent though. Inheriting a stagnant company when he took the helm in August 2014, it took CEO Brian Cornell some time to get his proverbial sea legs. Target only started to grow its top line again in earnest beginning in the latter half of 2017 .",
    "There are multiple reasons for that sales growth, including an overhaul of its supply chain and technological infrastructure in 2017, and a vastly improved e-commerce mechanism. Last quarter's online sales grew 34% year-over-year , on the heels of success with in-store pickup, drive-up pickup and its relationship with grocery shopping and delivery serviceShipt .",
    "Shipt hasn't been the only partnership Target has leveraged though. CVS Health (NYSE: CVS ) now operates over 1,600 in-store pharmacies under the CVS moniker .",
    "Now the retailer is looking to expand the idea of punting parts of its stores to third parties. Late last month, Target and Disney announced they would be launching 25 Disney \"shop-in-shop\" locations in October , with 40 more such shops slated to open next year. The store space allocated to Disney's merchandise will average 750 square feet, and will bring more than 100 items to Target locales that were previously only available at Disney's self-operated stores.",
    "The buzz was palpable. But, the development is hardly a panacea for Target. Not that it needed one.",
    "It's a credible coup for Target to be sure. The Walt Disney names turns heads, and because some of the merchandise will be exclusive, these shops could be a draw. They're not going to make Target stock leaps and bounds more investment-worthy than it was before, however.",
    "This is chiefly due to the fact that to clear 750 square feet of shop-specific selling space for Disney goods means 750 square feet of selling space for other merchandise will soon be evaporating. Presumably, Target expects a higher sales per square foot when the words \"Walt Disney\" are on the label, and it's not a bad bet. Disney is a premium brand that can leverage a huge media machine. Target isn't. Disney, however, expects to be treated like a premium-brand provider. It also likely expects Target to at least help facilitate the full Disney experience consumers will find at its theme parks and self-operated stores.",
    "Target may or may not be in a position to do that, or willing to do so if it is. Simultaneously, even if Target handles its part of the partnership perfectly, the unusual relationship may ultimately damage the Disney brand.",
    "There's another reason to not expect much in the way of meaningful impact. Only 25 of these shops will be in place before Christmas of this year, and only another 40 will be up and running by the end of 2020. Target operates more than 1,800 locations.",
    "It's possible the partnership is being tried on a small scale as a precursor to a much wider launch. Such a rollout could take years though, giving time for Disney's other partners - including Walmart - to leverage their relationship with the media giant.",
    "Again, securing such a deal with Disney is impressive in its own right, even if it's starting out on a very small scale. All big initiatives start out as small ones. There's room for this one to grow.",
    "Allocating 750 square feet worth of selling space, even if it were done in all 1,855 U.S. stores , isn't a foundation for tremendous revenue growth. The average full-size Target store sprawls 130,000 square feet .",
    "Target will also devote plenty of attention to Disney with its new-and-improved online shopping experience as well. But Target's online presence remains minimal at best relative to its in-store business. Last year's online sales surpassed $5 billion , but last year's total revenue was well over $70 billion.",
    "Certainly Target's consumers will enjoy browsing through a new selection of merchandise in what will likely be the typical Disney experience. But, there's no need to make this more than the modest publicity show it's ultimately going to be.",
    "As of this writing, James Brumley did not hold a position in any of the aforementioned securities. You can learn more about him at his website jamesbrumley.com , or follow him on Twitter , at @jbrumley.",
    "The post Target Stock Won't be Swayed by Adding Disney Shops appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 06:00:01"
}