{
  "url": "https://www.nasdaq.com/article/why-dell-technologies-fell-108-in-august-cm1207687",
  "title": "Why Dell Technologies Fell 10.8% in August - Nasdaq.com",
  "text": [
    " What happened Shares of   Dell Technologies    (NYSE: DELL) fell 10.8% in August, according to data from      S&P Global Market Intelligence    . The hardware and software tech conglomerate isn't immune from   global IT spending, and sentiment around   tech hardware    took a big hit after a reescalation of the U.S.-China trade war   early in the month. Dell's stock was also   up quite handsomely in July    , and it appears at least some investors thought renewed trade   tensions were reason enough to take profits. In fact, Dell's stock was down a lot more than 10.8% late in   the month, until a better-than-expected   earnings report    on Aug. 29 sent shares surging over 10% the very next day, making   up some of the lost ground.   Image source: Getty Images.makeArticleAd();  So what In the quarter, Dell slightly beat on revenues, which grew   1.4%. However, where Dell really shone was the bottom line, with   non-GAAP    earnings per share of $2.15 trouncing expectations by a whopping   $0.65. The company benefited from a favorable customer mix, while   keeping prices relatively high, even as component costs in memory   and storage fell dramatically. Management believes that the company is \"in the early stages   of a technology-led investment cycle,\" and that spending in IT   remained \"healthy,\" though the reported quarter ended prior to   the new round of tariffs. Investors still appear unsure of how   robust IT spending will really be this year and next. Now what Going forward, Dell continues to innovate and seek out   customers where it can leverage its diverse portfolio, from   servers and PCs to software and platform solutions. One   interesting news item from August was a new partnership with   AT&T    , aimed at developing open solutions for 5G infrastructure. New tech growth drivers such as 5G are running headlong into   the crosscurrent of the trade war. As you can see, this has led   to considerable volatility in Dell's stock, and August was no   exception. However, with solid execution and a forward P/E ratio   in the single digits, Dell may look quite attractive to   bargain-hunting   value investors    after its \"down\" month.   10 stocks we like better than Dell Technologies     Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Dell Technologies Inc.     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Billy Duberstein      owns shares of AT&T. His clients may own shares of the     companies mentioned. The Motley Fool has no position in any of     the stocks mentioned. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   Dell Technologies    (NYSE: DELL) fell 10.8% in August, according to data from      S&P Global Market Intelligence    . The hardware and software tech conglomerate isn't immune from   global IT spending, and sentiment around   tech hardware    took a big hit after a reescalation of the U.S.-China trade war   early in the month. Dell's stock was also   up quite handsomely in July    , and it appears at least some investors thought renewed trade   tensions were reason enough to take profits.",
    "In fact, Dell's stock was down a lot more than 10.8% late in   the month, until a better-than-expected   earnings report    on Aug. 29 sent shares surging over 10% the very next day, making   up some of the lost ground.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "In the quarter, Dell slightly beat on revenues, which grew   1.4%. However, where Dell really shone was the bottom line, with   non-GAAP    earnings per share of $2.15 trouncing expectations by a whopping   $0.65. The company benefited from a favorable customer mix, while   keeping prices relatively high, even as component costs in memory   and storage fell dramatically.",
    "Management believes that the company is \"in the early stages   of a technology-led investment cycle,\" and that spending in IT   remained \"healthy,\" though the reported quarter ended prior to   the new round of tariffs. Investors still appear unsure of how   robust IT spending will really be this year and next.",
    "Going forward, Dell continues to innovate and seek out   customers where it can leverage its diverse portfolio, from   servers and PCs to software and platform solutions. One   interesting news item from August was a new partnership with   AT&T    , aimed at developing open solutions for 5G infrastructure.",
    "New tech growth drivers such as 5G are running headlong into   the crosscurrent of the trade war. As you can see, this has led   to considerable volatility in Dell's stock, and August was no   exception. However, with solid execution and a forward P/E ratio   in the single digits, Dell may look quite attractive to   bargain-hunting   value investors    after its \"down\" month.",
    "  10 stocks we like better than Dell Technologies     Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Dell Technologies Inc.     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Dell Technologies     Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Dell Technologies Inc.     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Billy Duberstein      owns shares of AT&T. His clients may own shares of the     companies mentioned. The Motley Fool has no position in any of     the stocks mentioned. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 06:27:00"
}