{
  "url": "https://www.nasdaq.com/article/charles-li-hong-kongs-charismatic-exchange-chief-leads-charge-for-lse-20190912-00207",
  "title": "Charles Li, Hong Kong's charismatic exchange chief, leads charge for LSE - Nasdaq.com",
  "text": [
    "By Alun John",
    "HONG KONG, Sept 12 (Reuters) - When Hong Kong Exchange chief executive Charles Li described his company's surprise offer for the London Stock Exchange this week as a \"a corporate tale of Romeo and Juliet,\" listeners outside Asia may have been surprised by the colourful analogy.",
    "But in Hong Kong, Li's fondness for extended metaphors are well known and have made the charismatic former offshore oil worker, lawyer, journalist and investment banker a popular figure at public events.",
    "The exchange has been the world's largest capital-raising venue in five of the past 10 years - an honour it split with the New York Stock Exchange.",
    "Li also oversaw the creation of \"stock connect,\" in 2014, a mechanism for Chinese investors to trade Hong Kong-listed shares and international investors to trade shares listed in Shanghai and Shenzhen. It is now the main channel into China for investors overseas.",
    "A Hong Kong Exchanges & Clearing representative declined to comment for this article.",
    "DEALMAKER",
    "Market participants say Li's previous roles inform his approach to running the exchange.",
    "\"He is more of an investment banker than a traditional CEO of an exchange. Since taking over, he has been pursuing this bolt-on as well as transformational acquisitions approach,\" said a financial M&A banker in Hong Kong, who was not authorised to speak to the media.",
    "Recently, HKEX has focused on buying small fintech players to boost technology and data capabilities.",
    "But Wednesday's shock announcement recalls HKEX's 2012 purchase of the London Metal Exchange (LME), which ran into trouble when HKEX raised trading fees.",
    "After an angry response from traders, a change of course, and LME leadership, steadied the ship. LME traders now generally speak well of Li.",
    "\"He is a big personality, a great front man; he likes getting on the stage and being bombastic and loud and the centre of attention,\" said the London-based head of one metals brokerage, who also declined to be identified because he was not authorised to speak to the media. \"This latest move is hugely ambitious, but if anybody can pull it off, it's Charles.\"",
    "JPMorgan bankers say that when he was chairman of JPMorgan China between 2003 and 2009, he was known for his willingness to trust colleagues.",
    "One said he often explained his attitude with a Chinese proverb: \"If you use a man, don't suspect him. If you suspect him, don't use him.\"",
    "NAVIGATING HONG KONG",
    "Beijing born-Li, despite speaking little Cantonese, has managed to balance the competing demands of global investment banks, the Hong Kong government, which approves six of HKEX's 13 board members, and Beijing, whose goodwill is crucial for its gateway role.",
    "After a multi-year campaign, Li in 2018 won approval to allow companies to list in Hong Kong with different classes of shares - a more relaxed standard of governance. Before the change, many Chinese tech companies chose a New York listing, including e-commerce giant Alibaba, whose 2014 $25 billion IPO is still a global record.",
    "Li has not won over all groups in Hong Kong, though, notably the city's army of small brokers, who have their own representative in the 70-seat Legislative Council.",
    "\"I think Charles Li is capable when it comes to developing and promoting HKEX internationally. But he doesn't take care of small and medium brokers. This takeover is only one example,\" said Christopher Cheung, a stockbroker and Hong Kong lawmaker, who said adapting to LSE systems would be a financial burden.",
    "More important for the success of LSE takeover is whether Li can adapt to the requirements of London-based traders, as he did eventually at the LME.",
    "A senior China banker, who has played football with Li, an avid fan of the game, said the exchange chief was well equipped to pull off the LSE bid.",
    "\"[Li's] sharp and direct views, exactly like his strength on the football field as a striker, can always bring success to the team, the region and its businesses,\" the banker said."
  ],
  "published_datetime": "2019-09-12 05:47:00"
}