{
  "url": "https://www.nasdaq.com/article/citi-and-deutsche-banks-australian-cartel-case-moves-ahead-cm1206531",
  "title": "Citi and Deutsche Bank's Australian Cartel Case Moves Ahead - Nasdaq.com",
  "text": [
    " One of the Australia's biggest white-collar crime prosecutions involving Australia and New Zealand Banking Group ANZBY  and the local units of Citigroup C  and Deutsche Bank DB  finally showed progress. The news was reported by Reuters. Lawyers and representatives of the banks met at the Sydney courtroom for a small administrative hearing ahead of legal argument scheduled to be held later this month. Following this, the magistrate shifted hearings to a larger room as the court would need to make room for 20 barristers, an unusually large number in Australia, even for large cases. Also, the lawyers from both sides are required to submit briefs of evidence to each other a week before scheduled hearings on Sep 25 and Sep 27. If found guilty, the banks could face penalties of A$10 million or triple the benefit of the conduct. The individuals charged could face 10 years in prison.  Brief on the Case  In August 2015, Citigroup, Deutsche Bank and JPMorgan JPM  were the underwriters for the institutional placement of nearly 80.8 million shares of ANZ Bank, which was conducted to raise capital for meeting regulatory requirements. However, Citigroup and Deutsche Bank, as part of their underwriting commitment, created a cartel arrangement. They, thus, reached an understanding for the disposal of 25.5 million shares that the banks absorbed as part of the placement. These shares represented less than 1% of ANZ Bank's outstanding shares at that time. Having investigated the matter for over two years, the Australian Competition and Consumer Commission (\"ACCC\") had put forth the allegations in June 2018. The regulator laid criminal charges against Citigroup's former Australia head Stephen Roberts, its present local head of capital markets John McLean and the bank's London-based head of foreign exchange trading Itay Tuchman. Further, Deutsche Bank's former local chief Michael Ormaechea and former local capital markets head Michael Richardson were sued. Also, ANZ Bank's treasurer Rick Moscati had been charged for cartel offences. JPMorgan was found to be clean by the ACCC, and thus faced no charges. Currently, Deutsche Bank, Citigroup and JPMorgan carry a Zacks Rank #3 (Hold) while ANZ has a Zacks Rank #4 (Sell). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .  Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   JPMorgan Chase & Co. (JPM): Free Stock Analysis Report   Citigroup Inc. (C): Free Stock Analysis Report   Deutsche Bank Aktiengesellschaft (DB): Free Stock Analysis Report   Australia & New Zealand Banking Group Ltd. (ANZBY): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "One of the Australia's biggest white-collar crime prosecutions involving Australia and New Zealand Banking Group ANZBY  and the local units of Citigroup C  and Deutsche Bank DB  finally showed progress. The news was reported by Reuters.",
    "Lawyers and representatives of the banks met at the Sydney courtroom for a small administrative hearing ahead of legal argument scheduled to be held later this month.",
    "Following this, the magistrate shifted hearings to a larger room as the court would need to make room for 20 barristers, an unusually large number in Australia, even for large cases. Also, the lawyers from both sides are required to submit briefs of evidence to each other a week before scheduled hearings on Sep 25 and Sep 27.",
    "If found guilty, the banks could face penalties of A$10 million or triple the benefit of the conduct. The individuals charged could face 10 years in prison.",
    " Brief on the Case ",
    "In August 2015, Citigroup, Deutsche Bank and JPMorgan JPM  were the underwriters for the institutional placement of nearly 80.8 million shares of ANZ Bank, which was conducted to raise capital for meeting regulatory requirements.",
    "However, Citigroup and Deutsche Bank, as part of their underwriting commitment, created a cartel arrangement. They, thus, reached an understanding for the disposal of 25.5 million shares that the banks absorbed as part of the placement. These shares represented less than 1% of ANZ Bank's outstanding shares at that time.",
    "Having investigated the matter for over two years, the Australian Competition and Consumer Commission (\"ACCC\") had put forth the allegations in June 2018.",
    "The regulator laid criminal charges against Citigroup's former Australia head Stephen Roberts, its present local head of capital markets John McLean and the bank's London-based head of foreign exchange trading Itay Tuchman. Further, Deutsche Bank's former local chief Michael Ormaechea and former local capital markets head Michael Richardson were sued. Also, ANZ Bank's treasurer Rick Moscati had been charged for cartel offences.",
    "JPMorgan was found to be clean by the ACCC, and thus faced no charges.",
    "Currently, Deutsche Bank, Citigroup and JPMorgan carry a Zacks Rank #3 (Hold) while ANZ has a Zacks Rank #4 (Sell).",
    "You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    " Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:04:00"
}