{
  "url": "https://www.nasdaq.com/article/top-ranked-growth-stocks-to-buy-for-september-11th-cm1210619",
  "title": "Top Ranked Growth Stocks to Buy for September 11th - Nasdaq.com",
  "text": [
    "Here are four stocks with buy ranks and strong growth characteristics for investors to consider today, September 11th :",
    "Lithia Motors, Inc. (LAD): This automotive retailer, which carries a Zacks Rank #1 (Strong Buy), has witnessed the Zacks Consensus Estimate for its current year earnings increasing 2.2% over the last 60 days.",
    "Lithia Motors, Inc. price-consensus-chart | Lithia Motors, Inc. Quote",
    "Lithia Motors has a PEG ratio of 1.02 compared with 3.40 for the industry. The company possesses a  Growth Score  of A.",
    "Lithia Motors, Inc. peg-ratio-ttm | Lithia Motors, Inc. Quote",
    "Booking Holdings Inc.( BKNG ) :This engineering company, which carries a Zacks Rank #2 (Buy), has witnessed the Zacks Consensus Estimate for its current year earnings increasing 0.9% over the last 60 days.",
    "Booking Holdings Inc. price-consensus-chart | Booking Holdings Inc. Quote",
    "Booking has a PEG ratio of 1.48, compared with 3.84 for the industry. The company possesses a Growth Score of A.",
    "Booking Holdings Inc. peg-ratio-ttm | Booking Holdings Inc. Quote",
    "Sportsman's Warehouse Holdings, Inc. (SPWH): This retail company, which carries a Zacks Rank #2, has witnessed the Zacks Consensus Estimate for its current year earnings increasing 3.9% over the last 60 days.",
    "Sportsman's Warehouse Holdings, Inc. price-consensus-chart | Sportsman's Warehouse Holdings, Inc. Quote",
    "Sportsman's Warehouse has a PEG ratio of 0.95, compared with 1.17 for the industry. The company possesses a Growth Score of A.",
    "Sportsman's Warehouse Holdings, Inc. peg-ratio-ttm | Sportsman's Warehouse Holdings, Inc. Quote",
    "Cedar Fair, L.P.( FUN ) : This operator of amusement and water parks, which carries a Zacks Rank #2, has witnessed the Zacks Consensus Estimate for its current year earnings increasing 3.4% over the last 60 days.",
    "Cedar Fair, L.P. price-consensus-chart | Cedar Fair, L.P. Quote",
    "Cedar Fair has a PEG ratio of 2.36, compared with 2.76 for the industry. The company possesses a Growth Score of A.",
    "Cedar Fair, L.P. peg-ratio-ttm | Cedar Fair, L.P. Quote",
    "See the  full list of top ranked stocks here .",
    "Learn more about the  Growth score and how it is calculated here .",
    "Looking for Stocks with Skyrocketing Upside?",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.      ",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.  ",
    "See the pot trades we're targeting>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:07:00"
}