{
  "url": "https://www.nasdaq.com/article/tunisia-court-upholds-continued-detention-of-presidential-candidate-20190903-00977",
  "title": "Tunisia court upholds continued detention of presidential candidate - Nasdaq.com",
  "text": [
    "TUNIS, Sept 3 (Reuters) - A Tunisian appeals court on Tuesday upheld the detention of media magnate Nabil Karoui, a candidate in this month's presidential election, on suspicion of tax fraud and money laundering, his lawyer said.",
    "Karoui, who denies any wrongdoing, had sought to be freed, but the court rejected the demand to release him, lawyer Kamel Ben Massoud told Reuters without giving details or further comment.",
    "Karoui, the owner of Nesma TV channel, is one of the most prominent candidates in the Sept. 15  election along with current and past prime ministers, a former president, the defence minister and the representative of a major Islamist party. ",
    "Karoui founded a charity to combat poverty in 2017 and then set up a political party, leading his critics to accuse him of using his foundation to advance his political ambitions, which he denies. ",
    "In June, parliament passed an amendment to the electoral law forbidding candidates who benefited from \"charitable associations\" or foreign funding in the year before an election, which would have banned him from the race.",
    "However, the late president Beji Caid Essebsi died in July without having signed the law, meaning Karoui was free to enter the election.  ",
    "His political party has called his detention a politically motivated attempt to bar him from the race, though government officials have said it is a purely judicial matter. ",
    "Tunisia's electoral commission kept him on the list of eligible candidates after his arrest last month on a court order. ",
    "The president is responsible for foreign and defence policy in Tunisia, while most decision-making powers rest with a prime minister who is chosen by parliament. A parliamentary election will also take place on Oct. 6. ",
    "Despite Karoui still being in detention, his party launched his presidential campaign with a rally on Monday night. On Tuesday, supporters gathered outside the court to demand he be freed. "
  ],
  "published_datetime": "2019-09-03 13:30:00"
}