{
  "url": "https://www.nasdaq.com/article/does-acadia-pharmaceuticals-have-more-room-to-run-cm1210495",
  "title": "Does Acadia Pharmaceuticals Have More Room to Run? - Nasdaq.com",
  "text": [
    "  Acadia Pharmaceuticals    (NASDAQ: ACAD) stock has been on   absolute fire     in 2019. Thanks to improving sales for its Parkinson's   disease psychosis (PDP) medicine Nuplazid and a recent late-stage   readout in the   dementia-driven psychosis setting    , the drugmaker's shares have shot up by an astounding 141% so   far this year. Does Acadia's stock have even more room to run or should   investors take profits after this monstrous rally? Let's take a   look at the bull and bear case for this red-hot   biotech stock    to find out.   Image source: Getty Images.makeArticleAd();  The bull case Not surprisingly, Acadia's stock was immediately blessed with   several analyst upgrades following Nuplazid's positive late-stage   readout for dementia-related psychosis. H.C. Wainwright   & Co. and Canaccord Genuity, for example, both raised   their respective price targets on Acadia's shares yesterday. Wall   Street, in turn, seems convinced that Acadia's stock can indeed   continue to tick higher. Why are analysts so bullish? They key reason is that Nuplazid   is staring down a potential $2 billion commercial opportunity   with a future label that would include both PDP   and dementia-related psychosis. Equally as important, Acadia   may end up fetching a high-dollar buyout offer with a successful   label expansion for Nuplazid. There are no FDA approved drugs   for dementia-related psychosis after all. Keeping with this theme,   Amgen    recently doled out $13.4 billion to get its hands on   Celgene    's plaque psoriasis medication Otezla. That transaction is   important to bear in mind in this case for two reasons. First   off, Otezla is expected to peak at around   $2.5 billion in annual sales    . Secondly, this anti-inflammatory drug competes in a rather   crowded market. Nuplazid, by contrast, is projected to post similar peak sales   to Otezla but with little to no competition for the foreseeable   future -- that is, assuming the FDA grants this key label   expansion. Put simply, a revenue-hungry big pharma may indeed be   willing to pay up to acquire Acadia if Nuplazid lives up to the   hype. The bear case There are three clear-cut reasons to doubt that Acadia's stock   can maintain this momentum. Firstly, the biotech's shares are now   trading at close to 3.5 times Nuplazid's peak sales projection as   a treatment for both PDP and dementia-related psychosis. That's   not a totally unreasonable valuation, but it also isn't cheap for   a company facing a critical regulatory decision, either. Secondly, the FDA could delay or even reject Nuplazid's label   expansion. This year, the FDA has taken a   surprising stance    on more than a few drugs with compelling late-stage data. Thus,   there's no way to predict how Nuplazid's forthcoming regulatory   process may play out with this seemingly more strict version of   the FDA. Thirdly, Acadia has a serious cash burn problem. Despite   Nuplazid's improving sales in the PDP arena, the company has   already burned through a cool $140.2 million during the first six   months of 2019. Although Acadia still sports a cash runway of   more than two years, the company would obviously be wise to raise   capital after this latest spike in its share price. Acadia's   rally, in turn, may stall if the company chooses to roll out a   particularly large secondary offering. Verdict There is a lot to like about this mid-cap biotech stock.   Nuplazid has a real shot at becoming a bona fide franchise-level   drug following these impressive late-stage results. The downside   is that most of this good news appears to be baked into the   company's valuation at this point. Bottom line: Acadia's shares will probably have trouble   pushing much higher in the near term due to the company's premium   valuation and the strong likelihood of a hefty capital raise.   Investors, therefore, may want to wait for a more compelling   entry point.   10 stocks we like better than Acadia     Pharmaceuticals       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Acadia Pharmaceuticals     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        George Budwell      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Celgene. The Motley Fool     recommends Amgen. The Motley Fool has a     disclosure policy      .  ",
    " Acadia Pharmaceuticals    (NASDAQ: ACAD) stock has been on   absolute fire     in 2019. Thanks to improving sales for its Parkinson's   disease psychosis (PDP) medicine Nuplazid and a recent late-stage   readout in the   dementia-driven psychosis setting    , the drugmaker's shares have shot up by an astounding 141% so   far this year.",
    "Does Acadia's stock have even more room to run or should   investors take profits after this monstrous rally? Let's take a   look at the bull and bear case for this red-hot   biotech stock    to find out.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Not surprisingly, Acadia's stock was immediately blessed with   several analyst upgrades following Nuplazid's positive late-stage   readout for dementia-related psychosis. H.C. Wainwright   & Co. and Canaccord Genuity, for example, both raised   their respective price targets on Acadia's shares yesterday. Wall   Street, in turn, seems convinced that Acadia's stock can indeed   continue to tick higher.",
    "Why are analysts so bullish? They key reason is that Nuplazid   is staring down a potential $2 billion commercial opportunity   with a future label that would include both PDP   and dementia-related psychosis. Equally as important, Acadia   may end up fetching a high-dollar buyout offer with a successful   label expansion for Nuplazid. There are no FDA approved drugs   for dementia-related psychosis after all.",
    "Keeping with this theme,   Amgen    recently doled out $13.4 billion to get its hands on   Celgene    's plaque psoriasis medication Otezla. That transaction is   important to bear in mind in this case for two reasons. First   off, Otezla is expected to peak at around   $2.5 billion in annual sales    . Secondly, this anti-inflammatory drug competes in a rather   crowded market.",
    "Nuplazid, by contrast, is projected to post similar peak sales   to Otezla but with little to no competition for the foreseeable   future -- that is, assuming the FDA grants this key label   expansion. Put simply, a revenue-hungry big pharma may indeed be   willing to pay up to acquire Acadia if Nuplazid lives up to the   hype.",
    "There are three clear-cut reasons to doubt that Acadia's stock   can maintain this momentum. Firstly, the biotech's shares are now   trading at close to 3.5 times Nuplazid's peak sales projection as   a treatment for both PDP and dementia-related psychosis. That's   not a totally unreasonable valuation, but it also isn't cheap for   a company facing a critical regulatory decision, either.",
    "Secondly, the FDA could delay or even reject Nuplazid's label   expansion. This year, the FDA has taken a   surprising stance    on more than a few drugs with compelling late-stage data. Thus,   there's no way to predict how Nuplazid's forthcoming regulatory   process may play out with this seemingly more strict version of   the FDA.",
    "Thirdly, Acadia has a serious cash burn problem. Despite   Nuplazid's improving sales in the PDP arena, the company has   already burned through a cool $140.2 million during the first six   months of 2019. Although Acadia still sports a cash runway of   more than two years, the company would obviously be wise to raise   capital after this latest spike in its share price. Acadia's   rally, in turn, may stall if the company chooses to roll out a   particularly large secondary offering.",
    "There is a lot to like about this mid-cap biotech stock.   Nuplazid has a real shot at becoming a bona fide franchise-level   drug following these impressive late-stage results. The downside   is that most of this good news appears to be baked into the   company's valuation at this point.",
    "Bottom line: Acadia's shares will probably have trouble   pushing much higher in the near term due to the company's premium   valuation and the strong likelihood of a hefty capital raise.   Investors, therefore, may want to wait for a more compelling   entry point.",
    "  10 stocks we like better than Acadia     Pharmaceuticals       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Acadia Pharmaceuticals     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Acadia     Pharmaceuticals       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Acadia Pharmaceuticals     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  George Budwell      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Celgene. The Motley Fool     recommends Amgen. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:44:00"
}