{
  "url": "https://www.nasdaq.com/article/aspen-posts-lower-fy-profit-on-weaker-manufacturing-results-no-dividend-20190911-00693",
  "title": "Aspen posts lower FY profit on weaker manufacturing results, no dividend - Nasdaq.com",
  "text": [
    "By Nqobile Dludla",
    "JOHANNESBURG, Sept 11 (Reuters) - South African drugmaker Aspen Pharmacare Holdings  said on Wednesday full-year core normalised earnings fell by 4% due to a lower contribution from its manufacturing business and it will not pay a dividend this year.",
    "The firm said it aimed to reduce debt levels from the 2020 financial year. Investors have been concerned about Aspen's rising debt in the last year after levels moved close to breaching debt covenants. ",
    "Normalised earnings before interest, tax, depreciation and amortization (EBITDA) declined to 10.8 billion rand ($733 million) in the full year from a restated 11.2 billion rand, the firm said in a statement. The figure is in constant exchange rates. In reported rates, EBITDA fell 2%.",
    "Aspen, which also operates in Europe, trimmed debt to 39 billion rand from 53.5 billion rand, thanks mostly to cash proceeds from disposal of its infant formula business and a portfolio of products distributed in Asia Pacific in the second half.",
    "The leverage ratio, which assesses the ability of a firm to meet its financial obligations, ended at 3.62x, \"comfortably\" below the covenant threshold of 4.0x.",
    "Aspen said it is aiming for a leverage ratio of less than 3.0x in the medium term, as it bets on positive free cash flows and a substantial decline in planned capital expenditure after the 2020 financial year.",
    "\"In the 2020 financial year, positive free cash flows and significantly reduced deferred payables should contribute to a further reduction in net borrowings,\" it said. ",
    "\"Favourable outcomes from our continued active assessment of value realisation opportunities would result in accelerated deleveraging of our balance sheet.\"",
    "The firm did not declare an annual dividend, saying it has taken into account its prioritisation of deleveraging the balance sheet, existing debt service commitments during the 2020 financial year and the short-term requirements of the ongoing capital projects.",
    "HEPARIN SHORTAGE",
    "The nearly 170-year old drug maker with presence in about 56 countries, said it intends to pursue supplying heparin to third party customers again, \"given the pricing and the significant stockholding established.\"",
    "Aspen had suspended the supply of the blood-thinning medication to third parties due to limited global availability as a result of the outbreak of African swine fever in China, the world's biggest pork producer.",
    "A key ingredient for heparin is pig mucosa, which is found in the intestines of pigs.",
    "It said the increasing prices of heparin will dilute margins from its thrombosis portfolio, however, it has managed to dampen this impact \"by a considered stock build of heparin and the benefits of being a producer of heparin.\" ",
    "The suspension of sales of heparin along with a major third-party customer losing a material tender in the prior year and strike action at its South African manufacturing facilities, impacted the manufacturing business.",
    "Revenue in that business was down 11%.",
    "($1 = 14.7045 rand)"
  ],
  "published_datetime": "2019-09-11 12:36:00"
}