{
  "url": "https://www.nasdaq.com/article/is-canadian-solar-csiq-stock-outpacing-its-oils-energy-peers-this-year-cm1207186",
  "title": "Is Canadian Solar (CSIQ) Stock Outpacing Its Oils-Energy Peers This Year? - Nasdaq.com",
  "text": [
    " Investors focused on the Oils-Energy space have likely heard of Canadian Solar (CSIQ), but is the stock performing well in comparison to the rest of its sector peers? One simple way to answer this question is to take a look at the year-to-date performance of CSIQ and the rest of the Oils-Energy group's stocks. Canadian Solar is one of 310 individual stocks in the Oils-Energy sector. Collectively, these companies sit at #14 in the Zacks Sector Rank. The Zacks Sector Rank considers 16 different sector groups. The average Zacks Rank of the individual stocks within the groups is measured, and the sectors are listed from best to worst. The Zacks Rank emphasizes earnings estimates and estimate revisions to find stocks with improving earnings outlooks. This system has a long record of success, and these stocks tend to be on track to beat the market over the next one to three months. CSIQ is currently sporting a Zacks Rank of #1 (Strong Buy). The Zacks Consensus Estimate for CSIQ's full-year earnings has moved 22.80% higher within the past quarter. This means that analyst sentiment is stronger and the stock's earnings outlook is improving. Our latest available data shows that CSIQ has returned about 61.58% since the start of the calendar year. Meanwhile, the Oils-Energy sector has returned an average of -2.85% on a year-to-date basis. This means that Canadian Solar is performing better than its sector in terms of year-to-date returns. Looking more specifically, CSIQ belongs to the Solar industry, which includes 12 individual stocks and currently sits at #32 in the Zacks Industry Rank. On average, stocks in this group have gained 77.81% this year, meaning that CSIQ is slightly underperforming its industry in terms of year-to-date returns. Investors in the Oils-Energy sector will want to keep a close eye on CSIQ as it attempts to continue its solid performance.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Canadian Solar Inc. (CSIQ): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors focused on the Oils-Energy space have likely heard of Canadian Solar (CSIQ), but is the stock performing well in comparison to the rest of its sector peers? One simple way to answer this question is to take a look at the year-to-date performance of CSIQ and the rest of the Oils-Energy group's stocks.",
    "Canadian Solar is one of 310 individual stocks in the Oils-Energy sector. Collectively, these companies sit at #14 in the Zacks Sector Rank. The Zacks Sector Rank considers 16 different sector groups. The average Zacks Rank of the individual stocks within the groups is measured, and the sectors are listed from best to worst.",
    "The Zacks Rank emphasizes earnings estimates and estimate revisions to find stocks with improving earnings outlooks. This system has a long record of success, and these stocks tend to be on track to beat the market over the next one to three months. CSIQ is currently sporting a Zacks Rank of #1 (Strong Buy).",
    "The Zacks Consensus Estimate for CSIQ's full-year earnings has moved 22.80% higher within the past quarter. This means that analyst sentiment is stronger and the stock's earnings outlook is improving.",
    "Our latest available data shows that CSIQ has returned about 61.58% since the start of the calendar year. Meanwhile, the Oils-Energy sector has returned an average of -2.85% on a year-to-date basis. This means that Canadian Solar is performing better than its sector in terms of year-to-date returns.",
    "Looking more specifically, CSIQ belongs to the Solar industry, which includes 12 individual stocks and currently sits at #32 in the Zacks Industry Rank. On average, stocks in this group have gained 77.81% this year, meaning that CSIQ is slightly underperforming its industry in terms of year-to-date returns.",
    "Investors in the Oils-Energy sector will want to keep a close eye on CSIQ as it attempts to continue its solid performance.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:10"
}