{
  "url": "https://www.nasdaq.com/article/bargain-hunters-take-note-insider-cluster-buying-at-pru-cm1210550",
  "title": "Bargain Hunters Take Note: Insider Cluster-Buying At PRU - Nasdaq.com",
  "text": [
    "A particularly strong insider buying signal is what we call a \"cluster-buy\" where three or more different insiders make open market purchases within a short period of one another. At Prudential Financial Inc (Symbol: PRU), 3 different insiders purchased 13,580 shares at an average price of $83.79/share, for a total of $1.14M, with the most recent purchase on September 9, 2019.      Presumably the only reason an insider would take their hard-earned cash and use it to buy stock of their company in the open market, is that they expect to make money. So when multiple insiders all decide to make purchases around the same time, it could be a strong indication that the stock is undervalued. Below is a table summarizing the insider buys that make up this \"cluster\":  makeArticleAd();     The chart below shows the one year performance of PRU shares, versus its 200 day moving average. Note that PRU's low point in its 52 week range is $75.6094 per share, with $106.64 as the 52 week high point - that compares with a last trade of $87.51, with shares currently trading up about 0.9% on the day.         The current annualized dividend paid by Prudential Financial Inc is $4/share, currently paid in quarterly installments, and its most recent dividend ex-date was on 08/19/2019. Below is a long-term dividend history chart for PRU, which can be of good help in judging whether the most recent dividend with approx. 4.6% annualized yield is likely to continue.      Ten Bargains You Can Buy Cheaper Than The   Insiders Did »  ",
    "  Ten Bargains You Can Buy Cheaper Than The   Insiders Did » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:56:55"
}