{
  "url": "https://www.nasdaq.com/article/euro-zone-stocks-rally-1-on-trade-hopes-ftse-lags-20190905-00861",
  "title": "Euro zone stocks rally 1% on trade hopes, FTSE lags - Nasdaq.com",
  "text": [
    "    * China, U.S. to hold trade talks in October",
    "* German industrial orders plunge in July",
    "* Safran jumps after raising FY profit forecast  (Updates to close)",
    "Sept 5 (Reuters) - Euro zone stock markets charged higher onThursday, as optimism over U.S.-China trade talks, positivecorporate updates and a rally in banking shares brightened themood in Europe even as London stocks went in the oppositedirection.",
    "A surge in tariff-sensitive shares of tech firms, automakersand energy companies drove an index of euro zone stocks .STOXXE 1.0% higher at the close, compared with a 0.7% rise inthe broader European stock index .STOXX .",
    "News that Beijing and Washington officials agreed to holdhigh-level trade talks in early October raised hopes of progress in their negotiations even as both sides fired tariffson each others' goods last month. urn:newsml:reuters.com:*:nL3N25W0JF",
    "Britain's FTSE 100 .FTSE was a weak spot, falling -0.6% asseveral large-cap names traded ex-dividend and exporters on theindex took a hit from a surge in sterling. .L",
    "Investors have cheered political developments this week,with the formation of a new government in Italy and the UKparliament's battle to avert a no-deal Brexit lifting the STOXX600 to a fresh one-month high.",
    "\"The bullish theme seen elsewhere comes off the back of animproved outlook for US-China talks, which are planned forOctober,\" Joshua Mahony, senior market analyst at IG, wrote in aclient note.",
    "\"However, we have seen this all before, so there is a strongchance that market scepticism kicks in to limit these gains.\"    ",
    "Automakers and parts suppliers index .SXAP led gains onthe main index with a 2.9% jump to record its biggest percentagegain since July 23. ",
    "BANKS RISE",
    "Banking shares .SX7P also rose more than a percent for asecond day as eurozone bond yields rose in the wake of strongU.S. private data and comments this week by ECB officialsplaying down the need for aggressive stimulus at next Thursday'spolicy meeting. GVD/EUR",
    "Bank of Ireland GroupBIRG.I jumped 8.5% to the top of theindex, while gains for Spanish lenders and a 7.3% rise inFinland's Nordea NDAFI.HE on naming a new chief executiveboosted the sector. urn:newsml:reuters.com:*:nL5N25W0OA",
    "French engine maker SafranSAF.PA gained 5.1% after thecompany raised its full-year profit forecast, while DassaultAviation AVMD.PA rose 5.7% after the maker of Rafale warplanesand Falcon business jets affirmed its view of higher net salesin 2019. urn:newsml:reuters.com:*:nL5N25W0M9",
    "Together they helped drive a 1.4% increase in the industrialgoods and services .SXNP sector.",
    "Shares in Thyssenkrupp AGTKAG.DE tacked on 6.2% on areport that Finland'sKoneKNEBV.HE was considering teaming upwith a private equity partner to pull off a bid for the Germanconglomerate's elevator business. urn:newsml:reuters.com:*:nL5N25W59J",
    "The gains came despite news the company is set to drop outof Germany's benchmark GDAXI index this month. urn:newsml:reuters.com:*:nL5N25V6GW",
    "Norwegian shares .OSEAX got a boost from a 7.5% jump inEquinor's shares EQNR.OL after the oil firm launched a $5billion share buyback and said its Johan Sverdrup oilfield willcome on stream in October, a month earlier than planned. urn:newsml:reuters.com:*:nL5N25W0H1",
    "Equinor's shares notched their biggest percentage gain sinceFebruary 2016, while other Nordic oil firms such as Aker BPAKERBP.OL and Lundin PetroleumLUPE.ST rose between 2.7% and4.7%. (Reporting by Sruthi Shankar and Medha Singh in Bengaluru;Editing by Andrew Cawthorne) ((sruthi.shankar@thomsonreuters.com; within U.S. +1 646 2238780; outside U.S. +91 80 6749 6328))"
  ],
  "published_datetime": "2019-09-05 12:57:00"
}