{
  "url": "https://www.nasdaq.com/article/preciousgold-slips-as-trade-optimism-lifts-risk-assets-ecb-meet-in-focus-20190912-00037",
  "title": "PRECIOUS-Gold slips as trade optimism lifts risk assets; ECB meet in focus - Nasdaq.com",
  "text": [
    "    * ECB announcement expected at 1145 GMT",
    "* Palladium set for 4th session of gains (Adds technicals, updates prices)",
    "By Karthika Suresh Namboothiri",
    "Spot gold XAU= was down 0.1% at $1,495.30 per ounce, as of0528 GMT. U.S. gold futures GCcv1 were little changed at$1,503.70.",
    "The United States on Wednesday agreed to delay increasingtariffs on $250 billion worth of Chinese imports to Oct. 15 fromOct. 1 \"as a gesture of good will\". urn:newsml:reuters.com:*:nW1N24C02Jurn:newsml:reuters.com:*:nL3N2624DJ",
    "U.S. President Donald Trump postponing additional tariffs onChinese goods eased trade tensions to an extent, said Brian Lan,managing director at dealer GoldSilver Central in Singapore,adding markets will now be awaiting cues from the ECB meeting.",
    "Hopes of a breakthrough in negotiations between the world'stwo biggest economies lifted risk sentiment, with MSCI'sbroadest index of Asia-Pacific shares outside Japan.MIAPJ0000PUS up 0.2%, and the dollar at a six-week highagainst the safe-haven yen. MKTS/GLOBUSD/",
    "The ECB meeting later in the session will be closely watchedfor clues on what measures the bank was willing to take tosupport a dampened economy amid Brexit concerns. The U.S.Federal Reserve is expected to do the same next week.",
    "\"There seems to be no concrete plans yet (from the ECB). Soinvestors are waiting and some of them are already starting totake profits. That's why we don't see (gold) prices fall muchfurther,\" Lan added.",
    "The ECB is set to announces its rate decision at 1145 GMT onThursday, followed by ECB President Mario Draghi's newsconference at 1230 GMT.",
    "Gold prices have dropped about 4% from a more than six-yearhigh of $1,557 it hit on Sept. 4 as renewed risk appetite andimproved economic data dampened demand for the safe-haven metal.These prices are highly sensitive to rising interest rates,which lift the opportunity cost of holding non-yielding bullion.   ",
    "Gold prices continue to hover near $1,500 an ounce. \"Itimplies that there is still plenty of demand for the safe-havenasset on this dip in prices, which contrasts with the bullisheuphoria elsewhere,\" OANDA analyst Jeffrey Halley wrote in anote.",
    "Signals are mixed for spot gold, as it is stuck in a neutralrange of $1,480-$1,497 per ounce, said Reuters technical analystWang Tao. urn:newsml:reuters.com:*:nL3N2630UY",
    "Among other precious metals, silver XAG= inched higher to$18.10 per ounce, while platinum XPT= rose 0.4% to $948.21.Meanwhile, palladium XPD= gained half a percent to $1,580.19an ounce.",
    "Palladium was on track for a fourth straight session ofgains, while holding close to a two-month high of $1,590 ittouched on Wednesday. (Reporting by Karthika Suresh Namboothiri in Bengaluru; Editingby Rashmi Aich) ((karthikasuresh.namboothiri@thomsonreuters.com; +91 80 67490997 (If within U.S. call 651-848-5832); Reuters Messaging:karthikasuresh.namboothiri.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-12 01:46:00"
}