{
  "url": "https://www.nasdaq.com/article/us-stockswall-street-set-to-open-lower-as-trade-tensions-weigh-20190903-00664",
  "title": "US STOCKS-Wall Street set to open lower as trade tensions weigh - Nasdaq.com",
  "text": [
    " (For a live blog on the U.S. stock market, click LIVE/ ortype LIVE/ in a news window.)",
    "* U.S. factory activity data due later on Tuesday",
    "* Casino stocks under pressure from weak Macau data",
    "* Futures down: Dow 0.65%, S&P 500 0.50%, Nasdaq 0.47%  (Updates prices, adds comment)",
    "By Uday Sampath Kumar",
    "Sept 3 (Reuters) - U.S. stocks were set to open lower onTuesday, as Washington's new round of tariffs on some Chinesegoods kicked in and after a report that officials from bothsides were struggling to decide on the schedule for a meetingthis month.",
    "Shares of trade-sensitive industrial bellwethers CaterpillarInc CAT.N and Boeing CoBA.N fell about 2% each in premarkettrading, while those of Apple IncAAPL.O fell 1%.    The tariffs that went into effect on Sunday are makinginvestors increasingly cynical towards the trade war, which hasdominated economic headlines for over a year, Peter Cardillo,chief market economist at Spartan Capital Securities in New Yorksaid.",
    "A monthly survey on manufacturing activity by the Institutefor Supply Management, due at 10 a.m. ET, is expected to shedsome light on the impact of the trade war on the U.S. industrialsector.",
    "The ISM manufacturing Purchasing Managers' Index (PMI) isexpected to dip to 51.1 in August, from 51.2 in the monthbefore. ",
    "Although U.S. factory activity has been slowing in recentmonths, the ISM's index has so far stayed above 50, indicatingexpansion in the sector.",
    "\"We're getting very close to a contraction and obviously ifwe get any number in today's report that does take us evencloser then that would be one more nail in the coffin in termsof economic weakness,\" Cardillo said. ",
    "The S&P 500 index .SPX fell 1.8% in August, its biggestmonthly drop since May, after escalating trade tensions and theinversion of a key part of the U.S. yield curve, seen as a signof recession, drove investors toward safe-haven assets.",
    "The benchmark index, however, ended the week up nearly 3% astrade tensions were dialed down following signals that Beijingand Washington would meet in September for talks.",
    "Bloomberg, however, reported on Monday that the two sideswere yet to agree on a date for the planned meeting.",
    "The Trump administration on Sunday began collecting 15%tariff on more than $125 billion in Chinese imports, while Chinabegan imposing new duties on U.S. crude. urn:newsml:reuters.com:*:nL3N25S01P",
    "Chipmakers, which draw a large portion of their revenue fromChina, also fell, with Intel CorpINTC.O , Advanced MicroDevices AMD.O and Micron Technology IncMU.O off between0.7% and 1.6%.",
    " At 8:47 a.m. ET, Dow e-minis 1YMcv1 were down 171 points,or 0.65%. S&P 500 e-minis EScv1 were down 14.5 points, or 0.5%and Nasdaq 100 e-minis NQcv1 were down 36.25 points, or 0.47%.",
    "Along with the manufacturing data, investors will also keepa close watch on the monthly jobs report due on Friday for clueson the health of the U.S. economy. ",
    "U.S. casino operators felt the brunt of slowing economicgrowth in China as gambling hub Macau posted an 8.6% decline inAugust casino revenue, sending shares of Wynn Resorts LtdWYNN.O , Las Vegas Sands CorpLVS.N and MGM ResortsInternational MGM.N down between 1.6% and 2%. urn:newsml:reuters.com:*:nL3N25U2WY",
    "Shares of Ulta BeautyULTA.O fell 1.6%, extending a slidefrom Friday, after Citigroup cut the rating on the cosmeticsretailer's stock to \"neutral\". urn:newsml:reuters.com:*:nL3N25U2VE    (Reporting by Uday Sampath in Bengaluru; Editing by AnilD'Silva and Arun Koyyur) ((UdaySampath.Kumar@thomsonreuters.com; within U.S.+1 646 2238780; Twitter: @sampath_uday; Reuters Messaging:UdaySampath.Kumar.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-03 09:01:00"
}