{
  "url": "https://www.nasdaq.com/article/ford-finds-buyer-for-brazil-plant-but-new-owner-could-cut-1300-jobs-20190903-01214",
  "title": "Ford finds buyer for Brazil plant, but new owner could cut 1,300 jobs - Nasdaq.com",
  "text": [
    "By Marcelo Rochabrun",
    "SAO PAULO, Sept 3 (Reuters) - Brazilian automaker CAOA reached an initial agreement to buy Ford Motor Co's plant in Sao Bernardo do Campo, the companies said on Tuesday, but CAOA could slash 1,300 jobs, according to the union representing the plant's workers. ",
    "Ford announced in February that it would shut down the plant, its oldest in Brazil, which employs some 3,000 workers, as part of a global restructuring and a push to exit the heavy truck business. ",
    "Wagner Santana, president of the union that represents Ford's workers, told reporters that in conversations with CAOA, the Brazilian automaker said it would initially retain only some 800 workers and that 1,300 would be let go, with the remainder being kept by Ford. ",
    "Doria has defended Sao Paulo as a manufacturing hub at a time when the auto industry turned to other Brazilian states that were offering aggressive tax incentives. He has introduced a tax incentive of his own. ",
    "At the news conference, Doria said a decision on how many jobs will be kept can only be made once Ford and CAOA close the sale, which is set to go through a 45-day due diligence process. ",
    "\"Preserve all jobs, that's the fundamental condition for a contribution from the state,\" Doria said, in reference to potential tax benefits. ",
    "Santana said CAOA plans to pay those it hires up to 80% of their current Ford salaries, noting that is still much more than salaries paid in other states. ",
    "A CAOA spokesperson declined to comment.  ",
    "\"The objective is to make the factory profitable and productive, so it generates employment and riches,\" said Carlos Alberto Oliveira Andrade, CAOA's president and founder, whose initials make up the company name. ",
    "Brazil's large domestic market and protectionist economy has long attracted the world's biggest automakers to set up shop here, and CAOA is the rare carmaker that is actually domestically owned. It has struck deals to make cars for Korea's Hyundai and co-owns China's Chery operation in Brazil, whose cars are branded as CAOA Chery.",
    "Ford opened the plant in 1967, and it is the company's oldest in the country. It was primarily used to make heavy trucks, as well as the compact Ford Fiesta, a sales laggard. Ford is undergoing a global restructuring and has said it would focus on a much newer plant in the Northeastern state of Bahia."
  ],
  "published_datetime": "2019-09-03 15:51:00"
}