{
  "url": "https://www.nasdaq.com/article/new-strong-buy-stocks-for-september-4th-cm1207371",
  "title": "New Strong Buy Stocks for September 4th - Nasdaq.com",
  "text": [
    "Here are 5 stocks added to the Zacks Rank #1 (Strong Buy) List today:",
    "Genesis Healthcare, Inc . (GEN): This company that owns and operates skilled nursing facilities and assisted/senior living facilities has seen the Zacks Consensus Estimate for its current year earnings increasing 46% over the last 60 days.",
    "Genesis Healthcare, Inc. Price and Consensus",
    "Genesis Healthcare, Inc. price-consensus-chart | Genesis Healthcare, Inc. Quote",
    "Douglas Dynamics, Inc . (PLOW): This company that operates as a manufacturer and upfitter of commercial work truck attachments and equipment has seen the Zacks Consensus Estimate for its current year earnings increasing 7.5% over the last 60 days.",
    "Douglas Dynamics, Inc. Price and Consensus",
    "Douglas Dynamics, Inc. price-consensus-chart | Douglas Dynamics, Inc. Quote",
    "Encore Capital Group, Inc . (ECPG): This specialty finance company has seen the Zacks Consensus Estimate for its current year earnings increasing 3.9% over the last 60 days.",
    "Encore Capital Group Inc Price and Consensus",
    "Encore Capital Group Inc price-consensus-chart | Encore Capital Group Inc Quote",
    "Itron, Inc . (ITRI): This technology and service company has seen the Zacks Consensus Estimate for its current year earnings increasing nearly 8% over the last 60 days.",
    "Itron, Inc. Price and Consensus",
    "Itron, Inc. price-consensus-chart | Itron, Inc. Quote",
    "Monotype Imaging Holdings Inc. (TYPE): This company that develops, markets, and licenses technologies and fonts has seen the Zacks Consensus Estimate for its current year earnings increasing 2.3% over the last 60 days.",
    "Monotype Imaging Holdings Inc. Price and Consensus",
    "Monotype Imaging Holdings Inc. price-consensus-chart | Monotype Imaging Holdings Inc. Quote",
    "You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here",
    "Biggest Tech Breakthrough in a Generation",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "See 7 breakthrough stocks now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:47:00"
}