{
  "url": "https://www.nasdaq.com/article/trevena-sees-hammer-chart-pattern-time-to-buy-cm1207091",
  "title": "Trevena Sees Hammer Chart Pattern: Time to Buy? - Nasdaq.com",
  "text": [
    "  Trevena, Inc. TRVN  has    been struggling lately, but the selling pressure may be coming to an end soon. That is because TRVN recently saw a Hammer Chart Pattern which can signal that the stock is nearing a bottom.  What is a Hammer Chart Pattern?  A hammer chart pattern is a popular technical indicator that is used in candlestick charting. The hammer appears when a stock tumbles during the day, but then finds strength at some point in the session to close near or above its opening price. This forms a candlestick that resembles a hammer, and it can suggest that the market has found a low point in the stock, and that better days are ahead.  Other Factors  Plus, earnings estimates have been rising for this company, even despite the sluggish trading lately. In just the past 60 days alone 1 estimate has gone higher, compared to none lower, while the consensus estimate has also moved in the right direction. Estimates have actually risen so much that the stock now has a Zacks Rank #2 (Buy) suggesting this relatively unloved stock could be due for a breakout soon. This will be especially true if TRVN stock can build momentum from here and find a way to continue higher of off this encouraging trading development. You can see   the complete list of today's Zacks #1 Rank (Strong   Buy) stocks here   .  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Trevena, Inc. (TRVN): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Trevena, Inc. TRVN  has    been struggling lately, but the selling pressure may be coming to an end soon. That is because TRVN recently saw a Hammer Chart Pattern which can signal that the stock is nearing a bottom.",
    " What is a Hammer Chart Pattern? ",
    "A hammer chart pattern is a popular technical indicator that is used in candlestick charting. The hammer appears when a stock tumbles during the day, but then finds strength at some point in the session to close near or above its opening price. This forms a candlestick that resembles a hammer, and it can suggest that the market has found a low point in the stock, and that better days are ahead.",
    " Other Factors ",
    "Plus, earnings estimates have been rising for this company, even despite the sluggish trading lately. In just the past 60 days alone 1 estimate has gone higher, compared to none lower, while the consensus estimate has also moved in the right direction.",
    "Estimates have actually risen so much that the stock now has a Zacks Rank #2 (Buy) suggesting this relatively unloved stock could be due for a breakout soon. This will be especially true if TRVN stock can build momentum from here and find a way to continue higher of off this encouraging trading development. You can see   the complete list of today's Zacks #1 Rank (Strong   Buy) stocks here   .",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 07:41:00"
}