{
  "url": "https://www.nasdaq.com/article/forexeuro-dips-to-oneweek-low-before-ecb-meeting-20190911-00518",
  "title": "FOREX-Euro dips to one-week low before ECB meeting - Nasdaq.com",
  "text": [
    "    * ECB meeting on Thursday in focus",
    "* Yen weakens on U.S.-China trade optimism",
    "* U.S. producer prices rose in August (Updates prices to U.S. afternoon)",
    "NEW YORK, Sept 11 (Reuters) - The euro fell to a one-weeklow against the greenback on Wednesday, a day before theEuropean Central Bank is expected to add further stimulus in abid to boost the region's economy.",
    "ECB policymakers are leaning toward a package that includesa rate cut, a beefed-up pledge to keep rates low for longer andcompensation for banks over the side-effects of negative rates,five sources familiar with the discussion said last week.",
    "Many also favor restarting asset buys, but opposition fromsome northern European countries is complicating this issue. urn:newsml:reuters.com:*:nL3N25U2YQ",
    "\"The mere thought of easing is probably keeping the euro onthe defensive at the moment,\" said Shaun Osborne, chief currencystrategist at Scotiabank in Toronto. However, \"we're notcompletely on side with expectations of an aggressive ease… wethink there may be a rebound in the euro after the policymeeting tomorrow.\"",
    "The euro EUR= fell 0.34% on the day to $1.1006.",
    "The yen was the weakest since Aug. 1 as optimism overU.S.-China trade talks boosted risk sentiment and reduced demandfor safe havens.",
    "China announced its first batch of tariff exemptions for 16types of U.S. products, days ahead of a planned meeting betweenthe two countries to try and de-escalate their bruising tarifffight. urn:newsml:reuters.com:*:nL3N2621DV",
    "The dollar gained 0.22% to 107.77 yenJPY= . ",
    "Sterling also dipped after a Scottish court ruled onWednesday that Prime Minister Boris Johnson's suspension of theBritish Parliament was unlawful, prompting immediate calls forlawmakers to return to work as the government and Parliamentbattle over the future of Brexit. urn:newsml:reuters.com:*:nL5N2620Z5",
    "The British pound GBP= fell 0.19% to $1.2323.",
    "U.S. data on Wednesday showed that U.S. producer pricesunexpectedly rose in August and underlying producer pricesrebounded, but that data will not change financial marketexpectations that the Federal Reserve will cut interest ratesagain next week to support a slowing economy. urn:newsml:reuters.com:*:nLNSBKEFA6",
    "This week's major economic focus will be consumer priceinflation data on Thursday and retail sales data on Friday.",
    "========================================================",
    "Currency bid prices at 3:00PM (1900 GMT) Description      RIC         Last           U.S. Close  Pct Change     YTD Pct     High Bid    Low Bid",
    "                                          Previous                   Change                 ",
    "                                          Session                                            Euro/Dollar      EUR=        $1.1006$1.1043     -0.34%         -4.04%      +1.1055     +1.0986 Dollar/Yen       JPY=        107.7700       107.5300    +0.22%         -2.25%      +107.8400   +107.5100 Euro/Yen         EURJPY=     118.62         118.75      -0.11%         -6.02%      +119.1700   +118.3100 Dollar/Swiss     CHF=        0.9927         0.9919      +0.08%         +1.18%      +0.9943     +0.9913 Sterling/Dollar  GBP=        1.2323         1.2346      -0.19%         -3.40%      +1.2370     +1.2314 Dollar/Canadian  CAD=        1.3191         1.3149      +0.32%         -3.27%      +1.3213     +1.3140 Australian/Doll  AUD=        0.6860         0.6859      +0.01%         -2.68%      +0.6884     +0.6849 ar                                                                                              Euro/Swiss       EURCHF=     1.0929         1.0953      -0.22%         -2.89%      +1.0970     +1.0911 Euro/Sterling    EURGBP=     0.8930         0.8939      -0.10%         -0.60%      +0.8951     +0.8906 NZ               NZD=        0.6410         0.6423      -0.20%         -4.57%      +0.6439     +0.6408 Dollar/Dollar                                                                                   Dollar/Norway    NOK=        8.9648         8.9543      +0.12%         +3.77%      +8.9827     +8.9393 Euro/Norway      EURNOK=     9.8670         9.8878      -0.21%         -0.39%      +9.9013     +9.8620 Dollar/Sweden    SEK=        9.6798         9.6839      -0.36%         +7.99%      +9.7056     +9.6649 Euro/Sweden      EURSEK=     10.6553        10.6940     -0.36%         +3.81%      +10.6987    +10.6506",
    " (Reporting by Karen Brettell; Editing by Andrea Ricci and DanGrebler) ((Karen.Brettell@thomsonreuters.com; +1 646 223 6274; ReutersMessaging: karen.brettell.reuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-11 09:49:00"
}