{
  "url": "https://www.nasdaq.com/article/china-us-to-hold-trade-talks-in-oct-beijing-says-phone-call-went-well-20190905-00134",
  "title": "China, U.S. to hold trade talks in Oct; Beijing says phone call went well - Nasdaq.com",
  "text": [
    "BEIJING, Sept 5 (Reuters) - China and the United States on Thursday agreed to hold high-level trade talks in early October in Washington, amid fears that an escalating trade war could trigger a global economic recession.",
    "The talks were agreed to in a phone call between Chinese Vice Premier Liu He and U.S. Trade Representative Robert Lighthizer and U.S. Treasury Secretary Steven Mnuchin, China's commerce ministry said in a statement on its website. China's central bank governor Yi Gang was also on the call.",
    "\"Both sides agreed that they should work together and take practical actions to create good conditions for consultations,\" the ministry said.",
    "Gao also said Beijing opposes any escalation in the trade war. ",
    "Trade teams from the two countries will hold talks in mid-September before the high-level talks next month, the ministry said.",
    "A spokesman for the U.S. Trade Representative's office confirmed that Lighthizer and Mnuchin spoke with Liu and said they agreed to hold ministerial-level trade talks in Washington \"in the coming weeks\". ",
    "News of the early October talks lifted most Asian share markets on Thursday, raising hopes these can de-escalate the U.S.-China trade war before it inflicts further damage on the global economy. ",
    "On Sunday, Washington began imposing 15% tariffs on an array of Chinese imports, while China began placing duties on U.S. crude oil. China said on Monday it had lodged a complaint against the United States at the World Trade Organization. ",
    "The United States plans to increase the tariff rate to 30% from the 25% duty already in place on $250 billion worth of Chinese imports from Oct. 1.",
    "U.S. President Donald Trump had warned on Tuesday he would be tougher on Beijing in a second term if trade talks dragged on, compounding market fears that disputes between the United States and China could trigger a U.S. recession. ",
    "Chinese leaders will have a packed schedule next month, gearing up for National Day celebrations scheduled for Oct. 1.",
    "They will also hold a key meeting in October to discuss improving governance and \"perfecting\" the country's socialist system, state media has said. "
  ],
  "published_datetime": "2019-09-05 04:33:00"
}