{
  "url": "https://www.nasdaq.com/article/new-strong-buy-stocks-for-september-5th-cm1208149",
  "title": "New Strong Buy Stocks for September 5th - Nasdaq.com",
  "text": [
    "Here are 5 stocks added to the Zacks Rank #1 (Strong Buy) List today:",
    "Cumberland Pharmaceuticals Inc. (CPIX): This specialty pharmaceutical company has seen the Zacks Consensus Estimate for its current year earnings increasing 8.1% over the last 60 days.",
    "Cumberland Pharmaceuticals Inc. Price and Consensus",
    "Cumberland Pharmaceuticals Inc. price-consensus-chart | Cumberland Pharmaceuticals Inc. Quote",
    "Great Lakes Dredge & Dock Corporation (GLDD): This company that provides dredging services has seen the Zacks Consensus Estimate for its current year earnings increasing 8.8% over the last 60 days.",
    "Great Lakes Dredge & Dock Corporation Price and Consensus",
    "Great Lakes Dredge & Dock Corporation price-consensus-chart | Great Lakes Dredge & Dock Corporation Quote",
    "SPX Corporation (SPXC): This company that supplies infrastructure equipment has seen the Zacks Consensus Estimate for its current year earnings increasing 3.8% over the last 60 days.",
    "SPX Corporation Price and Consensus",
    "SPX Corporation price-consensus-chart | SPX Corporation Quote",
    "Zumiez Inc. (ZUMZ): This specialty retailer of apparel, footwear, accessories and hardgoods has seen the Zacks Consensus Estimate for its current year earnings increasing 0.5% over the last 60 days.",
    "Zumiez Inc. Price and Consensus",
    "Zumiez Inc. price-consensus-chart | Zumiez Inc. Quote",
    "NIC Inc. (EGOV): This company that provides digital government services has seen the Zacks Consensus Estimate for its current year earnings increasing 2.7% over the last 60 days.",
    "NIC Inc. Price and Consensus",
    "NIC Inc. price-consensus-chart | NIC Inc. Quote",
    "You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here",
    "It's Illegal in 42 States, But Investors Will Make Billions Legally",
    "In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year. That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:38:00"
}