{
  "url": "https://www.nasdaq.com/article/why-inmode-shares-surged-129-today-cm1207563",
  "title": "Why InMode Shares Surged 12.9% Today - Nasdaq.com",
  "text": [
    " What happened After industry watchers at Wall Street research firms unveiled   bullish ratings, shares of   InMode    (NASDAQ: INMD)  jumped 12.9% on Wednesday.  So what  The medical device company markets equipment to harness RF   frequencies to perform medical aesthetic and women's health   procedures, including body contouring. It has been on a tear   since it r   eported     strong top- and bottom-line second-quarter financials on   Aug. 13, shortly after its initial public offering (IPO) on Aug.   8.   Image source: Getty Images.makeArticleAd();  In Q2, InMode's revenue grew 54.6% year over year to $38.8   million while its earnings per share under generally accepted   accounting principles (   GAAP    ) increased to $0.45 from $0.21 per diluted share a year earlier.   At the time, management cited an expansion of its direct   sales team, higher average selling prices, and an increase in the   number of clinical workshops as reasons for its strong revenue   performance. The earnings strength was driven by a gain of 3 percentage   points year over year in gross margin to 87% because of higher   selling prices, and a 10% improvement in operating margin driven   by sales growing faster than expenses. The strong results appear to have impressed industry watchers   who are picking up coverage in the company now that its quiet   period is over. This week, Canaccord Genuity and UBS rated it a   buy with $30 and $28 price targets, respectively. Baird rated it   at outperform, and Barclays rated it overweight. Both of those   investment firms set a $27 price target.  Now what  Investors should remember that Barclays Capital and UBS   Investment Bank acted as representatives of the underwriters and   joint book-running managers for InMode's IPO. Also, Canaccord   Genuity was the IPO's lead manager and Robert W. Baird & Co.   was co-manager. Nevertheless, the new ratings do shine   additional light on the company, which could ultimately result in   shares being added to their institutional research clients'   portfolios. Demand for InMode's devices, which are used in various   indications including aesthetic procedures, appears robust. Given   the company is already profitable, doesn't carry any long-term   debt, and had nearly $83 million in cash and securities exiting   last quarter, this healthcare stock is one to watch.   10 stocks we like better than InMode Ltd.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and InMode Ltd. wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Todd Campbell      has no position in any of the stocks mentioned.  His clients may have positions in the companies     mentioned.  The Motley Fool has no position in any of the stocks     mentioned. The Motley Fool has a     disclosure policy      .  ",
    "After industry watchers at Wall Street research firms unveiled   bullish ratings, shares of   InMode    (NASDAQ: INMD)  jumped 12.9% on Wednesday.",
    "The medical device company markets equipment to harness RF   frequencies to perform medical aesthetic and women's health   procedures, including body contouring. It has been on a tear   since it r   eported     strong top- and bottom-line second-quarter financials on   Aug. 13, shortly after its initial public offering (IPO) on Aug.   8.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "In Q2, InMode's revenue grew 54.6% year over year to $38.8   million while its earnings per share under generally accepted   accounting principles (   GAAP    ) increased to $0.45 from $0.21 per diluted share a year earlier.   At the time, management cited an expansion of its direct   sales team, higher average selling prices, and an increase in the   number of clinical workshops as reasons for its strong revenue   performance.",
    "The earnings strength was driven by a gain of 3 percentage   points year over year in gross margin to 87% because of higher   selling prices, and a 10% improvement in operating margin driven   by sales growing faster than expenses.",
    "The strong results appear to have impressed industry watchers   who are picking up coverage in the company now that its quiet   period is over. This week, Canaccord Genuity and UBS rated it a   buy with $30 and $28 price targets, respectively. Baird rated it   at outperform, and Barclays rated it overweight. Both of those   investment firms set a $27 price target.",
    "Investors should remember that Barclays Capital and UBS   Investment Bank acted as representatives of the underwriters and   joint book-running managers for InMode's IPO. Also, Canaccord   Genuity was the IPO's lead manager and Robert W. Baird & Co.   was co-manager. Nevertheless, the new ratings do shine   additional light on the company, which could ultimately result in   shares being added to their institutional research clients'   portfolios.",
    "Demand for InMode's devices, which are used in various   indications including aesthetic procedures, appears robust. Given   the company is already profitable, doesn't carry any long-term   debt, and had nearly $83 million in cash and securities exiting   last quarter, this healthcare stock is one to watch.",
    "  10 stocks we like better than InMode Ltd.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and InMode Ltd. wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than InMode Ltd.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and InMode Ltd. wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Todd Campbell      has no position in any of the stocks mentioned.  His clients may have positions in the companies     mentioned.  The Motley Fool has no position in any of the stocks     mentioned. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 04:01:00"
}