{
  "url": "https://www.nasdaq.com/article/heres-proof-that-amazon-is-concerned-about-roku-cm1210687",
  "title": "Here's Proof That Amazon Is Concerned About Roku - Nasdaq.com",
  "text": [
    " It seems that   Amazon.com    (NASDAQ: AMZN) has the Midas touch -- almost every area the   company enters turns to profits. In addition to its flagship   e-commerce store and sprawling logistics and delivery operations,   the company has its tentacles in a variety of other areas,   including physical retail, streaming video,   business-to-business sales    ,   cloud computing    , and   digital advertising    -- to name just a few. One of the more unlikely challenges to Amazon's dominance has   come from   Roku    (NASDAQ: ROKU) . The streaming pioneer got its start peddling   set-top boxes and streaming dongles, but it was the company's   connected-TV operating system (OS) -- which it licenses to all   comers -- that gave Roku an edge in the streaming wars. Amazon isn't taking the competition lying down, debuting a   number of new devices and a further expansion into Europe   designed to stop Roku in its tracks.makeArticleAd();   The JVC Fire TV Edition Smart 4K HDR LED TV. Image source:     Amazon.  The best defense is a good offense Amazon announced last week that it had entered into a number   of collaborations with global retailers and television brands to   bring a lineup of more than 20 new Fire TV Edition devices to   customers in Europe and North America. At the IFA 2019 Consumer Electronics Fair in Berlin, Amazon   introduced a host of new streaming devices, including the   next-generation Fire TV Cube and a Fire TV Edition soundbar, as   well as Fire TV Edition smart TVs from Toshiba, JVC, and   Grundig. Amazon is also collaborating with other top foreign television   manufacturers like Skyworth, Arcelik, ok, and Compal to deliver   what it calls a \"broad lineup of Fire TV Edition smart TVs\" to   potential customers. Amazon said that the Fire TV Stick, Fire TV Stick 4K, and the   Alexa Voice Remote with device control are now available for   purchase in France, Italy, and Spain, with special introductory   pricing on the devices. Strike while the iron is hot During the company's recent Prime Day sale in July, Amazon   said that Fire TV had \"its biggest sales event ever,\" and that   the Fire TV Stick and Fire TV Stick 4K were two of the   top-selling deals worldwide and two of the top three deals in the   United Kingdom and Germany. The company also said the Fire TV   Basic Edition was one of the top three best-selling deals in   France, Italy, and Spain. \"This marks the biggest announcement for Fire TV to date, with   more than 20 new Fire TV products available across North America   and Europe,\" said Marc Whitten, vice president for Fire TV. \"It's   still just day one for Fire TV as we work to make customers'   entertainment experience easier, more magical, and more   enjoyable.\"   Marc Whitten, Amazon's vice president for Fire TV, on stage     at the IFA 2019 Consumer Electronics Fair in Berlin this month.     Image source: Amazon.  David vs. Goliath In perhaps the biggest news, Amazon revealed that Fire TV   devices boasted 37 million active users worldwide -- blowing past   Roku's 30.5 million active accounts. This isn't entirely an   apples-to-apples comparison, however, as the e-commerce giant   didn't provide a breakdown of its domestic and international   metrics. It's worth noting that many independen   t report    s show Amazon trailing Roku in the U.S. market. A report   from eMarketer showed Roku commanded a 44% share of the domestic   market for internet TV devices, outpacing Amazon's Fire TV, which   had 33%. And in its   second-quarter financial report    , Roku cited data from Parks Associates that found that Roku   controlled 39% of the installed base of streaming media players   in the U.S., compared with just 30% for Amazon. This data is supported by Strategy Analytics, which reported   that Roku was the No. 1 streaming TV platform in the U.S.,   powering 41 million over-the-top devices and smart TVs. Roku   also said that one in three smart TVs sold in the U.S. during the   first half of the year was a Roku TV. Beating Amazon at its own game While the numbers may differ, the clear takeaway is that   Amazon trails Roku in the U.S. in streaming media players. Roku   is working overtime to extend its domestic lead -- making it one   of the few rivals that has been able to take on Amazon   head-to-head and win. This is reflected in Roku's stock price,   which has gained more than 400% so far in 2019, making it among   the best-performing   tech stocks    out there. Amazon is no doubt keenly aware of this, and is making a   pre-emptory move in Europe in an effort to slow Roku's surging   momentum.   10 stocks we like better than Amazon       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amazon wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors.     Danny Vena      owns shares of Amazon and Roku. The Motley Fool owns shares of     and recommends Amazon and Roku. The Motley Fool has a     disclosure policy      .  ",
    "It seems that   Amazon.com    (NASDAQ: AMZN) has the Midas touch -- almost every area the   company enters turns to profits. In addition to its flagship   e-commerce store and sprawling logistics and delivery operations,   the company has its tentacles in a variety of other areas,   including physical retail, streaming video,   business-to-business sales    ,   cloud computing    , and   digital advertising    -- to name just a few.",
    "One of the more unlikely challenges to Amazon's dominance has   come from   Roku    (NASDAQ: ROKU) . The streaming pioneer got its start peddling   set-top boxes and streaming dongles, but it was the company's   connected-TV operating system (OS) -- which it licenses to all   comers -- that gave Roku an edge in the streaming wars.",
    "Amazon isn't taking the competition lying down, debuting a   number of new devices and a further expansion into Europe   designed to stop Roku in its tracks.",
    "  The JVC Fire TV Edition Smart 4K HDR LED TV. Image source:     Amazon. ",
    "The JVC Fire TV Edition Smart 4K HDR LED TV. Image source:     Amazon.",
    "Amazon announced last week that it had entered into a number   of collaborations with global retailers and television brands to   bring a lineup of more than 20 new Fire TV Edition devices to   customers in Europe and North America.",
    "At the IFA 2019 Consumer Electronics Fair in Berlin, Amazon   introduced a host of new streaming devices, including the   next-generation Fire TV Cube and a Fire TV Edition soundbar, as   well as Fire TV Edition smart TVs from Toshiba, JVC, and   Grundig.",
    "Amazon is also collaborating with other top foreign television   manufacturers like Skyworth, Arcelik, ok, and Compal to deliver   what it calls a \"broad lineup of Fire TV Edition smart TVs\" to   potential customers.",
    "Amazon said that the Fire TV Stick, Fire TV Stick 4K, and the   Alexa Voice Remote with device control are now available for   purchase in France, Italy, and Spain, with special introductory   pricing on the devices.",
    "During the company's recent Prime Day sale in July, Amazon   said that Fire TV had \"its biggest sales event ever,\" and that   the Fire TV Stick and Fire TV Stick 4K were two of the   top-selling deals worldwide and two of the top three deals in the   United Kingdom and Germany. The company also said the Fire TV   Basic Edition was one of the top three best-selling deals in   France, Italy, and Spain.",
    "\"This marks the biggest announcement for Fire TV to date, with   more than 20 new Fire TV products available across North America   and Europe,\" said Marc Whitten, vice president for Fire TV. \"It's   still just day one for Fire TV as we work to make customers'   entertainment experience easier, more magical, and more   enjoyable.\"",
    "  Marc Whitten, Amazon's vice president for Fire TV, on stage     at the IFA 2019 Consumer Electronics Fair in Berlin this month.     Image source: Amazon. ",
    "Marc Whitten, Amazon's vice president for Fire TV, on stage     at the IFA 2019 Consumer Electronics Fair in Berlin this month.     Image source: Amazon.",
    "In perhaps the biggest news, Amazon revealed that Fire TV   devices boasted 37 million active users worldwide -- blowing past   Roku's 30.5 million active accounts. This isn't entirely an   apples-to-apples comparison, however, as the e-commerce giant   didn't provide a breakdown of its domestic and international   metrics.",
    "It's worth noting that many independen   t report    s show Amazon trailing Roku in the U.S. market. A report   from eMarketer showed Roku commanded a 44% share of the domestic   market for internet TV devices, outpacing Amazon's Fire TV, which   had 33%.",
    "And in its   second-quarter financial report    , Roku cited data from Parks Associates that found that Roku   controlled 39% of the installed base of streaming media players   in the U.S., compared with just 30% for Amazon.",
    "This data is supported by Strategy Analytics, which reported   that Roku was the No. 1 streaming TV platform in the U.S.,   powering 41 million over-the-top devices and smart TVs. Roku   also said that one in three smart TVs sold in the U.S. during the   first half of the year was a Roku TV.",
    "While the numbers may differ, the clear takeaway is that   Amazon trails Roku in the U.S. in streaming media players. Roku   is working overtime to extend its domestic lead -- making it one   of the few rivals that has been able to take on Amazon   head-to-head and win. This is reflected in Roku's stock price,   which has gained more than 400% so far in 2019, making it among   the best-performing   tech stocks    out there.",
    "Amazon is no doubt keenly aware of this, and is making a   pre-emptory move in Europe in an effort to slow Roku's surging   momentum.",
    "  10 stocks we like better than Amazon       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amazon wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Amazon       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amazon wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors.     Danny Vena      owns shares of Amazon and Roku. The Motley Fool owns shares of     and recommends Amazon and Roku. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:00:00"
}