{
  "url": "https://www.nasdaq.com/article/mgm-resorts-sues-federal-government-over-tribal-casino-proposal-cm1207655",
  "title": "MGM Resorts Sues Federal Government Over Tribal Casino Proposal - Nasdaq.com",
  "text": [
    "  MGM Resorts    (NYSE: MGM) seems like it's on a quixotic campaign to prevent the   Mashantucket Pequot and Mohegan Indian tribes from opening a new   casino in East Windsor, Connecticut. Because the new resort would   be sited close to MGM's own Springfield, Massachusetts, casino,   this may seem a purely self-interested action on the surface, but   the situation really is more complicated. While it's true that MGM fears losing revenue to a new casino,   particularly because its Springfield location is struggling   following   Wynn Resorts    '   opening of its Boston resort    , the casino operator still has a good case that protocols   weren't followed and Connecticut is pressing its finger hard on   the scale in favor of the tribes. In a new challenge to the tribes' casino ambitions, MGM is   suing the federal government for allowing the project to   proceed.makeArticleAd();   An artist's rendering of the MGM Springfield Hotel and     Resort. Image source: MGM Resorts.  Parting ways MGM and the tribes haven't always been at loggerheads. Under a   1991 agreement, the two tribes were given exclusive rights to   operate casinos on tribal lands in exchange for Connecticut   collecting a 25% cut of slot machine revenue, and in 2006,   MGM and the Pequots partnered at Foxwoods Resort in Connecticut.   But in 2013, as the two separately sought expansion in   Massachusetts -- MGM in Springfield and the tribe in the greater   Boston area of Milford -- they dissolved their license   agreement. MGM ended up winning its Springfield casino bid at a spot   located less than 80 miles from Foxwoods, while the Pequot tribe   lost its bid to Wynn, which recently opened its Encore Boston   resort after much delay. As more casino gambling sprouted up in neighboring states like   New York and Rhode Island, siphoning away revenue from Foxwoods   and the Mohegan tribe's Mohegan Sun casino in Uncasville,   Connecticut, the tribes sought to expand further in the   state. Awarding exclusive deals Because Connecticut was wary of losing the lucrative pact with   the tribes to split their slot machine profits -- the deal stays   in place only so long as the tribes are the state's sole gaming   operators -- the legislature sought to give them special   privileges. For instance, it granted the tribes a no-bid contract allowing   them to develop a commercial casino off tribal lands in East   Windsor, located just 12 miles from MGM's Springfield property,   and proposed giving the tribes the right to develop another   resort in Bridgeport. It also sought to let them operate the   state's online gambling and sports betting operations, both of   which would be simultaneously legalized. Legal challenges galore Needless to say, MGM Resorts, which also wanted to expand into   Connecticut, was upset and sued the state, arguing the original   pact the tribes had for their resorts didn't give them the right   to also be granted no-bid contracts elsewhere in the   state. It said barring other commercial interests from   competing for contracts violated the U.S. Constitution's equal   protection and commerce clauses, though both a state court and a   federal appeals court rejected MGM's suit. Meanwhile, the East Windsor deal was conditioned upon the U.S.   Interior Department accepting the new agreement,   but Interior reportedly slow-walked a decision. The tribes sued the federal government, alleging MGM was   lobbying U.S. Interior Secretary Ryan Zinke to hold up the deal.   It was only after Zinke resigned last December that the   department approved the deal. Billions of dollars at stake Now, MGM Resorts is suing the Interior Department as well as   the Bureau of Indian Affairs, which is charged with implementing   the federal Indian Gaming Regulatory Act, saying approval of   the expansion agreement violates federal rules. The lawsuit   states that the changes to Connecticut's original agreement with   the tribes \"confer a statewide, perpetual competitive advantage\"   over other gaming operators such as MGM, which is unlawful. The casino operator would seem to have a good case that at   every turn, Connecticut has favored the Pequot and Mohegan tribes   by excluding anyone else from participating in developing a   casino so it could preserve the 25% cut from slot machines. The   Indian casinos have contributed some $8 billion to the state's   coffers since they began operating. MGM's legal challenge will tie up the expansion efforts for   years, giving the casino operator a chance to get its Springfield   resort back on track. But whether the federal courts will see the   argument any differently than other courts have remains a   crapshoot.   10 stocks we like better than MGM Resorts     International       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and MGM Resorts International     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Rich Duprey      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    " MGM Resorts    (NYSE: MGM) seems like it's on a quixotic campaign to prevent the   Mashantucket Pequot and Mohegan Indian tribes from opening a new   casino in East Windsor, Connecticut. Because the new resort would   be sited close to MGM's own Springfield, Massachusetts, casino,   this may seem a purely self-interested action on the surface, but   the situation really is more complicated.",
    "While it's true that MGM fears losing revenue to a new casino,   particularly because its Springfield location is struggling   following   Wynn Resorts    '   opening of its Boston resort    , the casino operator still has a good case that protocols   weren't followed and Connecticut is pressing its finger hard on   the scale in favor of the tribes.",
    "In a new challenge to the tribes' casino ambitions, MGM is   suing the federal government for allowing the project to   proceed.",
    "  An artist's rendering of the MGM Springfield Hotel and     Resort. Image source: MGM Resorts. ",
    "An artist's rendering of the MGM Springfield Hotel and     Resort. Image source: MGM Resorts.",
    "MGM and the tribes haven't always been at loggerheads. Under a   1991 agreement, the two tribes were given exclusive rights to   operate casinos on tribal lands in exchange for Connecticut   collecting a 25% cut of slot machine revenue, and in 2006,   MGM and the Pequots partnered at Foxwoods Resort in Connecticut.   But in 2013, as the two separately sought expansion in   Massachusetts -- MGM in Springfield and the tribe in the greater   Boston area of Milford -- they dissolved their license   agreement.",
    "MGM ended up winning its Springfield casino bid at a spot   located less than 80 miles from Foxwoods, while the Pequot tribe   lost its bid to Wynn, which recently opened its Encore Boston   resort after much delay.",
    "As more casino gambling sprouted up in neighboring states like   New York and Rhode Island, siphoning away revenue from Foxwoods   and the Mohegan tribe's Mohegan Sun casino in Uncasville,   Connecticut, the tribes sought to expand further in the   state.",
    "Because Connecticut was wary of losing the lucrative pact with   the tribes to split their slot machine profits -- the deal stays   in place only so long as the tribes are the state's sole gaming   operators -- the legislature sought to give them special   privileges.",
    "For instance, it granted the tribes a no-bid contract allowing   them to develop a commercial casino off tribal lands in East   Windsor, located just 12 miles from MGM's Springfield property,   and proposed giving the tribes the right to develop another   resort in Bridgeport. It also sought to let them operate the   state's online gambling and sports betting operations, both of   which would be simultaneously legalized.",
    "Needless to say, MGM Resorts, which also wanted to expand into   Connecticut, was upset and sued the state, arguing the original   pact the tribes had for their resorts didn't give them the right   to also be granted no-bid contracts elsewhere in the   state. It said barring other commercial interests from   competing for contracts violated the U.S. Constitution's equal   protection and commerce clauses, though both a state court and a   federal appeals court rejected MGM's suit.",
    "Meanwhile, the East Windsor deal was conditioned upon the U.S.   Interior Department accepting the new agreement,   but Interior reportedly slow-walked a decision.",
    "The tribes sued the federal government, alleging MGM was   lobbying U.S. Interior Secretary Ryan Zinke to hold up the deal.   It was only after Zinke resigned last December that the   department approved the deal.",
    "Now, MGM Resorts is suing the Interior Department as well as   the Bureau of Indian Affairs, which is charged with implementing   the federal Indian Gaming Regulatory Act, saying approval of   the expansion agreement violates federal rules. The lawsuit   states that the changes to Connecticut's original agreement with   the tribes \"confer a statewide, perpetual competitive advantage\"   over other gaming operators such as MGM, which is unlawful.",
    "The casino operator would seem to have a good case that at   every turn, Connecticut has favored the Pequot and Mohegan tribes   by excluding anyone else from participating in developing a   casino so it could preserve the 25% cut from slot machines. The   Indian casinos have contributed some $8 billion to the state's   coffers since they began operating.",
    "MGM's legal challenge will tie up the expansion efforts for   years, giving the casino operator a chance to get its Springfield   resort back on track. But whether the federal courts will see the   argument any differently than other courts have remains a   crapshoot.",
    "  10 stocks we like better than MGM Resorts     International       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and MGM Resorts International     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than MGM Resorts     International       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and MGM Resorts International     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Rich Duprey      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 07:33:00"
}