{
  "url": "https://www.nasdaq.com/article/is-global-x-superdividend-us-etf-div-a-strong-etf-right-now-cm1207330",
  "title": "Is Global X SuperDividend U.S. ETF (DIV) a Strong ETF Right Now? - Nasdaq.com",
  "text": [
    " Launched on 03/11/2013, the Global X SuperDividend U.S. ETF (DIV) is a smart beta exchange traded fund offering broad exposure to the Style Box - All Cap Value category of the market.  What Are Smart Beta ETFs?  The ETF industry has long been dominated by products based on market cap weighted indexes, a strategy created to reflect the market or a particular market segment. A good option for investors who believe in market efficiency, market cap weighted indexes offer a low-cost, convenient, and transparent way of replicating market returns. If you're the kind of investor who would rather try and beat the market through good stock selection, then smart beta funds are your best choice; this fund class is known for tracking non-cap weighted strategies. These indexes attempt to select stocks that have better chances of risk-return performance, based on certain fundamental characteristics or a combination of such characteristics. This area offers many different investment choices, such as simplest equal-weighting, fundamental weighting and volatility/momentum based weighting methodologies; however, not all of these strategies can deliver superior results.  Fund Sponsor & Index  The fund is managed by Global X Management, and has been able to amass over $508.73 M, which makes it one of the largest ETFs in the Style Box - All Cap Value. DIV, before fees and expenses, seeks to match the performance of the INDXX SuperDividend U.S. Low Volatility Index. The INDXX SuperDividend US Low Volatility Index tracks the performance of 50 equally weighted common stocks, MLPs & REITs that rank among the highes t dividend yield  ing equity securities in the US.  Cost & Other Expenses  Cost is an important factor in selecting the right ETF, and cheaper funds can significantly outperform their more expensive cousins if all other fundamentals are the same. Operating expenses on an annual basis are 0.45% for this ETF, which makes it on par with most peer products in the space. It's 12-month trailing dividend yield comes in at 7.59%.  Sector Exposure and Top Holdings  ETFs offer diversified exposure and thus minimize single stock risk, but it is still important to delve into a fund's holdings before investing. Most ETFs are very transparent products and many disclose their holdings on a daily basis. Looking at individual holdings, Pattern Ener -A accounts for about 2.68% of total assets, followed by Compass Diversif and Southern Co/the. The top 10 holdings account for about 24.48% of total assets under management.  Performance and Risk  The ETF has added roughly 5.28% and is down about -3.83% so far this year and in the past one year (as of 09/04/2019), respectively. DIV has traded between $21.69 and $25.50 during this last 52-week period. The ETF has a beta of 0.60 and standard deviation of 9.46% for the trailing three-year period, making it a medium risk choice in the space. With about 51 holdings, it effectively diversifies company-specific risk.  Alternatives  Global X SuperDividend U.S. ETF is a reasonable option for investors seeking to outperform the Style Box - All Cap Value segment of the market. However, there are other ETFs in the space which investors could consider. WBI Power Factor High Dividend ETF (WBIY) tracks Solactive Power Factor High Dividend Index and the Global X SuperDividend ETF (SDIV) tracks Solactive Global SuperDividend Index. WBI Power Factor High Dividend ETF has $90.88 M in assets, Global X SuperDividend ETF has $882.07 M. WBIY has an expense ratio of 0.70% and SDIV charges 0.58%. Investors looking for cheaper and lower-risk options should consider traditional market cap weighted ETFs that aim to match the returns of the Style Box - All Cap Value.  Bottom Line  To learn more about this product and other ETFs, screen for products that match your investment objectives and read articles on latest developments in the ETF investing universe, please visit Zacks ETF Center  .   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Global X SuperDividend U.S. ETF (DIV): ETF Research Reports   Global X SuperDividend ETF (SDIV): ETF Research Reports   WBI Power Factor High Dividend ETF (WBIY): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Launched on 03/11/2013, the Global X SuperDividend U.S. ETF (DIV) is a smart beta exchange traded fund offering broad exposure to the Style Box - All Cap Value category of the market.",
    " What Are Smart Beta ETFs? ",
    "The ETF industry has long been dominated by products based on market cap weighted indexes, a strategy created to reflect the market or a particular market segment.",
    "A good option for investors who believe in market efficiency, market cap weighted indexes offer a low-cost, convenient, and transparent way of replicating market returns.",
    "If you're the kind of investor who would rather try and beat the market through good stock selection, then smart beta funds are your best choice; this fund class is known for tracking non-cap weighted strategies.",
    "These indexes attempt to select stocks that have better chances of risk-return performance, based on certain fundamental characteristics or a combination of such characteristics.",
    "This area offers many different investment choices, such as simplest equal-weighting, fundamental weighting and volatility/momentum based weighting methodologies; however, not all of these strategies can deliver superior results.",
    " Fund Sponsor & Index ",
    "The fund is managed by Global X Management, and has been able to amass over $508.73 M, which makes it one of the largest ETFs in the Style Box - All Cap Value. DIV, before fees and expenses, seeks to match the performance of the INDXX SuperDividend U.S. Low Volatility Index.",
    "The INDXX SuperDividend US Low Volatility Index tracks the performance of 50 equally weighted common stocks, MLPs & REITs that rank among the highes t dividend yield  ing equity securities in the US.",
    " Cost & Other Expenses ",
    "Cost is an important factor in selecting the right ETF, and cheaper funds can significantly outperform their more expensive cousins if all other fundamentals are the same.",
    "Operating expenses on an annual basis are 0.45% for this ETF, which makes it on par with most peer products in the space.",
    "It's 12-month trailing dividend yield comes in at 7.59%.",
    " Sector Exposure and Top Holdings ",
    "ETFs offer diversified exposure and thus minimize single stock risk, but it is still important to delve into a fund's holdings before investing. Most ETFs are very transparent products and many disclose their holdings on a daily basis.",
    "Looking at individual holdings, Pattern Ener -A accounts for about 2.68% of total assets, followed by Compass Diversif and Southern Co/the.",
    "The top 10 holdings account for about 24.48% of total assets under management.",
    " Performance and Risk ",
    "The ETF has added roughly 5.28% and is down about -3.83% so far this year and in the past one year (as of 09/04/2019), respectively. DIV has traded between $21.69 and $25.50 during this last 52-week period.",
    "The ETF has a beta of 0.60 and standard deviation of 9.46% for the trailing three-year period, making it a medium risk choice in the space. With about 51 holdings, it effectively diversifies company-specific risk.",
    " Alternatives ",
    "Global X SuperDividend U.S. ETF is a reasonable option for investors seeking to outperform the Style Box - All Cap Value segment of the market. However, there are other ETFs in the space which investors could consider.",
    "WBI Power Factor High Dividend ETF (WBIY) tracks Solactive Power Factor High Dividend Index and the Global X SuperDividend ETF (SDIV) tracks Solactive Global SuperDividend Index. WBI Power Factor High Dividend ETF has $90.88 M in assets, Global X SuperDividend ETF has $882.07 M. WBIY has an expense ratio of 0.70% and SDIV charges 0.58%.",
    "Investors looking for cheaper and lower-risk options should consider traditional market cap weighted ETFs that aim to match the returns of the Style Box - All Cap Value.",
    " Bottom Line ",
    "To learn more about this product and other ETFs, screen for products that match your investment objectives and read articles on latest developments in the ETF investing universe, please visit Zacks ETF Center  .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:37:00"
}