{
  "url": "https://www.nasdaq.com/article/us-briefly-overtakes-saudi-arabia-as-top-oil-exporter--iea-20190912-00106",
  "title": "U.S. briefly overtakes Saudi Arabia as top oil exporter - IEA - Nasdaq.com",
  "text": [
    "By Noah Browning",
    "LONDON, Sept 12 (Reuters) - Global oil demand is weathering economic headwinds, the International Energy Agency (IEA) said on Thursday, buoyed by lower prices brought on by abundant supply as the United States briefly dethroned Saudi Arabia as the world's top exporter.",
    "\"With oil prices currently about 20% lower than a year ago, there will be support for consumers,\" the IEA said in its monthly report.",
    "The Paris-based agency maintained its estimate for growth in global oil demand during 2019 at 1.1 million bpd and 1.3 million bpd for next year, assuming no further breakdown in U.S.-China trade talks and citing an easing of tensions around Iran.",
    "A rebound in U.S. production following Hurricane Dorian along with steep output growth from Brazil and the North Sea were set to drive production from outside the Organization of the Petroleum Exporting Countries (OPEC) up sharply, it added.",
    "U.S. crude exports spiked to more than 3 million bpd in June, as Saudi Arabia cut output sharply and Russia grappled with contamination in one of its main export pipelines.",
    "Non-OPEC production growth is seen rising to 2.3 million bpd in 2020, up 400,000 from this year. Meanwhile, demand for OPEC crude is set to reach 28.3 million bpd in the first half of 2020, 1.4 million bpd less than the group produced in August.",
    "The discrepancy may prompt OPEC and its allies including Russia to revisit their production-curbing pact.",
    "\"The implied market balance (will be) returning to a significant surplus and placing pressure on prices,\" the IEA said. \"The challenge of market management remains a daunting one well into 2020.\"",
    "Russia, Iraq and Nigeria in August produced 600,000 bpd more than their quotas in the supply pact, the IEA said, but Saudi Arabia cut by more than it had pledged, keeping the overall agreement intact.",
    "OPEC member Iran continued to suffer under U.S. sanctions, with exports nearly halving month-on-month in August to just 200,000 bpd. A year earlier, they were at 2.1 million bpd."
  ],
  "published_datetime": "2019-09-12 04:02:00"
}