{
  "url": "https://www.nasdaq.com/article/bears-ease-grip-on-most-asian-currencies-as-trade-worries-ebb-20190912-00048",
  "title": "Bears ease grip on most Asian currencies as trade worries ebb - Nasdaq.com",
  "text": [
    "By Rashmi Ashok",
    "Sept 12 (Reuters) - Investors rolled back short positions on most Asian currencies over the past two weeks, a Reuters poll showed, as risk appetite picked up after the United States and China agreed to restart trade talks.",
    "News that the world's two largest economies would return to the negotiation table in early October was cheered by markets, with bearish bets on the Chinese yuan  being sharply unwound.",
    "The poll was closed on Wednesday, before a surprise announcement from U.S. President Donald Trump delaying scheduled tariff hikes on billions of dollars worth of Chinese goods. ",
    "Short positions in currencies of export-focused economies were also shaved, with sentiment towards the Korean won , the Taiwan dollar  and the Singapore dollar  improving the most, the poll of 15 respondents showed.",
    "This spot of relief comes as worries over cooling demand from the region's largest trading partner, China, has begun to ease.",
    "Meanwhile, bulls seized hold of the Indonesian rupiah  for the first time since early August, the poll found.",
    "A series of rate hikes last year has led to high real interest rates in the country, which helped to keep inflation in check and smoothed over currency volatility, attracting a large number of carry plays. ",
    "\"The central bank has done a good job in terms of stabilising the rupiah,\" said Sim Moh Siong, a FX strategist at Bank of Singapore.",
    "\"There is some silver lining in terms of the U.S.-China trade talks, and given that inflation is low and the Fed is cutting rates, the rupiah is now reaping the dividend from the central bank's efforts to stabilise it in the past.\"",
    "Bullish positions on the Thai baht  retreated to their lowest since early June amid rising bets of a rate cut as early as September, after inflation missed expectations in August and stayed below the central bank's target for a third straight month. ",
    "Short positions on the Indian rupee  largely remained unchanged, the poll found, after recent data showed sluggish economic growth between April and June and the manufacturing sector sputtered in August. ",
    "The data prompted a selloff in the equity market and brought expectations of a rate cut in October back to the table.",
    "The Asian currency positioning poll is focused on what analysts and fund managers believe are the current market positions in nine Asian emerging market currencies: the Chinese yuan, South Korean won, Singapore dollar, Indonesian rupiah, Taiwan dollar, Indian rupee, Philippine peso, Malaysian ringgit and the Thai baht.",
    "The poll uses estimates of net long or short positions on a scale of minus 3 to plus 3. A score of plus 3 indicates the market is significantly long U.S. dollars.",
    "The figures include positions held through non-deliverable forwards (NDFs).",
    "The survey findings  are provided below (positions in U.S. dollar versus each currency):"
  ],
  "published_datetime": "2019-09-12 02:04:00"
}