{
  "url": "https://www.nasdaq.com/article/top-ranked-income-stocks-to-buy-for-september-11th-cm1210640",
  "title": "Top Ranked Income Stocks to Buy for September 11th - Nasdaq.com",
  "text": [
    "Here are four stocks with buy rank and strong income characteristics for investors to consider today, September 11th:",
    "Vector Group Ltd.( VGR ) : This cigarettes manufacturer has witnessed the Zacks Consensus Estimate for its current year earnings increasing 54.1% over the last 60 days.",
    "Vector Group Ltd. price-consensus-chart | Vector Group Ltd. Quote",
    "This Zacks Rank #1 (Strong Buy) company has a dividend yield of 12.4%, compared with the industry average of 5.5%. Its five-year avera ge dividend yield is 8.6%.",
    "Vector Group Ltd. dividend-yield-ttm | Vector Group Ltd. Quote",
    "Artisan Partners Asset Management Inc. (APAM): This investment management company has witnessed the Zacks Consensus Estimate for its current year earnings increasing 0.4% over the last 60 days.",
    "Artisan Partners Asset Management Inc. price-consensus-chart | Artisan Partners Asset Management Inc. Quote",
    "This Zacks Rank #2 (Buy) company has a dividend yield of 8.4%, compared with the industry average of 2.8%. Its five-year average dividend yield is 7.2%.",
    "Artisan Partners Asset Management Inc. dividend-yield-ttm | Artisan Partners Asset Management Inc. Quote",
    "Westpac Banking Corporation (WBK): This financial services company has witnessed the Zacks Consensus Estimate for its current year earnings increasing 2.8% over the last 60 days.",
    "Westpac Banking Corporation price-consensus-chart | Westpac Banking Corporation Quote",
    "This Zacks Rank #2 company has a dividend yield of 6.4%, compared with the industry average of 3.5%. Its five-year average dividend yield is 6.1%.",
    "Westpac Banking Corporation dividend-yield-ttm | Westpac Banking Corporation Quote",
    "Waddell & Reed Financial, Inc. (WDR): This investment management services provider has witnessed the Zacks Consensus Estimate for its current year earnings increasing 6.3% over the last 60 days.",
    "Waddell & Reed Financial, Inc. price-consensus-chart | Waddell & Reed Financial, Inc. Quote",
    "This Zacks Rank #2 company has a dividend yield of 5.6%, compared with the industry average of 2.8%. Its five-year average dividend yield is 6.5%.",
    "Waddell & Reed Financial, Inc. dividend-yield-ttm | Waddell & Reed Financial, Inc. Quote",
    "See the full list of top ranked stocks here.",
    "Find more top income stocks with some of our great premium screens.",
    "Looking for Stocks with Skyrocketing Upside?",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.     ",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.  ",
    "See the pot trades we're targeting>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:42:00"
}