{
  "url": "https://www.nasdaq.com/article/proofpoint-makes-key-enhancements-across-product-portfolio-cm1207080",
  "title": "Proofpoint Makes Key Enhancements Across Product Portfolio - Nasdaq.com",
  "text": [
    "  Proofpoint PFPT  recently announced several enhancements across all its product lines, aiming to boost customer engagement and experience.  makeArticleAd();  With the widening threat landscape, companies constantly have to be on their toes to protect customers and employees from security breaches and compliance risks. This is driving companies like Proofpoint to invest in innovations and enhancements to boost security capabilities and better protect their client enterprises.   Customer-Centricity & Strong Product Portfolio Drive Growth    Proofpoint's constant focus on improving and expanding its capabilities and offerings is noteworthy.   The company reinvests about 20% of annual revenues into R&D, which is quite significant.    Notably, most of Proofpoint's offerings are the adopted by Fortune 100, Fortune 1000, and Global 2000 companies.   Proofpoint, Inc. Revenue (TTM)        Proofpoint, Inc. revenue-ttm    |   Proofpoint, Inc. Quote   Moreover, in the current security scenario, where enterprises are transitioning their workloads and data to the cloud, every point on the network is vulnerable to security breaches.      Focus on domains like cloud application security, information protection, deep threat intelligence, compliance, email authentication and employee training on security awareness are therefore important for companies to keep up with the growing sophistication of attacks.    Notably, the enhancements across Proofpoint's product portfolio will cover all the aforementioned aspects.    Per a cloud security survey  conducted by CyberSecurity Insiders, 39% of IT organizations currently struggle with compliance and 42% have been subject to unauthorized access to cloud data.    The survey also revealed that among operational security issues, compliance was rated the most challenging by 34% of respondents, followed by lack of visibility into infrastructure security as reported by 33%. Importantly, 31% companies said that lack of qualified staff was a major concern.    Last month, Proofpoint announced that its Security Awareness Training has won the Federal Risk and Authorization Management Program (FedRAMP) In Process status. This signifies that the company is actively working with an agency toward achieving a FedRAMP Agency Authorization.    These efforts are not only helping Proofpoint to attract new deals, but are also helping it to expand abroad by dint of its international business, which grew 33% year over year in the second quarter of 2019.    Furthermore, increased interest in new archiving features like supervision, eDiscovery and analytics visualization, particularly from firms in regulated industries such as healthcare and financial services and the features are driving demand for its digital risk products.   Competition Rife in the Evolving Security Scenario    Per a ResearchAndMarkets report, the Global Cloud Security market  is expected to hit $241.1 billion by 2025, at a CAGR of 11% from 2019 to 2025.    However, the firm notes that lack of awareness about cloud security the small and medium organizations and fear of losing confidentiality are some factors restraining market growth.    To tap these opportunities in the security market with growing cloud adoption, increasing number of security companies is upping the ante in this area.    Competition from the likes of Fortinet FTNT  , Palo Alto PANW  and Check Point CHKP  is a constant concern.    Nonetheless, Proofpoint's rich experience in the security space and continued delivery of mission-critical solutions will help it to grow market share.    Moreover, management is optimistic about its progress to increase its total addressable market to more than $13 billion in the coming years, which is encouraging.    Proofpoint currently carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>      Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Fortinet, Inc. (FTNT): Free Stock Analysis Report   Palo Alto Networks, Inc. (PANW): Free Stock Analysis Report   Check Point Software Technologies Ltd. (CHKP): Free Stock Analysis Report   Proofpoint, Inc. (PFPT): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Proofpoint PFPT  recently announced several enhancements across all its product lines, aiming to boost customer engagement and experience.  makeArticleAd();  With the widening threat landscape, companies constantly have to be on their toes to protect customers and employees from security breaches and compliance risks. This is driving companies like Proofpoint to invest in innovations and enhancements to boost security capabilities and better protect their client enterprises.   Customer-Centricity & Strong Product Portfolio Drive Growth    Proofpoint's constant focus on improving and expanding its capabilities and offerings is noteworthy.   The company reinvests about 20% of annual revenues into R&D, which is quite significant.    Notably, most of Proofpoint's offerings are the adopted by Fortune 100, Fortune 1000, and Global 2000 companies.",
    "  Proofpoint, Inc. Revenue (TTM)        Proofpoint, Inc. revenue-ttm    |   Proofpoint, Inc. Quote  ",
    " Proofpoint, Inc. Revenue (TTM) ",
    " Proofpoint, Inc. revenue-ttm    |   Proofpoint, Inc. Quote ",
    "Moreover, in the current security scenario, where enterprises are transitioning their workloads and data to the cloud, every point on the network is vulnerable to security breaches.      Focus on domains like cloud application security, information protection, deep threat intelligence, compliance, email authentication and employee training on security awareness are therefore important for companies to keep up with the growing sophistication of attacks.    Notably, the enhancements across Proofpoint's product portfolio will cover all the aforementioned aspects.    Per a cloud security survey  conducted by CyberSecurity Insiders, 39% of IT organizations currently struggle with compliance and 42% have been subject to unauthorized access to cloud data.    The survey also revealed that among operational security issues, compliance was rated the most challenging by 34% of respondents, followed by lack of visibility into infrastructure security as reported by 33%. Importantly, 31% companies said that lack of qualified staff was a major concern.    Last month, Proofpoint announced that its Security Awareness Training has won the Federal Risk and Authorization Management Program (FedRAMP) In Process status. This signifies that the company is actively working with an agency toward achieving a FedRAMP Agency Authorization.    These efforts are not only helping Proofpoint to attract new deals, but are also helping it to expand abroad by dint of its international business, which grew 33% year over year in the second quarter of 2019.    Furthermore, increased interest in new archiving features like supervision, eDiscovery and analytics visualization, particularly from firms in regulated industries such as healthcare and financial services and the features are driving demand for its digital risk products.   Competition Rife in the Evolving Security Scenario    Per a ResearchAndMarkets report, the Global Cloud Security market  is expected to hit $241.1 billion by 2025, at a CAGR of 11% from 2019 to 2025.    However, the firm notes that lack of awareness about cloud security the small and medium organizations and fear of losing confidentiality are some factors restraining market growth.    To tap these opportunities in the security market with growing cloud adoption, increasing number of security companies is upping the ante in this area.    Competition from the likes of Fortinet FTNT  , Palo Alto PANW  and Check Point CHKP  is a constant concern.    Nonetheless, Proofpoint's rich experience in the security space and continued delivery of mission-critical solutions will help it to grow market share.    Moreover, management is optimistic about its progress to increase its total addressable market to more than $13 billion in the coming years, which is encouraging.    Proofpoint currently carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>   ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 07:56:00"
}