{
  "url": "https://www.nasdaq.com/article/chipotle-mexican-grill-cmg-outpaces-stock-market-gains-what-you-should-know-cm1210774",
  "title": "Chipotle Mexican Grill (CMG) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Chipotle Mexican Grill (CMG) closed at $799.21 in the latest trading session, marking a +1.43% move from the prior day. The stock outpaced the S&P 500's daily gain of 0.72%. At the same time, the Dow added 0.85%, and the tech-heavy Nasdaq gained 1.06%. Prior to today's trading, shares of the Mexican food chain had lost 3.55% over the past month. This has lagged the Retail-Wholesale sector's gain of 4.89% and the S&P 500's gain of 2.25% in that time. Wall Street will be looking for positivity from CMG as it approaches its nex t earnings  report date. This is expected to be October 22, 2019. The company is expected to report EPS of $3.15, up 45.83% from the prior-year quarter. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $1.38 billion, up 12.29% from the year-ago period. CMG's full-year Zacks Consensus Estimates are calling for earnings of $13.36 per share and revenue of $5.49 billion. These results would represent year-over-year changes of +47.46% and +12.81%, respectively. It is also important to note the recent changes to analyst estimates for CMG. These revisions help to show the ever-changing nature of near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Based on our research, we believe these estimate revisions are directly related to near-team stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Within the past 30 days, our consensus EPS projection has moved 0.77% higher. CMG currently has a Zacks Rank of #3 (Hold). Digging into valuation, CMG currently has a Forward P/E ratio of 58.98. This valuation marks a premium compared to its industry's average Forward P/E of 23.28. Investors should also note that CMG has a PEG ratio of 3.14 right now. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. Retail - Restaurants stocks are, on average, holding a PEG ratio of 2.2 based on yesterday's closing prices. The Retail - Restaurants industry is part of the Retail-Wholesale sector. This industry currently has a Zacks Industry Rank of 144, which puts it in the bottom 44% of all 250+ industries. The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. To follow CMG in the coming trading sessions, be sure to utilize Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Chipotle Mexican Grill, Inc. (CMG): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Chipotle Mexican Grill (CMG) closed at $799.21 in the latest trading session, marking a +1.43% move from the prior day. The stock outpaced the S&P 500's daily gain of 0.72%. At the same time, the Dow added 0.85%, and the tech-heavy Nasdaq gained 1.06%.",
    "Prior to today's trading, shares of the Mexican food chain had lost 3.55% over the past month. This has lagged the Retail-Wholesale sector's gain of 4.89% and the S&P 500's gain of 2.25% in that time.",
    "Wall Street will be looking for positivity from CMG as it approaches its nex t earnings  report date. This is expected to be October 22, 2019. The company is expected to report EPS of $3.15, up 45.83% from the prior-year quarter. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $1.38 billion, up 12.29% from the year-ago period.",
    "CMG's full-year Zacks Consensus Estimates are calling for earnings of $13.36 per share and revenue of $5.49 billion. These results would represent year-over-year changes of +47.46% and +12.81%, respectively.",
    "It is also important to note the recent changes to analyst estimates for CMG. These revisions help to show the ever-changing nature of near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.",
    "Based on our research, we believe these estimate revisions are directly related to near-team stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Within the past 30 days, our consensus EPS projection has moved 0.77% higher. CMG currently has a Zacks Rank of #3 (Hold).",
    "Digging into valuation, CMG currently has a Forward P/E ratio of 58.98. This valuation marks a premium compared to its industry's average Forward P/E of 23.28.",
    "Investors should also note that CMG has a PEG ratio of 3.14 right now. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. Retail - Restaurants stocks are, on average, holding a PEG ratio of 2.2 based on yesterday's closing prices.",
    "The Retail - Restaurants industry is part of the Retail-Wholesale sector. This industry currently has a Zacks Industry Rank of 144, which puts it in the bottom 44% of all 250+ industries.",
    "The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "To follow CMG in the coming trading sessions, be sure to utilize Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:50:15"
}