{
  "url": "https://www.nasdaq.com/article/wednesday-sector-laggards-utilities-healthcare-cm1207497",
  "title": "Wednesday Sector Laggards: Utilities, Healthcare - Nasdaq.com",
  "text": [
    "The worst performing sector as of midday Wednesday is the Utilities sector, showing a 0.1% loss. Within that group, Atmos Energy Corp. (Symbol: ATO) and American Water Works Co, Inc. (Symbol: AWK) are two of the day's laggards, showing a loss of 1.0% and 0.9%, respectively. Among utilities ETFs  , one ETF following the sector is the Utilities Select Sector SPDR ETF (Symbol: XLU), which is down 0.1% on the day, and up 21.95% year-to-date. Atmos Energy Corp., meanwhile, is up 21.00% year-to-date, and American Water Works Co, Inc. is up 42.92% year-to-date. Combined, ATO and AWK make up approximately 4.2% of the underlying holdings of XLU. The next worst performing sector is the Healthcare sector, not showing much of a gain. Among large Healthcare stocks, Incyte Corporation (Symbol: INCY) and Vertex Pharmaceuticals, Inc. (Symbol: VRTX) are the most notable, showing a loss of 3.7% and 1.7%, respectively. One ETF closely tracking Healthcare stocks is the Health Care Select Sector SPDR ETF ( XLV  ), which is down 0.3% in midday trading, and up 4.66% on a year-to-date basis. Incyte Corporation, meanwhile, is up 21.21% year-to-date, and Vertex Pharmaceuticals, Inc. is up 5.98% year-to-date. Combined, INCY and VRTX make up approximately 1.8% of the underlying holdings of XLV.    Comparing these stocks and ETFs on a trailing twelve month basis, below is a relative stock price performance chart, with each of the symbols shown in a different color as labeled in the legend at the bottom:  makeArticleAd();       Here's a snapshot of how the S&P 500 components within the various sectors are faring in afternoon trading on Wednesday. As you can see, seven sectors are up on the day, while one sector is down.      25 Dividend Giants Widely Held By ETFs »  ",
    "The next worst performing sector is the Healthcare sector, not showing much of a gain. Among large Healthcare stocks, Incyte Corporation (Symbol: INCY) and Vertex Pharmaceuticals, Inc. (Symbol: VRTX) are the most notable, showing a loss of 3.7% and 1.7%, respectively. One ETF closely tracking Healthcare stocks is the Health Care Select Sector SPDR ETF ( XLV  ), which is down 0.3% in midday trading, and up 4.66% on a year-to-date basis. Incyte Corporation, meanwhile, is up 21.21% year-to-date, and Vertex Pharmaceuticals, Inc. is up 5.98% year-to-date. Combined, INCY and VRTX make up approximately 1.8% of the underlying holdings of XLV.",
    "  25 Dividend Giants Widely Held By ETFs » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:36:36"
}