{
  "url": "https://www.nasdaq.com/article/ten-ltd-tnp-q2-2019-earnings-call-transcript-cm1210661",
  "title": "TEN, Ltd. (TNP) Q2 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   TEN, Ltd.    (NYSE: TNP)        Q2 2019 Earnings Call       Sep 11, 2019 ,   8:30 a.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Thank you for standing by, ladies and gentlemen, and welcome   to the Tsakos Energy Navigation Conference Call on the Second   Quarter 2019 Financial Results. We have with us Mr. Takis   Arapoglou, Chairman of the Board; Mr. Nikolas Tsakos, President   and CEO; Mr. Paul Durham, Chief Financial Officer; and Mr. George   Saroglou, Chief Operating Officer of the Company. [Operator   Instructions] And now I pass the floor to Mr. Nicolas Bornozis, President of   Capital Link, Investor Relation Adviser of Tsakos Energy   Navigation. Please go ahead, sir.  Nicolas Bornozis    --   Investor Relations  Thank you very much, and good morning to all of our   participants. I'm Nicolas Bornozis of Capital Link, Investor   Relations Adviser to Tsakos Energy Navigation. This morning, the   Company publicly released its financial results for the second   quarter and six-month period of 2019. In case if you do not have   a copy of today's earnings release, please call us at (212)   661-7566 or email us at, ten@capitallink.com, and we will have a   copy for you emailed right away. Please note that parallel to today's conference call, there is   also a live audio and slide webcast, which can be accessed on the   Company's website on the front page at www.tenn.gr. The   conference call will follow the presentation slides, so please we   urge you to access the presentation slides on the Company's   website. Please note that the slides of the webcast presentation   will be available in archive on the website of the Company after   the conference call. Also please note that the slides of the   webcast presentation are user-controlled, and that means that by   clicking on the proper button, you can move to the next or to the   previous slide on your own. At this time, I would like to read the safe harbor statement.   This conference call and slide presentation of the webcast   contain certain forward-looking statements within the meaning of   the safe harbor provision of the Private Securities Litigation   Reform Act of 1995. Investors are cautioned that such   forward-looking statements involve risks and uncertainties, which   may affect TEN's business prospects and results of operations.   Such risks are more fully disclosed in TEN's filings with the   Securities and Exchange Commission. And now I'll turn the floor over to Mr. Takis Arapoglou, the   Chairman of the Board of Tsakos Energy Navigation. Mr. Arapoglou,   please go ahead, sir.  Efstratios Arapoglou    --   Chairman of the Board  Thank you, Nicolas. Good morning, everyone. Thank you for   joining our call today. I would say very positive performance,   one of perhaps only two positive performances in the sector, if   I'm not mistaken, with over 40% increase in EBITDA year-on-year   to $120 million. At the same time, TEN reduced debt by $140   million, repaid a $50 million pref, continued pay dividends of   all kinds and maintained a very healthy cash position while   continuously improving operational excellence. TEN continues to   invest in growing the fleet in a measured way as per our stated   strategy, both in the conventional tanker sector, as well as in   LNG, the latter being in the core of our strategy going forward   as we've said many times. On behalf of the Board of TEN, once   again, congratulations to Nikolas Tsakos and the team, not only   for the results, but also for positioning the Company so well for   an upturn in the market as expected. So, thanks again, Niko, and over to you.  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  Thank you, Chairman. We are glad that we are able to maintain   our profitability in a challenging environment. I think we're   very glad that our -- as you kindly said, I think TEN is   consistently one of the very few companies in our peer group that   maintains profitability regardless of the cycles. We are looking   at an environment that is promising and we are preparing the   Company with that in mind. However, we continue to maintain our   policy of chartering our vessels and building vessels against   long-term accretive employments that ensure a very strong   utilization. We are at 97% utilization in a challenging market   for the first six months and this has not changed even last year   when the market was even poorer than is today. The future looks   promising. A lot of disruptions are -- will be happening in the   next couple of quarters and seasonality will help. Already the   futures market also indicates that we're going to be seeing a   much healthier 2020 and the remaining of 2019. As we speak today, we're -- we have 32 of our vessels on fixed   employments, 20% -- 20 of our vessels in fixed and profit sharing   arrangements, including contract of affreightment and 16 vessels   in the spot market. I think this mix has enabled us for the first   six months to outperform the market by about 10% on the six   monthly basis, but even stronger in the last quarter where the   market was weaker, about 38%. And this gives us confidence that   when the market will be growing and going further, the Company   will be able to profit and increase the bottom line even further,   which hopefully at some stage will have to be reflected on our   share price. What we are doing right now, we are in the final -- concluding   a very large -- one of the largest newbuilding programs with   first class long-term employment on every single vessel that any   tanker company had. We have already taken delivery of 16 vessels.   We have reduced debt by more than $250 million in the last 18   months, which means that the Company throws a lot of cash flow to   maintain -- repaying a very -- a dividend and also reducing our   debt, and allows income for -- and allows us a liquidity for   growth. In the last month, we have as we stated before, increased our   exposure on the LNG sector, and again, talking about   state-of-the-art vessels with the long-term employments. So we   are positioning the Company in a situation ready to take   advantage of the market that we expect to be much stronger in the   second half of the year and 2020. And I think with this, I will ask Mr. Saroglou to give us a   much more detailed analysis of where we've been in the last six   months.  George V. Saroglou    --   Chief Operating Officer  Thank you very much, Nikolas, and good morning to you all.   We're very pleased to report a profitable second quarter and   first six months of 2019 operations as a result of a better   freight market environment that started during the fourth quarter   of 2018. As we said, we are one of the very few companies in the   peer group, if not the only one tha   t report    ed profitable operations in the first six months of the year. The   recovery in both the tanker and LNG markets helped the Company to   recharter the two LNG vessels in the fleet at much higher   accretive rates above the average all-in break even for both   vessels. We continue to charter and recharter 13 vessels so far   since the start of the year, taking advantage of the appetite by   oil majors and the Company's clients to fix vessels forward. The last three years, the Company built 20 vessels, including   the one-option-one LNG order we announced today against long-term   industrial business. TEN is in the final stages of this 19 vessel   growth program undertaken at competitive levels during the low   levels of previous cycle. Of these 15 ships have been   successfully delivered, financed and employed on long-term   accretive charters to first class end users. Within this year and   2020, the remaining four vessels are fully financed and chartered   to an oil major concern for a minimum of five years will complete   the Company's current expansion and secure revenues going   forward. On the LNG newbuilding front, we have ordered one-option-one   174,000 cubic meter vessel for delivery in 2021. With this order,   the Company's LNG performance fleet rises to four vessels. We   expect for this, including the option -- we expect for this   vessel to follow the same employment path as the other two   vessels and be employed on time-chartered with major   international natural gas and trading companies. Already   discussions have started to be in place and we hope and expect to   announce as time progresses similar charters like the ones that   we have one our other two LNG vessels. During the first half of   the year, we had -- we concluded a deal with a major end user for   four vessels and we have expanded a strategic relationship with a   national -- national oil concern by selling them two vessels. Moving through the online presentation, in Slide 3. We see the   Company's versatile and modern fleet spanning across all vessel   types and sizes in crude product tankers and specialized   categories like LNG and shuttle tankers. Thanks to the Company's   employment strategy that has a bias toward medium to long-term   time charters with a combination of fixed rates, profit sharing   and min/max rate, TEN is able to outperform the average spot   market indices. Slide 4, the left side presents the all-in break even costs   for the various vessel types that we operate in the Company. As   you can see, the cost base is low. In addition to the low   shipbuilding costs, we must highlight the purchasing power of TCM   and the continuous cost control efforts by management to maintain   a low OpEx for the fleet. In the first half of the year, OpEx is   down 3%. Low general and administrative expenses, while keeping a   very high fleet utilization quarter-after-quarter, again, almost   97% for both the second quarter and the first half of the year,   which we believe qualifies as full employment. TEN's flexible chartering strategy ensures that most of the   time, the Company outperforms the spot market and this helps the   Company maintain an impeccable debt service record and meet all   our obligation irrespective of where we are in the market cycle.   Thanks to the profit-sharing element, that's a big portion of the   fleet, TEN benefit further when market conditions improve further   as we expect the market to do going forward. Based on the current   conditions and the number of vessels operating in the spot market   and in time charter with profit-sharing, for every $1,000 dollars   increase in spot market rates, we have a positive $0.06 impact on   annual EPS. Debt reduction is an integral part of the Company's strategy.   Debt sit at around $1.7 billion at the end of 2017, and in the   last 18 months, we have reduced the Company's debt by $221   million, taking down the net debt to capital ratio at the end of   the second quarter of 2019 at below 50%. At the end of July, the   Company fully redeemed the highly successful $50 million Series B   shares. Despite the headwind from the US-China trade war and its   potential spillover affects the rest of the world, global oil   demand continues to grow. The latest forecast from the   International Energy Agency calls for 1.1 million barrels per day   oil demand growth this year and 1.3 million barrels per day next   year. The USA is now the biggest crude oil producer and US crude   oil exports continue to grow. This, combined with geopolitical   tension, supply disruptions, the US-led sanctions against   Venezuela and Iran, and OPEC production cuts are positive for   tonne miles and global fleet utilization as substitute barrels   travel longer distances to each importers, refiners and   consumers. We had a longer than usual refinery maintenance season in the   first half of 2019, as global refineries were preparing for   IMO2020 low sulfur fuel oil switch. However, global refinery   throughputs are picking up and expected to require another on   average 1 million barrels per day of more crude oil than they did   in the first half of the year. On the supply of tonnage, the order book is at 7.7%, and this   is a low number compared to historical level. A big part of the   fleet is over 15 years, and environmental regulations starting   with retrofitting water ballast treatment systems and scrubbers   to comply with IMO2020 create delays as scrubber retrofitting   takes longer than initially forecasted. While shipyard works at   full capacity to meet retrofitting requirements which could keep   longer, a big part of the global fleet in shipyards rather than   trading and this could push more tankers approaching or above 20   years to go for scrapping. Last year was one of the highest scrapping years of records.   This year's scrapping as expected is lower. But with more than   1,000 tankers older than 15 years, enforced [Phonetic]   environmental regulations, we could see a pickup in scrapping,   especially for those vessels approaching for above 20 years. The   graph on the right side of the slide is a forecast from   Fearnleys, a well-known ship broker from Norway. As you can see,   VLCC rates are expected to trend higher and reach multi-year   heights going forward. We are also very positive about the market   prospects and expect a strong market for all vessel categories.   This environment, we believe that the Company's fleet is   well-positioned to capture any market opportunity that will be   presented. That concludes the operational part of our   presentation. Paul will walk you through the financial highlights for the   second quarter and first half. Paul?  Paul Durham    --   Chief Financial Officer  Thank you, George. Well, after a profitable quarter one, TEN   continued on a profitable path in quarter two, despite   difficulties arising from refinery disruptions, fleet   overcapacity, OPEC cuts, and of course, seasonal factors.   Nevertheless, TEN was able to generate a net income of $300,000,   a considerably better result from that loss of over $9 million in   the prior quarter two. For the half year, there was net income of   $11.5 million compared to $21.5 million loss in the first six   months of 2018, a $33 million positive reversal. The profit was   mainly due to an increase in revenue by 16% in quarter two and   half year over the prior periods, partly due to new accretive   time charters, including those of the LNG carriers. Increased   long-haul voyages helped our spot vessels to earn freight at an   average 30% more than in the prior quarter two. Daily TCE per vessel in quarter two and six-months averaged   over $20,000, well above average market rates due to our time   charters that again generated enough to pay operating overhead   and finance cash costs. Operating income increased five-fold from   the prior quarter two to reach $19 million, despite some increase   in OpEx due to timing and higher maintenance and fares, offset by   a stronger dollar. Otherwise, average daily OpEx per vessel   stayed well under $8,000, while other expenses remained stable or   fell from those of the prior quarter two. Finance costs were up by $6.5 million in quarter two, mainly   due to bunker hedge losses and negative non-cash movements in   valuations. However, loan interest remain stable with interest   rate increases being offset by a substantial $142 million   reduction in outstanding debt in the past year. In quarter two   itself, net debt was reduced by $52 million, leaving cash   balances of $193 million at the end of the half year with our net   debt to capital at 48%. EBITDA in quarter two amounted to $56   million, 33% higher than in the prior quarter two and $120   million for the six months, a 43% increase. On top of the significant reduction in outstanding loans, we   also redeemed the Series B preferred stock in July, with $50   million returned to stockholders. So all in all, we are pleased   with the results in the first six months given the difficult   market and we remain optimistic for the rest of 2019 and beyond,   based on low inventories, completed refinery maintenance, high US   oil exports and reduced tanker deliveries, recognizing that we   are approaching a period of probable disruption that may reduce   the availability of tankers that in turn will have a positive   effect on returns. And now I'll hand the call back to Nikolas.  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  Thank you, Paul, for another quarter of positive news. And we   are, as I said, glad being one of the very few in our peer group,   if not the only one that is positive this quarter and for the   first six months. We are able to achieve this by tight control on   the actual assets, maintaining operating expenses and utilization   at very high rates. And our chartering strategy gives us the   ability to outperform the spot markets significantly. This -- the   first six months, we had a 36% outperformance of the spot market   that has enabled the Company to be profitable. Our VLCCs   performed significantly better than the spot market in the first   six months, the same with our Suezmaxes, Aframaxes, Panamaxes in   every single sector that we participate, we have to outperformed   the market significantly, with a total average of 36% in that   growth. Also, a very important part of our business has to do with   reducing debt. And I think as Mr. Saroglou George said, reducing   debt and repaying our initial Series B preferred was one of the   highlights of the first six months and hence still realizing a   very strong liquidity. But also interest rate reduction is very   positive for our business. Just to put to in a perspective, every   1% reduction in interest rate is almost $15 million straight down   to our bottom line. So that's a very significant number going   forward. On the growth side, our long-term strategic relationships are   maintained. Our operational excellence is appreciated by the end   users that they would rather do business with companies with a   long-term solid profile like ourselves. Four vessels with a   strategic relationship to a US major oil company with very long   employment starting this quarter and going -- or I guess starting   next fourth quarter and one vessel every quarter following. And   of course, then the expansion on the LNG -- in the LNG sector   continues, and a lot of accretive business in the backlog as we   speak, which gives us a very positive feeling that the market is   expected to go from strength to strength, at least in the medium   to near future. And with this, I would like to open the floor for any   questions that you may have. Questions and Answers:  Operator  Thank you very much, sir. [Operator Instructions] Okay. Our   first question for today is from J Mintzmyer [Phonetic] from   Value Investors.  J Mintzmyer    --   Value Investors -- Analyst  Hi, good morning gentlemen. Congratulations on the LNG   order.  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  Thank you.  J Mintzmyer    --   Value Investors -- Analyst  Yes. I'm looking at the timing of your installment payments   for your two Aframaxes, two Suezmaxes, and one-option-one LNG. Is   that correct? And then also, what is the timing of those   installments, both for the rest of 2019, 2020 and then 2021?  Paul Durham    --   Chief Financial Officer  Well, to-date we paid for the four vessels, $25 million we've   paid already out of our pocket. We expect to pay another $55   million from our pocket in the remainder of the year -- I beg   your pardon, $5 million in the remainder of the year. And   drawdowns we shall have from our banks, they're providing   pre-financing -- pre-delivery refinancing. Drawdowns will amount   to $45 million by the end of the year. And future drawdowns   within the year, we have $26 million. And going into 2020, we   have a further $122 million and that's being provided by the   delivery date.  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  So I think, actually from equity, it's another $5 million for   the vessels.  Paul Durham    --   Chief Financial Officer  In addition to the $25 million already paid.  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  In addition to the $25 million already paid.  J Mintzmyer    --   Value Investors -- Analyst  Okay. So I'm hearing $5 million additional equity for the rest   of the year. And what's the amount you anticipate? I know all the   financing is probably not wrapped up yet, especially for the LNG   carriers, but what's the amount of equity that you anticipate   spending in 2020 and then 2021 for those vessels?  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  I think the only -- the finance is wrapped up for all the   other vessels with a queue of financiers for the LNGs. So we   expect that perhaps another $40 million of equity within --   between 2020 and '21 for the LNG carrier.  J Mintzmyer    --   Value Investors -- Analyst  So what's kind of wrapping up on that? What's the target   leverage for those vessels? It sounds to me like it's in the 70%,   80% range, is that about right?  Paul Durham    --   Chief Financial Officer  We try to be conservative. As you know, we have a conservative   balance sheet and we'd rather keep it closer to 70% rather than   the 80%.  J Mintzmyer    --   Value Investors -- Analyst  Excellent. Thank you. And then the other question I have   similar is on your debt facilities. I know you've targeted   refinancing the balloons, but you plan to pay down your regular   amortization payments. Can you remind me what the remaining   amortization payments are for the rest of 2019, also for 2020 and   scheduled for 2021?  Paul Durham    --   Chief Financial Officer  Right. Our scheduled repayments for the remainder of 2019 $84   million. Going into 2020, we're going -- do you want to know   future years as well? Okay. So for the remainder of this year, we   have scheduled $84 million to pay.  J Mintzmyer    --   Value Investors -- Analyst  And then, do you have the numbers available for 2020 or 2021   yet?  Paul Durham    --   Chief Financial Officer  Yes, sure. 2020, we have $166 million and it is a scheduled   payments, not balloons. Going into 2021, we have $141 million.   And if we're going into '22, here we've got another $128   million.  J Mintzmyer    --   Value Investors -- Analyst  Excellent. Thanks for the color on that. And then final   question for me. We talked a little bit about scrubbers in the   call and how those are adding some delays. I know previous calls   you mentioned that there might be some customers that would pay   for the scrubbers as part of their charters. Has there been any   deals made on that, like how many of your fleet are tied up on   scrubbers?  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  Well, as I said, we have -- we will have about 8 vessels,   including the newbuilds with scrubbers, all of them paid by the   charters in the time that we will retrofit them and the cost.  J Mintzmyer    --   Value Investors -- Analyst  Fantastic. So no capex expected for the scrubbers. Is that   correct?  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  The opposite. We will be earning money sitting at the yard   while this is happening. So actually it will be more profitable,   because we will not have any oil consumption.  J Mintzmyer    --   Value Investors -- Analyst  Excellent. Thank you very much gentlemen.  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  Thank you.  Operator  [Operator Instructions]. The next one is from Randy Giveans   from Jefferies. Please go ahead.  Christopher Robertson    --   Jefferies -- Analyst  Good morning, gentlemen. This is Chris Robertson on for Randy.   Thanks for taking our questions.  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  Hi, Chris.  Christopher Robertson    --   Jefferies -- Analyst  Hi. So, Nikolas mentioned operating expense control and the   utilization rate that was strong in the quarter, so it looks like   you were able to achieve close to a 97% utilization rate. Do you   expect similar results for the remainder of the year? And will   any IMO2020 preparations cut into that? Any disruptions there   regarding the changeover in fuels?  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  Well, if you go back to, I would say even to the last 5 or 10   years history, you see we average well above the 95%, 85% is the   industry average. So 97% we expect to be a very constant number.   If you -- and as I said in the previous answer, the reason we   would maintain this is because our -- the time we would be taking   for the scrubber installations are going to be paid. So there   would be no downtime. It will be paid by the charters. So, yes,   we expect to maintain because of the chartering profile. We have   to maintain the same high utilization going forward.  Christopher Robertson    --   Jefferies -- Analyst  Got you. And can you talk a little bit about the operational   plans to make the changeover in fuels?  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  Yes, I have a big team that can say much more things than I   do, but they are away from the speaker right now. Yes, I think we   are preparing -- at least in the mind [Phonetic] -- that we are   preparing the ships during the passage in order of cleaning the   tanks. And so we do not have any off-hire. If we have any   scheduled delays, if we have any scheduled repairs, these repairs   are going to be used at the same time to clean the tanks for the   low -- for the low sulfur. So we do not really expect any major   delays in what we will be doing in the preparation and having 70%   of the fleet with long-term employment, it helps very, very --   very much because we have the cooperation of the charters,   because they are actually the owners of the products that we   burn.  Christopher Robertson    --   Jefferies -- Analyst  Got you. And then with regards to the reduction in the vessel   OpEx, was that fairly low hanging fruit and what additional steps   could the technical managers take in coming quarters to maybe   drive that down further?  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  Well, I think for us, we are -- first of all, we are running a   fleet at utilization of 97%, and at the same time we are -- we   have on average the lowest, at least from the tanker owners, OpEx   and G&A expenses in the industry. We have a vertical   operation. So we actually -- whatever happens on a ship -- it   does not happen in India or somewhere else, it happens within the   premises that we all operate where the Company is headquartered.   So we are able to have very quick reaction and on-hand control,   and that's why we would like to also appreciate the efforts of   our seafarers and our ship managers and -- that are cooperating   so close with the commercial department to try and keep operating   expenses even lower. And I think what would help a little bit   more will be a stronger dollar, which we should not exclude.  Christopher Robertson    --   Jefferies -- Analyst  Got you. And last question for me. Regarding the Aframax   tankers, are any of the crude tankers operating in the product   tanker trade, what trade do you think will benefit more in the   lead up to IMO implementation and any update on the lightering   activity in the US or Latin American markets with your Aframax   tankers?  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  Well, that's a very good question, and I think if you can go   to -- if you go to page of our fleet, you'll see that we have   right now, the three of our vessels, which are the Proteas,   Promitheas, Propontis, that our Aframax is trading, trading clean   right now, and which is -- I would say it's a market which is   getting a lot of positive news because of the different   dislocations of high and low sulfur crudes. So we have three of   those ships trading on the Aframaxes in the clean trade. And it's   a very good question which -- we believe that initially perhaps.   The product market might get an early start in a positive   environment because of the dislocations of the various refinery   -- the refiners. However, in order for refineries to produce the   right product, they would have to find the right crude. So I   think the crude market then will follow also. And I will give you   very quick example, because I'm sure [Phonetic] you're all -- the   US refineries because you are used to actually crack heavier   crudes are better prepared for producing low sulfur than the,   let's call them the Western European refineries. So we might see   products coming to -- coming from the United States to Europe,   low sulfur product. Then, of course, in order to -- and also, we might see lighter   crudes. We also like lighter crudes that will have to be used to   mix with the heavier crudes that we have, the Russian crudes,   which are heavier. So the crude market will also take -- I think   will have an advantage of longer tonne miles. So I think the   whole segment will have a dislocation and disruption, but will be   positive for supply.  Christopher Robertson    --   Jefferies -- Analyst  Got you. Appreciate the time.  Operator  Thank you very much. Gentlemen, there are no further questions   waiting. I'll hand the call back to you for closing remarks.   Thank you.  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  Thank you. Chairman?  Efstratios Arapoglou    --   Chairman of the Board  Well, as Nikolas Tsakos said earlier, we remain optimistic   going forward, totally focused on our strategy, which has been   paying off the way it has been executed. In October, we have a   new strategy meeting. We will review as appropriate, and of   course, let you know of any changes in the next results quarter.   So thank you very much from me. Over to you Nikolas.  Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer  Well, thank you, Chairman, and I think looking forward to meet   face to face with our shareholders. We have a big week in London   next week with London Maritime Week. And I think Capital Link --   the Capital Link event with a lot of a chance to see our European   investors or whoever from the United States is in London. And   then in October, we have the LNG Conference in Houston, which   coincides with again the various events Capital Link events in   New York, where the team will be there. And in the meantime, we   will hope to be able to maintain and be able to give you good   news in November when we report our nine months results and   hopefully come up with even better results going forward. And   again, thank you for your support. And looking forward to a   healthy second half of the year. Thank you.  Operator  [Operator Closing Remarks].  Duration: 36 minutes  Call participants:  Nicolas Bornozis    --   Investor Relations   Efstratios Arapoglou    --   Chairman of the Board   Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer   George V. Saroglou    --   Chief Operating Officer   Paul Durham    --   Chief Financial Officer   J Mintzmyer    --   Value Investors -- Analyst   Christopher Robertson    --   Jefferies -- Analyst   More TNP analysis   All earnings call transcripts        10 stocks we like better than Tsakos Energy   Navigation     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Tsakos Energy   Navigation wasn't one of them! That's right --   they think these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " TEN, Ltd.    (NYSE: TNP)        Q2 2019 Earnings Call       Sep 11, 2019 ,   8:30 a.m. ET ",
    " Operator ",
    "Thank you for standing by, ladies and gentlemen, and welcome   to the Tsakos Energy Navigation Conference Call on the Second   Quarter 2019 Financial Results. We have with us Mr. Takis   Arapoglou, Chairman of the Board; Mr. Nikolas Tsakos, President   and CEO; Mr. Paul Durham, Chief Financial Officer; and Mr. George   Saroglou, Chief Operating Officer of the Company. [Operator   Instructions]",
    "And now I pass the floor to Mr. Nicolas Bornozis, President of   Capital Link, Investor Relation Adviser of Tsakos Energy   Navigation. Please go ahead, sir.",
    " Nicolas Bornozis    --   Investor Relations ",
    "Thank you very much, and good morning to all of our   participants. I'm Nicolas Bornozis of Capital Link, Investor   Relations Adviser to Tsakos Energy Navigation. This morning, the   Company publicly released its financial results for the second   quarter and six-month period of 2019. In case if you do not have   a copy of today's earnings release, please call us at (212)   661-7566 or email us at, ten@capitallink.com, and we will have a   copy for you emailed right away.",
    "Please note that parallel to today's conference call, there is   also a live audio and slide webcast, which can be accessed on the   Company's website on the front page at www.tenn.gr. The   conference call will follow the presentation slides, so please we   urge you to access the presentation slides on the Company's   website. Please note that the slides of the webcast presentation   will be available in archive on the website of the Company after   the conference call. Also please note that the slides of the   webcast presentation are user-controlled, and that means that by   clicking on the proper button, you can move to the next or to the   previous slide on your own.",
    "At this time, I would like to read the safe harbor statement.   This conference call and slide presentation of the webcast   contain certain forward-looking statements within the meaning of   the safe harbor provision of the Private Securities Litigation   Reform Act of 1995. Investors are cautioned that such   forward-looking statements involve risks and uncertainties, which   may affect TEN's business prospects and results of operations.   Such risks are more fully disclosed in TEN's filings with the   Securities and Exchange Commission.",
    "And now I'll turn the floor over to Mr. Takis Arapoglou, the   Chairman of the Board of Tsakos Energy Navigation. Mr. Arapoglou,   please go ahead, sir.",
    " Efstratios Arapoglou    --   Chairman of the Board ",
    "Thank you, Nicolas. Good morning, everyone. Thank you for   joining our call today. I would say very positive performance,   one of perhaps only two positive performances in the sector, if   I'm not mistaken, with over 40% increase in EBITDA year-on-year   to $120 million. At the same time, TEN reduced debt by $140   million, repaid a $50 million pref, continued pay dividends of   all kinds and maintained a very healthy cash position while   continuously improving operational excellence. TEN continues to   invest in growing the fleet in a measured way as per our stated   strategy, both in the conventional tanker sector, as well as in   LNG, the latter being in the core of our strategy going forward   as we've said many times. On behalf of the Board of TEN, once   again, congratulations to Nikolas Tsakos and the team, not only   for the results, but also for positioning the Company so well for   an upturn in the market as expected.",
    "So, thanks again, Niko, and over to you.",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "Thank you, Chairman. We are glad that we are able to maintain   our profitability in a challenging environment. I think we're   very glad that our -- as you kindly said, I think TEN is   consistently one of the very few companies in our peer group that   maintains profitability regardless of the cycles. We are looking   at an environment that is promising and we are preparing the   Company with that in mind. However, we continue to maintain our   policy of chartering our vessels and building vessels against   long-term accretive employments that ensure a very strong   utilization. We are at 97% utilization in a challenging market   for the first six months and this has not changed even last year   when the market was even poorer than is today. The future looks   promising. A lot of disruptions are -- will be happening in the   next couple of quarters and seasonality will help. Already the   futures market also indicates that we're going to be seeing a   much healthier 2020 and the remaining of 2019.",
    "As we speak today, we're -- we have 32 of our vessels on fixed   employments, 20% -- 20 of our vessels in fixed and profit sharing   arrangements, including contract of affreightment and 16 vessels   in the spot market. I think this mix has enabled us for the first   six months to outperform the market by about 10% on the six   monthly basis, but even stronger in the last quarter where the   market was weaker, about 38%. And this gives us confidence that   when the market will be growing and going further, the Company   will be able to profit and increase the bottom line even further,   which hopefully at some stage will have to be reflected on our   share price.",
    "What we are doing right now, we are in the final -- concluding   a very large -- one of the largest newbuilding programs with   first class long-term employment on every single vessel that any   tanker company had. We have already taken delivery of 16 vessels.   We have reduced debt by more than $250 million in the last 18   months, which means that the Company throws a lot of cash flow to   maintain -- repaying a very -- a dividend and also reducing our   debt, and allows income for -- and allows us a liquidity for   growth.",
    "In the last month, we have as we stated before, increased our   exposure on the LNG sector, and again, talking about   state-of-the-art vessels with the long-term employments. So we   are positioning the Company in a situation ready to take   advantage of the market that we expect to be much stronger in the   second half of the year and 2020.",
    "And I think with this, I will ask Mr. Saroglou to give us a   much more detailed analysis of where we've been in the last six   months.",
    " George V. Saroglou    --   Chief Operating Officer ",
    "Thank you very much, Nikolas, and good morning to you all.   We're very pleased to report a profitable second quarter and   first six months of 2019 operations as a result of a better   freight market environment that started during the fourth quarter   of 2018. As we said, we are one of the very few companies in the   peer group, if not the only one tha   t report    ed profitable operations in the first six months of the year. The   recovery in both the tanker and LNG markets helped the Company to   recharter the two LNG vessels in the fleet at much higher   accretive rates above the average all-in break even for both   vessels. We continue to charter and recharter 13 vessels so far   since the start of the year, taking advantage of the appetite by   oil majors and the Company's clients to fix vessels forward.",
    "The last three years, the Company built 20 vessels, including   the one-option-one LNG order we announced today against long-term   industrial business. TEN is in the final stages of this 19 vessel   growth program undertaken at competitive levels during the low   levels of previous cycle. Of these 15 ships have been   successfully delivered, financed and employed on long-term   accretive charters to first class end users. Within this year and   2020, the remaining four vessels are fully financed and chartered   to an oil major concern for a minimum of five years will complete   the Company's current expansion and secure revenues going   forward.",
    "On the LNG newbuilding front, we have ordered one-option-one   174,000 cubic meter vessel for delivery in 2021. With this order,   the Company's LNG performance fleet rises to four vessels. We   expect for this, including the option -- we expect for this   vessel to follow the same employment path as the other two   vessels and be employed on time-chartered with major   international natural gas and trading companies. Already   discussions have started to be in place and we hope and expect to   announce as time progresses similar charters like the ones that   we have one our other two LNG vessels. During the first half of   the year, we had -- we concluded a deal with a major end user for   four vessels and we have expanded a strategic relationship with a   national -- national oil concern by selling them two vessels.",
    "Moving through the online presentation, in Slide 3. We see the   Company's versatile and modern fleet spanning across all vessel   types and sizes in crude product tankers and specialized   categories like LNG and shuttle tankers. Thanks to the Company's   employment strategy that has a bias toward medium to long-term   time charters with a combination of fixed rates, profit sharing   and min/max rate, TEN is able to outperform the average spot   market indices.",
    "Slide 4, the left side presents the all-in break even costs   for the various vessel types that we operate in the Company. As   you can see, the cost base is low. In addition to the low   shipbuilding costs, we must highlight the purchasing power of TCM   and the continuous cost control efforts by management to maintain   a low OpEx for the fleet. In the first half of the year, OpEx is   down 3%. Low general and administrative expenses, while keeping a   very high fleet utilization quarter-after-quarter, again, almost   97% for both the second quarter and the first half of the year,   which we believe qualifies as full employment.",
    "TEN's flexible chartering strategy ensures that most of the   time, the Company outperforms the spot market and this helps the   Company maintain an impeccable debt service record and meet all   our obligation irrespective of where we are in the market cycle.   Thanks to the profit-sharing element, that's a big portion of the   fleet, TEN benefit further when market conditions improve further   as we expect the market to do going forward. Based on the current   conditions and the number of vessels operating in the spot market   and in time charter with profit-sharing, for every $1,000 dollars   increase in spot market rates, we have a positive $0.06 impact on   annual EPS.",
    "Debt reduction is an integral part of the Company's strategy.   Debt sit at around $1.7 billion at the end of 2017, and in the   last 18 months, we have reduced the Company's debt by $221   million, taking down the net debt to capital ratio at the end of   the second quarter of 2019 at below 50%. At the end of July, the   Company fully redeemed the highly successful $50 million Series B   shares.",
    "Despite the headwind from the US-China trade war and its   potential spillover affects the rest of the world, global oil   demand continues to grow. The latest forecast from the   International Energy Agency calls for 1.1 million barrels per day   oil demand growth this year and 1.3 million barrels per day next   year. The USA is now the biggest crude oil producer and US crude   oil exports continue to grow. This, combined with geopolitical   tension, supply disruptions, the US-led sanctions against   Venezuela and Iran, and OPEC production cuts are positive for   tonne miles and global fleet utilization as substitute barrels   travel longer distances to each importers, refiners and   consumers.",
    "We had a longer than usual refinery maintenance season in the   first half of 2019, as global refineries were preparing for   IMO2020 low sulfur fuel oil switch. However, global refinery   throughputs are picking up and expected to require another on   average 1 million barrels per day of more crude oil than they did   in the first half of the year.",
    "On the supply of tonnage, the order book is at 7.7%, and this   is a low number compared to historical level. A big part of the   fleet is over 15 years, and environmental regulations starting   with retrofitting water ballast treatment systems and scrubbers   to comply with IMO2020 create delays as scrubber retrofitting   takes longer than initially forecasted. While shipyard works at   full capacity to meet retrofitting requirements which could keep   longer, a big part of the global fleet in shipyards rather than   trading and this could push more tankers approaching or above 20   years to go for scrapping.",
    "Last year was one of the highest scrapping years of records.   This year's scrapping as expected is lower. But with more than   1,000 tankers older than 15 years, enforced [Phonetic]   environmental regulations, we could see a pickup in scrapping,   especially for those vessels approaching for above 20 years. The   graph on the right side of the slide is a forecast from   Fearnleys, a well-known ship broker from Norway. As you can see,   VLCC rates are expected to trend higher and reach multi-year   heights going forward. We are also very positive about the market   prospects and expect a strong market for all vessel categories.   This environment, we believe that the Company's fleet is   well-positioned to capture any market opportunity that will be   presented. That concludes the operational part of our   presentation.",
    "Paul will walk you through the financial highlights for the   second quarter and first half. Paul?",
    " Paul Durham    --   Chief Financial Officer ",
    "Thank you, George. Well, after a profitable quarter one, TEN   continued on a profitable path in quarter two, despite   difficulties arising from refinery disruptions, fleet   overcapacity, OPEC cuts, and of course, seasonal factors.   Nevertheless, TEN was able to generate a net income of $300,000,   a considerably better result from that loss of over $9 million in   the prior quarter two. For the half year, there was net income of   $11.5 million compared to $21.5 million loss in the first six   months of 2018, a $33 million positive reversal. The profit was   mainly due to an increase in revenue by 16% in quarter two and   half year over the prior periods, partly due to new accretive   time charters, including those of the LNG carriers. Increased   long-haul voyages helped our spot vessels to earn freight at an   average 30% more than in the prior quarter two.",
    "Daily TCE per vessel in quarter two and six-months averaged   over $20,000, well above average market rates due to our time   charters that again generated enough to pay operating overhead   and finance cash costs. Operating income increased five-fold from   the prior quarter two to reach $19 million, despite some increase   in OpEx due to timing and higher maintenance and fares, offset by   a stronger dollar. Otherwise, average daily OpEx per vessel   stayed well under $8,000, while other expenses remained stable or   fell from those of the prior quarter two.",
    "Finance costs were up by $6.5 million in quarter two, mainly   due to bunker hedge losses and negative non-cash movements in   valuations. However, loan interest remain stable with interest   rate increases being offset by a substantial $142 million   reduction in outstanding debt in the past year. In quarter two   itself, net debt was reduced by $52 million, leaving cash   balances of $193 million at the end of the half year with our net   debt to capital at 48%. EBITDA in quarter two amounted to $56   million, 33% higher than in the prior quarter two and $120   million for the six months, a 43% increase.",
    "On top of the significant reduction in outstanding loans, we   also redeemed the Series B preferred stock in July, with $50   million returned to stockholders. So all in all, we are pleased   with the results in the first six months given the difficult   market and we remain optimistic for the rest of 2019 and beyond,   based on low inventories, completed refinery maintenance, high US   oil exports and reduced tanker deliveries, recognizing that we   are approaching a period of probable disruption that may reduce   the availability of tankers that in turn will have a positive   effect on returns.",
    "And now I'll hand the call back to Nikolas.",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "Thank you, Paul, for another quarter of positive news. And we   are, as I said, glad being one of the very few in our peer group,   if not the only one that is positive this quarter and for the   first six months. We are able to achieve this by tight control on   the actual assets, maintaining operating expenses and utilization   at very high rates. And our chartering strategy gives us the   ability to outperform the spot markets significantly. This -- the   first six months, we had a 36% outperformance of the spot market   that has enabled the Company to be profitable. Our VLCCs   performed significantly better than the spot market in the first   six months, the same with our Suezmaxes, Aframaxes, Panamaxes in   every single sector that we participate, we have to outperformed   the market significantly, with a total average of 36% in that   growth.",
    "Also, a very important part of our business has to do with   reducing debt. And I think as Mr. Saroglou George said, reducing   debt and repaying our initial Series B preferred was one of the   highlights of the first six months and hence still realizing a   very strong liquidity. But also interest rate reduction is very   positive for our business. Just to put to in a perspective, every   1% reduction in interest rate is almost $15 million straight down   to our bottom line. So that's a very significant number going   forward.",
    "On the growth side, our long-term strategic relationships are   maintained. Our operational excellence is appreciated by the end   users that they would rather do business with companies with a   long-term solid profile like ourselves. Four vessels with a   strategic relationship to a US major oil company with very long   employment starting this quarter and going -- or I guess starting   next fourth quarter and one vessel every quarter following. And   of course, then the expansion on the LNG -- in the LNG sector   continues, and a lot of accretive business in the backlog as we   speak, which gives us a very positive feeling that the market is   expected to go from strength to strength, at least in the medium   to near future.",
    "And with this, I would like to open the floor for any   questions that you may have.",
    " Operator ",
    "Thank you very much, sir. [Operator Instructions] Okay. Our   first question for today is from J Mintzmyer [Phonetic] from   Value Investors.",
    " J Mintzmyer    --   Value Investors -- Analyst ",
    "Hi, good morning gentlemen. Congratulations on the LNG   order.",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "Thank you.",
    " J Mintzmyer    --   Value Investors -- Analyst ",
    "Yes. I'm looking at the timing of your installment payments   for your two Aframaxes, two Suezmaxes, and one-option-one LNG. Is   that correct? And then also, what is the timing of those   installments, both for the rest of 2019, 2020 and then 2021?",
    " Paul Durham    --   Chief Financial Officer ",
    "Well, to-date we paid for the four vessels, $25 million we've   paid already out of our pocket. We expect to pay another $55   million from our pocket in the remainder of the year -- I beg   your pardon, $5 million in the remainder of the year. And   drawdowns we shall have from our banks, they're providing   pre-financing -- pre-delivery refinancing. Drawdowns will amount   to $45 million by the end of the year. And future drawdowns   within the year, we have $26 million. And going into 2020, we   have a further $122 million and that's being provided by the   delivery date.",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "So I think, actually from equity, it's another $5 million for   the vessels.",
    " Paul Durham    --   Chief Financial Officer ",
    "In addition to the $25 million already paid.",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "In addition to the $25 million already paid.",
    " J Mintzmyer    --   Value Investors -- Analyst ",
    "Okay. So I'm hearing $5 million additional equity for the rest   of the year. And what's the amount you anticipate? I know all the   financing is probably not wrapped up yet, especially for the LNG   carriers, but what's the amount of equity that you anticipate   spending in 2020 and then 2021 for those vessels?",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "I think the only -- the finance is wrapped up for all the   other vessels with a queue of financiers for the LNGs. So we   expect that perhaps another $40 million of equity within --   between 2020 and '21 for the LNG carrier.",
    " J Mintzmyer    --   Value Investors -- Analyst ",
    "So what's kind of wrapping up on that? What's the target   leverage for those vessels? It sounds to me like it's in the 70%,   80% range, is that about right?",
    " Paul Durham    --   Chief Financial Officer ",
    "We try to be conservative. As you know, we have a conservative   balance sheet and we'd rather keep it closer to 70% rather than   the 80%.",
    " J Mintzmyer    --   Value Investors -- Analyst ",
    "Excellent. Thank you. And then the other question I have   similar is on your debt facilities. I know you've targeted   refinancing the balloons, but you plan to pay down your regular   amortization payments. Can you remind me what the remaining   amortization payments are for the rest of 2019, also for 2020 and   scheduled for 2021?",
    " Paul Durham    --   Chief Financial Officer ",
    "Right. Our scheduled repayments for the remainder of 2019 $84   million. Going into 2020, we're going -- do you want to know   future years as well? Okay. So for the remainder of this year, we   have scheduled $84 million to pay.",
    " J Mintzmyer    --   Value Investors -- Analyst ",
    "And then, do you have the numbers available for 2020 or 2021   yet?",
    " Paul Durham    --   Chief Financial Officer ",
    "Yes, sure. 2020, we have $166 million and it is a scheduled   payments, not balloons. Going into 2021, we have $141 million.   And if we're going into '22, here we've got another $128   million.",
    " J Mintzmyer    --   Value Investors -- Analyst ",
    "Excellent. Thanks for the color on that. And then final   question for me. We talked a little bit about scrubbers in the   call and how those are adding some delays. I know previous calls   you mentioned that there might be some customers that would pay   for the scrubbers as part of their charters. Has there been any   deals made on that, like how many of your fleet are tied up on   scrubbers?",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "Well, as I said, we have -- we will have about 8 vessels,   including the newbuilds with scrubbers, all of them paid by the   charters in the time that we will retrofit them and the cost.",
    " J Mintzmyer    --   Value Investors -- Analyst ",
    "Fantastic. So no capex expected for the scrubbers. Is that   correct?",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "The opposite. We will be earning money sitting at the yard   while this is happening. So actually it will be more profitable,   because we will not have any oil consumption.",
    " J Mintzmyer    --   Value Investors -- Analyst ",
    "Excellent. Thank you very much gentlemen.",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "Thank you.",
    " Operator ",
    "[Operator Instructions]. The next one is from Randy Giveans   from Jefferies. Please go ahead.",
    " Christopher Robertson    --   Jefferies -- Analyst ",
    "Good morning, gentlemen. This is Chris Robertson on for Randy.   Thanks for taking our questions.",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "Hi, Chris.",
    " Christopher Robertson    --   Jefferies -- Analyst ",
    "Hi. So, Nikolas mentioned operating expense control and the   utilization rate that was strong in the quarter, so it looks like   you were able to achieve close to a 97% utilization rate. Do you   expect similar results for the remainder of the year? And will   any IMO2020 preparations cut into that? Any disruptions there   regarding the changeover in fuels?",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "Well, if you go back to, I would say even to the last 5 or 10   years history, you see we average well above the 95%, 85% is the   industry average. So 97% we expect to be a very constant number.   If you -- and as I said in the previous answer, the reason we   would maintain this is because our -- the time we would be taking   for the scrubber installations are going to be paid. So there   would be no downtime. It will be paid by the charters. So, yes,   we expect to maintain because of the chartering profile. We have   to maintain the same high utilization going forward.",
    " Christopher Robertson    --   Jefferies -- Analyst ",
    "Got you. And can you talk a little bit about the operational   plans to make the changeover in fuels?",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "Yes, I have a big team that can say much more things than I   do, but they are away from the speaker right now. Yes, I think we   are preparing -- at least in the mind [Phonetic] -- that we are   preparing the ships during the passage in order of cleaning the   tanks. And so we do not have any off-hire. If we have any   scheduled delays, if we have any scheduled repairs, these repairs   are going to be used at the same time to clean the tanks for the   low -- for the low sulfur. So we do not really expect any major   delays in what we will be doing in the preparation and having 70%   of the fleet with long-term employment, it helps very, very --   very much because we have the cooperation of the charters,   because they are actually the owners of the products that we   burn.",
    " Christopher Robertson    --   Jefferies -- Analyst ",
    "Got you. And then with regards to the reduction in the vessel   OpEx, was that fairly low hanging fruit and what additional steps   could the technical managers take in coming quarters to maybe   drive that down further?",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "Well, I think for us, we are -- first of all, we are running a   fleet at utilization of 97%, and at the same time we are -- we   have on average the lowest, at least from the tanker owners, OpEx   and G&A expenses in the industry. We have a vertical   operation. So we actually -- whatever happens on a ship -- it   does not happen in India or somewhere else, it happens within the   premises that we all operate where the Company is headquartered.   So we are able to have very quick reaction and on-hand control,   and that's why we would like to also appreciate the efforts of   our seafarers and our ship managers and -- that are cooperating   so close with the commercial department to try and keep operating   expenses even lower. And I think what would help a little bit   more will be a stronger dollar, which we should not exclude.",
    " Christopher Robertson    --   Jefferies -- Analyst ",
    "Got you. And last question for me. Regarding the Aframax   tankers, are any of the crude tankers operating in the product   tanker trade, what trade do you think will benefit more in the   lead up to IMO implementation and any update on the lightering   activity in the US or Latin American markets with your Aframax   tankers?",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "Well, that's a very good question, and I think if you can go   to -- if you go to page of our fleet, you'll see that we have   right now, the three of our vessels, which are the Proteas,   Promitheas, Propontis, that our Aframax is trading, trading clean   right now, and which is -- I would say it's a market which is   getting a lot of positive news because of the different   dislocations of high and low sulfur crudes. So we have three of   those ships trading on the Aframaxes in the clean trade. And it's   a very good question which -- we believe that initially perhaps.   The product market might get an early start in a positive   environment because of the dislocations of the various refinery   -- the refiners. However, in order for refineries to produce the   right product, they would have to find the right crude. So I   think the crude market then will follow also. And I will give you   very quick example, because I'm sure [Phonetic] you're all -- the   US refineries because you are used to actually crack heavier   crudes are better prepared for producing low sulfur than the,   let's call them the Western European refineries. So we might see   products coming to -- coming from the United States to Europe,   low sulfur product.",
    "Then, of course, in order to -- and also, we might see lighter   crudes. We also like lighter crudes that will have to be used to   mix with the heavier crudes that we have, the Russian crudes,   which are heavier. So the crude market will also take -- I think   will have an advantage of longer tonne miles. So I think the   whole segment will have a dislocation and disruption, but will be   positive for supply.",
    " Christopher Robertson    --   Jefferies -- Analyst ",
    "Got you. Appreciate the time.",
    " Operator ",
    "Thank you very much. Gentlemen, there are no further questions   waiting. I'll hand the call back to you for closing remarks.   Thank you.",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "Thank you. Chairman?",
    " Efstratios Arapoglou    --   Chairman of the Board ",
    "Well, as Nikolas Tsakos said earlier, we remain optimistic   going forward, totally focused on our strategy, which has been   paying off the way it has been executed. In October, we have a   new strategy meeting. We will review as appropriate, and of   course, let you know of any changes in the next results quarter.   So thank you very much from me. Over to you Nikolas.",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    "Well, thank you, Chairman, and I think looking forward to meet   face to face with our shareholders. We have a big week in London   next week with London Maritime Week. And I think Capital Link --   the Capital Link event with a lot of a chance to see our European   investors or whoever from the United States is in London. And   then in October, we have the LNG Conference in Houston, which   coincides with again the various events Capital Link events in   New York, where the team will be there. And in the meantime, we   will hope to be able to maintain and be able to give you good   news in November when we report our nine months results and   hopefully come up with even better results going forward. And   again, thank you for your support. And looking forward to a   healthy second half of the year. Thank you.",
    " Operator ",
    "[Operator Closing Remarks].",
    " Duration: 36 minutes ",
    " Nicolas Bornozis    --   Investor Relations ",
    " Efstratios Arapoglou    --   Chairman of the Board ",
    " Nikolas P. Tsakos    --   Founder, President & Chief Executive Officer ",
    " George V. Saroglou    --   Chief Operating Officer ",
    " Paul Durham    --   Chief Financial Officer ",
    " J Mintzmyer    --   Value Investors -- Analyst ",
    " Christopher Robertson    --   Jefferies -- Analyst ",
    " More TNP analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than Tsakos Energy   Navigation     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Tsakos Energy   Navigation wasn't one of them! That's right --   they think these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:23:38"
}