{
  "url": "https://www.nasdaq.com/article/energy-sector-update-for-09052019-pteneqnrmusa-cm1208189",
  "title": "Energy Sector Update for 09/05/2019: PTEN,EQNR,MUSA - Nasdaq.com",
  "text": [
    "Top Energy Stocks",
    "XOM +1.27%",
    "CVX +0.74%",
    "COP +0.45%",
    "SLB +3.21%",
    "OXY +3.13%",
    "Energy stocks were mostly higher Thursday, with the NYSE Energy Sector Index climbing almost 1.6% while shares of energy companies in the S&P 500 also were up nearly 1.5% as a group. West Texas Intermediate crude oil for October delivery was rising 85 cents to $57.11 per barrel at the New York Mercantile Exchange while the global benchmark Brent crude November contract was advancing 92 cents to $61.62 per barrel. October natural gas futures were 1 cent lower at $2.43 per 1 million BTU. Among energy-related ETFs, the United States Oil fund was posting a nearly 0.8% gain while the United States Natural Gas fund was falling just over 0.4%. The Philadelphia Oil Service Sector index also was up almost 3.7% this afternoon.",
    "Among energy stocks moving on news:",
    "(+) Patterson-UTI Energy ( PTEN  ) rose almost 5% on Thursday after the oilfield-services company said it ran an average of 142 drill rigs during August, down from an average of 150 rigs operating under contract during the prior month and also trailing the 178 drill rigs in operation during August 2018.",
    "In other sector news:",
    "(+) Equinor ( EQNR  ) climbed 7.3% after the Norwegian energy major said it has authorized the repurchase of up to $5 billion of its common stock through the end of 2022. The company also said it is expected to begin operations from the Johan Sverdrup oilfield in October, a month earlier than originally planned.",
    "(+) Murphy USA ( MUSA  ) was 2.8% higher after saying it priced a $500 million private placement of of 4.750% senior notes due 2029 at par. Net proceeds, plus cash on hand, will be used to redeem all $500 million of the convenience-store and gasoline seller's 6.000% senior notes due 2023.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-05 01:19:34"
}