{
  "url": "https://www.nasdaq.com/article/france-we-cant-allow-facebooks-libra-in-europe-20190912-00168",
  "title": "France: we can't allow Facebook's Libra in Europe - Nasdaq.com",
  "text": [
    "PARIS, Sept 12 (Reuters) - Facebook's  Libra cryptocurrency cannot be allowed to operate in Europe while concerns persist about sovereignty, systemic financial risks and the risk of abuses by a dominant market player, France's finance minister said on Thursday.",
    "The world's largest social media network announced plans in June to launch the new currency as it expands into e-commerce but Libra has come under fire from regulators around the world who fear it could destabilise the global financial system.",
    "The minister, Bruno Le Maire, did not spell out how France could keep Libra out of the 28-member European Union.",
    "Talking about the Libra project at a meeting of the Organisation for Economic Co-operation and Development in Paris, Le Maire said: \"This eventual privatisation of money contains risks of abuse of dominant position, risks to sovereignty, and risks for consumers and for companies.\"",
    "The Group of Seven advanced economies warned in July that it would not let Libra proceed until all regulatory concerns have been addressed, saying that a prolonged discussion over the project may first be required. ",
    "\"Libra also represents a systemic risk from the moment when you have two billion users. Any breakdown in the functioning of this currency, in the management of its reserves, could create considerable financial disruption,\" Le Maire said.",
    "\"All these concerns about Libra are serious. I therefore want to say with plenty of clarity: in these conditions we cannot authorise the development of Libra on European soil.\"",
    "In another setback this week for Libra, Switzerland said the proposed payments system could face strict rules that typically apply to banks, on top of tough anti-money laundering laws. "
  ],
  "published_datetime": "2019-09-12 06:12:00"
}