{
  "url": "https://www.nasdaq.com/article/what-investors-need-to-know-about-lululemon-lulu-stock-before-q2-earnings-cm1206943",
  "title": "What Investors Need to know About Lululemon (LULU) Stock Before Q2 Earnings - Nasdaq.com",
  "text": [
    "       Welcome to the latest episode of the Full-Court Finance podcast from Zacks Investment Research where Associate Stock Strategist Ben Rains dives into everything investors need to know about Lululemon LULU  stock before the company reports its Q2 earnings results on Thursday. The yoga and athleisure retailer looks impressive as it expands its business to further challenge everyone from Nike NKE  to Adidas ADDYY  . Overall, the second quarter earnings season has been a mixed bag for retailers. Department stores such as Nordstrom JWN  and Macy's M  have failed to inspire much investor confidence. Meanwhile, Walmart WMT  and Target TGT  continued to show they can thrive in the Amazon AMZN  age. Moving on, Lululemon's rise helped push the rest of the industry from Nike to Gap GPS  and L Brands' LB  Victoria's Secret to all roll out more yoga-focused and athleisure offerings. On top of that, the Vancouver, Canada-based company has expanded its menswear unit, introduced self-care products, and rolled out more outwear to better compete with the likes of Canada Goose GOOS  and The North Face VFC  . Going forward, Lululemon plans to extend its international push as it tries to expand beyond North America and Australia/New Zealand deeper into Asia and Europe. LULU is also currently testing a membership program and opened a massive new \"experiential\" store in Chicago. Furthermore, Lululemon has bolstered its e-commerce and digital business. Looking ahead, our current Zacks Consensus Estimates call for the firm's Q2 revenue and earnings to climb 16.7% and 25.4%, respectively. This would represent a slowdown from the first quarter's expansion, but still looks strong historically speaking. Despite its strong 2019, LULU stock rests roughly 7% below its 52-week highs and is a Zacks Rank #3 (Hold) at the moment. Lululemon is scheduled to release its Q2 fiscal 2019 financial results after the closing bell on Thursday, September 5. So, make sure to come back to Zacks for a full break down then. As a reminder, if you feel that we missed something, or if you have any topic suggestions, shoot us an email at podcast@zacks.com. Make sure to check out all of our other audio content at zacks.com/podcasts, and remember to subscribe and leave us a rating wherever you listen to your podcasts.  Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Amazon.com, Inc. (AMZN): Free Stock Analysis Report   Canada Goose Holdings Inc. (GOOS): Free Stock Analysis Report   The Gap, Inc. (GPS): Free Stock Analysis Report   L Brands, Inc. (LB): Free Stock Analysis Report   Nordstrom, Inc. (JWN): Free Stock Analysis Report   lululemon athletica inc. (LULU): Free Stock Analysis Report   Walmart Inc. (WMT): Free Stock Analysis Report   Target Corporation (TGT): Free Stock Analysis Report   Macy's, Inc. (M): Free Stock Analysis Report   NIKE, Inc. (NKE): Free Stock Analysis Report   Adidas AG (ADDYY): Free Stock Analysis Report   V.F. Corporation (VFC): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Welcome to the latest episode of the Full-Court Finance podcast from Zacks Investment Research where Associate Stock Strategist Ben Rains dives into everything investors need to know about Lululemon LULU  stock before the company reports its Q2 earnings results on Thursday. The yoga and athleisure retailer looks impressive as it expands its business to further challenge everyone from Nike NKE  to Adidas ADDYY  .",
    "Overall, the second quarter earnings season has been a mixed bag for retailers. Department stores such as Nordstrom JWN  and Macy's M  have failed to inspire much investor confidence. Meanwhile, Walmart WMT  and Target TGT  continued to show they can thrive in the Amazon AMZN  age.",
    "Moving on, Lululemon's rise helped push the rest of the industry from Nike to Gap GPS  and L Brands' LB  Victoria's Secret to all roll out more yoga-focused and athleisure offerings. On top of that, the Vancouver, Canada-based company has expanded its menswear unit, introduced self-care products, and rolled out more outwear to better compete with the likes of Canada Goose GOOS  and The North Face VFC  .",
    "Going forward, Lululemon plans to extend its international push as it tries to expand beyond North America and Australia/New Zealand deeper into Asia and Europe. LULU is also currently testing a membership program and opened a massive new \"experiential\" store in Chicago. Furthermore, Lululemon has bolstered its e-commerce and digital business.",
    "Looking ahead, our current Zacks Consensus Estimates call for the firm's Q2 revenue and earnings to climb 16.7% and 25.4%, respectively. This would represent a slowdown from the first quarter's expansion, but still looks strong historically speaking.",
    "Despite its strong 2019, LULU stock rests roughly 7% below its 52-week highs and is a Zacks Rank #3 (Hold) at the moment. Lululemon is scheduled to release its Q2 fiscal 2019 financial results after the closing bell on Thursday, September 5. So, make sure to come back to Zacks for a full break down then.",
    "As a reminder, if you feel that we missed something, or if you have any topic suggestions, shoot us an email at podcast@zacks.com. Make sure to check out all of our other audio content at zacks.com/podcasts, and remember to subscribe and leave us a rating wherever you listen to your podcasts.",
    " Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:05:00"
}