{
  "url": "https://www.nasdaq.com/article/cleveland-cliffs-announces-dividend-increase-and-special-dividend-shares-drop-anyway-cm1206847",
  "title": "Cleveland-Cliffs Announces Dividend Increase and Special Dividend; Shares Drop Anyway - Nasdaq.com",
  "text": [
    " What happened Shares of U.S. iron-ore producer   Cleveland-Cliffs    (NYSE: CLF) were down 13.3% as of 12:30 p.m. EDT today. The stock   drop came after management announced it was increasing its   dividend, as well as issuing a special one-time dividend. So what According to the company's press release, Cleveland-Cliffs   will be increasing its quarterly dividend to $0.06 per share, or   $0.24 on an annualized basis. This is up 20% from its previous   quarterly dividend payment. On top of the regular dividend,   management also announced it would be issuing a special dividend   of $0.04 per share.   Image source: Getty Images.makeArticleAd();  Cleveland-Cliffs' management is trying to get back into the   habit of returning to cash to shareholders. After several years   of debt reduction and investing in a new ore upgrading facility   -- its hot-briquetted iron plant in Toledo, Ohio -- management   believes it has the financial flexibility to start   giving back cash via both dividends and   buybacks    . In the first six months of the year, it repurchased $252   million in stock. If that wasn't enough of an encouraging sign, a   couple of directors and chief financial officer Keith Koci have   bought stock on the open market in the past month. Now what As to why the stock dropped after Cleveland-Cliffs announced   this seemingly good news, your guess is as good as mine. Steel   and iron-ore prices have been sliding lately as the potential for   a global slowdown    increases. So there may be a concern that this was a last-gasp   move before things get worse. Full disclosure: I am a shareholder and unabashedly optimistic   that management will be able to navigate whatever the iron-ore   market throws at it. While lower iron-ore prices may result in   the company taking a financial hit, its balance sheet is in much   better shape than it has been in years, and its geographically   advantageous mines in the U.S. do have some small pricing power   thanks to much lower transportation costs. This sell-off today seems to be an opportunity for   shareholders to add to their positions. I can't for another two   days per   The Motley Fool's trading policy    , but I plan to do so when I can.   10 stocks we like better than Cleveland-Cliffs       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Cleveland-Cliffs wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Tyler Crowe      owns shares of Cleveland-Cliffs. The Motley Fool has no     position in any of the stocks mentioned. The Motley Fool has a     disclosure policy      .  ",
    "Shares of U.S. iron-ore producer   Cleveland-Cliffs    (NYSE: CLF) were down 13.3% as of 12:30 p.m. EDT today. The stock   drop came after management announced it was increasing its   dividend, as well as issuing a special one-time dividend.",
    "According to the company's press release, Cleveland-Cliffs   will be increasing its quarterly dividend to $0.06 per share, or   $0.24 on an annualized basis. This is up 20% from its previous   quarterly dividend payment. On top of the regular dividend,   management also announced it would be issuing a special dividend   of $0.04 per share.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Cleveland-Cliffs' management is trying to get back into the   habit of returning to cash to shareholders. After several years   of debt reduction and investing in a new ore upgrading facility   -- its hot-briquetted iron plant in Toledo, Ohio -- management   believes it has the financial flexibility to start   giving back cash via both dividends and   buybacks    . In the first six months of the year, it repurchased $252   million in stock. If that wasn't enough of an encouraging sign, a   couple of directors and chief financial officer Keith Koci have   bought stock on the open market in the past month.",
    "As to why the stock dropped after Cleveland-Cliffs announced   this seemingly good news, your guess is as good as mine. Steel   and iron-ore prices have been sliding lately as the potential for   a global slowdown    increases. So there may be a concern that this was a last-gasp   move before things get worse.",
    "Full disclosure: I am a shareholder and unabashedly optimistic   that management will be able to navigate whatever the iron-ore   market throws at it. While lower iron-ore prices may result in   the company taking a financial hit, its balance sheet is in much   better shape than it has been in years, and its geographically   advantageous mines in the U.S. do have some small pricing power   thanks to much lower transportation costs.",
    "This sell-off today seems to be an opportunity for   shareholders to add to their positions. I can't for another two   days per   The Motley Fool's trading policy    , but I plan to do so when I can.",
    "  10 stocks we like better than Cleveland-Cliffs       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Cleveland-Cliffs wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Cleveland-Cliffs       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Cleveland-Cliffs wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Tyler Crowe      owns shares of Cleveland-Cliffs. The Motley Fool has no     position in any of the stocks mentioned. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:28:00"
}