{
  "url": "https://www.nasdaq.com/article/crown-holdings-cck-strong-on-rising-can-demand-costs-high-cm1210552",
  "title": "Crown Holdings (CCK) Strong on Rising Can Demand, Costs High - Nasdaq.com",
  "text": [
    " On Sep 10, we issued an updated research report on Crown Holdings, Inc. CCK  . The company is well poised to benefit from growing global beverage-can demand, strategic acquisitions to increase geographic presence and product line, and focus on cost control. However, near-term capacity constraints in Brazil, lower volumes in European food can market, weak Transit Packaging segment performance, and input cost inflation remain near-term headwinds.  makeArticleAd(); Headwinds to Counter in 2019    Crown Holdings now anticipates adjusted earnings per share to be $5.05-$5.20 for 2019. The company had reported earnings per share of $5.20 in fiscal 2018. This can primarily be attributed to expected weak performances from the European Food, Transit Packaging and Americas Beverage segments. The European food can market is a mature market, which has witnessed declining volumes in recent years. The Transit Packaging segment's outlook is grim given the slowdown in the global manufacturing activity.    In the Brazilian markets, can demand remains high but Crown Holdings will be unable to meet the demand owing to shortage of capacity till the new Rio Verde project comes online. Further, the company anticipates significant reduction in can demand in Columbia in the back half of this year. This along with the capacity constraints in Brazil will impact results for the Americas Beverage segment in the second half from the prior year. Sales unit volumes in the Middle East have declined in the recent years on account of geopolitical tensions.    Crown Holdings uses various raw materials, such as steel, aluminum, tin, water, natural gas, electricity and other processed energy in its manufacturing operations. Cost of these raw materials has flared up owing to the tariffs imposed in the United States.    Given these concerns, the Zacks Consensus Estimate for Crown Holdings' earnings in 2019 is currently pegged at $5.09, indicating a decline of 2.12% from the year-ago quarter.   Poised Well to Capitalize on Rising Demand    With its many inherent benefits, including being infinitely recyclable, the beverage can continues to become the increasingly preferred package for marketers and consumers globally. Developing markets have experienced higher growth rates due to rising per capita income and the consequent increase in beverage consumption. While the economies in Europe and North America are more mature, there are still opportunities to capitalize on driven by beverages, such as energy drinks, teas, juices, sparkling water and craft beer, and an increased preference for cans over certain other forms of beverage packaging.    To capitalize on this trend, Crown Holdings intends to build new facilities and is positioned to gain from the geographic expansion of its beverage can lines. To meet volume requirements in the U.S. and Canadian beverage can markets, the company has begun construction of a third high-speed line at its Nichols, NY facility, which is expected to commence production during the second quarter of 2020. The conversion of an existing two-piece steel food can production line at the Weston, Ontario plant, to aluminum beverage cans, is anticipated to be completed in the first quarter of 2020. Both the Nichols and Weston lines will be capable of producing multiple sizes. Additionally, during the fourth quarter of 2019, the company anticipates beginning operations at a new one-line beverage can plant in Rio Verde, Brazil.   Acquisitions Will Boost Growth    In April 2018, Crown Holdings acquired Signode Industrial Group Holdings, which is a leading global provider of transit packaging systems and solutions. This broad and diversified Crown Holdings' customer base and product offerings will benefi t earnings  and cash flow in 2019. Further, its previous acquisition of EMPAQUE, a leading manufacturer for the beverage industry in Mexico, reinforced the company's presence in the growing Mexican market.   Price Performance         Over the past year, shares of Crown Holdings gained 43.4% compared with the industry  's rally of 52.6%.   Zacks Rank and Stocks to Consider    Crown Holdings currently carries a Zacks Rank #3 (Hold).    Some better-ranked stocks in the Industrial Products  sector are AGCO Corporation AGCO  , Albany International Corporation AIN  and UFP Technologies, Inc. UFPT  . All of these stocks carry a Zacks Rank of 2 at present. You can see  the complete list of today's Zacks #1 Rank stocks   here   .    AGCO Corp has a projected earnings growth rate of 31.11% for the current year. The stock has gained 26% in a year.    Albany International has an estimated earnings growth rate of 33.85% for 2019. The company's shares have gained 8% in the past year.    UFP Technologies has an expected earnings growth rate of 8.10% for the ongoing year. The stock has appreciated 11% over the past year.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Crown Holdings, Inc. (CCK): Free Stock Analysis Report   UFP Technologies, Inc. (UFPT): Free Stock Analysis Report   AGCO Corporation (AGCO): Free Stock Analysis Report   Albany International Corporation (AIN): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "On Sep 10, we issued an updated research report on Crown Holdings, Inc. CCK  . The company is well poised to benefit from growing global beverage-can demand, strategic acquisitions to increase geographic presence and product line, and focus on cost control. However, near-term capacity constraints in Brazil, lower volumes in European food can market, weak Transit Packaging segment performance, and input cost inflation remain near-term headwinds.  makeArticleAd(); Headwinds to Counter in 2019    Crown Holdings now anticipates adjusted earnings per share to be $5.05-$5.20 for 2019. The company had reported earnings per share of $5.20 in fiscal 2018. This can primarily be attributed to expected weak performances from the European Food, Transit Packaging and Americas Beverage segments.",
    "The European food can market is a mature market, which has witnessed declining volumes in recent years. The Transit Packaging segment's outlook is grim given the slowdown in the global manufacturing activity.    In the Brazilian markets, can demand remains high but Crown Holdings will be unable to meet the demand owing to shortage of capacity till the new Rio Verde project comes online. Further, the company anticipates significant reduction in can demand in Columbia in the back half of this year. This along with the capacity constraints in Brazil will impact results for the Americas Beverage segment in the second half from the prior year. Sales unit volumes in the Middle East have declined in the recent years on account of geopolitical tensions.    Crown Holdings uses various raw materials, such as steel, aluminum, tin, water, natural gas, electricity and other processed energy in its manufacturing operations. Cost of these raw materials has flared up owing to the tariffs imposed in the United States.    Given these concerns, the Zacks Consensus Estimate for Crown Holdings' earnings in 2019 is currently pegged at $5.09, indicating a decline of 2.12% from the year-ago quarter.   Poised Well to Capitalize on Rising Demand    With its many inherent benefits, including being infinitely recyclable, the beverage can continues to become the increasingly preferred package for marketers and consumers globally. Developing markets have experienced higher growth rates due to rising per capita income and the consequent increase in beverage consumption. While the economies in Europe and North America are more mature, there are still opportunities to capitalize on driven by beverages, such as energy drinks, teas, juices, sparkling water and craft beer, and an increased preference for cans over certain other forms of beverage packaging.    To capitalize on this trend, Crown Holdings intends to build new facilities and is positioned to gain from the geographic expansion of its beverage can lines. To meet volume requirements in the U.S. and Canadian beverage can markets, the company has begun construction of a third high-speed line at its Nichols, NY facility, which is expected to commence production during the second quarter of 2020.",
    "The conversion of an existing two-piece steel food can production line at the Weston, Ontario plant, to aluminum beverage cans, is anticipated to be completed in the first quarter of 2020. Both the Nichols and Weston lines will be capable of producing multiple sizes. Additionally, during the fourth quarter of 2019, the company anticipates beginning operations at a new one-line beverage can plant in Rio Verde, Brazil.   Acquisitions Will Boost Growth    In April 2018, Crown Holdings acquired Signode Industrial Group Holdings, which is a leading global provider of transit packaging systems and solutions. This broad and diversified Crown Holdings' customer base and product offerings will benefi t earnings  and cash flow in 2019. Further, its previous acquisition of EMPAQUE, a leading manufacturer for the beverage industry in Mexico, reinforced the company's presence in the growing Mexican market.   Price Performance ",
    "       Over the past year, shares of Crown Holdings gained 43.4% compared with the industry  's rally of 52.6%.   Zacks Rank and Stocks to Consider    Crown Holdings currently carries a Zacks Rank #3 (Hold).    Some better-ranked stocks in the Industrial Products  sector are AGCO Corporation AGCO  , Albany International Corporation AIN  and UFP Technologies, Inc. UFPT  . All of these stocks carry a Zacks Rank of 2 at present. You can see  the complete list of today's Zacks #1 Rank stocks   here   .    AGCO Corp has a projected earnings growth rate of 31.11% for the current year. The stock has gained 26% in a year.    Albany International has an estimated earnings growth rate of 33.85% for 2019. The company's shares have gained 8% in the past year.    UFP Technologies has an expected earnings growth rate of 8.10% for the ongoing year. The stock has appreciated 11% over the past year.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:40:00"
}