{
  "url": "https://www.nasdaq.com/article/the-descartes-systems-group-inc-dsgx-q2-earnings-call-transcript-cm1208158",
  "title": "The Descartes Systems Group Inc (DSGX) Q2 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   The Descartes Systems Group Inc    (NASDAQ: DSGX)        Q2 2020 Earnings Call       September 4, 2019,   5:00 p.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Welcome to the quarterly results call. My name is Erin and I   will be the operator for this call. At this time, all   participants are in a listen-only mode. Later, we will conduct a   question and answer session. If you would like to ask a question   during today's presentation, please press * then 1 on your touch   tone telephone. Please note that this conference is being   recorded. I will now turn the call over to Scott Pagan. Scott, you may   begin.  Scott Pagan -- President and Chief Operating Officer  Thanks and good afternoon, everyone. Joining me on the call   today are Ed Ryan, CEO and Allan Brett, CFO. I trust that   everyone has received a copy of our financial results press   release that was issued earlier today. Portions of today's call   other than historical performance include statements of   forward-looking information within the meaning of applicable   securities laws. These statements are made under the safe harbor   provisions of those laws. These forward-looking statements include statements related to   Descartes' operating performance, financial results and   conditions, Descartes' gross margin and any growth in those gross   margins, cash flow and use of cash, business outlook, baseline   revenues, baseline operating expenses, and baseline calibrations,   anticipated and potential revenue losses and gains, anticipated   recognition and expensing of specific revenues and expenses,   potential acquisitions and acquisition strategy, cost reduction   and integration initiatives, and other matters that may   constitute forward-looking statements.   10 stocks we like better than Descartes Systems     Group       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Descartes Systems Group     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019      These forward-looking statements involve known and unknown   risks, uncertainties, assumptions, and other factors that may   cause the actual results, performance, or achievements of   Descartes to differ materially from the anticipated results,   performance, or achievements implied by such forward-looking   statements. These factors are outlined in the press release and   in the session entitled certain factors that may affect future   results in documents filed and furnished with the SEC, the OFC,   and other securities commissions across Canada, including our   management's discussion and analysis filed today. We provide forward-looking statements solely for the purpose   of providing information about management's current expectations   and plans related to the future. You are cautioned that such   information may not be appropriate for other purposes. We don't   undertake or accept any obligation or undertaking to release   publicly any updates or revisions to any forward-looking   statements to reflect any change in our expectations or any   change in events, conditions, assumptions, or circumstances on   which any such statement is based, except as required by law. With that, let me turn the call over to Ed.  Edward Ryan -- Chief Executive Officer  Great. Thanks, Scott. Good afternoon, everyone. Welcome to the   call. Thanks for joining us today. We carried out our momentum   from Q1 through to Q2 as we delivered yet another set of record   results. Our focus on delivering value for our customers   continued to pay off as they trust us more and more with their   business. We believe the market right now is more dynamic than   ever. Global trade regulations can change daily, as we're in a   heightened climate of trade sanction regimes and trade disputes.   Economic and operating conditions can turn on a dime, leaving   companies vulnerable if they can't quickly adapt and consumers   continue to increase their expectations about service delivery.   Often, they want to buy something now and get it within 24 hours   and at a time that's convenient for them. This can create serious   supply chain and logistics challenges for even the most advanced   operators. Dealing with surges in demand while also remaining efficient   outside of peak times is a tricky balancing act. We think this   creates opportunities for companies that can remain agile with   the appropriate technology systems fed by timely, reliable   information. But that's not all. Companies also need to be   connected to a wide community of supply chain participants to be   able to operate efficiently and react quickly. This, of course, is why we continue to invest in the global   logistics network so that all the participants in the supply   chain, whether you're a shipper, a carrier, or a logistics   intermediary have one place to connect, collaborate, and execute   shipments in real time. I'll speak further on today's call about   the challenges and opportunities we're seeing in today's market   and how customers are leveraging our network to turn challenges   into opportunities. As part of that, I'll also provide some updates on our recent   acquisitions. After our market update, Allan will then provide a   detailed overview of our financial results and then I'll finish   up the call talking about our calibration for Q3 and our   operating plans moving forward. But first, let's start by going over some of the key financial   highlights for the second quarter of fiscal 2020. We had another   outstanding quarter of operating results and were very happy with   our key metrics, fueled by our continued organic growth and our   ability to successfully integrate acquisitions. Revenue for the   quarter was up 20% from Q2 last year, coming in at $80.5   million. Our adjusted EBITDA continued to grow nicely for the quarter.   We generated $30.2 million of adjusted EBTIDA, an increase of 32%   over Q2 of last year. Digital compliance continues to contribute   nicely to this growth that is ahead of our plan of mid to   high-20s adjusted EBITDA growth for this fiscal year compared to   the previous fiscal year. We continue to convert our EBITDA into cash, converting 89% of   EBTIDA into cash and generating a record $26.9 million of cash in   the quarter. Consistent with our long-term operating plans, we've   been investing cash back into our business through focused   research and development investments and by combining with   complementary businesses. We combined with two businesses in Q3, CORE and STEPcom and we   combined with BestTransport in August. I'll go into those   acquisitions in more detail later. We also had a public share   offering in the quarter and raised $245 million, increasing our   capacity to do more investments as the right opportunities come   up. All in all, another great quarter here at Descartes to round   off the first half of the year. We have a stable, cash-generating   business and we have a solid balance sheet with financial   capacity to continue to acquire businesses and we're   well-positioned to continue our growth. So, with that, let's talk a little bit more about today's   market conditions and some of the tools we have available to help   customers manage today's complex market dynamics. I'd like to   start with some comments around what many of us are hearing about   and seeing in the North American freight market. If you think   back to the summer of 2018, you would have heard a lot about   capacity crunch, meaning there weren't enough trucks to fill   demand and rates were consistently rising. This summer, you're hearing about a number of carriers going   out of business, emblematic of businesses that weren't agile   enough to adjust to rapid shifts in demand. Being able to operate   efficiently in the peaks and troughs of the market are key to   survival. Freight has always been cyclical, so, this isn't a new   concern. What's new is the pace of change and how quickly market   conditions can turn. What's also new is there's now technology that can help in the   up and down markets by supporting more efficient use of   resources. In the up times, you need to be able to improve   capacity with the resources available. To do this, you need good   information on what is moving right now and what is going to be   moving in the future as well as what resources are available to   help. In the down times, you need to leverage that same information   to make the most of what's out there to get an edge to keep   yourself operating profitably. Our MacroPoint capacity matching   solution is particularly well suited to help carriers and freight   workers with this challenge. Our solution is designed for freight   workers and carriers to partner on an opt in basis to share lane   history and capacity to support better network alignment and   utilization. As I've highlighted before, it isn't about this intermediating   logistics service providers from their customers. It's the   opposite of that. It's a tool to help logistics service providers   and make them more successful. It's about helping logistics   service providers respond to dynamic markets and self-assemble to   identify opportunities to collaborate, remove friction, and   respond to market forces that are threatening their business. As we continue to enhance the capacity matching solution and   add more users to the community, we see more and more   opportunities to really make a difference for our customers here   and help them thrive in today's market. We're also seeing how the   solution could be used for sub-communities, which is one of the   drivers behind our most recent acquisition of BestTransport. BestTransport is a cloud-based transportation management   system provider focused on flatbed-intensive manufacturers and   distributors. Moving goods in the flatbed market requires domain   expertise and special equipment and the associated transportation   management processes have some unique characteristics. The flatbed market is therefore served by a specialist   community, a micro community of the wider freight market with its   own history, capacity, and rates links. BestTransport built a   great business serving this specialist flatbed community with the   tools for the shippers, carriers, and logistics intermediaries.   Asset allocation in the dynamic market is never easy, but it can   be even harder in a smaller community with a specialty asset. I see this as a great opportunity to introduce Descartes'   MacroPoint visibility and capacity matching to this market. We've   already generated some interest with some of the best transport   customers and we're excited to see where this takes us. In the   meantime, I'd like to welcome the best transport employees and   wider community to Descartes. It's great to have you here. While I'm at it, let's switch gears and talk a bit about   another acquisition that took place since we last spoke, a   company called STEPcom. You might have noticed that I continually   make a point that we have solutions on our network for all of the   participants in the supply chain -- shippers, carriers, and   logistics intermediaries. Logistics is a multi-party, multi-process challenge and if you   want all the participants in the supply chain to join your   network, you're going to be more successful if you can add value   with useful tools for each participant. The more you can help   that community of shippers, carriers, and logistics   intermediaries to execute additional processes in the lifecycle   of a shipment, the more likely you are to have them do more   business with you and bring others into the community with the   network effects. Connectivity is critical for this to work and having the   ability to onboard trading partners rapidly is key, particularly   in an environment where the supplier or customer landscape can   change quickly. When you look at what STEPcom has done, they have   spent 15 years helping supply chain participants connect and   collaborate to exchange business documents and automate supply   chain processes. They're very good at it. Every shipment starts with a purchase   order and STEPcom helps its customers automate the process for   what will ultimately turn into a shipment. By combining with the   global logistics network, we can now help that community execute   those shipments with tools for booking and tracking in real time.   So, a warm welcome to all the STEPcom employees and   customers. By combining with businesses such as STEPcom, we continue to   execute on our three-part vision for supply chain information   processing. First, you've got source data collection, which used   to be manual but more and more is becoming automated through   internet-enabled devices in an IoT world such as telematics   devices, sensors, GPS devices, and other mechanisms.  Second, you need a trusted network to communicate,   store, and sort that source data in a way that is useful to the   entire supply chain. Third, you need applications that can   leverage that data and help you make better decisions for your   business. So, source data and content, trusted networks and   decision support applications. Our Q2 acquisition of CORE is a good example demonstrating all   those principles. CORE is an electronic transportation network   that provides global air carriers and ground handlers with   shipment scanning and tracking solutions. Customers use CORE's   network to accurately track international mail, parcel, and cargo   shipments as well as US domestic mail and parcel shipments. CORE's experience in air cargo tracking led them to identify   internet of things or IoT opportunities to better track   containers that are used by air carriers. These containers are   called ULDs. The ULD is a unit load device, essentially, it's the   box or palette that cargo is loaded into before it goes on to a   plane. ULD management is a tricky thing and by incorporating   Bluetooth-enabled IoT technology, CORE is helping the air   carriers better manage their pool of assets. However, that's not where the value ends. By combining CORE's   IoT solutions with the global logistics network, we can then link   shipment tracking to ULD tracking because we have the shipment   data. In effect, this will create more real time data events for   consumption by the wider Descartes community, not just the air   carriers, but also the forwarders and their customers, the   shippers. Even broader, CORE has applications which allow you to   visualize what's going on with the ULDs and mail so that you can   have accurate visibility over your air cargo. Source data   collection from the ULDs using the GLN to processing information   and applications to analyze what was generated. We're pretty excited about the opportunity to enhance what we   do for the wider air cargo community as we continue with the   integration of CORE into our business. So, also welcome to the   CORE employees and customers. Welcome to Descartes. Speaking of integration, I'm sure people are keen to hear   about how things are going with Visual Compliance. So, I'll spend   a couple of minutes there. At the top of the call, I mentioned   the constantly changing regulatory environment our customers are   facing every day. Trade is getting more complex and the velocity   of changes is increasing. In order to stay on top of changes to   duties, tariffs, taxes, and sanction lists, customers need access   to timely, reliable information and need systems that can digest   that information. As a result, we've been building our content offerings over   the last few customers get the right data at the right time.   Visual Compliance provides software solutions, content, and   services to automate customs, trade, and fiscal compliance   processes with a focus on denied and restricted party screening   processes and export licensing. The acquisition followed our other recent investments in trade   content including Datamyne, CustomsInfo, and MK Data, a business   that was also on denied party screening. Adding Visual Compliance   not only gave us more scale in the denied party screening space,   but it's also complementary to MK Data as it adds new   functionality for us to bring to the market. We're now six months   into the integration and things are going very well. We're starting to see the benefits of the wider content teams   working together. We've seen a lot of interaction between our   content teams to standardize with best practices and the teams   that gel very well. We continue to make good progress on our   plans to bring these teams together so we can further align our   processes and streamline the content collection and normalization   process. We're also starting to see more product synergies ahead. As we   think about how we can leverage the Visual Compliance offerings   combined with our CustomsInfo solution as an example. From a   go-to-market perspective, we've already seen synergies over in   our European operations. Our team there has landed a number of   visual compliance deals following our successful cross-training   efforts over the first few months. And from a financial perspective, we're really pleased with   the continued growth of the recurring revenues of the business   and the financial profile remains very healthy. The business   continues to perform ahead of our plans, which has contributed to   our aggregate growth being ahead of our planned range. Before handing the call over to Allan to talk more about the   financials, I'd like to thank some people that continue to   contribute to the strength of our business. Thank you to our   employees for all the hard work they put in to make sure our   customers get results. Our customers continue to get results and   that's why we have a successful business. Thank you to our customers who continue to place confidence in   Descartes as their network of choice, whether you're a shipper,   logistics intermediary, carrier, or even a government agency,   thank you for connecting and helping our community grow and   thanks for your continued engagement. I would also like to thank   our partners for helping us continue to expand our ecosystem and   thanks to our shareholders both new and long-standing for   continuing to have confidence in Descartes and supporting us with   your capital. With that, I'll turn the call over to Allan to go through the   financial highlights for Q2.  Allan Brett -- Chief Financial Officer  Thanks, Ed. As indicated, I'm going to walk you through our   financial results for our second quarter ended July 31st. We are   pleased to report record quarterly revenues of $80.5 million this   quarter, up 20% from revenues of $67.1 million in the second   quarter of last year. This revenue growth was achieved from solid   organic growth as well as from our recent acquisitions. As well,   we've achieved despite a negative impact from foreign exchange of   approximately $900,000 over Q2 of last year. Our revenue mix continues to be very strong, with services   revenue increasing 20% to $71.4 million or 89% of total revenue   in the second quarter compared to $59.7 million in the same   quarter last year and also consistent at 89% of revenue. License   revenue came in at $1.1 million or just over 1% of sales in the   quarter, down slightly from license revenue of $1.3 million or 2%   of revenue in Q2 last year while professional service and other   revenue came in at $8.0 million or 10% of revenue, nicely up from   $6.1 million or 9% of revenue in the second quarter of last   year. Gross margin was solid at 74% of revenue for the quarter,   which is up slightly from gross margin from 73% in the second   quarter last year. This increase is mainly due to the addition of   the Visual Compliance business acquired in mid-February as well   as from continuing growth in revenue from new and existing   customers. With solid revenue and continued strong cost control, we   continue to see strong adjusted EBITDA growth of approximately   32% to $30.2 million or 37.5% of revenue compared to $22.8   million or 34% of revenue in the same period of last year.   Consistent with past quarters, the FX impact on adjusted EBITDA   was insignificant as we remained fairly naturally hedged to FX   movements across our business. As a result of the solid operating results, cash flow   generated from operations came in at $26.9 million or   approximately 89% of adjusted EBITDA in the second quarter this   year, up 48% compared to operating cash flow of $18.2 million or   80% of adjusted EBITDA in Q2 last year. Going forward, subject to   unusual events and quarterly fluctuations, we expect to see   continued strong offering cash flow conversion of between 80% and   90% of our adjusted EBITDA for the balance of fiscal 2020. From a GAAP earnings perspective, net income came in at $8.6   million or $0.10 per diluted common share in the second quarter,   up slightly from net income of $8.5 million or $0.11 per diluted   common share in the same period last year. Overall, we are   pleased with these operating results in the second quarter as   strong revenue growth allowed us to make increased investments in   our business while achieving 32% growth in adjusted EBITDA and   generating strong cash flow. If we look at the balance sheet, our cash balances totaled   $27.4 million at the end of the second quarter, while borrowings   under our credit facility were $22.8 million for a net cash   position of just under $5 million at the end of the second   quarter. As Ed mentioned earlier, we completed an equity offering   during the second quarter, issuing 6.9 million common shares at a   price of $35.50, resulting in gross proceeds of $245 million and   after all issuance costs, net proceeds of approximately $237   million. We used those proceeds from the equity issue in the   second quarter to repay a large portion of the balance that was   outstanding under our credit facility. We also used our cash flow of operations to replay   approximately $30 million on the credit facility during the   second quarter while we also drew approximately $43.8 million on   the credit facility to complete the CORE Transport and STEPcom   acquisitions during the quarter. Subsequent to the end of the second quarter, we also borrowed   approximately $11 million on the credit facility to complete the   BestTransport acquisition. As a result, we currently have   approximately $320 million available to us to draw under the   credit facility. In addition, we were able to offer just over $500 million of   capital under the current shelf perspectives. So, clearly, we   continue to be very well-capitalized to allow us to consider all   acquisition opportunities in our market consistent with our   business plan. As we look ahead to the second half of this year, after   incurring approximately $2.4 million in capital additions in the   first half of the year, we expect to incur approximately $2.5   million to $3.5 million in additional capital expenditures for   the balance of the year, with this balance expected to include   further investments in our network security and   infrastructure. We expect amortization expense will be approximately $27   million for the balance of FY 20 with this figure being subject   to adjustment for FX changes and future acquisitions. Our income   tax rate came in at 26.3% of pre-tax revenue in the first half of   the year, which is very close to our statutory rate in Canada and   the US. Going forward, we expect that our tax rate will continue to   trend in the range of 25% to 28% of pre-tax income over the   balance of the year. Though, as always, we should add that our   tax rate may fluctuate from quarter to quarter from one-time tax   adjustments that may arrive as we operate internationally across   multiple countries. Finally, we expect stock-based compensation   will be approximately $2.6 million to $2.8 million for the   balance of fiscal 2020 subject to any forfeitures of stock   options or share units. With that, I'll turn it back over to Ed to wrap up.  Edward Ryan -- Chief Executive Officer  Thanks, Allan. Before talking about calibration, I just wanted   to highlight that we set up the conference registration site for   Evolution 2020, our annual user and partner conference. Evolution   2020 will be held at the Diplomat beach resort in Fort   Lauderdale, Florida from Tuesday, March 17th to Thursday, March   19th, 2020. It's a great opportunity to meet the people that   build and deploy our solutions as well as the customers that use   them. If you want to learn about Descartes, it's really a good   investment of your time and I would encourage you to book   early. With that, let's move on to our calibration for Q3 FY 2020.   Similar to previous quarters, we don't provide guidance but we   use our baseline calibration as a key metric related to the   ongoing health and strength of our business. Our calibration for   Q3 includes the addition of BestTransport with the business for a   partial quarter and assumes the following exchange rates -- a   $0.75 Canadian dollar, $1.11 euro to US dollar, and $1.21 GBP to   US dollar. Our calibration for Q2 is $78.2 million in visible recurring   contracted revenues, otherwise known as our baseline revenues.   Our baseline operating expenses are $53.4 million, a baseline   calibration of $24.8 million for adjusted EBITDA from Q3. Some other key points related to how we're positioned for   fiscal 2020 -- we have a solid financial footing. We have a   healthy business that's well-calibrated and we have a healthy   balance sheet. We are profitable and cash-generating. We have low   capital needs within our organic business. And as you've seen   from our recent historical financial results, we have solid   growth in our organic business. Our primary uses of capital are   for continued use and acquisitions, we've completed 45   acquisitions since 2006. And we have access to additional capital quickly, should we   need it. Before the acquisition of BestTransport at July 31st, we   had $23 million drawn on our $350 million line of credit and we   have the ability to expand that line of credit to $500 million if   needed. We also have a preliminary shelf perspective for up to   $750 million, of which just over $500 million remains unused, to   raise capital by other mechanisms. In short, we have good   capacity for our planned acquisition activity. We also have a strong acquisition pipeline. There continues to   be a lot of industry activity now with consolidation continuing   in our market with our capital capacity and our execution   capabilities, there are still a number of acquisition   opportunities to expand the geographic reach, functional   capabilities, trade data or content or community participants on   our network. We continue to see a lot of interesting   opportunities out there to continue or even accelerate our pace   of profitable growth. We're seeing larger and smaller opportunities and while we   review everything as it comes our way, we're not just buyers for   buyers' sake. The fact that we have an acquisition line of credit   and a shelf filing in place doesn't change how we view   acquisitions. We intend to continue to be prudent on valuation   but we're confident in our ability to deploy capital effectively.   Furthermore, we don't see the recent larger acquisition of Visual   Compliance impacting our ability to continue executing on our   plan. As I just said, we're competent in our ability to deploy   capital, as you've just seen with our recent acquisitions of   CORE, STEPcom, and BestTransport. And we have a robust   integration methodology in place to help us quickly and   efficiently integrate incoming businesses. As a reminder for our plans for the remainder of fiscal 2020   -- as we've said in the past, our belief for sustainable growth   in the long-term is a 10% to 15% growth in adjusted EBITDA.   However, given the scale of visual compliance, fiscal 2020 we   indicated would grow in the mid to high 20s. Given our   performance in the first half of the year, we're now confident   that we'll at or just beyond the top end of that range. As in the past, we intend to invest any overperformance back   into the business. Our growth is planned to come through a   combination of organic and inorganic activities and as always,   acquisitions are not incremental to this plan. We intend to   continue to focus on recurring and deemphasize one-time license   sales. Given the current performance of the business and mindful   of the FX environment, our planned operating margin range remains   at 35% to 40%. So, please keep in mind this could vary if we buy   other businesses that need fixing up or if the FX environment   changes, both of which would impact that metric in the short   run. Finally, as always, we'll continue to make ourselves available   to shareholders to answer any questions. We believe we've got a   great business. We want to be available to help people learn   about our business. We'll continue to spend time and resources to   get the word out and we hope you'll do the same. So, with that,   Operator, I'd like to open the call up to questions. Questions and Answers:  Operator  Thank you. If you have a question, please press * then 1 on   your touch tone telephone or if you wish to be removed from the   queue, please press the # sign. There is going to be a delay for   the first question is announced. If you're using a speakerphone,   you may need to pick up the handset first before pressing the   numbers. Once again, if you have a question, please press * then   1 on your touch tone telephone. Your first question comes from Raimo Lenschow with Barclays.   Your line is open.  Mike -- Barclays -- Analyst  Hey. This is Mike on for Raimo. Congrats on the quarter, guys.   I wanted to touch base on the strong acquisition pipeline you   talked about. When you think about the puts and takes behind that   right now for your business and expanding those EBITDA margins   for 35% to 40% for the rest of the year, could you talk a little   bit about the balance you're seeing between reinvestments back   into the business, which obviously you guys have been doing on   the R&D side and acquisitions -- has anything changed with   visual compliance there and kind of that being stepped up, at   least for the kind of short-term?  Edward Ryan -- Chief Executive Officer  I think you're going to see us operate the same way we have   for the last number of years. We continue to see a strong market   for potential acquisitions. We look at every one of them.   Sometimes they're over-priced. A lot of stuff in this market is   over-priced because everyone thinks that it's a great time to   sell their business. That's true for some and not for others. We're trying to   manage our business as well as we can and deploy our capital   efficiently. I don't think in our minds there's any material   change in that belief. Sometimes more acquisitions come along   that look like great fits to us and we're able to get a deal done   with someone and sometimes they don't. We don't push it if it's   not there.  Mike -- Barclays -- Analyst  Just a little bit more detail on the cash conversion, which   was especially impressive this quarter at 89% -- can you talk   about the puts and takes there and what drove that up. That's a   lot higher than what we've seen over the last couple of quarters   or significantly higher. Is there anything specific that you   wanted to call out on that end?  Edward Ryan -- Chief Executive Officer  Not really. We typically see conversions in the 80% to 90%   range of adjusted EBITDA. For this one, we're right at the top of   that range. Interest expense went down in the quarter compared to   last quarter, typically the second quarter can be a better   collection a quarter. So, it's just one of those things. We do   see fluctuations. Last second quarter, we were at 80%. It was a   weaker quarter as a couple receivables didn't come in, just more   of the same. You could expect us to fluctuate typically in that   80% to 90% range -- nothing terribly unusual.  Mike -- Barclays -- Analyst  Thanks, guys. Congrats on the quarter.  Operator  Your next question is from Matt Pfau with William Blair. Matt,   your line is open.  Matt Pfau -- William Blair -- Analyst  Hey, guys. Thanks for taking my questions. I wanted to ask a   few on MacroPoint. First of all, are you gaining any more   traction with shippers? My understanding is that your primary   exposure with MacroPoint is traditionally with brokers, but have   you seen anything on the shipper side? Then also, at your user   event earlier this year, I think it was discussed about entering   the European market with macro point sometime during 2019. So, I   just was wondering what the update on that is.  Edward Ryan -- Chief Executive Officer  Thanks, Matt. We do business with a lot of shippers on the   MacroPoint side. Our primary customer base is freight workers and   3PLs. Typically, we're trying to deal with shippers trying to   supplement the information they're getting from their broker.   That's their primary driver in that market. We also have had a   number of large shippers come to us over the last several years   to sign up for the service and we're happy to do that. They're   usually supplementing something they're already doing with a   freight broker and looking for one place where they can go and   get all the tracking information. As far as the European markets are concerned, we're making a   very cautious move in there. you have a lot of personal privacy   issues in Europe to get over and certainly some language barriers   as well. We're starting with some of the English-speaking   countries and being very careful about how we're collecting   information from drivers to not run afoul of any rules over   there.  Matt Pfau -- William Blair -- Analyst  I also wanted to ask on the capacity-matching solution --   related to some of the dynamics going on in the trucking industry   currently, how are those impacting the demand for capacity   matching from the broker side and then from the supply side with   the actual carriers, how does the current environment impact   capacity matching?  Edward Ryan -- Chief Executive Officer  It's not for me to tell, really. We're in the early innings of   this. It's not enough for us to see massive trends in it other   than the customers that have gone through this process and now,   we're opening that up to other mid-size brokers and 3PLs. They   continue to expand their usage of the service as they get into   it. It's not clear to me what the impact on the market is yet. We   don't have a big enough representative sample. I can tell that   the customers are getting a lot of benefit out of it. Everyone   that started in those initial pilots is rolling the solution out   and using it more and more effectively every day. We're really   excited about that.  Matt Pfau -- William Blair -- Analyst  Thanks, guys. That's all I had about that.  Operator  Your next question comes from David Hynes with Canaccord.   David, your line is open.  David Hynes -- Canaccord Genuity -- Analyst  Hey, guys. Nice set of numbers. Ed, I wanted to ask you   generically around trade volumes, it's hard to parse out given   diversity of the business. Are you seeing any slow down at all   given the ongoing trade disputes? I guess as part of that, maybe   you can remind us the exposure to China you have there.  Edward Ryan -- Chief Executive Officer  We haven't, really. We read the same newspapers you do. So,   we're kind of watching to see what will happen. We haven't seen   much impact on our network. Some of that may make sense, right?   One of the big reactions you see with companies who are dealing   with trade restrictions in certain countries is to start moving   manufacturing to other locations. From the perspective of our   network, we don't really care where the shipment comes from. We   care that it gets made. So, whether that shipment comes out of China or Vietnam, it's   still a shipment that's going out over our network. Now, if you   live in China or Vietnam, it might be an issue, but from the   perspective we take on it, we're just trying to process the   world's shipments. That still ended up being a shipment on our   network. Which country it came from is not particularly material   to us. The part that it has helped quite a bit and may continue is   our trade data content business, a big part of it is focused on   database and tariffs and duties. Over the last couple of years,   with all that has gone on around the world, not just in the US   but other countries around the world too, I've put a real high   focus on that trade data information and it's one of the   faster-growing parts of our business as a result. So, we're   pretty excited about that.  David Hynes -- Canaccord Genuity -- Analyst  One housekeeping for Allan and then I'm going to come back to   you, Ed, for one -- share comp expected -- diluted shares for Q3,   like just over $85 million, $85.2 million -- is that the right   spot we should be?  Allan Brett -- Chief Financial Officer  For Q2, that might be a little high. We did the share issuance   right at the middle of the quarter. So, a dilution of 3.5 million   shares, essentially, for Q2. It will be in the full effect in Q3.   I think it's $84.5 million. You're testing my change, but $84   million and change of shares outstanding. So, around that. Just   look at the balance sheet. A lot of the balance sheet, you'll   have the actual numbers. But about half a dilution effect for   this quarter and the second part of it comes through Q3.  David Hynes -- Canaccord Genuity -- Analyst  Ed, Matt was asking earlier about capacity matching and the   opportunity there. It seems like there are two strategies in the   market. There are the folks who are competitors trying to   disintermediate the 3PLs and the freight brokers and you guys   have taken a different tact, which is deliver tech to enable   those folks. Can you talk about your view of the challenges that   the competitors who are trying to disintermediate will face and   what gives you confidence that you're pursuing the right   strategy, if that makes sense?  Edward Ryan -- Chief Executive Officer  Sure. Thanks for asking. I feel like I've seen this movie   before. The same thing happened in the late 90s, early 2000s   timeframe, where a bunch of dotcoms came in and said, \"We're   going to disintermediate this entire market.\" If you look back on   that time, every one of those companies did not succeed, in our   market in particular. That's not how they did it. They did not   cut the freight borders and the 3PL down. In fact, those markets have grown substantially since then. We   don't think it's that easy to manage people's freight and I don't   think you're going to quickly do it on a website and problem   solved. Because of what we have in MacroPoint, where we have   visibility into hundreds of thousands of trucks every day and   where they're going to be a few days from now, we think that's   very valuable information to help companies decide who the next   carrier should be or who the next driver should be to take that   next load. To the extent that we can identify three or four trucks or ten   trucks within a couple miles of that location who are available   for pick up three days from now, that information could save a   freight broker $150 to $250 on a move because they don't have to   pay for backhaul or deadheading to drive empty to the pickup   location. There are two things you can do with that. The first is you   can say, \"I'm going to be a freight broker and I'll save that   $200.\" The second is the approach that we're taking, which is,   \"Hey, I do business with 5,000 or 6,000 freight brokers around   North America. Why don't I just provide that information to them,   my customer and have them make the money and hope they'll give me   a cut of it for providing that information?\" We have no intention a freight broker. I look at the guys that   are doing it and I say, \"Hey, the last time someone tried to do   this, they didn't do that well.\" I have seen a lot of the market   go that way. They come out and they get investors and get   valuations in the hundreds of millions of dollars for a company   that's doing $2 million or $3 million in revenue and they have a   lot of expectations to meet and I don't think they're going   to. I look at our approach to it and I say I think it's a much   more reasonable approach. I think it's something that's helping   our customers and helping the market be more efficient. I think   the guys that are trying to say, \"Hey, I'll help the market be   more efficient too and I'm going to put all the money in my   pocket.\" I think those guys are being greedy and will eventually   get burned.  David Hynes -- Canaccord Genuity -- Analyst  That's helpful. Thanks, guys.  Operator  Your next question comes from Justin Long with Stephens.   Justin, your line is open.  Justin Long -- Stephens -- Analyst  Thanks and congrats on the quarter. Maybe to start with the   adjusted EBITDA growth guidance for this year, I wanted to be   clear on what drove that upward revision. Was that a function of   visual compliance outpacing expectations or has your assumption   on organic growth improved as well? Maybe if we think about that   EBITDA growth in the high-20s or something around that this year,   could you speak to the rough split of that between organic and   acquisition-driven growth?  Edward Ryan -- Chief Executive Officer  I'll make a couple of comments about it and then pass it to   Allan. At a high level, we were bumping against the top of the   range we have given previous, which I think was 32% to 37%. We   were getting closer to that. You're absolutely right. Visual   Compliance was a very profitable company and was behind us and   then moving the range up to 35% to 40%. Prior to that, our   business was performing very well and continued to move up and up   each quarter and then we bought Visual Compliance and we said   we're definitely going to be in that range now for the   foreseeable future. Allan?  Allan Brett -- Chief Financial Officer  Sure. Ed was referring to the EBITDA as a percentage of   revenue. That's exactly true on that front. If you're looking at   it from an EBITDA growth perspective, where we came in at 32% for   the quarter and as Ed mentioned, we had said in the previous   quarter that we would be in the mid to high-20s as a growth rate   for this year, we're feeling more comfortable with the business   overall. We've run visual compliance now for five and a half months.   We've added some small additional items or companies to our mix   here. The business is performing well organically. That led us to   a bit more comfort to say we'll fit the higher end of that range   into the 30-ish range as far as growth in EBITDA. So, you've kind   of got now answers on both -- EBITDA growth and EBITDA as a   percentage of revenue. And both have impacts of our core business   improving and visual compliance improving. And then separately, your last piece of the question was split   between organic and acquisitions -- our typical model growing 10%   to 15% a year, where I think our 10-year average is 17%, you   should roughly think of that as being roughly split half and   half, half organic growth in EBITDA, half acquisitions. In a year   like this where we're going to be upwards around 30% or so, much   more of that is coming from acquisitions. Our core business is   performing as we would expect and that's great. That's giving a   good, solid, EBITDA growth. The rest is coming from   acquisitions.  Operator  Your next question comes from Paul Treiber with RBC Capital   Markets. Paul, your line is open.  Paul Treiber -- RBC Capital Markets -- Analyst  Thanks very much and good afternoon. I'm hoping that you can   elaborate more on BestTransport and the TMS strategy in general.   You have a number of partnerships with TMS companies. How do you   decide between partnering with these companies and then owning a   TMS vendor themselves. At what point would you consider moving   into the broader TMS market?  Edward Ryan -- Chief Executive Officer  BestTransport is a niche player in hat business and fairly   unique player in that business and they handle something that's a   little more complicated than your normal truck move in that it's   flatbed. People get a flatbed because the cargo is odd-shaped and   more difficult to move and you can't put it inside a trailer. We   wanted to have that functionality in our TMS. We thought our   customers would benefit from getting access to that   functionality. We certainly didn't buy it to go after any of our   partners that are in the broader TMS market. I think if you asked them, they would say the flatbed is a   relatively small part of most of their customers. Our   partnerships in that space are largely based around connectivity.   That's why we're working with SAP and Oracle and a bunch of other   TMS providers to be the network of choice for their customers so   they can get connected to those carriers. If you think about it, what BestTransport brings us there,   maybe one of the more valuable things is connections to those   flatbed carriers that may otherwise have been somewhat elusive   because they're relatively small players in the market. Now,   they're on our network and if you look at the BestTransport   acquisition from that perspective, you probably have a pretty   good sense of where they're coming from and buying it. We didn't think of it as a predatory move to our partners. We   thought of something that would help them. They want to provide   connectivity to flatbed providers in their TMS. Now, I'm   available to do that and like to do it all electronically. So,   that's the driving force behind it.  Paul Treiber -- RBC Capital Markets -- Analyst  Is there an opportunity for synergies between BestTransport   and MacroPoint in capacity matching?  Edward Ryan -- Chief Executive Officer  For sure. They bring a whole new set of carriers to the table,   a whole new set of shipper customers to the table as well. To the   extent that there are people using those solutions that also want   to use capacity matching or brokers on our network that want to   use capacity matching and now match up for flatbed moves -- I   have a much better ability to do that today than I did before the   BestTransport acquisition.  Operator  Your next question comes from Scott Group with Wolfe Research.   Scott, your line is open.  Rob -- Wolfe Research -- Analyst  Good evening, guys. It's Rob on for Scott. I'm just following   up in terms of the organic growth -- clearly, in North America,   we've seen some very light rail carload volumes as well as soft   truck demand more broadly. I was hoping you could speak to your   view of the sustainability of the organic growth as we look   forward in what could be a softer freight in market.  Edward Ryan -- Chief Executive Officer  The short answer is I don't know. I also don't know what's   going to happen to the freight market any better than anyone else   in our industry, other than to say that if transportation volumes   go down, we get paid by the shipment to process transactions and   if there are less transactions, there's less revenue for us and   therefore, either our organic revenue is going to slow or we're   going to have to sell more to keep it growing at the rate that it   is. I don't have a crystal ball. We don't put stats out there about what's going to happen in   the future. We know over the past couple of years, it's gotten   better. I think it's due to us having a better network every day   with more participants on it. That's partially due to some of the   acquisitions we've bought in the past few years, where they're   growing at a faster clip than some of the things we've bought in   the past. Then our company is doing a good job of integrating those   acquisitions in and getting them to perform better than they were   before we bought them. I hope that continues. If we have to do   that with some headwinds in the transportation market pushing   against us, it will make it harder. If the transportation market   continues to boom as it has over the last couple of years, that's   going to make it easier for us and give us the potential to do   even better. It's growing nicely and has been growing nicely the   past couple of years and we hope it continues and if not, we're   going to do our best to manage through it.  Rob -- Wolfe Research -- Analyst  You guys clarified in terms of some of the concerns we've been   hearing in the market about trade and shifting of volume of China   to other Asian countries and the impact for Descartes -- I was   hoping you could speak a little bit about in the news, we've seen   some order consolidation with the recent closure by DSV. How does   that impact if we're seeing growth of some of the bigger   participants -- how does that impact Descartes as we look   forward?  Edward Ryan -- Chief Executive Officer  That one in particular has been pretty good for us. DSV is one   of our best customers. They bought Panalpina that was also a very   good customer of ours. We're looking for them to do even -- if we   can get DSV to do all the stuff with Panalpina that DSV is doing   with their own business, I look for that to be pretty good news   for us. That's the way we're talking at the moment. We like the   DSV guys. They've been good customers of ours. They've gone from   a midsize player to one of the largest forwarders in the world.   We're excited for them and excited to help them.  Rob -- Wolfe Research -- Analyst  We should be thinking about the potential of if you've got a   relationship with the acquirer as being accretive or not, per se,   relative to the target?  Edward Ryan -- Chief Executive Officer  I think you'll find in the freight forwarding space, we're   going to have relationships with most of the acquirers. It's how   strong that relationship is. In the case of DSV, it's very   strong. Over the last ten years or so, as there has been a lot of   consolidation in this market, the bigger guys tend to be our best   customers. They're the ones that have taken advantage of what we   have more effectively than the smaller and midsize guys. So, in most cases, it's worked out pretty well for us. They   buy a small freight forwarder who uses some of our stuff but not   all of our stuff and now, all of a sudden, they're bought by a   bigger player who uses a lot of our stuff and as that small   freight forwarder gets rolled into the bigger operation, we tend   to benefit.  Operator  Your next question comes from Deepak Kaushal with GMP   Securities. Your line is open.  Deepak Kaushal -- GMP Securities -- Analyst  Hey, guys. A couple of follow-up questions from me on the   recent acquisitions -- on BestTransport, was the opportunity to   sell capacity matching into a niche network the motivation behind   acquiring BestTransport?  Edward Ryan -- Chief Executive Officer  It was certainly one of them. We saw that opportunity as a   pretty good one. To add, something that's not otherwise there in   the capacity matching space at the moment because it's kind of a   unique space, flatbed is. That was a big help. More broadly, we   wanted to add these flatbed carriers to our network and the   ability to manage a flatbed move to our network. There are not a   lot of networks out there that can do that. Most of that stuff is   done manually today. Now, we have a chance to automate it, not   only for ourselves but as someone mentioned earlier on the call,   for our partners as well.  Deepak Kaushal -- GMP Securities -- Analyst  Do you see similar or parallel niche networks that could be   well-suited for capacity matching and is that a reasonable   strategy to go forward onto M&A?  Edward Ryan -- Chief Executive Officer  I think there a couple of opportunities to do that, but I   wouldn't say that's going to be a core driver to our M&A   strategy. BestTransport came along and it's been an opportunistic   thing for us. We saw it for sale and thought that actually might   be a good idea and then we went and talked to them and thought we   could prove that and did so. I don't know that you'll see it continue to look for those   opportunities. If they're around, we'll look at it and see if we   think it's a good fit. In BestTransport's case, we thought it   was. So, we did it. I think you're more likely to see us go after   stuff in the trade space and some of the areas that we've been   investing in over the last couple of years.  Deepak Kaushal -- GMP Securities -- Analyst  In terms of driving capacity matching adoption, it's not   necessarily to find these closed networks?  Edward Ryan -- Chief Executive Officer  No. I think the biggest thing that's going to drive capacity   matching is going to be us going out and getting more and more of   our brokers' heads around using a third-party to provide them   with this information and using that as a competitive advantage   for their competitors and maybe for some of these dotcoms that   think they're going to do it without a broker.  Deepak Kaushal -- GMP Securities -- Analyst  On STEPcom, you gave some good color on the supply chain   integration network they have. I wanted to know if you can go a   bit further in terms of how different it is from integrating a   transportation network, supply chain versus transportation. In   terms of supply chain, how penetrated are you? How much of your   GLM is related to supply chain specifically and what could the   opportunity become?  Edward Ryan -- Chief Executive Officer  So, obviously, we're much more focused on the logistics side   of it in that we have just about every transportation provider of   size in the world on our network. So, we're a very large player   in the logistics network space. We're a relatively small player   in the supply chain network space. We eventually believe these   things need to come together. They are different. They all need   to be done. In our mind, they should be done by somebody that could put   them all together so the end customer, the retailer/manufacturer   can get complete visibility into, \"I ordered this thing with my   purchase order. I created an ASN that said what I'm going to be   shipping. I created a bill of waiting and then started getting   status messages back so that I can see where my stuff is on a   line item basis,\" versus getting information back from a carrier   that, \"Hey, your container is here.\" That's not that helpful unless you know what's in that   container. Someone can do all that for you. They can put all that   information together. They should give you SKU-level information   as to where your inventory is around the world and when you think   it's going to get to the places it needs to get to so you can   better manage your supply chain. At a very high level, that's   what's behind us buying STEPcom. I think you'll see us do more of   that moving forward.  Deepak Kaushal -- GMP Securities -- Analyst  Are there certain industries that are more receptive to bring   both of these things under one network?  Edward Ryan -- Chief Executive Officer  I don't know if industries are more or less. Certainly, the   bigger industries out there, retail, for example, is one of the   groups of people that seem to have the most to gain by doing   this. I think you'll see us go after that group more than most.   They have an awful lot of inventory. Their volumes are extremely   high and if they can sync up some of these things, they can save   a lot of money. That's been something that's driven a lot of not   only our acquisitions but visibility and things like that into   the supply chain space.  Operator  There are no more questions at this time.  Edward Ryan -- Chief Executive Officer  Thank you, guys. Appreciate your time and we look forward to   reporting back to you next quarter on our Q3 results.  Operator  Thank you, ladies and gentlemen. This concludes today's   conference. Thank you for participating. You may now   disconnect.  Duration: 61 minutes  Call participants:  Scott Pagan -- President and Chief Operating Officer   Edward Ryan -- Chief Executive Officer   Allan Brett -- Chief Financial Officer   Mike -- Barclays -- Analyst   Matt Pfau -- William Blair -- Analyst   David Hynes -- Canaccord Genuity -- Analyst   Justin Long -- Stephens -- Analyst   Paul Treiber -- RBC Capital Markets -- Analyst   Rob -- Wolfe Research -- Analyst   Deepak Kaushal -- GMP Securities -- Analyst   More DSGX analysis   All earnings call transcripts   This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions   for additional details, including our Obligatory     Capitalized Disclaimers of Liability.      Motley Fool Transcription      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " The Descartes Systems Group Inc    (NASDAQ: DSGX)        Q2 2020 Earnings Call       September 4, 2019,   5:00 p.m. ET ",
    " Operator ",
    "Welcome to the quarterly results call. My name is Erin and I   will be the operator for this call. At this time, all   participants are in a listen-only mode. Later, we will conduct a   question and answer session. If you would like to ask a question   during today's presentation, please press * then 1 on your touch   tone telephone. Please note that this conference is being   recorded.",
    "I will now turn the call over to Scott Pagan. Scott, you may   begin.",
    " Scott Pagan -- President and Chief Operating Officer ",
    "Thanks and good afternoon, everyone. Joining me on the call   today are Ed Ryan, CEO and Allan Brett, CFO. I trust that   everyone has received a copy of our financial results press   release that was issued earlier today. Portions of today's call   other than historical performance include statements of   forward-looking information within the meaning of applicable   securities laws. These statements are made under the safe harbor   provisions of those laws.",
    "These forward-looking statements include statements related to   Descartes' operating performance, financial results and   conditions, Descartes' gross margin and any growth in those gross   margins, cash flow and use of cash, business outlook, baseline   revenues, baseline operating expenses, and baseline calibrations,   anticipated and potential revenue losses and gains, anticipated   recognition and expensing of specific revenues and expenses,   potential acquisitions and acquisition strategy, cost reduction   and integration initiatives, and other matters that may   constitute forward-looking statements.",
    "  10 stocks we like better than Descartes Systems     Group       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Descartes Systems Group     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Descartes Systems     Group       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Descartes Systems Group     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "These forward-looking statements involve known and unknown   risks, uncertainties, assumptions, and other factors that may   cause the actual results, performance, or achievements of   Descartes to differ materially from the anticipated results,   performance, or achievements implied by such forward-looking   statements. These factors are outlined in the press release and   in the session entitled certain factors that may affect future   results in documents filed and furnished with the SEC, the OFC,   and other securities commissions across Canada, including our   management's discussion and analysis filed today.",
    "We provide forward-looking statements solely for the purpose   of providing information about management's current expectations   and plans related to the future. You are cautioned that such   information may not be appropriate for other purposes. We don't   undertake or accept any obligation or undertaking to release   publicly any updates or revisions to any forward-looking   statements to reflect any change in our expectations or any   change in events, conditions, assumptions, or circumstances on   which any such statement is based, except as required by law.",
    "With that, let me turn the call over to Ed.",
    " Edward Ryan -- Chief Executive Officer ",
    "Great. Thanks, Scott. Good afternoon, everyone. Welcome to the   call. Thanks for joining us today. We carried out our momentum   from Q1 through to Q2 as we delivered yet another set of record   results. Our focus on delivering value for our customers   continued to pay off as they trust us more and more with their   business. We believe the market right now is more dynamic than   ever.",
    "Global trade regulations can change daily, as we're in a   heightened climate of trade sanction regimes and trade disputes.   Economic and operating conditions can turn on a dime, leaving   companies vulnerable if they can't quickly adapt and consumers   continue to increase their expectations about service delivery.   Often, they want to buy something now and get it within 24 hours   and at a time that's convenient for them. This can create serious   supply chain and logistics challenges for even the most advanced   operators.",
    "Dealing with surges in demand while also remaining efficient   outside of peak times is a tricky balancing act. We think this   creates opportunities for companies that can remain agile with   the appropriate technology systems fed by timely, reliable   information. But that's not all. Companies also need to be   connected to a wide community of supply chain participants to be   able to operate efficiently and react quickly.",
    "This, of course, is why we continue to invest in the global   logistics network so that all the participants in the supply   chain, whether you're a shipper, a carrier, or a logistics   intermediary have one place to connect, collaborate, and execute   shipments in real time. I'll speak further on today's call about   the challenges and opportunities we're seeing in today's market   and how customers are leveraging our network to turn challenges   into opportunities.",
    "As part of that, I'll also provide some updates on our recent   acquisitions. After our market update, Allan will then provide a   detailed overview of our financial results and then I'll finish   up the call talking about our calibration for Q3 and our   operating plans moving forward.",
    "But first, let's start by going over some of the key financial   highlights for the second quarter of fiscal 2020. We had another   outstanding quarter of operating results and were very happy with   our key metrics, fueled by our continued organic growth and our   ability to successfully integrate acquisitions. Revenue for the   quarter was up 20% from Q2 last year, coming in at $80.5   million.",
    "Our adjusted EBITDA continued to grow nicely for the quarter.   We generated $30.2 million of adjusted EBTIDA, an increase of 32%   over Q2 of last year. Digital compliance continues to contribute   nicely to this growth that is ahead of our plan of mid to   high-20s adjusted EBITDA growth for this fiscal year compared to   the previous fiscal year.",
    "We continue to convert our EBITDA into cash, converting 89% of   EBTIDA into cash and generating a record $26.9 million of cash in   the quarter. Consistent with our long-term operating plans, we've   been investing cash back into our business through focused   research and development investments and by combining with   complementary businesses.",
    "We combined with two businesses in Q3, CORE and STEPcom and we   combined with BestTransport in August. I'll go into those   acquisitions in more detail later. We also had a public share   offering in the quarter and raised $245 million, increasing our   capacity to do more investments as the right opportunities come   up.",
    "All in all, another great quarter here at Descartes to round   off the first half of the year. We have a stable, cash-generating   business and we have a solid balance sheet with financial   capacity to continue to acquire businesses and we're   well-positioned to continue our growth.",
    "So, with that, let's talk a little bit more about today's   market conditions and some of the tools we have available to help   customers manage today's complex market dynamics. I'd like to   start with some comments around what many of us are hearing about   and seeing in the North American freight market. If you think   back to the summer of 2018, you would have heard a lot about   capacity crunch, meaning there weren't enough trucks to fill   demand and rates were consistently rising.",
    "This summer, you're hearing about a number of carriers going   out of business, emblematic of businesses that weren't agile   enough to adjust to rapid shifts in demand. Being able to operate   efficiently in the peaks and troughs of the market are key to   survival. Freight has always been cyclical, so, this isn't a new   concern. What's new is the pace of change and how quickly market   conditions can turn.",
    "What's also new is there's now technology that can help in the   up and down markets by supporting more efficient use of   resources. In the up times, you need to be able to improve   capacity with the resources available. To do this, you need good   information on what is moving right now and what is going to be   moving in the future as well as what resources are available to   help.",
    "In the down times, you need to leverage that same information   to make the most of what's out there to get an edge to keep   yourself operating profitably. Our MacroPoint capacity matching   solution is particularly well suited to help carriers and freight   workers with this challenge. Our solution is designed for freight   workers and carriers to partner on an opt in basis to share lane   history and capacity to support better network alignment and   utilization.",
    "As I've highlighted before, it isn't about this intermediating   logistics service providers from their customers. It's the   opposite of that. It's a tool to help logistics service providers   and make them more successful. It's about helping logistics   service providers respond to dynamic markets and self-assemble to   identify opportunities to collaborate, remove friction, and   respond to market forces that are threatening their business.",
    "As we continue to enhance the capacity matching solution and   add more users to the community, we see more and more   opportunities to really make a difference for our customers here   and help them thrive in today's market. We're also seeing how the   solution could be used for sub-communities, which is one of the   drivers behind our most recent acquisition of BestTransport.",
    "BestTransport is a cloud-based transportation management   system provider focused on flatbed-intensive manufacturers and   distributors. Moving goods in the flatbed market requires domain   expertise and special equipment and the associated transportation   management processes have some unique characteristics.",
    "The flatbed market is therefore served by a specialist   community, a micro community of the wider freight market with its   own history, capacity, and rates links. BestTransport built a   great business serving this specialist flatbed community with the   tools for the shippers, carriers, and logistics intermediaries.   Asset allocation in the dynamic market is never easy, but it can   be even harder in a smaller community with a specialty asset.",
    "I see this as a great opportunity to introduce Descartes'   MacroPoint visibility and capacity matching to this market. We've   already generated some interest with some of the best transport   customers and we're excited to see where this takes us. In the   meantime, I'd like to welcome the best transport employees and   wider community to Descartes. It's great to have you here.",
    "While I'm at it, let's switch gears and talk a bit about   another acquisition that took place since we last spoke, a   company called STEPcom. You might have noticed that I continually   make a point that we have solutions on our network for all of the   participants in the supply chain -- shippers, carriers, and   logistics intermediaries.",
    "Logistics is a multi-party, multi-process challenge and if you   want all the participants in the supply chain to join your   network, you're going to be more successful if you can add value   with useful tools for each participant. The more you can help   that community of shippers, carriers, and logistics   intermediaries to execute additional processes in the lifecycle   of a shipment, the more likely you are to have them do more   business with you and bring others into the community with the   network effects.",
    "Connectivity is critical for this to work and having the   ability to onboard trading partners rapidly is key, particularly   in an environment where the supplier or customer landscape can   change quickly. When you look at what STEPcom has done, they have   spent 15 years helping supply chain participants connect and   collaborate to exchange business documents and automate supply   chain processes.",
    "They're very good at it. Every shipment starts with a purchase   order and STEPcom helps its customers automate the process for   what will ultimately turn into a shipment. By combining with the   global logistics network, we can now help that community execute   those shipments with tools for booking and tracking in real time.   So, a warm welcome to all the STEPcom employees and   customers.",
    "By combining with businesses such as STEPcom, we continue to   execute on our three-part vision for supply chain information   processing. First, you've got source data collection, which used   to be manual but more and more is becoming automated through   internet-enabled devices in an IoT world such as telematics   devices, sensors, GPS devices, and other mechanisms.",
    " Second, you need a trusted network to communicate,   store, and sort that source data in a way that is useful to the   entire supply chain. Third, you need applications that can   leverage that data and help you make better decisions for your   business. So, source data and content, trusted networks and   decision support applications.",
    "Our Q2 acquisition of CORE is a good example demonstrating all   those principles. CORE is an electronic transportation network   that provides global air carriers and ground handlers with   shipment scanning and tracking solutions. Customers use CORE's   network to accurately track international mail, parcel, and cargo   shipments as well as US domestic mail and parcel shipments.",
    "CORE's experience in air cargo tracking led them to identify   internet of things or IoT opportunities to better track   containers that are used by air carriers. These containers are   called ULDs. The ULD is a unit load device, essentially, it's the   box or palette that cargo is loaded into before it goes on to a   plane. ULD management is a tricky thing and by incorporating   Bluetooth-enabled IoT technology, CORE is helping the air   carriers better manage their pool of assets.",
    "However, that's not where the value ends. By combining CORE's   IoT solutions with the global logistics network, we can then link   shipment tracking to ULD tracking because we have the shipment   data. In effect, this will create more real time data events for   consumption by the wider Descartes community, not just the air   carriers, but also the forwarders and their customers, the   shippers.",
    "Even broader, CORE has applications which allow you to   visualize what's going on with the ULDs and mail so that you can   have accurate visibility over your air cargo. Source data   collection from the ULDs using the GLN to processing information   and applications to analyze what was generated.",
    "We're pretty excited about the opportunity to enhance what we   do for the wider air cargo community as we continue with the   integration of CORE into our business. So, also welcome to the   CORE employees and customers. Welcome to Descartes.",
    "Speaking of integration, I'm sure people are keen to hear   about how things are going with Visual Compliance. So, I'll spend   a couple of minutes there. At the top of the call, I mentioned   the constantly changing regulatory environment our customers are   facing every day. Trade is getting more complex and the velocity   of changes is increasing. In order to stay on top of changes to   duties, tariffs, taxes, and sanction lists, customers need access   to timely, reliable information and need systems that can digest   that information.",
    "As a result, we've been building our content offerings over   the last few customers get the right data at the right time.   Visual Compliance provides software solutions, content, and   services to automate customs, trade, and fiscal compliance   processes with a focus on denied and restricted party screening   processes and export licensing.",
    "The acquisition followed our other recent investments in trade   content including Datamyne, CustomsInfo, and MK Data, a business   that was also on denied party screening. Adding Visual Compliance   not only gave us more scale in the denied party screening space,   but it's also complementary to MK Data as it adds new   functionality for us to bring to the market. We're now six months   into the integration and things are going very well.",
    "We're starting to see the benefits of the wider content teams   working together. We've seen a lot of interaction between our   content teams to standardize with best practices and the teams   that gel very well. We continue to make good progress on our   plans to bring these teams together so we can further align our   processes and streamline the content collection and normalization   process.",
    "We're also starting to see more product synergies ahead. As we   think about how we can leverage the Visual Compliance offerings   combined with our CustomsInfo solution as an example. From a   go-to-market perspective, we've already seen synergies over in   our European operations. Our team there has landed a number of   visual compliance deals following our successful cross-training   efforts over the first few months.",
    "And from a financial perspective, we're really pleased with   the continued growth of the recurring revenues of the business   and the financial profile remains very healthy. The business   continues to perform ahead of our plans, which has contributed to   our aggregate growth being ahead of our planned range.",
    "Before handing the call over to Allan to talk more about the   financials, I'd like to thank some people that continue to   contribute to the strength of our business. Thank you to our   employees for all the hard work they put in to make sure our   customers get results. Our customers continue to get results and   that's why we have a successful business.",
    "Thank you to our customers who continue to place confidence in   Descartes as their network of choice, whether you're a shipper,   logistics intermediary, carrier, or even a government agency,   thank you for connecting and helping our community grow and   thanks for your continued engagement. I would also like to thank   our partners for helping us continue to expand our ecosystem and   thanks to our shareholders both new and long-standing for   continuing to have confidence in Descartes and supporting us with   your capital.",
    "With that, I'll turn the call over to Allan to go through the   financial highlights for Q2.",
    " Allan Brett -- Chief Financial Officer ",
    "Thanks, Ed. As indicated, I'm going to walk you through our   financial results for our second quarter ended July 31st. We are   pleased to report record quarterly revenues of $80.5 million this   quarter, up 20% from revenues of $67.1 million in the second   quarter of last year. This revenue growth was achieved from solid   organic growth as well as from our recent acquisitions. As well,   we've achieved despite a negative impact from foreign exchange of   approximately $900,000 over Q2 of last year.",
    "Our revenue mix continues to be very strong, with services   revenue increasing 20% to $71.4 million or 89% of total revenue   in the second quarter compared to $59.7 million in the same   quarter last year and also consistent at 89% of revenue. License   revenue came in at $1.1 million or just over 1% of sales in the   quarter, down slightly from license revenue of $1.3 million or 2%   of revenue in Q2 last year while professional service and other   revenue came in at $8.0 million or 10% of revenue, nicely up from   $6.1 million or 9% of revenue in the second quarter of last   year.",
    "Gross margin was solid at 74% of revenue for the quarter,   which is up slightly from gross margin from 73% in the second   quarter last year. This increase is mainly due to the addition of   the Visual Compliance business acquired in mid-February as well   as from continuing growth in revenue from new and existing   customers.",
    "With solid revenue and continued strong cost control, we   continue to see strong adjusted EBITDA growth of approximately   32% to $30.2 million or 37.5% of revenue compared to $22.8   million or 34% of revenue in the same period of last year.   Consistent with past quarters, the FX impact on adjusted EBITDA   was insignificant as we remained fairly naturally hedged to FX   movements across our business.",
    "As a result of the solid operating results, cash flow   generated from operations came in at $26.9 million or   approximately 89% of adjusted EBITDA in the second quarter this   year, up 48% compared to operating cash flow of $18.2 million or   80% of adjusted EBITDA in Q2 last year. Going forward, subject to   unusual events and quarterly fluctuations, we expect to see   continued strong offering cash flow conversion of between 80% and   90% of our adjusted EBITDA for the balance of fiscal 2020.",
    "From a GAAP earnings perspective, net income came in at $8.6   million or $0.10 per diluted common share in the second quarter,   up slightly from net income of $8.5 million or $0.11 per diluted   common share in the same period last year. Overall, we are   pleased with these operating results in the second quarter as   strong revenue growth allowed us to make increased investments in   our business while achieving 32% growth in adjusted EBITDA and   generating strong cash flow.",
    "If we look at the balance sheet, our cash balances totaled   $27.4 million at the end of the second quarter, while borrowings   under our credit facility were $22.8 million for a net cash   position of just under $5 million at the end of the second   quarter.",
    "As Ed mentioned earlier, we completed an equity offering   during the second quarter, issuing 6.9 million common shares at a   price of $35.50, resulting in gross proceeds of $245 million and   after all issuance costs, net proceeds of approximately $237   million. We used those proceeds from the equity issue in the   second quarter to repay a large portion of the balance that was   outstanding under our credit facility.",
    "We also used our cash flow of operations to replay   approximately $30 million on the credit facility during the   second quarter while we also drew approximately $43.8 million on   the credit facility to complete the CORE Transport and STEPcom   acquisitions during the quarter.",
    "Subsequent to the end of the second quarter, we also borrowed   approximately $11 million on the credit facility to complete the   BestTransport acquisition. As a result, we currently have   approximately $320 million available to us to draw under the   credit facility.",
    "In addition, we were able to offer just over $500 million of   capital under the current shelf perspectives. So, clearly, we   continue to be very well-capitalized to allow us to consider all   acquisition opportunities in our market consistent with our   business plan.",
    "As we look ahead to the second half of this year, after   incurring approximately $2.4 million in capital additions in the   first half of the year, we expect to incur approximately $2.5   million to $3.5 million in additional capital expenditures for   the balance of the year, with this balance expected to include   further investments in our network security and   infrastructure.",
    "We expect amortization expense will be approximately $27   million for the balance of FY 20 with this figure being subject   to adjustment for FX changes and future acquisitions. Our income   tax rate came in at 26.3% of pre-tax revenue in the first half of   the year, which is very close to our statutory rate in Canada and   the US.",
    "Going forward, we expect that our tax rate will continue to   trend in the range of 25% to 28% of pre-tax income over the   balance of the year. Though, as always, we should add that our   tax rate may fluctuate from quarter to quarter from one-time tax   adjustments that may arrive as we operate internationally across   multiple countries. Finally, we expect stock-based compensation   will be approximately $2.6 million to $2.8 million for the   balance of fiscal 2020 subject to any forfeitures of stock   options or share units.",
    "With that, I'll turn it back over to Ed to wrap up.",
    " Edward Ryan -- Chief Executive Officer ",
    "Thanks, Allan. Before talking about calibration, I just wanted   to highlight that we set up the conference registration site for   Evolution 2020, our annual user and partner conference. Evolution   2020 will be held at the Diplomat beach resort in Fort   Lauderdale, Florida from Tuesday, March 17th to Thursday, March   19th, 2020. It's a great opportunity to meet the people that   build and deploy our solutions as well as the customers that use   them. If you want to learn about Descartes, it's really a good   investment of your time and I would encourage you to book   early.",
    "With that, let's move on to our calibration for Q3 FY 2020.   Similar to previous quarters, we don't provide guidance but we   use our baseline calibration as a key metric related to the   ongoing health and strength of our business. Our calibration for   Q3 includes the addition of BestTransport with the business for a   partial quarter and assumes the following exchange rates -- a   $0.75 Canadian dollar, $1.11 euro to US dollar, and $1.21 GBP to   US dollar.",
    "Our calibration for Q2 is $78.2 million in visible recurring   contracted revenues, otherwise known as our baseline revenues.   Our baseline operating expenses are $53.4 million, a baseline   calibration of $24.8 million for adjusted EBITDA from Q3.",
    "Some other key points related to how we're positioned for   fiscal 2020 -- we have a solid financial footing. We have a   healthy business that's well-calibrated and we have a healthy   balance sheet. We are profitable and cash-generating. We have low   capital needs within our organic business. And as you've seen   from our recent historical financial results, we have solid   growth in our organic business. Our primary uses of capital are   for continued use and acquisitions, we've completed 45   acquisitions since 2006.",
    "And we have access to additional capital quickly, should we   need it. Before the acquisition of BestTransport at July 31st, we   had $23 million drawn on our $350 million line of credit and we   have the ability to expand that line of credit to $500 million if   needed. We also have a preliminary shelf perspective for up to   $750 million, of which just over $500 million remains unused, to   raise capital by other mechanisms. In short, we have good   capacity for our planned acquisition activity.",
    "We also have a strong acquisition pipeline. There continues to   be a lot of industry activity now with consolidation continuing   in our market with our capital capacity and our execution   capabilities, there are still a number of acquisition   opportunities to expand the geographic reach, functional   capabilities, trade data or content or community participants on   our network. We continue to see a lot of interesting   opportunities out there to continue or even accelerate our pace   of profitable growth.",
    "We're seeing larger and smaller opportunities and while we   review everything as it comes our way, we're not just buyers for   buyers' sake. The fact that we have an acquisition line of credit   and a shelf filing in place doesn't change how we view   acquisitions. We intend to continue to be prudent on valuation   but we're confident in our ability to deploy capital effectively.   Furthermore, we don't see the recent larger acquisition of Visual   Compliance impacting our ability to continue executing on our   plan.",
    "As I just said, we're competent in our ability to deploy   capital, as you've just seen with our recent acquisitions of   CORE, STEPcom, and BestTransport. And we have a robust   integration methodology in place to help us quickly and   efficiently integrate incoming businesses.",
    "As a reminder for our plans for the remainder of fiscal 2020   -- as we've said in the past, our belief for sustainable growth   in the long-term is a 10% to 15% growth in adjusted EBITDA.   However, given the scale of visual compliance, fiscal 2020 we   indicated would grow in the mid to high 20s. Given our   performance in the first half of the year, we're now confident   that we'll at or just beyond the top end of that range.",
    "As in the past, we intend to invest any overperformance back   into the business. Our growth is planned to come through a   combination of organic and inorganic activities and as always,   acquisitions are not incremental to this plan. We intend to   continue to focus on recurring and deemphasize one-time license   sales. Given the current performance of the business and mindful   of the FX environment, our planned operating margin range remains   at 35% to 40%. So, please keep in mind this could vary if we buy   other businesses that need fixing up or if the FX environment   changes, both of which would impact that metric in the short   run.",
    "Finally, as always, we'll continue to make ourselves available   to shareholders to answer any questions. We believe we've got a   great business. We want to be available to help people learn   about our business. We'll continue to spend time and resources to   get the word out and we hope you'll do the same. So, with that,   Operator, I'd like to open the call up to questions.",
    " Operator ",
    "Thank you. If you have a question, please press * then 1 on   your touch tone telephone or if you wish to be removed from the   queue, please press the # sign. There is going to be a delay for   the first question is announced. If you're using a speakerphone,   you may need to pick up the handset first before pressing the   numbers. Once again, if you have a question, please press * then   1 on your touch tone telephone.",
    "Your first question comes from Raimo Lenschow with Barclays.   Your line is open.",
    " Mike -- Barclays -- Analyst ",
    "Hey. This is Mike on for Raimo. Congrats on the quarter, guys.   I wanted to touch base on the strong acquisition pipeline you   talked about. When you think about the puts and takes behind that   right now for your business and expanding those EBITDA margins   for 35% to 40% for the rest of the year, could you talk a little   bit about the balance you're seeing between reinvestments back   into the business, which obviously you guys have been doing on   the R&D side and acquisitions -- has anything changed with   visual compliance there and kind of that being stepped up, at   least for the kind of short-term?",
    " Edward Ryan -- Chief Executive Officer ",
    "I think you're going to see us operate the same way we have   for the last number of years. We continue to see a strong market   for potential acquisitions. We look at every one of them.   Sometimes they're over-priced. A lot of stuff in this market is   over-priced because everyone thinks that it's a great time to   sell their business.",
    "That's true for some and not for others. We're trying to   manage our business as well as we can and deploy our capital   efficiently. I don't think in our minds there's any material   change in that belief. Sometimes more acquisitions come along   that look like great fits to us and we're able to get a deal done   with someone and sometimes they don't. We don't push it if it's   not there.",
    " Mike -- Barclays -- Analyst ",
    "Just a little bit more detail on the cash conversion, which   was especially impressive this quarter at 89% -- can you talk   about the puts and takes there and what drove that up. That's a   lot higher than what we've seen over the last couple of quarters   or significantly higher. Is there anything specific that you   wanted to call out on that end?",
    " Edward Ryan -- Chief Executive Officer ",
    "Not really. We typically see conversions in the 80% to 90%   range of adjusted EBITDA. For this one, we're right at the top of   that range. Interest expense went down in the quarter compared to   last quarter, typically the second quarter can be a better   collection a quarter. So, it's just one of those things. We do   see fluctuations. Last second quarter, we were at 80%. It was a   weaker quarter as a couple receivables didn't come in, just more   of the same. You could expect us to fluctuate typically in that   80% to 90% range -- nothing terribly unusual.",
    " Mike -- Barclays -- Analyst ",
    "Thanks, guys. Congrats on the quarter.",
    " Operator ",
    "Your next question is from Matt Pfau with William Blair. Matt,   your line is open.",
    " Matt Pfau -- William Blair -- Analyst ",
    "Hey, guys. Thanks for taking my questions. I wanted to ask a   few on MacroPoint. First of all, are you gaining any more   traction with shippers? My understanding is that your primary   exposure with MacroPoint is traditionally with brokers, but have   you seen anything on the shipper side? Then also, at your user   event earlier this year, I think it was discussed about entering   the European market with macro point sometime during 2019. So, I   just was wondering what the update on that is.",
    " Edward Ryan -- Chief Executive Officer ",
    "Thanks, Matt. We do business with a lot of shippers on the   MacroPoint side. Our primary customer base is freight workers and   3PLs. Typically, we're trying to deal with shippers trying to   supplement the information they're getting from their broker.   That's their primary driver in that market. We also have had a   number of large shippers come to us over the last several years   to sign up for the service and we're happy to do that. They're   usually supplementing something they're already doing with a   freight broker and looking for one place where they can go and   get all the tracking information.",
    "As far as the European markets are concerned, we're making a   very cautious move in there. you have a lot of personal privacy   issues in Europe to get over and certainly some language barriers   as well. We're starting with some of the English-speaking   countries and being very careful about how we're collecting   information from drivers to not run afoul of any rules over   there.",
    " Matt Pfau -- William Blair -- Analyst ",
    "I also wanted to ask on the capacity-matching solution --   related to some of the dynamics going on in the trucking industry   currently, how are those impacting the demand for capacity   matching from the broker side and then from the supply side with   the actual carriers, how does the current environment impact   capacity matching?",
    " Edward Ryan -- Chief Executive Officer ",
    "It's not for me to tell, really. We're in the early innings of   this. It's not enough for us to see massive trends in it other   than the customers that have gone through this process and now,   we're opening that up to other mid-size brokers and 3PLs. They   continue to expand their usage of the service as they get into   it.",
    "It's not clear to me what the impact on the market is yet. We   don't have a big enough representative sample. I can tell that   the customers are getting a lot of benefit out of it. Everyone   that started in those initial pilots is rolling the solution out   and using it more and more effectively every day. We're really   excited about that.",
    " Matt Pfau -- William Blair -- Analyst ",
    "Thanks, guys. That's all I had about that.",
    " Operator ",
    "Your next question comes from David Hynes with Canaccord.   David, your line is open.",
    " David Hynes -- Canaccord Genuity -- Analyst ",
    "Hey, guys. Nice set of numbers. Ed, I wanted to ask you   generically around trade volumes, it's hard to parse out given   diversity of the business. Are you seeing any slow down at all   given the ongoing trade disputes? I guess as part of that, maybe   you can remind us the exposure to China you have there.",
    " Edward Ryan -- Chief Executive Officer ",
    "We haven't, really. We read the same newspapers you do. So,   we're kind of watching to see what will happen. We haven't seen   much impact on our network. Some of that may make sense, right?   One of the big reactions you see with companies who are dealing   with trade restrictions in certain countries is to start moving   manufacturing to other locations. From the perspective of our   network, we don't really care where the shipment comes from. We   care that it gets made.",
    "So, whether that shipment comes out of China or Vietnam, it's   still a shipment that's going out over our network. Now, if you   live in China or Vietnam, it might be an issue, but from the   perspective we take on it, we're just trying to process the   world's shipments. That still ended up being a shipment on our   network. Which country it came from is not particularly material   to us.",
    "The part that it has helped quite a bit and may continue is   our trade data content business, a big part of it is focused on   database and tariffs and duties. Over the last couple of years,   with all that has gone on around the world, not just in the US   but other countries around the world too, I've put a real high   focus on that trade data information and it's one of the   faster-growing parts of our business as a result. So, we're   pretty excited about that.",
    " David Hynes -- Canaccord Genuity -- Analyst ",
    "One housekeeping for Allan and then I'm going to come back to   you, Ed, for one -- share comp expected -- diluted shares for Q3,   like just over $85 million, $85.2 million -- is that the right   spot we should be?",
    " Allan Brett -- Chief Financial Officer ",
    "For Q2, that might be a little high. We did the share issuance   right at the middle of the quarter. So, a dilution of 3.5 million   shares, essentially, for Q2. It will be in the full effect in Q3.   I think it's $84.5 million. You're testing my change, but $84   million and change of shares outstanding. So, around that. Just   look at the balance sheet. A lot of the balance sheet, you'll   have the actual numbers. But about half a dilution effect for   this quarter and the second part of it comes through Q3.",
    " David Hynes -- Canaccord Genuity -- Analyst ",
    "Ed, Matt was asking earlier about capacity matching and the   opportunity there. It seems like there are two strategies in the   market. There are the folks who are competitors trying to   disintermediate the 3PLs and the freight brokers and you guys   have taken a different tact, which is deliver tech to enable   those folks. Can you talk about your view of the challenges that   the competitors who are trying to disintermediate will face and   what gives you confidence that you're pursuing the right   strategy, if that makes sense?",
    " Edward Ryan -- Chief Executive Officer ",
    "Sure. Thanks for asking. I feel like I've seen this movie   before. The same thing happened in the late 90s, early 2000s   timeframe, where a bunch of dotcoms came in and said, \"We're   going to disintermediate this entire market.\" If you look back on   that time, every one of those companies did not succeed, in our   market in particular. That's not how they did it. They did not   cut the freight borders and the 3PL down.",
    "In fact, those markets have grown substantially since then. We   don't think it's that easy to manage people's freight and I don't   think you're going to quickly do it on a website and problem   solved. Because of what we have in MacroPoint, where we have   visibility into hundreds of thousands of trucks every day and   where they're going to be a few days from now, we think that's   very valuable information to help companies decide who the next   carrier should be or who the next driver should be to take that   next load.",
    "To the extent that we can identify three or four trucks or ten   trucks within a couple miles of that location who are available   for pick up three days from now, that information could save a   freight broker $150 to $250 on a move because they don't have to   pay for backhaul or deadheading to drive empty to the pickup   location.",
    "There are two things you can do with that. The first is you   can say, \"I'm going to be a freight broker and I'll save that   $200.\" The second is the approach that we're taking, which is,   \"Hey, I do business with 5,000 or 6,000 freight brokers around   North America. Why don't I just provide that information to them,   my customer and have them make the money and hope they'll give me   a cut of it for providing that information?\"",
    "We have no intention a freight broker. I look at the guys that   are doing it and I say, \"Hey, the last time someone tried to do   this, they didn't do that well.\" I have seen a lot of the market   go that way. They come out and they get investors and get   valuations in the hundreds of millions of dollars for a company   that's doing $2 million or $3 million in revenue and they have a   lot of expectations to meet and I don't think they're going   to.",
    "I look at our approach to it and I say I think it's a much   more reasonable approach. I think it's something that's helping   our customers and helping the market be more efficient. I think   the guys that are trying to say, \"Hey, I'll help the market be   more efficient too and I'm going to put all the money in my   pocket.\" I think those guys are being greedy and will eventually   get burned.",
    " David Hynes -- Canaccord Genuity -- Analyst ",
    "That's helpful. Thanks, guys.",
    " Operator ",
    "Your next question comes from Justin Long with Stephens.   Justin, your line is open.",
    " Justin Long -- Stephens -- Analyst ",
    "Thanks and congrats on the quarter. Maybe to start with the   adjusted EBITDA growth guidance for this year, I wanted to be   clear on what drove that upward revision. Was that a function of   visual compliance outpacing expectations or has your assumption   on organic growth improved as well? Maybe if we think about that   EBITDA growth in the high-20s or something around that this year,   could you speak to the rough split of that between organic and   acquisition-driven growth?",
    " Edward Ryan -- Chief Executive Officer ",
    "I'll make a couple of comments about it and then pass it to   Allan. At a high level, we were bumping against the top of the   range we have given previous, which I think was 32% to 37%. We   were getting closer to that. You're absolutely right. Visual   Compliance was a very profitable company and was behind us and   then moving the range up to 35% to 40%. Prior to that, our   business was performing very well and continued to move up and up   each quarter and then we bought Visual Compliance and we said   we're definitely going to be in that range now for the   foreseeable future. Allan?",
    " Allan Brett -- Chief Financial Officer ",
    "Sure. Ed was referring to the EBITDA as a percentage of   revenue. That's exactly true on that front. If you're looking at   it from an EBITDA growth perspective, where we came in at 32% for   the quarter and as Ed mentioned, we had said in the previous   quarter that we would be in the mid to high-20s as a growth rate   for this year, we're feeling more comfortable with the business   overall.",
    "We've run visual compliance now for five and a half months.   We've added some small additional items or companies to our mix   here. The business is performing well organically. That led us to   a bit more comfort to say we'll fit the higher end of that range   into the 30-ish range as far as growth in EBITDA. So, you've kind   of got now answers on both -- EBITDA growth and EBITDA as a   percentage of revenue. And both have impacts of our core business   improving and visual compliance improving.",
    "And then separately, your last piece of the question was split   between organic and acquisitions -- our typical model growing 10%   to 15% a year, where I think our 10-year average is 17%, you   should roughly think of that as being roughly split half and   half, half organic growth in EBITDA, half acquisitions. In a year   like this where we're going to be upwards around 30% or so, much   more of that is coming from acquisitions. Our core business is   performing as we would expect and that's great. That's giving a   good, solid, EBITDA growth. The rest is coming from   acquisitions.",
    " Operator ",
    "Your next question comes from Paul Treiber with RBC Capital   Markets. Paul, your line is open.",
    " Paul Treiber -- RBC Capital Markets -- Analyst ",
    "Thanks very much and good afternoon. I'm hoping that you can   elaborate more on BestTransport and the TMS strategy in general.   You have a number of partnerships with TMS companies. How do you   decide between partnering with these companies and then owning a   TMS vendor themselves. At what point would you consider moving   into the broader TMS market?",
    " Edward Ryan -- Chief Executive Officer ",
    "BestTransport is a niche player in hat business and fairly   unique player in that business and they handle something that's a   little more complicated than your normal truck move in that it's   flatbed. People get a flatbed because the cargo is odd-shaped and   more difficult to move and you can't put it inside a trailer. We   wanted to have that functionality in our TMS. We thought our   customers would benefit from getting access to that   functionality. We certainly didn't buy it to go after any of our   partners that are in the broader TMS market.",
    "I think if you asked them, they would say the flatbed is a   relatively small part of most of their customers. Our   partnerships in that space are largely based around connectivity.   That's why we're working with SAP and Oracle and a bunch of other   TMS providers to be the network of choice for their customers so   they can get connected to those carriers.",
    "If you think about it, what BestTransport brings us there,   maybe one of the more valuable things is connections to those   flatbed carriers that may otherwise have been somewhat elusive   because they're relatively small players in the market. Now,   they're on our network and if you look at the BestTransport   acquisition from that perspective, you probably have a pretty   good sense of where they're coming from and buying it.",
    "We didn't think of it as a predatory move to our partners. We   thought of something that would help them. They want to provide   connectivity to flatbed providers in their TMS. Now, I'm   available to do that and like to do it all electronically. So,   that's the driving force behind it.",
    " Paul Treiber -- RBC Capital Markets -- Analyst ",
    "Is there an opportunity for synergies between BestTransport   and MacroPoint in capacity matching?",
    " Edward Ryan -- Chief Executive Officer ",
    "For sure. They bring a whole new set of carriers to the table,   a whole new set of shipper customers to the table as well. To the   extent that there are people using those solutions that also want   to use capacity matching or brokers on our network that want to   use capacity matching and now match up for flatbed moves -- I   have a much better ability to do that today than I did before the   BestTransport acquisition.",
    " Operator ",
    "Your next question comes from Scott Group with Wolfe Research.   Scott, your line is open.",
    " Rob -- Wolfe Research -- Analyst ",
    "Good evening, guys. It's Rob on for Scott. I'm just following   up in terms of the organic growth -- clearly, in North America,   we've seen some very light rail carload volumes as well as soft   truck demand more broadly. I was hoping you could speak to your   view of the sustainability of the organic growth as we look   forward in what could be a softer freight in market.",
    " Edward Ryan -- Chief Executive Officer ",
    "The short answer is I don't know. I also don't know what's   going to happen to the freight market any better than anyone else   in our industry, other than to say that if transportation volumes   go down, we get paid by the shipment to process transactions and   if there are less transactions, there's less revenue for us and   therefore, either our organic revenue is going to slow or we're   going to have to sell more to keep it growing at the rate that it   is. I don't have a crystal ball.",
    "We don't put stats out there about what's going to happen in   the future. We know over the past couple of years, it's gotten   better. I think it's due to us having a better network every day   with more participants on it. That's partially due to some of the   acquisitions we've bought in the past few years, where they're   growing at a faster clip than some of the things we've bought in   the past.",
    "Then our company is doing a good job of integrating those   acquisitions in and getting them to perform better than they were   before we bought them. I hope that continues. If we have to do   that with some headwinds in the transportation market pushing   against us, it will make it harder. If the transportation market   continues to boom as it has over the last couple of years, that's   going to make it easier for us and give us the potential to do   even better. It's growing nicely and has been growing nicely the   past couple of years and we hope it continues and if not, we're   going to do our best to manage through it.",
    " Rob -- Wolfe Research -- Analyst ",
    "You guys clarified in terms of some of the concerns we've been   hearing in the market about trade and shifting of volume of China   to other Asian countries and the impact for Descartes -- I was   hoping you could speak a little bit about in the news, we've seen   some order consolidation with the recent closure by DSV. How does   that impact if we're seeing growth of some of the bigger   participants -- how does that impact Descartes as we look   forward?",
    " Edward Ryan -- Chief Executive Officer ",
    "That one in particular has been pretty good for us. DSV is one   of our best customers. They bought Panalpina that was also a very   good customer of ours. We're looking for them to do even -- if we   can get DSV to do all the stuff with Panalpina that DSV is doing   with their own business, I look for that to be pretty good news   for us. That's the way we're talking at the moment. We like the   DSV guys. They've been good customers of ours. They've gone from   a midsize player to one of the largest forwarders in the world.   We're excited for them and excited to help them.",
    " Rob -- Wolfe Research -- Analyst ",
    "We should be thinking about the potential of if you've got a   relationship with the acquirer as being accretive or not, per se,   relative to the target?",
    " Edward Ryan -- Chief Executive Officer ",
    "I think you'll find in the freight forwarding space, we're   going to have relationships with most of the acquirers. It's how   strong that relationship is. In the case of DSV, it's very   strong. Over the last ten years or so, as there has been a lot of   consolidation in this market, the bigger guys tend to be our best   customers. They're the ones that have taken advantage of what we   have more effectively than the smaller and midsize guys.",
    "So, in most cases, it's worked out pretty well for us. They   buy a small freight forwarder who uses some of our stuff but not   all of our stuff and now, all of a sudden, they're bought by a   bigger player who uses a lot of our stuff and as that small   freight forwarder gets rolled into the bigger operation, we tend   to benefit.",
    " Operator ",
    "Your next question comes from Deepak Kaushal with GMP   Securities. Your line is open.",
    " Deepak Kaushal -- GMP Securities -- Analyst ",
    "Hey, guys. A couple of follow-up questions from me on the   recent acquisitions -- on BestTransport, was the opportunity to   sell capacity matching into a niche network the motivation behind   acquiring BestTransport?",
    " Edward Ryan -- Chief Executive Officer ",
    "It was certainly one of them. We saw that opportunity as a   pretty good one. To add, something that's not otherwise there in   the capacity matching space at the moment because it's kind of a   unique space, flatbed is. That was a big help. More broadly, we   wanted to add these flatbed carriers to our network and the   ability to manage a flatbed move to our network. There are not a   lot of networks out there that can do that. Most of that stuff is   done manually today. Now, we have a chance to automate it, not   only for ourselves but as someone mentioned earlier on the call,   for our partners as well.",
    " Deepak Kaushal -- GMP Securities -- Analyst ",
    "Do you see similar or parallel niche networks that could be   well-suited for capacity matching and is that a reasonable   strategy to go forward onto M&A?",
    " Edward Ryan -- Chief Executive Officer ",
    "I think there a couple of opportunities to do that, but I   wouldn't say that's going to be a core driver to our M&A   strategy. BestTransport came along and it's been an opportunistic   thing for us. We saw it for sale and thought that actually might   be a good idea and then we went and talked to them and thought we   could prove that and did so.",
    "I don't know that you'll see it continue to look for those   opportunities. If they're around, we'll look at it and see if we   think it's a good fit. In BestTransport's case, we thought it   was. So, we did it. I think you're more likely to see us go after   stuff in the trade space and some of the areas that we've been   investing in over the last couple of years.",
    " Deepak Kaushal -- GMP Securities -- Analyst ",
    "In terms of driving capacity matching adoption, it's not   necessarily to find these closed networks?",
    " Edward Ryan -- Chief Executive Officer ",
    "No. I think the biggest thing that's going to drive capacity   matching is going to be us going out and getting more and more of   our brokers' heads around using a third-party to provide them   with this information and using that as a competitive advantage   for their competitors and maybe for some of these dotcoms that   think they're going to do it without a broker.",
    " Deepak Kaushal -- GMP Securities -- Analyst ",
    "On STEPcom, you gave some good color on the supply chain   integration network they have. I wanted to know if you can go a   bit further in terms of how different it is from integrating a   transportation network, supply chain versus transportation. In   terms of supply chain, how penetrated are you? How much of your   GLM is related to supply chain specifically and what could the   opportunity become?",
    " Edward Ryan -- Chief Executive Officer ",
    "So, obviously, we're much more focused on the logistics side   of it in that we have just about every transportation provider of   size in the world on our network. So, we're a very large player   in the logistics network space. We're a relatively small player   in the supply chain network space. We eventually believe these   things need to come together. They are different. They all need   to be done.",
    "In our mind, they should be done by somebody that could put   them all together so the end customer, the retailer/manufacturer   can get complete visibility into, \"I ordered this thing with my   purchase order. I created an ASN that said what I'm going to be   shipping. I created a bill of waiting and then started getting   status messages back so that I can see where my stuff is on a   line item basis,\" versus getting information back from a carrier   that, \"Hey, your container is here.\"",
    "That's not that helpful unless you know what's in that   container. Someone can do all that for you. They can put all that   information together. They should give you SKU-level information   as to where your inventory is around the world and when you think   it's going to get to the places it needs to get to so you can   better manage your supply chain. At a very high level, that's   what's behind us buying STEPcom. I think you'll see us do more of   that moving forward.",
    " Deepak Kaushal -- GMP Securities -- Analyst ",
    "Are there certain industries that are more receptive to bring   both of these things under one network?",
    " Edward Ryan -- Chief Executive Officer ",
    "I don't know if industries are more or less. Certainly, the   bigger industries out there, retail, for example, is one of the   groups of people that seem to have the most to gain by doing   this. I think you'll see us go after that group more than most.   They have an awful lot of inventory. Their volumes are extremely   high and if they can sync up some of these things, they can save   a lot of money. That's been something that's driven a lot of not   only our acquisitions but visibility and things like that into   the supply chain space.",
    " Operator ",
    "There are no more questions at this time.",
    " Edward Ryan -- Chief Executive Officer ",
    "Thank you, guys. Appreciate your time and we look forward to   reporting back to you next quarter on our Q3 results.",
    " Operator ",
    "Thank you, ladies and gentlemen. This concludes today's   conference. Thank you for participating. You may now   disconnect.",
    " Duration: 61 minutes ",
    " Scott Pagan -- President and Chief Operating Officer ",
    " Edward Ryan -- Chief Executive Officer ",
    " Allan Brett -- Chief Financial Officer ",
    " Mike -- Barclays -- Analyst ",
    " Matt Pfau -- William Blair -- Analyst ",
    " David Hynes -- Canaccord Genuity -- Analyst ",
    " Justin Long -- Stephens -- Analyst ",
    " Paul Treiber -- RBC Capital Markets -- Analyst ",
    " Rob -- Wolfe Research -- Analyst ",
    " Deepak Kaushal -- GMP Securities -- Analyst ",
    " More DSGX analysis ",
    " All earnings call transcripts ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions   for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcription      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 12:01:25"
}