{
  "url": "https://www.nasdaq.com/article/ishares-nasdaq-biotechnology-etf-experiences-big-outflow-cm1210377",
  "title": "iShares Nasdaq Biotechnology ETF Experiences Big Outflow - Nasdaq.com",
  "text": [
    "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel  , one standout is the iShares Nasdaq Biotechnology ETF (Symbol: IBB) where we have detected an approximate $51.5 million dollar outflow -- that's a 0.8% decrease week over week (from 66,050,000 to 65,550,000). Among the largest underlying components of IBB, in trading today Vertex Pharmaceuticals, Inc. (Symbol: VRTX) is up about 0.7%, Illumina Inc (Symbol: ILMN) is up about 3.7%, and Biogen Inc (Symbol: BIIB) is higher by about 0.6%. For a complete list of holdings, visit the IBB Holdings page »  The chart below shows the one year price performance of IBB, versus its 200 day moving average:       Looking at the chart above, IBB's low point in its 52 week range is $89.01 per share, with $122.97 as the 52 week high point - that compares with a last trade of $103.95. Comparing the most recent share price to the 200 day moving average can also be a useful technical analysis technique -- learn more about the 200 day moving average »  .   makeArticleAd();  Exchange traded funds (ETFs) trade just like stocks, but instead of ''shares'' investors are actually buying and selling ''units''. These ''units'' can be traded back and forth just like stocks, but can also be created or destroyed to accommodate investor demand. Each week we monitor the week-over-week change in shares outstanding data, to keep a lookout for those ETFs experiencing notable inflows (many new units created) or outflows (many old units destroyed). Creation of new units will mean the underlying holdings of the ETF need to be purchased, while destruction of units involves selling underlying holdings, so large flows can also impact the individual components held within ETFs.   Click here to find out which 9 other ETFs   experienced notable outflows »  ",
    "  Click here to find out which 9 other ETFs   experienced notable outflows » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:46:57"
}