{
  "url": "https://www.nasdaq.com/article/chemicals-off-to-a-sluggish-start-in-q3-output-eases-in-july-cm1207198",
  "title": "Chemicals Off to a Sluggish Start in Q3, Output Eases in July - Nasdaq.com",
  "text": [
    " Global chemical production started the third quarter on a weak note with July witnessing a decline in production on sluggish activities across most industry segments, according to the recent monthly report from the American Chemistry Council (\"ACC\").  makeArticleAd(); July Sees a Slowdown    The chemical industry trade group said that the Global Chemical Production Regional Index (\"CPRI\") fell 0.1% in July on a monthly comparison basis, following a 0.6% rise a month ago.    The Global CPRI, which is measured using a three-month moving average, measures chemical production volumes for 33 major nations, sub-regions and regions. It is comparable to the Federal Reserve Board (\"FRB\") production indices.    Capacity utilization for the global chemical industry eased 0.3 percentage points to 82.9% in July. Utilization also fell from 84.4% a year ago.    By regions, July saw lower production across North America (down 0.9%), Latin America (down 0.1%), Europe (down 0.5%) and the Former Soviet Union (down 0.4%). Output rose in Africa & the Middle East (up 0.2%) and the Asia-Pacific (up 0.2%).    On a segment basis, activities were soft in July. Declines were witnessed across consumer products, inorganic chemicals, organic chemicals, plastic resins and other specialty chemicals for the reported month. Output rose across synthetic rubber, manufactured fibers, coatings and agricultural chemicals.    Per the ACC, chemical production in the United States went down 1% on a monthly comparison basis in July. This follows a 0.8% sequential decline a month ago.     Chemical Industry Hamstrung by Trade Tariffs    The chemical industry is among those industries that have been the hardest hit by the fierce year-long trade spat between the United States and China. In particular, the U.S. chemical industry is caught in the crosshairs of the trade conflict.    Washington and Beijing levied billions of dollars in punitive tariffs on each others' products last year. China's list of U.S. goods hit with tariffs includes an array of petrochemicals, specialty chemicals and plastics. Moreover, the Trump administration last month reignited trade tiff with China by announcing new 10% tariffs on an additional $300 billion worth of Chinese exports not already covered by earlier rounds of tariffs.    In response, China recently hit back by slapping 5% to 10% tariff on $75 billion of U.S. imports, some of which took effect on Sep 1. The second phase of tariffs is slated to be effective Dec 15.    The United States retaliated by raising the tariffs on $300 billion of Chinese goods from 10% to 15%, some of which went into effect on Sep 1. The U.S. administration also increased tariff to 30% from the existing 25% on $250 billion in Chinese imports, effective Oct 1.    The previous rounds of tariffs currently in place are already doing damage to the U.S. chemical industry. China is one of the biggest export markets for U.S. chemicals, leaving the American chemical industry heavily exposed to Beijing's retaliatory tariffs. The tariffs are hurting U.S. chemical exports. The new round of tariffs will further hurt the chemical industry.    Chemical makers are also seeing demand weakness in China associated with the U.S.-China trade war amid a slowing Chinese economy. Notably, the trade friction has led to a slowdown in demand in the automotive market (a major chemical end-use market) in China.    Moreover, a slowing global economy, partly due to the trade tensions, is a concern for the chemical industry. Economic conditions have, in particular, weakened across emerging economies. Moreover, Brexit and other concerns have led to a slowdown in the European economy. Trade war and a slowdown in the automotive industry are hurting the European chemical industry.   Chemical Stocks to Watch For    A few stocks currently worth considering in the chemical space are NewMarket Corporation NEU  , Sinopec Shanghai Petrochemical Company Limited SHI  , Israel Chemicals Ltd. ICL  and Axalta Coating Systems Ltd. AXTA  . NewMarket and Sinopec Shanghai sport a Zacks Rank #1 (Strong Buy), while Israel Chemicals and Axalta Coating Systems carry a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .    NewMarket has expected earnings growth of 16.2% for the current year. Earnings estimates for the current year have been revised 10.4% upward over the last 60 days. Sinopec Shanghai has an expected earnings growth of 8.8% for the current year. Earnings estimates for the current year have been revised 9.7% upward over the last 60 days.    Israel Chemicals has expected earnings growth of 13.5% for the current year. The company has delivered positive earnings surprise in each of the trailing four quarters with an average beat of 12.8%.    Axalta Coating Systems has expected earnings growth of 39.8% for the current year. Earnings estimates for the current year have been revised 3.5% upward over the last 60 days.   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   SINOPEC Shangai Petrochemical Company, Ltd. (SHI): Free Stock Analysis Report   NewMarket Corporation (NEU): Free Stock Analysis Report   Israel Chemicals Shs (ICL): Free Stock Analysis Report   Axalta Coating Systems Ltd. (AXTA): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Global chemical production started the third quarter on a weak note with July witnessing a decline in production on sluggish activities across most industry segments, according to the recent monthly report from the American Chemistry Council (\"ACC\").  makeArticleAd(); July Sees a Slowdown    The chemical industry trade group said that the Global Chemical Production Regional Index (\"CPRI\") fell 0.1% in July on a monthly comparison basis, following a 0.6% rise a month ago.    The Global CPRI, which is measured using a three-month moving average, measures chemical production volumes for 33 major nations, sub-regions and regions. It is comparable to the Federal Reserve Board (\"FRB\") production indices.    Capacity utilization for the global chemical industry eased 0.3 percentage points to 82.9% in July. Utilization also fell from 84.4% a year ago.    By regions, July saw lower production across North America (down 0.9%), Latin America (down 0.1%), Europe (down 0.5%) and the Former Soviet Union (down 0.4%). Output rose in Africa & the Middle East (up 0.2%) and the Asia-Pacific (up 0.2%).    On a segment basis, activities were soft in July. Declines were witnessed across consumer products, inorganic chemicals, organic chemicals, plastic resins and other specialty chemicals for the reported month. Output rose across synthetic rubber, manufactured fibers, coatings and agricultural chemicals.    Per the ACC, chemical production in the United States went down 1% on a monthly comparison basis in July. This follows a 0.8% sequential decline a month ago.     Chemical Industry Hamstrung by Trade Tariffs    The chemical industry is among those industries that have been the hardest hit by the fierce year-long trade spat between the United States and China. In particular, the U.S. chemical industry is caught in the crosshairs of the trade conflict.    Washington and Beijing levied billions of dollars in punitive tariffs on each others' products last year. China's list of U.S. goods hit with tariffs includes an array of petrochemicals, specialty chemicals and plastics.",
    "Moreover, the Trump administration last month reignited trade tiff with China by announcing new 10% tariffs on an additional $300 billion worth of Chinese exports not already covered by earlier rounds of tariffs.    In response, China recently hit back by slapping 5% to 10% tariff on $75 billion of U.S. imports, some of which took effect on Sep 1. The second phase of tariffs is slated to be effective Dec 15.    The United States retaliated by raising the tariffs on $300 billion of Chinese goods from 10% to 15%, some of which went into effect on Sep 1. The U.S. administration also increased tariff to 30% from the existing 25% on $250 billion in Chinese imports, effective Oct 1.    The previous rounds of tariffs currently in place are already doing damage to the U.S. chemical industry. China is one of the biggest export markets for U.S. chemicals, leaving the American chemical industry heavily exposed to Beijing's retaliatory tariffs. The tariffs are hurting U.S. chemical exports. The new round of tariffs will further hurt the chemical industry.    Chemical makers are also seeing demand weakness in China associated with the U.S.-China trade war amid a slowing Chinese economy. Notably, the trade friction has led to a slowdown in demand in the automotive market (a major chemical end-use market) in China.    Moreover, a slowing global economy, partly due to the trade tensions, is a concern for the chemical industry. Economic conditions have, in particular, weakened across emerging economies. Moreover, Brexit and other concerns have led to a slowdown in the European economy. Trade war and a slowdown in the automotive industry are hurting the European chemical industry.   Chemical Stocks to Watch For    A few stocks currently worth considering in the chemical space are NewMarket Corporation NEU  , Sinopec Shanghai Petrochemical Company Limited SHI  , Israel Chemicals Ltd. ICL  and Axalta Coating Systems Ltd. AXTA  . NewMarket and Sinopec Shanghai sport a Zacks Rank #1 (Strong Buy), while Israel Chemicals and Axalta Coating Systems carry a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .    NewMarket has expected earnings growth of 16.2% for the current year. Earnings estimates for the current year have been revised 10.4% upward over the last 60 days.",
    "Sinopec Shanghai has an expected earnings growth of 8.8% for the current year. Earnings estimates for the current year have been revised 9.7% upward over the last 60 days.    Israel Chemicals has expected earnings growth of 13.5% for the current year. The company has delivered positive earnings surprise in each of the trailing four quarters with an average beat of 12.8%.    Axalta Coating Systems has expected earnings growth of 39.8% for the current year. Earnings estimates for the current year have been revised 3.5% upward over the last 60 days.   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:20:00"
}