{
  "url": "https://www.nasdaq.com/article/xcel-energy-a-top-socially-responsible-dividend-stock-with-25-yield-xel-cm1207105",
  "title": "Xcel Energy a Top Socially Responsible Dividend Stock With 2.5% Yield (XEL) - Nasdaq.com",
  "text": [
    "Xcel Energy Inc (Symbol: XEL) has been named a Top Socially Responsible Dividend Stock by Dividend Channel  , signifying a stock with above-average ''DividendRank''  statistics including a strong 2.5% yield, as well as being recognized by prominent asset managers as being a socially responsible investment, through analysis of social and environmental criteria. Environmental criteria include considerations like the environmental impact of the company's products and services, as well as the company's efficiency in terms of its use of energy and resources. Social criteria include elements such as human rights, child labor, corporate diversity, and the company's impact on society - for instance, taken into consideration would be business activities tied to weapons, gambling, tobacco, and alcohol. According to the ETF Finder  at ETF Channel  , Xcel Energy Inc is a member of the iShares MSCI USA ESG Select ETF ( SUSA  ), making up 0.99% of the underlying holdings of the fund, which owns $11,394,712 worth of XEL shares.    The annualized dividend paid by Xcel Energy Inc is $1.62/share, currently paid in quarterly installments, and its most recent dividend ex-date was on 09/12/2019. Below is a long-term dividend history chart for XEL, which the DividendRank report stressed as being of key importance. Indeed, studying a company's past  dividend history  can be of good help in judging whether the most recent dividend is likely to continue.  makeArticleAd();       XEL operates in the Electric Utilities sector, among companies like NextEra Energy Inc ( NEE  ), and Companhia Paranaense De Energia - COPEL ( ELP  ).   Top 25 Socially Responsible Dividend Stocks -   Income To Feel Good About »  ",
    "According to the ETF Finder  at ETF Channel  , Xcel Energy Inc is a member of the iShares MSCI USA ESG Select ETF ( SUSA  ), making up 0.99% of the underlying holdings of the fund, which owns $11,394,712 worth of XEL shares.",
    "  Top 25 Socially Responsible Dividend Stocks -   Income To Feel Good About » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:12:54"
}