{
  "url": "https://www.nasdaq.com/article/nike-nke-outpaces-stock-market-gains-what-you-should-know-cm1207617",
  "title": "Nike (NKE) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " In the latest trading session, Nike (NKE) closed at $86.35, marking a +1.98% move from the previous day. This change outpaced the S&P 500's 1.08% gain on the day. At the same time, the Dow added 0.91%, and the tech-heavy Nasdaq gained 1.31%. Heading into today, shares of the athletic apparel maker had gained 4.15% over the past month, outpacing the Consumer Discretionary sector's loss of 1.93% and the S&P 500's loss of 0.68% in that time. NKE will be looking to display strength as it nears its nex t earnings  release, which is expected to be September 24, 2019. On that day, NKE is projected to report earnings of $0.71 per share, which would represent year-over-year growth of 5.97%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $10.45 billion, up 5.04% from the year-ago period. For the full year, our Zacks Consensus Estimates are projecting earnings of $2.90 per share and revenue of $42.21 billion, which would represent changes of +16.47% and +7.91%, respectively, from the prior year. Investors should also note any recent changes to analyst estimates for NKE. These revisions typically reflect the latest short-term business trends, which can change frequently. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Based on our research, we believe these estimate revisions are directly related to near-team stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. NKE currently has a Zacks Rank of #4 (Sell). Looking at its valuation, NKE is holding a Forward P/E ratio of 29.16. This represents a premium compared to its industry's average Forward P/E of 13.85. It is also worth noting that NKE currently has a PEG ratio of 2.24. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. Shoes and Retail Apparel stocks are, on average, holding a PEG ratio of 1.38 based on yesterday's closing prices. The Shoes and Retail Apparel industry is part of the Consumer Discretionary sector. This industry currently has a Zacks Industry Rank of 32, which puts it in the top 13% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. You can find more information on all of these metrics, and much more, on Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  NIKE, Inc. (NKE): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "In the latest trading session, Nike (NKE) closed at $86.35, marking a +1.98% move from the previous day. This change outpaced the S&P 500's 1.08% gain on the day. At the same time, the Dow added 0.91%, and the tech-heavy Nasdaq gained 1.31%.",
    "Heading into today, shares of the athletic apparel maker had gained 4.15% over the past month, outpacing the Consumer Discretionary sector's loss of 1.93% and the S&P 500's loss of 0.68% in that time.",
    "NKE will be looking to display strength as it nears its nex t earnings  release, which is expected to be September 24, 2019. On that day, NKE is projected to report earnings of $0.71 per share, which would represent year-over-year growth of 5.97%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $10.45 billion, up 5.04% from the year-ago period.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of $2.90 per share and revenue of $42.21 billion, which would represent changes of +16.47% and +7.91%, respectively, from the prior year.",
    "Investors should also note any recent changes to analyst estimates for NKE. These revisions typically reflect the latest short-term business trends, which can change frequently. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.",
    "Based on our research, we believe these estimate revisions are directly related to near-team stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. NKE currently has a Zacks Rank of #4 (Sell).",
    "Looking at its valuation, NKE is holding a Forward P/E ratio of 29.16. This represents a premium compared to its industry's average Forward P/E of 13.85.",
    "It is also worth noting that NKE currently has a PEG ratio of 2.24. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. Shoes and Retail Apparel stocks are, on average, holding a PEG ratio of 1.38 based on yesterday's closing prices.",
    "The Shoes and Retail Apparel industry is part of the Consumer Discretionary sector. This industry currently has a Zacks Industry Rank of 32, which puts it in the top 13% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "You can find more information on all of these metrics, and much more, on Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:45:25"
}