{
  "url": "https://www.nasdaq.com/article/is-agco-corporation-agco-a-good-stock-for-value-investors-cm1210458",
  "title": "Is AGCO Corporation (AGCO) a Good Stock for Value Investors? - Nasdaq.com",
  "text": [
    " Value investing is easily one of the most popular ways to find great stocks in any market environment. After all, who wouldn't want to find stocks that are either flying under the radar and are compelling buys, or offer up tantalizing discounts when compared to fair value? One way to find these companies is by looking at several key metrics and financial ratios, many of which are crucial in the value stock selection process. Let's put AGCO Corporation AGCO   stock into this equation and find out if it is a good choice for value-oriented investors right now, or if investors subscribing to this methodology should look elsewhere for top picks:  PE Ratio  A key metric that value investors always look at is the Price to Earnings Ratio, or PE for short. This shows us how much investors are willing to pay for each dollar o f earnings  in a given stock, and is easily one of the most popular financial ratios in the world. The best use of the PE ratio is to compare the stock's current PE ratio with: a) where this ratio has been in the past; b) how it compares to the average for the industry/sector; and c) how it compares to the market as a whole. On this front, AGCO Corporation has a trailing twelve months PE ratio of 15.43, as you can see in the chart below:      This level actually compares pretty favorably with the market at large, as the PE for the S&P 500 stands at about 18.36. If we focus on the long-term PE trend, AGCO Corporation's current PE level puts it below its midpoint over the past five years.      Further, the stock's PE compares favorably with the Zacks Industrial Products sector's trailing twelve months PE ratio, which stands at 16.26. At the very least, this indicates that the stock is relatively undervalued right now, compared to its peers.       We should also point out that AGCO Corporation has a forward PE ratio (price relative to this year's earnings) of just 14.46, so it is fair to say that a slightly more value-oriented path may be ahead for AGCO Corporation stock in the near term too.    P/S Ratio  Another key metric to note is the Price/Sales ratio. This approach compares a given stock's price to its total sales, where a lower reading is generally considered better. Some people like this metric more than other value-focused ones because it looks at sales, something that is far harder to manipulate with accounting tricks than earnings.  Right now, AGCO Corporation has a P/S ratio of about 0.63. This is lower than the S&P 500 average, which comes in at 3.23 right now.  Also, as we can see in the chart below, this is below the highs for this stock in particular over the past few years.       If anything, AGCO is in the lower end of its range in the time period from a P/S metric, suggesting some level of undervalued trading-at least compared to historical norms.   Broad Value Outlook  In aggregate, AGCO Corporation currently has a Zacks Value Score of A, putting it into the top 20% of all stocks we cover from this look. This makes AGCO Corporation a solid choice for value investors, and some of its other key metrics make this pretty clear too.    For example, the PEG ratio for AGCO Corporation is just 1.08, a level that is far lower than the industry average of 2.03. The PEG ratio is a modified PE ratio that takes into account the stock's earnings growth rate. Additionally, its P/CF ratio comes in at 9.62, which is lower than the industry average of 9.91. Clearly, AGCO is a solid choice on the value front from multiple angles.    What About the Stock Overall?    Though AGCO Corporation might be a good choice for value investors, there are plenty of other factors to consider before investing in this name. In particular, it is worth noting that the company has a Growth Score of A and a Momentum Score of A. This gives AGCO a Zacks VGM score - or its overarching fundamental grade - of A. (You can read more about the Zacks Style Scores here >> )   Meanwhile, the company's recen t earnings  estimates have been encouraging. The current year has seen seven estimates go higher in the past sixty days compared to one lower while the full year 2020 estimate has seen seven upward revision compared to one downward in the same time period.     This has had a positive impact on the consensus estimate though as the current year consensus estimate has increased by 3.7% in the past two months, while the full year 2020 estimate has improved by 1.7%. You can see the consensus estimate trend and recent price action for the stock in the chart below:   AGCO Corporation Price and Consensus          AGCO Corporation price-consensus-chart    |   AGCO Corporation Quote   This bullish trend is why the stock boasts a Zacks Rank #2 (Buy) and why we are expecting outperformance from the company in the near term.  Bottom Line   AGCO Corporation is an inspired choice for value investors, as it is hard to beat its incredible line up of statistics on this front. A strong industry rank (among top 40% of more than 250 industries) and a Zacks Rank #2 further instils our confidence.  In fact, over the past two years, the Zacks Manufacturing - Farm Equipment industry has clearly outperformed the market at large, as you can see below:      So, it might pay for value investors to delve deeper into the company's prospects, as fundamentals indicate that this stock could be a compelling pick.  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.  makeArticleAd();  Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   AGCO Corporation (AGCO): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Value investing is easily one of the most popular ways to find great stocks in any market environment. After all, who wouldn't want to find stocks that are either flying under the radar and are compelling buys, or offer up tantalizing discounts when compared to fair value?",
    "One way to find these companies is by looking at several key metrics and financial ratios, many of which are crucial in the value stock selection process. Let's put AGCO Corporation AGCO   stock into this equation and find out if it is a good choice for value-oriented investors right now, or if investors subscribing to this methodology should look elsewhere for top picks:",
    " PE Ratio ",
    "A key metric that value investors always look at is the Price to Earnings Ratio, or PE for short. This shows us how much investors are willing to pay for each dollar o f earnings  in a given stock, and is easily one of the most popular financial ratios in the world. The best use of the PE ratio is to compare the stock's current PE ratio with: a) where this ratio has been in the past; b) how it compares to the average for the industry/sector; and c) how it compares to the market as a whole.",
    "On this front, AGCO Corporation has a trailing twelve months PE ratio of 15.43, as you can see in the chart below:",
    "This level actually compares pretty favorably with the market at large, as the PE for the S&P 500 stands at about 18.36. If we focus on the long-term PE trend, AGCO Corporation's current PE level puts it below its midpoint over the past five years.",
    "Further, the stock's PE compares favorably with the Zacks Industrial Products sector's trailing twelve months PE ratio, which stands at 16.26. At the very least, this indicates that the stock is relatively undervalued right now, compared to its peers. ",
    "We should also point out that AGCO Corporation has a forward PE ratio (price relative to this year's earnings) of just 14.46, so it is fair to say that a slightly more value-oriented path may be ahead for AGCO Corporation stock in the near term too.  ",
    " P/S Ratio ",
    "Another key metric to note is the Price/Sales ratio. This approach compares a given stock's price to its total sales, where a lower reading is generally considered better. Some people like this metric more than other value-focused ones because it looks at sales, something that is far harder to manipulate with accounting tricks than earnings. ",
    "Right now, AGCO Corporation has a P/S ratio of about 0.63. This is lower than the S&P 500 average, which comes in at 3.23 right now.  Also, as we can see in the chart below, this is below the highs for this stock in particular over the past few years. ",
    "If anything, AGCO is in the lower end of its range in the time period from a P/S metric, suggesting some level of undervalued trading-at least compared to historical norms. ",
    " Broad Value Outlook ",
    "In aggregate, AGCO Corporation currently has a Zacks Value Score of A, putting it into the top 20% of all stocks we cover from this look. This makes AGCO Corporation a solid choice for value investors, and some of its other key metrics make this pretty clear too.   ",
    "For example, the PEG ratio for AGCO Corporation is just 1.08, a level that is far lower than the industry average of 2.03. The PEG ratio is a modified PE ratio that takes into account the stock's earnings growth rate. Additionally, its P/CF ratio comes in at 9.62, which is lower than the industry average of 9.91. Clearly, AGCO is a solid choice on the value front from multiple angles.  ",
    " What About the Stock Overall?   ",
    "Though AGCO Corporation might be a good choice for value investors, there are plenty of other factors to consider before investing in this name. In particular, it is worth noting that the company has a Growth Score of A and a Momentum Score of A. This gives AGCO a Zacks VGM score - or its overarching fundamental grade - of A. (You can read more about the Zacks Style Scores here >> )  ",
    "Meanwhile, the company's recen t earnings  estimates have been encouraging. The current year has seen seven estimates go higher in the past sixty days compared to one lower while the full year 2020 estimate has seen seven upward revision compared to one downward in the same time period.    ",
    "This has had a positive impact on the consensus estimate though as the current year consensus estimate has increased by 3.7% in the past two months, while the full year 2020 estimate has improved by 1.7%. You can see the consensus estimate trend and recent price action for the stock in the chart below:",
    "  AGCO Corporation Price and Consensus          AGCO Corporation price-consensus-chart    |   AGCO Corporation Quote  ",
    " AGCO Corporation Price and Consensus ",
    " AGCO Corporation price-consensus-chart    |   AGCO Corporation Quote ",
    "This bullish trend is why the stock boasts a Zacks Rank #2 (Buy) and why we are expecting outperformance from the company in the near term.",
    " Bottom Line  ",
    "AGCO Corporation is an inspired choice for value investors, as it is hard to beat its incredible line up of statistics on this front. A strong industry rank (among top 40% of more than 250 industries) and a Zacks Rank #2 further instils our confidence.  In fact, over the past two years, the Zacks Manufacturing - Farm Equipment industry has clearly outperformed the market at large, as you can see below:",
    "So, it might pay for value investors to delve deeper into the company's prospects, as fundamentals indicate that this stock could be a compelling pick.",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.  makeArticleAd();  Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:30:00"
}