{
  "url": "https://www.nasdaq.com/article/apple-stock-still-is-a-buy-as-the-trade-war-escalates-cm1207260",
  "title": "Apple Stock Still Is a Buy as the Trade War Escalates - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Investors should consider Apple (NASAQ: AAPL ) as the bellwether on profit pressures corporate firms face from the U.S. and China trade war. Apple stock is predictably sensitive to these moves.",
    "The smartphone giant likely relies on so many China-based suppliers that tariffs will either cut into profit margins or lead to an increase in product prices.",
    "Before this macro headwind, Apple enjoyed healthy profit margins for its iPhones. Strong Apple Watch sales also offset the light demand for iPhones and Macbook computers. But if tariffs increase Watch costs by at least 15%, profits may weaken. How badly might Apple stock fall as trade tensions worsen?",
    "On Aug. 23, markets took AAPL stock down by 4.6% when China announced retaliatory tariffs on $75 billion of U.S. goods. One analyst called the move a \" gut punch to Copertino \" and correctly so.",
    "Apple sales in China account for 18.3% of its revenue, compared to 36.9% in the U.S. But tariffs will hurt Apple two ways.",
    "First, the U.S. tariffs on China imports will hurt the Chinese economy and the Chinese buying power. Consumers will cut spending and opt for cheaper China-branded Androids instead of expensive Apple products. Second, the U.S. consumer may absorb the cost of tariffs. Higher Apple product pricing might hurt demand in the U.S.",
    "By the end of August, Apple stock rebounded and is within 10% of its yearly highs. Similarly, Qorvo (NASDAQ: QRVO ) rebounded but Skyworks (NASDAQ: SWKS ) is still in a downtrend on the markets.",
    "Investors are probably speculating that the trade dispute is temporary and that higher operating costs will not reach Apple consumers. This view may prove too optimistic. The U.S. is taking a hard stand against China, claiming security concerns and demanding better trade terms that will bring America back to greatness.",
    "Conversely, the President may need to resolve the trade war before the election year. Otherwise, it may risk a loss on re-election as the country enters a recession.",
    "Even if Apple stock takes a hit on a macro environment that it cannot control, the company is relying less on iPhone sales. In the third quarter, the company reported a 50% sales growth for wearables. Wearables and services are now the size of a Fortune 50 company .",
    "Services revenue added $11.5 billion to the total, up 13% year-over-year and a record for the company. Apple attributes this performance from the strong growth from the App Store in China. Also, AppleCare, music, cloud services, and its app store ad business all added to the growth in the Services unit. Apple ended Q3 with 420 million paid subscriptions across its platform.",
    "May's launch of the new Apple TV app in over 100 countries should enable the company to grow the services unit. Success will come from integrating content from over 150 leading content providers. And typical of Apple is the ease-of-use, which will keep users engaged in the TV app.",
    "For Sept. 10, Apple set a product launch event that includes new iPhones. Dubbed iPhone Pro, the refresh will have better displays, screen size, wireless charging, and a triple-lens at the rear. It might also finalize the details of Apple TV+, a streaming TV service.",
    "Netflix (NASDAQ: NFLX ) already dominates the streaming segment but faces many new competitors. Disney (NYSE: DIS ) will launch Disney+ for only $7.99 a month. The low prices will draw a surge in initial sign-ups. AT&T (NYSE: T ) will offer AT&T Now for $50 a month but includes over 45 channels.",
    "Analysts have an average price target of $227, ~9% above the recent closing price of $208.74. Investors who prefer to model their fair value may use a 5-year DCF EBITDA Exit model. Assuming revenue growth of 5% annually in this period, the fair value is also $227. Forecasting higher growth levels on finbox.io will, of course, result in a higher price target.",
    "Apple stock is holding up despite the trade war worries. If market panic sends the stock below $200, value investors may consider buying the stock on the dip.",
    "Disclosure: As of this writing, the author did not hold a position in any of the aforementioned securities.",
    "The post Apple Stock Still Is a Buy as the Trade War Escalates appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 06:40:24"
}