{
  "url": "https://www.nasdaq.com/article/3-reasons-now-is-the-time-to-be-bullish-on-amd-stock-cm1207375",
  "title": "3 Reasons Now Is the Time to Be Bullish on AMD Stock - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "For August, Advanced Micro Devices (NASDAQ: AMD ) posted a return of about 3%. But of course, this performance masks the extreme volatility. August was actually a period when the AMD stock price chart looked more like a roller coaster!",
    "But this should not be a surprise. There were wide swings in the overall market. There were also negative headlines from the U.S.-China trade war, which saw the hiking of tariffs from both sides. Keep in mind that AMD has major ties to China. So any whiff of problems usually means that investors get worried.",
    "But August's performance for Advanced Micro Devices stock does show that the company is still resilient. Actually, for the year so far, the shares are up a sizzling 70%!",
    "Then again, there are some important factors that should help keep up the momentum in the business and bolster AMD stock.",
    "So let's take a look:",
    "For a relatively small company - say compared to chip giants like Intel (NASDAQ: INTC ) and Broadcom (NASDAQ: AVGO )- AMD has been able to effectively leverage its resources.",
    "The result is that the company is targeting three mega-market opportunities. According to AMD's most recent investor presentation , they include PCs ($30 billion), immersive/gaming ($15 billion) and the datacenter ($29 billion).",
    "The good news is that the company is making significant headway in all of them. For example, in the gaming market, it is positioned nicely to benefit from the launch of new consoles from Microsoft (NASDAQ: MSFT ) and Sony (NYSE: SNE ).",
    "As for the data center, AMD has been snagging major customers win, such as with Twitter (NYSE: TWTR ) and Alphabet (NASDAQ: GOOGL , NASDAQ: GOOG ). Both companies have agreed to adopt the Epyc chips for their servers. Consider that this technology is based on a sophisticated 7nm process that has shown to have higher performance and better energy efficiency compared to Intel chips.",
    "According to InvestorPlace.com's Vince Martin : \"Still, from a very broad standpoint, the argument is simple: There's a lot of Intel market share that AMD can take. And that means there's a market opportunity worth multiples of the current AMD market capitalization.\"",
    "In 2014 when Lisa Su took the reigns as CEO of AMD, the company was in terrible shape. There was even buzz of a bankruptcy filing. But Su quickly struck a critical deal with China's Sugon Information Industry Co, which brought in an infusion of much-needed cash.",
    "She also outsourced production.  Then once AMD was on a stronger financial footing, Su began to ramp up R&D on building world-class technologies. Because of all this, she was able to pull off one of tech's best turnarounds.",
    "Yet there are some concerns about Su. In August rumors started to swirl that she may move over to IBM (NYSE: IBM ) to become an executive with the firm. If so, this would certainly be a big-time negative for AMD stock. Although, for now, Su has denied the rumors , tweeting: \"Just for the record, zero truth to this rumor. I love AMD and the best is yet to come!\"",
    "For decades AMD's reputation was as a follower in terms of new technologies. But this is no longer the case. Now AMD has been pushing the envelope on innovation. During the past quarter, the company launched high performance CPUs (central processing unit) and GPUs (graphics processing units).",
    "There was also the signing of a multi-year agreement with Samsung, which involved the licensing of graphics technologies for mobile applications and smartphones.",
    "AMD is also making headway in the category of supercomputers. Note that the company is working with Cray (NASDAQ: CRAY ), which is being merged with Hewlett Packard Enterprise (NYSE: HPE ), to create the world's fastest computer.",
    "It will use EPYC CPUs along with Radeon GPUs. Interestingly enough, this venture is likely to lead to advancements in AI (Artificial Intelligence).",
    "Tom Taulli is the author of the book,  Artificial Intelligence Basics: A Non-Technical Introduction . Follow him on Twitter at  @ttaulli . As of this writing, he did not hold a position in any of the aforementioned securities.",
    "The post 3 Reasons Now Is the Time to Be Bullish on AMD Stock appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 07:40:43"
}