{
  "url": "https://www.nasdaq.com/article/3-big-stock-charts-for-wednesday-microsoft-noble-energy-and-johnson-controls-cm1207067",
  "title": "3 Big Stock Charts for Wednesday: Microsoft, Noble Energy and Johnson Controls - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Even with the mid-day rebound, the market still started to the new week in the hole. The S&P 500 index fell 0.69% on Tuesday, remaining below a couple of key resistance levels while finding support at the 20-day moving average line.",
    "Boeing (NYSE :BA ) was a key part of the reason the broad market struggled. Though it appears the company's 737 MAX may be cleared for flight within the next few weeks, several airlines have made schedules through beginning of December that don't include plans to utilize the currently grounded aircraft . The news sent BA stock lower to the tune of 2.7%.",
    "Though not terribly important for the overall market's performance, ride-hailing stocks Uber Technologies (NYSE: UBER ) and Lyft (NASDAQ: LYFT ) fell 6% and 7%, respectively, on growing concern that California is going to force both companies to reclassify their contracted drivers as employees . The move could upset the organizations' business models in a big way.",
    "To be sure, not every name lost ground. Shares of retailer Conn's (NASDAQ: CONN ) jumped more than 18% after revealing better-than-expected second quarter numbers . Although same-store sales were only up 0.4%, total revenue improved 3.3%, leading to healthy profit margins.",
    "As for names worth a closer look moving into Wednesday's action, though, it's the stock charts of Johnson Controls (NYSE: JCI ), Microsoft (NASDAQ: MSFT ) and Noble Energy (NYSE: NBL ) that are of the most interest. Here's why.",
    "With nothing more than a quick glance at its chart, Johnson Controls shares appear to still be moving higher in a respectable - even if imperfect - uptrend. And, perhaps it is.",
    "A closer look at both the weekly as well as the daily stock charts, however, also drops hints that the rally could be slowing down, and is maybe even close to rolling over. JCI stock re-broke a recent support level on Tuesday, and is close to putting pressure on another one again after a couple of other red flags have started to wave.",
    "A reliable winner for long-term investors, Microsoft is a bargain on any healthy dip. But, a dip appears to be in the works. Underscoring that prospect is the shape of the chart's long-term rally, and a new shape it's taken on just since the beginning of August. The backdrop is acting as a red flag as well. The bears just need to dish out one more good blow before any selloff becomes self-sustaining.",
    "All energy stocks are tricky - and dangerous - prospects right now. Crude oil prices were hit rather hard on Tuesday, as traders continue to figure out the balance between the United States' newly opened oil spigots, the impact of political turbulence in the Middle East, and whether or not a recession is looming.",
    "Nevertheless, Noble Energy shares are slowly but surely piecing together what appears to be a rebound effort after a rough 2018, and a volatile 2019. With or without the broader market's help, NBL stock is one or two good days away from a breakout that's been taking shape for nearly three months.",
    "As of this writing, James Brumley held no position in any of the aforementioned securities. You can learn more about James at his site, jamesbrumley.com , or follow him on Twitter , at @jbrumley.",
    "The post 3 Big Stock Charts for Wednesday: Microsoft, Noble Energy and Johnson Controls appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:01:19"
}