{
  "url": "https://www.nasdaq.com/article/zackscom-featured-highlights-include-boot-barn-kirkland-ally-alibaba-and-zumiez-cm1210461",
  "title": "Zacks.com featured highlights include: Boot Barn, Kirkland, Ally, Alibaba and Zumiez - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL - September 11, 2019 - Stocks in this week's article are Boot Barn Holdings, Inc. BOOT  , Kirkland Lake Gold Ltd. KL  , Ally Financial Inc. ALLY  , Alibaba Group Holding Ltd. BABA  and Zumiez Inc  . ZUMZ  .   Valuable Low Price-to-Sales Picks for a Rewarding     Portfolio   When considering valuation metrics, price-to-earnings ratio has always been the obvious choice. This is because calculations based on earnings are easy and come in handy. However, price-to-sales has emerged as a convenient tool to determine the value of stocks that are incurring losses or are in an early cycle of development, generating meager or no profits. While a loss-making company with a negative price-to-earnings ratio falls out of investor favor, its price-to-sales could indicate the hidden strength of its business. This underrated ratio is also used to identify a recovery situation or ensure that a company's growth is not overvalued. A stock's price-to-sales ratio reflects how much investors are paying for each dollar of revenues generated by the company. If the price-to-sales ratio is 1, it means that investors are paying $1 for every $1 of revenues generated by the company. So, it goes without saying that a stock with a price-to-sales below 1 is a good bargain, as investors need to pay less than a dollar for a dollar's worth.   Thus, a stock with a lower price-to-sales ratio is a more suitable investment than a stock with a high price-to-sales ratio. Price-to-sales is often preferred over price-to-earnings as companies can manipulate their earnings using various accounting measures. However, sales are harder to manipulate and are relatively reliable. However, one should keep in mind that a company with high debt and low price-to-sales is not an ideal choice. The high debt level will have to be paid off at some point, leading to further share issuance, rise in market cap and ultimately a higher price-to-sales ratio. In any case, the price-to-sales ratio used in isolation cannot do the trick. One should also analyze other ratios like Price/Earnings, Price/Book and Debt/Equity before arriving at any investment decision.  For the rest of this Screen of the Week article please   visit Zacks.com at:    https://www.zacks.com/stock/news/510976/bet-on-these-5-momentum-stocks-with-driehaus-strategy   Disclosure: Officers, directors and/or employees of Zacks   Investment Research may own or have sold short securities and/or   hold long and/or short positions in options that are mentioned in   this material. An affiliated investment advisory firm may own or   have sold short securities and/or hold long and/or short   positions in options that are mentioned in this material.   About Screen of the Week  Zacks.com created the first and best screening system on the web earning the distinction as the \"#1 site for screening stocks\" by Money Magazine.  But powerful screening tools is just the start. That is why Zacks created the Screen of the Week to highlight profitable stock picking strategies that investors can actively use.  Strong Stocks that Should Be in the News  Many are little publicized and fly under the Wall Street radar. They're virtually unknown to the general public. Yet today's 220 Zacks Rank #1 \"Strong Buys\" were generated by the stock-picking system that has more than doubled the market from 1988 through 2016. Its average gain has been a stellar +25% per year. See these high-potential stocks free >>.  Follow us on Twitter:   http://twitter.com/zacksresearch  Join us on Facebook:  http://www.facebook.com/ZacksInvestmentResearch  Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates. Contact: Jim Giaquinto Company: Zacks.com Phone: 312-265-9268 Email: pr@zacks.com  Visit: www.Zacks.com  Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer  . Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Alibaba Group Holding Limited (BABA): Free Stock Analysis Report   Ally Financial Inc. (ALLY): Free Stock Analysis Report   Zumiez Inc. (ZUMZ): Free Stock Analysis Report   Boot Barn Holdings, Inc. (BOOT): Free Stock Analysis Report   Kirkland Lake Gold Ltd. (KL): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL - September 11, 2019 - Stocks in this week's article are Boot Barn Holdings, Inc. BOOT  , Kirkland Lake Gold Ltd. KL  , Ally Financial Inc. ALLY  , Alibaba Group Holding Ltd. BABA  and Zumiez Inc  . ZUMZ  .",
    "  Valuable Low Price-to-Sales Picks for a Rewarding     Portfolio  ",
    "When considering valuation metrics, price-to-earnings ratio has always been the obvious choice. This is because calculations based on earnings are easy and come in handy. However, price-to-sales has emerged as a convenient tool to determine the value of stocks that are incurring losses or are in an early cycle of development, generating meager or no profits.",
    "While a loss-making company with a negative price-to-earnings ratio falls out of investor favor, its price-to-sales could indicate the hidden strength of its business. This underrated ratio is also used to identify a recovery situation or ensure that a company's growth is not overvalued.",
    "A stock's price-to-sales ratio reflects how much investors are paying for each dollar of revenues generated by the company.",
    "If the price-to-sales ratio is 1, it means that investors are paying $1 for every $1 of revenues generated by the company. So, it goes without saying that a stock with a price-to-sales below 1 is a good bargain, as investors need to pay less than a dollar for a dollar's worth.  ",
    "Thus, a stock with a lower price-to-sales ratio is a more suitable investment than a stock with a high price-to-sales ratio.",
    "Price-to-sales is often preferred over price-to-earnings as companies can manipulate their earnings using various accounting measures. However, sales are harder to manipulate and are relatively reliable.",
    "However, one should keep in mind that a company with high debt and low price-to-sales is not an ideal choice. The high debt level will have to be paid off at some point, leading to further share issuance, rise in market cap and ultimately a higher price-to-sales ratio.",
    "In any case, the price-to-sales ratio used in isolation cannot do the trick. One should also analyze other ratios like Price/Earnings, Price/Book and Debt/Equity before arriving at any investment decision.",
    " For the rest of this Screen of the Week article please   visit Zacks.com at:    https://www.zacks.com/stock/news/510976/bet-on-these-5-momentum-stocks-with-driehaus-strategy ",
    " Disclosure: Officers, directors and/or employees of Zacks   Investment Research may own or have sold short securities and/or   hold long and/or short positions in options that are mentioned in   this material. An affiliated investment advisory firm may own or   have sold short securities and/or hold long and/or short   positions in options that are mentioned in this material. ",
    " About Screen of the Week ",
    "Zacks.com created the first and best screening system on the web earning the distinction as the \"#1 site for screening stocks\" by Money Magazine.  But powerful screening tools is just the start. That is why Zacks created the Screen of the Week to highlight profitable stock picking strategies that investors can actively use.",
    " Strong Stocks that Should Be in the News ",
    "Many are little publicized and fly under the Wall Street radar. They're virtually unknown to the general public. Yet today's 220 Zacks Rank #1 \"Strong Buys\" were generated by the stock-picking system that has more than doubled the market from 1988 through 2016. Its average gain has been a stellar +25% per year. See these high-potential stocks free >>. ",
    "Follow us on Twitter:   http://twitter.com/zacksresearch ",
    "Join us on Facebook:  http://www.facebook.com/ZacksInvestmentResearch ",
    "Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.",
    "Contact: Jim Giaquinto",
    "Company: Zacks.com",
    "Phone: 312-265-9268",
    "Email: pr@zacks.com ",
    "Visit: www.Zacks.com ",
    "Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer  .",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:24:00"
}