{
  "url": "https://www.nasdaq.com/article/gold-recovers-on-shortcovering-ahead-of-ecb-20190912-00123",
  "title": "Gold recovers on short-covering ahead of ECB - Nasdaq.com",
  "text": [
    "By Karthika Suresh Namboothiri",
    "Sept 12 (Reuters) - Gold erased earlier losses on Thursday as investors covered short positions ahead of a European Central Bank meeting, but improved risk appetite on hopes of a thaw in U.S.-China trade tensions limited the bullion's advance.",
    "Spot gold  gained 0.4% to $1,503.00 per ounce at 0807 GMT. U.S. gold futures  rose 0.5% to $1,510.80 .",
    "\"So long as it is trading above $1,490, I do not consider it bearish.\"",
    "Consumer price index (CPI) from the United States for August is expected to accelerate by merely 0.1%, compared to 0.3% in July, according to a Reuters poll, amid expectations the Federal Reserve will cut interest rates at its meeting next week.",
    "Also expected to hint at monetary policy easing was the ECB, closely watched for measures the bank was willing to take to support a dampened economy in the depth of Brexit concerns.",
    "The ECB is set to announce its rate decision at 1145 GMT on Thursday, followed by ECB President Mario Draghi's news conference at 1230 GMT.",
    "Meanwhile, the United States on Wednesday agreed to delay increasing tariffs on $250 billion worth of Chinese imports to Oct. 15 from Oct. 1 \"as a gesture of good will\". ",
    "Hopes of a breakthrough in negotiations between the world's two biggest economies lifted risk sentiment in early trade, with MSCI's broadest index of Asia-Pacific shares outside Japan  jumping to a six-week high. MKTS/GLOB",
    "Gold prices have dropped about 4% from a more than six-year high of $1,557 it hit on Sept. 4 as renewed risk appetite and improved global economic data dampened demand for the safe-haven metal. Gold is highly sensitive to rising interest rates, which lift the opportunity cost of holding non-yielding bullion.",
    "Signals are mixed for spot gold, as it is stuck in a neutral range of $1,480-$1,497 per ounce, said Reuters technical analyst Wang Tao. ",
    "Among other precious metals, silver  inched 0.6% higher to $18.19 per ounce, while platinum  rose 0.7% to $950.60. Meanwhile, palladium  gained 1.4% to $1,593.31 an ounce.",
    "Palladium was on track for a fourth straight session of gains, and hit a two-month peak of $1594.61 an ounce."
  ],
  "published_datetime": "2019-09-12 12:03:00"
}