{
  "url": "https://www.nasdaq.com/article/audusd-nzdusd-usdcny-asian-session-daily-forecast-cm1210066",
  "title": "AUD/USD, NZD/USD, USD/CNY – Asian Session Daily Forecast - Nasdaq.com",
  "text": [
    "AUD/USD continues to show limited movement this week. In Wednesday's Asian session, as the pair is trading at 0.6876, up 0.27% on the day. Earlier in the day, AUD/USD touched a high of 0.6884, its highest level since July 31.",
    "The focus remains on Australian confidence reports. Westpac Consumer Confidence fell by 1.7%, its second decline in three months.  This soft reading comes on the heels of NAB Business Confidence, which fell to 1 in August, down sharply from 4 a month earlier. This indicates a worrisome deterioration in business conditions and consumer confidence. If upcoming consumer spending indicators also point downwards, investor risk appetite could sour and send the Aussie to lower ground.",
    "AUD/USD continues to exhibit range trading this week, as the pair appears comfortable in the mid-68 territory. Still, an upward breakout is certainly possible, as the pair has broken above resistance at 0.6865. There is some upward room for the pair, with no major resistance until 0.6988. On the downside, 0.6805 has been providing support since last week. This is followed by 0.6686, which is a major support level.",
    "China showed a contraction in the August Producer Price Index (PPI), due to the ongoing trade battle with the United States. Investor focus now shifts to the U.S. which will release August PPI reports on Wednesday. The markets are predicting mixed results - PPI is expected to slow to 0.0%, down from 0.2% a month earlier. However, Core PPI is projected to improve to 0.2%, after a decline of 0.1% in July. If the inflation readings miss the forecasts, the pair could show stronger downward movement. On Thursday, the U.S. releases the Consumer Price Index ( CPI ), which traders should treat as a market-mover.",
    "The Chinese yuan continues to exhibit range trade, and is flat in Wednesday's Asian session. Currently, USD/CNY is trading at 7.1104. On the upside, there is resistance at 7.1702, which was an active line last week. There is immediate support at 7.1100. The pair tested this line earlier in the Asian session, and if this support level breaks, I expect some further downward movement from the pair. On the upside, there is strong resistance at 7.1700.",
    "The NZD/USD has been flat all week, as the pair seems quite comfortable trading between 0.6400 - 0.6450.  With no major New Zealand events for the remainder of the week, the focus will shift to U.S. economic reports. On Wednesday, the Producer Price Index (PPI) is expected to slow to 0.0%, down from 0.2% a month earlier. However, Core PPI is projected to improve to 0.2%, after a decline of 0.1% in July. If investors like what they see in the releases, risk appetite could improve and push the kiwi higher.",
    "NZD/USD was marked by some upward trends in early September, but the pair has leveled off this week. In Wednesday's Asian session, NZD/USD is trading at 0.6429, up 0.25%.",
    "On the downside, there is support at 0.6425, which was tested in the Asian session and remains under strong pressure. This line could break during the day which would leave room for the dollar to push lower into 63-territory. The next major support line is at 0.6250. On the upside, the round 0.6500 is the next resistance line.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:14:02"
}