{
  "url": "https://www.nasdaq.com/article/palestinian-women-demand-legal-protection-after-suspected-honour-killing-20190904-00865",
  "title": "Palestinian women demand legal protection after suspected \"honour killing\" - Nasdaq.com",
  "text": [
    "By Ali Sawafta",
    "RAMALLAH, West Bank, Sept 4 (Reuters) - Hundreds of Palestinians demonstrated in the West Bank on Wednesday to demand legal protection for women after a 21-year-old woman died last month in what rights groups say was a so-called honour killing.",
    "A Palestinian Authority investigation is underway into the death of Isra'a Ghrayeb, a make-up artist who activists say was beaten by male relatives after a video posted on Instagram allegedly showed a meeting between her and a man who had proposed to her.",
    "At least 18 Palestinian women have been killed this year by family members angered at perceived damage to their honour, which may involve fraternising with men or any infringement of conservative values regarding women, according to the General Union of Palestinian Women and Feminist Institutions.",
    "Ghrayeb's family has denied the accusations. They said in a statement that Ghrayeb had a \"mental condition\" and died \"after she had a heart attack, following an accidental fall into the (family's) courtyard\".",
    "The circumstances surrounding Ghrayeb's death have stirred outrage within the Palestinian territories and on social media, with rights activists demanding action against the alleged perpetrators and legal protection for women under the hashtag #JustceforIsraa.",
    "In the West Bank city of Ramallah, female demonstrators held signs reading: \"We are all Isra'a\" and \"My body is my property. I don't need your supervision, your care, your honour\".",
    "\"I'm here to say enough is enough. We've lost enough women. Enough victims have died, have been killed, have been tortured, raped, harassed, and still there's no justice,\" said Amal Khayat, 30, an activist from Jerusalem.",
    "Prime Minister Mohammad Shtayyeh said this week that several people had been detained for questioning over Ghrayeb's death as part of the inquiry by the Palestinian Authority (PA), which exercises limited self-rule in the Israel-occupied West Bank.",
    "The Palestinian penal code dates to the 1960s and has been criticised for inadequate protection for women and lenient penalties for men who kill them in honour crimes.",
    "\"The case of Isra'a Ghrayeb shocked our conscience just like those before her. These are women and girls who dream to live in safety in a society free from violence and injustice,\" the General Union of Palestinian Women and Feminist Institutions said in a statement.",
    "The group called on the Palestinian government to \"develop targeted programs that teach the principle of gender equality\" and to reform laws to ensure accountability for perpetrators.",
    "Protesters voiced optimism that Wednesday's rally and others earlier this week would push the PA to make reforms. \"The victims are a part of us, they're a part of our history,\" Khayat said. \"We will continue (to protest) until we get justice.\""
  ],
  "published_datetime": "2019-09-04 12:17:00"
}