{
  "url": "https://www.nasdaq.com/article/oil-gas-stock-roundup-bp-out-of-alaska-equinor-speeds-up-oil-field-start-up-cm1206965",
  "title": "Oil & Gas Stock Roundup: BP Out of Alaska, Equinor Speeds Up Oil Field Start Up - Nasdaq.com",
  "text": [
    " It was a week where both oil and  natural gas prices  settled higher. On the news front, London-based oil major BP plc BP  farmed out of Alaska, selling its entire business to Hilcorp Energy for $5.6 billion, while Norway's Equinor EQNR  indicated an earlier-than-expected start-up of the giant Johan Sverdrup field. Overall, it was a good week for the sector. West Texas Intermediate (WTI) crude futures rose 1.7% to close at $55.10 per barrel, while natural gas prices moved up 6.2% for the week to finish at 2.285 per million Btu (MMBtu). (See the last 'Oil & Gas Stock Roundup' here:  TechnipFMC's Spin-Off, Kinder Morgan's Asset Sale & More  ) The U.S. crude benchmark notched a gain after U.S. government data showed a crude stockpile draw twice above expectations. The decline in oil inventories was the largest in the U.S. in five weeks, and came in tandem with a fall in gasoline and distillate supplies. Natural gas prices were up even as weekly inventory release showed a larger-than-expected increase in supplies. The commodity got a lift from possible production disruptions associated with Hurricane Dorian.   Recap of the Week's Most Important Stories  1.  BP announced that it has signed an accord with Hilcorp Energy Co. to divest all its assets in Alaska. The transaction has been valued at $5.6 billion. With the deal's closure by 2020, awaiting approvals from the state and federal bodies, BP will exit Alaskan operations after 60 long years. Precisely, the assets to be divested entails BP's entire upstream and midstream operations in Alaska. This includes the British energy giant's stake in the Prudhoe Bay - the largest oil field in North America - and the Trans-Alaska Pipeline System - spreading over 800 miles and transporting oil to the Port of Valdez. Investors should know that in the short term, BP will be getting $4 billion of the total transaction value. The company will receive the additional $1.6 billion once the buyer attains certain financial goals from this asset. Previously, Alaska was competing with some OPEC members, when the U.S. state pumped crude volumes at a rate of two million barrels every day. However, Alaska has lost its appeal and is presently the sixth largest oil-producing state in the United States. (Read more BP Signs $5.6B Agreement to Exit Alaska After 60 Long Years  ) 2.   Johan Sverdrup, the Norwegian oil field operated by Equinoris expected to come online ahead of its scheduled time. The field production start-up is likely to commence operations in October, a month earlier than planned. It is one of the largest discoveries on the Norwegian Continental Shelf (NCS) is estimated to have supplies attributed to 2.7 billion barrels of oil equivalent. The giant oil field's day-to-day production is likely to be 440,000 barrels of oil per day (bpd) whereas its peak output is projected to soar 660,000 bpd, accounting for 25% of Norway's total petroleum production. Per a trading source, the first shipment for Sverdrup oil filed will comprise 11 cargoes in the starting month, resulting in average shipping of 226,000 barrels per day. The giant oil field's day-to-day production is likely to be 440,000 barrels of oil per day (bpd) whereas its peak output is projected to soar 660,000 bpd, accounting for 25% of Norway's total petroleum production. Per a trading source, the first shipment for Sverdrup oil filed will comprise 11 cargoes in the starting month, resulting in average shipping of 226,000 barrels per day. (Read more Equinor to See Johan Sverdrup Oil Production Before Time  ) 3.    PDC Energy PDCE  is all set to acquire smaller rival SRC Energy SRCI  for about $1.7 billion. The headline price includes SRC Energy's estimated debt load worth $685 million. The all-stock transaction bid will be dealt at a fixed exchange ratio of 0.158 PDC Energy shares for each share of SRC Energy's stock. This represents a 4% discount to SRC Energy's closing share price on Aug 23, thus valuing the asset at $3.99 a share. Following the announcement of the deal, shares of PDC Energy and SRC Energy rallied 16.8% and 11.8%, respectively. After the culmination of the transaction later this year, current stockholders of PDC Energy will own 62% stake in the combined entity while the rest will be held by the SRC shareholders. PDC Energy will emerge as the second-largest oil producer in the Denver-Julesburg Basin behind Houston-based Occidental Petroleum at the top to go with its existing Permian acreage, if this deal gets through. The consolidated company is anticipated to incur G&A savings of $40 million in 2020 and $50 million in 2021. (Read more PDC Energy to Buy SRC Energy, Bolster Presence in DJ Basin  ) 4.   Eni S.p.A. E  recently announced a huge discovery of gas and condensate onshore Nigeria. The reserves are estimated to have around 1 trillion cubic feet (Tcf) of gas and 60 million barrels of associated condensate. The Zacks Rank #3 (Hold) company found the hydrocarbon deposit in Obiafu-Obrikom fields, which are located in Niger Delta's OML61. You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   . The discovery was made in the Obiafu-41 deep well that hit more than 130 meters of superior quality hydrocarbon-bearing sands of Oligocene age. Eni will conduct an appraisal campaign at the site to gauge further potential of the discovery. The company expects to bring the well online immediately, which can boost its gas production volumes. The well is estimated to deliver more than 100 million standard Cf of natural gas and 3,000 barrels of associated condensates per day. Notably, in 2018, Eni's equity gas output volumes in Nigeria amounted to 92 billion Cf, which constituted around 5% of the country's total production. The company, which has operations in the country since 1962, is expected to further increase its footprint therein with the latest discovery. With the growing popularity of cleaner energy sources around the globe, the natural gas discovery can be fruitful for the company. (Read more  Eni's 1 Tcf Gas Find in Nigeria to Come Online Immediately  ) 5.    Parsley Energy  PE   ) recently announced the initiation of a quarterly dividend. This shareholder-friendly move puts the stock on offer to dividend-seeking investors and is expected to boost the sentiments of existing stockholders. The company's board of directors has green signaled the clearance of a dividend of 3 cents per share on its Class A Common Stock. Headquartered in Austin, TX, this oil and gas E&P company's declaration of its first cash dividend reflects its willingness to return funds to its shareholders. The payout translates to 12 cents per share (or $34 million) on an annualized basis. However, its allocation is negligible from an yield standpoint at just 0.7%, lower than the industry average of 1.4%. The dividend is likely to be paid out on Sep 30 this year to stockholders of record as of Sep 20, 2019. The dividend announcement is supported by the company's target to generate significant free cash flow from its operations during the second half of 2019. Notably, Parsley Energy is focused on strengthening its balance sheet to gain financial flexibility.(Read more  Parsley Energy Rewards Investors With Dividend Initiation  )  Price Performance  The following table shows the price movement of some the major oil and gas players over the past week and during the last 6 months.  The Energy Select Sector SPDR - a popular way to track energy companies - was up 2.7% last week. The best performer was independent refining giant Marathon Petroleum MPC  whose stock rose 7.5%. Longer-term, over six months, the sector tracker is down 13.7%. Offshore driller Transocean Ltd. was the major loser during this period, experiencing a 47.4% price plunge.  What's Next in the Energy World?  As usual, market participants will be closely tracking the regular releases i.e. the U.S. government statistics on oil and natural gas - one of the few solid indicators that comes out regularly. Energy traders will also be focusing on the Baker Hughes data on rig count.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>      Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Marathon Petroleum Corporation (MPC): Free Stock Analysis Report   BP p.l.c. (BP): Free Stock Analysis Report   Eni SpA (E): Free Stock Analysis Report   Parsley Energy, Inc. (PE): Free Stock Analysis Report   PDC Energy, Inc. (PDCE): Free Stock Analysis Report   Statoil ASA (EQNR): Free Stock Analysis Report   Synergy Resources Corporation (SRCI): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "It was a week where both oil and  natural gas prices  settled higher.",
    "On the news front, London-based oil major BP plc BP  farmed out of Alaska, selling its entire business to Hilcorp Energy for $5.6 billion, while Norway's Equinor EQNR  indicated an earlier-than-expected start-up of the giant Johan Sverdrup field.",
    "Overall, it was a good week for the sector. West Texas Intermediate (WTI) crude futures rose 1.7% to close at $55.10 per barrel, while natural gas prices moved up 6.2% for the week to finish at 2.285 per million Btu (MMBtu). (See the last 'Oil & Gas Stock Roundup' here:  TechnipFMC's Spin-Off, Kinder Morgan's Asset Sale & More  )",
    "The U.S. crude benchmark notched a gain after U.S. government data showed a crude stockpile draw twice above expectations. The decline in oil inventories was the largest in the U.S. in five weeks, and came in tandem with a fall in gasoline and distillate supplies.",
    "Natural gas prices were up even as weekly inventory release showed a larger-than-expected increase in supplies. The commodity got a lift from possible production disruptions associated with Hurricane Dorian. ",
    " Recap of the Week's Most Important Stories ",
    "1.  BP announced that it has signed an accord with Hilcorp Energy Co. to divest all its assets in Alaska. The transaction has been valued at $5.6 billion. With the deal's closure by 2020, awaiting approvals from the state and federal bodies, BP will exit Alaskan operations after 60 long years.",
    "Precisely, the assets to be divested entails BP's entire upstream and midstream operations in Alaska. This includes the British energy giant's stake in the Prudhoe Bay - the largest oil field in North America - and the Trans-Alaska Pipeline System - spreading over 800 miles and transporting oil to the Port of Valdez.",
    "Investors should know that in the short term, BP will be getting $4 billion of the total transaction value. The company will receive the additional $1.6 billion once the buyer attains certain financial goals from this asset.",
    "Previously, Alaska was competing with some OPEC members, when the U.S. state pumped crude volumes at a rate of two million barrels every day. However, Alaska has lost its appeal and is presently the sixth largest oil-producing state in the United States. (Read more BP Signs $5.6B Agreement to Exit Alaska After 60 Long Years  )",
    "2.   Johan Sverdrup, the Norwegian oil field operated by Equinoris expected to come online ahead of its scheduled time. The field production start-up is likely to commence operations in October, a month earlier than planned. It is one of the largest discoveries on the Norwegian Continental Shelf (NCS) is estimated to have supplies attributed to 2.7 billion barrels of oil equivalent.",
    "The giant oil field's day-to-day production is likely to be 440,000 barrels of oil per day (bpd) whereas its peak output is projected to soar 660,000 bpd, accounting for 25% of Norway's total petroleum production. Per a trading source, the first shipment for Sverdrup oil filed will comprise 11 cargoes in the starting month, resulting in average shipping of 226,000 barrels per day.",
    "The giant oil field's day-to-day production is likely to be 440,000 barrels of oil per day (bpd) whereas its peak output is projected to soar 660,000 bpd, accounting for 25% of Norway's total petroleum production. Per a trading source, the first shipment for Sverdrup oil filed will comprise 11 cargoes in the starting month, resulting in average shipping of 226,000 barrels per day. (Read more Equinor to See Johan Sverdrup Oil Production Before Time  )",
    "3.    PDC Energy PDCE  is all set to acquire smaller rival SRC Energy SRCI  for about $1.7 billion. The headline price includes SRC Energy's estimated debt load worth $685 million.",
    "The all-stock transaction bid will be dealt at a fixed exchange ratio of 0.158 PDC Energy shares for each share of SRC Energy's stock. This represents a 4% discount to SRC Energy's closing share price on Aug 23, thus valuing the asset at $3.99 a share.",
    "Following the announcement of the deal, shares of PDC Energy and SRC Energy rallied 16.8% and 11.8%, respectively. After the culmination of the transaction later this year, current stockholders of PDC Energy will own 62% stake in the combined entity while the rest will be held by the SRC shareholders.",
    "PDC Energy will emerge as the second-largest oil producer in the Denver-Julesburg Basin behind Houston-based Occidental Petroleum at the top to go with its existing Permian acreage, if this deal gets through. The consolidated company is anticipated to incur G&A savings of $40 million in 2020 and $50 million in 2021. (Read more PDC Energy to Buy SRC Energy, Bolster Presence in DJ Basin  )",
    "4.   Eni S.p.A. E  recently announced a huge discovery of gas and condensate onshore Nigeria. The reserves are estimated to have around 1 trillion cubic feet (Tcf) of gas and 60 million barrels of associated condensate. The Zacks Rank #3 (Hold) company found the hydrocarbon deposit in Obiafu-Obrikom fields, which are located in Niger Delta's OML61.",
    "You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "The discovery was made in the Obiafu-41 deep well that hit more than 130 meters of superior quality hydrocarbon-bearing sands of Oligocene age. Eni will conduct an appraisal campaign at the site to gauge further potential of the discovery. The company expects to bring the well online immediately, which can boost its gas production volumes. The well is estimated to deliver more than 100 million standard Cf of natural gas and 3,000 barrels of associated condensates per day.",
    "Notably, in 2018, Eni's equity gas output volumes in Nigeria amounted to 92 billion Cf, which constituted around 5% of the country's total production. The company, which has operations in the country since 1962, is expected to further increase its footprint therein with the latest discovery. With the growing popularity of cleaner energy sources around the globe, the natural gas discovery can be fruitful for the company. (Read more  Eni's 1 Tcf Gas Find in Nigeria to Come Online Immediately  )",
    "5.    Parsley Energy  PE   ) recently announced the initiation of a quarterly dividend. This shareholder-friendly move puts the stock on offer to dividend-seeking investors and is expected to boost the sentiments of existing stockholders. The company's board of directors has green signaled the clearance of a dividend of 3 cents per share on its Class A Common Stock.",
    "Headquartered in Austin, TX, this oil and gas E&P company's declaration of its first cash dividend reflects its willingness to return funds to its shareholders. The payout translates to 12 cents per share (or $34 million) on an annualized basis. However, its allocation is negligible from an yield standpoint at just 0.7%, lower than the industry average of 1.4%. The dividend is likely to be paid out on Sep 30 this year to stockholders of record as of Sep 20, 2019.",
    "The dividend announcement is supported by the company's target to generate significant free cash flow from its operations during the second half of 2019. Notably, Parsley Energy is focused on strengthening its balance sheet to gain financial flexibility.(Read more  Parsley Energy Rewards Investors With Dividend Initiation  )",
    " Price Performance ",
    "The following table shows the price movement of some the major oil and gas players over the past week and during the last 6 months.",
    "The Energy Select Sector SPDR - a popular way to track energy companies - was up 2.7% last week. The best performer was independent refining giant Marathon Petroleum MPC  whose stock rose 7.5%.",
    "Longer-term, over six months, the sector tracker is down 13.7%. Offshore driller Transocean Ltd. was the major loser during this period, experiencing a 47.4% price plunge.",
    " What's Next in the Energy World? ",
    "As usual, market participants will be closely tracking the regular releases i.e. the U.S. government statistics on oil and natural gas - one of the few solid indicators that comes out regularly. Energy traders will also be focusing on the Baker Hughes data on rig count.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "   See these 5 \"sin stocks\" now >>   ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 17:26:00"
}