{
  "url": "https://www.nasdaq.com/article/tuesday-apple-rumors-geekbench-scores-for-iphone-11-leak-cm1206945",
  "title": "Tuesday Apple Rumors: Geekbench Scores for iPhone 11 Leak - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Leading the Apple  (NASDAQ: AAPL ) rumor mill today is news of how the iPhone 11 performs. Today, we'll look at that and other Apple Rumors for Tuesday.",
    "iPhone 11 Scores : A new Geekbench score may give us a look at the iPhone 11's specs , reports BGR . The scores on Geekbench appear to be for the successor to the iPhone XR. These scores have this new device getting 5415 in the single-core test and 11294 for the multi-core score. The device is also sporting a 6-core 2.66GHz A13 processor and has 4GB of RAM. With the newest line of iPhone devices likely coming out later this month, these scores could be legitimate.",
    "AR Glasses : Apple may still be working on its AR glasses , MacRumors notes. A recent look inside the code for iOS 13 shows several mentions to such a device. Among these is a \"STARTester\" app, which has the ability to switch to a head-mounted position. Other lines of code also make reference to what could be AR modes for other apps. Some rumors claim that AAPL is no longer working on AR glasses, but others say they may come out as early as 2020.",
    "Watch Patent : A new Apple Watch patent may give us a look at future bands , reports 9to5Mac . The patent describes a new type of Watch band that would be able to unlock the device for the person. It may be able to do this thanks to a sensor on the band that sits where the wrist goes. Think of it as a version of Touch ID for the wrist. Once in contact with the owner, it can unlock the device.",
    "The post Tuesday Apple Rumors: Geekbench Scores for iPhone 11 Leak appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:24:29"
}