{
  "url": "https://www.nasdaq.com/article/top-ranked-value-stocks-to-buy-for-september-4th-cm1207448",
  "title": "Top Ranked Value Stocks to Buy for September 4th - Nasdaq.com",
  "text": [
    "Here are four stocks with buy rank and strong value characteristics for investors to consider today, September 4th:",
    "Deluxe Corporation (DLX): This financial services company has a Zacks Rank #2 (Buy), and seen the Zacks Consensus Estimate for its current year earnings rising 4% over the last 60 days.",
    "Deluxe Corporation price-consensus-chart | Deluxe Corporation Quote",
    "Deluxe has a price-to-earnings ratio (P/E) of 6.90, compared with 11.00 for the industry. The company possesses a  Value Score  of A.",
    "Deluxe Corporation pe-ratio-ttm | Deluxe Corporation Quote",
    "Franklin Street Properties Corp. (FSP) : This real estate investment trust company has a Zacks Rank #2, and seen the Zacks Consensus Estimate for its current year earnings rising 2.4% over the last 60 days.",
    "Franklin Street Properties Corp. price-consensus-chart | Franklin Street Properties Corp. Quote",
    "Franklin Street Properties has a price-to-earnings ratio (P/E) of 8.88, compared with 16.80 for the industry. The company possesses a Value Score of B.",
    "Franklin Street Properties Corp. pe-ratio-ttm | Franklin Street Properties Corp. Quote",
    "JetBlue Airways Corporation (JBLU) : This airline has a Zacks Rank #2, and seen the Zacks Consensus Estimate for its current year earnings rising 5.7% over the last 60 days.",
    "JetBlue Airways Corporation price-consensus-chart | JetBlue Airways Corporation Quote",
    "JetBlue Airways has a price-to-earnings ratio (P/E) of 8.54, compared with 10.10 for the industry. The company possesses a Value Score of A.",
    "JetBlue Airways Corporation pe-ratio-ttm | JetBlue Airways Corporation Quote",
    "Ameriprise Financial, Inc. (AMP): This financial services company has a Zacks Rank #2, and seen the Zacks Consensus Estimate for its current year earnings rising 0.9% over the last 60 days.",
    "Ameriprise Financial, Inc. price-consensus-chart | Ameriprise Financial, Inc. Quote",
    "Ameriprise Financial has a price-to-earnings ratio (P/E) of 8.04 compared with 10.80 for the industry. The company possesses a Value Score of A.",
    "Ameriprise Financial, Inc. pe-ratio-ttm | Ameriprise Financial, Inc. Quote",
    "See the  full list of top ranked stocks here .",
    "Learn more about the  Value score and how it is calculated here .",
    "Biggest Tech Breakthrough in a Generation",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "See 7 breakthrough stocks now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:32:00"
}