{
  "url": "https://www.nasdaq.com/article/3m-mmm-gains-but-lags-market-what-you-should-know-cm1207608",
  "title": "3M (MMM) Gains But Lags Market: What You Should Know - Nasdaq.com",
  "text": [
    " 3M (MMM) closed the most recent trading day at $160.07, moving +0.9% from the previous trading session. This move lagged the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%. Prior to today's trading, shares of the maker of Post-it notes, industrial coatings and ceramics had lost 3.1% over the past month. This has was narrower than the Conglomerates sector's loss of 4.67% and lagged the S&P 500's loss of 0.68% in that time. Wall Street will be looking for positivity from MMM as it approaches its nex t earnings  report date. The company is expected to report EPS of $2.57, down 0.39% from the prior-year quarter. Our most recent consensus estimate is calling for quarterly revenue of $8.19 billion, up 0.5% from the year-ago period. For the full year, our Zacks Consensus Estimates are projecting earnings of $9.34 per share and revenue of $32.23 billion, which would represent changes of -10.71% and -1.64%, respectively, from the prior year. Any recent changes to analyst estimates for MMM should also be noted by investors. These revisions typically reflect the latest short-term business trends, which can change frequently. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system. Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.15% lower. MMM is currently a Zacks Rank #3 (Hold). Looking at its valuation, MMM is holding a Forward P/E ratio of 16.99. This represents a premium compared to its industry's average Forward P/E of 16.06. We can also see that MMM currently has a PEG ratio of 1.79. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Diversified Operations industry currently had an average PEG ratio of 1.8 as of yesterday's close. The Diversified Operations industry is part of the Conglomerates sector. This group has a Zacks Industry Rank of 46, putting it in the top 18% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  3M Company (MMM): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "3M (MMM) closed the most recent trading day at $160.07, moving +0.9% from the previous trading session. This move lagged the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%.",
    "Prior to today's trading, shares of the maker of Post-it notes, industrial coatings and ceramics had lost 3.1% over the past month. This has was narrower than the Conglomerates sector's loss of 4.67% and lagged the S&P 500's loss of 0.68% in that time.",
    "Wall Street will be looking for positivity from MMM as it approaches its nex t earnings  report date. The company is expected to report EPS of $2.57, down 0.39% from the prior-year quarter. Our most recent consensus estimate is calling for quarterly revenue of $8.19 billion, up 0.5% from the year-ago period.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of $9.34 per share and revenue of $32.23 billion, which would represent changes of -10.71% and -1.64%, respectively, from the prior year.",
    "Any recent changes to analyst estimates for MMM should also be noted by investors. These revisions typically reflect the latest short-term business trends, which can change frequently. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.",
    "Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.15% lower. MMM is currently a Zacks Rank #3 (Hold).",
    "Looking at its valuation, MMM is holding a Forward P/E ratio of 16.99. This represents a premium compared to its industry's average Forward P/E of 16.06.",
    "We can also see that MMM currently has a PEG ratio of 1.79. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Diversified Operations industry currently had an average PEG ratio of 1.8 as of yesterday's close.",
    "The Diversified Operations industry is part of the Conglomerates sector. This group has a Zacks Industry Rank of 46, putting it in the top 18% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:50:19"
}