{
  "url": "https://www.nasdaq.com/article/iata-chief-worried-about-global-regulators-discrepancy-over-boeing-737-max-20190903-01010",
  "title": "IATA chief 'worried' about global regulators' discrepancy over Boeing 737 MAX - Nasdaq.com",
  "text": [
    "By Tracy Rucinski",
    "CHICAGO, Sept 3 (Reuters) - The head of global airlines lobby IATA warned on Tuesday that a discrepancy among global regulators over reapproving Boeing Co's  737 MAX for commercial flight could set a worrying precedent for future aircraft programs.",
    "The MAX, Boeing's newest single-aisle aircraft, was grounded worldwide in March after two deadly crashes in Indonesia and Ethiopia within five months. Boeing is updating flight control software at the center of both crashes that must be approved by regulators before the planes can fly commercially again.",
    "But global regulators have indicated they would pursue their own analysis of the 737 MAX and Boeing's proposed updates, rather than simply following the FAA, which has suffered a dent to its credibility following the two crashes.",
    "\"With the 737 MAX we are a bit worried ... because we don't see the normal unanimity among international regulators that should be the case,\" Alexandre de Juniac, IATA director general, told reporters ahead of a summit in Chicago.",
    "\"We see a discrepancy that's detrimental to the industry.\"",
    "In an emailed statement, the FAA said it has a \"transparent and collaborative relationship\" with other civil aviation authorities as it continues its review of changes to software on the Boeing 737 MAX.",
    "\"Each government will make its own decision to return the aircraft to service based on a thorough safety assessment,\" the agency said.",
    "U.S. airlines are scheduling without the 737 MAX into December or early next year, taking a financial hit while the jets remain grounded. ",
    "Boeing is targeting regulatory approval for the fixes and new pilot training in October, though the FAA reiterated on Tuesday it does not have a firm timeline to put the jets back in the air.",
    "\"Our first priority is safety, and we have set no timeframe for when the work will be completed,\" it said. ",
    "The Montreal-based IATA has hosted two summits about the 737 MAX that have included the participation of international airlines, Boeing, the FAA and other regulators.",
    "If regulators do wish to change the single certification process, de Juniac urged them to it \"collectively.\""
  ],
  "published_datetime": "2019-09-03 14:59:00"
}