{
  "url": "https://www.nasdaq.com/article/forexdollar-yen-fall-as-global-tensions-ease-pound-rallies-20190904-01137",
  "title": "FOREX-Dollar, yen fall as global tensions ease, pound rallies - Nasdaq.com",
  "text": [
    "    * Hong Kong, Italy, Britain news helps risk appetite",
    "* Euro lifted away from 28-month lows, Lagarde comments help",
    "* Sterling jumps as UK lower house votes on Brexit, election",
    "By Gertrude Chavez-Dreyfuss",
    "NEW YORK, Sept 4 (Reuters) - The safe-haven dollar and yenfell on Wednesday after global political worries eased with whatmarkets perceived as positive news in Hong Kong, Italy andBritain.",
    "Sterling hit a one-week high against the dollar as investorsgrew more optimistic after British lawmakers took steps to blocka no-deal Brexit. urn:newsml:reuters.com:*:nL5N25V1FB",
    "Risk appetite rose on news that Hong Kong leader Carrie Lamwas withdrawing an extradition bill that triggered months ofoften violent protests. urn:newsml:reuters.com:*:nL3N25V0NC",
    "Edward Moya, senior market analyst at OANDA in New York,said the dollar's weakness was triggered by this \"risk-on movein Hong Kong that gave Hong Kong equities one of the best movesin a few years.\" That has boosted appetite for riskiercurrencies that have generally higher yields, he added.",
    "Moya said, \"This is providing a little bit of unwinding ofsome dollar bullish positions.\"",
    "In Italy, Prime Minister Giuseppe Conte unveiled a newcabinet that united the anti-establishment 5-Star Movement andthe centre-left Democratic Party, an unlikely coalition that isexpected to improve ties with the European Union. urn:newsml:reuters.com:*:nL5N25V42V",
    "The dollar ended down 0.6% against a basket of majorcurrencies, at 98.403 .DXY , marking its biggest one-day lossin three months.",
    "The yen fell against the dollar, which rose 0.42% to 106.41yenJPY=EBS . It also declined against the euro, which gained0.99% to 117.43 yenEURJPY=EBS .",
    "The euro also rose 0.57% versus the dollar to $1.1035EUR=EBS after the UK parliamentary votes and comments fromChristine Lagarde, who will likely be the European CentralBank's next president, introduced some doubt over the scale ofan ECB stimulus package expected next week.",
    "Lagarde said highly accommodative monetary policy for aprolonged period was necessary but she added that the bankneeded to be mindful of the negative side-effects of such tools. urn:newsml:reuters.com:*:nF9N23X016",
    "Expectations for an interest rate cut, the relaunch of assetpurchases and other ECB measures to stimulate the economy haveweighed on the euro. On Tuesday, it hit a 28-month low around$1.0924.",
    "Meanwhile, sterling jumped 1.37% to $1.2253GBP=D3 , andagainst the euro it rallied 0.85% to 90.03 penceEURGBP=D3 . Itproduced its biggest one-day gain against the dollar since March13, while it improved to its strongest level against the singlecurrency in over a month.    ",
    "The lower house of the British parliament voted on Wednesdayto prevent Prime Minister Boris Johnson taking Britain out ofthe EU without a deal. It also rejected Johnson's call for asnap election on Oct. 15, just weeks before Brexit, to free hishands. urn:newsml:reuters.com:*:nL5N25V2FD",
    "\"There is no way the UK leaves empty-handed. At this point,if there is enough popular pressure, there will be perhaps asecond referendum on the Brexit question,\" said Juan Perez,senior currency trader at Tempus Inc in Washington. (Reporting by Gertrude Chavez-Dreyfuss; Additional reporting byTommy Wilkes in London, Richard Leong in New YorkEditing by Sonya Hepinstall and Lisa Shumaker) ((gertrude.chavez@thomsonreuters.com; 646-223-6322; ReutersMessaging: rm://gertrude.chavez.reuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-04 05:41:00"
}