{
  "url": "https://www.nasdaq.com/article/fedex-q1-earnings-preview-can-fdx-stock-bounce-back-after-amazon-breakup-cm1210817",
  "title": "FedEx Q1 Earnings Preview: Can FDX Stock Bounce Back After Amazon Breakup? - Nasdaq.com",
  "text": [
    " Shares of FedEx FDX  have not only significantly lagged the market in 2019 but have also fallen well behind rival United Parcel Service UPS  . Wall Street and investors are also likely still trying to wrap their heads around why FedEx announced in August that it was essentially ending its relationship with Amazon AMZN  . Now let's see what to expect from the firm's upcoming first-quarter fiscal 2020 financial results, due out after the closing bell on Tuesday, September 17, to see if FDX stock might bounce back.  FedEx Overview  The global shipping giant shocked many last month when it said it would not renew its ground shipping contract with Amazon. FedEx no longer ships goods for the e-commerce powerhouse through the air or the ground, after it announced in June that it ended its air-shipping relationship with Amazon. Some might contend that FedEx pulled the cord too early. Yet clearly management didn't want to be in business with a company that has its sights set on taking over the global shipping and logistics market. FedEx is still massive and boasts a fleet of 681 planes that it either owns or leases, compared to United Parcel Service's 564 and Amazon's 60, according to the Wall Street journal-along with a massive ground fleet. The Memphis, Tennessee-based firm has also been able to do what Microsoft MSFT  has done with cloud computing: attract Amazon's direct rivals. FedEx hopes to become the home of Walmart WMT  , Target TGT  , and everyone else trying to fend off the Seattle giant's encroachment. The company also wants to improve its FedEx Express hub automation, modernize its FedEx Express air fleet, and much more going forward. With that said, investors have clearly not bought into much of anything FDX has done over the past several years, particularly in the last 12 months. Shares of FedEx have slipped 19% over the last two years and 31% in the trailing 52 weeks. What must be more frustrating for FedEx is the fact that its downturn has come amid climbing revenues. In fact, fiscal 2019 sales climbed 6.5%, with 2018 up 8.5% and 2017 up a whopping 20%.             Q1 2020 Outlook & Beyond  Looking ahead, our current Zacks Consensus Estimate calls for FDX's Q1 fiscal 2020 sales to climb just 0.50% to reach $17.14 billion. Meanwhile, full-year 2020 sales are projected to pop 2% to reach $71.08 billion. Peeking even further down the road, FedEx's 2021 revenue is expected to come in 4.4% higher than our current-year estimate to hit $74.22 billion. At the bottom end of the income statement, FedEx's 2020 outlook appears far worse. The company's first-quarter earnings are projected to fall 7.5% to hit $3.20 per share, with its full-year 2020 EPS figure projected to slip 5.3%. Luckily for investors, the shipping firm's 2021 earnings are expected to climb 10.5% above our 2020 estimate to easily top 2019.  Bottom Line  FedEx is currently a Zacks Rank #3 (Hold) that does hold a \"B\" grade for Value and an \"A\" for Growth in our Style Scores system. The firm also pays an annualized dividend of $2.60 per share at the moment, with a 1.51% yield. This looks solid compared to the 10-year U.S. Treasury note. But we should remember that this is somewhat artificially inflated based on its falling stock price. Beaten-down FedEx could bounce back on blowout quarterly results or upbeat guidance. But investors should likely hold off on scooping up any FDX shares until after Tuesday's release, unless they can deal with the risk of a possible sell-off.  Looking for Stocks with Skyrocketing Upside?  makeArticleAd();  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Amazon.com, Inc. (AMZN): Free Stock Analysis Report   Microsoft Corporation (MSFT): Free Stock Analysis Report   Walmart Inc. (WMT): Free Stock Analysis Report   Target Corporation (TGT): Free Stock Analysis Report   FedEx Corporation (FDX): Free Stock Analysis Report   United Parcel Service, Inc. (UPS): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Shares of FedEx FDX  have not only significantly lagged the market in 2019 but have also fallen well behind rival United Parcel Service UPS  . Wall Street and investors are also likely still trying to wrap their heads around why FedEx announced in August that it was essentially ending its relationship with Amazon AMZN  .",
    "Now let's see what to expect from the firm's upcoming first-quarter fiscal 2020 financial results, due out after the closing bell on Tuesday, September 17, to see if FDX stock might bounce back.",
    " FedEx Overview ",
    "The global shipping giant shocked many last month when it said it would not renew its ground shipping contract with Amazon. FedEx no longer ships goods for the e-commerce powerhouse through the air or the ground, after it announced in June that it ended its air-shipping relationship with Amazon. Some might contend that FedEx pulled the cord too early. Yet clearly management didn't want to be in business with a company that has its sights set on taking over the global shipping and logistics market.",
    "FedEx is still massive and boasts a fleet of 681 planes that it either owns or leases, compared to United Parcel Service's 564 and Amazon's 60, according to the Wall Street journal-along with a massive ground fleet. The Memphis, Tennessee-based firm has also been able to do what Microsoft MSFT  has done with cloud computing: attract Amazon's direct rivals.",
    "FedEx hopes to become the home of Walmart WMT  , Target TGT  , and everyone else trying to fend off the Seattle giant's encroachment. The company also wants to improve its FedEx Express hub automation, modernize its FedEx Express air fleet, and much more going forward.",
    "With that said, investors have clearly not bought into much of anything FDX has done over the past several years, particularly in the last 12 months. Shares of FedEx have slipped 19% over the last two years and 31% in the trailing 52 weeks. What must be more frustrating for FedEx is the fact that its downturn has come amid climbing revenues. In fact, fiscal 2019 sales climbed 6.5%, with 2018 up 8.5% and 2017 up a whopping 20%.",
    " Q1 2020 Outlook & Beyond ",
    "Looking ahead, our current Zacks Consensus Estimate calls for FDX's Q1 fiscal 2020 sales to climb just 0.50% to reach $17.14 billion. Meanwhile, full-year 2020 sales are projected to pop 2% to reach $71.08 billion. Peeking even further down the road, FedEx's 2021 revenue is expected to come in 4.4% higher than our current-year estimate to hit $74.22 billion.",
    "At the bottom end of the income statement, FedEx's 2020 outlook appears far worse. The company's first-quarter earnings are projected to fall 7.5% to hit $3.20 per share, with its full-year 2020 EPS figure projected to slip 5.3%. Luckily for investors, the shipping firm's 2021 earnings are expected to climb 10.5% above our 2020 estimate to easily top 2019.",
    " Bottom Line ",
    "FedEx is currently a Zacks Rank #3 (Hold) that does hold a \"B\" grade for Value and an \"A\" for Growth in our Style Scores system. The firm also pays an annualized dividend of $2.60 per share at the moment, with a 1.51% yield. This looks solid compared to the 10-year U.S. Treasury note. But we should remember that this is somewhat artificially inflated based on its falling stock price.",
    "Beaten-down FedEx could bounce back on blowout quarterly results or upbeat guidance. But investors should likely hold off on scooping up any FDX shares until after Tuesday's release, unless they can deal with the risk of a possible sell-off.",
    " Looking for Stocks with Skyrocketing Upside?  makeArticleAd();  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:40:00"
}