{
  "url": "https://www.nasdaq.com/article/the-odd-reason-the-stock-market-could-soar-to-new-highs-cm1210313",
  "title": "The Odd Reason the Stock Market Could Soar to New Highs - Nasdaq.com",
  "text": [
    " You could rightly say that this has been an \"interesting\" year   for investors. On the surface, you'd probably think that the broader market   would be struggling. There are concerns about an   escalating trade war with China    , the yield curve has inverted for the first time since 2007, and   just last week, the Institute for Supply Management's   manufacturing index fell to 49.1, signaling a contraction in   manufacturing activity for the first time in three years. Yet the broad-based   S&P 500    (SNPINDEX: ^GSPC) is having an incredibly strong year, with a   year-to-date gain of 18.8% through this past weekend. Despite the   at-times sensationalist headlines, the S&P 500 ended the week   a mere 47 points away from hitting an all-time closing high.makeArticleAd();   Image source: Getty Images.   The oddball reason the stock market should hit a new     high  Although much of the talk of late has been about the   recent yield curve inversion    and the   likelihood of a recession    over the next 12 to 18 months -- every recession over the past 50   years has been preceded by a yield-curve inversion, albeit not   every yield-curve inversion guarantees there will be a recession   -- I'm having different thoughts. I believe the stock market is   in prime position to thrive, if not soar to new highs, and it has   an odd reason to thank for its catalyst: fear. First off, you have to understand that the   stock market and the U.S. economy aren't tied at   the hip    . What's good for the economy isn't always good for stocks, and   vice versa. For example, on numerous occasions over the past year, we've   witnessed the market sell off on news of stronger-than-expected   jobs growth. The reason is that investors want the Federal   Reserve to continue lowering the federal funds rate, which it's   less likely to do if economic growth, including jobs growth,   remains robust. Thus, there's been this bifurcation between   economic news and stock market performance for some time now. This bifurcation is important to note, because it demonstrates   that consumer and investor fear isn't necessarily a precursor to   a poor-performing market.   Image source: Getty Images.   The bond market will play a key role in pushing     investors back into stocks  However, it's the bond market where fear will exert its   greatest influence and help to push stocks to new heights. With Wall Street clearly worried about trade-war escalation   between the two largest countries in the world by gross domestic   product (GDP), investors have been opting to buy U.S. Treasury   bonds as a safe-haven investment. The thing is, bond prices and   bond yields have an inverse relationship, meaning that as more   investor money flows into bonds, yields decline. Recently, the   10-year and 30-year Treasury notes hit respective three-year and   all-time lows of below 1.5% and 2%. Now,   here's where things get interesting    . Although U.S. bond yields are still light years higher than the   $17 trillion and counting in global government debt that's   currently sporting a negative yield (ahem, Japan and most of   Europe), most U.S. bonds are generating negative realized yields   once you factor in the inflation rate of 1.8% over the trailing   12-month period. Essentially, investors aren't making any real   money by diving into bonds as a safe-haven investment. In my opinion, this is likely to cause a knee-jerk effect that   shifts investments back out of bonds and into safe-haven stocks.   By \"safe-haven stocks,\" I'm talking about low-volatility,   generally moderate- to high-yielding time-tested businesses.   Right now, there are few means of generating inflation-topping   income beyond equities, which makes stocks a logical choice, by   default, to benefit. There's a pattern here: Fear induces a minor market sell-off,   investors flock to bonds, and yields plummet. Then, investors   scurry back to stocks, sending them to new highs. This could   occur in a rinse-and-repeat pattern for some time.   Image source: Getty Images.   We're already seeing evidence of this effect in     action  Believe it or not, I'd contend that we're already seeing   evidence of fear driving safe-haven stocks and the broader market   higher. Remember, most safe-haven stocks have established   business models and are large-cap or mega-cap stocks, thereby   giving them a lot of influence over the S&P 500. One perfect example would be telecom and streaming-content   giant   AT&T    (NYSE: T) . As a shareholder in AT&T, I can attest that its   operating results have been OK, but nothing special in 2019, with   wireless strength being offset by cord-cutting. Yet the   year-to-date return for AT&T is nearly 29%, not including   dividend income, through this past weekend. Among mega-cap   stocks,   few if any can beat AT&T's 5.7% dividend   yield    , which is more than triple the inflation rate in the United   States. With substantially lower volatility than the S&P 500   and guaranteed income -- AT&T is a   Dividend Aristocrat    that's raised its payout for 35 consecutive years -- it's been a   prime beneficiary of plunging bond yields. Another beneficiary of market fear has been beverage giant   Coca-Cola    (NYSE: KO) . After its stock did virtually nothing between 2013   and 2018 other than pay out a reasonably strong dividend, shares   of Coca-Cola are up by almost 17% in 2019, not including   dividends paid. Coca-Cola has benefited from exceptionally strong   organic sales growth,   driven mostly by improved consumer demand    , but is most coveted by investors for its branding power and   income potential. Coca-Cola's 2.9% yield is more than a full   percentage point higher than the trailing 12-month inflation   rate, and its beta of 0.31 shows that its stock is only about 31%   as volatile as the S&P 500. It's a perfect safe-haven income   stock. Then there's consumer-products company   Procter & Gamble    (NYSE: PG) , which has tacked on just shy of 34% this year, not   including dividends. Like Coca-Cola, this gain came after Procter   & Gamble's stock was virtually flat between 2013 and 2018.   However, plunging global bond yields have created quite the   demand for large-scale, brand-name businesses that pay a hearty   dividend. Procter & Gamble's yield of 2.4% may be lower than   Coca-Cola's or AT&T's, but it's increased its payout   for an impressive 63 straight years    . The idea might sound ridiculous, but fear could very well lead   the stock market to new highs.   10 stocks we like better than AT&T       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and AT&T wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Sean Williams      owns shares of AT&T. The Motley Fool is short shares of     Procter & Gamble. The Motley Fool has a     disclosure policy      .  ",
    "You could rightly say that this has been an \"interesting\" year   for investors.",
    "On the surface, you'd probably think that the broader market   would be struggling. There are concerns about an   escalating trade war with China    , the yield curve has inverted for the first time since 2007, and   just last week, the Institute for Supply Management's   manufacturing index fell to 49.1, signaling a contraction in   manufacturing activity for the first time in three years.",
    "Yet the broad-based   S&P 500    (SNPINDEX: ^GSPC) is having an incredibly strong year, with a   year-to-date gain of 18.8% through this past weekend. Despite the   at-times sensationalist headlines, the S&P 500 ended the week   a mere 47 points away from hitting an all-time closing high.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Although much of the talk of late has been about the   recent yield curve inversion    and the   likelihood of a recession    over the next 12 to 18 months -- every recession over the past 50   years has been preceded by a yield-curve inversion, albeit not   every yield-curve inversion guarantees there will be a recession   -- I'm having different thoughts. I believe the stock market is   in prime position to thrive, if not soar to new highs, and it has   an odd reason to thank for its catalyst: fear.",
    "First off, you have to understand that the   stock market and the U.S. economy aren't tied at   the hip    . What's good for the economy isn't always good for stocks, and   vice versa.",
    "For example, on numerous occasions over the past year, we've   witnessed the market sell off on news of stronger-than-expected   jobs growth. The reason is that investors want the Federal   Reserve to continue lowering the federal funds rate, which it's   less likely to do if economic growth, including jobs growth,   remains robust. Thus, there's been this bifurcation between   economic news and stock market performance for some time now.",
    "This bifurcation is important to note, because it demonstrates   that consumer and investor fear isn't necessarily a precursor to   a poor-performing market.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "However, it's the bond market where fear will exert its   greatest influence and help to push stocks to new heights.",
    "With Wall Street clearly worried about trade-war escalation   between the two largest countries in the world by gross domestic   product (GDP), investors have been opting to buy U.S. Treasury   bonds as a safe-haven investment. The thing is, bond prices and   bond yields have an inverse relationship, meaning that as more   investor money flows into bonds, yields decline. Recently, the   10-year and 30-year Treasury notes hit respective three-year and   all-time lows of below 1.5% and 2%.",
    "Now,   here's where things get interesting    . Although U.S. bond yields are still light years higher than the   $17 trillion and counting in global government debt that's   currently sporting a negative yield (ahem, Japan and most of   Europe), most U.S. bonds are generating negative realized yields   once you factor in the inflation rate of 1.8% over the trailing   12-month period. Essentially, investors aren't making any real   money by diving into bonds as a safe-haven investment.",
    "In my opinion, this is likely to cause a knee-jerk effect that   shifts investments back out of bonds and into safe-haven stocks.   By \"safe-haven stocks,\" I'm talking about low-volatility,   generally moderate- to high-yielding time-tested businesses.   Right now, there are few means of generating inflation-topping   income beyond equities, which makes stocks a logical choice, by   default, to benefit.",
    "There's a pattern here: Fear induces a minor market sell-off,   investors flock to bonds, and yields plummet. Then, investors   scurry back to stocks, sending them to new highs. This could   occur in a rinse-and-repeat pattern for some time.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Believe it or not, I'd contend that we're already seeing   evidence of fear driving safe-haven stocks and the broader market   higher. Remember, most safe-haven stocks have established   business models and are large-cap or mega-cap stocks, thereby   giving them a lot of influence over the S&P 500.",
    "One perfect example would be telecom and streaming-content   giant   AT&T    (NYSE: T) . As a shareholder in AT&T, I can attest that its   operating results have been OK, but nothing special in 2019, with   wireless strength being offset by cord-cutting. Yet the   year-to-date return for AT&T is nearly 29%, not including   dividend income, through this past weekend. Among mega-cap   stocks,   few if any can beat AT&T's 5.7% dividend   yield    , which is more than triple the inflation rate in the United   States. With substantially lower volatility than the S&P 500   and guaranteed income -- AT&T is a   Dividend Aristocrat    that's raised its payout for 35 consecutive years -- it's been a   prime beneficiary of plunging bond yields.",
    "Another beneficiary of market fear has been beverage giant   Coca-Cola    (NYSE: KO) . After its stock did virtually nothing between 2013   and 2018 other than pay out a reasonably strong dividend, shares   of Coca-Cola are up by almost 17% in 2019, not including   dividends paid. Coca-Cola has benefited from exceptionally strong   organic sales growth,   driven mostly by improved consumer demand    , but is most coveted by investors for its branding power and   income potential. Coca-Cola's 2.9% yield is more than a full   percentage point higher than the trailing 12-month inflation   rate, and its beta of 0.31 shows that its stock is only about 31%   as volatile as the S&P 500. It's a perfect safe-haven income   stock.",
    "Then there's consumer-products company   Procter & Gamble    (NYSE: PG) , which has tacked on just shy of 34% this year, not   including dividends. Like Coca-Cola, this gain came after Procter   & Gamble's stock was virtually flat between 2013 and 2018.   However, plunging global bond yields have created quite the   demand for large-scale, brand-name businesses that pay a hearty   dividend. Procter & Gamble's yield of 2.4% may be lower than   Coca-Cola's or AT&T's, but it's increased its payout   for an impressive 63 straight years    .",
    "The idea might sound ridiculous, but fear could very well lead   the stock market to new highs.",
    "  10 stocks we like better than AT&T       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and AT&T wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than AT&T       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and AT&T wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Sean Williams      owns shares of AT&T. The Motley Fool is short shares of     Procter & Gamble. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:00:00"
}