{
  "url": "https://www.nasdaq.com/article/hong-kong-protests-combine-with-midautumn-lantern-celebrations-20190912-00026",
  "title": "Hong Kong protests combine with Mid-Autumn lantern celebrations - Nasdaq.com",
  "text": [
    "By Jessie Pang and Felix Tam",
    "HONG KONG, Sept 12 (Reuters) - Hong Kong activists will combine anti-government protests with lantern celebrations marking the Mid-Autumn Festival this weekend after a brief lull in sometimes violent demonstrations which have rocked the Chinese-ruled city since June.",
    "The protests include another in a series of \"stress tests\" of the airport, which in recent weeks have seen approach roads blocked, street fires started and the trashing of a nearby MTR subway station.",
    "The Mid-Autumn Festival is a harvest celebration throughout the Chinese-speaking world. In East and Southeast Asia it is celebrated with mooncakes, gazing at the full moon and colourful lantern displays. It falls on Friday this year.",
    "Protesters plan a series of lantern-carrying human chains and sit-ins at MTR shopping malls and on the city's scenic Victoria Peak, popular with mainland tour groups, and on Lion Rock, separating the New Territories from the Kowloon peninsula.",
    "Police denied the Civil Human Rights Front (CHRF) permission for a mass downtown march on Sunday.",
    "\"In previous marches applied for by CHRF, participants, reporters and police suffered serious injuries,\" police said in their refusal letter to the group.",
    "\"Some protesters acted violently and blocked the main road and even used petrol bombs, bricks and iron bars to damage public facilities and social peace.\"",
    "The group has appealed.",
    "Police have responded to violence with tear gas, pepper spray, rubber bullets, water cannon and baton charges, prompting complaints of excessive force.",
    "Protesters also plan to gather outside the British consulate on Sunday to make sure China honours the Sino-British Joint Declaration which was signed in 1984, laying out the former British colony's future.",
    "China says Hong Kong is now its internal affair. Britain says it has a legal responsibility to ensure China abides by its obligations under the Joint Declaration.",
    "Hong Kong returned to China in 1997 under a \"one country, two systems\" formula that guarantees freedoms not enjoyed on the mainland, including an independent legal system.",
    "The current unrest was originally prompted by anger over planned legislation to allow extraditions to China, but has broadened into calls for democracy and for Communist rulers in Beijing to leave the city alone.",
    "China denies meddling and has accused the United States, Britain and others of fomenting the unrest."
  ],
  "published_datetime": "2019-09-12 01:27:00"
}