{
  "url": "https://www.nasdaq.com/article/banks-aid-saudi-other-markets-mixed-20190905-00140",
  "title": "Banks aid Saudi; other markets mixed - Nasdaq.com",
  "text": [
    "Sept 5 (Reuters) - The Saudi stock market rose in early trade on Thursday as most of its banks gained, while other major markets were mixed.",
    "Saudi Arabia's index  was up 0.3% with Al Rajhi Bank , the sharia-compliant lender, adding 0.7% and Riyad Bank  was up 1.6%.",
    "Fitch in a note said profitability improved in 2018 at Saudi Islamic banks as these benefited from stronger growth opportunities but asset-quality challenges continued.",
    "Dubai's index  traded 0.4% up with Emirates NBD  rising a further 1.1%, extending gains for the fourth straight session.",
    "On Monday, the lender had soared 14.9%, reaching its highest level since October 2007, following the bank's announcement it would raise the foreign ownership limit to 20% from 5% with immediate effect. The lender also said it intends to raise that limit to 40% in future. ",
    "But, blue-chip developer Emaar Properties  slipped 0.2% extending losses for a third day in a row.",
    "The realtor's chairman said he did not expect a change in the company's business after Dubai's ruler set up a new real estate committee to regulate and control market supply.",
    "On Monday, Dubai set up a real estate planning commission to regulate projects and avoid competition between semi-government and private firms, in a move designed to address the property market slump. ",
    "However, Dubai house prices will decline sharply this year and next, according to property market experts in a Reuters poll, who said a slowdown in the economy and an oversupply of housing units are big downside risks to their already weak outlook. ",
    "In Abu Dhabi, the index  traded flat with Emirates Telecommunications  losing 0.5%.",
    "Qatari index  lost 0.3% with Qatar Islamic Bank  declining 1.5% and Qatar National Bank , the Gulf's largest lender by assets, dropping 1%."
  ],
  "published_datetime": "2019-09-05 04:36:00"
}