{
  "url": "https://www.nasdaq.com/article/vodafone-returns-to-us-highgrade-bond-market-for-cheap-funding-20190911-00607",
  "title": "Vodafone returns to US high-grade bond market for cheap funding - Nasdaq.com",
  "text": [
    "By William Hoffman",
    "NEW YORK, Sept 10 (IFR) - UK telecom Vodafone took advantage of low rates and good market conditions on Tuesday to lock in cheaper long dated US dollar bonds, as the firm presses on with deleveraging plans following its acquisition of Liberty Global's European assets in July.",
    "The company, rated Baa2/BBB/BBB, raised US$1.5bn through a 31-year bond that tightened 20bp from initial price thoughts to price at 210bp over Treasuries, with a 4.25% coupon.",
    "For a strong Triple B name with a compelling deleveraging story, Vodafone offered investors an attractive spread that pushed order books to US$4.5bn.",
    "\"Even with that concession, they are going to print this 30 year with a 4.25% coupon, and if you think about 30 year debt for Triple Bs that's a fantastic rate,\" said Kurt Halvorson, portfolio manager at Western Asset Management.",
    "\"They will bring down their overall cost of debt while extending maturities so it's absolutely a win for them.\"",
    "Vodafone has been active in the US market this year issuing a dual tranche US$1.75bn 30-year and US$500m 40-year note in June as well as a US$2bn hybrid note back in March.",
    "The increase in new debt from Vodafone follows on from the telecom's US$21.8bn acquisition of Liberty Global's European assets in July, a move that prompted S&P and Fitch to downgrade the firm one notch to BBB because of the increase in leverage.",
    "Since then, the company has cut its dividend and announced monetization of its tower assets, according to CreditSights.",
    "\"We like the management team and think they will execute on their deleveraging plan,\" Halvorson said.",
    "\"I can't tell you the difference it makes to have a management team for a company like this that is going to deliver on what they say versus one that doesn't have a track record.\"",
    "And with a rally in rates as well as in the company's bonds since June, the firm saw an opportunity this week to lock in  more funding at cheaper levels.",
    "Since that June issuance the 30-year US Treasury rate has fallen to 2.153% from 2.624%.",
    "\"Today's new issuance is just over three months later, but",
    "coming with a materially better price for the operator,\" CreditSights noted in a report.",
    "\"Since the June issuance, Vodafone has performed well against the US Technology, Media and Telecom comp group, with spreads compressing materially relative to both AT&T and Verizon.\"",
    "Even so, Vodafone's new notes offer a decent spread over Verizon's 5.012% 2049 which traded at 147bp over Treasuries on Tuesday while AT&T's 4.5% 2048 was trading hands at 190bp over Treasuries, according to MarketAxess data."
  ],
  "published_datetime": "2019-09-11 12:16:00"
}