{
  "url": "https://www.nasdaq.com/article/these-3-value-stocks-are-absurdly-cheap-right-now-cm1206958",
  "title": "These 3 Value Stocks Are Absurdly Cheap Right Now - Nasdaq.com",
  "text": [
    " August was chock-full of negative news for stocks. A single   month is nothing, though. Try many quarters -- even years -- of   pessimism, as   Macy's    (NYSE: M) ,   Urban Outfitters    (NASDAQ: URBN) , and   Axos Financial    (NYSE: AX) shareholders have endured. Bad news has tanked all   three stocks in the past year. But bad news often spells opportunity for investors who look   beyond the headlines at the underlying business opportunity.   Stocks are, after all, shares of businesses with the ability to   dynamically adapt to changes in the economy, other business and   consumer habits, and more. Thus, though the market has been   unkind to Macy's, Urban Outfitters, and Axos Financial, three   Foolish contributors think they're cheap and worth a look right   now. Don't underestimate this department store   Nicholas Rossolillo    (Macy's):    Big changes in retail have given the department store industry a   serious black eye. Slow to pick up on the rise of online shopping   and dealing with rising competition from big-box stores that have   upped their game, department stores have seen their sales in   steady decline for years; sales are down another 4% so far in   2019, according to the U.S. Census Bureau.makeArticleAd(); Macy's has been a big culprit as it closes down stores to   rightsize its real estate footprint, while increasing its online   presence. The transition has been a rocky one, to say the least.   After putting up low-single-digit comparable-store sales (a   measure of the number and size of customer purchases at existing   locations) in 2018, that metric has reverted to a mere 0.5%   increase through the first half of 2019. Along with storefront   closures, revenue is down 0.6% and adjusted earnings are down   39.5%. The iconic retailer entered the year with too much inventory,   so heavy discounting has been a big reason for the earnings   decline. With the problem fixed, though, management believes it   is   on track to return to growth    , and it's looking for ways to cut expenses. Online sales have   been a bright spot; to double down on what's working best, Macy's   inked a deal with   Alphabet    's Google to optimize its inventory and distribution network.   While Macy's is certainly down, it's far from out of the game,   and remains one of the better-positioned department-store chains   to deal with an evolving consumer landscape. Nevertheless, short-term myopia has sent    Macy's stock    down over 50% this year, and shares are currently trading for a   mere 8.7 times 12-month free cash flow (basic profit after   operating expenses and capital expenditures). Toss in the facts   that Macy's has reduced long-term debt by 15% since last summer,   to $4.68 billion, and that it pays a dividend yielding 10.5%, and   this looks like one   cheap retail stock    poised for a rebound. Grab this well-oiled profit machine while it's cheap   Anders Bylund    (Urban Outfitters):    Right now, you can pick up shares of this youth-oriented clothing   and lifestyle retailer for just 9.7 times trailing earnings. The   stock also trades at less than 7.3 times trailing cash flow, or   roughly 0.6 times trailing sales. These valuation ratios sit far   below the retail sector's averages, and they also look affordable   in comparison to Urban Outfitters' five-year averages. At the same time, the company is outperforming most of its   sector peers in terms of running a solid business. With a 9.7%   operating margin and 12% return on assets over the last four   quarters, Urban Outfitters runs a tight ship. The trailing cash   conversion cycle has hovered near the 40-day mark for several   years, and is among the sector's strongest efficiency readings.   Fiscal responsibility over many years also resulted in a   squeaky-clean balance sheet with $520 million of cash equivalents   and zero long-term debt. All that being said, fashion is a notoriously trend-sensitive   industry, and even a well-run company can miss out on large   swings in consumer tastes. Urban Outfitters has had some pain on   that front over the last couple of years, including a weak   shopper response to its products in women's fashion in the second   quarter. But the company is fighting back with a successful   customer rewards program, expanded e-commerce initiatives in   several international markets, and   a strong start to the third quarter    driven by a successful back-to-school campaign. In short, we're looking at a well-run company that responds   appropriately to changes in the market. Even in difficult market   conditions, Urban Outfitters posts strong profits and   sector-leading efficiency metrics. And in case of absolute   disaster, this company could ride out a long and painful storm on   that mint-condition balance sheet. Yet investors value Urban Outfitters like a struggling chain   on the brink of bankruptcy; that's a big mistake. I see Urban   Outfitters as a fantastic buy today.   Image source: Getty Images.  Time to make another deposit   Jason Hall    (Axos Financial):    It's only been a few weeks since I last made the case that   Axos Financial was absurdly cheap    . Well, guess what? It's even cheaper now. Moreover, Axos has resoundingly answered questions about its   ability to deliver growth with a strong   yes    .   Axos reported double-digit growth in the second   quarter    across all of its most important metrics. Assets, book value per   share, interest and non-interest income, and earnings per share   all increased by at least 14% in the quarter. Since then, its stock price has fallen more than 11%. However,   it's worth noting that much of the sell-off is related to   concerns about the prospects for banks as a whole:       AX    data by   YCharts    . As you can see, both regional and big banks, as measured by   the   SPDR S&P Regional Banking ETF    and   SPDR S&P Bank ETF    respectively, have fallen sharply over the past month. That   reflects the market's fears of interest-rate uncertainty, as well   as ongoing global macroeconomic turmoil that could pull the U.S.   and much of the world into recession. Sure, recession is a possibility. Heck, I'd go as far as to   say that recession isn't just possible, it's   inevitable    , and people   do    need to   prepare for the next recession    . The thing is, to invest in stocks for the long term and   generate long-term wealth, you need to ride out market downturns,   and not get caught up in the mistake of trying to time your way   around the next crash. Right now, Axos trades for less than 8.5 times 2019 earnings   estimates. That's crazy-cheap for a company that's generated   double-digi   t earnings    growth for years, and that has the capacity to grow earnings at   double-digit rates for many more years to come. Even if we see a   recession in the next year or so, investors who buy Axos at   today's valuation, and hold for the long term, could find   themselves very glad they did.   10 stocks we like better than Macy's       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Macy's wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       Suzanne Frey, an executive at Alphabet, is a member of The     Motley Fool's board of directors.     Anders Bylund      owns shares of GOOGL.     Jason Hall      owns shares of GOOGL and Axos Financial.     Nicholas Rossolillo       and his clients own shares of GOOG. The Motley Fool owns     shares of and recommends GOOGL, GOOG, and Axos Financial. The     Motley Fool has a     disclosure policy      .  ",
    "August was chock-full of negative news for stocks. A single   month is nothing, though. Try many quarters -- even years -- of   pessimism, as   Macy's    (NYSE: M) ,   Urban Outfitters    (NASDAQ: URBN) , and   Axos Financial    (NYSE: AX) shareholders have endured. Bad news has tanked all   three stocks in the past year.",
    "But bad news often spells opportunity for investors who look   beyond the headlines at the underlying business opportunity.   Stocks are, after all, shares of businesses with the ability to   dynamically adapt to changes in the economy, other business and   consumer habits, and more. Thus, though the market has been   unkind to Macy's, Urban Outfitters, and Axos Financial, three   Foolish contributors think they're cheap and worth a look right   now.",
    "  Nicholas Rossolillo    (Macy's):    Big changes in retail have given the department store industry a   serious black eye. Slow to pick up on the rise of online shopping   and dealing with rising competition from big-box stores that have   upped their game, department stores have seen their sales in   steady decline for years; sales are down another 4% so far in   2019, according to the U.S. Census Bureau.",
    "Macy's has been a big culprit as it closes down stores to   rightsize its real estate footprint, while increasing its online   presence. The transition has been a rocky one, to say the least.   After putting up low-single-digit comparable-store sales (a   measure of the number and size of customer purchases at existing   locations) in 2018, that metric has reverted to a mere 0.5%   increase through the first half of 2019. Along with storefront   closures, revenue is down 0.6% and adjusted earnings are down   39.5%.",
    "The iconic retailer entered the year with too much inventory,   so heavy discounting has been a big reason for the earnings   decline. With the problem fixed, though, management believes it   is   on track to return to growth    , and it's looking for ways to cut expenses. Online sales have   been a bright spot; to double down on what's working best, Macy's   inked a deal with   Alphabet    's Google to optimize its inventory and distribution network.   While Macy's is certainly down, it's far from out of the game,   and remains one of the better-positioned department-store chains   to deal with an evolving consumer landscape.",
    "Nevertheless, short-term myopia has sent    Macy's stock    down over 50% this year, and shares are currently trading for a   mere 8.7 times 12-month free cash flow (basic profit after   operating expenses and capital expenditures). Toss in the facts   that Macy's has reduced long-term debt by 15% since last summer,   to $4.68 billion, and that it pays a dividend yielding 10.5%, and   this looks like one   cheap retail stock    poised for a rebound.",
    "  Anders Bylund    (Urban Outfitters):    Right now, you can pick up shares of this youth-oriented clothing   and lifestyle retailer for just 9.7 times trailing earnings. The   stock also trades at less than 7.3 times trailing cash flow, or   roughly 0.6 times trailing sales. These valuation ratios sit far   below the retail sector's averages, and they also look affordable   in comparison to Urban Outfitters' five-year averages.",
    "At the same time, the company is outperforming most of its   sector peers in terms of running a solid business. With a 9.7%   operating margin and 12% return on assets over the last four   quarters, Urban Outfitters runs a tight ship. The trailing cash   conversion cycle has hovered near the 40-day mark for several   years, and is among the sector's strongest efficiency readings.   Fiscal responsibility over many years also resulted in a   squeaky-clean balance sheet with $520 million of cash equivalents   and zero long-term debt.",
    "All that being said, fashion is a notoriously trend-sensitive   industry, and even a well-run company can miss out on large   swings in consumer tastes. Urban Outfitters has had some pain on   that front over the last couple of years, including a weak   shopper response to its products in women's fashion in the second   quarter. But the company is fighting back with a successful   customer rewards program, expanded e-commerce initiatives in   several international markets, and   a strong start to the third quarter    driven by a successful back-to-school campaign.",
    "In short, we're looking at a well-run company that responds   appropriately to changes in the market. Even in difficult market   conditions, Urban Outfitters posts strong profits and   sector-leading efficiency metrics. And in case of absolute   disaster, this company could ride out a long and painful storm on   that mint-condition balance sheet.",
    "Yet investors value Urban Outfitters like a struggling chain   on the brink of bankruptcy; that's a big mistake. I see Urban   Outfitters as a fantastic buy today.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "  Jason Hall    (Axos Financial):    It's only been a few weeks since I last made the case that   Axos Financial was absurdly cheap    . Well, guess what? It's even cheaper now.",
    "Moreover, Axos has resoundingly answered questions about its   ability to deliver growth with a strong   yes    .   Axos reported double-digit growth in the second   quarter    across all of its most important metrics. Assets, book value per   share, interest and non-interest income, and earnings per share   all increased by at least 14% in the quarter.",
    "Since then, its stock price has fallen more than 11%. However,   it's worth noting that much of the sell-off is related to   concerns about the prospects for banks as a whole:",
    " AX    data by   YCharts    .",
    "As you can see, both regional and big banks, as measured by   the   SPDR S&P Regional Banking ETF    and   SPDR S&P Bank ETF    respectively, have fallen sharply over the past month. That   reflects the market's fears of interest-rate uncertainty, as well   as ongoing global macroeconomic turmoil that could pull the U.S.   and much of the world into recession.",
    "Sure, recession is a possibility. Heck, I'd go as far as to   say that recession isn't just possible, it's   inevitable    , and people   do    need to   prepare for the next recession    . The thing is, to invest in stocks for the long term and   generate long-term wealth, you need to ride out market downturns,   and not get caught up in the mistake of trying to time your way   around the next crash.",
    "Right now, Axos trades for less than 8.5 times 2019 earnings   estimates. That's crazy-cheap for a company that's generated   double-digi   t earnings    growth for years, and that has the capacity to grow earnings at   double-digit rates for many more years to come. Even if we see a   recession in the next year or so, investors who buy Axos at   today's valuation, and hold for the long term, could find   themselves very glad they did.",
    "  10 stocks we like better than Macy's       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Macy's wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Macy's       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Macy's wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " Suzanne Frey, an executive at Alphabet, is a member of The     Motley Fool's board of directors.     Anders Bylund      owns shares of GOOGL.     Jason Hall      owns shares of GOOGL and Axos Financial.     Nicholas Rossolillo       and his clients own shares of GOOG. The Motley Fool owns     shares of and recommends GOOGL, GOOG, and Axos Financial. The     Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 15:33:00"
}