{
  "url": "https://www.nasdaq.com/article/should-value-investors-buy-first-business-financial-services-fbiz-stock-cm1210349",
  "title": "Should Value Investors Buy First Business Financial Services (FBIZ) Stock? - Nasdaq.com",
  "text": [
    " Here at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks. Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks. Looking at the history of these trends, perhaps none is more beloved than value investing. This strategy simply looks to identify companies that are being undervalued by the broader market. Value investors use fundamental analysis and traditional valuation metrics to find stocks that they believe are being undervalued by the market at large. On top of the Zacks Rank, investors can also look at our innovative Style Scores system to find stocks with specific traits. For example, value investors will want to focus on the \"Value\" category. Stocks with high Zacks Ranks and \"A\" grades for Value will be some of the highest-quality value stocks on the market today. One stock to keep an eye on is First Business Financial Services (FBIZ). FBIZ is currently sporting a Zacks Rank of #2 (Buy), as well as an A grade for Value. The stock has a Forward P/E ratio of 9.63. This compares to its industry's average Forward P/E of 11.37. FBIZ's Forward P/E has been as high as 11.81 and as low as 9.25, with a median of 10.22, all within the past year. We also note that FBIZ holds a PEG ratio of 1.20. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. FBIZ's industry has an average PEG of 1.52 right now. FBIZ's PEG has been as high as 1.48 and as low as 1.16, with a median of 1.28, all within the past year. Investors should also recognize that FBIZ has a P/B ratio of 1.05. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. This stock's P/B looks solid versus its industry's average P/B of 2.07. FBIZ's P/B has been as high as 1.21 and as low as 0.94, with a median of 1.05, over the past year. Value investors also frequently use the P/S ratio. This metric is found by dividing a stock's price with the company's revenue. Some people prefer this metric because sales are harder to manipulate on an income statement. This means it could be a truer performance indicator. FBIZ has a P/S ratio of 1.67. This compares to its industry's average P/S of 2.91. Finally, we should also recognize that FBIZ has a P/CF ratio of 8.15. This data point considers a firm's operating cash flow and is frequently used to find companies that are undervalued when considering their solid cash outlook. This stock's P/CF looks attractive against its industry's average P/CF of 12.31. Over the past 52 weeks, FBIZ's P/CF has been as high as 13.70 and as low as 7.85, with a median of 9.92. Value investors will likely look at more than just these metrics, but the above data helps show that First Business Financial Services is likely undervalued currently. And when considering the strength of its earnings outlook, FBIZ sticks out at as one of the market's strongest value stocks.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  First Business Financial Services, Inc. (FBIZ): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Here at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks. Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks.",
    "Looking at the history of these trends, perhaps none is more beloved than value investing. This strategy simply looks to identify companies that are being undervalued by the broader market. Value investors use fundamental analysis and traditional valuation metrics to find stocks that they believe are being undervalued by the market at large.",
    "On top of the Zacks Rank, investors can also look at our innovative Style Scores system to find stocks with specific traits. For example, value investors will want to focus on the \"Value\" category. Stocks with high Zacks Ranks and \"A\" grades for Value will be some of the highest-quality value stocks on the market today.",
    "One stock to keep an eye on is First Business Financial Services (FBIZ). FBIZ is currently sporting a Zacks Rank of #2 (Buy), as well as an A grade for Value. The stock has a Forward P/E ratio of 9.63. This compares to its industry's average Forward P/E of 11.37. FBIZ's Forward P/E has been as high as 11.81 and as low as 9.25, with a median of 10.22, all within the past year.",
    "We also note that FBIZ holds a PEG ratio of 1.20. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. FBIZ's industry has an average PEG of 1.52 right now. FBIZ's PEG has been as high as 1.48 and as low as 1.16, with a median of 1.28, all within the past year.",
    "Investors should also recognize that FBIZ has a P/B ratio of 1.05. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. This stock's P/B looks solid versus its industry's average P/B of 2.07. FBIZ's P/B has been as high as 1.21 and as low as 0.94, with a median of 1.05, over the past year.",
    "Value investors also frequently use the P/S ratio. This metric is found by dividing a stock's price with the company's revenue. Some people prefer this metric because sales are harder to manipulate on an income statement. This means it could be a truer performance indicator. FBIZ has a P/S ratio of 1.67. This compares to its industry's average P/S of 2.91.",
    "Finally, we should also recognize that FBIZ has a P/CF ratio of 8.15. This data point considers a firm's operating cash flow and is frequently used to find companies that are undervalued when considering their solid cash outlook. This stock's P/CF looks attractive against its industry's average P/CF of 12.31. Over the past 52 weeks, FBIZ's P/CF has been as high as 13.70 and as low as 7.85, with a median of 9.92.",
    "Value investors will likely look at more than just these metrics, but the above data helps show that First Business Financial Services is likely undervalued currently. And when considering the strength of its earnings outlook, FBIZ sticks out at as one of the market's strongest value stocks.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:10:22"
}