{
  "url": "https://www.nasdaq.com/article/facebook-fb-outpaces-stock-market-gains-what-you-should-know-cm1210792",
  "title": "Facebook (FB) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Facebook (FB) closed the most recent trading day at $188.49, moving +1.25% from the previous trading session. This move outpaced the S&P 500's daily gain of 0.72%. Elsewhere, the Dow gained 0.85%, while the tech-heavy Nasdaq added 1.06%. Heading into today, shares of the social media company had lost 1.21% over the past month, lagging the Computer and Technology sector's gain of 2.17% and the S&P 500's gain of 2.25% in that time. Wall Street will be looking for positivity from FB as it approaches its nex t earnings  report date. In tha t report  , analysts expect FB to post earnings of $1.94 per share. This would mark year-over-year growth of 10.23%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $17.33 billion, up 26.23% from the year-ago period. For the full year, our Zacks Consensus Estimates are projecting earnings of $6.39 per share and revenue of $70.31 billion, which would represent changes of -15.59% and +25.91%, respectively, from the prior year. It is also important to note the recent changes to analyst estimates for FB. Recent revisions tend to reflect the latest near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.9% higher. FB is currently sporting a Zacks Rank of #3 (Hold). Digging into valuation, FB currently has a Forward P/E ratio of 29.11. This represents a premium compared to its industry's average Forward P/E of 26.57. It is also worth noting that FB currently has a PEG ratio of 1.36. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. FB's industry had an average PEG ratio of 2.38 as of yesterday's close. The Internet - Services industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 173, putting it in the bottom 33% of all 250+ industries. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Facebook, Inc. (FB): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Facebook (FB) closed the most recent trading day at $188.49, moving +1.25% from the previous trading session. This move outpaced the S&P 500's daily gain of 0.72%. Elsewhere, the Dow gained 0.85%, while the tech-heavy Nasdaq added 1.06%.",
    "Heading into today, shares of the social media company had lost 1.21% over the past month, lagging the Computer and Technology sector's gain of 2.17% and the S&P 500's gain of 2.25% in that time.",
    "Wall Street will be looking for positivity from FB as it approaches its nex t earnings  report date. In tha t report  , analysts expect FB to post earnings of $1.94 per share. This would mark year-over-year growth of 10.23%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $17.33 billion, up 26.23% from the year-ago period.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of $6.39 per share and revenue of $70.31 billion, which would represent changes of -15.59% and +25.91%, respectively, from the prior year.",
    "It is also important to note the recent changes to analyst estimates for FB. Recent revisions tend to reflect the latest near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.9% higher. FB is currently sporting a Zacks Rank of #3 (Hold).",
    "Digging into valuation, FB currently has a Forward P/E ratio of 29.11. This represents a premium compared to its industry's average Forward P/E of 26.57.",
    "It is also worth noting that FB currently has a PEG ratio of 1.36. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. FB's industry had an average PEG ratio of 2.38 as of yesterday's close.",
    "The Internet - Services industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 173, putting it in the bottom 33% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:45:26"
}