{
  "url": "https://www.nasdaq.com/article/wall-street-traders-pump-up-argentine-peso-as-currency-controls-hit-home-20190903-01004",
  "title": "Wall Street traders pump up Argentine peso as currency controls hit home - Nasdaq.com",
  "text": [
    "By Cassandra Garrison and Jorge Otaola",
    "BUENOS AIRES, Sept 3 (Reuters) - Argentina's peso surged on Tuesday, pumped up by Wall Street traders cheering President Mauricio Macri's capital controls that are aimed at protecting the beleaguered currency.",
    "The peso closed 5.39% higher at 55.98 per U.S. dollar, traders said, its strongest level in a week after a near record low close on Friday. Country risk, which soared to its highest level in more than a decade last month, also fell.",
    "The currency rebound gives some relief to Macri, after a shock primary election battering last month sparked a sharp crash in the country's bonds, equities and the peso, which lost around 26% of its value against the greenback in August alone.",
    "Argentina's S&P Merval stock index , however, took a hit in afternoon trading, closing down 11.9% at a two-year low in a slide that local analysts attributed to global trade jitters.",
    "\"All the markets are in the red and a weakened country like Argentina, with a complicated political situation, gets hits even more,\" said Hector Scasserra, director of local brokerage firm Arpenta Sociedad de Bolsa.",
    "In Europe, the pounding of Argentina's bonds also eased after they had fallen to record lows on Monday, while there were tentative gains in some foreign-traded bank shares.",
    "Ratings agency Fitch upgraded Argentina's long-term issuer debt rating to \"CC\" or just barely above default from \"restricted default\" saying the new rating reflects their view that \"a further default or debt restructuring of some kind is probable.\" ",
    "Frankfurt-listed American Depositary Receipts (ADRs) of Grupo Financiero Galicia  were up 0.6% after having tumbled 7.7.% on Monday while Banco Macro SA's  ADRs fell over 6% in New York, where markets were closed on Monday for a holiday.",
    "MarketAxess data showed Argentina's century bond  traded marginally higher while the January 2028 bond  dipped under 37 cents on the dollar.",
    "The black market peso, available via unofficial traders, also rose on Tuesday, although not as sharply as the official spot rate. Following a fall on Monday, it has now diverged from the official rate by the largest margin since 2015, a sign of tension over pricing of the currency. ",
    "STILL AN EMERGING MARKET",
    "Index provider MSCI said it was closely monitoring developments in Argentina but that the country's \"emerging market\" status for the purpose of MSCI indexes remained valid for now as MSCI Argentina only held foreign-listed shares.",
    "Argentina was included in the emerging markets index in May, potentially boosting inflows to the eight stocks that were added. ",
    "Any reclassification of Argentina in the widely followed indexes would first require a public consultation from MSCI.",
    "On Sunday, the government authorized the central bank to restrict purchases of dollars as it burns through its reserves to prop up the peso. The currency controls were a 180-degree turn for Macri, a free-markets advocate who abolished capital controls after he came to power in 2015. ",
    "It was the government's latest attempt to stabilize the peso, which has lost around 20% of its value since opposition presidential candidate Alberto Fernandez emerged as the clear front-runner in the Aug. 11 primary election.",
    "On Tuesday, the government also said in a decree published in the country's official gazette that it would unilaterally hike the minimum wage by 35% over the next few months. Argentina's 12-month inflation is running at close to 55%.",
    "Fernandez and his running mate, former President Cristina Fernandez de Kirchner, are considered a riskier prospect by investors, who fear Argentina could return to the interventionist policies of her former government.",
    "On Monday, central bank president Guido Sandleris called Argentina's financial system \"strong\" and said the bank would adhere to its strict monetary policy, despite the currency restrictions. ",
    "Sandleris, speaking at a news conference, said the bank was in talks with the International Monetary Fund to \"redefine\" the monetary goals for September under its $57 billion financing agreement."
  ],
  "published_datetime": "2019-09-03 09:17:00"
}