{
  "url": "https://www.nasdaq.com/article/amazons-newest-prime-market-is-the-country-with-the-amazon-running-through-it-cm1210714",
  "title": "Amazon's Newest Prime Market Is the Country with the Amazon Running Through It - Nasdaq.com",
  "text": [
    "  Amazon    (NASDAQ: AMZN) is bringing a pillar of its online marketplace   business to the biggest economy in Latin America. Brazil is the   most recent market where customers can sign up for Amazon Prime   benefits. The service costs just 9.90 reais per month (about   $2.42) or 89 reais per year. Amazon previously offered a Prime   Video-only subscription for 14.90 reais per month. While Amazon has had a presence in Brazil since 2012 as a   bookseller, it only expanded its business to a general   merchandise marketplace in 2017. And it wasn't until earlier this   year that it started selling products outside of books and media   to consumers directly. Amazon faces significant competition from more localized   companies including   MercadoLibre    (NASDAQ: MELI) and Magazine Luiza as it vies for a piece of the   fast-growing Brazillian market.makeArticleAd();   Image source: Amazon.  The big opportunity Brazil is the largest e-commerce market in Latin America.   Brazillian consumers will spend about $24.2 billion online this   year, according to eMarketer analysts, who predict that number   will grow to $28.5 billion by 2022. Importantly, Amazon still accounts for a very small percentage   of those sales. It's still in its infancy as a general   merchandise retailer in Brazil, and it doesn't have the same   brand recognition as it does in other parts of the world. MercadoLibre, on the other hand, reported gross billings of   $385 million in Brazil last quarter, nearly two-thirds of its   total gross billings. If it sees a similar percentage of its   gross merchandise volume coming from Brazil, that puts it on   nearly an $8 billion run rate in the country -- about one-third   of the entire market, by eMarketer's forecast. Offering Prime at a relatively low price should help Amazon   win over shoppers. Prime will include guaranteed 48-hour delivery   in 90 municipalities on over 500,000 items, Prime Video   streaming, and other entertainment perks including on-demand   access to Amazon's music, games, books, and magazines. Expanding the logistics network Unlimited (fast)   shipping    at no additional cost is the biggest perk of Prime in any market.   MercadoLibre has seen a lot of success offering free shipping to   customers who spend over a certain threshold on its Brazilian   marketplace. Last quarter, the company spent $44 million   subsidizing shipping expenses in Brazil. Investors should expect Amazon to spend more on fulfillment in   Brazil. It currently operates just two distribution centers in   Brazil, outside of Sao Paulo. Building out a network to warehouse   more inventory and deliver items more quickly throughout the   expansive country will help attract more customers to the Prime   membership. MercadoLibre is building out its own logistics network in the   country. Management said it handled 20% of its own packages last   quarter, and it expects that number to climb in the back half of   the year. Leaning on its own logistics network will help reduce   overall shipping expenses in the long run, although it requires   significant capital investments right now. That's right out of   Amazon's playbook    . For Prime to become a truly competitive offering, Amazon will   need to invest more in its logistics network. It's Prime time The introduction of Prime in Brazil is an indicator that   Amazon is ready to make a bigger investment in the country,   negotiate with regulators and overcome market restrictions, and   vie for a piece of the growing e-commerce market. MercadoLibre   and other established competitors represent a significant   challenge, but Amazon has proven capable of establishing itself   in fast-growing competitive markets before (see India). Amazon has shared anecdotal updates on specific markets in the   past -- e.g. India is the fastest-growing market for Prime   membership -- and investors should look for updates from   management in future quarterly earnings releases and       earnings call    s.   10 stocks we like better than Amazon       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amazon wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors.     Adam Levy      owns shares of Amazon. The Motley Fool owns shares of and     recommends Amazon and MercadoLibre. The Motley Fool has a     disclosure policy      .  ",
    " Amazon    (NASDAQ: AMZN) is bringing a pillar of its online marketplace   business to the biggest economy in Latin America. Brazil is the   most recent market where customers can sign up for Amazon Prime   benefits. The service costs just 9.90 reais per month (about   $2.42) or 89 reais per year. Amazon previously offered a Prime   Video-only subscription for 14.90 reais per month.",
    "While Amazon has had a presence in Brazil since 2012 as a   bookseller, it only expanded its business to a general   merchandise marketplace in 2017. And it wasn't until earlier this   year that it started selling products outside of books and media   to consumers directly.",
    "Amazon faces significant competition from more localized   companies including   MercadoLibre    (NASDAQ: MELI) and Magazine Luiza as it vies for a piece of the   fast-growing Brazillian market.",
    "  Image source: Amazon. ",
    "Image source: Amazon.",
    "Brazil is the largest e-commerce market in Latin America.   Brazillian consumers will spend about $24.2 billion online this   year, according to eMarketer analysts, who predict that number   will grow to $28.5 billion by 2022.",
    "Importantly, Amazon still accounts for a very small percentage   of those sales. It's still in its infancy as a general   merchandise retailer in Brazil, and it doesn't have the same   brand recognition as it does in other parts of the world.",
    "MercadoLibre, on the other hand, reported gross billings of   $385 million in Brazil last quarter, nearly two-thirds of its   total gross billings. If it sees a similar percentage of its   gross merchandise volume coming from Brazil, that puts it on   nearly an $8 billion run rate in the country -- about one-third   of the entire market, by eMarketer's forecast.",
    "Offering Prime at a relatively low price should help Amazon   win over shoppers. Prime will include guaranteed 48-hour delivery   in 90 municipalities on over 500,000 items, Prime Video   streaming, and other entertainment perks including on-demand   access to Amazon's music, games, books, and magazines.",
    "Unlimited (fast)   shipping    at no additional cost is the biggest perk of Prime in any market.   MercadoLibre has seen a lot of success offering free shipping to   customers who spend over a certain threshold on its Brazilian   marketplace. Last quarter, the company spent $44 million   subsidizing shipping expenses in Brazil.",
    "Investors should expect Amazon to spend more on fulfillment in   Brazil. It currently operates just two distribution centers in   Brazil, outside of Sao Paulo. Building out a network to warehouse   more inventory and deliver items more quickly throughout the   expansive country will help attract more customers to the Prime   membership.",
    "MercadoLibre is building out its own logistics network in the   country. Management said it handled 20% of its own packages last   quarter, and it expects that number to climb in the back half of   the year. Leaning on its own logistics network will help reduce   overall shipping expenses in the long run, although it requires   significant capital investments right now. That's right out of   Amazon's playbook    .",
    "For Prime to become a truly competitive offering, Amazon will   need to invest more in its logistics network.",
    "The introduction of Prime in Brazil is an indicator that   Amazon is ready to make a bigger investment in the country,   negotiate with regulators and overcome market restrictions, and   vie for a piece of the growing e-commerce market. MercadoLibre   and other established competitors represent a significant   challenge, but Amazon has proven capable of establishing itself   in fast-growing competitive markets before (see India).",
    "Amazon has shared anecdotal updates on specific markets in the   past -- e.g. India is the fastest-growing market for Prime   membership -- and investors should look for updates from   management in future quarterly earnings releases and       earnings call    s.",
    "  10 stocks we like better than Amazon       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amazon wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Amazon       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amazon wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors.     Adam Levy      owns shares of Amazon. The Motley Fool owns shares of and     recommends Amazon and MercadoLibre. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:46:55"
}