{
  "url": "https://www.nasdaq.com/article/brexiles-protest-in-dublin-at-prospect-of-uk-leaving-eu-with-no-deal-20190903-01235",
  "title": "'Brexiles' protest in Dublin at prospect of UK leaving EU with no deal - Nasdaq.com",
  "text": [
    "By Padraic Halpin",
    "DUBLIN, Sept 3 (Reuters) - Despairing at a country she believed was becoming more insular the more its Brexit debate raged, Briton Jess Worsdale decided this year that it was time to move to Ireland for good.",
    "On Tuesday, she was among about 100 expatriates who stood in the rain outside Britain's embassy in Dublin to rally against Prime Minister Boris Johnson's planned suspension of parliament and potential \"no-deal\" exit from the European Union.",
    "\"My partner's Irish and we just wanted to come home and it feels more like home to me. It was a fairly easy decision.\"",
    "Worsdale and her partner were among the almost 20,000 people who, according to data from the Central Statistics Office last week, moved from the UK to EU member Ireland in the 12 months to April 2019, as 11,600 went in the other direction.",
    "That trend marks a sharp change in the traditional movement between the neighbouring countries and is a near exact reversal of the figures in 2013, when Ireland was emerging from a financial crisis and Britain was still a committed member of the EU.",
    "More than 7,000 of those who immigrated from the UK in the 12 months to April 2019 were British nationals, almost double the number making the move six years ago and included Will Fenwick, who held a handmade 'Listen to experts' sign outside the embassy gates.",
    "\"I lived in England my whole life until I moved here. It's very stressful watching this unfold,\" said the 27-year-old analyst from Newcastle, adding the Brexit-related fall in the value of sterling meant it had never been easier to move abroad, something lots of his friends were doing.",
    "\"I've seen my aunt lose her job. She got laid off in the Nissan factory in Sunderland. I've seen all the divisions this whole referendum has caused and I'm looking and thinking the economic consequences of a no-deal or even a deal could be catastrophic and I just can't face that for my country.\"",
    "As cries of 'Stop The Coup' rang out, the smattering of old and young Britons were cheered on by locals who beeped their car horns in support as they passed the short protest.",
    "Like Worsdale and Fenwick, Tim, a 63-year-old protester who declined to give his last name, said that while he may not like it, he thought Britain should leave or its exit be put to a second vote. A \"no-deal\" Brexit, however, was not something anyone voted for.",
    "\"The heat in the argument, I don't recognise that,\" said the food industry worker, who left London for Dublin 22 years ago.",
    "\"Even amongst people I know, family, where sides have been taken. It's just very hard to square that with the Britain that I thought I came from. It seems to be broken, I'm not sure how this plays out, I'm at a loss. I think we all are.\""
  ],
  "published_datetime": "2019-09-03 16:49:00"
}