{
  "url": "https://www.nasdaq.com/article/hurricane-dorian-what-impact-will-it-have-on-the-us-economy-and-stock-market-cm1210305",
  "title": "Hurricane Dorian: What Impact Will It Have on the U.S. Economy and Stock Market? - Nasdaq.com",
  "text": [
    " Whether you realize it or not, you witnessed history less than   two weeks ago. After forming over the Lesser Antilles on Aug. 24, Hurricane   Dorian would go on to become one of the strongest storms ever   measured in the Atlantic. When it struck the Bahamas on Sept. 1,   it had peak sustained wind speeds of 185 mph, making it the   strongest hurricane in more than eight decades to hit the   Bahamas. It also tied for the second strongest on record in terms   of one-minute sustained wind speed.   Image source: Getty Images.makeArticleAd();  It absolutely ravaged the island of Grand Bahama, took aim at   Florida and the Carolinas in the U.S., and left behind an   official death toll of 45 in the Bahamas as of Monday, Sept. 9.   But keep in mind that local newspapers in the Bahamas are   claiming death tolls in the thousands, suggesting that this   \"official\" total may head significantly higher. In addition to the priceless loss of lives, hurricanes can   impact businesses, both big and small, in the areas they strike.   What impact might the U.S. economy and stock market feel from   Dorian's romp through the Atlantic and near the Eastern seaboard   of the United States? Let's take a closer look by taking a walk   down memory lane.  How much do hurricanes really impact the U.S. economy     and stock market?  In terms of lives lost, Dorian was a monster. But in relation   to monetary and productivity losses, Dorian's financial hit is   unlikely to be as extreme. In the Caribbean, risk-modeling firm AIR Worldwide has   estimated that insurance companies will be on the hook for   between $1.5 billion and $3 billion in payouts. Had Dorian taken   more direct aim at the U.S., much in the same way Hurricane's   Katrina and Andrew did in 2005 and 1992, respectively, the damage   figures and claim amounts would have been significantly   higher. Within the U.S., data analytics firm Planalytics estimates   that Dorian's impact   will reduce consumer spending    by as much as $1.5 billion in the Southeastern states impacted by   the storm. Occurring right in the midst of back-to-school   shopping season, Planalytics foresees a 25% decline in foot   traffic at apparel stores, a 14% drop-off in restaurant traffic,   and a 32% dip in outlet center foot traffic, according to   CNBC. But while short-term economic and productivity losses are   exceptionally common following a hurricane of Dorian's magnitude,   rarely -- if ever -- do the economic losses stemming from a   hurricane translate into long-term concerns for the U.S.   economy.   Image source: Getty Images.  Looking back on Hurricane Katrina in 2005, it led to total   damages and losses totaling about $160 billion, according to   estimates from the National Oceanic and Atmospheric   Administration. Per the St. Louis Federal Reserve, this   represented about 1% of real gross domestic product in the United   States in 2005. There were also notable reductions in oil and gas   production, as well as broader industrial production, because of   Katrina. But the St. Louis Federal Reserve also notes that while   hurricanes can have negative short-term impacts on key   macroeconomic variables,   these effects are short-lived    , with the rebuilding effort reversing these adverse effects. When comparing the more than one dozen hurricanes that have   made landfall in the U.S. since 2000 to the performance of the   stock market in the immediate wake of those landfalls, we also   find little in the way of parallels. In other words, major   macroeconomic issues took far greater precedence in driving the   market higher or lower, with the monetary impact from a hurricane   being almost entirely overlooked.  Yes, certain stocks can benefit from     hurricanes  Nevertheless, the preparation leading up to a hurricane making   landfall, as well as the cleanup and rebuilding process following   a hurricane, can create opportunities for investors to thrive and   businesses to see a pickup in demand. Chances are that if you've watched news coverage on an   approaching hurricane, you've been shown video of empty grocery   store shelves and plywood, generators, and other tools   being purchased en masse at home-improvement   stores    . While the former receives an extremely short-term benefit,   companies like   Home Depot    (NYSE: HD) and   Lowe's can realize modest long-term effects    from a major hurricane hitting the United States. That's because   Home Depot and Lowe's cater to both the do-it-yourself homeowner   tackling repairs on their own, as well as professional   contractors who will be rebuilding damaged homes and new homes in   affected areas.   Image source: Home Depot.  Home Depot has done a particularly good job of preparing for   natural disasters, including hurricanes. Following Hurricane   Andrew's devastating landfall in Florida 27 years ago, Home Depot   set about creating a distribution network of hurricane-specific   goods in coastal areas of the U.S. prone to hurricanes. Today, it   has four such distribution hubs (Baytown, Texas; Lakeland,   Florida; Cranbury, New Jersey; and Atlanta, Georgia), with   improved inventory tracking technology helping store managers and   these hubs in the event of a natural disaster. An even more direct player that tends to benefit in the wake   of hurricanes is   Clean Harbors    (NYSE: CLH) . This is a company whose purpose is to offer   disaster preparedness and cleanup    following hurricanes, oil spills, and other types of disasters   (both natural and man-made). Understand, though, that Clean Harbors' sales and   profitability aren't going to simply soar as soon as a hurricane   hits land. The company's immediate response post-hurricane   (setting up relief centers and providing non-hazardous cleanup)   tends to be of the low-margin variety. It's the longer-term   cleanup and rebuilding efforts following a devastating hurricane   or natural disaster that can allow Clean Harbors to shine.  Don't forget about insurers  On the other hand, hurricanes create losers, too, and the   insurance industry is the most front-and-center punching bag   following pretty much any major natural disaster. In 2017, for   example, $80 billion in economic damage caused by Hurricanes   Harvey, Irma, and Maria, was insured,   leading to depressed operating results    for property and casualty insurers that year. But the thing you have to realize about insurance companies is   that they prepare for economic disasters. Should a hurricane hit   land or another natural disaster strike, insurers have   justification to raise premiums across the board to recoup what   outflows they may experience from claims. Even during periods of   low claim activity, insurers are merely biding their time and   building their reserves as they await the next disaster. The   point is that the insurance business, while relatively boring, is   generally a moneymaking machine with exceptional pricing power.   Hurricanes only help to bolster that pricing power for   insurers.   Image source: Getty Images.  Take   Berkshire Hathaway    (NYSE: BRK-A) (NYSE: BRK-B)    as a perfect example    . Even though Warren Buffett's Berkshire is a conglomerate, it's   the owner of GEICO, one of the largest property and casualty   underwriters in the country, as well as reinsurance company   General Re. When reporting its third-quarter operating results in   2017 following Hurricanes Harvey, Irma, and Maria, as well as a   large earthquake in Mexico City, Berkshire's insurance   subsidiaries recorded about $3 billion in losses, with GEICO and   General Re   responsible for $920 million in operating   losses    . Now, fast-forward to 2019. During the second quarter,   Berkshire Hathaway saw the combo of GEICO and General Re   underwrite $3.4 billion more in policies than they did in Q3   2017, with the duo combining for an operating profit of $289   million. Insurers are moneymaking machines, which is   why Buffett seeks them out    . There are always going to be natural disasters. But don't   discount larger insurers' ability to raise premiums and be well   prepared for such events. Should well-branded insurers stumble   from hurricane-related losses, consider them perhaps the most   intriguing potential buy of all.   10 stocks we like better than Berkshire Hathaway (B     shares)       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Berkshire Hathaway (B     shares) wasn't one of them! That's right -- they think these 10     stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Sean Williams      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Berkshire Hathaway (B shares).     The Motley Fool has the following options: short February 2020     $205 calls on Home Depot, long January 2021 $200 calls on     Berkshire Hathaway (B shares), short January 2021 $200 puts on     Berkshire Hathaway (B shares), and long January 2021 $120 calls     on Home Depot. The Motley Fool recommends Home Depot and     Lowe's. The Motley Fool has a     disclosure policy      .  ",
    "Whether you realize it or not, you witnessed history less than   two weeks ago.",
    "After forming over the Lesser Antilles on Aug. 24, Hurricane   Dorian would go on to become one of the strongest storms ever   measured in the Atlantic. When it struck the Bahamas on Sept. 1,   it had peak sustained wind speeds of 185 mph, making it the   strongest hurricane in more than eight decades to hit the   Bahamas. It also tied for the second strongest on record in terms   of one-minute sustained wind speed.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "It absolutely ravaged the island of Grand Bahama, took aim at   Florida and the Carolinas in the U.S., and left behind an   official death toll of 45 in the Bahamas as of Monday, Sept. 9.   But keep in mind that local newspapers in the Bahamas are   claiming death tolls in the thousands, suggesting that this   \"official\" total may head significantly higher.",
    "In addition to the priceless loss of lives, hurricanes can   impact businesses, both big and small, in the areas they strike.   What impact might the U.S. economy and stock market feel from   Dorian's romp through the Atlantic and near the Eastern seaboard   of the United States? Let's take a closer look by taking a walk   down memory lane.",
    "In terms of lives lost, Dorian was a monster. But in relation   to monetary and productivity losses, Dorian's financial hit is   unlikely to be as extreme.",
    "In the Caribbean, risk-modeling firm AIR Worldwide has   estimated that insurance companies will be on the hook for   between $1.5 billion and $3 billion in payouts. Had Dorian taken   more direct aim at the U.S., much in the same way Hurricane's   Katrina and Andrew did in 2005 and 1992, respectively, the damage   figures and claim amounts would have been significantly   higher.",
    "Within the U.S., data analytics firm Planalytics estimates   that Dorian's impact   will reduce consumer spending    by as much as $1.5 billion in the Southeastern states impacted by   the storm. Occurring right in the midst of back-to-school   shopping season, Planalytics foresees a 25% decline in foot   traffic at apparel stores, a 14% drop-off in restaurant traffic,   and a 32% dip in outlet center foot traffic, according to   CNBC.",
    "But while short-term economic and productivity losses are   exceptionally common following a hurricane of Dorian's magnitude,   rarely -- if ever -- do the economic losses stemming from a   hurricane translate into long-term concerns for the U.S.   economy.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Looking back on Hurricane Katrina in 2005, it led to total   damages and losses totaling about $160 billion, according to   estimates from the National Oceanic and Atmospheric   Administration. Per the St. Louis Federal Reserve, this   represented about 1% of real gross domestic product in the United   States in 2005. There were also notable reductions in oil and gas   production, as well as broader industrial production, because of   Katrina.",
    "But the St. Louis Federal Reserve also notes that while   hurricanes can have negative short-term impacts on key   macroeconomic variables,   these effects are short-lived    , with the rebuilding effort reversing these adverse effects.",
    "When comparing the more than one dozen hurricanes that have   made landfall in the U.S. since 2000 to the performance of the   stock market in the immediate wake of those landfalls, we also   find little in the way of parallels. In other words, major   macroeconomic issues took far greater precedence in driving the   market higher or lower, with the monetary impact from a hurricane   being almost entirely overlooked.",
    "Nevertheless, the preparation leading up to a hurricane making   landfall, as well as the cleanup and rebuilding process following   a hurricane, can create opportunities for investors to thrive and   businesses to see a pickup in demand.",
    "Chances are that if you've watched news coverage on an   approaching hurricane, you've been shown video of empty grocery   store shelves and plywood, generators, and other tools   being purchased en masse at home-improvement   stores    . While the former receives an extremely short-term benefit,   companies like   Home Depot    (NYSE: HD) and   Lowe's can realize modest long-term effects    from a major hurricane hitting the United States. That's because   Home Depot and Lowe's cater to both the do-it-yourself homeowner   tackling repairs on their own, as well as professional   contractors who will be rebuilding damaged homes and new homes in   affected areas.",
    "  Image source: Home Depot. ",
    "Image source: Home Depot.",
    "Home Depot has done a particularly good job of preparing for   natural disasters, including hurricanes. Following Hurricane   Andrew's devastating landfall in Florida 27 years ago, Home Depot   set about creating a distribution network of hurricane-specific   goods in coastal areas of the U.S. prone to hurricanes. Today, it   has four such distribution hubs (Baytown, Texas; Lakeland,   Florida; Cranbury, New Jersey; and Atlanta, Georgia), with   improved inventory tracking technology helping store managers and   these hubs in the event of a natural disaster.",
    "An even more direct player that tends to benefit in the wake   of hurricanes is   Clean Harbors    (NYSE: CLH) . This is a company whose purpose is to offer   disaster preparedness and cleanup    following hurricanes, oil spills, and other types of disasters   (both natural and man-made).",
    "Understand, though, that Clean Harbors' sales and   profitability aren't going to simply soar as soon as a hurricane   hits land. The company's immediate response post-hurricane   (setting up relief centers and providing non-hazardous cleanup)   tends to be of the low-margin variety. It's the longer-term   cleanup and rebuilding efforts following a devastating hurricane   or natural disaster that can allow Clean Harbors to shine.",
    "On the other hand, hurricanes create losers, too, and the   insurance industry is the most front-and-center punching bag   following pretty much any major natural disaster. In 2017, for   example, $80 billion in economic damage caused by Hurricanes   Harvey, Irma, and Maria, was insured,   leading to depressed operating results    for property and casualty insurers that year.",
    "But the thing you have to realize about insurance companies is   that they prepare for economic disasters. Should a hurricane hit   land or another natural disaster strike, insurers have   justification to raise premiums across the board to recoup what   outflows they may experience from claims. Even during periods of   low claim activity, insurers are merely biding their time and   building their reserves as they await the next disaster. The   point is that the insurance business, while relatively boring, is   generally a moneymaking machine with exceptional pricing power.   Hurricanes only help to bolster that pricing power for   insurers.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Take   Berkshire Hathaway    (NYSE: BRK-A) (NYSE: BRK-B)    as a perfect example    . Even though Warren Buffett's Berkshire is a conglomerate, it's   the owner of GEICO, one of the largest property and casualty   underwriters in the country, as well as reinsurance company   General Re. When reporting its third-quarter operating results in   2017 following Hurricanes Harvey, Irma, and Maria, as well as a   large earthquake in Mexico City, Berkshire's insurance   subsidiaries recorded about $3 billion in losses, with GEICO and   General Re   responsible for $920 million in operating   losses    .",
    "Now, fast-forward to 2019. During the second quarter,   Berkshire Hathaway saw the combo of GEICO and General Re   underwrite $3.4 billion more in policies than they did in Q3   2017, with the duo combining for an operating profit of $289   million. Insurers are moneymaking machines, which is   why Buffett seeks them out    .",
    "There are always going to be natural disasters. But don't   discount larger insurers' ability to raise premiums and be well   prepared for such events. Should well-branded insurers stumble   from hurricane-related losses, consider them perhaps the most   intriguing potential buy of all.",
    "  10 stocks we like better than Berkshire Hathaway (B     shares)       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Berkshire Hathaway (B     shares) wasn't one of them! That's right -- they think these 10     stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Berkshire Hathaway (B     shares)       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Berkshire Hathaway (B     shares) wasn't one of them! That's right -- they think these 10     stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Sean Williams      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Berkshire Hathaway (B shares).     The Motley Fool has the following options: short February 2020     $205 calls on Home Depot, long January 2021 $200 calls on     Berkshire Hathaway (B shares), short January 2021 $200 puts on     Berkshire Hathaway (B shares), and long January 2021 $120 calls     on Home Depot. The Motley Fool recommends Home Depot and     Lowe's. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:06:00"
}