{
  "url": "https://www.nasdaq.com/article/crescent-point-to-raise-c912-mln-from-asset-sales-to-cut-debt-20190903-00846",
  "title": "Crescent Point to raise C$912 mln from asset sales to cut debt - Nasdaq.com",
  "text": [
    "Sept 3 (Reuters) - Canada'sCrescent Point Energy Corp  said on Tuesday it would exit Uinta Basin in Utah and sell parts of its assets in southeast Saskatchewan for about C$912 million ($687.01 million) as it looks to cut debt under a new management.",
    "The Uinta Basin asset, expected to produce about 20,000 barrels of oil equivalent per day (boepd) in 2020, was sold to a private operator for about C$700 million in cash, the company said without naming the buyer. ",
    "Investors have been pressing oil and gas explorers to boost cash reserves and invest more in share buybacks instead of aggressive expansion as oil prices remain volatile amid  escalating global trade tensions.",
    "The asset sales will add to its debt-adjusted funds flow per share by about 11%, Crescent said, adding that it will buy back another C$100 million worth of shares by year end.",
    "The oil and gas producer said it would sell more assets, including the remaining portion of its southeast Saskatchewan conventional assets.",
    "\"This should all resonate with investors in today's environment, with the potential for additional asset sales bringing the company's leverage position much closer to what investors are looking for in E&P companies today,\" Raymond James analysts wrote in a note.",
    "Shares of the Calgary, Alberta-based company rose 4.1% to C$4.37 per share.",
    "Including Tuesday's sale, the company said it has sold more than C$1.3 billion in assets since the new management took over in 2018.",
    "The company said it now expects 2019 annual average production of between 160,000 boepd to 164,000 boepd, slightly below its earlier forecast of 168,000 boepd to 172,000 boepd.",
    "($1 = 1.3275 Canadian dollars)"
  ],
  "published_datetime": "2019-09-03 10:47:00"
}