{
  "url": "https://www.nasdaq.com/article/5-top-mutual-funds-that-gained-over-20-ytd-cm1207404",
  "title": "5 Top Mutual Funds That Gained Over 20% YTD - Nasdaq.com",
  "text": [
    " Major U.S. market indexes pulled off an impressive year-to-date show, boosted by a string of factors such as solid economic data and a dovish Fed. Therefore, it would be prudent to pick mutual funds which invest in sectors that gained the most during this period.  Sectors That Stood Out  The broader S&P 500 index gained 15.9% on a year-to-date basis, thanks to considerable growth in sectors such as real estate, technology, utilities, consumer discretionary, consumer staples and communication services. Factors such as rise in new job additions and wage growth worked in favor of the sectors. According to the latest jobs data by the Labor department, nonfarm payrolls rose by 164,000 in July while unemployment rate remained at 3.7%. Coming to specific sectors, real estate has witnessed stellar growth so far this year, with better-than-expected existing home sales data in July and new home sales hitting a 12-year high in June on a seasonally-adjusted annualized basis. Second, the technology sector witnessed the most consistent growth over a long period and not just on a year-to-date basis. The sector has grown as much as 96.1% over the past five years, outperforming the other 10 sectors of the S&P 500. Growth in areas such as AI, machine learning and big data boosted the sector. The sector is the second top performer since January despite headwinds such as the U.S.-China trade war and global growth slowdown. Third, increased new job additions helped the consumer discretionary sector record gains. A rise in shopping, dining-out, ordering food online and other discretionary activities boosted the sector's performance.   Finally, defensive players like utilities, consumer staples and communication services gained because of trade war-induced fear among investors. The Fed's recent rate cut that pushed benchmark interest rates to the range of 2-2.25% also boosted these sectors. In fact, sectors such as utilities could post further gains ahead since it's now easier for large utility companies to engage in business expansion and other similar activities, thanks to lower rates.  Our Choices  We have, thus, selected five mutual funds that offer encouraging year-to-date returns of more than 20%. All these funds carry a Zacks Mutual Fund Rank #1 (Strong Buy) or #2 (Buy). Additionally, the minimum initial investment is less than $5000. We expect these funds to outperform their peers in the future. Now we come to the most vital question: why should investors consider mutual funds? Reduced transaction costs and diversification of portfolio without several commission charges that are associated with stock purchases are primarily why one should be parking money in mutual funds (read more:  Mutual Funds: Advantages, Disadvantages, and How They Make Investors Money  ).  Red Oak Technology Select ROGSX  fund aims for capital appreciation over a long period. The fund invests majority of its assets in stocks of established companies from the technology sector. ROGSX focuses more on large-capitalization and mid-capitalization companies although it may also invest in small-capitalization companies. This Zacks sector - Tech fund has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  . ROGSX carries a Zacks Mutual Fund Rank #1. The fund has an annual expense ratio of 0.94%, which is below the category average of 1.28%. It has year-to-date return of 25.2%.The fund has a minimum initial investment of $2000.  Fidelity Select Leisure Portfolio FDLSX  fund seeks capital growth. The fund invests majority of its assets in securities of companies engaged in leisure industries. These activities may entail design, production and/or distribution of goods or services in the said industries. FDLSX primarily invests in common stocks. This Zacks sector - Other fund has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  . FDLSX carries a Zacks Mutual Fund Rank #1. The fund has an annual expense ratio of 0.76%, which is below the category average of 1.23%. It has year-to-date return of 27.7%.The fund has no minimum initial investment.  DWS RREEF Real Estate Securities Fund - Class A RRRAX  aims for capital growth over a long period along with current income. The fund invests the majority of its assets in equity securities of REITs and real estate companies. The non-diversified fund may also invest in other securities such as short-term securities, bonds and notes. This Zacks sector - Real Estate fund has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  . RRRAX carries a Zacks Mutual Fund Rank #1. The fund has an annual expense ratio of 0.97%, which is below the category average of 1.21%. It has year-to-date return of 20.4%.The fund has a minimum initial investment of $1000.  Fidelity Select Consumer Staples Portfolio FDFAX  fund aims for capital growth. The fund invests majority of its assets in companies that are engaged in manufacturing, marketing and/or distributing consumer staples. FDFAX mostly invests in common stocks of companies. This Zacks sector - Other fund has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  . FDFAX carries a Zacks Mutual Fund Rank #2. The fund has an annual expense ratio of 0.77%, which is below the category average of 1.19%. It has year-to-date return of 22.5%.The fund has no minimum initial investment.  Fidelity Select Communication Services Portfolio FBMPX  fund seeks growth of capital. The fund invests majority of its assets in securities of companies engaged in the development, production and/or distribution of communication services. FBMPX generally invests in common stocks of companies. This Zacks sector - Tech fund has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  . FBMPX carries a Zacks Mutual Fund Rank #2. The fund has an annual expense ratio of 0.82%, which is below the category average of 1.23%. It has year-to-date return of 24.7%.The fund has no minimum initial investment.  Want key mutual fund info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing mutual funds, each week.  Get it free >>      Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Get Your Free (ROGSX): Fund Analysis Report   Get Your Free (FDLSX): Fund Analysis Report   Get Your Free (RRRAX): Fund Analysis Report   Get Your Free (FDFAX): Fund Analysis Report   Get Your Free (FBMPX): Fund Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Major U.S. market indexes pulled off an impressive year-to-date show, boosted by a string of factors such as solid economic data and a dovish Fed.",
    "Therefore, it would be prudent to pick mutual funds which invest in sectors that gained the most during this period.",
    " Sectors That Stood Out ",
    "The broader S&P 500 index gained 15.9% on a year-to-date basis, thanks to considerable growth in sectors such as real estate, technology, utilities, consumer discretionary, consumer staples and communication services.",
    "Factors such as rise in new job additions and wage growth worked in favor of the sectors. According to the latest jobs data by the Labor department, nonfarm payrolls rose by 164,000 in July while unemployment rate remained at 3.7%. Coming to specific sectors, real estate has witnessed stellar growth so far this year, with better-than-expected existing home sales data in July and new home sales hitting a 12-year high in June on a seasonally-adjusted annualized basis.",
    "Second, the technology sector witnessed the most consistent growth over a long period and not just on a year-to-date basis. The sector has grown as much as 96.1% over the past five years, outperforming the other 10 sectors of the S&P 500.",
    "Growth in areas such as AI, machine learning and big data boosted the sector. The sector is the second top performer since January despite headwinds such as the U.S.-China trade war and global growth slowdown.",
    "Third, increased new job additions helped the consumer discretionary sector record gains. A rise in shopping, dining-out, ordering food online and other discretionary activities boosted the sector's performance.  ",
    "Finally, defensive players like utilities, consumer staples and communication services gained because of trade war-induced fear among investors. The Fed's recent rate cut that pushed benchmark interest rates to the range of 2-2.25% also boosted these sectors. In fact, sectors such as utilities could post further gains ahead since it's now easier for large utility companies to engage in business expansion and other similar activities, thanks to lower rates.",
    " Our Choices ",
    "We have, thus, selected five mutual funds that offer encouraging year-to-date returns of more than 20%. All these funds carry a Zacks Mutual Fund Rank #1 (Strong Buy) or #2 (Buy). Additionally, the minimum initial investment is less than $5000. We expect these funds to outperform their peers in the future.",
    "Now we come to the most vital question: why should investors consider mutual funds? Reduced transaction costs and diversification of portfolio without several commission charges that are associated with stock purchases are primarily why one should be parking money in mutual funds (read more:  Mutual Funds: Advantages, Disadvantages, and How They Make Investors Money  ).",
    " Red Oak Technology Select ROGSX  fund aims for capital appreciation over a long period. The fund invests majority of its assets in stocks of established companies from the technology sector. ROGSX focuses more on large-capitalization and mid-capitalization companies although it may also invest in small-capitalization companies.",
    "This Zacks sector - Tech fund has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  .",
    "ROGSX carries a Zacks Mutual Fund Rank #1. The fund has an annual expense ratio of 0.94%, which is below the category average of 1.28%. It has year-to-date return of 25.2%.The fund has a minimum initial investment of $2000.",
    " Fidelity Select Leisure Portfolio FDLSX  fund seeks capital growth. The fund invests majority of its assets in securities of companies engaged in leisure industries. These activities may entail design, production and/or distribution of goods or services in the said industries. FDLSX primarily invests in common stocks.",
    "This Zacks sector - Other fund has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  .",
    "FDLSX carries a Zacks Mutual Fund Rank #1. The fund has an annual expense ratio of 0.76%, which is below the category average of 1.23%. It has year-to-date return of 27.7%.The fund has no minimum initial investment.",
    " DWS RREEF Real Estate Securities Fund - Class A RRRAX  aims for capital growth over a long period along with current income. The fund invests the majority of its assets in equity securities of REITs and real estate companies. The non-diversified fund may also invest in other securities such as short-term securities, bonds and notes.",
    "This Zacks sector - Real Estate fund has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  .",
    "RRRAX carries a Zacks Mutual Fund Rank #1. The fund has an annual expense ratio of 0.97%, which is below the category average of 1.21%. It has year-to-date return of 20.4%.The fund has a minimum initial investment of $1000.",
    " Fidelity Select Consumer Staples Portfolio FDFAX  fund aims for capital growth. The fund invests majority of its assets in companies that are engaged in manufacturing, marketing and/or distributing consumer staples. FDFAX mostly invests in common stocks of companies.",
    "This Zacks sector - Other fund has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  .",
    "FDFAX carries a Zacks Mutual Fund Rank #2. The fund has an annual expense ratio of 0.77%, which is below the category average of 1.19%. It has year-to-date return of 22.5%.The fund has no minimum initial investment.",
    " Fidelity Select Communication Services Portfolio FBMPX  fund seeks growth of capital. The fund invests majority of its assets in securities of companies engaged in the development, production and/or distribution of communication services. FBMPX generally invests in common stocks of companies.",
    "This Zacks sector - Tech fund has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  .",
    "FBMPX carries a Zacks Mutual Fund Rank #2. The fund has an annual expense ratio of 0.82%, which is below the category average of 1.23%. It has year-to-date return of 24.7%.The fund has no minimum initial investment.",
    " Want key mutual fund info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing mutual funds, each week.  Get it free >> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:48:00"
}