{
  "url": "https://www.nasdaq.com/article/dassault-aviation-keeps-2019-targets-as-profit-rises-20190904-00909",
  "title": "Dassault Aviation keeps 2019 targets as profit rises - Nasdaq.com",
  "text": [
    "PARIS, Sept 4 (Reuters) - France'sDassault Aviation  maintained its 2019 targets for plane deliveries and higher net sales on Wednesday, as it posted a rise in profit for the first half of the year.",
    "The maker of Rafale warplanes and Falcon business jets said its adjusted operating income for the first six months of the year stood at 250 million euros ($278.6 million), up from 111 million euros a year ago.",
    "Adjusted net income rose 54% to 286 million euros. Net sales rose to 3.06 billion euros, up from 1.71 billion euros a year ago.",
    "But the company saw a spike of 19 additional orders in July and August, which was enough to bring the book-to-bill ratio, or ratio of orders to deliveries, above 1 for the first eight months. The forward-looking ratio measures the strength of new business in the pipeline compared to existing production.",
    "Markets nonetheless remain dogged by uncertainties over the outcome of a U.S.-China trade war and Britain's exit from the European Union, Trappier told a news conference.",
    "Economically sensitive demand for business jets is holding up in the United States, but slipping in Europe, especially in the south, while growing quickly in Asia outside China, he said.",
    "The company took in 2.9 billion euros of new orders in the first half, up from 2.8 billion a year earlier as a major French defence maintenance contract offset lower demand for Falcon jets and lower export orders for the Rafale fighter.",
    "Dassault is preparing to deliver in September the first of 36 Rafale fighters sold by France to India following the collapse of an earlier deal for Dassault to supply 126 jets.",
    "India is considering a new competition for some 110 fighters and Trappier told journalists he hoped to do more business on the back of the earlier contract for 36 planes and local investments through the government's \"Make in India\" initiative.",
    "He called meanwhile for agreement between France, Germany and Spain over export rules for a new manned and unmanned aerial combat system, for which Dassault is a key industrial partner.",
    "Germany has put the brakes on some defence exports to the frustration of some contractors like Airbus Defence and Space.",
    "Trappier said that while U.S. arms firms can lean on a large domestic market to generate the demand needed to keep factories running economically, European companies have historically relied on exports to offset their more fragmented home markets.",
    "($1 = 0.8973 euros)"
  ],
  "published_datetime": "2019-09-04 12:46:00"
}