{
  "url": "https://www.nasdaq.com/article/went-to-a-work-conference-or-trade-show-do-this-next-cm1210345",
  "title": "Went to a Work Conference or Trade Show? Do This Next - Nasdaq.com",
  "text": [
    " A work conference or trade show can be a weird mix of   exhausting and exhilarating. Many events mix a day packed with   events with an evening filled with cocktail parties, dinners, and   informal bar gatherings. You can make new contacts, land another   client, or start to lock down your next job. That's all great, but it can leave you ready to walk off the   plane and into a few days of doing nothing afterwards. And   that's exactly the wrong thing to do. If you're just back from a   work event, now's the time to do a postmortem on the show, make   notes on what happened, and follow up on any contacts you made   (or at least make a plan to do so).   Meeting someone is only the start of getting them into your     network. Image source: Getty Images.makeArticleAd();  Keep up you momentum Meeting someone in real life can create some very positive   feelings. It's important to cement that relationship by   communicating fairly quickly after the show or conference ends.   You don't want to ask for anything. Just send a note about how it   was nice to meet the person and follow up on anything you   promised to follow up on for them. If you had agreed to set up a call or a meeting, it's fine to   get the ball rolling on that. It's important, however, to not be   pushy or try to do anything more than   grow your network    unless it was specifically discussed at the show. When a contact was more causal or social, it's also OK to   follow the person on social media -- LinkedIn makes the most   sense, but   Twitter    or   Facebook    is not inappropriate. The   Microsoft    -owned LinkedIn is for business, but it the person has work   friends on Facebook or work-related posts on Twitter, then it's   fine to use those. The goal is to   reinforce the relationship    while everyone still has warm and fuzzy feelings about the event   you all mutually attended. Think of it like a trip in high school   where you meet new people from different social groups. You may   wave at those folks in the halls for a few weeks, but if you   don't have another interaction beyond the trip, you won't become   real friends. Put the work in When you get back from a work conference or trade show, you   probably have all sorts of things you want to get done based on   what you learned or who you met. In addition to following up on   contacts, you should also make a list of action items from the   event. That might be as simple as passing on some info to your boss.   It could mean making some followup sales calls, sending out   materials, or debriefing with people who did not make the trip.   Whatever needs doing, do it, because it will become harder if you   let it sit. Yes, you deserve some time off (well, at least a weekend), and   you should take some after you have finished making the most of   your event and/or travel. Consider these post-show efforts sort   of like unpacking. If you wait to do it, it won't get any easier   (and waiting may actually cause things to get worse).   The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .   Teresa Kersten, an employee of LinkedIn, a Microsoft     subsidiary, is a member of The Motley Fool's board of     directors. Randi Zuckerberg, a former director of market     development and spokeswoman for Facebook and sister to its CEO,     Mark Zuckerberg, is a member of The Motley Fool's board of     directors.     Daniel B. Kline      owns shares of Facebook and Microsoft. The Motley Fool owns     shares of and recommends Facebook, Microsoft, and Twitter. The     Motley Fool has the following options: long January 2021 $85     calls on Microsoft. The Motley Fool has a     disclosure policy      .  ",
    "A work conference or trade show can be a weird mix of   exhausting and exhilarating. Many events mix a day packed with   events with an evening filled with cocktail parties, dinners, and   informal bar gatherings. You can make new contacts, land another   client, or start to lock down your next job.",
    "That's all great, but it can leave you ready to walk off the   plane and into a few days of doing nothing afterwards. And   that's exactly the wrong thing to do. If you're just back from a   work event, now's the time to do a postmortem on the show, make   notes on what happened, and follow up on any contacts you made   (or at least make a plan to do so).",
    "  Meeting someone is only the start of getting them into your     network. Image source: Getty Images.makeArticleAd(); ",
    "Meeting someone is only the start of getting them into your     network. Image source: Getty Images.",
    "Meeting someone in real life can create some very positive   feelings. It's important to cement that relationship by   communicating fairly quickly after the show or conference ends.   You don't want to ask for anything. Just send a note about how it   was nice to meet the person and follow up on anything you   promised to follow up on for them.",
    "If you had agreed to set up a call or a meeting, it's fine to   get the ball rolling on that. It's important, however, to not be   pushy or try to do anything more than   grow your network    unless it was specifically discussed at the show.",
    "When a contact was more causal or social, it's also OK to   follow the person on social media -- LinkedIn makes the most   sense, but   Twitter    or   Facebook    is not inappropriate. The   Microsoft    -owned LinkedIn is for business, but it the person has work   friends on Facebook or work-related posts on Twitter, then it's   fine to use those.",
    "The goal is to   reinforce the relationship    while everyone still has warm and fuzzy feelings about the event   you all mutually attended. Think of it like a trip in high school   where you meet new people from different social groups. You may   wave at those folks in the halls for a few weeks, but if you   don't have another interaction beyond the trip, you won't become   real friends.",
    "When you get back from a work conference or trade show, you   probably have all sorts of things you want to get done based on   what you learned or who you met. In addition to following up on   contacts, you should also make a list of action items from the   event.",
    "That might be as simple as passing on some info to your boss.   It could mean making some followup sales calls, sending out   materials, or debriefing with people who did not make the trip.   Whatever needs doing, do it, because it will become harder if you   let it sit.",
    "Yes, you deserve some time off (well, at least a weekend), and   you should take some after you have finished making the most of   your event and/or travel. Consider these post-show efforts sort   of like unpacking. If you wait to do it, it won't get any easier   (and waiting may actually cause things to get worse).",
    "  The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      . ",
    " The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .",
    " Teresa Kersten, an employee of LinkedIn, a Microsoft     subsidiary, is a member of The Motley Fool's board of     directors. Randi Zuckerberg, a former director of market     development and spokeswoman for Facebook and sister to its CEO,     Mark Zuckerberg, is a member of The Motley Fool's board of     directors.     Daniel B. Kline      owns shares of Facebook and Microsoft. The Motley Fool owns     shares of and recommends Facebook, Microsoft, and Twitter. The     Motley Fool has the following options: long January 2021 $85     calls on Microsoft. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:46:00"
}