{
  "url": "https://www.nasdaq.com/article/is-t-rowe-price-international-discovery-pridx-a-strong-mutual-fund-pick-right-now-cm1207717",
  "title": "Is T. Rowe Price International Discovery (PRIDX) a Strong Mutual Fund Pick Right Now? - Nasdaq.com",
  "text": [
    "Having trouble finding a Non US - Equity fund? T. Rowe Price International Discovery (PRIDX) is a possible starting point. PRIDX holds a Zacks Mutual Fund Rank of 3 (Hold), which is based on nine forecasting factors like size, cost, and past performance.",
    "Objective",
    "Zacks categorizes PRIDX as Non US - Equity, a segment stacked high with options. Non US - Equity mutual funds like to invest in companies outside of the United States, an important characteristic since global mutual funds are known to keep a good portion of their portfolio stateside. These kinds of funds can often extend across all cap levels, and will typically allocate their investments between emerging and developed markets.",
    "History of Fund/Manager",
    "PRIDX is a part of the T. Rowe Price family of funds, a company based out of Baltimore, MD. T. Rowe Price International Discovery debuted in December of 1988. Since then, PRIDX has accumulated assets of about $4.59 billion, according to the most recently available information. Justin Thomson is the fund's current manager and has held that role since December of 1998.",
    "Performance",
    "Obviously, what investors are looking for in these funds is strong performance relative to their peers. This fund carries a 5-year annualized total return of 6.98%, and it sits in the top third among its category peers. Investors who prefer analyzing shorter time frames should look at its 3-year annualized total return of 8.85%, which places it in the top third during this time-frame.",
    "When looking at a fund's performance, it is also important to note the standard deviation of the returns. The lower the standard deviation, the less volatility the fund experiences. PRIDX's standard deviation over the past three years is 12.14% compared to the category average of 10.99%. The fund's standard deviation over the past 5 years is 11.9% compared to the category average of 11.38%. This makes the fund more volatile than its peers over the past half-decade.",
    "Risk Factors",
    "Investors should always remember the downsides to a potential investment, and this segment carries some risks one should be aware of. In PRIDX's case, the fund lost 60.67% in the most recent bear market and underperformed comparable funds by 2%. These results could imply that the fund is a worse choice than its peers during a sliding market environment.",
    "Nevertheless, investors should also note that the fund has a 5-year beta of 0.78, which means it is hypothetically less volatile than the market at large. Because alpha represents a portfolio's performance on a risk-adjusted basis relative to a benchmark, which is the S&P 500 in this case, one should pay attention to this metric as well. Over the past 5 years, the fund has a negative alpha of -1.64. This means that managers in this portfolio find it difficult to pick securities that generate better-than-benchmark returns.",
    "Expenses",
    "For investors, taking a closer look at cost-related metrics is key, since costs are increasingly important for mutual fund investing. Competition is heating up in this space, and a lower cost product will likely outperform its otherwise identical counterpart, all things being equal. In terms of fees, PRIDX is a no load fund. It has an expense ratio of 1.21% compared to the category average of 1.20%. So, PRIDX is actually more expensive than its peers from a cost perspective.",
    "Investors should also note that the minimum initial investment for the product is $2,500 and that each subsequent investment needs to be at $100.",
    "Bottom Line",
    "Overall, T. Rowe Price International Discovery ( PRIDX ) has a neutral Zacks Mutual Fund rank, and in conjunction with its comparatively strong performance, average downside risk, and higher fees, this fund looks like a somewhat average choice for investors right now.",
    "For additional information on this product, or to compare it to other mutual funds in the Non US - Equity, make sure to go to www.zacks.com/funds/mutual-funds for additional information. If you want to check out our stock reports as well, make sure to go to Zacks.com to see all of the great tools we have to offer, including our time-tested Zacks Rank.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 07:00:06"
}