{
  "url": "https://www.nasdaq.com/article/mercks-keytruda-combination-gets-ec-nod-for-kidney-cancer-cm1207999",
  "title": "Merck's Keytruda Combination Gets EC Nod for Kidney Cancer - Nasdaq.com",
  "text": [
    "  Merck & Co., Inc. MRK  announced that the European Commission has approved the label expansion of its PD-L1 inhibitor, Keytruda, in combination with Pfizer's PFE  Inlyta (axitinib) for the first-line treatment of advanced or metastatic renal cell carcinoma (\"RCC\"), the most common type of kidney cancer. The approval was based on data from the pivotal phase III KEYNOTE-426 study. Data from the study showed that the Keytruda+Inlyta combination led to significant improvements in the dual primary endpoints of overall survival and progression-free survival (\"PFS\") as well as a key secondary endpoint of objective response rate (\"ORR\") compared to Pfizer's older kidney cancer treatment, Sutent (sunitinib). Data from the study showed that the combination led to a 31% reduction in the risk of progression of disease or death (PFS) and a 47% reduction in the risk of death. The ORR was 59.3% in the Keytruda+Inlyta combination arm while the same was 35.7% in the Sutent arm. Keytruda becomes the first PD-1 inhibitor to receive approval as part of any combination regimen for treating RCC in Europe. Keytruda-Inlyta combination regimen was approved in the United States for a similar indication in April. This approval marks the second label expansion for Keytruda in Europe and the eighth globally so far in 2019. Three more label expansion applications for Keytruda are under review in Europe including an expanded first-line lung cancer indication. So far this year, Merck's shares have outperformed the industry  , rising 12.6% against the 0.7% decrease for the industry.    Keytruda is a key contributor to Merck's sales growth. In a very short span of time, Keytruda has become Merck's largest product. It is already approved for use in 15 indications across 10 different tumor types in the United States. The drug generated sales of $4.9 billion in the first six months of 2019, reflecting a massive 56.6% surge year over year. Keytruda is continuously growing and expanding into new indications and markets globally. Keytruda sales are gaining particularly from strong momentum in the first-line lung cancer indication after being the first anti-PD-1 therapy approved in the first-line setting. The Keytruda development program is also progressing well and the drug is being studied for more than 30 types of cancer in more than 1000 studies, including more than 600 combination studies. Merck has collaborated with several companies including Amgen AMGN  , Incyte INCY  , Glaxo and Pfizer separately for the evaluation of Keytruda in combination with other regimens. We believe that Keytruda has strong future growth prospects based on increased utilization, approval for new indications and expectation of additional approvals worldwide.   Merck & Co., Inc. Price        Merck & Co., Inc. price    |   Merck & Co., Inc. Quote    Zacks Rank  Merck currently carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .  It's Illegal in 42 States, But Investors Will Make   Billions Legally  In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year. That's twice as much as they spend on marijuana, legally or otherwise. Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.   See these 5 \"sin stocks\" now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Pfizer Inc. (PFE): Free Stock Analysis Report   Merck & Co., Inc. (MRK): Free Stock Analysis Report   Amgen Inc. (AMGN): Free Stock Analysis Report   Incyte Corporation (INCY): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Merck & Co., Inc. MRK  announced that the European Commission has approved the label expansion of its PD-L1 inhibitor, Keytruda, in combination with Pfizer's PFE  Inlyta (axitinib) for the first-line treatment of advanced or metastatic renal cell carcinoma (\"RCC\"), the most common type of kidney cancer.",
    "The approval was based on data from the pivotal phase III KEYNOTE-426 study. Data from the study showed that the Keytruda+Inlyta combination led to significant improvements in the dual primary endpoints of overall survival and progression-free survival (\"PFS\") as well as a key secondary endpoint of objective response rate (\"ORR\") compared to Pfizer's older kidney cancer treatment, Sutent (sunitinib). Data from the study showed that the combination led to a 31% reduction in the risk of progression of disease or death (PFS) and a 47% reduction in the risk of death. The ORR was 59.3% in the Keytruda+Inlyta combination arm while the same was 35.7% in the Sutent arm.",
    "Keytruda becomes the first PD-1 inhibitor to receive approval as part of any combination regimen for treating RCC in Europe. Keytruda-Inlyta combination regimen was approved in the United States for a similar indication in April.",
    "This approval marks the second label expansion for Keytruda in Europe and the eighth globally so far in 2019. Three more label expansion applications for Keytruda are under review in Europe including an expanded first-line lung cancer indication.",
    "So far this year, Merck's shares have outperformed the industry  , rising 12.6% against the 0.7% decrease for the industry.",
    "Keytruda is a key contributor to Merck's sales growth. In a very short span of time, Keytruda has become Merck's largest product. It is already approved for use in 15 indications across 10 different tumor types in the United States.",
    "The drug generated sales of $4.9 billion in the first six months of 2019, reflecting a massive 56.6% surge year over year. Keytruda is continuously growing and expanding into new indications and markets globally.",
    "Keytruda sales are gaining particularly from strong momentum in the first-line lung cancer indication after being the first anti-PD-1 therapy approved in the first-line setting.",
    "The Keytruda development program is also progressing well and the drug is being studied for more than 30 types of cancer in more than 1000 studies, including more than 600 combination studies. Merck has collaborated with several companies including Amgen AMGN  , Incyte INCY  , Glaxo and Pfizer separately for the evaluation of Keytruda in combination with other regimens.",
    "We believe that Keytruda has strong future growth prospects based on increased utilization, approval for new indications and expectation of additional approvals worldwide.",
    "  Merck & Co., Inc. Price        Merck & Co., Inc. price    |   Merck & Co., Inc. Quote  ",
    " Merck & Co., Inc. Price ",
    " Merck & Co., Inc. price    |   Merck & Co., Inc. Quote ",
    " Zacks Rank ",
    "Merck currently carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    " It's Illegal in 42 States, But Investors Will Make   Billions Legally ",
    "In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    "That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "  See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:36:00"
}