{
  "url": "https://www.nasdaq.com/article/cybersecurity-a-top-priority-for-healthcare-3-stocks-to-watch-cm1210356",
  "title": "Cybersecurity a Top Priority for Healthcare: 3 Stocks to Watch - Nasdaq.com",
  "text": [
    " Tech behemoth Facebook's FB  escalating privacy problems have brought the need for cybersecurity to the forefront. In fact, CEOs of Amazon, AT&T and IBM have urged congressional leaders through a letter to fast-track consumer privacy legislation into law. Not just tech, data breaches have wreaked havoc on other sectors, keeping potential investors at bay.  Healthcare: A Soft Target for Data Breach  The investment world is growing edgy about putting money into the global healthcare industry that has been a major target for hackers and cybercriminals, thanks to the increasing use of wireless, Internet-and-network connected devices, portable media and electronic health records (\"EHR\"). Resultantly, Health Canada's guidance on premarket requirements for medical device cybersecurity was issued in June. Also, Australia's Therapeutics Goods Administration issued its own medical device cyber security guidance for the industry in July. The situation within the U.S. medical device industry is no different. In May, 12 million patients of lab testing giant, Quest Diagnostics DGX  faced a data breach, whose Social Security Numbers and medical information were illegally accessed for eight straight months. Earlier, Anthem ANTM  was slapped with a penalty of $16 million after a data breach that hit nearly 79 million people.  Fierce Healthcare  opines that a healthcare data breach costs a hefty $6.5 million on average. In fact, IBM Security's 2019 data breach  cost report  states that healthcare organizations continue to bear the highest costs associated with data breaches.  Intervention Necessary  Clearly, such massive breaches require the intervention of the apex governing body, the FDA. Let's take a look at the FDA's recent take on maintaining healthcare data safety. The agency has been working on combating cyber risks since 2013 with the creation of a 'cybersecurity working group'. In 2014, it issued a final guidance addressing premarket expectations related to cybersecurity. However, a rapidly evolving healthcare landscape required an updated approach. Hence, in late 2018, the FDA issued a new premarket guidance for cybersecurity management. A final approval is awaited sometime this year. Recently, it stressed on strengthening its protocol for deciding when a medical device cybersecurity vulnerability should trigger a warning from regulators. Given this backdrop, major healthcare players have started adopting cybersecurity methods to protect valuable patient data. Let's take a look at a few stocks which investors might be interested in given their efforts to significantly enhance the cybersecurity of their products and services. We have zeroed in on three stocks, each carrying a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here.   Also, each of the stocks have outperformed their respective industries in a year's time. Our first pick is Becton, Dickinson and Company BDX  , also known as BD. Headquartered in New Jersey, the MedTech giant is engaged in the development, manufacture and sale of medical devices, instrument systems and reagents. In 2017, BD had begun the Product Security Partnership Programme for improving the cyber security of medical technology and devices. Also, last December, the company received UL CAP for BD FACSLyric flow cytometer with BD FACSuite Clinical software. This ensures that all medical devices developed by the company will be in line with the UL Cybersecurity Assurance Program. In September, BD released security updates to address vulnerabilities affecting the BD Pyxis, a medication management platform. Over the past year, the stock has gained 0.8% against the industry  's 7.2% decline.    Next on our list is Cerner Corporation CERN  . The Missouri-based healthcare information technology has been dominating the headlines when it comes to using big-data based EHRs. In 2017, Cerner became the member of the National Health Information Sharing and Analysis Center to combat cybersecurity issues. Notably, this has helped the company identify, disrupt and prevent malicious attacks on its healthcare data. In fact, Cerner is able to receive and share threat data across the global health sector. Also, the company's Cybersecurity Risk Assessment program provides a foundation on which organizations can build a customized and effective security regime. Over the past year, the stock has rallied 4% against the industry  's 14.7% fall.    Investors might also keep an eye on Varian Medical Systems, Inc. VAR  . The California-based radiation Oncology giant provides radiotherapy, radiosurgery, proton therapy and brachytherapy solutions for treating cancer. A few years back, the company had acquired Gamma Basics, a cybersecurity startup. Notably, Varian needs to protect patient information used on its coveted platforms like ARIA, Eclipse, TrueBeam, which uses EHRs. In fact, recently, the company reengineered the security enhancements with its ARIA 15.1. Over the past year, the stock has rallied 1.4% against the industry  's 7.4% decline.     Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.  makeArticleAd();  Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Facebook, Inc. (FB): Free Stock Analysis Report   Cerner Corporation (CERN): Free Stock Analysis Report   Varian Medical Systems, Inc. (VAR): Free Stock Analysis Report   Anthem, Inc. (ANTM): Free Stock Analysis Report   Quest Diagnostics Incorporated (DGX): Free Stock Analysis Report   Becton, Dickinson and Company (BDX): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Tech behemoth Facebook's FB  escalating privacy problems have brought the need for cybersecurity to the forefront. In fact, CEOs of Amazon, AT&T and IBM have urged congressional leaders through a letter to fast-track consumer privacy legislation into law. Not just tech, data breaches have wreaked havoc on other sectors, keeping potential investors at bay.",
    " Healthcare: A Soft Target for Data Breach ",
    "The investment world is growing edgy about putting money into the global healthcare industry that has been a major target for hackers and cybercriminals, thanks to the increasing use of wireless, Internet-and-network connected devices, portable media and electronic health records (\"EHR\"). Resultantly, Health Canada's guidance on premarket requirements for medical device cybersecurity was issued in June. Also, Australia's Therapeutics Goods Administration issued its own medical device cyber security guidance for the industry in July.",
    "The situation within the U.S. medical device industry is no different. In May, 12 million patients of lab testing giant, Quest Diagnostics DGX  faced a data breach, whose Social Security Numbers and medical information were illegally accessed for eight straight months. Earlier, Anthem ANTM  was slapped with a penalty of $16 million after a data breach that hit nearly 79 million people.",
    " Fierce Healthcare  opines that a healthcare data breach costs a hefty $6.5 million on average. In fact, IBM Security's 2019 data breach  cost report  states that healthcare organizations continue to bear the highest costs associated with data breaches.",
    " Intervention Necessary ",
    "Clearly, such massive breaches require the intervention of the apex governing body, the FDA. Let's take a look at the FDA's recent take on maintaining healthcare data safety.",
    "The agency has been working on combating cyber risks since 2013 with the creation of a 'cybersecurity working group'. In 2014, it issued a final guidance addressing premarket expectations related to cybersecurity. However, a rapidly evolving healthcare landscape required an updated approach. Hence, in late 2018, the FDA issued a new premarket guidance for cybersecurity management. A final approval is awaited sometime this year.",
    "Recently, it stressed on strengthening its protocol for deciding when a medical device cybersecurity vulnerability should trigger a warning from regulators.",
    "Given this backdrop, major healthcare players have started adopting cybersecurity methods to protect valuable patient data.",
    "Let's take a look at a few stocks which investors might be interested in given their efforts to significantly enhance the cybersecurity of their products and services.",
    "We have zeroed in on three stocks, each carrying a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here.  ",
    "Also, each of the stocks have outperformed their respective industries in a year's time.",
    "Our first pick is Becton, Dickinson and Company BDX  , also known as BD. Headquartered in New Jersey, the MedTech giant is engaged in the development, manufacture and sale of medical devices, instrument systems and reagents.",
    "In 2017, BD had begun the Product Security Partnership Programme for improving the cyber security of medical technology and devices. Also, last December, the company received UL CAP for BD FACSLyric flow cytometer with BD FACSuite Clinical software. This ensures that all medical devices developed by the company will be in line with the UL Cybersecurity Assurance Program. In September, BD released security updates to address vulnerabilities affecting the BD Pyxis, a medication management platform.",
    "Over the past year, the stock has gained 0.8% against the industry  's 7.2% decline.",
    "Next on our list is Cerner Corporation CERN  . The Missouri-based healthcare information technology has been dominating the headlines when it comes to using big-data based EHRs.",
    "In 2017, Cerner became the member of the National Health Information Sharing and Analysis Center to combat cybersecurity issues. Notably, this has helped the company identify, disrupt and prevent malicious attacks on its healthcare data. In fact, Cerner is able to receive and share threat data across the global health sector. Also, the company's Cybersecurity Risk Assessment program provides a foundation on which organizations can build a customized and effective security regime.",
    "Over the past year, the stock has rallied 4% against the industry  's 14.7% fall.",
    "Investors might also keep an eye on Varian Medical Systems, Inc. VAR  . The California-based radiation Oncology giant provides radiotherapy, radiosurgery, proton therapy and brachytherapy solutions for treating cancer.",
    "A few years back, the company had acquired Gamma Basics, a cybersecurity startup. Notably, Varian needs to protect patient information used on its coveted platforms like ARIA, Eclipse, TrueBeam, which uses EHRs. In fact, recently, the company reengineered the security enhancements with its ARIA 15.1.",
    "Over the past year, the stock has rallied 1.4% against the industry  's 7.4% decline.",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.  makeArticleAd();  Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:10:00"
}