{
  "url": "https://www.nasdaq.com/article/ebay-or-amzn-which-is-the-better-value-stock-right-now-cm1207166",
  "title": "EBAY or AMZN: Which Is the Better Value Stock Right Now? - Nasdaq.com",
  "text": [
    " Investors looking for stocks in the Internet - Commerce sector might want to consider either eBay (EBAY) or Amazon (AMZN). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look. The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits. Right now, eBay is sporting a Zacks Rank of #2 (Buy), while Amazon has a Zacks Rank of #3 (Hold). Investors should feel comfortable knowing that EBAY likely has seen a stronger improvement to its earnings outlook than AMZN has recently. However, value investors will care about much more than just this. Value investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels. The Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors. EBAY currently has a forward P/E ratio of 14.45, while AMZN has a forward P/E of 74.53. We also note that EBAY has a PEG ratio of 1.53. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. AMZN currently has a PEG ratio of 2.31. Another notable valuation metric for EBAY is its P/B ratio of 8.12. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, AMZN has a P/B of 16.69. These are just a few of the metrics contributing to EBAY's Value grade of B and AMZN's Value grade of D. EBAY has seen stronger estimate revision activity and sports more attractive valuation metrics than AMZN, so it seems like value investors will conclude that EBAY is the superior option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  eBay Inc. (EBAY): Free Stock Analysis Report   Amazon.com, Inc. (AMZN): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors looking for stocks in the Internet - Commerce sector might want to consider either eBay (EBAY) or Amazon (AMZN). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look.",
    "The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits.",
    "Right now, eBay is sporting a Zacks Rank of #2 (Buy), while Amazon has a Zacks Rank of #3 (Hold). Investors should feel comfortable knowing that EBAY likely has seen a stronger improvement to its earnings outlook than AMZN has recently. However, value investors will care about much more than just this.",
    "Value investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels.",
    "The Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors.",
    "EBAY currently has a forward P/E ratio of 14.45, while AMZN has a forward P/E of 74.53. We also note that EBAY has a PEG ratio of 1.53. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. AMZN currently has a PEG ratio of 2.31.",
    "Another notable valuation metric for EBAY is its P/B ratio of 8.12. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, AMZN has a P/B of 16.69.",
    "These are just a few of the metrics contributing to EBAY's Value grade of B and AMZN's Value grade of D.",
    "EBAY has seen stronger estimate revision activity and sports more attractive valuation metrics than AMZN, so it seems like value investors will conclude that EBAY is the superior option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:12"
}