{
  "url": "https://www.nasdaq.com/article/malaysias-top-supermarket-chain-bans-palmoilfree-products-govt-urges-others-to-follow-20190905-00124",
  "title": "Malaysia's top supermarket chain bans 'palm-oil-free' products, govt urges others to follow - Nasdaq.com",
  "text": [
    "By Emily Chow",
    "KUALA LUMPUR, Sept 5 (Reuters) - Malaysia's biggest supermarket chain Mydin has removed products labelled palm-oil-free from its stores, its top executive said on Thursday, as part of a campaign by the world's second-largest producer of the oil to protect the commodity's image at home and abroad.",
    "The $60 billion world palm oil trade has been the target of environmentalists because of the vast areas of tropical rainforest they say have been cleared to grow the commodity. The European Union this year passed an act to phase out palm oil from renewable fuel by 2030 due to the deforestation concerns.",
    "Ameer Ali Mydin, managing director of Mydin Mohamed Holdings Bhd , said his stores removed all anti-palm products on Wednesday to convey the importance of palm oil to the Malaysian economy, Southeast Asia's third biggest.",
    "\"We must support palm oil but must also make sure (to counter) the subtle messages, the marketing and branding exercises that people do, to tell customers not to take palm oil,\" Ameer Ali told reporters at an event.",
    "\"By labelling something that there is no palm oil, you're actually telling people that palm oil is bad for you.\"",
    "He said the anti-palm products at his chain were imported, but declined to give any figures.",
    "Teresa Kok, Malaysia's minister of primary industries, welcomed Mydin's move and told reporters she hoped other supermarkets and shops in the country would follow suit. In July, the Malaysian government promised action against an international school for spreading \"anti-palm oil propaganda\". ",
    "Indonesia, the world's top palm oil producer, last month told some retailers in the capital Jakarta to remove food products with \"palm oil-free\" labels from their shops. ",
    "Palm oil is used in cooking and in items like soaps and shampoo, snack foods, pizza, bread and biodiesel. Food accounts for nearly 70% of global consumption of palm oil.",
    "Malaysia and Indonesia key palm oil statistics interactive"
  ],
  "published_datetime": "2019-09-05 04:00:00"
}