{
  "url": "https://www.nasdaq.com/article/sum-up-the-pieces-fad-could-be-worth-82-cm1207115",
  "title": "Sum Up The Pieces: FAD Could Be Worth $82 - Nasdaq.com",
  "text": [
    "Looking at the underlying holdings of the ETFs in our coverage universe at ETF Channel  , we have compared the trading price of each holding against the average analyst 12-month forward target price, and computed the weighted average implied analyst target price for the ETF itself. For the First Trust Multi Cap Growth AlphaDEX Fund ETF (Symbol: FAD), we found that the implied analyst target price for the ETF based upon its underlying holdings is $81.58 per unit.      With FAD trading at a recent price near $73.85 per unit, that means that analysts see 10.46% upside for this ETF looking through to the average analyst targets of the underlying holdings. Three of FAD's underlying holdings with notable upside to their analyst target prices are uniQure N.V. (Symbol: QURE), Corcept Therapeutics Inc (Symbol: CORT), and CenterState Bank Corp (Symbol: CSFL). Although QURE has traded at a recent price of $55.36/share, the average analyst target is 44.18% higher at $79.82/share. Similarly, CORT has 18.56% upside from the recent share price of $12.23 if the average analyst target price of $14.50/share is reached, and analysts on average are expecting CSFL to reach a target price of $25.75/share, which is 17.85% above the recent price of $21.85. Below is a twelve month price history chart comparing the stock performance of QURE, CORT, and CSFL:  makeArticleAd();     Below is a summary table of the current analyst target prices discussed above:       Are analysts justified in these targets, or overly optimistic about where these stocks will be trading 12 months from now? Do the analysts have a valid justification for their targets, or are they behind the curve on recent company and industry developments? A high price target relative to a stock's trading price can reflect optimism about the future, but can also be a precursor to target price downgrades if the targets were a relic of the past. These are questions that require further investor research.   10 ETFs With Most Upside To Analyst Targets »  ",
    "  10 ETFs With Most Upside To Analyst Targets » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:10:54"
}