{
  "url": "https://www.nasdaq.com/article/anxious-about-abbvie-here-are-4-things-you-should-know-cm1210850",
  "title": "Anxious About AbbVie? Here Are 4 Things You Should Know - Nasdaq.com",
  "text": [
    "AbbVie (NYSE: ABBV) went from having a great year in 2017 to having a mediocre one in 2018 to having a downright dismal one so far in 2019. Investors have been worried for years about what would happen when the company's top-selling drug, Humira, faced biosimilar competition. That day has arrived -- and many investors are still worried.",
    "Today, there are even more things investors are concerned about with AbbVie in addition to Humira. If you're among those anxious about AbbVie, here are four things you should know.",
    "Image source: Getty Images.",
    "Almost immediately after AbbVie announced its plans to acquire Allergan (NYSE: AGN) , the deal was heralded as a $63 billion mistake . While I was surprised about AbbVie's decision to buy Allergan, I really don't think it stinks as much as some expect. Actually, my view is that the Allergan acquisition won't be an albatross around AbbVie's neck at all.",
    "The deal makes AbbVie less risky in some ways. Humira will contribute a much lower amount of the company's total revenue after it gobbles up Allergan. AbbVie isn't overpaying for the acquisition. Sure, the company is taking on additional debt to finance the transaction. But I believe AbbVie will be able to pay down between $15 billion and $18 billion within the next couple of years as it is targeting with even more deleveraging after that.",
    "What about Allergan's potential opioid litigation risk? AbbVie CEO Rick Gonzalez stated at this week's Morgan Stanley Global Healthcare Conference that the company looked into this thoroughly before making a decision. Allergan sold off its generic business that included opioid drugs. Gonzalez said that AbbVie's team is \"very comfortable\" with the protection Allergan has resulting from that divestiture. He also noted that Allergan's market share for its proprietary opioids is relatively low and that the company has \"behaved quite responsibly in how they marketed those products.\"",
    "There have been new developments over the last couple of months related to opioid litigation. However, Gonzalez said that nothing has happened to change AbbVie's comfort level with the Allergan deal. He also noted that while AbbVie's parent company, Abbott Labs , co-promoted Purdue Pharma's Oxycontin in the past, AbbVie has no liability from those efforts.",
    "Political wrangling in Washington, D.C. over potential drug pricing changes have also rattled some investors. To be sure, this is a legitimate risk associated with investing in pharmaceutical stocks right now. But I don't think AbbVie shareholders should be overly concerned.",
    "For one thing, AbbVie has already taken steps to reduce its dependence on drug price increases. The company has committed to increasing prices no more than once per year and by only single-digit percentages.",
    "There's also a possibility that changes could even help AbbVie to some extent. For example, Gonzalez expressed his opinion that legislation being reviewed by the U.S. Senate Finance Committee could help alleviate some of the problems for Medicare Part D patients who currently pay sky-high out-of-pocket expenses, particularly for specialty drugs like Humira.",
    "A potential House of Representatives bill leaked on Tuesday could be more problematic for companies like AbbVie. However, judging from the market reaction (AbbVie's shares jumped more than 2% on Tuesday while the broader market fell slightly), I don't think many observers think the House proposals will ultimately be enacted.",
    "Imbruvica is a tremendously important component of AbbVie's growth strategy. The blood cancer drug continues to deliver impressive sales growth. AbbVie thinks that Imbruvica, along with Venclexta, gives it a dominant position in the hematology-oncology market.",
    "There have been some concerns, though, that other BTK inhibitors could threaten Imbruvica. Those worries appear to have been overblown.",
    "Rick Gonzalez brought this up during his comments at the Morgan Stanley conference. He said that AbbVie doesn't view a new rival BTK inhibitor as showing differentiation versus Imbruvica. As such, he maintained that the company doesn't view it as a significant competitive threat to Imbruvica.",
    "AbbVie's risk level has decreased considerably, in my view, now that the company has won FDA approvals for both Skyrizi in treating psoriasis and Rinvoq in treating rheumatoid arthritis. Market researcher EvaluatePharma ranked both drugs in its top three new drug launches of 2019 .",
    "Skyrizi appears to be off to a great start. Gonzalez stated on Tuesday that the drug is already capturing a significant market share just a few months into its launch. He added that early numbers from the launch for Rinvoq indicate that it will achieve a similar performance to Skyrizi. Gonzalez said that AbbVie remains \"absolutely comfortable\" with its previous projections that Skyrizi and Rinvoq would deliver combined risk-adjusted sales of more than $10 billion by 2025.",
    "Another drug that AbbVie projected would generate peak sales of $2 billion -- Orilissa -- is getting off to a slower-than-expected start, though. Gonzalez acknowledged that it's been challenging to motivate younger women to make a special visit to their gynecologists to talk about the new treatment for managing endometriosis pain. He also said that gynecologists aren't accustomed to writing prior authorizations, which are required by managed care companies for approval of Orilissa.",
    "But Gonzalez stated that AbbVie is working on ways to address both of these issues. He also thinks that should Orilissa win approval for treating uterine fibroids as anticipated, the issues won't be as big for the new indication. AbbVie continues to believe that Orilissa is a multibillion-dollar product over the long run.",
    "10 stocks we like better than AbbVie\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and AbbVie wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Keith Speights owns shares of AbbVie. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 06:00:00"
}