{
  "url": "https://www.nasdaq.com/article/european-stocks-hit-onemonth-highs-on-trade-optimism-20190905-00094",
  "title": "European stocks hit one-month highs on trade optimism - Nasdaq.com",
  "text": [
    "By Amy Caren Daniel",
    "Sept 5 (Reuters) - European shares rose for a second straight day on Thursday, after China said it would hold trade talks with the United States, raising hopes that the two countries will make progress on a dispute that has put major economies at risk of recession.",
    "China'sCommerce Ministry said its trade team will consult with their U.S. counterparts in mid-September in preparation for negotiations in early October, and both sides agreed to take actions to create favourable conditions. ",
    "\"Investors are hoping that we see a positive breakthrough, and the very least progress to another phase that could ultimately lead to a trade deal,\" Erlam said, but cautioned about expecting too much out of the talks.",
    "The pan-European STOXX 600 index  rose 0.33% by 0750 GMT and hit its highest level since Aug. 1 in early trading, after rising nearly 0.9% in the previous session.",
    "Auto shares  rose 1.41% and technology companies <.SX8P> gained 1.58%, as the tariff reprieve triggered relief for companies most at risk from slower global trade.",
    "Though the sentiment seemed to be risk-on with investors moving out of safe-haven assets such as Gold and Japanese Yen, broader worries lingered. ",
    "German industrial orders fell more than expected in July on weak demand from abroad, data showed on Thursday, suggesting that struggling manufacturers could tip Europe's biggest economy into a recession in the third quarter. ",
    "\"Today's data is the first hard data for the third quarter and it doesn't bode well at all,\" Carsten Brzeski, Chief Economist at ING in Germany, wrote in a note.",
    "\"Since the start of the year, domestic orders have actually dropped more than foreign orders, suggesting that global woes have reached the domestic economy.\"",
    "However, Germany's trade-sensitive DAX rose 0.64%.",
    "Fears of a global recession triggered by the drawn-out trade war between the United States and China led markets to fall 1.6% in August, the biggest monthly drop since the sell-off in May.",
    "Market participants will now be watching out for the European Central Bank meeting next week that is widely expected to lower interest rates, as policymakers seek to head off a slowdown caused by the protracted U.S.-China trade war.",
    "France engine maker Safran  jumped 7.20% after the company raised its full-year profit forecast, while Dassault Aviation  gained 8.23% after the maker of Rafale warplanes and Falcon business jets affirmed its view of higher net sales in 2019. ",
    "Together they helped drive a 1.17% increase in the industrial goods and services sector.",
    "Britian's FTSE 100  lagged the broader market, down slightly as a number of UK companies went ex-dividend including mining heavyweight Glencore ."
  ],
  "published_datetime": "2019-09-05 03:19:00"
}