{
  "url": "https://www.nasdaq.com/article/whats-in-store-for-science-applications-saic-q2-earnings-cm1206778",
  "title": "What's in Store for Science Applications (SAIC) Q2 Earnings? - Nasdaq.com",
  "text": [
    "  Science Applications International Corporation SAIC  is set to report second-quarter fiscal 2020 earnings on Sep 5. The company's earnings surpassed the Zacks Consensus Estimate in each of the trailing four quarters, the average being 19.4%. In the las t report  ed quarter, the company delivered earnings of $1.36 per share, beating the Zacks Consensus Estimate of $1.21 and also improving 11% year over year. Moreover, revenues surged 37% from the year-ago quarter to $1.62 billion and further outpaced the Zacks Consensus Estimate of $1.61 billion, driven by the acquisition of Engility. For the fiscal second quarter, the Zacks Consensus Estimate for revenues is pegged at $1.64 billion, indicating a 47.1% improvement from the year-ago reported figure. For earnings, the consensus estimate stands at $1.27, suggesting a rise of 12.4% from the prior-year reported number. Let's see how things are shaping up prior to this announcement.  Factors to Consider  Science Applications' second-quarter fiscal 2020 results are likely to benefit from its strong product portfolio, which is aiding contract wins. The company's capability to sustain its existing contracts coupled with the newly-awarded ones across the customer portfolio is likely to be a steady tailwind. Moreover, the integration of Engility buyout is expected to be a key driver this earnings season. In the last reported quarter, excluding Engility, revenues dipped 2.8% year over year. The acquisition of Engility is also likely to boost the company's margin profile and cash flow generation. However, revenue dis-synergies due to the elimination of prime sub-duplicate revenues persist as a headwind. Further, higher interest expenses are an overhang on the bottom line.   Science Applications International Corporation Price     and EPS Surprise      Science Applications International Corporation   price-eps-surprise    |   Science Applications International Corporation   Quote    What Our Model Says  The proven Zacks model clearly shows that a company with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) has maximum chances of beating estimates if it also has a positive Earnings ESP  . Zacks Rank #4 (Sell) or 5 (Strong Sell) stocks are best avoided. You can uncover the best stocks to buy or sell before they're reported with our Earnings ESP Filter  . Science Applications currently carries a Zacks Rank #3, which increases the predictive power of ESP. However, its Earnings ESP of 0.00% in the combination makes surprise prediction difficult.  Stocks to Consider  Here are some stocks worth considering as our model shows that these have the right combination of elements to beat on earnings in their upcoming releases: General Mills, Inc. GIS  has an Earnings ESP of +0.37% and a Zacks Rank #2. You can see  the complete list of today's Zacks #1 Rank stocks   here  .  EastGroup Properties, Inc. EGP  has an Earnings ESP of +0.35% and a Zacks Rank of 2. Dril-Quip, Inc. DRQ  has an Earnings ESP of +36.79% and is Zacks #2 Ranked.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Science Applications International Corporation (SAIC): Free Stock Analysis Report   General Mills, Inc. (GIS): Free Stock Analysis Report   Dril-Quip, Inc. (DRQ): Free Stock Analysis Report   EastGroup Properties, Inc. (EGP): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Science Applications International Corporation SAIC  is set to report second-quarter fiscal 2020 earnings on Sep 5.",
    "The company's earnings surpassed the Zacks Consensus Estimate in each of the trailing four quarters, the average being 19.4%.",
    "In the las t report  ed quarter, the company delivered earnings of $1.36 per share, beating the Zacks Consensus Estimate of $1.21 and also improving 11% year over year.",
    "Moreover, revenues surged 37% from the year-ago quarter to $1.62 billion and further outpaced the Zacks Consensus Estimate of $1.61 billion, driven by the acquisition of Engility.",
    "For the fiscal second quarter, the Zacks Consensus Estimate for revenues is pegged at $1.64 billion, indicating a 47.1% improvement from the year-ago reported figure. For earnings, the consensus estimate stands at $1.27, suggesting a rise of 12.4% from the prior-year reported number.",
    "Let's see how things are shaping up prior to this announcement.",
    " Factors to Consider ",
    "Science Applications' second-quarter fiscal 2020 results are likely to benefit from its strong product portfolio, which is aiding contract wins. The company's capability to sustain its existing contracts coupled with the newly-awarded ones across the customer portfolio is likely to be a steady tailwind.",
    "Moreover, the integration of Engility buyout is expected to be a key driver this earnings season. In the last reported quarter, excluding Engility, revenues dipped 2.8% year over year.",
    "The acquisition of Engility is also likely to boost the company's margin profile and cash flow generation.",
    "However, revenue dis-synergies due to the elimination of prime sub-duplicate revenues persist as a headwind. Further, higher interest expenses are an overhang on the bottom line.",
    "  Science Applications International Corporation Price     and EPS Surprise      Science Applications International Corporation   price-eps-surprise    |   Science Applications International Corporation   Quote  ",
    " Science Applications International Corporation Price     and EPS Surprise ",
    " Science Applications International Corporation   price-eps-surprise    |   Science Applications International Corporation   Quote ",
    " What Our Model Says ",
    "The proven Zacks model clearly shows that a company with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) has maximum chances of beating estimates if it also has a positive Earnings ESP  . Zacks Rank #4 (Sell) or 5 (Strong Sell) stocks are best avoided. You can uncover the best stocks to buy or sell before they're reported with our Earnings ESP Filter  .",
    "Science Applications currently carries a Zacks Rank #3, which increases the predictive power of ESP. However, its Earnings ESP of 0.00% in the combination makes surprise prediction difficult.",
    " Stocks to Consider ",
    "Here are some stocks worth considering as our model shows that these have the right combination of elements to beat on earnings in their upcoming releases:",
    "General Mills, Inc. GIS  has an Earnings ESP of +0.37% and a Zacks Rank #2. You can see  the complete list of today's Zacks #1 Rank stocks   here  . ",
    "EastGroup Properties, Inc. EGP  has an Earnings ESP of +0.35% and a Zacks Rank of 2.",
    "Dril-Quip, Inc. DRQ  has an Earnings ESP of +36.79% and is Zacks #2 Ranked.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:43:00"
}