{
  "url": "https://www.nasdaq.com/article/defying-trump-us-senators-renew-pressure-on-saudis-with-focus-on-yemen-20190911-00688",
  "title": "Defying Trump, U.S. senators renew pressure on Saudis with focus on Yemen - Nasdaq.com",
  "text": [
    "By Patricia Zengerle",
    "WASHINGTON, Sept 11 (Reuters) - Republican and Democratic U.S. senators revived an effort to pressure Saudi Arabia over human rights, by pushing the country to fulfill its commitment to provide $750 million this year to help the people of Yemen, according to a letter seen by Reuters on Wednesday.",
    "The letter sent on Tuesday to Saudi Crown Prince Mohammad bin Salman acknowledged past Saudi contributions for aid in Yemen, but said the Saudis have provided just a small share of a current $750 million commitment.",
    "\"If funding is not received by the end of October, 5 million people - in a country facing the largest cholera outbreak in modern history - will lose access to clean water,\" the letter said.",
    "The war in Yemen, where the Saudis and the United Arab Emirates lead an air campaign against Iran-backed Houthi rebels, is considered one of the world's worst humanitarian disasters.",
    "U.N. officials have called out several countries for failing to meet aid commitments. On Aug. 21, the world body warned that 22 \"life-saving\" aid programs in Yemen would be forced to close if countries' funds were not provided. ",
    "The letter was led by Democratic Senator Chris Murphy and Republican Senator Todd Young, who areamong the most vocal U.S. lawmakers pressing for a strong U.S. response to Saudi Arabia over its human rights record, including its role in the war in Yemen.",
    "Many members of Congress, including some of Trump's fellow Republicans, have criticized the president's close ties to Riyadh for months and backed several efforts - which have failed so far - to stop him from selling arms to the kingdom without congressional approval or providing support to the Saudi-UAE air campaign. ",
    "Murphy and Young plan to force another Senate vote on U.S. security assistance to Saudi Arabia, using a provision of U.S.  rights law that allows Congress to request a vote on any country's human rights practices.",
    "A Senate aide noted that concern about Saudi Arabia is fueled partly by the upcoming anniversary of the October 2018 murder of Saudi journalist Jamal Khashoggi, a U.S. resident and Washington Post columnist, at a Saudi consulate in Turkey.",
    "The letter was also signed by Republicans Rand Paul, Jerry Moran and Susan Collins, as well as Democrats Benjamin Cardin, Christopher Coons and Cory Booker.",
    "The Saudi embassy in Washington did not immediately respond to a request for comment."
  ],
  "published_datetime": "2019-09-11 02:57:00"
}