{
  "url": "https://www.nasdaq.com/article/argentine-peso-rises-on-capital-controls-trade-woes-impede-latam-stocks-20190903-00878",
  "title": "Argentine peso rises on capital controls; trade woes impede Latam stocks - Nasdaq.com",
  "text": [
    "By Agamoni Ghosh",
    "Sept 3 (Reuters) - Argentina's peso gained for a second day on Tuesday following capital controls amid a deepening financial crisis, while ongoing U.S.-China trade tensions dented Latin American stocks.",
    "The peso  opened sharply stronger, up 6% officially against the dollar, marking Wall Street's first reaction to Argentina's new currency controls after a long holiday weekend in the United States.",
    "\"The black market rate is lower then the official suggesting that there is still some pressures there,\" said Edward Glossop, Latam economist at Capital Economics.",
    "\"History suggests that capital controls do sometimes help to alleviate pressure on currencies in the near term, but over the longer term when people start finding loopholes in the system.  That's when it makes it more difficult.\"",
    "The controls come after markets reacted sharply to rating downgrades by Standard and Poor, Fitch and Moody's, after the government announced its plans to \"re-profile\" some $100 billion in debt.",
    "MSCI's index of Latin American stocks  was 0.2% lower, in-line with global equities as investors fret about Washington and China's struggle to schedule a meeting this month to renew trade talks. MKTS/GLOB",
    "The Merval stock index in Buenos Aires  shed 3.7%after having closed 6% higher in the previous session.",
    "Stocks in Chile  declined 0.7%, while the peso  fell to its lowest since January 2016 ahead of a decision by the central bank's on monetary policy.",
    "\"We think that the central bank will lower the monetary policy rate by 50bps, to 2.00%, in today's monetary policy,\" said analysts from Credit Suisse in a note.",
    "Key Latin American stock indexes and currencies at 1430 GMT"
  ],
  "published_datetime": "2019-09-03 10:58:00"
}