{
  "url": "https://www.nasdaq.com/article/bored-at-work-3-moves-to-make-cm1206783",
  "title": "Bored at Work? 3 Moves to Make - Nasdaq.com",
  "text": [
    "You've been at your job for a while now, and you're reasonably content. You like the company, your colleagues are great, the compensation is good, and the benefits are outstanding. There's just one problem: You're bored more often than you'd like to be.",
    "If that's the case, you're in good company. An OfficeTeam survey released in late 2017 found that employees are bored at work for 10.5 hours a week on average. In the course of a 40-hour workweek, that means employees spend roughly a quarter of their time uninterested in what they're doing.",
    "The problem with too much on-the-job boredom is that it can hurt your outlook and zap your motivation. Once that happens, your performance might decline, and your career might take a nasty hit to follow. Not good.",
    "Image source: Getty Images.",
    "A better solution is to be proactive about making your job more exciting. Here's how.",
    "Many jobs lead to repetition -- you're hired to do a specific set of tasks, and so you spend your days focused on them without much reprieve. After awhile, that can get old. If you've been growing increasingly bored at work, try shaking things up with a new project. The tricky thing is that you'll likely need to come up with an idea yourself. But if you present that idea and it's approved, you'll probably get first dibs on the initiative in question, which will give you something engaging to do.",
    "Maybe you're itching to be assigned more-interesting tasks at work. To get there, you'll need to prove to your manager that you can handle them. Growing your skills could therefore be your ticket to less boredom and more satisfaction, so think about the areas you're lacking in and work on them. For example, if you're not great with attention to detail, your boss might hesitate to assign high-profile projects to you. But if you shape up in that regard, you might start getting those more-desirable assignments.",
    "The same holds true for skills that are specific to your job. Learning a new project management program, for example, could be just the thing that prompts your boss to choose you when the next big initiative kicks off.",
    "Chances are, your boss isn't a mind reader. If you're bored at work but don't let on about it to avoid coming off as a complainer, your manager won't be able to help you. The answer: Speak up. Schedule a meeting with your boss, explain how you've been feeling, and ask for an opportunity to do a few different things. Be ready to propose a few new tasks to add to your plate, and also go in with a compelling argument for unloading some of the work you've grown to detest, so that the burden isn't entirely on your manager.",
    "Too much work-related boredom can not only make you unhappy, but also hurt your productivity and compromise your job in the process. So don't resign yourself to that existence. Take steps to eliminate some boredom, even if it means stepping outside your comfort zone.",
    "The $16,728 Social Security bonus most retirees completely overlook\r\n If you're like most Americans, you're a few years (or more) behind on your retirement savings. But a handful of little-known \"Social Security secrets\" could help ensure a boost in your retirement income. For example: one easy trick could pay you as much as $16,728 more... each year! Once you learn how to maximize your Social Security benefits, we think you could retire confidently with the peace of mind we're all after. Simply click here to discover how to learn more about these strategies .",
    "The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:18:00"
}