{
  "url": "https://www.nasdaq.com/article/to-gift-or-not-to-gift-cm1210058",
  "title": "To Gift or Not to Gift - Nasdaq.com",
  "text": [
    "In estate planning, giving away assets during your lifetime has traditionally been used to help lower estate taxes when you die. However, the federal estate tax exemption amount (the amount under which federal estate taxes do not apply) is currently $11.4 million per person and has been increasing each year due to inflation indexing, so federal estate taxes only apply to 0.1% of people.",
    "The federal exemption amount is scheduled to fall to approximately $6 million (when taking into account future estimated increases for inflation) per person in 2026 (unless Congress changes the law), and even then only about 0.2% of people will be affected.",
    "So, while taking action to avoid federal estate taxes is not necessary for over 99% of the population, there are at least three reasons why gifting may still make sense for you and your family:",
    "While federal estate taxes aren't a problem for the vast majority of people, state estate taxes are another story. Twelve states and the District of Columbia currently have a state estate tax, and their exemptions are much less generous than the federal limits -- with some as low as $1 million. (See 9 States with the Scariest Death Taxes .) In those states, gifting can help reduce the state estate tax. For example, in Massachusetts, lifetime gifts are not subject to the Massachusetts estate tax. As a result, by making gifts, the value of the assets you own when you pass will be reduced, and the state estate tax will be lowered.",
    "However, before giving away assets to reduce state estate taxes (which are often graduated and never exceed a top rate of 20%), you need to keep in mind the issue of unrealized capital gains and what is known as the \"step up in basis.\" At death the fair market value of most assets (except most notably retirement accounts) becomes the tax basis of those assets. Because most assets appreciate during life, the basis of assets is said to \"step up\" to the fair market value, essentially wiping away all potential capital gains taxes. This is true even if your estate is not large enough to pay any federal estate tax.",
    "When you give away assets, instead of a step up in basis there is a carryover basis, meaning the recipient takes your tax basis. That means, if you paid $10 for your stock and it was worth $100 when you gifted it, a recipient who sold the shares would pay taxes on the $90 of gain. However, if you don't sell the stock in your lifetime, the cost basis resets to the value of the stock on the day you die. So, for example, if you had low basis stock, it could make sense to hold the stock until you die if the state estate tax would be lower than the potential capital gains taxes if the asset were sold.",
    "An important consideration here is that in some cases capital gain taxes can be imposed at higher rates than state estate taxes. Federal capital gains tax rates are 0%, 15% or 20% depending on your income and filing status. There's also state income tax to consider, plus an additional 3.8% Medicare tax for higher income earners. (For example, in Massachusetts -- where the state income tax rate is about 5% for individuals in a high income tax bracket -- combined capital gains tax rates can equal almost 30%.) Therefore, while gifting to save on estate taxes is possible, it should be analyzed carefully to make sure you don't inadvertently expose yourself or your loved ones to capital gains taxes.",
    "Gifting can help protect assets from having to be spent down to later qualify for Medicaid to pay for nursing home care. If you do not have private long-term care insurance, there are two other options to help pay for your nursing home care. First, you can self-insure, meaning you use your own assets to pay for your care. Second, if you qualify both financially and medically, the federal Medicaid system (administered by each state under a different name) will pay for your nursing home care.",
    "To qualify financially, an individual can have very few countable assets: $2,000 for a single individual in a nursing home and about $128,000 for a married couple with a healthy spouse still living at home. (When both spouses are in a nursing home, the limit is $3,000. ) And, the Medicaid program looks back at five years of financial records to make sure you have not given away assets that could have otherwise been used to help pay for your nursing home care. Gifts within this five-year look back period will disqualify you from receiving Medicaid benefits for a period of time. However, assets that are given away more than five years before you apply for benefits are not countable. These gifts can help you save your assets (such as your family home) for your loved ones.",
    "It is especially important to consult with an attorney who is experienced in elder law issues if you are contemplating giving away assets for this reason.",
    "Many individuals simply want to help their loved ones while they are alive to see it. Common gifts include down payments for homes, help with rent, health insurance or other monthly expenses, and education. When making these often-large gifts, it is important to consider issues such as the amount involved, the intended use of the funds, and whether the recipient has any creditor issues or if they might get divorced.",
    "For example, gifts for education are typically best made directly to the educational institution, because under federal law they qualify for a gift tax exclusion. Gifts for big-ticket items, such has houses, should be made in a consultation with an attorney. If you give your child and his or her spouse a home and they get divorced, the house could need to be divided even if your child is the only owner.",
    "In addition, gifts in excess of $15,000 per year (known as the annual exclusion) to the same recipient usually require the filing of a gift tax return, even if you will not owe any gift tax. As long as your total gifts during your life are less than $11.4 million (the current federal exemption amount), you will not owe a gift tax. However, you will need to file a gift tax return with the IRS (due when you file your income tax return) to report the use of the exemption during your life.",
    "As you can see, many reasons still exist to gift your assets. Rules can be complicated, so in order to avoid unintended consequences, it's always best to consult with a financial adviser, accountant or attorney.",
    "Comments are suppressed in compliance with industry guidelines. Click here to learn more and read more articles from the author.",
    "This article was written by and presents the views of our contributing adviser, not the Kiplinger editorial staff. You can check adviser records with the SEC or with FINRA .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-10 08:30:50"
}