{
  "url": "https://www.nasdaq.com/article/bullish-outlook-ebbs-for-canadian-dollar-as-market-eyes-boc-rate-cuts-20190905-00486",
  "title": "Bullish outlook ebbs for Canadian dollar as market eyes BoC rate cuts - Nasdaq.com",
  "text": [
    "By Fergal Smith",
    "TORONTO, Sept 5 (Reuters) - The Canadian dollar will strengthen less than previously thought against its U.S. counterpart over the coming year, held back by global trade uncertainty and expected interest rate cuts by the Bank of Canada, a Reuters poll predicted.",
    "Thursday's poll of more than 40 currency analysts expects the Canadian dollar  to weaken to 1.33 per U.S. dollar, or 75.19 U.S. cents, in one month from about 1.3225 on Wednesday, according to median forecasts.",
    "The less bullish outlook for the loonie comes as the Bank of Canada faces increased pressure from a weakening global economy to follow the path of global peers, such as the U.S. Federal Reserve, in cutting interest rates.",
    "On Wednesday, Canada's central bank left its benchmark interest rate on hold at 1.75% and made no mention of future cuts. Still, it said the escalating U.S.-China trade dispute was doing more damage to the world economy than it had previously forecast. ",
    "A Reuters poll from before the interest rate decision showed economists were almost evenly divided on whether the Bank of Canada will wait until early 2020 to lower interest rates or does so this year. ",
    "\"We expect a faster pace of loosening in Canada than priced into markets, with investors coming round to our view after the (central) bank's October meeting,\" said Stephen Brown, senior Canada economist at Capital Economics.",
    "Money markets see about a 50% chance of a rate cut at the Oct. 30 announcement. A Canadian federal election is due to take place before that date. ",
    "\"We are also wary that slowing global GDP and a further escalation of the U.S.-China trade war will cause investors to sell the loonie, which tends to be one of the most sensitive currencies to changes in global trade,\" Brown said.",
    "Canada exports a lot of commodities, including oil. Data on Wednesday showed Canada posted a wider-than-expected trade deficit in July as imports rose and exports declined, a sign that a boost to the domestic economy from trade in the second quarter may not be repeated. ",
    "Inversion of Canada's yield curve by the most in nearly two decades could add to pressure on the central bank to cut interest rates. ",
    "Still, some forecasters expect rate cuts by the Bank of Canada to be outpaced by Federal Reserve easing and for that to support the loonie next year.",
    "\"With the (U.S.) dollar broadly at a high value and increasingly stretched versus certain currencies,\" we see some recovery in the Canadian dollar in the first half of 2020, said Derek Halpenny, head of research, global markets EMEA and international securities at MUFG Bank."
  ],
  "published_datetime": "2019-09-05 08:20:00"
}