{
  "url": "https://www.nasdaq.com/article/denbury-resources-dnr-in-focus-stock-moves-54-higher-cm1210561",
  "title": "Denbury Resources (DNR) in Focus: Stock Moves 5.4% Higher - Nasdaq.com",
  "text": [
    "  Denbury Resources Inc. DNR  was a big mover last session, as the company saw its shares rise more than 5% on the day. The move came on solid volume too with far more shares changing hands than in a normal session. This breaks the recent trend of the company, as the stock is now trading above the volatile price range of $0.9700 to $1.2900 in the past one-month time frame.  makeArticleAd();  The company has seen no changes when it comes to estimate revision over the past few weeks, while the Zacks Consensus Estimate for the current quarter has also remained unchanged. The recent price action is encouraging though, so make sure to keep a close watch on this firm in the near future.    Denbury Resources currently has a Zacks Rank #3 (Hold) while its Earnings ESP  is negative.   Denbury Resources Inc. Price         Denbury Resources Inc. price    |   Denbury Resources Inc. Quote   Investors interested in the Oil and Gas - Exploration and Production - United States industry may consider Halcon Resources Corporation HKRSQ  , which has a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here.   Is DNR going up? Or down? Predict to see what others think: Up  or Down   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Denbury Resources Inc. (DNR): Free Stock Analysis Report   Halcon Resources Corporation (HKRSQ): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " Denbury Resources Inc. DNR  was a big mover last session, as the company saw its shares rise more than 5% on the day. The move came on solid volume too with far more shares changing hands than in a normal session. This breaks the recent trend of the company, as the stock is now trading above the volatile price range of $0.9700 to $1.2900 in the past one-month time frame.  makeArticleAd();  The company has seen no changes when it comes to estimate revision over the past few weeks, while the Zacks Consensus Estimate for the current quarter has also remained unchanged. The recent price action is encouraging though, so make sure to keep a close watch on this firm in the near future.    Denbury Resources currently has a Zacks Rank #3 (Hold) while its Earnings ESP  is negative. ",
    " Denbury Resources Inc. Price ",
    "       Denbury Resources Inc. price    |   Denbury Resources Inc. Quote  ",
    " Denbury Resources Inc. price    |   Denbury Resources Inc. Quote ",
    "Investors interested in the Oil and Gas - Exploration and Production - United States industry may consider Halcon Resources Corporation HKRSQ  , which has a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here.  ",
    "Is DNR going up? Or down? Predict to see what others think: Up  or Down ",
    " Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:32:00"
}