{
  "url": "https://www.nasdaq.com/article/mallinckrodt-bonds-tumble-on-reports-of-possible-bankruptcy-20190905-00873",
  "title": "Mallinckrodt bonds tumble on reports of possible bankruptcy - Nasdaq.com",
  "text": [
    "By Paul Kilby",
    "NEW YORK, Sept 5 (IFR) - Bonds issued by Mallinckrodt tumbled on Thursday on news that the drug maker had hired restructuring advisors and was contemplating seeking bankruptcy protection.",
    "The firm is said to have hired Latham & Watkins and AlixPartners LLP to explore options ahead of the first federal opioid trial next month, according to a Bloomberg report.",
    "Prices on the bond have since bounced back to 60.00, but are still well off the 100.53 seen on January 16 this year.",
    "Mallinckrodt bonds have been some of the most actively traded securities in the US high-yield corporate space this year as it became embroiled in a number of lawsuits.",
    "In April, the US Justice Department joined whistle-blowers in alleging that a drug company called Questor, acquired by Mallinckrodt in 2014, illegally marketed a multiple sclerosis treatment called Acthar, which represents a good chunk of its sales, according to Reuters.",
    "And while the company agreed to pay US$15.4m to settle the dispute over Acthar, it has also been caught up in a crack down on drug companies over the opioid crisis in the US.",
    "Lawsuits connected to the opioid crisis have weighed on credits across the sector, including junk rated issuers such as Teva and Mallinckrodt.",
    "As a result, the company delayed the planned spin-off of its specialty generics business, which largely made opioid drugs.",
    "Aside from potential liabilities stemming from opioid settlements, Mallinckrodt also has to contend with a US$700m bond maturity next April and about US$600m owed to Medicare and Medicaid Services (CMS).",
    "The company should be able to cover those obligations through cash on hand, free cash flow and plus some US$1bn in secured capacity, JP Morgan analysts wrote in a report earlier this week.",
    "Yet how it will deal with any potential liabilities from opioid claims is less clear.",
    "The firm said on August 28 that it had maxed out its revolving credit facility by drawing down the final US$95m available.",
    "\"Mallinckrodt seems hard-pressed to come up with much cash for a Day One settlement,\" wrote JP Morgan analysts.",
    "As of June 28, Mallinckrodt's total debt stood at US$5.591bn, or US$5.349bn on a net basis after accounting for US$241.1m of unrestricted cash, according to the company.",
    "That put net leverage at 3.9x, with adjusted Ebitda coming in at US$1.356bn over the 12 month period.",
    "Under a restructuring scenario, JP Morgan thinks opioid settlements would be treated as unsecured, allowing for full recovery on US$2.8bn of secured debt even if the 2020 maturity is paid down with secured debt.",
    "\"We do not think it makes sense for the parties to agree to haircut debt before the company has a global settlement on opioids,\" the bank said.",
    "While the threat of bankruptcy could also be used to encourage plaintiffs to settle, the plaintiffs are too numerous and disparate, and seem not even close to having reached a consensus.\""
  ],
  "published_datetime": "2019-09-05 01:23:00"
}