{
  "url": "https://www.nasdaq.com/article/whats-the-deal-with-fords-junk-bond-rating-from-moodys-cm1210732",
  "title": "What’s the Deal With Ford’s ‘Junk’ Bond Rating From Moody’s? - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Ford (NYSE: F ) stock went into reverse as its bonds were labelled \"junk\" by a ratings agency. The decision by Moody's to downgrade Ford's credit rating is comparable to what happens to a car buyer whose credit score drops.",
    "That's just what happened.",
    "As Ford's second-quarter earnings report made clear, in June it had almost $91 billion in long-term Ford Credit loans meant to help buyers pay for Ford cars. $50.5 billion of Ford Credit debt, presumably dealer loans, will mature within one year.",
    "But the Moody's report attacked the business for weak cash generation as it pursues a costly restructuring program.",
    "What's really going on?",
    "The \"tell\" here is that Moody's also called Ford's outlook \"stable,\" noting it has $23 billion in cash and under $12 billion in \"automotive debt\" taken out for the company. Rather than operate a separate loan operation, Ford carries Ford Credit, based in Omaha, as a subsidiary. Banks expect some loans to go bad, holding reserves against which losses are charged off. Ford Credit isn't operating that way.",
    "In 2002, Ford sold its Brazilian loan portfolio to a local bank for $430 million . That bank then issued more loans to buyers on its own account to boost Ford's market share. Handing loans to buyers as debt is controversial. If the portfolio isn't properly managed it can generate huge losses in an economic downturn. A recession would be a double whammy for Ford's balance sheet.",
    "But Ford Credit also provides valuable data to its parent company. One-third of its profit now comes from data, up from one-fourth just two years ago . Ford recently bought a small electric scooter startup, Spin, mainly for the data .",
    "Meanwhile, the reinvention of Ford continues.",
    "Most reporters highlight the $11.1 billion investment Ford is making in electric and self-driving cars. But that also means it's retreating from its traditional business. About 10% of Ford's white-collar office staff was recently let go. Job cuts are coming in Europe, South America and Russia.",
    "Ford is focusing its internal combustion efforts on big trucks and SUVs, which continue to sell in the U.S., while pushing EVs in Europe . The company hopes to get half its European sales from hybrids and EVs within three years .",
    "Ford is working closely with Volkswagen (OTCMKTS: VWAGY ) on electric vehicles. Volkswagen in turn is pushing the modular electric drive matrix (MEB) platform, building its first MEB-based factory in China . This is a single platform that works across all car models and lowers costs. Sharing that development expense with other car companies cuts costs further.",
    "Ford isn't putting all its eggs in Volkswagen's basket. It has also invested in Rivian , an electric truck startup . The company has also invested in Argo AI  for autonomous car technology. Its latest Michigan factory is expected to produce semi-autonomous vehicles within two years .",
    "As a stock, Ford is strictly for income investors. The 15 cent per share dividend yields over 6.3% at a time when long-term U.S. bonds yield just 2.3%.",
    "As a company, however, Ford is currently highly speculative. It's trying to figure out the new worlds of electric and self-driving cars while acknowledging the sunset of its old business models. Profits are expected to come from new directions and its winding up its old ways of doing business.",
    "Electric and self-driving cars filled with data excite Ford. They scare Moody's.",
    "Dana Blankenhornis a financial and technology journalist. He is the author of the mystery thriller, The Reluctant Detective Finds Her Family, available at the Amazon Kindle store. Write him at danablankenhorn@gmail.comor follow him on Twitter at @danablankenhorn . As of this writing he owned no shares in companies mentioned in this article.",
    "The post What's the Deal With Ford's 'Junk' Bond Rating From Moody's? appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:55:16"
}