{
  "url": "https://www.nasdaq.com/article/migraine-biotech-satsuma-pharmaceuticals-sets-terms-for-75-million-ipo-cm1206593",
  "title": "Migraine biotech Satsuma Pharmaceuticals sets terms for $75 million IPO - Nasdaq.com",
  "text": [
    " Satsuma Pharmaceuticals, a clinical-stage biotech developing a therapy for migraines, announced terms for its IPO on Tuesday.    The South San Francisco, CA-based company plans to raise $75 million by offering 5 million shares at a price range of $14 to $16. Insiders intend to purchase $25 million worth of shares in the offering. At the midpoint of the proposed range, Satsuma Pharmaceuticals would command a fully diluted market value of $262 million.    Satsuma Pharmaceuticals was founded in 2016 and plans to list on the Nasdaq under the symbol STSA. Credit Suisse, SVB Leerink and Evercore ISI are the joint bookrunners on the deal. It is expected to price during the week of September 9, 2019.  The article Migraine biotech Satsuma Pharmaceuticals sets terms for $75 million IPO  originally appeared on IPO investment manager Renaissance Capital's web site renaissancecapital.com.   Investment Disclosure:  The information and opinions expressed herein were prepared by Renaissance Capital's research analysts and do not constitute an offer to buy or sell any security. Renaissance Capital's Renaissance IPO ETF (symbol: IPO)  , Renaissance International ETF (symbol: IPOS)  , or separately managed institutional accounts may have investments in securities of companies mentioned.",
    "Satsuma Pharmaceuticals, a clinical-stage biotech developing a therapy for migraines, announced terms for its IPO on Tuesday.    The South San Francisco, CA-based company plans to raise $75 million by offering 5 million shares at a price range of $14 to $16. Insiders intend to purchase $25 million worth of shares in the offering. At the midpoint of the proposed range, Satsuma Pharmaceuticals would command a fully diluted market value of $262 million.    Satsuma Pharmaceuticals was founded in 2016 and plans to list on the Nasdaq under the symbol STSA. Credit Suisse, SVB Leerink and Evercore ISI are the joint bookrunners on the deal. It is expected to price during the week of September 9, 2019.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:00:00"
}