{
  "url": "https://www.nasdaq.com/article/why-endo-international-shares-are-tanking-today-cm1208160",
  "title": "Why Endo International Shares Are Tanking Today - Nasdaq.com",
  "text": [
    " What happened Shares of   Endo International    (NASDAQ: ENDP) were tanking 13.1% as of 11:07 a.m. EDT on   Thursday after falling as much as 19.3% earlier in the day. The   drug stock felt the ripple impact from reports that another   opioid maker,   Mallinckrodt    (NYSE: MNK) , was restructuring and considering options including   filing for bankruptcy. Endo, Mallinckrodt, and other drugmakers   face multiple lawsuits related to their past promotion practices   for highly addictive opioid drugs. So what The main concern for investors is that opioid drug companies   could fall like a line of dominoes. Rumors surfaced last week   that privately held Purdue Pharma was considering a settlement to   opioid litigation that would include filing for bankruptcy. Those   reports were enough to   cause Mallinckrodt stock to plunge    .   Image source: Getty Images.makeArticleAd();  Now, the potential that Mallinckrodt might be mulling a   bankruptcy route is making investors fret that Endo could follow   suit. Those worries appear to be warranted. It's important to note, however, that Endo hasn't issued any   public statements indicating that it could be considering   restructuring or exploring the potential for filing for   bankruptcy. The company actually   even had some good news recently    with its settlement in principle with two Ohio counties   in opioid-related lawsuits. Now what We'll have to wait and see what happens next in Endo's   continuing saga. With a huge debt load and continued losses,   though, the company would be in trouble if it has to pay out a   lot of money to reach settlements in other lawsuits.  Investing in pharmaceutical stocks    comes with quite a few risks. But Endo's risk level makes that of   most other drugmakers look like a walk in the park. Investors   tempted to bet on a comeback for Endo at this point should   probably think long and hard before making any decisions. Staying   on the sidelines appears to be the smartest approach.   10 stocks we like better than Endo     International       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Endo International wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Keith Speights      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   Endo International    (NASDAQ: ENDP) were tanking 13.1% as of 11:07 a.m. EDT on   Thursday after falling as much as 19.3% earlier in the day. The   drug stock felt the ripple impact from reports that another   opioid maker,   Mallinckrodt    (NYSE: MNK) , was restructuring and considering options including   filing for bankruptcy. Endo, Mallinckrodt, and other drugmakers   face multiple lawsuits related to their past promotion practices   for highly addictive opioid drugs.",
    "The main concern for investors is that opioid drug companies   could fall like a line of dominoes. Rumors surfaced last week   that privately held Purdue Pharma was considering a settlement to   opioid litigation that would include filing for bankruptcy. Those   reports were enough to   cause Mallinckrodt stock to plunge    .",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Now, the potential that Mallinckrodt might be mulling a   bankruptcy route is making investors fret that Endo could follow   suit. Those worries appear to be warranted.",
    "It's important to note, however, that Endo hasn't issued any   public statements indicating that it could be considering   restructuring or exploring the potential for filing for   bankruptcy. The company actually   even had some good news recently    with its settlement in principle with two Ohio counties   in opioid-related lawsuits.",
    "We'll have to wait and see what happens next in Endo's   continuing saga. With a huge debt load and continued losses,   though, the company would be in trouble if it has to pay out a   lot of money to reach settlements in other lawsuits.",
    " Investing in pharmaceutical stocks    comes with quite a few risks. But Endo's risk level makes that of   most other drugmakers look like a walk in the park. Investors   tempted to bet on a comeback for Endo at this point should   probably think long and hard before making any decisions. Staying   on the sidelines appears to be the smartest approach.",
    "  10 stocks we like better than Endo     International       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Endo International wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Endo     International       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Endo International wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Keith Speights      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 12:00:00"
}