{
  "url": "https://www.nasdaq.com/article/whats-the-best-way-to-start-a-college-fund-for-your-child-cm1206464",
  "title": "What's the Best Way to Start a College Fund for Your Child? - Nasdaq.com",
  "text": [
    "It's never too early to start saving for your child's college costs.",
    "When you have a child, you want to give them every opportunity to succeed in life. Since a degree can open up more employment opportunities and result in a higher salary, going to college is often an important step on the ladder.",
    "But as we all know, college isn't cheap. According to Experian, the average student loan debt was $35,359 in 2018. College costs have also been steadily rising for decades, so if you have a young child or you're currently expecting a baby, it's likely that they'll need to pay much more for school.",
    "By starting a college fund for your child, you can help them get an education without ending up with too much student loan debt. The question many parents ask is: What financial tool should I use to save that money? And fortunately, there are a few excellent options available.",
    "Image source: Getty Images",
    "A 529 plan is a state-operated college savings plan, although funds from this type of plan can also be put toward tuition for any school year, from kindergarten to 12th grade. You're allowed to open a 529 plan in any state, whether or not you are a resident. Funds from a 529 plan can also be used for college in any state, as well as for some international universities.",
    "If a 529 plan is used for qualified educational expenses, then withdrawals are tax-free.",
    "There are two types of 529 plans available:",
    "One benefit of 529 plans is that they have high contribution limits. There is no annual limit, and the maximum amount you can add to a 529 plan is determined by the state, with limits ranging from less than $250,000 to more than $500,000.",
    "A 529 plan is a smart choice if:",
    "A Coverdell ESA, also known as an Education Savings Account, is an investment account intended for educational expenses, which can include expenses for college, or kindergarten through 12th grade. Distributions from the plan are tax-free. There is a contribution limit of $2,000 per year per beneficiary.",
    "There are also income restrictions to consider when contributing to an ESA. As of 2019, the amount you can contribute is phased out if you're a single filer with a modified adjusted gross income (MAGI) between $95,000 and $110,000 or if you're a couple filing jointly with a MAGI between $190,000 and $220,000.",
    "Since this type of plan is intended for education expenses, if funds are withdrawn for any other reason, there is a 10% penalty and the beneficiary will pay income taxes on the plan's earnings. The beneficiary must also use the funds by the time they turn 30. If they don't, you have two options:",
    "A 529 plan is usually a better choice than an ESA, but there are a couple of situations in which you may want to open an ESA instead:",
    "Although an IRA is obviously intended for your retirement savings , it can also work well as a college fund. There is usually a 10% penalty for withdrawing from an IRA before you reach age 59½, but you can avoid this penalty by using the funds for qualified college expenses.",
    "There are two significant advantages to choosing an IRA over a 529 plan or an ESA:",
    "However, there are also some important disadvantages to this option:",
    "Because of these drawbacks, this option is only recommended if you:",
    "So, which of these college fund options should you go with? For most, a 529 plan will be the way to go, since it offers tax-related advantages and very high contribution limits.",
    "That being said, you could find that an ESA or IRA fits your needs better. Both offer more investment options , and an IRA will allow you added flexibility in how you use your funds.",
    "But whichever one you choose, you'll be making college much more affordable for your child.",
    "Many people are missing out on lower student loan interest rates because they don't take the time to research their refinancing options. Our picks of the best student loan providers can help you save thousands of dollars in interest over time. Click here to uncover the best-in-class student loans providers we could find in 2019.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-02 16:00:00"
}