{
  "url": "https://www.nasdaq.com/article/ix-vs-ocsl-which-stock-is-the-better-value-option-cm1207180",
  "title": "IX vs. OCSL: Which Stock Is the Better Value Option? - Nasdaq.com",
  "text": [
    " Investors interested in Financial - Miscellaneous Services stocks are likely familiar with Orix (IX) and Oaktree Specialty Lending (OCSL). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look. We have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits. Currently, Orix has a Zacks Rank of #2 (Buy), while Oaktree Specialty Lending has a Zacks Rank of #3 (Hold). The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that IX has an improving earnings outlook. But this is only part of the picture for value investors. Value investors also try to analyze a wide range of traditional figures and metrics to help determine whether a company is undervalued at its current share price levels. Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years. IX currently has a forward P/E ratio of 6.15, while OCSL has a forward P/E of 10.67. We also note that IX has a PEG ratio of 0.85. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. OCSL currently has a PEG ratio of 5.33. Another notable valuation metric for IX is its P/B ratio of 0.72. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, OCSL has a P/B of 0.79. These metrics, and several others, help IX earn a Value grade of A, while OCSL has been given a Value grade of C. IX stands above OCSL thanks to its solid earnings outlook, and based on these valuation figures, we also feel that IX is the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Orix Corp Ads (IX): Free Stock Analysis Report   Oaktree Specialty Lending Corp. (OCSL): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors interested in Financial - Miscellaneous Services stocks are likely familiar with Orix (IX) and Oaktree Specialty Lending (OCSL). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look.",
    "We have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits.",
    "Currently, Orix has a Zacks Rank of #2 (Buy), while Oaktree Specialty Lending has a Zacks Rank of #3 (Hold). The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that IX has an improving earnings outlook. But this is only part of the picture for value investors.",
    "Value investors also try to analyze a wide range of traditional figures and metrics to help determine whether a company is undervalued at its current share price levels.",
    "Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years.",
    "IX currently has a forward P/E ratio of 6.15, while OCSL has a forward P/E of 10.67. We also note that IX has a PEG ratio of 0.85. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. OCSL currently has a PEG ratio of 5.33.",
    "Another notable valuation metric for IX is its P/B ratio of 0.72. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, OCSL has a P/B of 0.79.",
    "These metrics, and several others, help IX earn a Value grade of A, while OCSL has been given a Value grade of C.",
    "IX stands above OCSL thanks to its solid earnings outlook, and based on these valuation figures, we also feel that IX is the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:11"
}