{
  "url": "https://www.nasdaq.com/article/heres-why-you-should-avoid-betting-on-rpc-res-stock-now-cm1206669",
  "title": "Here's Why You Should Avoid Betting on RPC (RES) Stock Now - Nasdaq.com",
  "text": [
    "  RPC, Inc.  's RES  troubles seem to be never ending. The oilfield service provider, which has lost 61% of its value over the past year, is traversing rough waters amid several headwinds. Shares of RPC have declined 46.2% year to date compared with its  industry  and the energy sector's 0.2% and 5.1% fall, respectively.    Let's delve into the factors that have taken a toll on the firm. Intensified competition in the domestic market has left limited room for oilfield services companies to charge premium prices for the services being offered. Moreover, slowdown of demand for pressure pumping services in shale plays mars RPC's prospects. This is evident from second-quarter 2019 results, wherein weakness stemmed from lower activity levels and pricing in the company's pressure pumping service business, in turn significantly affecting operating income. Explorers and producers are constrained by the reduction in capacity for borrowings and an increase in the cost of capital. Also, the explorers are facing constant pressure from investors for higher returns instead of production growth. These headwinds are likely to lower investments by explorers and producers in the land market of North America. Hence, conservative spending by customers is likely to hurt demand for the company's oilfield services. Between 2017 and 2018, RPC's cost of revenues increased almost 73% and 13%, respectively, due to rise in maintenance expenses, fuel costs, and materials and supplies expenses. Although costs decreased in first-half 2019, it is expected to escalate again, with rise in activity levels. Notably, cost of revenues - as a percentage of sales - increased year over year in first-half 2019. A hike in expenses associated with the ramp-up of oilfield services hurt the company's earnings. Moderate recovery in oilfield services in the domestic market will likely lead to a further increase in costs, which is a serious concern for RPC. Although it is strongly committed toward returning cash to stockholders through dividend payments and share buybacks, the company's dividend yield is not impressive. In fact, its curren t dividend yield  of 2.5% is significantly lower than 4.1% yield of the stocks belonging to the energy sector.  Industry Weakness  The Oil and Gas - Field Services industry, to which RPC belongs, currently has a Zacks Industry Rank of 189 out of 255 (Bottom 26%). As the industry is not expected to perform impressively in the coming days, the stock will likely underperform the market. The above-mentioned factors are being reflected in the company's downward earnings estimate revisions.  Earnings Estimate Revisions  The Zacks Consensus Estimate for RPC's 2019 earnings is pegged at one penny, which has witnessed no upside but 13 downside estimate revisions in the past 60 days. This suggests a fall of 98.8% from the year-ago reported figure. Given these headwinds, RPC seems a risky bet that investors should avoid at the moment. This is reflected in its Zacks Rank #4 (Sell).  Stocks to Consider  Some better-ranked players in the energy space are Energy Transfer LP ET  , Dril-Quip, Inc. DRQ  and NuStar Energy L.P. NS  , each holding a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  .  Energy Transfer's 2019 earnings per share are expected to rise 16.5% year over year. Dril-Quip's 2019 earnings per share are expected to rise 131.8% year over year. NuStar Energy's third-quarter 2019 earnings per share are expected to gain more than 107% year over year.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  NuStar Energy L.P. (NS): Free Stock Analysis Report   Dril-Quip, Inc. (DRQ): Free Stock Analysis Report   RPC, Inc. (RES): Free Stock Analysis Report   Energy Transfer LP (ET): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " RPC, Inc.  's RES  troubles seem to be never ending. The oilfield service provider, which has lost 61% of its value over the past year, is traversing rough waters amid several headwinds. Shares of RPC have declined 46.2% year to date compared with its  industry  and the energy sector's 0.2% and 5.1% fall, respectively.",
    "Let's delve into the factors that have taken a toll on the firm.",
    "Intensified competition in the domestic market has left limited room for oilfield services companies to charge premium prices for the services being offered. Moreover, slowdown of demand for pressure pumping services in shale plays mars RPC's prospects. This is evident from second-quarter 2019 results, wherein weakness stemmed from lower activity levels and pricing in the company's pressure pumping service business, in turn significantly affecting operating income.",
    "Explorers and producers are constrained by the reduction in capacity for borrowings and an increase in the cost of capital. Also, the explorers are facing constant pressure from investors for higher returns instead of production growth. These headwinds are likely to lower investments by explorers and producers in the land market of North America. Hence, conservative spending by customers is likely to hurt demand for the company's oilfield services.",
    "Between 2017 and 2018, RPC's cost of revenues increased almost 73% and 13%, respectively, due to rise in maintenance expenses, fuel costs, and materials and supplies expenses. Although costs decreased in first-half 2019, it is expected to escalate again, with rise in activity levels. Notably, cost of revenues - as a percentage of sales - increased year over year in first-half 2019. A hike in expenses associated with the ramp-up of oilfield services hurt the company's earnings. Moderate recovery in oilfield services in the domestic market will likely lead to a further increase in costs, which is a serious concern for RPC.",
    "Although it is strongly committed toward returning cash to stockholders through dividend payments and share buybacks, the company's dividend yield is not impressive. In fact, its curren t dividend yield  of 2.5% is significantly lower than 4.1% yield of the stocks belonging to the energy sector.",
    " Industry Weakness ",
    "The Oil and Gas - Field Services industry, to which RPC belongs, currently has a Zacks Industry Rank of 189 out of 255 (Bottom 26%). As the industry is not expected to perform impressively in the coming days, the stock will likely underperform the market.",
    "The above-mentioned factors are being reflected in the company's downward earnings estimate revisions.",
    " Earnings Estimate Revisions ",
    "The Zacks Consensus Estimate for RPC's 2019 earnings is pegged at one penny, which has witnessed no upside but 13 downside estimate revisions in the past 60 days. This suggests a fall of 98.8% from the year-ago reported figure.",
    "Given these headwinds, RPC seems a risky bet that investors should avoid at the moment. This is reflected in its Zacks Rank #4 (Sell).",
    " Stocks to Consider ",
    "Some better-ranked players in the energy space are Energy Transfer LP ET  , Dril-Quip, Inc. DRQ  and NuStar Energy L.P. NS  , each holding a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  . ",
    "Energy Transfer's 2019 earnings per share are expected to rise 16.5% year over year.",
    "Dril-Quip's 2019 earnings per share are expected to rise 131.8% year over year.",
    "NuStar Energy's third-quarter 2019 earnings per share are expected to gain more than 107% year over year.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:24:00"
}