{
  "url": "https://www.nasdaq.com/article/why-fastly-stock-popped-today-cm1210731",
  "title": "Why Fastly Stock Popped Today - Nasdaq.com",
  "text": [
    " What happened Shares of   Fastly    (NYSE: FSLY) were up 15.8% as of 2:40 p.m. EDT Wednesday despite   a lack of company-specific news. Rather, note shares not only   soared almost 50% in August     as Wall Street praised Fastly's firs   t quarterly   report    since going public in May, but they also   pulled back hard    earlier this week (without news to support the move) along with a   broader group of other cloud-centric   tech stocks    . So what With that in mind, this bounce isn't exactly out of character   for a recently IPO'd stock with a relatively small float   available to retail investors. It certainly helps, however, that   the broader market is climbing today, led by a 0.7% rise from the   tech-heavy   NASDAQ    index as of this writing.   IMAGE SOURCE: GETTY IMAGES.makeArticleAd();  Now what To be clear, I see no new press releases, analyst notes, SEC   filings, or merger news that might otherwise directly cause such   a rise -- so patient, long-term investors who aren't already   accustomed to Fastly's volatility shouldn't lend too much   credence to moves like this. Instead, focus first on the   health and momentum of Fastly's underlying   business    . In time, its share price should more closely reflect as   much.   10 stocks we like better than Fastly       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Fastly wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Steve Symington      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Fastly. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   Fastly    (NYSE: FSLY) were up 15.8% as of 2:40 p.m. EDT Wednesday despite   a lack of company-specific news. Rather, note shares not only   soared almost 50% in August     as Wall Street praised Fastly's firs   t quarterly   report    since going public in May, but they also   pulled back hard    earlier this week (without news to support the move) along with a   broader group of other cloud-centric   tech stocks    .",
    "With that in mind, this bounce isn't exactly out of character   for a recently IPO'd stock with a relatively small float   available to retail investors. It certainly helps, however, that   the broader market is climbing today, led by a 0.7% rise from the   tech-heavy   NASDAQ    index as of this writing.",
    "  IMAGE SOURCE: GETTY IMAGES.makeArticleAd(); ",
    "IMAGE SOURCE: GETTY IMAGES.",
    "To be clear, I see no new press releases, analyst notes, SEC   filings, or merger news that might otherwise directly cause such   a rise -- so patient, long-term investors who aren't already   accustomed to Fastly's volatility shouldn't lend too much   credence to moves like this. Instead, focus first on the   health and momentum of Fastly's underlying   business    . In time, its share price should more closely reflect as   much.",
    "  10 stocks we like better than Fastly       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Fastly wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Fastly       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Fastly wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Steve Symington      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Fastly. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:04:00"
}