{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-lockheed-general-dynamics-raytheon-boeing-and-heico-cm1206575",
  "title": "The Zacks Analyst Blog Highlights: Lockheed, General Dynamics, Raytheon, Boeing and HEICO - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 3, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Lockheed Martin Corp. LMT  , General Dynamics Corp. GD  , Raytheon Company RTN  , Boeing BA  and HEICO Corp. HEI  .  Here are highlights from Friday's Analyst Blog:    Defense Stock Roundup: LMT, GD, RTN & More   A consistent flow of funds from the Pentagon has kept defense stocks buoyant over the trailing five trading sessions. As a result, major indices of the aerospace and defense industry ended in the green. Notably, the S&P 500 Aerospace & Defense (Industry) and the Dow Jones U.S. Aerospace & Defense indices rose approximately 2.6% in the past five trading sessions. Among the past week's highlights, defense majors namely Lockheed Martin Corp., General Dynamics Corp., Raytheon Company and The Boeing Company secured a number of notable deals from the Department of Defense's daily funding session. Moreover, HEICO Corp. released third-quarter fiscal 2019 results.  Recap of Past Week's Important Stories  1. Lockheed Martin  's Aeronautics business segment secured a $2.4-billion modification contract to procure initial spares for F-35 Lightning II Joint Strike Fighter jets. The deal has been awarded by the Naval Air Systems Command, Patuxent River, Maryland. Majority of the task will be carried out in Fort Worth, TX; El Segundo, CA; Owego, NY; Samlesbury and Cheltenham, the United Kingdom (read more: Lockheed Wins $2.4B Deal to Supply Spares for F-35 Jets  ). 2. General Dynamics  ' business subsidiary, National Steel and Shipbuilding Co. (\"NASSCO\"), clinched a $1.08-billion contract for the construction of Expeditionary Sea Base (\"ESB\") 6 and 7 ships. The deal was awarded by the Naval Sea Systems Command, Washington, DC. Work related to the deal is expected to get completed by January 2025. Majority of the task will be performed in San Diego, CA, (read more: General Dynamics' NASSCO Wins $1B Deal to Build ESB-6 & 7  ). 3. Raytheon  won a hybrid contract worth $534 million to provide the Horizontal Technology Integration Second Generation Forward Looking Infrared (2GF) Commander's Independent Thermal Viewer (\"CITV\") to the U.S. Army. The deal was awarded by the U.S. Army Contracting Command, Aberdeen Proving Ground, MD. The work is expected to get completed by Aug 23, 2026 (read more: Raytheon Wins $534M Second Generation Infrared CITV Deal  ). The company also secured a $349-million contract related to the Phase 2 of the Maritime Strike Tomahawk Rapid Deployment Capability. The contract was awarded by the Naval Air Systems Command, Patuxent River, MD. Majority of work related to the deal will be executed in Tucson, AZ, while the entire deal is scheduled to get completed by February 2023 (read more: Raytheon Wins $349M Navy Deal to Support Tomahawk Missiles  ). Raytheon's Missiles Systems business unit clinched a modification contract worth $190.5 million in relation to the Evolved Sea Sparrow Missiles (\"ESSM\") Block 2. The deal was awarded by the Naval Sea Systems Command, Washington, DC. Majority of work related to the deal will get executed in Tucson, AZ. Raytheon is expected to complete the task by March 2023 (read more: Raytheon Wins $191M Deal to Support ESSM Block 2 Program  ). 4. Boeing  secured a $500-million contract for providing F-15QA aircrew and maintenance training to support the Qatar Emiri Air Force (\"QAEF\"). Work related to the deal is scheduled to be completed by August 2026. The contract was awarded by the Air Force Installation Contracting Agency/338th Specialized Contracting Squadron, Joint Base San Antonio-Randolph, TX, (read more: Boeing Wins $500M Deal to Support Qatar's F-15 Program  ). The company also won a $145.9-million modification contract, under which it will remanufacture 11 Apache aircraft, and new build Longbow Crew Trainer and spares. Work related to the deal is scheduled to be completed by Mar 29, 2024. The contract was awarded by the U.S. Army Contracting Command, Redstone Arsenal, Alabama (read more: Boeing Secures $146M FMS Deal to Aid Apache Aircraft Program  ). 5. HEICO Corp.  reported third-quarter fiscal 2019 earnings of 59 cents per share, which surpassed the Zacks Consensus Estimate by 11.3% and increased 20.4% on a year-over-year basis. Net sales of $532.3 million outpaced the Zacks Consensus Estimate by 3.6% and increased 14.3% year over year. As of Jul 31, 2019, cash and cash equivalents summed $59 million compared with $64.1 million as of Apr 30, 2019. As of Jul 31, 2019, the company generated cash provided by operating activities was $313.4 million compared with $214.8 million as of Jul 31, 2018. For fiscal 2019, HEICO Corp projects net sales growth of 14-15%, up from its prior growth estimates of 12-13% (read more: HEICO Q3 Earnings Surpass Estimates, FY19 View Up  ). Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  General Dynamics Corporation (GD): Free Stock Analysis Report   The Boeing Company (BA): Free Stock Analysis Report   Lockheed Martin Corporation (LMT): Free Stock Analysis Report   Heico Corporation (HEI): Free Stock Analysis Report   Raytheon Company (RTN): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 3, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Lockheed Martin Corp. LMT  , General Dynamics Corp. GD  , Raytheon Company RTN  , Boeing BA  and HEICO Corp. HEI  .",
    " Here are highlights from Friday's Analyst Blog: ",
    "  Defense Stock Roundup: LMT, GD, RTN & More  ",
    "A consistent flow of funds from the Pentagon has kept defense stocks buoyant over the trailing five trading sessions. As a result, major indices of the aerospace and defense industry ended in the green. Notably, the S&P 500 Aerospace & Defense (Industry) and the Dow Jones U.S. Aerospace & Defense indices rose approximately 2.6% in the past five trading sessions.",
    "Among the past week's highlights, defense majors namely Lockheed Martin Corp., General Dynamics Corp., Raytheon Company and The Boeing Company secured a number of notable deals from the Department of Defense's daily funding session. Moreover, HEICO Corp. released third-quarter fiscal 2019 results.",
    " Recap of Past Week's Important Stories ",
    "1. Lockheed Martin  's Aeronautics business segment secured a $2.4-billion modification contract to procure initial spares for F-35 Lightning II Joint Strike Fighter jets. The deal has been awarded by the Naval Air Systems Command, Patuxent River, Maryland.",
    "Majority of the task will be carried out in Fort Worth, TX; El Segundo, CA; Owego, NY; Samlesbury and Cheltenham, the United Kingdom (read more: Lockheed Wins $2.4B Deal to Supply Spares for F-35 Jets  ).",
    "2. General Dynamics  ' business subsidiary, National Steel and Shipbuilding Co. (\"NASSCO\"), clinched a $1.08-billion contract for the construction of Expeditionary Sea Base (\"ESB\") 6 and 7 ships. The deal was awarded by the Naval Sea Systems Command, Washington, DC.",
    "Work related to the deal is expected to get completed by January 2025. Majority of the task will be performed in San Diego, CA, (read more: General Dynamics' NASSCO Wins $1B Deal to Build ESB-6 & 7  ).",
    "3. Raytheon  won a hybrid contract worth $534 million to provide the Horizontal Technology Integration Second Generation Forward Looking Infrared (2GF) Commander's Independent Thermal Viewer (\"CITV\") to the U.S. Army. The deal was awarded by the U.S. Army Contracting Command, Aberdeen Proving Ground, MD. The work is expected to get completed by Aug 23, 2026 (read more: Raytheon Wins $534M Second Generation Infrared CITV Deal  ).",
    "The company also secured a $349-million contract related to the Phase 2 of the Maritime Strike Tomahawk Rapid Deployment Capability. The contract was awarded by the Naval Air Systems Command, Patuxent River, MD.",
    "Majority of work related to the deal will be executed in Tucson, AZ, while the entire deal is scheduled to get completed by February 2023 (read more: Raytheon Wins $349M Navy Deal to Support Tomahawk Missiles  ).",
    "Raytheon's Missiles Systems business unit clinched a modification contract worth $190.5 million in relation to the Evolved Sea Sparrow Missiles (\"ESSM\") Block 2. The deal was awarded by the Naval Sea Systems Command, Washington, DC.",
    "Majority of work related to the deal will get executed in Tucson, AZ. Raytheon is expected to complete the task by March 2023 (read more: Raytheon Wins $191M Deal to Support ESSM Block 2 Program  ).",
    "4. Boeing  secured a $500-million contract for providing F-15QA aircrew and maintenance training to support the Qatar Emiri Air Force (\"QAEF\"). Work related to the deal is scheduled to be completed by August 2026.",
    "The contract was awarded by the Air Force Installation Contracting Agency/338th Specialized Contracting Squadron, Joint Base San Antonio-Randolph, TX, (read more: Boeing Wins $500M Deal to Support Qatar's F-15 Program  ).",
    "The company also won a $145.9-million modification contract, under which it will remanufacture 11 Apache aircraft, and new build Longbow Crew Trainer and spares. Work related to the deal is scheduled to be completed by Mar 29, 2024.",
    "The contract was awarded by the U.S. Army Contracting Command, Redstone Arsenal, Alabama (read more: Boeing Secures $146M FMS Deal to Aid Apache Aircraft Program  ).",
    "5. HEICO Corp.  reported third-quarter fiscal 2019 earnings of 59 cents per share, which surpassed the Zacks Consensus Estimate by 11.3% and increased 20.4% on a year-over-year basis. Net sales of $532.3 million outpaced the Zacks Consensus Estimate by 3.6% and increased 14.3% year over year.",
    "As of Jul 31, 2019, cash and cash equivalents summed $59 million compared with $64.1 million as of Apr 30, 2019. As of Jul 31, 2019, the company generated cash provided by operating activities was $313.4 million compared with $214.8 million as of Jul 31, 2018.",
    "For fiscal 2019, HEICO Corp projects net sales growth of 14-15%, up from its prior growth estimates of 12-13% (read more: HEICO Q3 Earnings Surpass Estimates, FY19 View Up  ).",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:25:00"
}