{
  "url": "https://www.nasdaq.com/article/5-top-ranked-value-tech-stocks-to-add-to-your-portfolio-cm1210410",
  "title": "5 Top-Ranked Value Tech Stocks to Add to Your Portfolio - Nasdaq.com",
  "text": [
    " Technology stocks have been among the best performers to-date in 2019. This is evident from the fact that Technology Select Sector SPDR ETF (XLK) has returned 30.5% year to date. The tech's upward journey is far from over. The last few years have witnessed a series of breakthroughs in cloud computing, predictive analysis, AI, self-driving vehicles, digital personal assistants and IoT. Moreover, accelerated deployment of 5G technology - the next wireless revolution - is likely to create more opportunities. This will significantly raise demand for high-tech handheld gadgets and microprocessors. However, the ongoing U.S.-China trade war and a slowing China economy are potent challenges. That said, value investing is easily one of the most popular ways to find great stocks in any market environment. It is definitely one of the easiest ways to find stocks that are either flying under the radar and are compelling buys, or offer tantalizing discounts when compared to fair value. So, we have highlighted five value technology stocks with solid fundamentals that may prove to be the best options for investors in the months ahead.  Strategy to Pick Stocks  With the help of Zacks Stock Screener  , we've cherry picked five value technology stocks that possess strong fundamentals. Each of these stocks carry a Zacks Rank #1 (Strong Buy) or 2 (Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here  .  We have further narrowed down the choices with the help of our new style score system  . Our research shows that stocks with a Value Style Score of A or B when combined with a Zacks Rank #1 (Strong Buy) or 2 (Buy) offer the best opportunities in the value-investing space. Each of our picks has a Zacks Rank #1 or 2 and a Value Score of A.  Our Picks   Anixter International ( AXE )  is a leading global distributor of network, security, electrical, and utility power products and services. It sports a Zacks Rank #1. The company outpaced the Zacks Consensus Estimate in each of the trailing four quarters, the average positive earnings surprise being 14%. It has an expected earnings growth rate of 18.87% for the current year. The stock has returned 23.1% on a year-to-date basis.  Anixter International Inc. Price and Consensus         Anixter International Inc.   price-consensus-chart    |   Anixter International Inc. Quote    Diodes Incorporated ( DIOD )  is a leading manufacturer and supplier of high-quality discrete and analog semiconductor products, primarily to the communications, computing, industrial, consumer electronics and automotive markets. It carries a Zacks Rank #2. The company outpaced the Zacks Consensus Estimate in each of the trailing four quarters, the average positive earnings surprise being 7.14%. It has an expected earnings growth rate of 19.75% for the current year. The stock has gained 23.1% on a year-to-date basis.  Diodes Incorporated Price and Consensus           Diodes Incorporated price-consensus-chart    |   Diodes Incorporated Quote    Micron MU  is one of the one of the leading worldwide providers of semiconductor memory solutions. It is likely to benefit strongly from 5G adoption, advent of the foldable phones and advanced cameras. It has a Zacks Rank #2. The company outpaced the Zacks Consensus Estimate in three of the trailing four quarters, the average positive earnings surprise being 10.29%. The stock has gained 55.7% on a year-to-date basis.  Micron Technology, Inc. Price and Consensus           Micron Technology, Inc. price-consensus-chart    |   Micron Technology, Inc. Quote    Perion Network Ltd. ( PERI )  is a global technology company that delivers online advertising solutions and search monetization to brands and publishers. It sports a Zacks Rank #1. The company outpaced the Zacks Consensus Estimate in each of the trailing four quarters, the average positive earnings surprise being 67.92%. It has an expected earnings growth rate of 25.81% for the current year. The stock has gained 103.1% on a year-to-date basis.  Perion Network Ltd Price and Consensus           Perion Network Ltd price-consensus-chart    |   Perion Network Ltd Quote    Vipshop Holdings Limited VIPS  is a China-based online discount retailer which sells popular branded products such as clothing from the likes of Nike (NKE) and more regional-specific brands to cosmetics and much more. It carries a Zacks Rank #2. The company outpaced the Zacks Consensus Estimate in three of the trailing four quarters, the average positive earnings surprise being 11.16%. It has an expected earnings growth rate of 39.66% for the current year. The stock has gained 68.5% on a year-to-date basis.  Vipshop Holdings Limited Price and Consensus           Vipshop Holdings Limited   price-consensus-chart    |   Vipshop Holdings Limited Quote    Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.      Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Perion Network Ltd (PERI): Free Stock Analysis Report   Vipshop Holdings Limited (VIPS): Free Stock Analysis Report   Diodes Incorporated (DIOD): Free Stock Analysis Report   Anixter International Inc. (AXE): Free Stock Analysis Report   Micron Technology, Inc. (MU): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Technology stocks have been among the best performers to-date in 2019. This is evident from the fact that Technology Select Sector SPDR ETF (XLK) has returned 30.5% year to date. The tech's upward journey is far from over.",
    "The last few years have witnessed a series of breakthroughs in cloud computing, predictive analysis, AI, self-driving vehicles, digital personal assistants and IoT. Moreover, accelerated deployment of 5G technology - the next wireless revolution - is likely to create more opportunities. This will significantly raise demand for high-tech handheld gadgets and microprocessors.",
    "However, the ongoing U.S.-China trade war and a slowing China economy are potent challenges.",
    "That said, value investing is easily one of the most popular ways to find great stocks in any market environment. It is definitely one of the easiest ways to find stocks that are either flying under the radar and are compelling buys, or offer tantalizing discounts when compared to fair value.",
    "So, we have highlighted five value technology stocks with solid fundamentals that may prove to be the best options for investors in the months ahead.",
    " Strategy to Pick Stocks ",
    "With the help of Zacks Stock Screener  , we've cherry picked five value technology stocks that possess strong fundamentals. Each of these stocks carry a Zacks Rank #1 (Strong Buy) or 2 (Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here  . ",
    "We have further narrowed down the choices with the help of our new style score system  . Our research shows that stocks with a Value Style Score of A or B when combined with a Zacks Rank #1 (Strong Buy) or 2 (Buy) offer the best opportunities in the value-investing space.",
    "Each of our picks has a Zacks Rank #1 or 2 and a Value Score of A.",
    " Our Picks ",
    " Anixter International ( AXE )  is a leading global distributor of network, security, electrical, and utility power products and services.",
    "It sports a Zacks Rank #1. The company outpaced the Zacks Consensus Estimate in each of the trailing four quarters, the average positive earnings surprise being 14%. It has an expected earnings growth rate of 18.87% for the current year.",
    "The stock has returned 23.1% on a year-to-date basis.",
    " Anixter International Inc. Price and Consensus ",
    "     Anixter International Inc.   price-consensus-chart    |   Anixter International Inc. Quote  ",
    " Anixter International Inc.   price-consensus-chart    |   Anixter International Inc. Quote ",
    " Diodes Incorporated ( DIOD )  is a leading manufacturer and supplier of high-quality discrete and analog semiconductor products, primarily to the communications, computing, industrial, consumer electronics and automotive markets.",
    "It carries a Zacks Rank #2. The company outpaced the Zacks Consensus Estimate in each of the trailing four quarters, the average positive earnings surprise being 7.14%. It has an expected earnings growth rate of 19.75% for the current year.",
    "The stock has gained 23.1% on a year-to-date basis.",
    " Diodes Incorporated Price and Consensus ",
    "       Diodes Incorporated price-consensus-chart    |   Diodes Incorporated Quote  ",
    " Diodes Incorporated price-consensus-chart    |   Diodes Incorporated Quote ",
    " Micron MU  is one of the one of the leading worldwide providers of semiconductor memory solutions. It is likely to benefit strongly from 5G adoption, advent of the foldable phones and advanced cameras.",
    "It has a Zacks Rank #2. The company outpaced the Zacks Consensus Estimate in three of the trailing four quarters, the average positive earnings surprise being 10.29%.",
    "The stock has gained 55.7% on a year-to-date basis.",
    " Micron Technology, Inc. Price and Consensus ",
    "       Micron Technology, Inc. price-consensus-chart    |   Micron Technology, Inc. Quote  ",
    " Micron Technology, Inc. price-consensus-chart    |   Micron Technology, Inc. Quote ",
    " Perion Network Ltd. ( PERI )  is a global technology company that delivers online advertising solutions and search monetization to brands and publishers.",
    "It sports a Zacks Rank #1. The company outpaced the Zacks Consensus Estimate in each of the trailing four quarters, the average positive earnings surprise being 67.92%. It has an expected earnings growth rate of 25.81% for the current year.",
    "The stock has gained 103.1% on a year-to-date basis.",
    " Perion Network Ltd Price and Consensus ",
    "       Perion Network Ltd price-consensus-chart    |   Perion Network Ltd Quote  ",
    " Perion Network Ltd price-consensus-chart    |   Perion Network Ltd Quote ",
    " Vipshop Holdings Limited VIPS  is a China-based online discount retailer which sells popular branded products such as clothing from the likes of Nike (NKE) and more regional-specific brands to cosmetics and much more.",
    "It carries a Zacks Rank #2. The company outpaced the Zacks Consensus Estimate in three of the trailing four quarters, the average positive earnings surprise being 11.16%. It has an expected earnings growth rate of 39.66% for the current year.",
    "The stock has gained 68.5% on a year-to-date basis.",
    " Vipshop Holdings Limited Price and Consensus ",
    "         Vipshop Holdings Limited   price-consensus-chart    |   Vipshop Holdings Limited Quote  ",
    " Vipshop Holdings Limited   price-consensus-chart    |   Vipshop Holdings Limited Quote ",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.     ",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.  ",
    " See the pot trades we're targeting>> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:00:00"
}