{
  "url": "https://www.nasdaq.com/article/nigerian-tribunal-rejects-bid-to-overturn-buharis-election-20190911-00670",
  "title": "Nigerian tribunal rejects bid to overturn Buhari's election - Nasdaq.com",
  "text": [
    "By Camillus Eboh",
    "ABUJA, Sept 11 (Reuters) - A Nigerian election tribunal on Wednesday rejected a bid by the main opposition candidate to overturn the result of February's presidential election,which saw Muhammadu Buhari returned to office.",
    "Defeated contender Atiku Abubakar, a businessman and former vice president, was the candidate of the main opposition People's Democratic Party (PDP).",
    "The defeat for Atiku was widely anticipated.Buhari, a 76-year-old former military ruler, was re-elected after first taking office as an elected leader in 2015.",
    "The tribunal rejected all three of Atiku's claims: that the election was marred by irregularities, that he received more votes than Buhari and that the president did not have a secondary school certificate, a basic requirement to contest the election.",
    "\"This petition is hereby dismissed in its entirety,\" Justice Mohammed Lawal Garba said in announcing the ruling. All five judges who presided over the tribunal rejected Atiku's claims.",
    "Buhari took 56% of the vote against 41% for Atiku, the electoral commission said in February, but on a turnout of just  35.6% compared with 44% in 2015.",
    "Atiku rejected the result hours after Buhari was declared the victor and said he would mount a legal challenge.",
    "\"It is time for the country to move forward as one cohesive body, putting behind us all bickering and potential distractions over an election in which Nigerians spoke clearly and resoundingly,\" said Buhari in a statement on Wednesday following the tribunal's ruling.",
    "The PDP said in a tweet that it \"completely rejects the judgment\" which it described as a \"direct assault on the integrity of our nation's justice system\". ",
    "\"Our lawyers are upbeat in obtaining justice at the Supreme Court,\" it said in another tweet. ",
    "Every election result has been contested unsuccessfully since Nigeria returned to democracy in 1999, with the exception of the 2015 poll in which Goodluck Jonathan conceded defeat to Buhari.",
    "     On each of those occasions, the losing candidate took their case to the election tribunal and later appealed at the Supreme Court but were defeated. ",
    "The presidential election ran into problems with smart-card readers used to authenticate voters' fingerprints, which delayed voting in some areas.",
    "International observers did not dispute Buhari's victory but said the conduct of the election was widely flawed.",
    "In its assessment, the European Union observer mission said Nigeria's elections needed serious reform after being marred by violence, systemic failings and low turnout. [nL3N20Y39L]"
  ],
  "published_datetime": "2019-09-11 02:08:00"
}