{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-apple-harmony-gold-nrg-ryman-hospitality-and-dr-reddys-cm1207209",
  "title": "The Zacks Analyst Blog Highlights: Apple, Harmony Gold, NRG, Ryman Hospitality and Dr. Reddy's - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 4, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Apple AAPL  , Harmony Gold Mining Company Limited HMY  , NRG Energy Inc. NRG  , Ryman Hospitality Properties Inc. RHP  and Dr. Reddy's Laboratories Ltd. RDY  .  Here are highlights from Tuesday's Analyst Blog:    Top Stories of August Worth Watching in September   Wall Street saw a wild August with the S&P 500 posting 11 moves of more than 1% in 22 trading sessions of the month. Those moves included three declines of at least 2.6% as well as the index's worst day of the year on Aug 5, per CNBC. The large swings were mainly triggered by escalation in trade tensions and a recession warning by the bond market. Additionally, weak global economic data, low inflation and political unrest in Hong Kong added to the chaos. Below we discuss some of the events that dominated the headlines in August and will be worth watching this month:  Trade Drama  Trade continued to play foul in the stock market as both the United States and China put in place their latest tariff increases on each other's goods effective Sep 1. The Trump administration raised tariffs from 10% to 15% on $112 billion worth of Chinese goods including footwear, apparel and Apple Watches, while China imposed retaliatory tariffs hike on some of American goods, including pork, beef, chicken and agricultural goods, on its $75 billion target list. Trump plans to levy duties on further $160 billion in Chinese products such as laptops and cellphones in mid-December. China plans to ramp up tariffs on soybeans to 30% from 25% in mid-December. Though the trade representatives from the world's two biggest economies are expected to resume talks this month, tariff hike will hurt U.S. consumers, pushing up the prices of goods and thereby curtailing spending. It will further impact worldwide economy and corporate profits, particularly at big U.S. exporters. As such, investors are rushing to a flight to safety in gold, which often acts as safe haven, benefiting gold-mining companies. Harmony Gold Mining Company Limited, with a Zacks Rank #2 and VGM Score of A, emerged as the winner in August, gaining about 41%. The Zacks Consensus Estimate for fiscal year (ending June 2020) has moved up from 41 cents to 47 cents over the past three months. The company has an estimated earnings growth rate of 235.71%.  Fed Action  The Federal Reserve cut interest rates by 25 bps to 2-2.5% in its latest policy meeting ended Jul 31 for the first time since the 2008 financial crisis. It also said that the move is a \"midcycle adjustment\" and not the start of a lengthy series of rate cuts. However, additional cuts seem to be in the cards this month given the rising trade spat, recessionary fears and bouts of downbeat economic data that is cooling global economic growth. If the Fed cuts rate further, high-dividend-yield sectors such as utilities and real estate continued to be the winners given their sensitivity to interest rates. Some of the top-ranked stocks from these spaces include NRG Energy Inc. and Ryman Hospitality Properties Inc. These stocks have a Zacks Rank #1 (Strong Buy) or 2 (Buy), suggesting their outperformance in the months ahead. Further, these stocks are expected to generate solid earnings growth this year (NRG - 67.6%, OKE - 11.5%, CIO - 14% and RHP - 15.9%). You can see  the complete list of today's Zacks #1 Rank stocks   here   .  Weak Trading  August was the second-losing month of 2019 for Wall Street with the S&P 500 shedding 1.8%, the Dow Jones dropping 1.7% and the Nasdaq losing 2.6%. The Russell 2000 Index took the heaviest losses for the month, falling 5.1%. The brutal trading seen is August is expected to continue in September. This is because September is historically the worst month for the stock market. According to Dow Jones Market Data, the Dow Jones Industrial Average and the S&P 500 since 1937 saw average declines of 1% each. The Nasdaq Composite, which was introduced in 1971, also dropped 0.5% on average. The declines are due to a seasonal phenomenon as investors are more prone to selling than buying when they return from their summer vacations, trading volume after Labor Day is mostly bearish, many mutual funds have fiscal years ending Sep 30, window-dressing is rampant, and investors generally sell stocks to pay tuition bills for their kids' private schools and colleges. Against such a backdrop, investors should consider low-beta stocks, which exhibit greater levels of stability and usually lose less when the market is crumbling. Dr. Reddy's Laboratories Ltd., with a market cap of $5.94 and a beta of 0.21, could be a solid pick. The stock has an estimated growth rate of 25.6% for this fiscal year (ending March 2020). It has a Zacks Rank #1 and VGM Score of A.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>   Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  NRG Energy, Inc. (NRG): Free Stock Analysis Report   Apple Inc. (AAPL): Free Stock Analysis Report   Dr. Reddy's Laboratories Ltd (RDY): Free Stock Analysis Report   Harmony Gold Mining Company Limited (HMY): Free Stock Analysis Report   Ryman Hospitality Properties, Inc. (RHP): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " For Immediate Release ",
    "Chicago, IL -September 4, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Apple AAPL  , Harmony Gold Mining Company Limited HMY  , NRG Energy Inc. NRG  , Ryman Hospitality Properties Inc. RHP  and Dr. Reddy's Laboratories Ltd. RDY  .",
    " Here are highlights from Tuesday's Analyst Blog: ",
    "  Top Stories of August Worth Watching in September  ",
    "Wall Street saw a wild August with the S&P 500 posting 11 moves of more than 1% in 22 trading sessions of the month. Those moves included three declines of at least 2.6% as well as the index's worst day of the year on Aug 5, per CNBC. The large swings were mainly triggered by escalation in trade tensions and a recession warning by the bond market. Additionally, weak global economic data, low inflation and political unrest in Hong Kong added to the chaos.",
    "Below we discuss some of the events that dominated the headlines in August and will be worth watching this month:",
    " Trade Drama ",
    "Trade continued to play foul in the stock market as both the United States and China put in place their latest tariff increases on each other's goods effective Sep 1. The Trump administration raised tariffs from 10% to 15% on $112 billion worth of Chinese goods including footwear, apparel and Apple Watches, while China imposed retaliatory tariffs hike on some of American goods, including pork, beef, chicken and agricultural goods, on its $75 billion target list.",
    "Trump plans to levy duties on further $160 billion in Chinese products such as laptops and cellphones in mid-December. China plans to ramp up tariffs on soybeans to 30% from 25% in mid-December.",
    "Though the trade representatives from the world's two biggest economies are expected to resume talks this month, tariff hike will hurt U.S. consumers, pushing up the prices of goods and thereby curtailing spending. It will further impact worldwide economy and corporate profits, particularly at big U.S. exporters. As such, investors are rushing to a flight to safety in gold, which often acts as safe haven, benefiting gold-mining companies.",
    "Harmony Gold Mining Company Limited, with a Zacks Rank #2 and VGM Score of A, emerged as the winner in August, gaining about 41%. The Zacks Consensus Estimate for fiscal year (ending June 2020) has moved up from 41 cents to 47 cents over the past three months. The company has an estimated earnings growth rate of 235.71%.",
    " Fed Action ",
    "The Federal Reserve cut interest rates by 25 bps to 2-2.5% in its latest policy meeting ended Jul 31 for the first time since the 2008 financial crisis. It also said that the move is a \"midcycle adjustment\" and not the start of a lengthy series of rate cuts. However, additional cuts seem to be in the cards this month given the rising trade spat, recessionary fears and bouts of downbeat economic data that is cooling global economic growth.",
    "If the Fed cuts rate further, high-dividend-yield sectors such as utilities and real estate continued to be the winners given their sensitivity to interest rates. Some of the top-ranked stocks from these spaces include NRG Energy Inc. and Ryman Hospitality Properties Inc. These stocks have a Zacks Rank #1 (Strong Buy) or 2 (Buy), suggesting their outperformance in the months ahead. Further, these stocks are expected to generate solid earnings growth this year (NRG - 67.6%, OKE - 11.5%, CIO - 14% and RHP - 15.9%). You can see  the complete list of today's Zacks #1 Rank stocks   here   .",
    " Weak Trading ",
    "August was the second-losing month of 2019 for Wall Street with the S&P 500 shedding 1.8%, the Dow Jones dropping 1.7% and the Nasdaq losing 2.6%. The Russell 2000 Index took the heaviest losses for the month, falling 5.1%. The brutal trading seen is August is expected to continue in September.",
    "This is because September is historically the worst month for the stock market. According to Dow Jones Market Data, the Dow Jones Industrial Average and the S&P 500 since 1937 saw average declines of 1% each. The Nasdaq Composite, which was introduced in 1971, also dropped 0.5% on average. The declines are due to a seasonal phenomenon as investors are more prone to selling than buying when they return from their summer vacations, trading volume after Labor Day is mostly bearish, many mutual funds have fiscal years ending Sep 30, window-dressing is rampant, and investors generally sell stocks to pay tuition bills for their kids' private schools and colleges.",
    "Against such a backdrop, investors should consider low-beta stocks, which exhibit greater levels of stability and usually lose less when the market is crumbling. Dr. Reddy's Laboratories Ltd., with a market cap of $5.94 and a beta of 0.21, could be a solid pick. The stock has an estimated growth rate of 25.6% for this fiscal year (ending March 2020). It has a Zacks Rank #1 and VGM Score of A.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:15:00"
}