{
  "url": "https://www.nasdaq.com/article/noteworthy-tuesday-option-activity-hqy-algn-nav-cm1206918",
  "title": "Noteworthy Tuesday Option Activity: HQY, ALGN, NAV - Nasdaq.com",
  "text": [
    "Among the underlying components of the Russell 3000 index, we saw noteworthy  options trading  volume today in HealthEquity Inc (Symbol: HQY), where a total of 5,290 contracts have traded so far, representing approximately 529,000 underlying shares. That amounts to about 63.6% of HQY's average daily trading volume over the past month of 831,480 shares. Particularly high volume was seen for the $70 strike call option expiring September 20, 2019  , with 1,098 contracts trading so far today, representing approximately 109,800 underlying shares of HQY. Below is a chart showing HQY's trailing twelve month trading history, with the $70 strike highlighted in orange:       makeArticleAd();    Align Technology Inc (Symbol: ALGN) options are showing a volume of 7,082 contracts thus far today. That number of contracts represents approximately 708,200 underlying shares, working out to a sizeable 62% of ALGN's average daily trading volume over the past month, of 1.1 million shares. Especially high volume was seen for the $187.50 strike call option expiring September 06, 2019  , with 616 contracts trading so far today, representing approximately 61,600 underlying shares of ALGN. Below is a chart showing ALGN's trailing twelve month trading history, with the $187.50 strike highlighted in orange:       And Navistar International Corp. (Symbol: NAV) saw options trading volume of 2,485 contracts, representing approximately 248,500 underlying shares or approximately 61.6% of NAV's average daily trading volume over the past month, of 403,195 shares. Especially high volume was seen for the $23 strike put option expiring October 18, 2019  , with 311 contracts trading so far today, representing approximately 31,100 underlying shares of NAV. Below is a chart showing NAV's trailing twelve month trading history, with the $23 strike highlighted in orange:         For the various different available expirations for HQY options  , ALGN options  , or NAV options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 15:28:03"
}