{
  "url": "https://www.nasdaq.com/article/how-important-is-keytruda-for-merck-cm1207676",
  "title": "How Important Is Keytruda For Merck? - Nasdaq.com",
  "text": [
    "Merck's ( MRK  ) Keytruda is its top selling drug with sales of over $7 billion in 2018. Keytruda is used for the treatment of different types of cancers, including lung, head & neck, and melanoma among others. It has become the most important drug for Merck, given its contribution to the company's overall top line, and rocketing growth in sales in the recent years. With sales growth, Keytruda now has a meaningful impact on the company's earnings. The growth in sales can be attributed to Keytruda's superior benefits, and its approvals in several indications, especially lung, which has a large addressable market size. Keytruda has helped Merck post much stronger oncology sales growth, when compared to other pharmaceutical behemoths, such as Pfizer, Roche, and Johnson & Johnson. In this analysis, we analyze Keytruda's growth, and its contribution to Merck's top line as well as bottom line. We also compare Merck's oncology drugs' sales growth vis-à-vis its primary competitors. You can view our interactive dashboard analysis ~  Why Has Keytruda Become The Most Important Drug For   Merck?   ~ for more details. In addition, you can see more healthcare companies data here  .",
    " Keytruda Sales Have Seen Massive Growth In The Recent   Years ",
    " With Sales Rocketing, Keytruda's Contribution To Merck's   Top Line Also Saw Strong Growth. ",
    " EPS Attributable To Keytruda Has Also Seen Stellar   Growth ",
    " Keytruda's Contribution To Merck's Overall Earnings Has   Also Seen Strong Growth, In Line With The Growth Visible On   Revenues. ",
    " Keytruda's Stellar Sales Growth Can Be Attributed To Its   Demonstrated Results, Which Compare Better Over Its Peers, Its   Presence In the Lucrative Lung Cancer Market, And Its Approvals   For Many More Indications. ",
    " The Growth In Keytruda Sales Will Likely Continue In The   Coming Years, Given It Is Well Protected From Biosimilars For the   Next 9 Years. ",
    "What's behind Trefis? See How it's Powering New Collaboration and What-Ifs",
    "For CFOs and Finance Teams   | Product, R&D, and Marketing Teams ",
    " All Trefis Data ",
    "Like our charts? Explore example interactive dashboards   and create your own.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 01:20:26"
}