{
  "url": "https://www.nasdaq.com/article/heres-why-alexion-pharmaceuticals-dropped-11-in-august-cm1207925",
  "title": "Here's Why Alexion Pharmaceuticals Dropped 11% in August - Nasdaq.com",
  "text": [
    "Shares of Alexion Pharmaceuticals (NASDAQ: ALXN) ended August down 11% according to data provided by S&P Global Market Intelligence , as the biotech experienced a roller coaster to finish off the month.",
    "Interestingly, both the highs and lows involved Amgen (NASDAQ: AMGN) .",
    "Image source: Getty Images.",
    "Alexion got a boost late in the month when Spanish television network Intereconomia cited unnamed sources who said Amgen could offer $200 per share to buy the biotech , which would peg its value at close to $45 billion. Shares zoomed up, but the bump was rather fleeting -- that'll happen with unsubstantiated rumors.",
    "A few days later, the U.S. Patent Office's patent trial and appeal board disclosed that it will review three of Alexion's patents on top-selling Soliris at the request of Amgen, which is developing a biosimilar to Soliris that treats a blood disorder called paroxysmal nocturnal hemoglobinuria (PNH) and a few other diseases.",
    "Sales of Soliris were $980.8 million in the second quarter alone, making up 80% of Alexion's product sales. On the surface, losing patent protection on Soliris early would seem to be a big deal.",
    "Fortunately, Alexion has already developed a follow-on treatment for PNH called Ultomiris that generated $54.2 million in the second quarter. As patients switch to Ultomiris, the patents on Soliris become less important.",
    "Patients will still use Soliris for diseases other than PNH, but Alexion has methods patents for use in the those diseases that expire in the 2023 to 2026 time frame, giving it some time to milk the drug -- and perhaps even switch those patients to Ultomiris.",
    "That is, if Amgen doesn't buy it first.",
    "10 stocks we like better than Alexion Pharmaceuticals\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Alexion Pharmaceuticals wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Brian Orelli has no position in any of the stocks mentioned. The Motley Fool recommends Amgen. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:08:00"
}