{
  "url": "https://www.nasdaq.com/article/air-canada-files-challenge-over-onexs-c35-bln-buyout-of-rival-westjet-20190903-00968",
  "title": "Air Canada files challenge over Onex's C$3.5 bln buyout of rival WestJet - Nasdaq.com",
  "text": [
    "MONTREAL, Sept 3 (Reuters) - Air Canada  has challenged Onex Corp's   proposed acquisition of WestJet Airlines , on grounds that the deal may not meet the country's ownership rules, according to a letter sent by the carrier to the Canadian Transportation Agency.",
    "Toronto-based Onex's planned C$3.5 billion ($2.6 billion) buyout of Calgary-based WestJet has received approval from the carrier's shareholders and some regulators, but the agency is still reviewing whether the deal meets Canada's protective ownership laws. ",
    "Under Canadian rules, foreigners cannot own more than 49% equity in a Canadian airline. The rules further restrict a foreign airline and any single foreign owner from controlling more than a quarter of voting interests in a Canadian carrier.",
    "\"The uncertainty and flexibility of co-investor",
    "participation introduces significant risk that non-Canadian co-investors will have control-in-fact of WestJet following the transaction,\" Air Canada said.",
    "Air Canada declined to comment on the letter, a copy of which was seen by Reuters.",
    "The Canadian Transportation Agency said it is aware of the issues raised in Air Canada's letter.",
    "\"The process underway will allow the CTA to determine whether the proposed transaction will result in an undertaking that is Canadian,\" the agency said by email.",
    "Onex said in a statement that it \"is engaged with the CTA on the regulatory approval process of our transaction.\"",
    "Air Canada also argued that Onex requires at least a quarter of its board to be Canadian, which is below the government's threshold for control.",
    "Under the terms of the deal announced in May, Onex's acquisition of WestJet is set to close later in 2019 or early next year. WestJet shares were down 0.3% at C$30.77 on Tuesday afternoon.",
    "($1 = 1.3275 Canadian dollars)"
  ],
  "published_datetime": "2019-09-03 12:49:00"
}