{
  "url": "https://www.nasdaq.com/article/verint-systems-inc-vrnt-q2-2019-earnings-call-transcript-cm1207641",
  "title": "Verint Systems Inc (VRNT) Q2 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   Verint Systems Inc    (NASDAQ: VRNT)        Q2 2019 Earnings Call       Sep 4, 2019 ,   4:30 p.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Good day, ladies and gentlemen, and welcome to Verint Systems   Second Quarter Earnings Conference Call. [Operator Instructions]   As a reminder, this conference may be recorded. I would now like   to introduce your host for today's conference, Mr. Alan Roden,   Senior Vice President of Corporate Development. You may   begin.  Alan Roden    --   Senior Vice President, Corporate Development and Investor   Relations  Thank you, operator. Good afternoon, everyone, and thank you   for joining our conference call today. I'm here with Dan Bodner,   Verint's CEO; and Doug Robinson, Verint's CFO. Before getting started, I'd like to mention that accompanying   our call today is a WebEx with slides. If you'd like to view   these slides in real time during the call, please visit the IR   section of our website at verint.com, click on the Investor   Relations tab, click on the webcast link and select today's   conference call. I'd also like to mention to draw your attention   to the fact that certain matters discussed in this call may   contain forward-looking statements within the meaning of the   Private Security Litigation Reform Act of 1995, and other   provisions of the federal securities laws. These forward-looking   statements are based on management's current expectations and are   not guarantees of future performance. Actual results could differ   materially from those expressed in or implied by the   forward-looking statements. The forward-looking statements are   made as of the date of this call and except as required by law,   Verint assumes no obligation to update or revise them. Investors   are cautioned not to place undue reliance on these   forward-looking statements. For more detailed discussion, how   these and other risk and uncertainties could cause Verint's   actual results to differ materially and those indicated in the   forward-looking statements, please see our Form 10-K for the   fiscal year ended January 31st, 2019, and other filings we make   with the SEC. The financial measures discussed today include non-GAAP   measures, as we believe investors focus on those measures in   comparing results between periods and among our peer companies.   Our financial outlook and targets are provided only on a non-GAAP   basis. Please see today's WebEx slides or earnings release in the   Investor Relations section of our website at verint.com for a   reconciliation of non-GAAP financial measures to GAAP measures.   Non-GAAP financial information should not be considered in   isolation from, as a substitute for or superior to GAAP financial   information, but is included because management believes it   provides meaningful supplemental information regarding our   operating results when assessing our business and is useful to   investors for informational and comparative purposes. The   non-GAAP financial measures that Company uses have limitations   and may differ from those used by other companies. Now, I'd like to turn the call over to Dan. Dan?  Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors  Thank you, Alan. Good afternoon, everyone, and thank you for   joining us today to review our second quarter and first half   results. Q2 revenue came in at $324 million on a GAAP basis and   $331 million on a non-GAAP basis. Excluding the impact of   currency, non-GAAP revenue came in at $335 million, reflecting   8.6% year-over-year growth on a constant-currency basis. Q2 EPS   came in at $0.16 on a GAAP basis and $0.82 on a non-GAAP basis.   To understand how we're tracking against our annual targets, I   would like to start by reviewing our first half results followed   by a discussion of our two segments. Looking at our consolidated first half results, we are pleased   to report double-digit revenue growth on a non-GAAP   constant-currency basis. In the first half, revenue increased   7.4% on a GAAP basis, 9.2% on a non-GAAP basis, and 10.6% on a   non-GAAP constant-currency basis. In addition to strong revenue   growth, we increased non-GAAP EPS 20% year-over-year, consistent   with our goal of growing earnings faster than revenue. We're also pleased to report that we are making very good   progress on two key strategic initiatives that we have discussed   on prior calls, our Cloud First strategy in customer engagement   and our software model strategy in cyber intelligence. I would   like to review our progress in more detail by segments. In   Customer Engagement, we're helping customers to address a very   important challenge, reducing their operating costs while   elevating the customer experience. Our strategy is to help   customers simplify, automate and modernize their customer   engagement operations. We help them simplify operations by   decoupling the value-add software applications from the   communications infrastructure. We help them automate processes by   infusing artificial intelligence throughout our portfolio. And we   help them modernize their cloud operations by making the cloud   migration seamless. Today, I would like to focus on reviewing our strong clouds   momentum. At the beginning of the year, we discussed our Cloud   First strategy and provided long-term cloud targets. Customers   have responded well to our Cloud initiatives and we are seeing   the benefits of our Cloud First strategy in our results. In the first half of the year, Customer Engagement's GAAP   revenue increased 8.1%. On a non-GAAP revenue, Customer   Engagement revenue increased 10.8% and more than 12% on a   constant-currency basis. We're pleased with the first half   double-digit growth which is in line with our annual guidance for   this segment. From a mix perspective, in the first half, cloud   represented 25% of our non-GAAP revenue, up from 19% in the first   half of last year. Recurring revenue, which includes both cloud   and maintenance, represented 62% of our non-GAAP revenue, up from   59% in the first half last year. We're encouraged by the pace of   the mix shift, while at the same time achieving double-digit   revenue growth. Now, let's look at our cloud trends more closely. In the first   half of the year, our non-GAAP cloud revenue increased 49%   year-over-year, with SaaS revenue growing a bit faster. We see   improved market adoption with more large customers embracing   cloud deployments. We've seen this trend manifest itself in two   ways. First, new cloud deployments, where customers choose to   deploy new software in the Verint cloud. And second, conversion   of customers existing on-premises deployments to the Verint   cloud. On past calls, we reviewed the opportunity to convert our   installed base with an uplift of at least 2x of maintenance   revenue. We also discussed the expectations that the uplift would   begin to contribute significantly to our revenue growth over the   next three years, as more of our large installed base moves to   the Verint cloud. During the first half, we had several customers convert from   maintenance to the Verint cloud, and while early, we are pleased   to report that the terms of those deals validated the opportunity   for a 2x uplift. To better understand cloud growth, we would like to share ACV   data for new SaaS contracts received within the period. In the   first half of the year, new SaaS ACV increased 84%   year-over-year. And the last 12 months, new SaaS ACV increased   95% year-over-year. As we look forward, we expect new SaaS ACV to   increase more than 80% for the full year. In addition to ACV   growth, we're also pleased to report an increase in the number of   cloud deals with TCV of over $1 million, which reflects a higher   level of interest in cloud for larger enterprises. In the first   half, we had 11 cloud deals with a TCV greater than $1 million   compared to only four in the first half of last year. The average   cloud contract duration approached 2.5 years, a bit longer than   the average last year. The large cloud deals were received during the first six   months of the year, cut across many different verticals and were   [Phonetic] from existing customers as well as new customers,   including competitive displacements. With the growing cloud   adoption in large enterprises across multiple buyers within the   same organization, including in the contact center, customer   experience, branch, back office and marketing functions. These   support our strategy to help different parts of an organization   to collaborate, to drive elevated customer experience, while   reducing their operating costs. Turning to our recent M&A activities. Last quarter, we   discussed a buy versus build approach and reviewed the ForeSee   acquisition in connection with our strategy to accelerate a voice   of the customer roadmap. We discussed ForeSee's low renewal rates   at the time of the acquisition and our plan to improve renewal   rates with introduction of a new unified VoC platform. A new   platform was launched in Q2 and was well received by customers   and industry analysts. For example, Ventana Research said, Verint   solutions have always been leading-edge, but the unified VoC   solution, providing a complete cross-channel view of the   customer, is a true innovation. I'm pleased to share that with   the progress we made with integration and with the introduction   of the new VoC platform ForeSee's renewal rates improved in Q2   from the Q1 level, and we expect continued improvement in the   second half. Moving to a more recent acquisition, at the very end of Q2, we   made another technology tuck-in acquisition of an innovative   cloud company called Transversal. This is a small company with an   annual revenue run rate of around $8 million, breaking even with   an impressive technology team. This is another good example of   our buy versus build approach. The acquisition is accelerating   the roadmap of our machine-learning and artificial intelligence   capabilities to better deliver contextual knowledge to both   agents and self-service bots. As previously discussed, going forward, we expect to continue   providing financial details and discussing the strategic   rationale of our acquisitions, even if immaterial to our   results. In addition to our strong cloud momentum, we continued to   execute well on our automation innovation strategy. During the   first half, our innovation in machine-learning, artificial   intelligence and robotics was widely recognized by industry   analysts. For example, Forrester commented in their recent   conversational artificial intelligence report, Verint's strong   analytics environment stand out from the pack. Also, AI   Breakthrough, another industry research firm, recognized Verint   for innovation and success in artificial intelligence,   machine-learning platforms, smart robotics, analytics and natural   language processing. In summary, we're very pleased with our first half Customer   Engagement results, reflecting the successful execution of our   simplify, automate and modernize the strategy as well as our   commitment to innovation. We saw strong momentum in cloud, driven   by improved cloud adoption in the enterprise market and strong   execution of our Cloud First strategy. Turning to Cyber Intelligence. We are a       global market    leader with a broad portfolio across the cyber intelligence,   cyber security and physical security markets. Our advanced data   mining solutions help customers capture and analyze structured   and unstructured data and gain insights that help accelerate   security investigations. In the first six months of the year,   Cyber Intelligence revenue increased by more than 6%, about 7.5%   on a constant-currency basis. This revenue growth was   accomplished by accelerated margin expansion -- sorry, revenue   growth was accompanied by accelerated margin expansion, which I   will discuss shortly. In Q2, we continued to win large deals around the world,   including an order of approximately $15 million and four orders   with an average size of around $5 million each. We believe these   types of large orders reflect our ability to address the market   -- two trends that we have discussed on past calls. First,   security threats are becoming more complex. And as a result,   security and intelligence organizations find it more difficult to   detect, investigate and neutralize threats and are seeking new   data mining solutions. And second, there is a shortage of data   scientists and cyber analysts, and security organizations are   seeking advanced automation capabilities to perform functions   previously performed by humans. With more than 1,000 customers   and a large solution portfolio, we are well positioned to benefit   from these trends with both existing and new customers. We   continue to expand our customer base and also pleased to report   that we added approximately 50 new customers in the first   half. Over the last few years, we discussed a strategy to shift from   an integrator model to a software model through investments in   unbundling and productizing our data mining software.   Historically, large deals sold under the integrator model   included a fair amount of pass-through hardware and customer   development services, and Verint delivered these professional   services in addition to deploying our data mining software. Shifting to a software model, over the last two years, we have   made product investments, enabling our customers and third-party   integrators to deliver a third-party hardware itself and perform   some of the customer developments using our standard APIs. We   believe there are significant benefits to our customers from the   software productization, making our software easier to implement   and easier to refresh, which is critical in a rapidly evolving   technology landscape. Customers have realized that the integrator   model, which provides them one-stop shop accountability is quite   limited in terms of system openness and the ability to quickly   deploy software enhancements. The investments we've made in the   software model create significant benefits to our customers and   improve our competitive differentiation. During the first half, consistent with our software model   strategy, we saw a reduction in the amount of third-party   hardware we pass through as well as a reduction in our   development services. These reductions came in at a faster pace   than originally planned and led to a 6% increase in gross margin   year-over-year. Overall, we're pleased with the execution of our software   strategy. And excluding pass-through hardware in both periods,   Cyber Intelligence segment revenue increased double digits in the   first half of the year. In summary, we're pleased with our second quarter and first   half results and the progress we've made with our two key   strategic initiatives. In the first half, we increased non-GAAP   revenue double digits on a constant-currency basis, expanded   margins, and increased EPS 20% year-over-year. In Customer   Engagement, we experienced strong cloud momentum and in Cyber   Intelligence, our software model transition progressed ahead of   plan. Now, I would like to turn the call over to Doug to discuss our   financial results and outlook in more detail. Doug?  Douglas Robinson    --   Chief Financial Officer  Yeah, thanks, Dan. Good afternoon, everyone. Our discussion   today will include non-GAAP financial measures. Reconciliation   between GAAP and non-GAAP financial measures is available as Alan   mentioned in our earnings release and in the IR section of our   website. Differences between our GAAP and non-GAAP financial   measures include adjustments related to acquisitions, including   fair value revenue adjustments, amortization of   acquisition-related intangibles, certain other   acquisition-related expenses, stock-based compensation, as well   as certain other items that can vary significantly in amount in   frequency. For certain metrics, it also includes adjustments   related to foreign exchange rates. We're pleased with our strong first half of fiscal '20 and   I'll start today by discussing Q2 and first half, and then I'll   discuss our outlook. Our Q2 results follow a very strong Q1 and   I'll review both our Q2 and the first half results to explain   where we stand at the midpoint of the year. Starting with Q2, non-GAAP revenue came in at a bit over $331   million, a 7% year-over-year increase. On a constant-currency   basis, non-GAAP revenue was $335 million, up 9% over last year's   second quarter. Non-GAAP diluted EPS was $0.82 for Q2, up 8%   year-over-year. Our Q2 revenue reflect an acceleration in our   Cyber Intelligence software model plan, which resulted in a   reduction in our third-party hardware sales, which I'll discuss   later. During the first half, we achieved strong non-GAAP revenue   growth of 9.2% year-over-year and non-GAAP revenue growth on a   constant-currency basis was 10.6%. Non-GAAP gross margin expanded   250 basis points to 67.4%, driven by the acceleration of our   Cyber Intelligence software model. Non-GAAP operating income   increased 17% and non-GAAP operating margins improved by 140   basis points from last year's first half. Adjusted EBITDA increased 15% as margins expanded by 120 basis   points. Non-GAAP diluted EPS increased 20% year-over-year ahead   of our annual guidance of 14%. Now, I'd like to review our Q2 and first half results by   segment. In Q2, non-GAAP Customer Engagement revenue increased 8%   from last year or 9% on a constant-currency basis. As you look   back at our first half results, I'm pleased to report that   non-GAAP revenue increased 11%, which was 12% on a   constant-currency basis. Non-GAAP recurring revenue increased by   nearly 17%. We continued to benefit from high renewal rates for   recurring revenue of approximately 90% and strong growth from new   contracts. As Dan mentioned earlier, the mix of our business is   fundamentally improving as our non-GAAP recurring revenue   represented 62% of total revenue in our Customer Engagement   segment during the first half of fiscal '20, an increase from 59%   in last year's first half. The key driver was a strong growth in   our non-GAAP cloud revenue of nearly 50% year-over-year.   Estimated fully allocated non-GAAP gross margins were up 50 basis   points as we had targeted. Our estimated fully allocated adjusted   EBITDA margins declined a bit from last year, due to the timing   of certain expenses. For the year, we expect these margins to be   up for the year around 28.5%. I'd like to make a few comments about the strong momentum   we're experiencing with our Cloud First strategy. First, the   increase in the number of large deals from enterprise customers   is an important data point suggesting that large enterprises are   starting to adopt cloud faster. As you may know, enterprises move   to the cloud at different paces and we're helping them make this   migration easier. For example, we offer solutions with feature   parity across on-premise and SaaS, allowing a seamless user   transition. The size and breadth of our enterprise customer base   provides significant future growth opportunities as we help them   execute their individual cloud strategies. Second, regarding the strong ACV growth, we discussed in prior   calls for a while that it has been giving customers quotes for   both -- giving customer quotes for both on-premise and SaaS   solutions. In the first six months of the year, we saw more   customers choosing the SaaS option, as evidenced by more than 80%   new SaaS ACV growth. We expect this trend to continue and   currently expect around 80% ACV growth for the year as well. Now let me turn to Cyber Intelligence. In Q2, non-GAAP Cyber   Intelligence revenue increased 7% from last year or 8% on a   constant-currency basis. As we look back on our Cyber   Intelligence segment for the first half of the year, I'm pleased   to report that non-GAAP Cyber Intelligence revenue increased 6%   year-over-year or 7.5% on a constant-currency basis, while at the   same time accelerating our software model plan. As Dan discussed earlier, over the last two years, we have   made product investments, enabling our customers and third-party   integrators to deliver third-party hardware themselves and   perform some of their customer developments using our standard   APIs. During the first half of fiscal '20, we executed well on   the software model and saw a significant reduction in the amount   of third-party hardware we resell. This reduction came in at a   faster pace than really expected and led to a 6% increase in   estimated fully allocated gross margin year-over-year ahead of   our plan. Overall, this is an important strategic objective and we are   pleased to over achieve in the first half, while driving down our   low-margin hardware revenue. As Dan mentioned earlier, excluding   pass-through hardware, we experienced double-digit revenue growth   in the first half of the year. As we continued our first half   investments in our software model strategy, our estimated fully   allocated adjusted EBITDA margin increased by 420 basis points,   less than our gross margin expansion. Now turning to the balance sheet. At the end of Q2, we had   $466 million of cash and short-term investments, including   short-term and long-term restricted cash and investments. We   ended the quarter with net debt of $351 million, including   long-term restricted cash and investments and excluding discounts   and issuance costs primarily associated with our convertible   debt. Year-to-date, cash flow from operations on a GAAP basis was   $98 million, down slightly from last year due to the timing of   collections and payments. For the full year, we expect cash from   operations to increase over last year. Our net debt-to-EBITDA   ratio is 1.1, and we're pleased that Moody's upgraded our   corporate debt rating to Ba2 during the quarter due to our   continued growth and increased profitability. Turning to our annual guidance. We expect total non-GAAP   revenue of $1.375 billion with a range of plus or minus 2%,   reflecting just over 10% growth for the year. From an operating   margin perspective, we expect non-GAAP operating margins in   fiscal '20 of approximately 22%. We expect our non-GAAP quarterly   interest and other expense excluding the potential impact of   foreign exchange to be approximately $5.6 million. Given   volatility in foreign exchange rates, there could be future gains   or losses related to balance sheet translations in our future   results which are not included in our guidance. We expect our   non-GAAP tax rate to be approximately 9% for the year, reflecting   the amount of cash taxes we expect to pay this year. Our cash tax rate is slightly lower than what we were   previously guiding to. Based on lower estimated tax payments, we   now expect to make [Phonetic] across our various entities. Based   on these assumptions and assuming approximately 67.7 million   average diluted shares outstanding for the year, we're expecting   non-GAAP diluted EPS at the midpoint of our revenue guidance to   be approximately $3.65. In addition to our annual guidance, we'd like to provide you   with our current view on how the year will progress. In Q3, we   expect non-GAAP revenue to be similar to Q2, which is consistent   with past years, followed by our usual seasonally strong Q4. We   also expect EPS in Q3 to be similar to Q2. And this concludes our prepared remarks. So operator, can we   please open up the lines for questions? Questions and Answers:  Operator  Thank you. [Operator Instructions] And our first question   comes from Dan Ives with Wedbush Securities. Your line is   open.  Daniel Ives    --   Wedbush Securities -- Analyst  Yeah, thanks. So, can we just talk about on the cloud, just   maybe how the conversations are changing with customers? Now   you're starting to see more strategic deals there and Dan and   Doug, maybe you can just talk about like how things are changing   in the pipeline from a deal flow perspective and maybe just   changes there?  Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors  Yeah, we certainly think that there is a clear change,   especially at the enterprise level, which is the majority of our   business is enterprise focused. And the conversation is changing   from just talking about cloud to actually buying SaaS. We've been   giving customers quotes both ways for quite some time, giving   them the choice to move to the cloud at their own pace. And we   see now more enterprise customers are actually choosing   [Indecipherable] self process, they're choosing the SaaS option.   And I think it's primarily because of the things we've done to   make it seamless for them. Doug mentioned feature parity, which   is an important consideration for customers who want to move   on-prem to cloud, they can maintain the same functionality   without retrain users. And it's the overall cloud security that   we offer and global deployment that we offer. We have now a   pretty scalable cloud operations. We're expecting to finish the   year with ARR approaching $250 million. We have several cloud   partners and one of the largest partners is AWS and we are one of   the top 100 partners of AWS. So we are scaling our   infrastructure, which help us also to provide better pricing,   better security and make enterprise customers very comfortable   with the transition to the cloud. And the evidence is 11 $1 million deals in H1 versus four in   H1 last year, and also longer duration of contract. So these are   all the things that show us that the trend is real. And we talked   about expectation for 80% growth in new SaaS deals, new SaaS ACV   for the year. So we achieved 80% in H1, and we believe we'll   achieve 80% for the year.  Daniel Ives    --   Wedbush Securities -- Analyst  Thanks. I'll go back in the queue.  Operator  Thank you. And our next question comes from Samad Samana with   Jefferies. Your line is open.  Samad Samana    --   Jefferies -- Analyst  Hi. Thanks for taking my questions today. Appreciate it. Maybe   Dan, one for you first. When you think about the characteristics   of the maintenance customers that had moved to SaaS, the early   proof points that you have, is there any particular   characteristics of those customers? Is there any type of pattern   that you're seeing? I know it's a small sample set, but what's   leading them to move from maintenance to SaaS early on that   you've seen that, that might help you as you think about future   conversion opportunities? And I have some follow-up   questions.  Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors  Yeah, that's a very good point. So we -- firstly, we're so   early, so we have a handful of data points. And the point for us   was to continue to validate that the 2x uplift is not only   something that we target, but also it provides benefits to our   customer. So it's a win-win arrangement where they save a lot of   money on their internal data center and internal operations by   moving the cloud operation into the Verint cloud. And I think   that has been validated. We also see that customers, as they move on-prem deployment to   the cloud, typically also interested in expansion, either   expansion of their solution or actually adding more solutions. So   it's a good inflection point for us to discuss with the   customers, something that is more strategic than just saving some   money on changing the deployment to the cloud. We believe that   we'll see in the future, the move to the cloud by enterprises as   a strategic decision and one that can help us to -- in addition   to the uplift to continue our land and expand strategy with these   customers.  Samad Samana    --   Jefferies -- Analyst  Great. And then, Doug, if I could ask some follow-up   questions. So the acquisition of Transversal, I know its   immaterial in terms of the overall size, but how should we think   about whether that business was growing? And then, if I think   about just $8 million, does that imply that the -- that there's   $8 million lower in the core guidance? Just maybe help me think   about the impact of that and how that's factored into numbers,   and [Indecipherable] the company would still be on track on an   organic basis to hit the targets that you've set out for the   year.  Douglas Robinson    --   Chief Financial Officer  Yeah, sure. Transversal is a very small acquisition, it was   primarily technology oriented. They had some nice technology,   wanted to combine with ours. So, we didn't really looked at that   as kind of a run rate continuing business as much as we just   wanted the kind of the code to get to book with ours. It's a   million or two a quarter, kind of offsetting some of the FX   headwind, if you will, so not really additive to Verint   overall.  Samad Samana    --   Jefferies -- Analyst  Okay, great. And then just one more, if you indulge me. I was   just looking at non-GAAP cloud revenue and I think based on the   July investor presentation that you guys have put out, I think   there is maybe a slight quarter-over-quarter dollar decline from   1Q to 2Q. I'm curious if that was just in the managed services   piece or if that was in core SaaS? Maybe I think you can just   help us understand how those two pieces looked this quarter as   well.  Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors  Yeah. So when you look at cloud revenue growth, the growth   comes from a combination of renewal rates of existing accounts   and new deals, right? So obviously, we have very strong new deals   and we also have strong renewals. We talked about 90% renewal.   But you also remember that we discussed that the ForeSee renewals   in Q1 were in the 50s. And while we improved them in Q2, they're   still well below our average renewal rate as expected. We are   working hard on improving the renewal rates in ForeSee, and   that's going to come with the introduction of our VoC platform   which is going very well. But definitely there is an impact on   the sequential growth until we can get the renewal rates to our   average. And whether -- and when you look at the new SaaS deals,   new SaaS ACV, well, it's growing 80%, we would get 11 $1 million   deals, the time between the bookings and the revenue is longer on   bigger deals. So that's also a little bit of a lag between the   booking and the revenue. So overall, we see the cloud revenue   continue to grow in Q3 and Q4. And as I mentioned earlier, we see   the year ending with about [Phonetic] 40% growth in revenue. And   ARR -- the Q4 ARR will be approaching $250 million.  Samad Samana    --   Jefferies -- Analyst  Great. And just one last housekeeping question. So new SaaS   ACV, does that include maintenance conversions that contract for   SaaS [Indecipherable] new ACV bucket as well?  Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors  Yeah, we do include that because they are new SaaS contracts.   But they were, again, a small number so far. They should become a   bigger number over time, but they will -- yes, they will be   included and they will drive this, hopefully, to a much larger   growth rate.  Samad Samana    --   Jefferies -- Analyst  Great. Thank you guys for taking my questions. I really   appreciate it.  Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors  Sure.  Operator  Thank you. We have a question -- a follow-up from Daniel Ives   with Wedbush Securities. Your line is open.  Daniel Ives    --   Wedbush Securities -- Analyst  Yeah. Just one last question. Can you maybe just talk about   hiring plans on the sales force, just given on the cloud side and   maybe some of the hiring plans there? Thanks.  Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors  Yeah. So if you take a closer look at our first half, you can   see that our opex investments actually were substantially in H1.   This is ahead of growth that we expect in H2. So in terms of   hiring and growth and investments, we basically have done that in   H1. We believe that's going to drive the growth in H2. The mix   between H1 has went through is pretty good. The overall number   for Customer Engagement, we did $434 million in the first half.   That's a 48.2% of the year, so that's pretty consistent with the   48%, 52% that we had in prior years. So, we think that we are   pretty good on the investment we made in H1. And if we consider   more investments, it will be toward the end of the year, toward   growth next year. But we're not expecting headcount growth in   H2.  Daniel Ives    --   Wedbush Securities -- Analyst  Great. Thanks.  Operator  Thank you. And our next question comes from Hugh Cunningham   with OpCo. Your line is open.  Hugh Cunningham    --   OpCo -- Analyst  Hi, guys. Thanks for taking my question. First one is   relatively simple. This is just on the Cyber Intelligence side.   So, excluding hardware, you're saying revenue there grew double   digits, which is very encouraging. And I'm trying to understand   what you're seeing in that market. And specifically, what you're   seeing in sort of the important markets, emerging markets --   markets leverage to commodities, etc.  Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors  Yes, clear. So let me first just address the hardware. So to   be clear, why we are -- why we gave this metric of excluding   hardware, that's because we are intentionally driving this   hardware pass-through down. This is in the making for a couple of   years and we now see acceleration, and we're really happy about   it. But it's, obviously, a decline year-over-year. Actually that   the number excluding hardware in H1 this year and last year will   be 12% growth. So we're happy that the portfolio overall,   excluding hardware, is growing 12% in H1. Now, putting that into perspective of the macro environment,   so we clearly hear from customers that the need for advanced data   mining solutions is strong. And government agencies across the   globe are really looking for new advanced technology to help them   combat crime and terror, and the challenges are big and the   security threats are increasing and the need for technology is   certainly there. Obviously, your question about emerging markets and so more   and so forth is, in order to be able to buy, they need to be able   to keep their funding. And there is a changing economic   environment that can impact spending. But I can say that at this   point, we have not seen any evidence that budget has been   negatively impacted across the globe.  Hugh Cunningham    --   OpCo -- Analyst  On that same point on Cyber Intelligence, Dan, the -- do you   have any sort of sense for, you may have said this, I just   forget, where margins can get to in that business if you get   hardware revenue down to where you want it? Or how far down can   you get it basically?  Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors  Yes, yes, absolutely. So the hardware -- specifically, the   hardware was 10% last year and we expect it to be certainly less   than 5% on a -- in the long-term model. But in addition to   hardware reduction, which we are achieving ahead of plan, we also   starting to see the benefits from development services reduction,   so that customers that need to develop some customized software,   they can do it with APIs, they don't have to ask Verint to do it   for them. And that's also another trend of reduction in   development services. So overall, if we look at the last year, 25% of our total   revenue in Cyber came from professional services, which includes   hardware, include development services and include implementation   services, that was 25%. The target we gave -- the three-year   target we gave last quarter is that, by fiscal '22, our   three-year target, we expect this 25% to come down to 15% of our   total revenue. So that's a 10% reduction that will increase the   gross margin to about 70%. So, we see our Cyber business as a growing business with a 70%   gross margin software model. We are also starting to see more   subscriptions, so the recurring part of the business is growing.   And we think these are all very good trends that not only benefit   the Verint financial model, but as we discussed, also customers   see benefits from being able to buy more standard software and   get a much faster refresh cycle that they need in order to keep   this of their current.  Hugh Cunningham    --   OpCo -- Analyst  Sure. Thank you. One last question on CE, Dan. Just sort of a   big picture question. One of the questions we're getting fairly   frequently is about what happens if the economy turns down.   There's some sort of confusing signs out there in the marketplace   right now. Our sense is that with your investments in things like   machine-learning and artificial intelligence and this -- your new   announcement of this voice of the customer platform, these sort   of things sort of decouple you or give you some immunity from a   downturn in the macro economy. And in fact, as your customers   start to respond to a slowing economy that may generate more   business for you. Can you talk about how you look at it?  Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors  Yes. I think that's -- you kind of summed it very well,   because our overall existence in Customer Engagement is really to   help customers reduce operating costs. This is all we do. Well,   we hear from customers that they don't want only to reduce cost,   they want to do it while elevating the customer experience or at   least not see an erosion in the customer experience. So that's   why it has to be with a lot of automation and analytics to make   sure that reduction in operating costs does not come at the   expense of customer dissatisfaction. But the focus on cost reduction, what we've seen in the past,   when the economy turn down negative was a very strong focus,   because customer service is very dependent on people and our   estimate is more than $1 trillion of spending in the industry on   the workforce. So there is typically a focus on how can we make   the workforce more productive, how can we achieve our strategic   goal with less cost. And again, just reducing the workforce or   shifting the workforce to overseas to low-cost areas has proven   not to do the trick. So technology will be more in demand to   allow them to reduce costs while achieving their strategic   objectives.  Hugh Cunningham    --   OpCo -- Analyst  Thanks for taking my questions, and I appreciate it.  Douglas Robinson    --   Chief Financial Officer  Sure, Hugh.  Operator  Thank you. And I'm showing no further questions at this time.   I'd like to turn the call back to Mr. Alan Roden for any closing   remarks.  Alan Roden    --   Senior Vice President, Corporate Development and Investor   Relations  Thank you, operator, and thanks, everyone, for joining our   call tonight. Have a great evening.  Operator  [Operator Closing Remarks].  Duration: 45 minutes  Call participants:  Alan Roden    --   Senior Vice President, Corporate Development and Investor   Relations   Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors   Douglas Robinson    --   Chief Financial Officer   Daniel Ives    --   Wedbush Securities -- Analyst   Samad Samana    --   Jefferies -- Analyst   Hugh Cunningham    --   OpCo -- Analyst   More VRNT analysis   All earnings call transcripts        10 stocks we like better than Verint   Systems     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Verint   Systems wasn't one of them! That's right -- they think   these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " Verint Systems Inc    (NASDAQ: VRNT)        Q2 2019 Earnings Call       Sep 4, 2019 ,   4:30 p.m. ET ",
    " Operator ",
    "Good day, ladies and gentlemen, and welcome to Verint Systems   Second Quarter Earnings Conference Call. [Operator Instructions]   As a reminder, this conference may be recorded. I would now like   to introduce your host for today's conference, Mr. Alan Roden,   Senior Vice President of Corporate Development. You may   begin.",
    " Alan Roden    --   Senior Vice President, Corporate Development and Investor   Relations ",
    "Thank you, operator. Good afternoon, everyone, and thank you   for joining our conference call today. I'm here with Dan Bodner,   Verint's CEO; and Doug Robinson, Verint's CFO.",
    "Before getting started, I'd like to mention that accompanying   our call today is a WebEx with slides. If you'd like to view   these slides in real time during the call, please visit the IR   section of our website at verint.com, click on the Investor   Relations tab, click on the webcast link and select today's   conference call. I'd also like to mention to draw your attention   to the fact that certain matters discussed in this call may   contain forward-looking statements within the meaning of the   Private Security Litigation Reform Act of 1995, and other   provisions of the federal securities laws. These forward-looking   statements are based on management's current expectations and are   not guarantees of future performance. Actual results could differ   materially from those expressed in or implied by the   forward-looking statements. The forward-looking statements are   made as of the date of this call and except as required by law,   Verint assumes no obligation to update or revise them. Investors   are cautioned not to place undue reliance on these   forward-looking statements. For more detailed discussion, how   these and other risk and uncertainties could cause Verint's   actual results to differ materially and those indicated in the   forward-looking statements, please see our Form 10-K for the   fiscal year ended January 31st, 2019, and other filings we make   with the SEC.",
    "The financial measures discussed today include non-GAAP   measures, as we believe investors focus on those measures in   comparing results between periods and among our peer companies.   Our financial outlook and targets are provided only on a non-GAAP   basis. Please see today's WebEx slides or earnings release in the   Investor Relations section of our website at verint.com for a   reconciliation of non-GAAP financial measures to GAAP measures.   Non-GAAP financial information should not be considered in   isolation from, as a substitute for or superior to GAAP financial   information, but is included because management believes it   provides meaningful supplemental information regarding our   operating results when assessing our business and is useful to   investors for informational and comparative purposes. The   non-GAAP financial measures that Company uses have limitations   and may differ from those used by other companies.",
    "Now, I'd like to turn the call over to Dan. Dan?",
    " Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors ",
    "Thank you, Alan. Good afternoon, everyone, and thank you for   joining us today to review our second quarter and first half   results. Q2 revenue came in at $324 million on a GAAP basis and   $331 million on a non-GAAP basis. Excluding the impact of   currency, non-GAAP revenue came in at $335 million, reflecting   8.6% year-over-year growth on a constant-currency basis. Q2 EPS   came in at $0.16 on a GAAP basis and $0.82 on a non-GAAP basis.   To understand how we're tracking against our annual targets, I   would like to start by reviewing our first half results followed   by a discussion of our two segments.",
    "Looking at our consolidated first half results, we are pleased   to report double-digit revenue growth on a non-GAAP   constant-currency basis. In the first half, revenue increased   7.4% on a GAAP basis, 9.2% on a non-GAAP basis, and 10.6% on a   non-GAAP constant-currency basis. In addition to strong revenue   growth, we increased non-GAAP EPS 20% year-over-year, consistent   with our goal of growing earnings faster than revenue.",
    "We're also pleased to report that we are making very good   progress on two key strategic initiatives that we have discussed   on prior calls, our Cloud First strategy in customer engagement   and our software model strategy in cyber intelligence. I would   like to review our progress in more detail by segments. In   Customer Engagement, we're helping customers to address a very   important challenge, reducing their operating costs while   elevating the customer experience. Our strategy is to help   customers simplify, automate and modernize their customer   engagement operations. We help them simplify operations by   decoupling the value-add software applications from the   communications infrastructure. We help them automate processes by   infusing artificial intelligence throughout our portfolio. And we   help them modernize their cloud operations by making the cloud   migration seamless.",
    "Today, I would like to focus on reviewing our strong clouds   momentum. At the beginning of the year, we discussed our Cloud   First strategy and provided long-term cloud targets. Customers   have responded well to our Cloud initiatives and we are seeing   the benefits of our Cloud First strategy in our results.",
    "In the first half of the year, Customer Engagement's GAAP   revenue increased 8.1%. On a non-GAAP revenue, Customer   Engagement revenue increased 10.8% and more than 12% on a   constant-currency basis. We're pleased with the first half   double-digit growth which is in line with our annual guidance for   this segment. From a mix perspective, in the first half, cloud   represented 25% of our non-GAAP revenue, up from 19% in the first   half of last year. Recurring revenue, which includes both cloud   and maintenance, represented 62% of our non-GAAP revenue, up from   59% in the first half last year. We're encouraged by the pace of   the mix shift, while at the same time achieving double-digit   revenue growth.",
    "Now, let's look at our cloud trends more closely. In the first   half of the year, our non-GAAP cloud revenue increased 49%   year-over-year, with SaaS revenue growing a bit faster. We see   improved market adoption with more large customers embracing   cloud deployments. We've seen this trend manifest itself in two   ways. First, new cloud deployments, where customers choose to   deploy new software in the Verint cloud. And second, conversion   of customers existing on-premises deployments to the Verint   cloud.",
    "On past calls, we reviewed the opportunity to convert our   installed base with an uplift of at least 2x of maintenance   revenue. We also discussed the expectations that the uplift would   begin to contribute significantly to our revenue growth over the   next three years, as more of our large installed base moves to   the Verint cloud.",
    "During the first half, we had several customers convert from   maintenance to the Verint cloud, and while early, we are pleased   to report that the terms of those deals validated the opportunity   for a 2x uplift.",
    "To better understand cloud growth, we would like to share ACV   data for new SaaS contracts received within the period. In the   first half of the year, new SaaS ACV increased 84%   year-over-year. And the last 12 months, new SaaS ACV increased   95% year-over-year. As we look forward, we expect new SaaS ACV to   increase more than 80% for the full year. In addition to ACV   growth, we're also pleased to report an increase in the number of   cloud deals with TCV of over $1 million, which reflects a higher   level of interest in cloud for larger enterprises. In the first   half, we had 11 cloud deals with a TCV greater than $1 million   compared to only four in the first half of last year. The average   cloud contract duration approached 2.5 years, a bit longer than   the average last year.",
    "The large cloud deals were received during the first six   months of the year, cut across many different verticals and were   [Phonetic] from existing customers as well as new customers,   including competitive displacements. With the growing cloud   adoption in large enterprises across multiple buyers within the   same organization, including in the contact center, customer   experience, branch, back office and marketing functions. These   support our strategy to help different parts of an organization   to collaborate, to drive elevated customer experience, while   reducing their operating costs.",
    "Turning to our recent M&A activities. Last quarter, we   discussed a buy versus build approach and reviewed the ForeSee   acquisition in connection with our strategy to accelerate a voice   of the customer roadmap. We discussed ForeSee's low renewal rates   at the time of the acquisition and our plan to improve renewal   rates with introduction of a new unified VoC platform. A new   platform was launched in Q2 and was well received by customers   and industry analysts. For example, Ventana Research said, Verint   solutions have always been leading-edge, but the unified VoC   solution, providing a complete cross-channel view of the   customer, is a true innovation. I'm pleased to share that with   the progress we made with integration and with the introduction   of the new VoC platform ForeSee's renewal rates improved in Q2   from the Q1 level, and we expect continued improvement in the   second half.",
    "Moving to a more recent acquisition, at the very end of Q2, we   made another technology tuck-in acquisition of an innovative   cloud company called Transversal. This is a small company with an   annual revenue run rate of around $8 million, breaking even with   an impressive technology team. This is another good example of   our buy versus build approach. The acquisition is accelerating   the roadmap of our machine-learning and artificial intelligence   capabilities to better deliver contextual knowledge to both   agents and self-service bots.",
    "As previously discussed, going forward, we expect to continue   providing financial details and discussing the strategic   rationale of our acquisitions, even if immaterial to our   results.",
    "In addition to our strong cloud momentum, we continued to   execute well on our automation innovation strategy. During the   first half, our innovation in machine-learning, artificial   intelligence and robotics was widely recognized by industry   analysts. For example, Forrester commented in their recent   conversational artificial intelligence report, Verint's strong   analytics environment stand out from the pack. Also, AI   Breakthrough, another industry research firm, recognized Verint   for innovation and success in artificial intelligence,   machine-learning platforms, smart robotics, analytics and natural   language processing.",
    "In summary, we're very pleased with our first half Customer   Engagement results, reflecting the successful execution of our   simplify, automate and modernize the strategy as well as our   commitment to innovation. We saw strong momentum in cloud, driven   by improved cloud adoption in the enterprise market and strong   execution of our Cloud First strategy.",
    "Turning to Cyber Intelligence. We are a       global market    leader with a broad portfolio across the cyber intelligence,   cyber security and physical security markets. Our advanced data   mining solutions help customers capture and analyze structured   and unstructured data and gain insights that help accelerate   security investigations. In the first six months of the year,   Cyber Intelligence revenue increased by more than 6%, about 7.5%   on a constant-currency basis. This revenue growth was   accomplished by accelerated margin expansion -- sorry, revenue   growth was accompanied by accelerated margin expansion, which I   will discuss shortly.",
    "In Q2, we continued to win large deals around the world,   including an order of approximately $15 million and four orders   with an average size of around $5 million each. We believe these   types of large orders reflect our ability to address the market   -- two trends that we have discussed on past calls. First,   security threats are becoming more complex. And as a result,   security and intelligence organizations find it more difficult to   detect, investigate and neutralize threats and are seeking new   data mining solutions. And second, there is a shortage of data   scientists and cyber analysts, and security organizations are   seeking advanced automation capabilities to perform functions   previously performed by humans. With more than 1,000 customers   and a large solution portfolio, we are well positioned to benefit   from these trends with both existing and new customers. We   continue to expand our customer base and also pleased to report   that we added approximately 50 new customers in the first   half.",
    "Over the last few years, we discussed a strategy to shift from   an integrator model to a software model through investments in   unbundling and productizing our data mining software.   Historically, large deals sold under the integrator model   included a fair amount of pass-through hardware and customer   development services, and Verint delivered these professional   services in addition to deploying our data mining software.",
    "Shifting to a software model, over the last two years, we have   made product investments, enabling our customers and third-party   integrators to deliver a third-party hardware itself and perform   some of the customer developments using our standard APIs. We   believe there are significant benefits to our customers from the   software productization, making our software easier to implement   and easier to refresh, which is critical in a rapidly evolving   technology landscape. Customers have realized that the integrator   model, which provides them one-stop shop accountability is quite   limited in terms of system openness and the ability to quickly   deploy software enhancements. The investments we've made in the   software model create significant benefits to our customers and   improve our competitive differentiation.",
    "During the first half, consistent with our software model   strategy, we saw a reduction in the amount of third-party   hardware we pass through as well as a reduction in our   development services. These reductions came in at a faster pace   than originally planned and led to a 6% increase in gross margin   year-over-year.",
    "Overall, we're pleased with the execution of our software   strategy. And excluding pass-through hardware in both periods,   Cyber Intelligence segment revenue increased double digits in the   first half of the year.",
    "In summary, we're pleased with our second quarter and first   half results and the progress we've made with our two key   strategic initiatives. In the first half, we increased non-GAAP   revenue double digits on a constant-currency basis, expanded   margins, and increased EPS 20% year-over-year. In Customer   Engagement, we experienced strong cloud momentum and in Cyber   Intelligence, our software model transition progressed ahead of   plan.",
    "Now, I would like to turn the call over to Doug to discuss our   financial results and outlook in more detail. Doug?",
    " Douglas Robinson    --   Chief Financial Officer ",
    "Yeah, thanks, Dan. Good afternoon, everyone. Our discussion   today will include non-GAAP financial measures. Reconciliation   between GAAP and non-GAAP financial measures is available as Alan   mentioned in our earnings release and in the IR section of our   website. Differences between our GAAP and non-GAAP financial   measures include adjustments related to acquisitions, including   fair value revenue adjustments, amortization of   acquisition-related intangibles, certain other   acquisition-related expenses, stock-based compensation, as well   as certain other items that can vary significantly in amount in   frequency. For certain metrics, it also includes adjustments   related to foreign exchange rates.",
    "We're pleased with our strong first half of fiscal '20 and   I'll start today by discussing Q2 and first half, and then I'll   discuss our outlook. Our Q2 results follow a very strong Q1 and   I'll review both our Q2 and the first half results to explain   where we stand at the midpoint of the year.",
    "Starting with Q2, non-GAAP revenue came in at a bit over $331   million, a 7% year-over-year increase. On a constant-currency   basis, non-GAAP revenue was $335 million, up 9% over last year's   second quarter. Non-GAAP diluted EPS was $0.82 for Q2, up 8%   year-over-year. Our Q2 revenue reflect an acceleration in our   Cyber Intelligence software model plan, which resulted in a   reduction in our third-party hardware sales, which I'll discuss   later.",
    "During the first half, we achieved strong non-GAAP revenue   growth of 9.2% year-over-year and non-GAAP revenue growth on a   constant-currency basis was 10.6%. Non-GAAP gross margin expanded   250 basis points to 67.4%, driven by the acceleration of our   Cyber Intelligence software model. Non-GAAP operating income   increased 17% and non-GAAP operating margins improved by 140   basis points from last year's first half.",
    "Adjusted EBITDA increased 15% as margins expanded by 120 basis   points. Non-GAAP diluted EPS increased 20% year-over-year ahead   of our annual guidance of 14%.",
    "Now, I'd like to review our Q2 and first half results by   segment. In Q2, non-GAAP Customer Engagement revenue increased 8%   from last year or 9% on a constant-currency basis. As you look   back at our first half results, I'm pleased to report that   non-GAAP revenue increased 11%, which was 12% on a   constant-currency basis. Non-GAAP recurring revenue increased by   nearly 17%. We continued to benefit from high renewal rates for   recurring revenue of approximately 90% and strong growth from new   contracts.",
    "As Dan mentioned earlier, the mix of our business is   fundamentally improving as our non-GAAP recurring revenue   represented 62% of total revenue in our Customer Engagement   segment during the first half of fiscal '20, an increase from 59%   in last year's first half. The key driver was a strong growth in   our non-GAAP cloud revenue of nearly 50% year-over-year.   Estimated fully allocated non-GAAP gross margins were up 50 basis   points as we had targeted. Our estimated fully allocated adjusted   EBITDA margins declined a bit from last year, due to the timing   of certain expenses. For the year, we expect these margins to be   up for the year around 28.5%.",
    "I'd like to make a few comments about the strong momentum   we're experiencing with our Cloud First strategy. First, the   increase in the number of large deals from enterprise customers   is an important data point suggesting that large enterprises are   starting to adopt cloud faster. As you may know, enterprises move   to the cloud at different paces and we're helping them make this   migration easier. For example, we offer solutions with feature   parity across on-premise and SaaS, allowing a seamless user   transition. The size and breadth of our enterprise customer base   provides significant future growth opportunities as we help them   execute their individual cloud strategies.",
    "Second, regarding the strong ACV growth, we discussed in prior   calls for a while that it has been giving customers quotes for   both -- giving customer quotes for both on-premise and SaaS   solutions. In the first six months of the year, we saw more   customers choosing the SaaS option, as evidenced by more than 80%   new SaaS ACV growth. We expect this trend to continue and   currently expect around 80% ACV growth for the year as well.",
    "Now let me turn to Cyber Intelligence. In Q2, non-GAAP Cyber   Intelligence revenue increased 7% from last year or 8% on a   constant-currency basis. As we look back on our Cyber   Intelligence segment for the first half of the year, I'm pleased   to report that non-GAAP Cyber Intelligence revenue increased 6%   year-over-year or 7.5% on a constant-currency basis, while at the   same time accelerating our software model plan.",
    "As Dan discussed earlier, over the last two years, we have   made product investments, enabling our customers and third-party   integrators to deliver third-party hardware themselves and   perform some of their customer developments using our standard   APIs. During the first half of fiscal '20, we executed well on   the software model and saw a significant reduction in the amount   of third-party hardware we resell. This reduction came in at a   faster pace than really expected and led to a 6% increase in   estimated fully allocated gross margin year-over-year ahead of   our plan.",
    "Overall, this is an important strategic objective and we are   pleased to over achieve in the first half, while driving down our   low-margin hardware revenue. As Dan mentioned earlier, excluding   pass-through hardware, we experienced double-digit revenue growth   in the first half of the year. As we continued our first half   investments in our software model strategy, our estimated fully   allocated adjusted EBITDA margin increased by 420 basis points,   less than our gross margin expansion.",
    "Now turning to the balance sheet. At the end of Q2, we had   $466 million of cash and short-term investments, including   short-term and long-term restricted cash and investments. We   ended the quarter with net debt of $351 million, including   long-term restricted cash and investments and excluding discounts   and issuance costs primarily associated with our convertible   debt.",
    "Year-to-date, cash flow from operations on a GAAP basis was   $98 million, down slightly from last year due to the timing of   collections and payments. For the full year, we expect cash from   operations to increase over last year. Our net debt-to-EBITDA   ratio is 1.1, and we're pleased that Moody's upgraded our   corporate debt rating to Ba2 during the quarter due to our   continued growth and increased profitability.",
    "Turning to our annual guidance. We expect total non-GAAP   revenue of $1.375 billion with a range of plus or minus 2%,   reflecting just over 10% growth for the year. From an operating   margin perspective, we expect non-GAAP operating margins in   fiscal '20 of approximately 22%. We expect our non-GAAP quarterly   interest and other expense excluding the potential impact of   foreign exchange to be approximately $5.6 million. Given   volatility in foreign exchange rates, there could be future gains   or losses related to balance sheet translations in our future   results which are not included in our guidance. We expect our   non-GAAP tax rate to be approximately 9% for the year, reflecting   the amount of cash taxes we expect to pay this year.",
    "Our cash tax rate is slightly lower than what we were   previously guiding to. Based on lower estimated tax payments, we   now expect to make [Phonetic] across our various entities. Based   on these assumptions and assuming approximately 67.7 million   average diluted shares outstanding for the year, we're expecting   non-GAAP diluted EPS at the midpoint of our revenue guidance to   be approximately $3.65.",
    "In addition to our annual guidance, we'd like to provide you   with our current view on how the year will progress. In Q3, we   expect non-GAAP revenue to be similar to Q2, which is consistent   with past years, followed by our usual seasonally strong Q4. We   also expect EPS in Q3 to be similar to Q2.",
    "And this concludes our prepared remarks. So operator, can we   please open up the lines for questions?",
    " Operator ",
    "Thank you. [Operator Instructions] And our first question   comes from Dan Ives with Wedbush Securities. Your line is   open.",
    " Daniel Ives    --   Wedbush Securities -- Analyst ",
    "Yeah, thanks. So, can we just talk about on the cloud, just   maybe how the conversations are changing with customers? Now   you're starting to see more strategic deals there and Dan and   Doug, maybe you can just talk about like how things are changing   in the pipeline from a deal flow perspective and maybe just   changes there?",
    " Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors ",
    "Yeah, we certainly think that there is a clear change,   especially at the enterprise level, which is the majority of our   business is enterprise focused. And the conversation is changing   from just talking about cloud to actually buying SaaS. We've been   giving customers quotes both ways for quite some time, giving   them the choice to move to the cloud at their own pace. And we   see now more enterprise customers are actually choosing   [Indecipherable] self process, they're choosing the SaaS option.   And I think it's primarily because of the things we've done to   make it seamless for them. Doug mentioned feature parity, which   is an important consideration for customers who want to move   on-prem to cloud, they can maintain the same functionality   without retrain users. And it's the overall cloud security that   we offer and global deployment that we offer. We have now a   pretty scalable cloud operations. We're expecting to finish the   year with ARR approaching $250 million. We have several cloud   partners and one of the largest partners is AWS and we are one of   the top 100 partners of AWS. So we are scaling our   infrastructure, which help us also to provide better pricing,   better security and make enterprise customers very comfortable   with the transition to the cloud.",
    "And the evidence is 11 $1 million deals in H1 versus four in   H1 last year, and also longer duration of contract. So these are   all the things that show us that the trend is real. And we talked   about expectation for 80% growth in new SaaS deals, new SaaS ACV   for the year. So we achieved 80% in H1, and we believe we'll   achieve 80% for the year.",
    " Daniel Ives    --   Wedbush Securities -- Analyst ",
    "Thanks. I'll go back in the queue.",
    " Operator ",
    "Thank you. And our next question comes from Samad Samana with   Jefferies. Your line is open.",
    " Samad Samana    --   Jefferies -- Analyst ",
    "Hi. Thanks for taking my questions today. Appreciate it. Maybe   Dan, one for you first. When you think about the characteristics   of the maintenance customers that had moved to SaaS, the early   proof points that you have, is there any particular   characteristics of those customers? Is there any type of pattern   that you're seeing? I know it's a small sample set, but what's   leading them to move from maintenance to SaaS early on that   you've seen that, that might help you as you think about future   conversion opportunities? And I have some follow-up   questions.",
    " Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors ",
    "Yeah, that's a very good point. So we -- firstly, we're so   early, so we have a handful of data points. And the point for us   was to continue to validate that the 2x uplift is not only   something that we target, but also it provides benefits to our   customer. So it's a win-win arrangement where they save a lot of   money on their internal data center and internal operations by   moving the cloud operation into the Verint cloud. And I think   that has been validated.",
    "We also see that customers, as they move on-prem deployment to   the cloud, typically also interested in expansion, either   expansion of their solution or actually adding more solutions. So   it's a good inflection point for us to discuss with the   customers, something that is more strategic than just saving some   money on changing the deployment to the cloud. We believe that   we'll see in the future, the move to the cloud by enterprises as   a strategic decision and one that can help us to -- in addition   to the uplift to continue our land and expand strategy with these   customers.",
    " Samad Samana    --   Jefferies -- Analyst ",
    "Great. And then, Doug, if I could ask some follow-up   questions. So the acquisition of Transversal, I know its   immaterial in terms of the overall size, but how should we think   about whether that business was growing? And then, if I think   about just $8 million, does that imply that the -- that there's   $8 million lower in the core guidance? Just maybe help me think   about the impact of that and how that's factored into numbers,   and [Indecipherable] the company would still be on track on an   organic basis to hit the targets that you've set out for the   year.",
    " Douglas Robinson    --   Chief Financial Officer ",
    "Yeah, sure. Transversal is a very small acquisition, it was   primarily technology oriented. They had some nice technology,   wanted to combine with ours. So, we didn't really looked at that   as kind of a run rate continuing business as much as we just   wanted the kind of the code to get to book with ours. It's a   million or two a quarter, kind of offsetting some of the FX   headwind, if you will, so not really additive to Verint   overall.",
    " Samad Samana    --   Jefferies -- Analyst ",
    "Okay, great. And then just one more, if you indulge me. I was   just looking at non-GAAP cloud revenue and I think based on the   July investor presentation that you guys have put out, I think   there is maybe a slight quarter-over-quarter dollar decline from   1Q to 2Q. I'm curious if that was just in the managed services   piece or if that was in core SaaS? Maybe I think you can just   help us understand how those two pieces looked this quarter as   well.",
    " Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors ",
    "Yeah. So when you look at cloud revenue growth, the growth   comes from a combination of renewal rates of existing accounts   and new deals, right? So obviously, we have very strong new deals   and we also have strong renewals. We talked about 90% renewal.   But you also remember that we discussed that the ForeSee renewals   in Q1 were in the 50s. And while we improved them in Q2, they're   still well below our average renewal rate as expected. We are   working hard on improving the renewal rates in ForeSee, and   that's going to come with the introduction of our VoC platform   which is going very well. But definitely there is an impact on   the sequential growth until we can get the renewal rates to our   average. And whether -- and when you look at the new SaaS deals,   new SaaS ACV, well, it's growing 80%, we would get 11 $1 million   deals, the time between the bookings and the revenue is longer on   bigger deals. So that's also a little bit of a lag between the   booking and the revenue. So overall, we see the cloud revenue   continue to grow in Q3 and Q4. And as I mentioned earlier, we see   the year ending with about [Phonetic] 40% growth in revenue. And   ARR -- the Q4 ARR will be approaching $250 million.",
    " Samad Samana    --   Jefferies -- Analyst ",
    "Great. And just one last housekeeping question. So new SaaS   ACV, does that include maintenance conversions that contract for   SaaS [Indecipherable] new ACV bucket as well?",
    " Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors ",
    "Yeah, we do include that because they are new SaaS contracts.   But they were, again, a small number so far. They should become a   bigger number over time, but they will -- yes, they will be   included and they will drive this, hopefully, to a much larger   growth rate.",
    " Samad Samana    --   Jefferies -- Analyst ",
    "Great. Thank you guys for taking my questions. I really   appreciate it.",
    " Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors ",
    "Sure.",
    " Operator ",
    "Thank you. We have a question -- a follow-up from Daniel Ives   with Wedbush Securities. Your line is open.",
    " Daniel Ives    --   Wedbush Securities -- Analyst ",
    "Yeah. Just one last question. Can you maybe just talk about   hiring plans on the sales force, just given on the cloud side and   maybe some of the hiring plans there? Thanks.",
    " Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors ",
    "Yeah. So if you take a closer look at our first half, you can   see that our opex investments actually were substantially in H1.   This is ahead of growth that we expect in H2. So in terms of   hiring and growth and investments, we basically have done that in   H1. We believe that's going to drive the growth in H2. The mix   between H1 has went through is pretty good. The overall number   for Customer Engagement, we did $434 million in the first half.   That's a 48.2% of the year, so that's pretty consistent with the   48%, 52% that we had in prior years. So, we think that we are   pretty good on the investment we made in H1. And if we consider   more investments, it will be toward the end of the year, toward   growth next year. But we're not expecting headcount growth in   H2.",
    " Daniel Ives    --   Wedbush Securities -- Analyst ",
    "Great. Thanks.",
    " Operator ",
    "Thank you. And our next question comes from Hugh Cunningham   with OpCo. Your line is open.",
    " Hugh Cunningham    --   OpCo -- Analyst ",
    "Hi, guys. Thanks for taking my question. First one is   relatively simple. This is just on the Cyber Intelligence side.   So, excluding hardware, you're saying revenue there grew double   digits, which is very encouraging. And I'm trying to understand   what you're seeing in that market. And specifically, what you're   seeing in sort of the important markets, emerging markets --   markets leverage to commodities, etc.",
    " Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors ",
    "Yes, clear. So let me first just address the hardware. So to   be clear, why we are -- why we gave this metric of excluding   hardware, that's because we are intentionally driving this   hardware pass-through down. This is in the making for a couple of   years and we now see acceleration, and we're really happy about   it. But it's, obviously, a decline year-over-year. Actually that   the number excluding hardware in H1 this year and last year will   be 12% growth. So we're happy that the portfolio overall,   excluding hardware, is growing 12% in H1.",
    "Now, putting that into perspective of the macro environment,   so we clearly hear from customers that the need for advanced data   mining solutions is strong. And government agencies across the   globe are really looking for new advanced technology to help them   combat crime and terror, and the challenges are big and the   security threats are increasing and the need for technology is   certainly there.",
    "Obviously, your question about emerging markets and so more   and so forth is, in order to be able to buy, they need to be able   to keep their funding. And there is a changing economic   environment that can impact spending. But I can say that at this   point, we have not seen any evidence that budget has been   negatively impacted across the globe.",
    " Hugh Cunningham    --   OpCo -- Analyst ",
    "On that same point on Cyber Intelligence, Dan, the -- do you   have any sort of sense for, you may have said this, I just   forget, where margins can get to in that business if you get   hardware revenue down to where you want it? Or how far down can   you get it basically?",
    " Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors ",
    "Yes, yes, absolutely. So the hardware -- specifically, the   hardware was 10% last year and we expect it to be certainly less   than 5% on a -- in the long-term model. But in addition to   hardware reduction, which we are achieving ahead of plan, we also   starting to see the benefits from development services reduction,   so that customers that need to develop some customized software,   they can do it with APIs, they don't have to ask Verint to do it   for them. And that's also another trend of reduction in   development services.",
    "So overall, if we look at the last year, 25% of our total   revenue in Cyber came from professional services, which includes   hardware, include development services and include implementation   services, that was 25%. The target we gave -- the three-year   target we gave last quarter is that, by fiscal '22, our   three-year target, we expect this 25% to come down to 15% of our   total revenue. So that's a 10% reduction that will increase the   gross margin to about 70%.",
    "So, we see our Cyber business as a growing business with a 70%   gross margin software model. We are also starting to see more   subscriptions, so the recurring part of the business is growing.   And we think these are all very good trends that not only benefit   the Verint financial model, but as we discussed, also customers   see benefits from being able to buy more standard software and   get a much faster refresh cycle that they need in order to keep   this of their current.",
    " Hugh Cunningham    --   OpCo -- Analyst ",
    "Sure. Thank you. One last question on CE, Dan. Just sort of a   big picture question. One of the questions we're getting fairly   frequently is about what happens if the economy turns down.   There's some sort of confusing signs out there in the marketplace   right now. Our sense is that with your investments in things like   machine-learning and artificial intelligence and this -- your new   announcement of this voice of the customer platform, these sort   of things sort of decouple you or give you some immunity from a   downturn in the macro economy. And in fact, as your customers   start to respond to a slowing economy that may generate more   business for you. Can you talk about how you look at it?",
    " Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors ",
    "Yes. I think that's -- you kind of summed it very well,   because our overall existence in Customer Engagement is really to   help customers reduce operating costs. This is all we do. Well,   we hear from customers that they don't want only to reduce cost,   they want to do it while elevating the customer experience or at   least not see an erosion in the customer experience. So that's   why it has to be with a lot of automation and analytics to make   sure that reduction in operating costs does not come at the   expense of customer dissatisfaction.",
    "But the focus on cost reduction, what we've seen in the past,   when the economy turn down negative was a very strong focus,   because customer service is very dependent on people and our   estimate is more than $1 trillion of spending in the industry on   the workforce. So there is typically a focus on how can we make   the workforce more productive, how can we achieve our strategic   goal with less cost. And again, just reducing the workforce or   shifting the workforce to overseas to low-cost areas has proven   not to do the trick. So technology will be more in demand to   allow them to reduce costs while achieving their strategic   objectives.",
    " Hugh Cunningham    --   OpCo -- Analyst ",
    "Thanks for taking my questions, and I appreciate it.",
    " Douglas Robinson    --   Chief Financial Officer ",
    "Sure, Hugh.",
    " Operator ",
    "Thank you. And I'm showing no further questions at this time.   I'd like to turn the call back to Mr. Alan Roden for any closing   remarks.",
    " Alan Roden    --   Senior Vice President, Corporate Development and Investor   Relations ",
    "Thank you, operator, and thanks, everyone, for joining our   call tonight. Have a great evening.",
    " Operator ",
    "[Operator Closing Remarks].",
    " Duration: 45 minutes ",
    " Alan Roden    --   Senior Vice President, Corporate Development and Investor   Relations ",
    " Dan Bodner    --   President, Chief Executive Officer and Chairman of the Board   of Directors ",
    " Douglas Robinson    --   Chief Financial Officer ",
    " Daniel Ives    --   Wedbush Securities -- Analyst ",
    " Samad Samana    --   Jefferies -- Analyst ",
    " Hugh Cunningham    --   OpCo -- Analyst ",
    " More VRNT analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than Verint   Systems     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Verint   Systems wasn't one of them! That's right -- they think   these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 07:23:19"
}