{
  "url": "https://www.nasdaq.com/article/major-plan-for-puerto-rico-debt-coming-this-month-attorney-20190911-00650",
  "title": "Major plan for Puerto Rico debt coming this month -attorney - Nasdaq.com",
  "text": [
    "By Luis Valentin Ortiz",
    "SAN JUAN, Sept 11 (Reuters) - A long-awaited plan to restructure Puerto Rico's core government debt will finally be filed in court later this month, an attorney for the bankrupt U.S. commonwealth's federally created financial oversight board told a federal judge on Wednesday.",
    "Martin Bienenstock said the latest delay was due to political turmoil on the island that led to last month's resignation of Governor Ricardo Rossello, who was eventually replaced by Wanda Vazquez. ",
    "The board had signaled it could file a plan of adjustment covering roughly $13 billion of bonds and almost $50 billion of unfunded pension obligations as early as April, then set subsequent but vague deadlines in the following months. ",
    "Puerto Rico entered bankruptcy in May 2017 to restructure $120 billion of debt and pension obligations.",
    "Bienenstock said \"the relationship between the new government and the oversight board is positive.\" Vazquez, who had been Puerto Rico's justice secretary, has been meeting with oversight board officials. Her predecessor, Rossello, had been at odds with the board over spending priorities and other matters, including proposed pension cuts.",
    "Earlier this year, the board asked U.S. District Court Judge Laura Taylor Swain, who is hearing the island's bankruptcy cases, to void billions of dollars of general obligation bonds. It also sued certain bondholders to recoup debt service payments and Wall Street banks and firms that participated in debt issuances. ",
    "The board in June announced deals with some creditors over recovery rates for certain bonds and for a pension restructuring. ",
    "In July, Swain ordered mediation that could extend into November over the validity of Puerto Rico's GO and other bonds, as well as for other disputes.",
    "So far, Puerto Rico has won court approval for restructurings of debt from its Government Development Bank and Sales Tax Financing Corporation known as COFINA. On Monday, the Puerto Rico Electric Power Authority move closer to exiting bankruptcy when two holdout bond insurers joined a deal to restructure its debt. "
  ],
  "published_datetime": "2019-09-11 01:17:00"
}