{
  "url": "https://www.nasdaq.com/article/top-3-cannabis-stocks-to-buy-ahead-of-canadas-20-legalization-cm1208166",
  "title": "Top 3 Cannabis Stocks to Buy Ahead of Canada's 2.0 Legalization - Nasdaq.com",
  "text": [
    " Canada officially legalized dried cannabis flower, oils, and   sprays for recreational use last year. However, there were many   other marijuana products left off the table. Most notably   excluded were cannabinoid-based edibles, beverages, topicals, and   concentrates. By extracting CBD from cannabis and hemp, consumers   can enjoy the health and other benefits of cannabis without the   feeling of getting high, which is the result of another compound   found in marijuana, tetrahydrocannabinol known as THC. What is important is that these CBD-derivative products have   higher profit margins and are easier to sell to consumers who   don't typically consume marijuana. With regular dried sales   beginning to slow down in some states due to oversupply, CBD   consumables are the next logical path for cannabis companies to   expand into. As investors eagerly anticipate October 17, the day when   Canada will   legalize    these CBD products for recreational distribution, many companies   have been preparing their own product lines for launch.makeArticleAd();   IMAGE SOURCE: GETTY IMAGES  The sheer potential of the CBD derivatives market The CBD-derivatives market has been growing at an exponential   rate over the past few years, growing from $200 million in 2016   to now being projected to hit $1 billion by the end of 2019. Many   industry experts are predicting that the U.S. and Canadian CBD   markets will be   $3 billion    by 2021, while more optimistic estimates suggest that the market   could hit as much as $16 billion by 2022. CBD edibles and beverages are more accessible to consumers who   are curious about cannabis but might not have tried smoking dried   flower yet, possibly due to the pre-existing stigma surrounding   recreational use. These products are the perfect entry point for   consumers and could easily transition into using other cannabis   products in the future. With this in mind, here are some companies that are   well-positioned to take advantage of this coming second round of   legalization in Canada. 1. HEXO Corp The Quebec-based   HEXO    (NYSE: HEXO) has seen its shares fall by almost 50% since April,   leading some investors to see a potential value investment at   this low-price tag. When looking at industry benchmarks like the   Horizons Marijuana Life Sciences ETF, which has fallen by 39.1%   over the same time period, it seems that HEXO has been   underperforming the market. However, that's not necessarily HEXO's fault. Many Canadian   producers have been hamstrung by ongoing supply problems with the   local provinces despite strong production figures, leading to a   buildup in inventory and a decline in sales. Once this issue   clears up, sales are expected to rise, although its anyone's   guess when the problem will resolve itself. Even putting the supply glut to the side, HEXO still has a   number of advantages over its competitors. Its enviable joint   venture agreement with   Molson Coors Brewing     to produce CBD infused beverages could easily make it a   leader in this market. When taking a deeper look into the   company, HEXO has also devoted more than 600,000 square feet of   its facilities to the cultivation and procession of CBD products.   From a sheer output perspective, HEXO is at the forefront of CBD   derivative production. Combined with the fact that it's is   expected to see its sales spike from $59.7 million in 2019 to   potentially almost $400 million in 2020, HEXO seems well poised   to make a   major comeback    this fall. 2. OrganiGram Holdings Another pot stock that lost much of its value recently is   OrganiGram Holdings    (NASDAQ: OGI) , which fell by 30% in August alone. While Health   Canada has been arduously slow in approving sales licenses for   the company, there hasn't any major development that would have   caused this decline besides the postponing the launch of its CBD   derivative product line to December rather than October as   previously planned. OrganiGram is unique compared to other producers for a couple   of reasons. While most growers are based in Ontario, Quebec, or   British Colombia, OrganiGram is based out of Canada's Atlantic   region in the province of New Brunswick. Although being the   leader in a less populated region might not seem as advantageous,   Canada's eastern-most provinces have seen the highest adult-use   rates for cannabis in the entire country. At the same time, OrganiGram is one of the few Canadian   cultivators to boast supply agreements with all ten provinces in   the country. This is a big deal as it puts OrganiGram in the same   league with giants like   Canopy Growth    ,   Aphria    , and the   now floundering   CannTrust Holdings     , the only other companies with supply agreements in place with   every province. As such, the comparatively smaller OrganiGram   would be the leader in the high-use, less competitive Atlantic   market while still having access to the other major   provinces. 3. MediPharm Labs Unlike the other two companies, MediPharm Labs (OTC: MEDIF) is   an extraction-service provider rather than a cannabis producer.   Extraction-based providers like MediPharm and   Valens Groworks     have been seen in a bullish light by experts as major   producers are outsourcing extraction services to these   third-party providers. If I had to choose between the two   extractor stocks, however, I would pick MediPharm for a couple of   reasons. For one, MediPharm is already showing profits. I   t report    ed a CA$0.01 profit-per-share figure in its recent financials off   a net income of CA$4.1 million. While seemingly insignificant,   this is pretty impressive when one considers that MediPharm had   virtually no sales the year before. MediPharm also has secured major extraction contracts with   giants such as Canopy Growth,   TerrAscend    , the   Supreme Cannabis Company    , and   Cronos Group    . These agreements are worth tens of millions of dollars in   steady revenue for the company over the next two years. With   CBD-derivative products offering a higher profit margin than   dried flower, many more companies are lining up to secure the   services of extraction-based companies like MediPharm. Once   legalization 2.0 comes into effect, MediPharm could find itself   swamped with many more highly lucrative extraction   agreements.   10 stocks we like better than Walmart       When investing geniuses David and Tom Gardner have a stock     tip, it can pay to listen. After all, the newsletter     they have run for over a decade, the Motley Fool Stock     Advisor, has quadrupled the market.* David and Tom just revealed what they believe are the      ten best stocks        for investors to buy right now... and Walmart wasn't one     of them! That's right -- they think these 10 stocks are     even better buys.   Click here        to learn about these picks!  *Stock Advisor returns as of June 1, 2019               The author(s) may have a position in any stocks       mentioned.       Mark Prvulovic      has no position in any of the stocks mentioned. The Motley Fool     owns shares of Molson Coors Brewing. The Motley Fool recommends     CannTrust Holdings Inc, HEXO., and OrganiGram Holdings. The     Motley Fool has a     disclosure policy      .  ",
    "Canada officially legalized dried cannabis flower, oils, and   sprays for recreational use last year. However, there were many   other marijuana products left off the table. Most notably   excluded were cannabinoid-based edibles, beverages, topicals, and   concentrates. By extracting CBD from cannabis and hemp, consumers   can enjoy the health and other benefits of cannabis without the   feeling of getting high, which is the result of another compound   found in marijuana, tetrahydrocannabinol known as THC.",
    "What is important is that these CBD-derivative products have   higher profit margins and are easier to sell to consumers who   don't typically consume marijuana. With regular dried sales   beginning to slow down in some states due to oversupply, CBD   consumables are the next logical path for cannabis companies to   expand into.",
    "As investors eagerly anticipate October 17, the day when   Canada will   legalize    these CBD products for recreational distribution, many companies   have been preparing their own product lines for launch.",
    "  IMAGE SOURCE: GETTY IMAGES ",
    "IMAGE SOURCE: GETTY IMAGES",
    "The CBD-derivatives market has been growing at an exponential   rate over the past few years, growing from $200 million in 2016   to now being projected to hit $1 billion by the end of 2019. Many   industry experts are predicting that the U.S. and Canadian CBD   markets will be   $3 billion    by 2021, while more optimistic estimates suggest that the market   could hit as much as $16 billion by 2022.",
    "CBD edibles and beverages are more accessible to consumers who   are curious about cannabis but might not have tried smoking dried   flower yet, possibly due to the pre-existing stigma surrounding   recreational use. These products are the perfect entry point for   consumers and could easily transition into using other cannabis   products in the future.",
    "With this in mind, here are some companies that are   well-positioned to take advantage of this coming second round of   legalization in Canada.",
    "The Quebec-based   HEXO    (NYSE: HEXO) has seen its shares fall by almost 50% since April,   leading some investors to see a potential value investment at   this low-price tag. When looking at industry benchmarks like the   Horizons Marijuana Life Sciences ETF, which has fallen by 39.1%   over the same time period, it seems that HEXO has been   underperforming the market.",
    "However, that's not necessarily HEXO's fault. Many Canadian   producers have been hamstrung by ongoing supply problems with the   local provinces despite strong production figures, leading to a   buildup in inventory and a decline in sales. Once this issue   clears up, sales are expected to rise, although its anyone's   guess when the problem will resolve itself.",
    "Even putting the supply glut to the side, HEXO still has a   number of advantages over its competitors. Its enviable joint   venture agreement with   Molson Coors Brewing     to produce CBD infused beverages could easily make it a   leader in this market. When taking a deeper look into the   company, HEXO has also devoted more than 600,000 square feet of   its facilities to the cultivation and procession of CBD products.   From a sheer output perspective, HEXO is at the forefront of CBD   derivative production. Combined with the fact that it's is   expected to see its sales spike from $59.7 million in 2019 to   potentially almost $400 million in 2020, HEXO seems well poised   to make a   major comeback    this fall.",
    "Another pot stock that lost much of its value recently is   OrganiGram Holdings    (NASDAQ: OGI) , which fell by 30% in August alone. While Health   Canada has been arduously slow in approving sales licenses for   the company, there hasn't any major development that would have   caused this decline besides the postponing the launch of its CBD   derivative product line to December rather than October as   previously planned.",
    "OrganiGram is unique compared to other producers for a couple   of reasons. While most growers are based in Ontario, Quebec, or   British Colombia, OrganiGram is based out of Canada's Atlantic   region in the province of New Brunswick. Although being the   leader in a less populated region might not seem as advantageous,   Canada's eastern-most provinces have seen the highest adult-use   rates for cannabis in the entire country.",
    "At the same time, OrganiGram is one of the few Canadian   cultivators to boast supply agreements with all ten provinces in   the country. This is a big deal as it puts OrganiGram in the same   league with giants like   Canopy Growth    ,   Aphria    , and the   now floundering   CannTrust Holdings     , the only other companies with supply agreements in place with   every province. As such, the comparatively smaller OrganiGram   would be the leader in the high-use, less competitive Atlantic   market while still having access to the other major   provinces.",
    "Unlike the other two companies, MediPharm Labs (OTC: MEDIF) is   an extraction-service provider rather than a cannabis producer.   Extraction-based providers like MediPharm and   Valens Groworks     have been seen in a bullish light by experts as major   producers are outsourcing extraction services to these   third-party providers. If I had to choose between the two   extractor stocks, however, I would pick MediPharm for a couple of   reasons.",
    "For one, MediPharm is already showing profits. I   t report    ed a CA$0.01 profit-per-share figure in its recent financials off   a net income of CA$4.1 million. While seemingly insignificant,   this is pretty impressive when one considers that MediPharm had   virtually no sales the year before.",
    "MediPharm also has secured major extraction contracts with   giants such as Canopy Growth,   TerrAscend    , the   Supreme Cannabis Company    , and   Cronos Group    . These agreements are worth tens of millions of dollars in   steady revenue for the company over the next two years. With   CBD-derivative products offering a higher profit margin than   dried flower, many more companies are lining up to secure the   services of extraction-based companies like MediPharm. Once   legalization 2.0 comes into effect, MediPharm could find itself   swamped with many more highly lucrative extraction   agreements.",
    "  10 stocks we like better than Walmart       When investing geniuses David and Tom Gardner have a stock     tip, it can pay to listen. After all, the newsletter     they have run for over a decade, the Motley Fool Stock     Advisor, has quadrupled the market.* David and Tom just revealed what they believe are the      ten best stocks        for investors to buy right now... and Walmart wasn't one     of them! That's right -- they think these 10 stocks are     even better buys.   Click here        to learn about these picks!  *Stock Advisor returns as of June 1, 2019               The author(s) may have a position in any stocks       mentioned.    ",
    " 10 stocks we like better than Walmart       When investing geniuses David and Tom Gardner have a stock     tip, it can pay to listen. After all, the newsletter     they have run for over a decade, the Motley Fool Stock     Advisor, has quadrupled the market.*",
    "David and Tom just revealed what they believe are the      ten best stocks        for investors to buy right now... and Walmart wasn't one     of them! That's right -- they think these 10 stocks are     even better buys.",
    "  Click here        to learn about these picks!",
    " *Stock Advisor returns as of June 1, 2019               The author(s) may have a position in any stocks       mentioned. ",
    "  Mark Prvulovic      has no position in any of the stocks mentioned. The Motley Fool     owns shares of Molson Coors Brewing. The Motley Fool recommends     CannTrust Holdings Inc, HEXO., and OrganiGram Holdings. The     Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:48:08"
}