{
  "url": "https://www.nasdaq.com/article/4-stocks-to-bet-on-despite-slowdown-in-manufacturing-cm1210424",
  "title": "4 Stocks to Bet on Despite Slowdown in Manufacturing - Nasdaq.com",
  "text": [
    " After exhibiting growth for 35 consecutive months, the U.S manufacturing sector contracted in August primarily owing to the U.S.-China trade turbulence. Per the Institute for Supply Management's lates t report  , Purchasing Managers' Index (PMI) for August declined to 49.1% from 51.2% in July - lowest reading since January 2016's reading of 48%. Even though the manufacturing sector had shown signs of deceleration over the past four months, this was the first instance where the reading has fallen below 50.  makeArticleAd();  Of the 18 manufacturing industries, nine reported growth in August. New Orders Index registered 47.2% in August, contracting from 50.8% in July, bringing an end to 43 months of continuous expansion. Production Index came in at 49.5% in August, down from the 50.8% registered in July, a decline following growth for 35 consecutive months. Employment Index registered 47.4% in August, down from July's 51.7%. The index also contracted after 34 consecutive months of employment growth.    Notwithstanding the dip, the PMI has averaged 54% over the last 12 months ranging from a low of 49.1% to a high of 59.5%.    This Industrial Products  sector has underperformed the S&P 500 market owing to concerns regarding the impact of tariffs. Given that steel is a primary raw material, every company involved in manufacturing bore the brunt of rising steel prices owing to tariffs. In the past year, the sector has declined 8.9% while the S&P 500 gained 1.9%.     Much Hopes Pinned on a Truce    Any positive development on the United States-China trade war front will aid the sector's recovery. Further, continued improvement in residential and non-residential construction, and revival in infrastructure demand bode well for the industry. Mining companies are also resuming capital spending backed by improvement in commodity prices.    Moreover, the manufacturing companies continue to combat cost inflation to sustain their margins through pricing actions and cost control, increasing productivity and eliminating waste.   Stocks Set to Grow Despite the Dip in Manufacturing    We have zeroed in on four industrial stocks which have a Zacks Rank #2 (Buy) and a VGM Score  of A. Here V stands for Value, G for Growth and M for Momentum and the score is a weighted combination of these three scores. Our research shows that stocks with an impressive VGM Score of A or B when combined with a Zacks Rank 1 (Strong Buy) or 2, offer the best upside potential. Further, these companies have healthy earnings growth expectations.    You can see  the complete list of today's Zacks #1 Rank stocks   here   .   AGCO Corporation AGCO  : This Duluth, GA-based company has estimated long-term earnings growth rate of 13.41%. The Zacks Consensus Estimate for earnings for fiscal 2019 and fiscal 2020 reflect year-over-year growth of 31.11% and 8.68%, respectively. The Zacks Consensus Estimate for fiscal 2019 and 2020 has moved up 3% and 2%, respectively, over the past 90 days. The company has an average positive earnings surprise of 33.84% in the trailing four quarters.   Albany International Corporation AIN  : The Zacks Consensus Estimate for earnings for this Rochester, NH-based company for fiscal 2019 and fiscal 2020 reflect year-over-year growth of 33.85% and 10.03%, respectively. The Zacks Consensus Estimate for fiscal 2019 and 2020 has moved north 3% and 2%, respectively, over the past 90 days. The company has an average positive earnings surprise of 15.98% in the trailing four quarters.   Mueller Water Products, Inc. MWA  : This Atlanta, GA-based company has an average positive earnings surprise of 1.43% in the trailing four quarters. The Zacks Consensus Estimate for earnings for fiscal 2019 and fiscal 2020 reflect year-over-year growth of 18.87 and 9.81%, respectively. The Zacks Consensus Estimate for fiscal 2019 and 2020 has moved up 5% and 1%, respectively, over the past 90 days. The company has an estimated long-term earnings growth rate of 15%.   UFP Technologies, Inc. UFPT  : This Newburyport, MA-based company has an average positive earnings surprise of 9.81% in the trailing four quarters. The Zacks Consensus Estimate for earnings for fiscal 2019 and fiscal 2020 indicates year-over-year growth of 8.10% and 23.79%, respectively. The Zacks Consensus Estimate for fiscal 2019 and 2020 has moved north 2% and 3%, respectively, over the past 90 days.   Looking for Stocks with Skyrocketing Upside?   Z  acks has just released a Special Report on the booming investment opportunities of legal marijuana. Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   UFP Technologies, Inc. (UFPT): Free Stock Analysis Report   AGCO Corporation (AGCO): Free Stock Analysis Report   MUELLER WATER PRODUCTS (MWA): Free Stock Analysis Report   Albany International Corporation (AIN): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "After exhibiting growth for 35 consecutive months, the U.S manufacturing sector contracted in August primarily owing to the U.S.-China trade turbulence. Per the Institute for Supply Management's lates t report  , Purchasing Managers' Index (PMI) for August declined to 49.1% from 51.2% in July - lowest reading since January 2016's reading of 48%. Even though the manufacturing sector had shown signs of deceleration over the past four months, this was the first instance where the reading has fallen below 50.  makeArticleAd();  Of the 18 manufacturing industries, nine reported growth in August. New Orders Index registered 47.2% in August, contracting from 50.8% in July, bringing an end to 43 months of continuous expansion. Production Index came in at 49.5% in August, down from the 50.8% registered in July, a decline following growth for 35 consecutive months. Employment Index registered 47.4% in August, down from July's 51.7%. The index also contracted after 34 consecutive months of employment growth.    Notwithstanding the dip, the PMI has averaged 54% over the last 12 months ranging from a low of 49.1% to a high of 59.5%.    This Industrial Products  sector has underperformed the S&P 500 market owing to concerns regarding the impact of tariffs. Given that steel is a primary raw material, every company involved in manufacturing bore the brunt of rising steel prices owing to tariffs. In the past year, the sector has declined 8.9% while the S&P 500 gained 1.9%.",
    "    Much Hopes Pinned on a Truce    Any positive development on the United States-China trade war front will aid the sector's recovery. Further, continued improvement in residential and non-residential construction, and revival in infrastructure demand bode well for the industry. Mining companies are also resuming capital spending backed by improvement in commodity prices.    Moreover, the manufacturing companies continue to combat cost inflation to sustain their margins through pricing actions and cost control, increasing productivity and eliminating waste.   Stocks Set to Grow Despite the Dip in Manufacturing    We have zeroed in on four industrial stocks which have a Zacks Rank #2 (Buy) and a VGM Score  of A. Here V stands for Value, G for Growth and M for Momentum and the score is a weighted combination of these three scores. Our research shows that stocks with an impressive VGM Score of A or B when combined with a Zacks Rank 1 (Strong Buy) or 2, offer the best upside potential. Further, these companies have healthy earnings growth expectations.    You can see  the complete list of today's Zacks #1 Rank stocks   here   .   AGCO Corporation AGCO  : This Duluth, GA-based company has estimated long-term earnings growth rate of 13.41%. The Zacks Consensus Estimate for earnings for fiscal 2019 and fiscal 2020 reflect year-over-year growth of 31.11% and 8.68%, respectively. The Zacks Consensus Estimate for fiscal 2019 and 2020 has moved up 3% and 2%, respectively, over the past 90 days. The company has an average positive earnings surprise of 33.84% in the trailing four quarters.   Albany International Corporation AIN  : The Zacks Consensus Estimate for earnings for this Rochester, NH-based company for fiscal 2019 and fiscal 2020 reflect year-over-year growth of 33.85% and 10.03%, respectively. The Zacks Consensus Estimate for fiscal 2019 and 2020 has moved north 3% and 2%, respectively, over the past 90 days. The company has an average positive earnings surprise of 15.98% in the trailing four quarters.   Mueller Water Products, Inc. MWA  : This Atlanta, GA-based company has an average positive earnings surprise of 1.43% in the trailing four quarters. The Zacks Consensus Estimate for earnings for fiscal 2019 and fiscal 2020 reflect year-over-year growth of 18.87 and 9.81%, respectively. The Zacks Consensus Estimate for fiscal 2019 and 2020 has moved up 5% and 1%, respectively, over the past 90 days. The company has an estimated long-term earnings growth rate of 15%.   UFP Technologies, Inc. UFPT  : This Newburyport, MA-based company has an average positive earnings surprise of 9.81% in the trailing four quarters. The Zacks Consensus Estimate for earnings for fiscal 2019 and fiscal 2020 indicates year-over-year growth of 8.10% and 23.79%, respectively. The Zacks Consensus Estimate for fiscal 2019 and 2020 has moved north 2% and 3%, respectively, over the past 90 days.   Looking for Stocks with Skyrocketing Upside? ",
    " Z  acks has just released a Special Report on the booming investment opportunities of legal marijuana.",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:41:00"
}