{
  "url": "https://www.nasdaq.com/article/dow-jones-today-plenty-of-good-news-cm1210813",
  "title": "Dow Jones Today: Plenty of Good News - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "With the help of broad-based leadership, the major U.S. equity benchmarks rallied Wednesday amid a flurry of decent headlines. Today's leadership came by way of the technology and healthcare sectors, the two largest sector weights in the S&P 500, with some contributions from the defensive, high-yielding utilities group.",
    "President Donald Trump took to Twitter (NYSE: TWTR ), something that doesn't always end well for investors, to encourage the Federal Reserve to take interest rates to zero or even negative. It's unlikely the Fed follows the advice of going to negative rates, at least not anytime soon, but another rate cut does appear imminent if Fed funds futures are to be believed.",
    "Adding to today's ebullience was news out of China that the country will exempt certain U.S. goods from 25% tariffs that were deployed last year. This is the latest sign that the trade talks the two countries are expected to hold next month could actually happen and that the results could be positive.",
    "Those catalysts were enough to send the Nasdaq Composite higher by 1.06% while the S&P 500 gained 0.72%. The Dow Jones Industrial Average jumped 0.85%. Much of the strength in the blue chip index was attributable to its larger components as, in late trading, just 16 of the Dow's 30 residents were trading to the upside.",
    "Try as I might to mention different Dow names from day-to-day, Boeing (NYSE: BA ) is the index's largest component and when it's the best-performing Dow stock on a given day, as it was Wednesday, it bears mentioning .",
    "The aerospace and defense giant rallied 3.50% today after CEO Dennis Muilenberg made some positive though not earth-shattering comments about Boeing's efforts to get the 737 MAX jet back in the skies.",
    "\"We're continuing to make solid progress on return to service,\" said the CEO at an investor conference in California. \"We're actively engaged with regulators around the world and day-to-day working with the FAA on return-to-service timing.\"",
    "A day after its new product launch event, Apple (NASDAQ: AAPL ) performed better than it did yesterday, gaining 3.18% to rank as the second-best Dow performer behind Boeing, pushing the stock back into the exclusive $1 trillion market value club for the first time this year. Predictably, analysts were chatty about Apple stock today following news of iPhone enhancements and that the Apple + streaming service will be less expensive, at least for now, than competing options.",
    "Needham analyst Laura Martin reiterated her \"strong buy\" rating on Apple stock while boosting her price target to $250 from $225, implying upside of more than 10% from Wednesday's close.",
    "As noted earlier, the healthcare sector was a big contributor the broader market's Wednesday upside and three of the Dow's four healthcare names traded higher today with Pfizer (NYSE: PFE ) being the only offender of the quartet.",
    "Granted, it's just one day, but it's nice to see some strength in the pharmaceuticals stocks because this group could face more headwinds as the 2020 presidential campaign unfolds. With that in mind, House Democrats are looking for ways cobble together a plan that would alter how Medicare pays for drugs while President Trump has and will continue to tout falling drug prices.",
    "While brand name prices are still increasing, the president can lean on declining generic prices in what is sure to be a hot-button campaign issue. This is a bipartisan issue, rare as those are, and that presents some risks going forward.",
    "I recently mentioned signs that value stocks are making a comeback against their growth rivals. Some market observers may overstate the consequences in that scenario. It's not all bad when considering decent percentages of the Dow Jones Industrial Average and S&P 500 are classified as value stocks.",
    "What would be positive for the sustainability of this mini-rally is strength in maligned small caps and that scenario is emerging. The Russell 2000 Index jumped more than 2% and that could be a sign stocks are poised to defy usually gloomy September expectations. Importantly, that index came into Wednesday with a gain of almost 5% over the past week.",
    "Todd Shriber does not own any of the aforementioned securities.",
    "The post Dow Jones Today: Plenty of Good News appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 04:15:57"
}