{
  "url": "https://www.nasdaq.com/article/stock-market-news-for-sep-11-2019-cm1210438",
  "title": "Stock Market News For Sep 11, 2019 - Nasdaq.com",
  "text": [
    " Wall Street closed mixed on Tuesday as investors remained cautiously optimistic about next round of trade negotiations and the magnitude of stimulus likely to be injected by the ECB and the Fed later this month. The Dow ended in the green while the Nasdaq Composite finished in the red. Meanwhile, the S&P 500 closed marginally higher. The Dow Jones Industrial Average (DJI) climbed 0.3% to close at 26,909.43. The S&P 500 gained 0.96 points to close at 2,979.39. The Nasdaq Composite Index closed at 8,084.15, dropping 0.1%. The fear-gauge CBOE Volatility Index (VIX) decreased 0.5% to close at 15.20. A total of 8.05 billion shares were traded on Tuesday, higher than the last 20-session average of 6.86 billion. Advancers outnumbered advancers on the NYSE by a 1.36-to-1 ratio. On Nasdaq, a 1.78-to-1 ratio favored advancing issues.  How Did The Benchmarks Perform?  The Dow closed in positive territory for fifth consecutive days with 18 components of the 30-stock blue-chip index closing in the green while the remaining 12 ended in red. This marked the index's largest winning streak since the week ended Jul 15. The S&P 500 closed marginally higher the break-even level. The Energy Select Sector SPDR (XLE) surged 1.2% while the Real Estate Select Sector SPDR (XLRE) plummeted 1.8%, respectively. Notably, eight out of total 11 sectors of the benchmark index closed in the green while four finished in red. The Nasdaq Composite continued its losing streak for three successive days due to poor performance of tech stocks.  Huawei Drops a Lawsuit Against the U.S.   Government  The Chinese telecom behemoth Huawei Technologies dropped one of its lawsuits against the U.S. government, after the U.S. government returned the equipment which it seized from the company two years ago. Notably, the U.S. government has banned Huawei to do business with any U.S. company. The latest development has showed that both sides started to calm down slowly. Notably, As per POLITICO, China has expressed desire to increase imports of U.S. agricultural if the U.S. government eases up business restrictions imposed on the Asian telecom behemoth Huawei Technologies and postpone escalation of tariff rate on $250 billion of Chinese goods effective Oct 1. Per the newspaper, the Trump administration is also evaluating the latest round of trade negotiations in order to consider delaying imposing 15% tariff on around $160 billion of Chinese goods effective Dec 15.  Apple Unveils Several New Products  At its annual launch event, Apple Inc. AAPL  unveiled two high-end iPhones -- the iPhone 11 Pro and 11 Pro Max, as well as a cheaper iPhone 11. The models replaced the existing models of iPhone XS, XS Max and XR, respectively. The company also unveiled pricing and additional details for its gaming subscription product Apple Arcade and Apple TV+, a new streaming service for original shows and movies. The ad-free service of Apple TV+ will cost $4.99 a month for the whole family. Following the event, the shares of Apple rose 1.2%. Apple carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  .   Stocks That Made Headline    Accenture Completes Acquisition of Pragsis     Bidoop   Accenture ACN  yesterday announced that it has acquired Pragsis Bidoop - a provider of big data and AI solutions, machine learning and advanced predictive models. ( Read More  )  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana. Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Apple Inc. (AAPL): Free Stock Analysis Report   Accenture PLC (ACN): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Wall Street closed mixed on Tuesday as investors remained cautiously optimistic about next round of trade negotiations and the magnitude of stimulus likely to be injected by the ECB and the Fed later this month. The Dow ended in the green while the Nasdaq Composite finished in the red. Meanwhile, the S&P 500 closed marginally higher.",
    "The Dow Jones Industrial Average (DJI) climbed 0.3% to close at 26,909.43. The S&P 500 gained 0.96 points to close at 2,979.39. The Nasdaq Composite Index closed at 8,084.15, dropping 0.1%. The fear-gauge CBOE Volatility Index (VIX) decreased 0.5% to close at 15.20. A total of 8.05 billion shares were traded on Tuesday, higher than the last 20-session average of 6.86 billion. Advancers outnumbered advancers on the NYSE by a 1.36-to-1 ratio. On Nasdaq, a 1.78-to-1 ratio favored advancing issues.",
    " How Did The Benchmarks Perform? ",
    "The Dow closed in positive territory for fifth consecutive days with 18 components of the 30-stock blue-chip index closing in the green while the remaining 12 ended in red. This marked the index's largest winning streak since the week ended Jul 15. The S&P 500 closed marginally higher the break-even level. The Energy Select Sector SPDR (XLE) surged 1.2% while the Real Estate Select Sector SPDR (XLRE) plummeted 1.8%, respectively. Notably, eight out of total 11 sectors of the benchmark index closed in the green while four finished in red. The Nasdaq Composite continued its losing streak for three successive days due to poor performance of tech stocks.",
    " Huawei Drops a Lawsuit Against the U.S.   Government ",
    "The Chinese telecom behemoth Huawei Technologies dropped one of its lawsuits against the U.S. government, after the U.S. government returned the equipment which it seized from the company two years ago. Notably, the U.S. government has banned Huawei to do business with any U.S. company. The latest development has showed that both sides started to calm down slowly.",
    "Notably, As per POLITICO, China has expressed desire to increase imports of U.S. agricultural if the U.S. government eases up business restrictions imposed on the Asian telecom behemoth Huawei Technologies and postpone escalation of tariff rate on $250 billion of Chinese goods effective Oct 1. Per the newspaper, the Trump administration is also evaluating the latest round of trade negotiations in order to consider delaying imposing 15% tariff on around $160 billion of Chinese goods effective Dec 15.",
    " Apple Unveils Several New Products ",
    "At its annual launch event, Apple Inc. AAPL  unveiled two high-end iPhones -- the iPhone 11 Pro and 11 Pro Max, as well as a cheaper iPhone 11. The models replaced the existing models of iPhone XS, XS Max and XR, respectively. The company also unveiled pricing and additional details for its gaming subscription product Apple Arcade and Apple TV+, a new streaming service for original shows and movies. The ad-free service of Apple TV+ will cost $4.99 a month for the whole family.",
    "Following the event, the shares of Apple rose 1.2%. Apple carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  . ",
    " Stocks That Made Headline ",
    "  Accenture Completes Acquisition of Pragsis     Bidoop  ",
    "Accenture ACN  yesterday announced that it has acquired Pragsis Bidoop - a provider of big data and AI solutions, machine learning and advanced predictive models. ( Read More  )",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:37:00"
}