{
  "url": "https://www.nasdaq.com/article/snh-vs-hiw-which-stock-should-value-investors-buy-now-cm1207370",
  "title": "SNH vs. HIW: Which Stock Should Value Investors Buy Now? - Nasdaq.com",
  "text": [
    " Investors interested in stocks from the REIT and Equity Trust - Other sector have probably already heard of Senior Housing Properties (SNH) and Highwoods Properties (HIW). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look. There are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits. Right now, Senior Housing Properties is sporting a Zacks Rank of #2 (Buy), while Highwoods Properties has a Zacks Rank of #3 (Hold). The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that SNH has an improving earnings outlook. But this is just one piece of the puzzle for value investors. Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels. The Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P/E ratio, P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value. SNH currently has a forward P/E ratio of 6.39, while HIW has a forward P/E of 12.97. We also note that SNH has a PEG ratio of 1.60. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. HIW currently has a PEG ratio of 3.33. Another notable valuation metric for SNH is its P/B ratio of 0.67. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, HIW has a P/B of 2.05. These are just a few of the metrics contributing to SNH's Value grade of A and HIW's Value grade of C. SNH stands above HIW thanks to its solid earnings outlook, and based on these valuation figures, we also feel that SNH is the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Senior Housing Properties Trust (SNH): Free Stock Analysis Report   Highwoods Properties, Inc. (HIW): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors interested in stocks from the REIT and Equity Trust - Other sector have probably already heard of Senior Housing Properties (SNH) and Highwoods Properties (HIW). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look.",
    "There are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits.",
    "Right now, Senior Housing Properties is sporting a Zacks Rank of #2 (Buy), while Highwoods Properties has a Zacks Rank of #3 (Hold). The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that SNH has an improving earnings outlook. But this is just one piece of the puzzle for value investors.",
    "Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels.",
    "The Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P/E ratio, P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value.",
    "SNH currently has a forward P/E ratio of 6.39, while HIW has a forward P/E of 12.97. We also note that SNH has a PEG ratio of 1.60. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. HIW currently has a PEG ratio of 3.33.",
    "Another notable valuation metric for SNH is its P/B ratio of 0.67. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, HIW has a P/B of 2.05.",
    "These are just a few of the metrics contributing to SNH's Value grade of A and HIW's Value grade of C.",
    "SNH stands above HIW thanks to its solid earnings outlook, and based on these valuation figures, we also feel that SNH is the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:13"
}