{
  "url": "https://www.nasdaq.com/article/can-funko-inc-fnko-run-higher-on-rising-earnings-estimates-cm1207287",
  "title": "Can Funko, Inc. (FNKO) Run Higher on Rising Earnings Estimates? - Nasdaq.com",
  "text": [
    " Investors might want to bet on Funko, Inc. (FNKO), as earnings estimates for this company have been showing solid improvement lately. The stock has already gained solid short-term price momentum, and this trend might continue with its still improving earnings outlook. The rising trend in estimate revisions, which is a result of growing analyst optimism on the earnings prospects of this company, should get reflected in its stock price. After all, empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements. This insight is at the core of our stock rating tool -- the Zacks Rank. The five-grade Zacks Rank system, which ranges from a Zacks Rank #1 (Strong Buy) to a Zacks Rank #5 (Strong Sell), has an impressive  externally-audited track record of outperformance  , with Zacks #1 Ranked stocks generating an average annual return of +25% since 2008. For Funko, Inc. Strong agreement among the covering analysts in revising earnings estimates upward has resulted in meaningful improvement in consensus estimates for the next quarter and full year. The chart below shows the evolution of forward 12-month Zacks Consensus EPS estimate:  12 Month EPS      Current-Quarter Estimate Revisions  For the current quarter, the company is expected to earn $0.32 per share, which is a change of +18.52% from the year-ago reported number. The Zacks Consensus Estimate for Funko, Inc. has increased 5.38% over the last 30 days, as two estimates have gone higher while three have gone lower.  Current-Year Estimate Revisions  For the full year, the company is expected to earn $1.22 per share, representing a year-over-year change of +48.78%. In terms of estimate revisions, the trend for the current year also appears quite encouraging for Funko, Inc. Over the past month, seven estimates have moved higher compared to no negative revisions, helping the consensus estimate increase 10.71%.  Favorable Zacks Rank  Thanks to promising estimate revisions, Funko, Inc. currently carries a Zacks Rank #1 (Strong Buy). The Zacks Rank is a tried-and-tested rating tool that helps investors effectively harness the power o f earnings  estimate revisions and make the right investment decision. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  . Our research shows that stocks with Zacks Rank #1 (Strong Buy) and 2 (Buy) significantly outperform the S&P 500.  Bottom Line  While strong estimate revisions for Funko, Inc. have attracted decent investments and pushed the stock 5.7% higher over the past four weeks, further upside may still be left in the stock. So, you may consider adding it to your portfolio right away.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Funko, Inc. (FNKO): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors might want to bet on Funko, Inc. (FNKO), as earnings estimates for this company have been showing solid improvement lately. The stock has already gained solid short-term price momentum, and this trend might continue with its still improving earnings outlook.",
    "The rising trend in estimate revisions, which is a result of growing analyst optimism on the earnings prospects of this company, should get reflected in its stock price. After all, empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements. This insight is at the core of our stock rating tool -- the Zacks Rank.",
    "The five-grade Zacks Rank system, which ranges from a Zacks Rank #1 (Strong Buy) to a Zacks Rank #5 (Strong Sell), has an impressive  externally-audited track record of outperformance  , with Zacks #1 Ranked stocks generating an average annual return of +25% since 2008.",
    "For Funko, Inc. Strong agreement among the covering analysts in revising earnings estimates upward has resulted in meaningful improvement in consensus estimates for the next quarter and full year.",
    "The chart below shows the evolution of forward 12-month Zacks Consensus EPS estimate:",
    " 12 Month EPS ",
    " Current-Quarter Estimate Revisions ",
    "For the current quarter, the company is expected to earn $0.32 per share, which is a change of +18.52% from the year-ago reported number.",
    "The Zacks Consensus Estimate for Funko, Inc. has increased 5.38% over the last 30 days, as two estimates have gone higher while three have gone lower.",
    " Current-Year Estimate Revisions ",
    "For the full year, the company is expected to earn $1.22 per share, representing a year-over-year change of +48.78%.",
    "In terms of estimate revisions, the trend for the current year also appears quite encouraging for Funko, Inc. Over the past month, seven estimates have moved higher compared to no negative revisions, helping the consensus estimate increase 10.71%.",
    " Favorable Zacks Rank ",
    "Thanks to promising estimate revisions, Funko, Inc. currently carries a Zacks Rank #1 (Strong Buy). The Zacks Rank is a tried-and-tested rating tool that helps investors effectively harness the power o f earnings  estimate revisions and make the right investment decision. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .",
    "Our research shows that stocks with Zacks Rank #1 (Strong Buy) and 2 (Buy) significantly outperform the S&P 500.",
    " Bottom Line ",
    "While strong estimate revisions for Funko, Inc. have attracted decent investments and pushed the stock 5.7% higher over the past four weeks, further upside may still be left in the stock. So, you may consider adding it to your portfolio right away.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:20:09"
}