{
  "url": "https://www.nasdaq.com/article/insurers-in-focus-as-concerns-over-hurricane-dorian-loom-cm1206616",
  "title": "Insurers in Focus as Concerns Over Hurricane Dorian Loom - Nasdaq.com",
  "text": [
    " Hurricane Dorian brings back memories of last year's devastation when a host of hurricanes wreaked havoc in parts of the United States. The hurricane season typically starts in June and lasts through November during a year, gathering strength in August and September. Colorado State University (CSU) estimates 'near average Atlantic hurricane season in 2019'. There will be 14 named storms, including six hurricanes and two major hurricanes per CSU.  makeArticleAd();  The third quarter of a year generally bears the brunt of unprecedented catastrophes, which cause mass devastation. The second half of last year was marred by the hurricane season that weighed on the profits of insurers. Hurricanes Lane, Florence and Michael, and other catastrophes like Typhoon Jebi and California wildfires took a toll on insurers' results last year. Per Munich RE, catastrophe losses in 2018 amounted to $160 billion, of which half was insured.    National Hurricane Center had categorized Hurricane Dorian as a category 5 storm. However, it has lost intensity and is a category 3 hurricane now. After battering the Bahamas, Dorian is expected to hit Florida's east coast and then coastlines of South Carolina and Georgia.    Per media reports, analysts at UBS Group AG estimate Hurricane Dorian to cause about $25 billion in losses in Bahamas while the amount might touch $40 billion if it hits Florida. AccuWeather estimates the total damage and economic loss stemming from Hurricane Dorian to be in the range of $8-10 billion.    Further Keefe, Bruyette & Woods analysts stated \"the storm could cause sizable losses for insurers if the current forecast remains. Given generally low Florida primary insurer retentions and increased YTD reinsurance purchases, a major Florida catastrophe event will significantly impact the reinsurers; domestic primary insurers remain exposed up to their reinsurance attachment points.\" The analysts also stated that  \"YTD loss creep and potentially significant Dorian losses mean that catastrophe reinsurance rate increases and elevated reinsurance demand will persist into 2020\" per media reports.    Though catastrophes are a concern for insurers, due to the high degree of losses incurred, they implement price hikes to ensure uninterrupted claims payment. After witnessing 19 back-to-back quarters of soft pricing market, insurers increased prices from the fourth quarter of 2018. Per Willis Towers Watson plc's Commercial Lines Insurance Pricing Survey in 2019, most of the commercial insurance lines should witness rate increase.    Property and casualty insurers are also taking reinsurance covers to safeguard their profits. As such shares of reinsurers like RenaissanceRe Holdings RNR  and Everest Re Group RE  witnessed a decline in the last trading session.    Insurers need to arrange sufficient funds to address huge claims arising due to calamities. The main challenge lies in settling claims smoothly without affecting their own financials. Due to a not-so-active catastrophe environment, insurers could build reserves over the last several quarters.    Notably, share price of insurers having exposure to Florida like Berkshire Hathaway BRK.B  , The Progressive Corporation PGR  , United Insurance Holdings UIHC  , HCI Group HCI  gained in the last trading session while shares of Heritage Insurance Holdings HRTG  declined.   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   The Progressive Corporation (PGR): Free Stock Analysis Report   Everest Re Group, Ltd. (RE): Free Stock Analysis Report   Heritage Insurance Holdings, Inc. (HRTG): Free Stock Analysis Report   RenaissanceRe Holdings Ltd. (RNR): Free Stock Analysis Report   Berkshire Hathaway Inc. (BRK.B): Free Stock Analysis Report   United Insurance Holdings Corp. (UIHC): Free Stock Analysis Report   HCI Group, Inc. (HCI): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Hurricane Dorian brings back memories of last year's devastation when a host of hurricanes wreaked havoc in parts of the United States. The hurricane season typically starts in June and lasts through November during a year, gathering strength in August and September. Colorado State University (CSU) estimates 'near average Atlantic hurricane season in 2019'. There will be 14 named storms, including six hurricanes and two major hurricanes per CSU.  makeArticleAd();  The third quarter of a year generally bears the brunt of unprecedented catastrophes, which cause mass devastation. The second half of last year was marred by the hurricane season that weighed on the profits of insurers. Hurricanes Lane, Florence and Michael, and other catastrophes like Typhoon Jebi and California wildfires took a toll on insurers' results last year. Per Munich RE, catastrophe losses in 2018 amounted to $160 billion, of which half was insured.    National Hurricane Center had categorized Hurricane Dorian as a category 5 storm. However, it has lost intensity and is a category 3 hurricane now. After battering the Bahamas, Dorian is expected to hit Florida's east coast and then coastlines of South Carolina and Georgia.    Per media reports, analysts at UBS Group AG estimate Hurricane Dorian to cause about $25 billion in losses in Bahamas while the amount might touch $40 billion if it hits Florida. AccuWeather estimates the total damage and economic loss stemming from Hurricane Dorian to be in the range of $8-10 billion.    Further Keefe, Bruyette & Woods analysts stated \"the storm could cause sizable losses for insurers if the current forecast remains. Given generally low Florida primary insurer retentions and increased YTD reinsurance purchases, a major Florida catastrophe event will significantly impact the reinsurers; domestic primary insurers remain exposed up to their reinsurance attachment points.\" The analysts also stated that  \"YTD loss creep and potentially significant Dorian losses mean that catastrophe reinsurance rate increases and elevated reinsurance demand will persist into 2020\" per media reports.    Though catastrophes are a concern for insurers, due to the high degree of losses incurred, they implement price hikes to ensure uninterrupted claims payment. After witnessing 19 back-to-back quarters of soft pricing market, insurers increased prices from the fourth quarter of 2018. Per Willis Towers Watson plc's Commercial Lines Insurance Pricing Survey in 2019, most of the commercial insurance lines should witness rate increase.    Property and casualty insurers are also taking reinsurance covers to safeguard their profits. As such shares of reinsurers like RenaissanceRe Holdings RNR  and Everest Re Group RE  witnessed a decline in the last trading session.    Insurers need to arrange sufficient funds to address huge claims arising due to calamities. The main challenge lies in settling claims smoothly without affecting their own financials. Due to a not-so-active catastrophe environment, insurers could build reserves over the last several quarters.    Notably, share price of insurers having exposure to Florida like Berkshire Hathaway BRK.B  , The Progressive Corporation PGR  , United Insurance Holdings UIHC  , HCI Group HCI  gained in the last trading session while shares of Heritage Insurance Holdings HRTG  declined.   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:58:00"
}