{
  "url": "https://www.nasdaq.com/article/why-irobot-dropped-154-in-august-cm1210808",
  "title": "Why iRobot Dropped 15.4% in August - Nasdaq.com",
  "text": [
    " What happened Shares of   iRobot    (NASDAQ: IRBT) fell 15.4% in August, according to data from   S&P Global Market Intelligence    , extending its post-earnings plunge from July as some analysts   worried over the increasing competition in the robotic vacuum   cleaner segment. Investors may recall that iRobot stock was already under   pressure before the month started. Shares plunged 20% in a single   day on July 24, when the company delivered strong second-quarter   results but   reduced its full-year financial guidance    due to concerns that the U.S.-China trade war could hamper growth   for the broader home-robotics market. So what That negative momentum carried forward as trade tensions   persisted, leaving iRobot stock to drift lower for the first few   weeks of August. But its declines accelerated on Aug. 22, when   JPMorgan    analyst Mark Strouse reiterated his neutral rating on iRobot   stock. At the time, he pointed out that the website of iRobot   competitor Shark had been updated with details on a   \"soon-to-be-released\" robotic vacuum that includes many of the   same features as iRobot's Roomba i7 model at a much lower   price.makeArticleAd();   IMAGE SOURCE: IROBOT  Now what To be fair, iRobot's self-cleaning i7 model was   released just over a year ago    , and has since been displaced from the company's top-of-the-line   slot by the newer,   massively upgraded Roomba s9+    . What's more, iRobot has managed to deliver growth while   maintaining a majority share of the robotic vacuum market in   recent years, despite drastically increased competition -- and   that includes previous affordable   alternatives presented by Shark,    since the vacuum-industry giant entered the niche in late 2017.   And that's doesn't even factor in iRobot's opportunities to   expand its reach into new product lines, most notably with the   impending commercial   launch of its new Terra lawnmower     next year. Given today's macroeconomic uncertainty and iRobot's cautious   comments about its near-term growth outlook, it's no surprise   that concerned investors are amplifying the stock's recent   losses. As a patient, long-term shareholder in the company   myself, I still think iRobot holds tremendous potential, and view   it as a   top stock to buy    for investors willing to watch its growth story play out in the   coming years.   10 stocks we like better than iRobot       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and iRobot wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Steve Symington      owns shares of iRobot. The Motley Fool owns shares of and     recommends iRobot. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   iRobot    (NASDAQ: IRBT) fell 15.4% in August, according to data from   S&P Global Market Intelligence    , extending its post-earnings plunge from July as some analysts   worried over the increasing competition in the robotic vacuum   cleaner segment.",
    "Investors may recall that iRobot stock was already under   pressure before the month started. Shares plunged 20% in a single   day on July 24, when the company delivered strong second-quarter   results but   reduced its full-year financial guidance    due to concerns that the U.S.-China trade war could hamper growth   for the broader home-robotics market.",
    "That negative momentum carried forward as trade tensions   persisted, leaving iRobot stock to drift lower for the first few   weeks of August. But its declines accelerated on Aug. 22, when   JPMorgan    analyst Mark Strouse reiterated his neutral rating on iRobot   stock. At the time, he pointed out that the website of iRobot   competitor Shark had been updated with details on a   \"soon-to-be-released\" robotic vacuum that includes many of the   same features as iRobot's Roomba i7 model at a much lower   price.",
    "  IMAGE SOURCE: IROBOT ",
    "IMAGE SOURCE: IROBOT",
    "To be fair, iRobot's self-cleaning i7 model was   released just over a year ago    , and has since been displaced from the company's top-of-the-line   slot by the newer,   massively upgraded Roomba s9+    . What's more, iRobot has managed to deliver growth while   maintaining a majority share of the robotic vacuum market in   recent years, despite drastically increased competition -- and   that includes previous affordable   alternatives presented by Shark,    since the vacuum-industry giant entered the niche in late 2017.   And that's doesn't even factor in iRobot's opportunities to   expand its reach into new product lines, most notably with the   impending commercial   launch of its new Terra lawnmower     next year.",
    "Given today's macroeconomic uncertainty and iRobot's cautious   comments about its near-term growth outlook, it's no surprise   that concerned investors are amplifying the stock's recent   losses. As a patient, long-term shareholder in the company   myself, I still think iRobot holds tremendous potential, and view   it as a   top stock to buy    for investors willing to watch its growth story play out in the   coming years.",
    "  10 stocks we like better than iRobot       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and iRobot wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than iRobot       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and iRobot wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Steve Symington      owns shares of iRobot. The Motley Fool owns shares of and     recommends iRobot. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 06:42:00"
}