{
  "url": "https://www.nasdaq.com/article/detained-moguls-presidential-run-tests-tunisias-democracy-20190912-00011",
  "title": "Detained mogul's presidential run tests Tunisia's democracy - Nasdaq.com",
  "text": [
    "By Tarek Amara and Angus McDowall",
    "TUNIS, Sept 12 (Reuters) - Media magnate Nabil Karoui's run for president was testing the rules of Tunisia's young democracy even before he was put in custody last month charged with tax fraud and money laundering.",
    "As his unlicensed news channel broadcasts footage of him doling out aid to the poor, Karoui, 56, is campaigning from behind bars, denying accusations he attributes to political chicanery.",
    "If he beats the 25 other candidates to the presidency, but is then convicted and barred from office, it could prompt outrage among his voters - and a political crisis in Tunisia.",
    "However, with the first round of voting this Sunday, and a second round due in October or November, no date has yet been set for a verdict that would declare him guilty or innocent, though a lesser hearing on Friday may release him for now.",
    "Recent opinion polls put Karoui ahead of the other candidates who include liberal Prime Minister Youssef Chahed and the moderate Islamist Ennahda party's Abdelfattah Mourou.",
    "Chahed rarely mentions Karoui by name, but says his own campaign is aimed at combating \"media mafia\" and \"adventurers who threaten the democratic transition\".",
    "Many in the political establishment see Karoui as a populist illicitly using his TV station and charity for political gain.",
    "Karoui's allies in turn paint his arrest and other moves that threatened to curb his influence as part of an undemocratic conspiracy to keep him from office and marginalise poorer Tunisians they say he champions.",
    "Local and foreign election monitoring groups have complained that he was unable to take part in a recent televised debate, arguing that it breached his right to speak to voters on equal terms with rivals.",
    "INTIMIDATION",
    "The arguments over his candidacy were on full view in the impoverished Kabariya district of Tunis this week, when a small group of youths threatened Karoui supporters handing out leaflets, forcing them to scramble back into their cars.",
    "Samira Chaouachi, a Karoui campaign officer, said the intimidation of his volunteers in Kabariya showed he was being targeted by powerful forces.",
    "His arrest, a run-in with the media regulator and an ultimately unsuccessful parliamentary bill that would have kept him from running, were also evidence of a campaign against him, Chaouachi said, blaming the prime minister.",
    "Chahed and other government officials have said Karoui's arrest was a purely judicial decision and that the government had no part in decisions taken by the independent media regulator.",
    "The Kabariya incident took place in a wasteland where groups of children were playing amid piles of garbage prowled by street dogs, and where several residents had earlier said they planned to vote for him.",
    "\"Nobody cares for us. Nabil Karoui is the only one to help Kabariya. All Kabariya will vote for him,\" said Mohammed Ali, a casual labourer in black t-shirt and jeans.",
    "A woman, who did not give her name but said she planned to vote for Karoui based on his charity's largesse there, added simply: \"I'll vote for whoever pays me.\"",
    "Plenty of poorer Tunisians are not sold on Karoui, however. \"We are not stupid. We are poor, but he cannot buy us with his money,\" said Habiba Riahi, 41, a teacher standing in a Tunis shop.",
    "Karoui had built a media company with his brother before the revolution, but rose to prominence after it as his Nesma TV backed secular parties against the moderate Islamist Ennahda, helping them win elections in 2014.",
    "His national popularity, however, is based on the charity he founded in 2016 to combat poverty, which he named for a son who died in a road crash, and on his television station's news programme.",
    "It combines critical coverage of the government with reports about Karoui's own philanthropy, showing him visiting forgotten parts of Tunisia to give food, bedding and blankets to the poor.",
    "The media regulator ordered it taken off air, leading to a police raid on its headquarters, which the channel said was aimed to silence a critical voice. It continues to broadcast, still without a licence.",
    "It set the stage for another battle as parliament passed an amendment to the electoral law to stop candidates benefiting from charitable associations or foreign funding in the year before an election.",
    "But President Beji Caid Essebsi died in July without signing it into law, meaning Karoui was able to run. He had described parliament's vote as \"a strong setback to nascent democracy\", saying it was \"dedicated to my exclusion\".",
    "Meanwhile, his team continue their campaign and Nesma still broadcasts continual footage of Karoui bringing succour to the poor."
  ],
  "published_datetime": "2019-09-12 12:00:00"
}