{
  "url": "https://www.nasdaq.com/article/3-threats-that-continue-to-weigh-netflix-stock-down-cm1207576",
  "title": "3 Threats That Continue to Weigh Netflix Stock Down - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Neftlix (NASDAQ: NFLX ) is not the darling tech stock it once was. After a meteoric rise that saw Netflix stock reach an all-time high in 2018, NFLX is coming back to earth a bit. That's if you can call a 40% correction a bit.",
    "NFLX stock has bounced off the low it reached in last year's December selloff. However, most of that bounce came as all stocks rallied off their December lows. Despite being up for the year, Netflix stock is down over 15% from a January 15 close of $351.39.",
    "The good news is the stock has still retained most of the gains it made since 2017. The bad news is that NFLX stock seems to be stuck in a neutral pattern as institutional investors are trying to decide what's next for the streaming giant.",
    "That's not an easy question to answer. Netflix stock faces significant headwinds on three fronts:",
    "Netflix became synonymous with binge watching and streaming television by producing original content. It started with House of Cards in 2013 and the stable has grown to include The Crown , Orange is the New Black , Narcos , Ozark and Stranger Things .",
    "The company has received critical acclaim for its programming. But it takes a lot of money to produce original content, and NFLX is burning through cash and taking on debt. In 2018, the company reported a $3 billion loss in non-GAAP free cash flow. And with the company becoming increasingly dependent on original content, it does not appear this trend will reverse anytime soon.",
    "An investment in original content can be justified as long as the company continues to add new subscribers. Netflix has a healthy subscriber base. But in recent months, they have been losing momentum in adding subscribers.",
    "In their most recent quarterly earnings report, Netflix reported a gigantic miss in new subscribers . The company's own estimates were targeting 5 million new subscribers, but NFLX only added 2.7 million. The company was anticipating a boost in viewership from the summer release of Stranger Things and Season 7 of Orange is the New Black , but it remains to be seen if that will translate to new subscribers.",
    "By now you're aware that Disney (NYSE: DIS ), Amazon (NASDAQ: AMZN ) and Apple (NASDAQ: AAPL ) are all entering what is becoming a crowded streaming space.",
    "As consumers weigh a variety of digital content providers, they are realizing that each provider is carving out a niche for themselves. For example, Disney will have family oriented programming and the exclusive rights to Disney content formerly found on, among others, Netflix. This is leading to a growing sense of \"streaming fatigue.\" By subscribing to multiple streaming services, consumers are realizing they are mostly negating the cost savings they were receiving by cutting the cord.",
    "This means that the streaming wars will be survival of the most useful. Will Netflix make the cut?",
    "The trend is not a friend for NFLX at the moment. Based on any meaningful metric (moving averages, RSI, etc.), Netflix stock looks like it still has room to fall. Over the next six months, investors will get a better read on if Netflix will be able to retain existing customers as other streaming services launch.",
    "In my opinion, the issue won't be price. Consumers have never seemed to balk at the value of a Netflix subscription. In fact prior to the previous quarter, Netflix was continuing to grow their subscriber base even as they increased the price of their packages.",
    "As I see it, a bigger problem for Netflix comes down to programming. Despite their pivot into producing original content, two of the most popular series on Netflix remain The Office and Friends . Neither of these titles will be available to Netflix subscribers after 2020. Friends will stream exclusively on HBO Max starting in the spring of 2020 and The Office will be moving over to NBCUniversal's service when the contract with Netflix expires at the end of 2020.",
    "If Netflix can entice consumers with new original content, then they may be a bargain. If not, NFLX stock could be ready to tumble like…wait for it…a house of cards. Until investors get a better read on subscriber loyalty, it appears there are better stocks to look at.",
    "As of this writing, Chris Markoch did not hold a position in any of the aforementioned stocks. ",
    "The post 3 Threats That Continue to Weigh Netflix Stock Down appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 01:43:11"
}