{
  "url": "https://www.nasdaq.com/article/top-stock-picks-for-the-week-of-september-3rd-2019-cm1206911",
  "title": "Top Stock Picks for the Week of September 3rd, 2019 - Nasdaq.com",
  "text": [
    "    Costco COST   is a wholesale retail company with a market cap of $130 billion. The shares have been on fire for this primarily brick-and-mortar retailer, with the stock price appreciating 44% since the beginning of the year. In July (four weeks ending August 4 th  ) Costco demonstrated sales of $11.43 billion up roughly 8% from the same period last year. Comp sales were up 5.6% in July with its e-commerce segment exhibiting an over 21% expansion. These are very robust growth figures, with anything over 3% topline appreciation in an established retail firm considered healthy. COST is a reliable retail stock trading at a forward P/E of 36.6x.  HubSpot HUBS   is an enterprise cloud company with a tremendous amount of growth potential. The company services 65,000 customers across 100 countries. HubSpot has illustrated a topline CAGR of 42% since it went public 5 years ago, with its international CAGR being 62%. This growth is estimated to continue with sales expected to appreciate 30% this year and 24% next. HubSpot's goal is to create a seamless customer experience that allows businesses to \"grow better\". Their target customers are small to medium-sized businesses with tremendous growth potential. HUBS analysts continue to be impressed with this firm's outperformance, revising EPS estimated up and propelling this stock into a Zacks Rank #2 (Buy). Should these two companies be on your investing short list? Find out in this week's video.  Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they   spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has   identified 5 stocks that could soar in response to the powerful demand. One industry insider described   the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   HubSpot, Inc. (HUBS): Free Stock Analysis Report   Costco Wholesale Corporation (COST): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Costco COST   is a wholesale retail company with a market cap of $130 billion. The shares have been on fire for this primarily brick-and-mortar retailer, with the stock price appreciating 44% since the beginning of the year. In July (four weeks ending August 4 th  ) Costco demonstrated sales of $11.43 billion up roughly 8% from the same period last year. Comp sales were up 5.6% in July with its e-commerce segment exhibiting an over 21% expansion. These are very robust growth figures, with anything over 3% topline appreciation in an established retail firm considered healthy. COST is a reliable retail stock trading at a forward P/E of 36.6x.",
    " HubSpot HUBS   is an enterprise cloud company with a tremendous amount of growth potential. The company services 65,000 customers across 100 countries. HubSpot has illustrated a topline CAGR of 42% since it went public 5 years ago, with its international CAGR being 62%. This growth is estimated to continue with sales expected to appreciate 30% this year and 24% next. HubSpot's goal is to create a seamless customer experience that allows businesses to \"grow better\". Their target customers are small to medium-sized businesses with tremendous growth potential. HUBS analysts continue to be impressed with this firm's outperformance, revising EPS estimated up and propelling this stock into a Zacks Rank #2 (Buy).",
    "Should these two companies be on your investing short list? Find out in this week's video.",
    " Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they   spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has   identified 5 stocks that could soar in response to the powerful demand. One industry insider described   the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 15:17:00"
}