{
  "url": "https://www.nasdaq.com/article/twoyear-yields-lowest-since-2017-steepening-curve-20190904-01011",
  "title": "Two-year yields lowest since 2017, steepening curve - Nasdaq.com",
  "text": [
    "By Kate Duguid",
    "NEW YORK, Sept 4 (Reuters) - Two-year Treasury yields hit their lowest since September 2017, steepening the yield curve on Wednesday, after the Federal Reserve's Beige Book report and GDPNow tool reflected expectations that growth would slow in the third quarter.",
    "The two-year yield , which moves with expectations of interest rate cuts, fell as low as 1.430% and was last down 2.6 basis points to 1.436%.",
    "\"The curve steepened on Wednesday; nothing dramatic, but enough to warrant a nod,\" said Ian Lyngen, head of U.S. rates strategy at BMO Capital Markets.",
    "\"The curve's behavior fits well with our broader understanding of the risks ahead for the global and domestic economy,\" Lyngen said. \"As the GDPNow tracker update illustrates, headwinds on consumption and flagging nonresidential investment are weighing on the U.S. outlook with Q3 growth now seen at just 1.4%. The US is not in a recession to be sure, although this does portend a tangible deceleration from the 2.0% pace of Q2.\"",
    "Short-dated yields fell after the U.S. central bank's Beige Book released Wednesday showed the economy grew at a modest pace in recent weeks, with manufacturing buffeted by a global slowdown while consumer purchases gave mixed signals on the strength of household spending. ",
    "However, the U.S. economy is likely growing at a 1.5% annualized rate in the third quarter, despite a slight narrowing of the U.S. trade deficit in July, the Atlanta Federal Reserve's GDPNow forecast model showed on Wednesday. This was slower than the 1.7% pace estimated by the Atlanta Fed's GDP program on Tuesday. ",
    "An easing of geopolitical tension in Britain and Hong Kong also boosted riskier assets, lowering prices and lifting yields of longer-dated bonds. The 10-year yield  was roughly flat at 1.466% while the 30-year yield  was up 1.5 basis points to 1.965%.",
    "British lawmakers on Wednesday approved a piece of legislation designed to prevent Prime Minister Boris Johnson's government taking the United Kingdom out of the European Union without a deal. ",
    "Hong Kong leader Carrie Lam withdrew an extradition bill that triggered months of often violent protests so the Chinese-ruled city can move forward from a \"highly vulnerable and dangerous\" place and find solutions. "
  ],
  "published_datetime": "2019-09-04 03:48:00"
}