{
  "url": "https://www.nasdaq.com/article/elliott-management-is-ignoring-att-stocks-larger-problems-cm1210760",
  "title": "Elliott Management Is Ignoring AT&T Stock’s Larger Problems - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Shares of AT&T (NYSE: T ) rose 5% Sept. 9. T stock held most of those gains Sept. 10 after Elliott Management issued a letter claiming the company's problems can be fixed.",
    "This letter, published on the activating at&t site, is mainly word salad. It suggests that AT&T stop buying other companies, focus on operations and commit to giving more money back to shareholders. In a press release accompanying the full letter, Elliott Management claims that if AT&T follows the outlined plan it could see a 65% upside to the T stock price by the end of 2021.",
    "However, the letter doesn't address the serious structural problems I pointed to July 1. AT&T remains a yield trap , burdened by both enormous financial and technology debt as well as assets that are depreciating faster than the company can capitalize on them.",
    "Let me illustrate this with a customer example. I'll use myself, Dana Blankenhorn.",
    "I have been sending AT&T as much as $450 per month for a combination of cable, internet and wireless services. But my family can do better.",
    "Google Fi, from Alphabet (NASDAQ: GOOG , NASDAQ: GOOGL ), would cost us $140 per month for the same wireless service I get from AT&T - a savings of about $70 per month. Google Fi is an mobile virtual network operator. Instead of owning its own wireless infrastructure, Alphabet runs Google Fi through several \"borrowed\" networks.  These include European networks, meaning that when my family travels we get to keep our phone numbers.",
    "Alphabet launched Google Fi after failing to gain traction with Google Fiber, which I had installed behind my house a few years ago. Google decided it would cost more to connect me to that wired service than it could generate in cash flow from phone service, TV and fast internet.",
    "That's the rest of my AT&T bill. Ruh-roh.",
    "Why am I paying $150 per month for cable services I don't watch when I could buy a collection of streaming services that replicate the same plan? I only watch TV a few hours a day - mainly sports. ESPN+ carries most games for $5 per month. Amazon's (NASDAQ: AMZN ) Prime Video is free if you find its two-day, free shipping worth $10 per month.  Disney's  (NYSE:DIS) Disney+ is set to launch under $10 per month.",
    "That leaves the internet bit. That's under $100 per month for plenty of bandwidth to handle my work - and those TV streams. AT&T cash flow is about to take a hit.",
    "Since buying Time Warner and rebranding it as WarnerMedia, AT&T has been trying to nickel-and-dime everyone it can to pay down the $159 billion in debt it had at the end of June.",
    "My cable plan has already lost the NFL Network. Now AT&T is fighting over fees with ESPN , its most popular service. Its streaming bundle, now called AT&T TV, is priced at $93 per month , making it completely uncompetitive.",
    "AT&T is killing the U-Verse brand . It made WarnerMedia CEO John Stankey the new president and chief operating officer , and he's now heir-apparent to AT&T CEO Randall Stephenson. In July Stankey was at WarnerMedia's helm as AT&T cut ad sales staff .",
    "AT&T's \"original sin\" was its failure to invest in the cloud and instead move into programming. It bought DirecTv for $49 billion and, later, Time Warner for $84 billion more .",
    "Meanwhile, wired infrastructure inherited from its days as the Bell System has become worthless, now replaced by its own wireless operation. Shuffling the deck chairs, as Elliott proposes, and pushing more money onto shareholders may boost the stock price, temporarily.",
    "But Elliott Management's proposal doesn't even propose to solve AT&T's real problem: its technology debt.",
    "AT&T's market cap today of $272 billion is barely half that of Facebook (NASDAQ: FB ). Facebook is the smallest of the five \"Cloud Czars.\" It was founded in 2004. Google was founded in 1998. Its market cap is over $835 billion.",
    "Facebook and Google built their clouds without debt, without any government aid or bureaucracy, and replaced AT&T's communications functionality on a global scale.",
    "Can Elliott Management really fix that?",
    "Dana Blankenhornis a financial and technology journalist. He is the author of the environmental story, Bridget O'Flynn and the Bear, available at the Amazon Kindle store. Write him at danablankenhorn@gmail.comor follow him on Twitter at @danablankenhorn . As of this writing he owned shares in AMZN.",
    "The post Elliott Management Is Ignoring AT&T Stock's Larger Problems appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:08:29"
}