{
  "url": "https://www.nasdaq.com/article/preciousgold-slips-as-thaw-in-sinous-trade-woes-lift-equities-20190911-00931",
  "title": "PRECIOUS-Gold slips as thaw in Sino-U.S. trade woes lift equities - Nasdaq.com",
  "text": [
    " (Corrects paragraph 1 to say gradual 'de-escalation' not'progress' in U.S.-China trade tensions)",
    "Sept 12 (Reuters) - Gold prices fell on Thursday as equitiesgained on improving risk sentiment buoyed by signs of gradualde-escalation in U.S.-China trade tensions, while investors eyedEuropean Central Bank's meeting for cues on monetary policyeasing. ",
    "* Spot gold XAU= fell 0.4% to $1,491.86 per ounce at 0117GMT. ",
    "* U.S. gold futures GCv1 were down 0.3% at $1,499.5 anounce.",
    "* Asian stocks rose on hopes for a thaw in U.S.-China tradefrictions and expectations that the ECB will kick off anotherwave of monetary easing by global central banks. USD/MKTS/GLOB",
    "* U.S. President Donald Trump on Wednesday welcomed China'sdecision to exempt some U.S. anti-cancer drugs and other goodsfrom its tariffs and announced a delay to scheduled tariff hikeson billions worth of Chinese goods. urn:newsml:reuters.com:*:nL3N2621DV",
    "* Trump called on the \"boneheads\" at the Federal Reserve topush interest rates down into negative territory, a movereluctantly used by other central banks to battle weak economicgrowth that risks punishing savers and banks' earnings. urn:newsml:reuters.com:*:nL2N26208B",
    "* U.S. producer prices unexpectedly rose in August, but theoverall trend in producer inflation remains tame, cementingfinancial market expectations that the Federal Reserve will cutinterest rates again next week to support a slowing economy. urn:newsml:reuters.com:*:nL2N2611H6",
    "* The ECB is set to unveil fresh stimulus measures onThursday to prop up the ailing euro zone economy, but its exactmoves are far from certain and a decision that underwhelmsmarkets risks, pushing up borrowing costs. urn:newsml:reuters.com:*:nL5N2622HL",
    "* The ECB announces its rate decision at 1145 GMT, followedby ECB President Mario Draghi's news conference at 1230 GMT. ",
    "* The British government's plans for a no-deal Brexit warnof severe disruption to cross-Channel routes, affecting thesupply of medicines and certain types of fresh foods, and saythat protests and counter-protests will take place across thecountry, accompanied by a possible rise in publicdisorder. urn:newsml:reuters.com:*:nL2N2621CVDATA AHEAD0600   Germany   HICP Final YY               Aug0645   France    CPI (EU Norm) Final MM, YY  Aug1145   EU        ECB Refinancing Rate        Sept1145   EU        ECB Deposit Rate            Sept1200   India     Industrial Output YY        July1230   US        CPI MM, SA                  Aug1230   US        Initial Jobless Claims      Weekly",
    " (Reporting by Eileen Soreng in Bengaluru; Editing by RashmiAich) ((eileen.soreng@thomsonreuters.com; Within U.S. +1 646 2238780, Outside U.S. +91 80 6749 6131; Reuters Messaging:eileen.soreng.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-11 09:42:00"
}