{
  "url": "https://www.nasdaq.com/article/sluggish-oil-consumption-to-keep-pressure-on-prices-20190905-00509",
  "title": "Sluggish oil consumption to keep pressure on prices - Nasdaq.com",
  "text": [
    "By John Kemp",
    "(John Kemp is a Reuters market analyst.)",
    "LONDON, Sept 5 (Reuters) - Global oil consumption is likely to increase by less than 1 million barrels per day this year, according to a downbeat but realistic assessment from BP's  finance chief on Wednesday.",
    "In both those slow-consumption years, oil prices averaged above $100 per barrel in real terms, helping restrain fuel use. So far this year, however, prices have averaged less than $65, confirming just how weak demand is at present.",
    "BP's forecast is even lower than current predictions from the International Energy Agency (+1.1 million bpd), OPEC (+1.1 million) and the U.S. Energy Information Administration (+1.0 million).",
    "But it is consistent with the broad-based slowdown in global growth stemming from the trade war between the United States and China and a climate of increased uncertainty for businesses.",
    "ECONOMIC FALLOUT",
    "Global GDP growth has been the primary driver of oil consumption for the last 50 years - with prices playing a secondary regulating role, forcing consumption into line with production in the short term.",
    "Global GDP increased by 3.0% in 2018 but is forecast to slow to just 2.6% in 2019, according to the World Bank (\"Global economic prospects\", June 2019).",
    "GDP growth of 2.6% would be the slowest since 2014 and before that 2012, when oil consumption increased by just 1% in both cases (graphic).",
    "Since the World Bank produced its forecasts three months ago, however, most indicators have pointed to a further deceleration in growth.",
    "The most likely outcome is now that GDP growth will come in below 2.5%, perhaps significantly lower, the worst since the recession of 2008/09.",
    "By implication, oil consumption growth is likely to slip below 1% and 1 million bpd, in line with BP's latest forecast.",
    "WELL BELOW TREND",
    "Oil consumption has grown at an average annual rate of 1.5% over the last two decades, but this year is likely to fall far short of that (\"BP Statistical Review of World Energy\", 2019).",
    "Lower prices will help buy back some of the lost growth, principally by blunting incentives for fuel efficiency, as well as boosting spending power in consumer countries.",
    "But until the global economy recovers momentum, oil consumption growth is likely to remain well below trend, keeping prices under pressure.",
    "Oil producers and their suppliers can be added to the long list of industries hit by the trade war and an increasingly unpredictable policy environment, hoping for more settled times ahead."
  ],
  "published_datetime": "2019-09-05 08:27:00"
}