{
  "url": "https://www.nasdaq.com/article/novartis-inks-commercialization-deal-for-tysabri-biosimilar-cm1207331",
  "title": "Novartis Inks Commercialization Deal for Tysabri Biosimilar - Nasdaq.com",
  "text": [
    "  Novartis AG  's NVS  generics unit Sandoz entered a global commercialization agreement with a European biopharmaceutical company- Polpharma Biologics for a proposed biosimilar of Tysabri (natalizumab). The biosimilar is in phase III development for the treatment of relapsing-remitting multiple sclerosis (RRMS). Per the agreement, Polpharma Biologics be responsible for the development, manufacturing and supply of the biosimilar. Sandoz will commercialize and distribute the medicine in all markets upon approval, through an exclusive global license. The branded drug, Tysabri, is a disease-modifying therapy (DMT) that was approved for use more than 10 years ago, offering patients a valuable therapeutic option for treating RRMS. Sandoz continues to expand in the biosimilars marketplace and this is its fifth proposed biosimilar in-licensed by Sandoz in nine months, thus demonstrating its commitment to further grow pipeline through collaborations. Shares of the company have rallied 21.8% year to date compared with the industry  's growth of 3.3%.    In March 219, Novartis also received approval from FDA for Mayzent (siponimod), for for the treatment of relapsing forms of multiple sclerosis, including RRMS, SPMS and CIS. Multiple sclerosis (MS) is a major disease leading to disability in young and adult patients. Per the press release, there are nearly a million people affected by MS in the United States.  Notably, Biogen BIIB  holds a strong position in the United States with multiple drugs in its MS portfolio. Apart from Biogen, several pharma companies have approved treatments for MS including Roche's RHHBY  Ocrevus and Sanofi's SNY  Aubagio. Novartis currently has a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here.       Novartis AG Price          Novartis AG price    |   Novartis AG Quote    Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Roche Holding AG (RHHBY): Free Stock Analysis Report   Sanofi (SNY): Free Stock Analysis Report   Novartis AG (NVS): Free Stock Analysis Report   Biogen Inc. (BIIB): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " Novartis AG  's NVS  generics unit Sandoz entered a global commercialization agreement with a European biopharmaceutical company- Polpharma Biologics for a proposed biosimilar of Tysabri (natalizumab). The biosimilar is in phase III development for the treatment of relapsing-remitting multiple sclerosis (RRMS).",
    "Per the agreement, Polpharma Biologics be responsible for the development, manufacturing and supply of the biosimilar. Sandoz will commercialize and distribute the medicine in all markets upon approval, through an exclusive global license.",
    "The branded drug, Tysabri, is a disease-modifying therapy (DMT) that was approved for use more than 10 years ago, offering patients a valuable therapeutic option for treating RRMS.",
    "Sandoz continues to expand in the biosimilars marketplace and this is its fifth proposed biosimilar in-licensed by Sandoz in nine months, thus demonstrating its commitment to further grow pipeline through collaborations.",
    "Shares of the company have rallied 21.8% year to date compared with the industry  's growth of 3.3%.",
    "In March 219, Novartis also received approval from FDA for Mayzent (siponimod), for for the treatment of relapsing forms of multiple sclerosis, including RRMS, SPMS and CIS.",
    "Multiple sclerosis (MS) is a major disease leading to disability in young and adult patients. Per the press release, there are nearly a million people affected by MS in the United States. ",
    "Notably, Biogen BIIB  holds a strong position in the United States with multiple drugs in its MS portfolio. Apart from Biogen, several pharma companies have approved treatments for MS including Roche's RHHBY  Ocrevus and Sanofi's SNY  Aubagio.",
    "Novartis currently has a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here.  ",
    "    Novartis AG Price          Novartis AG price    |   Novartis AG Quote  ",
    " Novartis AG Price ",
    " Novartis AG price    |   Novartis AG Quote ",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:37:00"
}