{
  "url": "https://www.nasdaq.com/article/bank-of-america-looks-poised-for-sluggish-earnings-and-margin-compression-cm1207282",
  "title": "Bank of America Looks Poised for Sluggish Earnings and Margin Compression - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Bank of America (NYSE: BAC ) stock has remained largely sideways in the last 12 months. In mid-August, the company's chief executive officer told Bloomberg , \"We have nothing to fear about a recession right now except for the fear of recession.\" I think BAC stock investors have reason to fear.",
    "Be it actual recession in the coming quarters or a meaningful slowdown, Bank of America stock is headed lower. This coverage will discuss the downside catalysts with focus on the net interest income margin trend and potential decline in credit growth.",
    "There is little doubt that the United States is witnessing decelerating economic growth.",
    "The spread between 2- and 10-year Treasury yield has slipped below zero for the first time since 2007. This is one of the reliable recession indicators.",
    "The trade war has exaggerated the growth stress and the impact will be felt in the coming quarters. Further, renewed expansionary monetary policy by the Fed is another clear sign of an economic downturn.",
    "Further, three out of every four economists surveyed by the National Association of Business Economics predict recession by 2021.",
    "Overall, there are fears of recession, but a meaningful slowdown is a certainty. This will hit the BAC stock price in the next six-12 months.",
    "It is worth noting that the total household debt balance in the U.S.has cross the peak of 2007-08. With total debt at $13.86 trillion as of second quarter, consumers are more leveraged as compared to pre-crisis levels.",
    "I am of the opinion that a meaningful slowdown or recession for the United States will translate into another phase of deleveraging by consumers.",
    "The consumer confidence in the United States still remains at elevated levels, but I believe that there will be more caution on leveraging as we see strong recession indicators.",
    "The direct impact for Bank of America is likely to be on total revenue growth in the quarters to come. It's worth noting that year-on-year growth in consumer loans was 7% in Q2 2017, 5% in Q2 2018 and 4% in Q2 2019. There is a clear downtrend and I expect further weakness in the consumer loan segment.",
    "An important negative catalyst for Bank of America stock is potential compression in net interest income margin.",
    "The Federal Reserve is back to pursuing expansionary monetary policies and further rate cuts are likely, perhaps as soon as the March meeting.",
    "This will impact the net interest income margin, which is the lending minus financing cost.",
    "Bank of America's net interest income has already peaked out in Q4 2018 at $12.5 billion. It declined to $12.4 billion in Q1 2019 and $12.2 billion in Q2.",
    "The net interest yield (excluding global markets) has declined from 2.52% in Q4 to 2.44% in Q2 this year. I expect the decline in NII and margin compression to continue and this will negatively impact BAC stock.",
    "I am bearish on the BAC stock price as revenue growth is likely to be subdued and margin compression is already underway.",
    "However, unlike the crisis of 2008-09, Bank of America is well positioned to navigate the slowdown or recession.",
    "The 2019 Dodd-Frank Act stress test indicates that capital ratios will remain relatively healthy under a stressed scenario. As a matter of fact, the entire U.S. banking system is well positioned to face economic headwinds.",
    "To be sure, BAC stock might trend lower as margin compression factor is discounted. But the decline would be an opportunity to accumulate the stock as fundamentals remain strong. With consumption likely to remain the key driver of U.S. economic growth, I expect renewed credit growth after a phase of deleveraging by households.",
    "The largely sideways movement in BAC stock is likely to be followed by a relatively sharp movement on the downside.",
    "If the stock does correct by 10% to 15% from current levels, it would be a good buying opportunity. For now, the recession fear will dominate the stock trend.",
    "In addition, sustained expansionary monetary policy can depress the stock as lending and financing cost gap narrows.",
    "As of this writing, Faisal Humayun did not hold a position in any of the aforementioned securities.",
    "The post Bank of America Looks Poised for Sluggish Earnings and Margin Compression appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:31:23"
}