{
  "url": "https://www.nasdaq.com/article/chile-could-cut-rates-but-subzero-qe-talk-premature--central-bank-governor-20190911-00579",
  "title": "Chile could cut rates but sub-zero, QE talk premature - central bank governor - Nasdaq.com",
  "text": [
    "By Marc Jones",
    "LONDON, Sept 11 (Reuters) - Chile could be heading for its third interest rate cut within six months, the country's central bank governor said on Wednesday, but stressed extreme measures like negative interest rates or quantitative easing were still a long way off.",
    "As the world's largest copper producer, Chile has been caught in the middle of the U.S.-China trade war, while those woes have been compounded by the country's worst drought in 60 years. ",
    "\"What is especially worrying is the impact of the trade disputes and other tensions around the world, including Brexit of course, on trade, on financial markets and on business expectations,\" central bank governor Mario Marcel told Reuters.",
    "\"We (the central bank) would be prepared to add some additional monetary impulse if some of the elements of demand - consumption and investment - behaved less dynamically than expected.\"",
    "The bank will now be monitoring key core inflation data, especially services inflation, which is typically the most sensitive to the economy's health or so-called 'output gap'.",
    "Marcel and his fellow policymakers meet next at end of October and for a final time for the year on Dec. 10, when the bank will also publish its quarterly Monetary Policy Report that carries its economic forecasts.",
    "\"I wouldn't say that there is more likelihood to take decisions in one type of meeting than another,\" Marcel said, when asked if the bank is more likely to wait until it has its new projections.",
    "\"Instead we will look at how much the shorter-term forecasts are being validated by the data or not.\"",
    "In its most recent Monetary Policy Report earlier this month, the bank cut 2019 growth forecasts for Chile's$300 billion-a-year economy to a range of 2.25% to 2.75%, from 2.75% to 3.5% previously. ",
    "Since its meeting last week, a key activity indicator, consumer price inflation data, and unemployment numbers had all been \"pretty much\" in line with its expectations, Marcel added.",
    "\"We don't see things worsening but we don't see things improving beyond what we expected either... but it is too soon to tell of course, we have some time.\"",
    "A plummeting currency and recession has led Argentina, Chile's more volatile neighbor, to impose capital controls but the impact on Chile was \"very small if any at all,\" Marcel said, given the very limited trade and financial links between the two countries. ",
    "If Chile does cut rates again it would take them even closer to the record low of 0.5% they hit in 2009 in the aftermath of the global financial crisis.",
    "Some of Europe's top central banks look set to take their rates deeper into negative territory in the coming days and weeks. U.S. President Donald Trump urged the Federal Reserve to do the same on Wednesday, but Marcel said such measures were not on the horizon in Chile, even though its rates are now below U.S. ones.",
    "\"I think it is too early to think about QE or other things. We still have some room for manoeuvre with the interest rate,\" he said.",
    "\"But in any case, for extreme scenarios, we had a test at the time of the financial crisis and we have enough tools to deal with more complicated situations.\""
  ],
  "published_datetime": "2019-09-11 11:33:00"
}