{
  "url": "https://www.nasdaq.com/article/financial-sector-update-for-09032019-land-lyg-db-cm1206788",
  "title": "Financial Sector Update for 09/03/2019: LAND, LYG, DB - Nasdaq.com",
  "text": [
    "Top Financial Stocks:",
    "JPM: -1.51%",
    "BAC: -2.54%",
    "WFC: -1.20%",
    "C: -1.77%",
    "USB: -1.05%",
    "Top financial stocks were falling in midday trading, including a more than 0.8% drop for the NYSE Financial Index while shares of financial companies in the S&P 500 were also about 1.2% down. The Philadelphia Housing Index was edging 0.2% lower today.",
    "In economic news:",
    "Latest data showed that US manufacturing sector contracted for the first time since 2016 in August, with the ISM manufacturing PMI declining to 49.1% in August. Separately, the US began imposing 15% tariffs on Chinese goods, while China starting to apply new duties on US crude oil.",
    "Among financial stocks moving on news:",
    "(+) Gladstone Land ( LAND  ) was over 1% higher after acquiring 413 gross acres of farmland in the Oxnard Plain in California for an undisclosed sum.",
    "In other sector news:",
    "(-) Lloyds Banking Group ( LYG  ) was down 1.7% after saying Halifax, a division of its subsidiary Bank of Scotland, has agreed to acquire Tesco Bank's UK residential mortgage portfolio for about GBP3.8 billion ($4.6 billion) at a low single-digit premium.",
    "(+) Deutsche Bank ( DB  ) was a touch higher after various media reported that CEO Christian Sewing will invest 15% of his monthly net salary in the bank's shares.",
    "(+) S&P Global ( SPGI  ) edged fractionally up after Platts division acquired the UK-based Live Rice Index, a provider of information and benchmark price assessments for the rice industry.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-03 12:49:15"
}