{
  "url": "https://www.nasdaq.com/article/euro-bond-cram-raises-questions-of-sustainability-20190905-00817",
  "title": "Euro bond cram raises questions of sustainability - Nasdaq.com",
  "text": [
    "By Eleanor Duncan and Sudip Roy",
    "LONDON, Sept 5 (IFR) - Nine issuers crammed euro bonds through the new issue pipeline on Thursday, a frantic session in what has already been a busy start to post-summer issuance.",
    "Corporates have now raised €37bn in the European bond markets since the UK's bank holiday on August 27 in order to take advantage of low rates. That's already more than the €35bn issued for the whole of last September, according to IFR data.",
    "\"There's a view that central banks will disappoint so issuers want to get in ahead [of the ECB announcement],\" said one syndicate banker.",
    "Another syndicate banker said: \"If it were not for cash balances, fund inflows and ECB QE hopes, this market would not be able to digest supply in the way it has and we would see secondary markets trade even weaker than they do.\"",
    "Today's session saw regular issuers like Fiat's finance arm FCA Bank, Blackstone Property Partners Europe Holdings (BPPEHX) and Snam raise €750m, €1.1bn, and €1.1bn respectively.",
    "But the conditions were also too good for rarer issuers to pass up: Wirecard made a debut appearance via a €500m five-year, while Origin Energy, DS Smith, Continental and Babcock also came back to the euro bond market after several years away.",
    "CONTRAST",
    "Triple B rated Snam, which has issued at least once a year since 2012, according to IFR data, cut pricing on its €500m May 2024 by 15bp-20bp from start to finish to launch at 55bp over swaps. The Italian energy company ended up with a €970m book for the bond.",
    "Snam also raised a €600m 15-year bond, which landed at plus 103bp, from IPTs of 130bp-135bp. Books hit €1.65bn (pre-rec).",
    "For BPPEHX, which was returning to the market after a €500m five-year in February, priced a €500m four-year at 100bp over and a €600m 10-year at 200bp over.",
    "The more infrequent issuers were also able to drive pricing tighter. German auto company Continental, which last issued in November 2016, saw books peak at over €2.9bn for a €500m Sept 2023 note.",
    "That enabled leads to move pricing from 90bp area to 55bp. The 30bp move from IPTs to guidance of 60bp (+/-5bp) was a particularly aggressive move. The final book was around €1.7bn.",
    "Issuers on the whole are playing it safe at starting levels, with companies on the day announcing initial levels around 25bp-30bp back from fair value, bankers said.",
    "And for now, investors seem willing to play ball - although they told IFR they are picking their spots more.",
    "\"Clearly syndicates need to be cognizant that there's a lot out there and not to be too greedy,\" one investor said.",
    "But from the syndicate desk, bankers are hearing little push-back - although perhaps simply because the buyside is overwhelmed.",
    "\"To be honest investors have no time to say anything,\" said the first syndicate banker. \"They're looking at relative value.\"",
    "Still, while syndicate bankers say it is too early to talk about indigestion, there are signs of weakness in secondary.",
    "For example, there is clear underperformance at the short end, where negative yields are running rife, several syndicate bankers said.",
    "For example, Engie's €750m 7.5-year priced on August 28 at MS+43bp, with a negative yield of -0.001%. But while demand peaked at €1.5bn on the day, the bond is now trading 6bp wider in spread terms, according to Tradeweb. It is also now in positive yield territory at 0.1%.",
    "Such underperformance has started to spread. Daimler's €3bn four-part euro bond, issued on August 1, is now over 20bp wider across the curve. That deal had initially seen as much as €7.4bn in demand.",
    "Average euro corporate bond spreads have slowly gapped out by 14bp from the beginning of August to 80.8bp, as of September 4, according to iBoxx data.",
    "Still, the corporate bond influx seems unlikely to slow over the coming week.",
    "\"You don't stop until there's push-back, and you don't know when that's going to come,\" said the first syndicate banker.",
    "\"We feel like we have a duty to our clients and to the market to do the right thing.\"",
    "Still, he added:",
    "\"There is a lot of complacency on desks but it's been like that for five years.\""
  ],
  "published_datetime": "2019-09-05 11:53:00"
}