{
  "url": "https://www.nasdaq.com/article/consumer-sector-update-for-09042019-navpvhmikaeo-cm1207501",
  "title": "Consumer Sector Update for 09/04/2019: NAV,PVH,MIK,AEO - Nasdaq.com",
  "text": [
    "Top Consumer Stocks",
    "WMT +1.00%",
    "MCD +0.7%",
    "DIS +1.1%",
    "CVS +1.7%",
    "KO +0.84%",
    "Consumer stocks added to their mid-day advance this afternoon, with shares of consumer staples companies in the S&P 500 climbing over 0.8% in late trade while shares of consumer discretionary firms in the S&P 500 were ahead more than 0.9%.",
    "Among consumer stocks moving on news:",
    "(+) Navistar International ( NAV  ) motored to a 12% gain on Wednesday after the specialty truck manufacturer reported above-consensus results for its fiscal Q3 and raised the bottom end of its forecast for FY19 deliveries. The company is now expecting to ship between 435,000 to 445,000 of its Class 6-8 trucks to the United States and Canada by Oct. 31, up from its prior guidance expecting 425,000 to 445,000 vehicle deliveries this year.",
    "In other sector news:",
    "(+) PVH Corp ( PVH  ) rose more than 9% after a regulatory filing showed board chairman and CEO Emanuel Chirico bought 133,155 shares of the apparel company's stock on Tuesday at an average price of $74.99 each. Following his nearly $10 million purchase, Chirico directly owns 417,351 PVH shares and also holds another 9.43 million shares through a 401(k) plan.",
    "(+) The Michaels Companies ( MIK  ) was more than 12% higher on Wednesday after the retailer reported a $0.19 per share adjusted Q2 profit, topping its non-GAAP net income of $0.15 per share during the same quarter last year and also beating the Capital IQ consensus for the three months ended August 3 by $0.05 per share. Net sales slipped from year-ago levels to $1.03 billion versus $1.05 billion but also squeaked past the analyst mean looking for $1.02 billion in sales.",
    "(-) American Eagle Outfitters ( AEO  ) plunged almost 15% after the clothier Wednesday projected non-GAAP earnings for its current Q3 ending in October in a range of $0.47 to $0.49 per share, trailing the Capital IQ consensus by at least $0.03 per share. The company also said it was \"disappointed\" with its Q2 profit and revenue because those operating results lagged its internal expectations despite beating Wall Street estimates for the three months ended August 3.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-04 03:29:35"
}