{
  "url": "https://www.nasdaq.com/article/fmx-vs-ko-which-stock-is-the-better-value-option-cm1210433",
  "title": "FMX vs. KO: Which Stock Is the Better Value Option? - Nasdaq.com",
  "text": [
    " Investors interested in stocks from the Beverages - Soft drinks sector have probably already heard of Fomento Economico (FMX) and Coca-Cola (KO). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look. Everyone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits. Both Fomento Economico and Coca-Cola have a Zacks Rank of # 2 (Buy) right now. The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that both of these companies have improving earnings outlooks. But this is just one factor that value investors are interested in. Value investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels. The Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors. FMX currently has a forward P/E ratio of 25.19, while KO has a forward P/E of 25.86. We also note that FMX has a PEG ratio of 1.59. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. KO currently has a PEG ratio of 3.78. Another notable valuation metric for FMX is its P/B ratio of 1.93. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, KO has a P/B of 11.46. These metrics, and several others, help FMX earn a Value grade of B, while KO has been given a Value grade of D. Both FMX and KO are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that FMX is the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Fomento Economico Mexicano S.A.B. de C.V. (FMX): Free Stock Analysis Report   Coca-Cola Company (The) (KO): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors interested in stocks from the Beverages - Soft drinks sector have probably already heard of Fomento Economico (FMX) and Coca-Cola (KO). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look.",
    "Everyone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits.",
    "Both Fomento Economico and Coca-Cola have a Zacks Rank of # 2 (Buy) right now. The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that both of these companies have improving earnings outlooks. But this is just one factor that value investors are interested in.",
    "Value investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels.",
    "The Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors.",
    "FMX currently has a forward P/E ratio of 25.19, while KO has a forward P/E of 25.86. We also note that FMX has a PEG ratio of 1.59. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. KO currently has a PEG ratio of 3.78.",
    "Another notable valuation metric for FMX is its P/B ratio of 1.93. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, KO has a P/B of 11.46.",
    "These metrics, and several others, help FMX earn a Value grade of B, while KO has been given a Value grade of D.",
    "Both FMX and KO are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that FMX is the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:40:13"
}