{
  "url": "https://www.nasdaq.com/article/biotech-stock-roundup-amgns-lung-cancer-candidate-alxns-deal-with-eidos-in-focus-cm1210524",
  "title": "Biotech Stock Roundup: AMGN's Lung Cancer Candidate, ALXN's Deal With Eidos in Focus - Nasdaq.com",
  "text": [
    " It was a pretty ho-hum week for the biotech sector, with updates from only a few players. While Amgen AMGN  reported positive data on its lung cancer candidate, Alexion ALXN  signed a licensing deal with Eidos for amyloidosis drug. Meanwhile, there were a few updates from certain smaller biotechs as well.    Recap of the Week's Most Important Stories    :   Amgen Announces Promising Data on Lung Cancer   Drug   :  Amgen announced  new data from a phase I study evaluating its novel investigational KRAS inhibitor, AMG 510, in patients with previously-treated KRAS G12C-mutated solid tumors at IASLC 2019 World Conference on Lung Cancer (WCLC). Data showed anti-tumor activity, with no dose-limiting toxicities in a large group of lung cancer patients. Per the data, 54% of the evaluable NSCLC patients (n=13), who were given a high dose of 960 mg once daily, showed a partial response at one or more timepoints. Additionally, 46% of these patients experienced stability in disease. Amgen earlier said that AMG-510 showed responses in patients with colorectal and appendiceal cancer. It is also enrolling patients in an NSCLC cohort to evaluate the combination of AMG 510 and a PD-1 inhibitor. It plans to initiate a registration enabling phase II study soon.   Alexion In-licenses Amyloidosis Candidate in   Japan   : Alexion Pharmaceuticals, Inc. announced  a license agreement with BridgeBio Pharma, Inc.'s subsidiary, Eidos Therapeutics, Inc. Per the deal, Alexion will obtain an exclusive license from Eidos to develop and commercialize an investigational, orally-administered small molecule AG10 in Japan. In exchange, the latter will receive an upfront payment of $25 million and an equity investment of $25 million at a premium to the market price from the former upon the deal execution. Also, Eidos is eligible to receive additional milestones and royalty-dependent fees.  AG10 has been designed to treat the root cause of transthyretin amyloidosis (ATTR) - destabilized and misfolded transthyretin (TTR) protein - by binding and stabilizing TTR in the blood.  The deal expands Alexion's amyloidosis portfolio. Alexion currently carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .   Horizon's Ophthalmology Drug Gets FDA's Priority   Review   : Horizon Therapeutics plc HZNP announced  that the FDA has accepted the Biologics License Application (BLA) for its investigational medicine, teprotumumab, for the treatment of active thyroid eye disease (TED), and granted it Priority Review designation. If approved, teprotumumab would be the first FDA-approved medicine for the treatment of active TED. The candidate was added to the company's portfolio after the acquisition of River Vision in 2017. The FDA completed its filing review and determined that the application is sufficiently complete to permit a substantive review. The FDA set an action date of Mar 8, 2020.  The agency notified that it is currently planning to hold an advisory committee meeting to discuss the application per guidelines.    Acceleron's PAH Drug Gets Orphan Drug Status   : Acceleron Pharma Inc. XLRN announced  that the FDA has granted the Orphan Drug designation to its investigational candidate, sotatercept, for the treatment of patients with pulmonary arterial hypertension (PAH).  Sotatercept is currently being evaluated in two phase II studies in PAH. In June, Acceleron completed enrolling patients in the PULSAR study and plans to report top-line data from the same during the first quarter of 2020. Also, the company is currently recruiting subjects in the SPECTRA exploratory study to have a better understanding of sotatercept's potential impact on PAH patients. Preliminary results from this study are expected in 2020.   AVEO Announces Positive Data on Kidney Cancer   Drug   :  AVEO Oncology AVEO  announced results from the second prespecified analysis of overall survival (OS) in the phase III multi-center, open-label study, TIVO-3. The study is evaluating Fotivda compared to Nexavar in 350 subjects with highly refractory metastatic renal cell carcinoma (RCC). These results showed an OS hazard ratio (HR) below 1.00, which was in favor of Fotivda as it indicates that treatment with the drug led to a lower risk of death. Per the company, this is the first phase III study in RCC to investigate a predefined subpopulation of patients, who received prior immunotherapy, an emerging standard of care for earlier lines of therapy.  Performance    Medical - Biomedical and Genetics Industry 5YR %     Return        Medical - Biomedical and Genetics Industry 5YR     % Return   The Nasdaq Biotechnology index gained 1.98% in the last five trading sessions. Among the biotech giants, Alexion gained 15.15% in the period. Over the past six months, shares of Celgene have gained 14.53%, whereas the Regeneron stock has slumped 31.14%. (See the last biotech stock roundup here:  Biotech Stock Roundup: REGN Wins Against AMGN,   VRTX to Acquire Semma & More   ).       What's Next in Biotech?  Stay tuned for more pipeline updates.  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana. Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  AVEO Pharmaceuticals, Inc. (AVEO): Free Stock Analysis Report   Acceleron Pharma Inc. (XLRN): Free Stock Analysis Report   Alexion Pharmaceuticals, Inc. (ALXN): Free Stock Analysis Report   Horizon Pharma Public Limited Company (HZNP): Free Stock Analysis Report   Amgen Inc. (AMGN): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "It was a pretty ho-hum week for the biotech sector, with updates from only a few players. While Amgen AMGN  reported positive data on its lung cancer candidate, Alexion ALXN  signed a licensing deal with Eidos for amyloidosis drug. Meanwhile, there were a few updates from certain smaller biotechs as well.",
    "   Recap of the Week's Most Important Stories    :",
    "  Amgen Announces Promising Data on Lung Cancer   Drug   :  Amgen announced  new data from a phase I study evaluating its novel investigational KRAS inhibitor, AMG 510, in patients with previously-treated KRAS G12C-mutated solid tumors at IASLC 2019 World Conference on Lung Cancer (WCLC).",
    "Data showed anti-tumor activity, with no dose-limiting toxicities in a large group of lung cancer patients. Per the data, 54% of the evaluable NSCLC patients (n=13), who were given a high dose of 960 mg once daily, showed a partial response at one or more timepoints. Additionally, 46% of these patients experienced stability in disease. Amgen earlier said that AMG-510 showed responses in patients with colorectal and appendiceal cancer. It is also enrolling patients in an NSCLC cohort to evaluate the combination of AMG 510 and a PD-1 inhibitor. It plans to initiate a registration enabling phase II study soon.",
    "  Alexion In-licenses Amyloidosis Candidate in   Japan   : Alexion Pharmaceuticals, Inc. announced  a license agreement with BridgeBio Pharma, Inc.'s subsidiary, Eidos Therapeutics, Inc. Per the deal, Alexion will obtain an exclusive license from Eidos to develop and commercialize an investigational, orally-administered small molecule AG10 in Japan. In exchange, the latter will receive an upfront payment of $25 million and an equity investment of $25 million at a premium to the market price from the former upon the deal execution. Also, Eidos is eligible to receive additional milestones and royalty-dependent fees.  AG10 has been designed to treat the root cause of transthyretin amyloidosis (ATTR) - destabilized and misfolded transthyretin (TTR) protein - by binding and stabilizing TTR in the blood.  The deal expands Alexion's amyloidosis portfolio.",
    "Alexion currently carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "  Horizon's Ophthalmology Drug Gets FDA's Priority   Review   : Horizon Therapeutics plc HZNP announced  that the FDA has accepted the Biologics License Application (BLA) for its investigational medicine, teprotumumab, for the treatment of active thyroid eye disease (TED), and granted it Priority Review designation. If approved, teprotumumab would be the first FDA-approved medicine for the treatment of active TED. The candidate was added to the company's portfolio after the acquisition of River Vision in 2017. The FDA completed its filing review and determined that the application is sufficiently complete to permit a substantive review. The FDA set an action date of Mar 8, 2020.  The agency notified that it is currently planning to hold an advisory committee meeting to discuss the application per guidelines. ",
    "  Acceleron's PAH Drug Gets Orphan Drug Status   : Acceleron Pharma Inc. XLRN announced  that the FDA has granted the Orphan Drug designation to its investigational candidate, sotatercept, for the treatment of patients with pulmonary arterial hypertension (PAH).  Sotatercept is currently being evaluated in two phase II studies in PAH. In June, Acceleron completed enrolling patients in the PULSAR study and plans to report top-line data from the same during the first quarter of 2020. Also, the company is currently recruiting subjects in the SPECTRA exploratory study to have a better understanding of sotatercept's potential impact on PAH patients. Preliminary results from this study are expected in 2020.",
    "  AVEO Announces Positive Data on Kidney Cancer   Drug   :  AVEO Oncology AVEO  announced results from the second prespecified analysis of overall survival (OS) in the phase III multi-center, open-label study, TIVO-3. The study is evaluating Fotivda compared to Nexavar in 350 subjects with highly refractory metastatic renal cell carcinoma (RCC). These results showed an OS hazard ratio (HR) below 1.00, which was in favor of Fotivda as it indicates that treatment with the drug led to a lower risk of death. Per the company, this is the first phase III study in RCC to investigate a predefined subpopulation of patients, who received prior immunotherapy, an emerging standard of care for earlier lines of therapy.",
    " Performance ",
    "  Medical - Biomedical and Genetics Industry 5YR %     Return        Medical - Biomedical and Genetics Industry 5YR     % Return  ",
    " Medical - Biomedical and Genetics Industry 5YR %     Return ",
    " Medical - Biomedical and Genetics Industry 5YR     % Return ",
    "The Nasdaq Biotechnology index gained 1.98% in the last five trading sessions. Among the biotech giants, Alexion gained 15.15% in the period. Over the past six months, shares of Celgene have gained 14.53%, whereas the Regeneron stock has slumped 31.14%. (See the last biotech stock roundup here:  Biotech Stock Roundup: REGN Wins Against AMGN,   VRTX to Acquire Semma & More   ).",
    "      What's Next in Biotech? ",
    "Stay tuned for more pipeline updates.",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:49:00"
}