{
  "url": "https://www.nasdaq.com/article/why-vmwares-48-billion-in-cybersecurity-and-development-buys-makes-sense-cm1207934",
  "title": "Why VMware's $4.8 Billion in Cybersecurity and Development Buys Makes Sense - Nasdaq.com",
  "text": [
    "Though it's by no means a new technology, cloud computing is still growing like a weed. Tech researcher Gartner expects the cloud sector to grow 17.5% in 2019, and total yearly global spending on the technology to nearly double from 2018 levels to over $330 billion by 2022.",
    "At the heart of this massive movement is digital transformation, as businesses and other organizations update their operations for the 21st century. The biggest enablers of the cloud and digital transformation -- Amazon 's AWS, Microsoft 's Azure, Alphabet 's Google Cloud, even software providers like heavyweight and early cloud adopter salesforce.com -- get most of the attention.",
    "Often lost in the conversation (but a leader in cloud infrastructure in its own right) is VMware (NYSE: VMW) . The tech company is far smaller than its biggest peers and growth has been solid, though \"only\" running in the low double-digits. But a couple of key acquisitions were recently made to help light a fire as the cloud-driven transformation industry heats up.",
    "Image source: Getty Images.",
    "When building out a digital operation, businesses face two tough tasks: efficiently building new digital tools and applications and keeping data secure. Technology talent is in high demand, and finding and attracting the right people to get the job done is not easy. And data security is a high-profile topic. A breach in security can mean more than a PR nightmare. Loss of customer confidence, loss of critical and sensitive information, and ultimately lost revenue and profits are real possibilities. Cybersecurity has been a booming industry growing alongside the cloud.",
    "Possibly because it sees app development and security as two sides to the same problem, VMware went shopping to solve both tasks simultaneously. It landed on longtime partner and software developer Pivotal Software (NYSE: PVTL) and cloud-based endpoint security outfit Carbon Black (NASDAQ: CBLK) , carrying price tags of $2.7 billion and $2.1 billion, respectively. Those are hefty price tags, but not unreasonable. That's about half a year's worth of revenue and just over a year's worth of free cash flow for VMware.",
    "Data by YCharts .",
    "Speaking to the rationale for buying Pivotal and Carbon Black, CEO Patrick Gelsinger introduced his second-quarter commentary this way:",
    "As digital transformation accelerates in enterprises, we see three secular trends becoming stronger. First, multi-cloud is the new model for enterprise IT. Second, digital transformation is driving accelerated pace of cloud-native app development. Last but not least, as businesses move applications to the cloud and access it over distributed networks from a diversity of endpoints, security has become a significant challenge and priority.",
    "Put simply, Pivotal and Carbon Black will enable VMware to help companies build, test, and manage new apps, and then protect those apps as they get used across the hundreds of millions of connected devices in operation around the globe. Making it easier for businesses to make the digital transformation and stay safe as they do so is the key to VMware's continued growth. As to cybersecurity, VMware is following the lead of others like Broadcom , which recently purchased the enterprise security division from Symantec , and BlackBerry , which scooped up endpoint security outfit Cylance . With Carbon Black now becoming VMware's subsidiary, the only other endpoint security pure-play left for investors is the white-hot recent IPO CrowdStrike . Clearly, the cloud security space has received a lot of attention.",
    "VMware could use the boost. Though the 12.5% revenue growth it put up through the first half of 2019 is nothing to balk at, it does nevertheless mean that the company is missing out on market share gains as the rest of the industry grows even faster. While Pivotal and Carbon Black are by far its largest purchases, VMware has been on a shopping spree this year, picking up all sorts of small cloud-based start-ups from artificial intelligence to app delivery to network monitoring. VMware has been playing in the cloud sandbox for quite some time, and it needs some help to keep up with the times and rekindle its growth engine.",
    "Only time will tell if the recent maneuvering will pay off or not, but in the meantime, the technologist is worth doing some due diligence on. Shares trade for a reasonable 17.4 times price to free cash flow. If the acquisition spree pays off, there's certainly room for this stock to run much higher. Stay tuned.",
    "10 stocks we like better than VMware\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and VMware wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "John Mackey, CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Teresa Kersten, an employee of LinkedIn, a Microsoft subsidiary, is a member of The Motley Fool's board of directors. Nicholas Rossolillo  and his clients own shares of Alphabet (C shares), CrowdStrike Holdings, Inc., Microsoft, and Salesforce.com. The Motley Fool owns shares of and recommends Alphabet (A shares), Alphabet (C shares), Amazon, BlackBerry, Microsoft, and Salesforce.com. The Motley Fool owns shares of CrowdStrike Holdings, Inc and has the following options: long January 2021 $100 calls on Salesforce.com and long January 2021 $85 calls on Microsoft. The Motley Fool recommends Broadcom Ltd, Gartner, and VMware. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:38:47"
}