{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-skechers-rent-a-center-crocs-lincoln-educational-services-and-funko-cm1206611",
  "title": "The Zacks Analyst Blog Highlights: Skechers, Rent-A-Center, Crocs, Lincoln Educational Services and Funko - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 3, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Skechers U.S.A., Inc. SKX  , Rent-A-Center, Inc. RCII  , Crocs, Inc. CROX  , Lincoln Educational Services Corp. LINC  and Funko, Inc. FNKO  .  Here are highlights from Friday's Analyst Blog:    Consumer Spending Fuels Q2 GDP: Top Picks   Last month, the Department of Commerce's initial estimate for second-quarter GDP pushed the economy's most widely watched metric below the level recorded for the first quarter. Now, the latest estimate for the gauge has moved even lower, as was widely expected. Economists are attributing the slide to the fallout of the bitter U.S.-China trade war. The petering out of the impact of Trump's tax cuts is believed to be another reason for this significant decline in growth. However, GDP still surpassed some estimates, only due to the contribution from strong consumer spending. This is why it still makes good sense to invest in consumer discretionary stocks, which derive strength from personal spending, universally acknowledged as the engine of the U.S. economy.  Trade War, Receding Impact of Tax Cuts Hurt GDP  Per the Commerce Department's second estimate, GDP for the second quarter currently stands at an annualized rate of 2%. This is marginally lower than the pace of 2.1% estimated last month. It represents an even more significant slowdown from the 3.1% pace recorded in the first quarter. The economy expanded 2.6% during the first half of 2019. Economists attribute this deceleration to the U.S.-China trade war. The conflict shows no sign of ending and has reduced business investment and hurt manufacturing. It now threatens to end the 11-year long economic expansion. Another reason for the loss in economic momentum is the receding impact of Trump's tax cut and government spending drive.   Consumer Spending to the Rescue  Though the Fed Chair thinks that the economy is favorably positioned, the central bank is closely observing events. Jerome Powell has stated time and again that the Federal Reserve will \"act as appropriate\" to sustain the pace of economic momentum. Last month's rate cut supports such a view and markets have already penciled in another reduction in rates after the Fed's September meeting. At this point, the only saving grace for the economy is the robust pace of consumer spending. The Department of Commerce raised its estimate for growth in consumer spending from 4.3% to 4.7% for the second quarter. The metric, which accounts for more than two-thirds of U.S. economic activity, benefited from higher spending overall, especially on autos, apparel and restaurants.  Strong consumer spending also helped American businesses rack up their first increase in profits in three quarters. The 5.3% rise in adjusted pretax corporate profits was also the first since mid-2014. Higher spending also contributed to a decline in inventory accumulation during the second quarter.  Our Choices  Despite the slowdown in economic growth, the U.S. economy remains in a strong position thanks to a solid burst of consumer spending. With American consumers remaining confident, the trend is likely to be sustained in the quarters ahead. This is why investing in consumer discretionary stocks remains a prudent choice. However, picking winning stocks may be difficult. This is where our VGM Score  comes in. Here V stands for Value, G for Growth and M for Momentum and the score is a weighted combination of these three scores. Such a score allows you to eliminate the negative aspects of stocks and select winners. However, it is important to keep in mind that each Style Score will carry a different weight while arriving at a VGM Score.  We have narrowed down our search to the following stocks, each of which has a Zacks Rank #1 (Strong Buy) and good VGM Score. You can see   the complete list of today's Zacks #1 Rank stocks   here   .  Skechers U.S.A., Inc.  designs, develops and markets a diverse range of lifestyle footwear for men, women and children, as well as performance footwear for men and women. Skechers has a VGM Score of A. The company's projected growth rate for the current year is 17.4%. The Zacks Consensus Estimate for the current year has improved by 2.1% over the last 30 days.     Rent-A-Center, Inc.  is a lessor of household durable goods, which are provided on a rent-to-own basis. Rent-A-Center has a VGM Score of A. The company's projected growth rate for the current year is more than 100%. The Zacks Consensus Estimate for the current year has improved by 6.6% over the last 30 days.     Crocs, Inc.  is a designer, developer, manufacturer and distributor of casual footwear for men, women and children. Crocs has a VGM Score of A. The company's projected growth rate for the current year is 62.8%. The Zacks Consensus Estimate for the current year has improved by 12.5% over the last 30 days.    Lincoln Educational Services Corp.  is a leading and diversified for-profit provider of a career-oriented, post-secondary education in the United States. Lincoln Educational Services has a VGM Score of A. The company's projected growth rate for the current year is more than 100%. The Zacks Consensus Estimate for the current year has improved by 15.4% over the past 30 days.   Funko, Inc.  is a pop culture consumer products company. Funko has a VGM Score of B. The company's projected growth rate for the current year is 48.9%. The Zacks Consensus Estimate for the current year has improved by 10.7% over the last 30 days.   Today's Best Stocks from Zacks  Would you like to see the updated picks from our best market-beating strategies? From 2017 through 2018, while the S&P 500 gained +15.8%, five of our screens returned +38.0%, +61.3%, +61.6%, +68.1%, and +98.3%. This outperformance has not just been a recent phenomenon. From 2000 - 2018, while the S&P averaged +4.8% per year, our top strategies averaged up to +56.2% per year.   See their latest picks free >>   Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Rent-A-Center, Inc. (RCII): Free Stock Analysis Report   Lincoln Educational Services Corporation (LINC): Free Stock Analysis Report   Skechers U.S.A., Inc. (SKX): Free Stock Analysis Report   Crocs, Inc. (CROX): Free Stock Analysis Report   Funko, Inc. (FNKO): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 3, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Skechers U.S.A., Inc. SKX  , Rent-A-Center, Inc. RCII  , Crocs, Inc. CROX  , Lincoln Educational Services Corp. LINC  and Funko, Inc. FNKO  .",
    " Here are highlights from Friday's Analyst Blog: ",
    "  Consumer Spending Fuels Q2 GDP: Top Picks  ",
    "Last month, the Department of Commerce's initial estimate for second-quarter GDP pushed the economy's most widely watched metric below the level recorded for the first quarter. Now, the latest estimate for the gauge has moved even lower, as was widely expected. Economists are attributing the slide to the fallout of the bitter U.S.-China trade war.",
    "The petering out of the impact of Trump's tax cuts is believed to be another reason for this significant decline in growth. However, GDP still surpassed some estimates, only due to the contribution from strong consumer spending.",
    "This is why it still makes good sense to invest in consumer discretionary stocks, which derive strength from personal spending, universally acknowledged as the engine of the U.S. economy.",
    " Trade War, Receding Impact of Tax Cuts Hurt GDP ",
    "Per the Commerce Department's second estimate, GDP for the second quarter currently stands at an annualized rate of 2%. This is marginally lower than the pace of 2.1% estimated last month. It represents an even more significant slowdown from the 3.1% pace recorded in the first quarter. The economy expanded 2.6% during the first half of 2019.",
    "Economists attribute this deceleration to the U.S.-China trade war. The conflict shows no sign of ending and has reduced business investment and hurt manufacturing. It now threatens to end the 11-year long economic expansion. Another reason for the loss in economic momentum is the receding impact of Trump's tax cut and government spending drive. ",
    " Consumer Spending to the Rescue ",
    "Though the Fed Chair thinks that the economy is favorably positioned, the central bank is closely observing events. Jerome Powell has stated time and again that the Federal Reserve will \"act as appropriate\" to sustain the pace of economic momentum. Last month's rate cut supports such a view and markets have already penciled in another reduction in rates after the Fed's September meeting.",
    "At this point, the only saving grace for the economy is the robust pace of consumer spending. The Department of Commerce raised its estimate for growth in consumer spending from 4.3% to 4.7% for the second quarter. The metric, which accounts for more than two-thirds of U.S. economic activity, benefited from higher spending overall, especially on autos, apparel and restaurants. ",
    "Strong consumer spending also helped American businesses rack up their first increase in profits in three quarters. The 5.3% rise in adjusted pretax corporate profits was also the first since mid-2014. Higher spending also contributed to a decline in inventory accumulation during the second quarter.",
    " Our Choices ",
    "Despite the slowdown in economic growth, the U.S. economy remains in a strong position thanks to a solid burst of consumer spending. With American consumers remaining confident, the trend is likely to be sustained in the quarters ahead.",
    "This is why investing in consumer discretionary stocks remains a prudent choice. However, picking winning stocks may be difficult.",
    "This is where our VGM Score  comes in. Here V stands for Value, G for Growth and M for Momentum and the score is a weighted combination of these three scores. Such a score allows you to eliminate the negative aspects of stocks and select winners. However, it is important to keep in mind that each Style Score will carry a different weight while arriving at a VGM Score. ",
    "We have narrowed down our search to the following stocks, each of which has a Zacks Rank #1 (Strong Buy) and good VGM Score. You can see   the complete list of today's Zacks #1 Rank stocks   here   .",
    " Skechers U.S.A., Inc.  designs, develops and markets a diverse range of lifestyle footwear for men, women and children, as well as performance footwear for men and women.",
    "Skechers has a VGM Score of A. The company's projected growth rate for the current year is 17.4%. The Zacks Consensus Estimate for the current year has improved by 2.1% over the last 30 days.   ",
    " Rent-A-Center, Inc.  is a lessor of household durable goods, which are provided on a rent-to-own basis.",
    "Rent-A-Center has a VGM Score of A. The company's projected growth rate for the current year is more than 100%. The Zacks Consensus Estimate for the current year has improved by 6.6% over the last 30 days.   ",
    " Crocs, Inc.  is a designer, developer, manufacturer and distributor of casual footwear for men, women and children.",
    "Crocs has a VGM Score of A. The company's projected growth rate for the current year is 62.8%. The Zacks Consensus Estimate for the current year has improved by 12.5% over the last 30 days.  ",
    " Lincoln Educational Services Corp.  is a leading and diversified for-profit provider of a career-oriented, post-secondary education in the United States.",
    "Lincoln Educational Services has a VGM Score of A. The company's projected growth rate for the current year is more than 100%. The Zacks Consensus Estimate for the current year has improved by 15.4% over the past 30 days. ",
    " Funko, Inc.  is a pop culture consumer products company.",
    "Funko has a VGM Score of B. The company's projected growth rate for the current year is 48.9%. The Zacks Consensus Estimate for the current year has improved by 10.7% over the last 30 days. ",
    " Today's Best Stocks from Zacks ",
    "Would you like to see the updated picks from our best market-beating strategies? From 2017 through 2018, while the S&P 500 gained +15.8%, five of our screens returned +38.0%, +61.3%, +61.6%, +68.1%, and +98.3%.",
    "This outperformance has not just been a recent phenomenon. From 2000 - 2018, while the S&P averaged +4.8% per year, our top strategies averaged up to +56.2% per year.",
    "  See their latest picks free >>  ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:05:00"
}