{
  "url": "https://www.nasdaq.com/article/health-care-sector-update-for-09112019-abiottoolxrxtlry-cm1210701",
  "title": "Health Care Sector Update for 09/11/2019: ABIO,TTOO,LXRX,TLRY - Nasdaq.com",
  "text": [
    "Top Health Care Stocks",
    "JNJ +1.05%",
    "PFE -0.25%",
    "ABT +1.35%",
    "MRK +1.21%",
    "AMGN -0.73%",
    "Health care stocks added slightly to their earlier advance, with the NYSE Health Care Index climbing over 0.6% while the shares of health care companies in the S&P 500 also were up nearly 0.8% as a group. The Nasdaq Biotechnology index was ahead almost 1.5% in late trade.",
    "Among health care stocks moving on news:",
    "(+) ARCA biopharma ( ABIO  ) rose 10.5% on Wednesday after saying the response to its Gencaro drug candidate appears to be greater in patients with less severe left ventricular dysfunction, a patient population that currently has few therapeutic options to prevent atrial fibrillation or heart failure. The company will present more data from phase IIb testing of Gencaro at the Heart Failure Society of America meeting beginning Friday in Philadelphia.",
    "In other sector news:",
    "(+) T2 Biosystems ( TTOO  ) jumped 80% on Wednesday after the diagnostic products company said it has restructured a term loan agreement with CRG Servicing. It extended the interest-only payment period by an extra year until March 2022 and lowered the minimum revenue targets for 2020 to 2022 below its current financial forecast in exchange for issuing 10-year warrants to CRG to buy up to 568,291 shares at $1.55 apiece and cut the exercise price for warrants previously issued to CRG to the same price.",
    "(+) Lexicon Pharmaceuticals ( LXRX  ) was nearly 30% higher, easing from a 58% spike soon after Wednesday's opening bell, after the firm terminated its alliance with Sanofi ( SNY  ) to develop and commercialize its Zynquista diabetes drug. The company retains all rights to Zynquista and will receive $208 million upfront along with another $52 million due within 12 months.",
    "(-) Tilray ( TLRY  ) dropped more than 1% after the cannabis company announced plans to sell up to $400 million of its Class 2 common shares through an at-the-market offering through Cowen & Co.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-11 04:00:06"
}