{
  "url": "https://www.nasdaq.com/article/new-deals-in-europe-could-boost-tilray-stock-cm1207519",
  "title": "New Deals in Europe Could Boost Tilray Stock - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Canada's cannabis darling Tilray (NASDAQ: TLRY ) has been in the news for mostly the wrong reasons lately. Once dubbed \"the hottest marijuana stock on the planet,\" TLRY stock soared to $300 per share following its July 2018 IPO. Now, the stock trades just under $30. ",
    " Source: Shutterstock",
    "What happened? Initially, limited production capacity plagued Tilray and analysts warned that its fundamentals didn't support its IPO explosion. Despite second-quarter 2019 revenue of $45.9 million , which beat estimates of $41.1 million, TLRY stock fell more than 10%.  ",
    "InvestorPlace contributor Vince Martin wrote that for the first time, profit became the focus of cannabis investors. Tilray's adjusted loss was $17.9 million when analysts estimated a loss of $14.4 million. This was enough to bring the stock down in after-hours trading. ",
    "But headlines are changing and TLRY may be climbing once more. After announcing a new international shipment agreement Aug. 21, Tilray stock closed at $32.34. Although it has dropped since then, this new potential for massive international growth could be just what the company needs. ",
    "The Aug. 21 news that sent Tilray stock climbing was a press release announcing that Tilray - through its wholly owned subsidiary Tilray Portugal - had signed an agreement with Cannamedical Pharma to distribute $3.3 million worth of medical cannabis from Portugal to Germany. Cannamedical will use Tilray's products in its own medicinal brands. ",
    "It's worth noting that $3.3 million is a small deal, especially in the context of Tilray's Q2 revenue of almost $46 million. But, CEO Brendan Kennedy sees this shipping agreement and the recently opened facility in Portugal in a much bigger picture. ",
    "\"We aspire to be the world's most trusted cannabis company,\" Kennedy said in the Aug. 13 earnings call . \"And to do that, we're building a global platform to be a multibillion dollar consumer packaged goods company with a portfolio of world class brands supported by a multinational supply chain.\" ",
    "This call truly foreshadowed the later press release. Since announcing the Cannamedical deal, Kennedy has said that he believes Tilray will soon be able to replicate the arrangement across the European Union in at least 14 additional countries. France is considering legalizing medicinal marijuana in the next year and Luxembourg is moving ahead with legal recreational use. Additionally, TLRY has entered into a deal with Ireland , allowing for the shipment of medicinal marijuana to patients determined to be in great need. ",
    "If Kennedy's predictions come true, an existing partnership with Cannamedical Pharma will help Tilray be one of the first to cash in on an expanded European market. ",
    "Slightly less recently, the company announced another promising deal. On July 11, Tilray acquired Smith & Sinclair , a maker of edible candies, cocktails and fragrances based in the United Kingdom. The self-proclaimed \"Willy Wonka for grown-ups,\" Smith & Sinclair produces booze-infused gummies, lickable fragrances and cocktails in a kit. ",
    "Through this merger, Tilray will be able to develop similarly quirky CBD-infused edible products for the U.S. and Canada.",
    "The deal currently does not allow for distribution in Europe, but who's to say what could happen as European Union regulations change. This partnership - along with its ongoing relationships with Authentic Brands  and  Anheuser-Bush  (NYSE: BUD ) will also give TLRY a leg up in recreational-use derivative products. ",
    "Both recent announcements are exciting for TLRY fans, but they're not the only indication of stellar international growth. Tilray CFO Mark Castaneda shared that international revenue had tripled to almost $1.9 million, up from $477,000 in the prior year. Castaneda said he anticipates even more impressive growth in the second half of 2019 thanks to the new facility in Portugal. ",
    "Investors should watch for the next earnings report - specifically for international revenue numbers - set for Nov. 12. As the Cannamedical Pharma deal continues to unfold and the European market's regulations evolve, these new initiatives could be just the boost that Tilray stock needs.",
    "As of this writing, Sarah Smith did not hold any of the aforementioned securities. ",
    "The post New Deals in Europe Could Boost Tilray Stock appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:12:20"
}