{
  "url": "https://www.nasdaq.com/article/how-safe-are-washington-prime-group-and-its-dividend-cm1207586",
  "title": "How Safe Are Washington Prime Group and Its Dividend? - Nasdaq.com",
  "text": [
    " The retail sector is being hit by the so-called \"   retail apocalypse    ,\" as online sales gain ground and physical-store sales languish.   Real estate investment trust    (REIT)   Washington Prime Group    (NYSE: WPG) owns enclosed malls, which are facing the biggest   threat. Given the stock's 30% dividend yield, however, aggressive   investors with a value bent    might be tempted to take a stake. Here's what you need to know   before you do that. 1. The wrong assets The retail apocalypse is having the biggest impact on enclosed   malls, which are largely what Washington Prime Group owns. It   directly controls around 91 properties, with partial interests   bringing its total mall exposure up to 108 assets. One of the   biggest issues the REIT faces, however, is the quality of the   malls it operates. The average sales per square foot at its malls   are around the $400 mark, while better-positioned competitors   have average rents between $650 and $850 per square foot.makeArticleAd();   Image source: Getty Images.  Based on that information, it shouldn't be surprising that   Washington Prime's properties are located in less desirable   areas. For example, the average population density around its   properties is lower than for most of its competitors. The average   income in neighborhoods where it has assets is also toward the   low end. Basically, it owns malls in regions with relatively   sparse populations that are less affluent. That's not a great   combination, as the weak sales-per-square-foot metric highlights.   The malls Washington Prime operates are the ones being hit   hardest by online sales. 2. Working hard, but it's rough To be fair, Washington Prime isn't exactly sitting around   hoping for better days: Management is hard at work trying to fill   vacancies and keep its malls attractive for tenants and   consumers. For example, like its peers, it's trying to reposition   anchor-tenant properties vacated by retailers like   Bon-Ton    and    Sears     , both of which have gone bankrupt. It's also holding events that   it hopes will bring customers to its malls. But with companies like   Ascena Retail Group still struggling    , there are still rough waters ahead for mall REITs. Washington   Prime's occupancy of 92.5% is troubling -- it fell 1.2 percentage   points year over year in the second quarter. The company's   occupancy numbers, like other key metrics, are toward the low end   of its peer group. And with the likelihood of further headwinds,   occupancy is likely to continue to fall before it stabilizes.   That's why Washington Prime's most recent quarterly presentation   ended with the tagline \"Grind It Out.\" 3. Aggressive actions? While the company is working to reposition its assets, it's   also making some interesting financing moves. For example, in the   most recent quarter, management noted that it had sold 20   outparcel properties. These are usually land parcels close to   existing assets that either are raw land, or have a building that   isn't directly attached to the mall. Mall REITs often hold on to   these properties so they can expand. Selling one or two   outparcels wouldn't be a huge deal, but 20 suggests the company   is scrambling for cash. That's buttressed by the sale leaseback transactions the   company has entered into at four of its properties. Essentially,   it still operates each mall, but sold the underlying land to a   third party to raise cash. This is an interesting way to raise   money, but it's still a troubling move. To be fair, Washington Prime is being creative and taking   advantage of every opportunity it can. But these decisions are   clearly not coming from a position of strength, and thus should   worry investors. 4. Not covering it That brings up the dividend. At 30%, the dividend yield is   incredible -- but Wall Street is obviously expecting a dividend   cut. All the information above fuels that concern, but there's   another, more direct fear: Washington Prime paid out $0.25 per   share in dividends in the most recent quarter, and had   funds from operations    (FFO), the REIT equivalent o   f earnings    , of $0.27 per share. That doesn't leave much room for error:          WPG    data by   YCharts    . But there's more to this story than these numbers tell. During the   second-quarter conference call    , management noted that FFO was helped along by the outparcel   sales. So, coverage may not be as strong as management wants   investors to believe. When pressed by an analyst on the dividend,   management noted that \"We think we're pretty close to covering   the dividend in 2019.\" That statement is important, because FFO doesn't include   expenses like maintenance capital spending and the costs to   reposition vacant anchor tenants. The number that includes those   costs is   adjusted    funds from operations, which can provide a better picture of a   REIT's dividend-paying ability. \"Close to covering\" is a lot less   reassuring than what the FFO number suggests, and the company   isn't sharing its expectations for adjusted FFO. All in all, the   30% yield doesn't look very secure. Pass it by Income investors should probably avoid Washington Prime Group   today. There may be huge turnaround potential if the company can   \"grind it out,\" but it is definitely not the type of stock you   can own and safely collect the dividend. If something goes wrong   -- and there's a lot of opportunity for negative outcomes at   Washington Prime -- the REIT will have little choice but to cut   the dividend. Today, that 30% yield looks more like a yield trap   than a bargain.   10 stocks we like better than Washington Prime Group     Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Washington Prime Group     Inc. wasn't one of them! That's right -- they think these 10     stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Reuben Gregg Brewer      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "The retail sector is being hit by the so-called \"   retail apocalypse    ,\" as online sales gain ground and physical-store sales languish.   Real estate investment trust    (REIT)   Washington Prime Group    (NYSE: WPG) owns enclosed malls, which are facing the biggest   threat.",
    "Given the stock's 30% dividend yield, however, aggressive   investors with a value bent    might be tempted to take a stake. Here's what you need to know   before you do that.",
    "The retail apocalypse is having the biggest impact on enclosed   malls, which are largely what Washington Prime Group owns. It   directly controls around 91 properties, with partial interests   bringing its total mall exposure up to 108 assets. One of the   biggest issues the REIT faces, however, is the quality of the   malls it operates. The average sales per square foot at its malls   are around the $400 mark, while better-positioned competitors   have average rents between $650 and $850 per square foot.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Based on that information, it shouldn't be surprising that   Washington Prime's properties are located in less desirable   areas. For example, the average population density around its   properties is lower than for most of its competitors. The average   income in neighborhoods where it has assets is also toward the   low end. Basically, it owns malls in regions with relatively   sparse populations that are less affluent. That's not a great   combination, as the weak sales-per-square-foot metric highlights.   The malls Washington Prime operates are the ones being hit   hardest by online sales.",
    "To be fair, Washington Prime isn't exactly sitting around   hoping for better days: Management is hard at work trying to fill   vacancies and keep its malls attractive for tenants and   consumers. For example, like its peers, it's trying to reposition   anchor-tenant properties vacated by retailers like   Bon-Ton    and    Sears     , both of which have gone bankrupt. It's also holding events that   it hopes will bring customers to its malls.",
    "But with companies like   Ascena Retail Group still struggling    , there are still rough waters ahead for mall REITs. Washington   Prime's occupancy of 92.5% is troubling -- it fell 1.2 percentage   points year over year in the second quarter. The company's   occupancy numbers, like other key metrics, are toward the low end   of its peer group. And with the likelihood of further headwinds,   occupancy is likely to continue to fall before it stabilizes.   That's why Washington Prime's most recent quarterly presentation   ended with the tagline \"Grind It Out.\"",
    "While the company is working to reposition its assets, it's   also making some interesting financing moves. For example, in the   most recent quarter, management noted that it had sold 20   outparcel properties. These are usually land parcels close to   existing assets that either are raw land, or have a building that   isn't directly attached to the mall. Mall REITs often hold on to   these properties so they can expand. Selling one or two   outparcels wouldn't be a huge deal, but 20 suggests the company   is scrambling for cash.",
    "That's buttressed by the sale leaseback transactions the   company has entered into at four of its properties. Essentially,   it still operates each mall, but sold the underlying land to a   third party to raise cash. This is an interesting way to raise   money, but it's still a troubling move.",
    "To be fair, Washington Prime is being creative and taking   advantage of every opportunity it can. But these decisions are   clearly not coming from a position of strength, and thus should   worry investors.",
    "That brings up the dividend. At 30%, the dividend yield is   incredible -- but Wall Street is obviously expecting a dividend   cut. All the information above fuels that concern, but there's   another, more direct fear: Washington Prime paid out $0.25 per   share in dividends in the most recent quarter, and had   funds from operations    (FFO), the REIT equivalent o   f earnings    , of $0.27 per share. That doesn't leave much room for error:",
    "    WPG    data by   YCharts    .",
    "But there's more to this story than these numbers tell.",
    "During the   second-quarter conference call    , management noted that FFO was helped along by the outparcel   sales. So, coverage may not be as strong as management wants   investors to believe. When pressed by an analyst on the dividend,   management noted that \"We think we're pretty close to covering   the dividend in 2019.\"",
    "That statement is important, because FFO doesn't include   expenses like maintenance capital spending and the costs to   reposition vacant anchor tenants. The number that includes those   costs is   adjusted    funds from operations, which can provide a better picture of a   REIT's dividend-paying ability. \"Close to covering\" is a lot less   reassuring than what the FFO number suggests, and the company   isn't sharing its expectations for adjusted FFO. All in all, the   30% yield doesn't look very secure.",
    "Income investors should probably avoid Washington Prime Group   today. There may be huge turnaround potential if the company can   \"grind it out,\" but it is definitely not the type of stock you   can own and safely collect the dividend. If something goes wrong   -- and there's a lot of opportunity for negative outcomes at   Washington Prime -- the REIT will have little choice but to cut   the dividend. Today, that 30% yield looks more like a yield trap   than a bargain.",
    "  10 stocks we like better than Washington Prime Group     Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Washington Prime Group     Inc. wasn't one of them! That's right -- they think these 10     stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Washington Prime Group     Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Washington Prime Group     Inc. wasn't one of them! That's right -- they think these 10     stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Reuben Gregg Brewer      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 04:54:00"
}