{
  "url": "https://www.nasdaq.com/article/the-mlm-paradox-analysts-bullish-but-forecast-371-fall-cm1207065",
  "title": "The MLM Paradox: Analysts Bullish But Forecast -3.71% Fall - Nasdaq.com",
  "text": [
    "Analyst ratings can sometimes be complicated, and we here at ETF Channel  have noticed a bit of a paradox with Martin Marietta Materials, Inc. (Symbol: MLM). The average 12-month price target for MLM - averaging the work of 11 analysts - reveals an average price target of $251.36/share. That's a whopping -3.71% below  where MLM has been trading recently at $261.04/share. With this kind of downside potential (should MLM fall to that price target), one might expect to see a high concentration of \"hold\" or even \"sell\" ratings on the stock. Yet, take a look at the bullishness:       makeArticleAd();  The average rating presented in the last row of the table above is from 1 to 5, where 1 would be a consensus Strong Buy and 5 would be a consensus Strong Sell. In the middle, 3 would be a Hold. So anything below 3 leans toward Buy as the average analyst sentiment. The average rating of 1.45 for MLM leans strongly towards the bullish end of the spectrum, yet the MLM price target paints a different picture. Clearly, there is something more to the story here that is worth investigating for investors looking at Martin Marietta Materials, Inc. Of course, the average price target is just that - a mathematical average, and is only one metric. There are analysts with higher targets than the average, including one looking for a price of $290.00. And then on the other side of the spectrum one analyst has a target as low as $194.00. The standard deviation is $30.891.    But the whole reason to look at the average  in the first place is to tap into a \"wisdom of crowds\" effort, putting together the contributions of all the individual minds who contributed to the ultimate number, as opposed to what just one particular expert believes - much like with guessing the number of jelly beans in a jar, where the average  guess tends to be very close. And so with MLM trading so far above that average target price of $251.36/share, the -3.71% downside to that average target does seem to be a paradox against the bullish analyst ratings. Might analysts be behind the curve with their targets and upward adjustments are forthcoming? Or, is it time for some of these analysts to turn bearish and downgrade on valuation? One thing is for sure: this apparent paradox makes for a good \"signal\" to investors in MLM to spend fresh time assessing the company and deciding whether analysts have it right with their sentiment, or have it right with their price target for Martin Marietta Materials, Inc. This article used data provided by Zacks Investment Research via Quandl.com  . Get the latest Zacks research report on MLM - FREE  .   10 ETFs With Most Upside To Analyst Targets »  ",
    "  10 ETFs With Most Upside To Analyst Targets » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:25:53"
}