{
  "url": "https://www.nasdaq.com/article/4-fintech-alternatives-to-square-fiserv-with-big-dividends-cm1207570",
  "title": "4 Fintech Alternatives to Square & Fiserv with Big Dividends - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Every industry has its disruptors. The old and established leaders get comfortable doing things the same way - it has worked for decades, so why change? Sometimes disruptors come with new ideas and approaches. Other times they have new technologies that can range from an app to a completely new means of operating.",
    "One example that I use on a daily basis involves artificial intelligence (AI). I have a Bloomberg Terminal, which is a vital tool for pulling all sorts of data and information on any economy or market as well as any stock, bond or other security. It also comes with over 2,700 journalists around the globe that are generating news and other stories each and every day. But interestingly, Bloomberg has adopted AI which combs news releases and economic data releases. Then its army of robotic writers create an increasing percentage of its posted stories.",
    "There shouldn't be anything subjective in the robotic writing, but you never know how this will develop. By the way, I am not a robot.",
    "Banking is getting it worse. Financial technology (Fintech) companies continue to roll out non-bank payment, loan and deposit apps. These are increasingly making consumer banking with traditional banks less necessary, if not more costly. And even mortgages can be applied for or refinanced via apps.",
    "This has led many newer stocks to grab investor attention, including Square (NYSE: SQ ) with its alternative mobile payment and point-of-sale services. It many be gathering new adopters, with revenue up over the trailing year by 49%, but it has negative operating margins running at -1.1% which in turn is delivering a loss on shareholder equity of -4.7%.",
    "And dividends? Not with Square's cash burn. No wonder that in the trailing year, insiders have been reporting millions upon millions of shares sold, not bought. Bad indicator.",
    "Then there's Fiserv (NASDAQ: FISV ) stock, which provides behind-the-scenes services and systems to alt-financial fintech companies. This company is a bit more responsible, with operating margins running at 30.1% which in turn is helping the return on equity to reach a current 35.6%. But its sales are anemic, with gains over the trailing year of only 2.2%.",
    "And it doesn't have much cash on hand, putting it in credit jeopardy in the short term. And the stock is valued at 16.4 times its book value which is has actually dropped by 42.6% to a current value of $6.48 per share from where it stood back in 2017.",
    "Again, no wonder that over the trailing year, that there were 20 sellers in management and the board - again not a vote of confidence. And dividends? Not with the cash trouble and short-term credit woes. Instead, twice in the past 10 years, Fiserv has had to do two reverse 2 for 1 splits to keep the stock price up to avoid regulatory and market scrutiny.",
    "Fintech might be a good disrupter for beating traditional banks, but it's not so rewarding for investors - especially without dividend income.",
    "But what is really beating banks comes from three obscure bits of Congressional legislation: The Investment Companies Act of 1940, The Small Business Investment Incentive Act of 1980 and The Cigar Excise Tax Extension Act of 1960.",
    "The Investment Companies Act established holding companies and funds, which allowed companies to own financial assets beyond just plant and equipment like operating companies. The Small Business Investment Incentives Act provided companies beyond banks to lend and own loans and other financing instruments from public and private companies, which brought needed loans to a stifled banking market. And the Cigar Excise Tax Extension Act had embedded in it the legal and tax structure which enabled real estate investment trusts (REITs).",
    "Back in the late 1970's, inflation was out of control, driving interest rates to the moon and driving banks to be reticent about lending. So, the 1980 legislation allowed non-banks to operate as investment companies which could make loans and invest in loans. This began what is largely known as Business Development Companies (BDCs), which also do not have to pay traditional corporate income taxes.",
    "BDCs have been a very successful business model over the past many years. Banks have been strangled with low interest rates, which limit their net interest margins (NIM). This margin is the difference between what they pay in deposits against what they earn from loans. And regulations post 2007-2008 have stifled them with costly compliance. Even with relief over the past three years, much still needs to be done to unburden banks.",
    "Better than Banks: MVIS BDC Index Total Return Source MVIS & Bloomberg",
    "BDCs are outside much regulatory purviews and they don't do deposits. And lower interest rates enable them to fund themselves at lower rates through various non-banking means such as the bond and credit markets. And it shows in the performance of the MVIS BDC Index generating a return year to date of 21.53% including an average trailing tax-advantaged dividend yield of 9.72%.",
    "Moreover, BDCs also participate in the business loan market. And while there can be some shadows in this part of the credit market, the well-run and well-capitalized companies can participate in senior loans, which BDCs can participate in for their portfolio assets.",
    "Senior Loan Debt Index Source Palmer Square & Bloomberg",
    "Senior loans continue to perform well, even with some pullbacks. Such was the case with a drop in liquidity during the closing weeks of last year.",
    "In the model portfolios of my Profitable Investing , I have a great BDC in Hercules Capital (NYSE: HTGC ). Hercules is based in Palo Alto, California, with offices around the nation. It focuses on working with technology companies and has a good track record of financing startups through to become bold-faced names in the tech market. It makes loans and provides other financing and also takes equity participation in its portfolio companies. It then works with them like bankers used to do by guiding them along to an exit strategy of being bought or through an IPO.",
    "Net interest margin (NIM) is ample at 8.9% and the efficiency ratio is good at 52.5% (the lower the ratio, the greater the profitability). Revenues are up 8.8% for the trailing year and it feeds a nice annual dividend stream including regular special distributions yielding 10.1%.",
    "The Profitable Investing portfolio also has Main Street Capital (NYSE: MAIN ). This BDC focuses on more mundane small-to-middle-market companies with lending and other financing. It has wide financial margin and an efficiency ratio of an amazing 8.2%. and it pays an annual dividend, including regular special distributions, yielding 6.7%.",
    "Then there is my recommended TPG Specialty Lending (NYSE: TSLX ). This company provides financing and capital to a variety of companies, including loan assets in its portfolio. Part of the famous TPG Capital formally called Texas Pacific Group which is one of the largest and more successful private equity firms in the world - TPG Specialty draws great talent and resources from its affiliate.",
    "Revenues are up on a tear with the trailing year climbing by 24.2%. Its NIM is running at 10% and it keeps its efficiency ratio humming at a profitable 31.5%.",
    "TPG Specialty Lending (TSLX) Longer Term Total Return Source Bloomberg",
    "The company has generated a return of 87.8% over the trailing five years for an average annual equivalent of 13.4%.",
    "It pays regular dividends quarterly, providing a yield of 7.5%. But it also regularly pays additional dividends from ongoing profits throughout the year for a current annual yield of 8.8%.",
    "Banks used to be big in the mortgage business. That has been changing, particular post-2007-2008. Now others are in the market to originate and own mortgages. Inside my model portfolios of Profitable Investing , I have MFA Financial (NYSE: MFA ) which is structured as a REIT under the Cigar Excise legislation noted above. MFA owns and runs a mortgage portfolio which in turn fuels an ample dividend yielding 11%. And it has proven itself to work during times of adversary including doing pretty well in the midst of the 2007-2008 financial crisis.",
    "Over the past 10 years, MFA has delivered a return of 213.48% for an average annual equivalent of 12.09%. Buy it in a taxable account as 20% of its dividends qualify as deductible from income tax liabilities thanks to the Tax Cuts & Jobs Act of 2017, making the payout distributions even more attractive after taxes.",
    "And now that I've presented my alternative Alt-Financials for more dividends and price gains, perhaps you might like to see more of my market research and recommendations for further safer growth and bigger reliable income. For more - look at my Profitable Investing . Click here to learn more: https://profitableinvesting.investorplace.com/",
    "Neil George is the editor of Profitable Investing and does not have any holdings in the securities mentioned above.",
    "The post 4 Fintech Alternatives to Square & Fiserv with Big Dividends appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:01:53"
}