{
  "url": "https://www.nasdaq.com/article/why-tilray-conns-and-medicines-company-jumped-today-cm1206979",
  "title": "Why Tilray, Conn's, and Medicines Company Jumped Today - Nasdaq.com",
  "text": [
    " Tuesday was a bad day on Wall Street, as investors reacted   negatively to new tariffs that went into effect between the U.S.   and China. Many market participants had hoped that the two   parties would agree to some kind of temporary reprieve to avoid   the uptick in trade tensions, but it now appears that no   resolution is likely in the immediate future. Nevertheless, some   companies benefited from favorable business-specific factors that   boosted their shares.   Tilray    (NASDAQ: TLRY) ,   Conn's    (NASDAQ: CONN) , and   Medicines Company    (NASDAQ: MDCO) were among the top performers. Here's why they did   so well. Tilray gets a mixed review Shares of Tilray soared 17% despite comments from Wall Street   analysts that weren't entirely positive. Cowen cut its target   price on the stock by a whopping 60% to just $60, citing supply   constraints that have prevented the Canadian cannabis market from   growing as fast as Tilray and its peers had hoped. Yet even   though that's been a particularly big problem for Tilray, Cowen   still thinks that the   marijuana stock    will outperform the market. Moves into the U.S. hemp-derivatives   market could be a big growth driver, and the company is doing   well internationally. Even if it never returns to its glory days   of $300 stock prices, Tilray still has a lot of room to grow.   Image source: Tilray.makeArticleAd();  Conn's gets a rebound  Conn's saw its stock pick up 18%    following the release of its second-quarter financial results.   The electronics and furniture retailer said that retail sales   climbed more than 3% from year-ago levels, leading to 17% growth   in earnings per share. CEO Norm Miller was optimistic about   Conn's future, noting that the company has managed to post   same-store sales growth outside of markets that saw huge upward   impact in the year-earlier period due to customers recovering   from Hurricane Harvey. Conn's also said it anticipates entering   the Florida market, and that could be a big growth driver for the   retailer. Medicines Company has a good trial Finally, shares of Medicines Company gained 10%. The company   reported that its phase 3 trial of   cholesterol fighter incliran    met the study's primary and secondary endpoints, significantly   reducing reductions in LDL-C cholesterol over the course of about   a year and half. Incliran's safety profile was also favorable.   Medicines Company was happy to see that the treatment, which is   given just twice yearly, was effective and safe, and CEO Mark   Timney believes that incliran could \"address adherence challenges   in a way that no other currently used LDL-C lowering medicine   can.\" Stock analysts also liked the news, and investors hope the   shares will keep climbing as they approach levels not seen since   early 2017.   Offer from The Motley Fool: The 10 best stocks to buy     now            Motley Fool co-founders Tom and David Gardner have spent more     than a decade beating the market. In fact, the newsletter they     run,     Motley Fool Stock Advisor      , has quadrupled the S&P 500!* Tom and David just revealed their ten top stock picks for     investors to buy right now.  Click here to get access to the full       list!   *      Stock Advisor     returns as of June 1, 2019.     Dan Caplinger      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Tuesday was a bad day on Wall Street, as investors reacted   negatively to new tariffs that went into effect between the U.S.   and China. Many market participants had hoped that the two   parties would agree to some kind of temporary reprieve to avoid   the uptick in trade tensions, but it now appears that no   resolution is likely in the immediate future. Nevertheless, some   companies benefited from favorable business-specific factors that   boosted their shares.   Tilray    (NASDAQ: TLRY) ,   Conn's    (NASDAQ: CONN) , and   Medicines Company    (NASDAQ: MDCO) were among the top performers. Here's why they did   so well.",
    "Shares of Tilray soared 17% despite comments from Wall Street   analysts that weren't entirely positive. Cowen cut its target   price on the stock by a whopping 60% to just $60, citing supply   constraints that have prevented the Canadian cannabis market from   growing as fast as Tilray and its peers had hoped. Yet even   though that's been a particularly big problem for Tilray, Cowen   still thinks that the   marijuana stock    will outperform the market. Moves into the U.S. hemp-derivatives   market could be a big growth driver, and the company is doing   well internationally. Even if it never returns to its glory days   of $300 stock prices, Tilray still has a lot of room to grow.",
    "  Image source: Tilray.makeArticleAd(); ",
    "Image source: Tilray.",
    " Conn's saw its stock pick up 18%    following the release of its second-quarter financial results.   The electronics and furniture retailer said that retail sales   climbed more than 3% from year-ago levels, leading to 17% growth   in earnings per share. CEO Norm Miller was optimistic about   Conn's future, noting that the company has managed to post   same-store sales growth outside of markets that saw huge upward   impact in the year-earlier period due to customers recovering   from Hurricane Harvey. Conn's also said it anticipates entering   the Florida market, and that could be a big growth driver for the   retailer.",
    "Finally, shares of Medicines Company gained 10%. The company   reported that its phase 3 trial of   cholesterol fighter incliran    met the study's primary and secondary endpoints, significantly   reducing reductions in LDL-C cholesterol over the course of about   a year and half. Incliran's safety profile was also favorable.   Medicines Company was happy to see that the treatment, which is   given just twice yearly, was effective and safe, and CEO Mark   Timney believes that incliran could \"address adherence challenges   in a way that no other currently used LDL-C lowering medicine   can.\" Stock analysts also liked the news, and investors hope the   shares will keep climbing as they approach levels not seen since   early 2017.",
    "  Offer from The Motley Fool: The 10 best stocks to buy     now            Motley Fool co-founders Tom and David Gardner have spent more     than a decade beating the market. In fact, the newsletter they     run,     Motley Fool Stock Advisor      , has quadrupled the S&P 500!* Tom and David just revealed their ten top stock picks for     investors to buy right now.  Click here to get access to the full       list!   *      Stock Advisor     returns as of June 1, 2019.  ",
    " Offer from The Motley Fool: The 10 best stocks to buy     now            Motley Fool co-founders Tom and David Gardner have spent more     than a decade beating the market. In fact, the newsletter they     run,     Motley Fool Stock Advisor      , has quadrupled the S&P 500!*",
    "Tom and David just revealed their ten top stock picks for     investors to buy right now.",
    " Click here to get access to the full       list! ",
    " *      Stock Advisor     returns as of June 1, 2019. ",
    "  Dan Caplinger      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:31:00"
}