{
  "url": "https://www.nasdaq.com/article/pre-market-most-active-for-sep-3-2019-cdtx-ruhn-bt-tvix-ts-qqq-amd-snap-orcl-tqqq-hmy-san-cm1206503",
  "title": "Pre-Market Most Active for Sep 3, 2019 : CDTX, RUHN, BT, TVIX, TS, QQQ, AMD, SNAP, ORCL, TQQQ, HMY, SAN - Nasdaq.com",
  "text": [
    "The NASDAQ 100 Pre-Market Indicator  is down -27.02 to 7,663.98. The total Pre-Market volume is currently 6,310,461 shares traded.       The following are the  most active stocks for the pre-market session  :  makeArticleAd();    Cidara Therapeutics, Inc. ( CDTX  ) is +1.11 at $2.79, with 1,405,319 shares traded. As reported in the last short interest update the days to cover for CDTX is 17.233411; this calculation is based on the average trading volume of the stock.    Ruhnn Holding Limited ( RUHN  ) is unchanged at $4.51, with 1,094,281 shares traded.    BT Group plc ( BT  ) is -0.0656 at $9.93, with 935,100 shares traded. BT's current last sale is 64.93% of the target price of $15.3.    Credit Suisse AG ( TVIX  ) is +1.0799 at $19.00, with 715,683 shares traded. This represents a 49.61% increase from its 52 Week Low.    Tenaris S.A. ( TS  ) is -0.3 at $21.34, with 660,296 shares traded. As reported by Zacks, the current mean recommendation for TS is in the \"buy range\".    Invesco QQQ Trust, Series 1 ( QQQ  ) is -1.43 at $186.04, with 380,989 shares traded. This represents a 29.68% increase from its 52 Week Low.    Advanced Micro Devices, Inc. ( AMD  ) is -0.64 at $30.81, with 366,272 shares traded. AMD's current last sale is 84.41% of the target price of $36.5.    Snap Inc. ( SNAP  ) is +0.28 at $16.11, with 290,688 shares traded. SNAP's current last sale is 100.69% of the target price of $16.    Oracle Corporation ( ORCL  ) is unchanged at $52.06, with 289,289 shares traded. ORCL's current last sale is 92.96% of the target price of $56.    ProShares UltraPro QQQ ( TQQQ  ) is -1.37 at $59.12, with 222,240 shares traded. This represents a 94.99% increase from its 52 Week Low.    Harmony Gold Mining Company Limited ( HMY  ) is -0.03 at $3.68, with 127,295 shares traded. As reported by Zacks, the current mean recommendation for HMY is in the \"strong buy range\".    Banco Santander, S.A. ( SAN  ) is -0.07 at $3.68, with 111,501 shares traded. SAN's current last sale is 73.6% of the target price of $5.",
    "    The following are the  most active stocks for the pre-market session  :",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:23:55"
}