{
  "url": "https://www.nasdaq.com/article/how-to-childproof-your-retirement-cm1207566",
  "title": "How to Childproof Your Retirement - Nasdaq.com",
  "text": [
    " Having kids can enrich your life in many ways, but   unfortunately children don't generally make you financially   richer. In fact, many parents   compromise their own savings     and face more challenges supporting themselves during   retirement because of the financial demands children place upon   them. You want to help your children succeed, but doing so at the   expense of your own financial security can have disastrous   results. To make sure you don't find yourself running short of   savings because of money given to your children, take these key   steps to childproof your retirement.   Image source: Getty Images.makeArticleAd();  Put retirement savings ahead of paying for college According to a recent   Merrill Lynch    survey, close to 75% of parents put the needs of their children   ahead of   saving for retirement    . Parents often do this by paying for their children's college   tuition and other educational expenses when they can't really   afford to -- sometimes even taking out student loans in their own   name. Unfortunately, this is a really bad idea. There are student   loans available to your kids to cover the costs of college, but   you cannot take out loans to fund your retirement in your 70s and   80s when you need a place to live, food to eat, and money for   medications and other healthcare needs. While you may not want to   see your kids graduate with debt, you and your kids are likely to   be a whole lot less happy if you end up with no money late in   life and you wind up relying on them. Instead of giving them money for college that you can't   afford, try to ensure they have as much for college as   possible from other sources. Throughout their lives, for   example, you can ask grandparents or other relatives to   contribute to a 529 account instead of buying yet another   toy. Parents can also help kids make informed choices about the   debt they're taking on. Encourage your children to earn some   credits at a community college to graduate in less time, or help   them do a detailed analysis as to whether paying for a more   expensive private school is really worth the premium compared   with a similar state university. Teach your children financial independence from a young   age Merrill Lynch's survey also found that 72% of parents wish   they had someone to teach their children about investing. If you're hoping to childproof your retirement, do more than   just wish that your children had a mentor for important financial   concepts. Instead, you should be that mentor. Start teaching your children about saving and investing when   they're very young, giving age-appropriate lessons and   encouraging them to budget and save. If you help children to   develop financial independence throughout their entire life,   they're less likely to rely on you in your old age. Set limits on the financial support you'll provide Close to eight in 10 parents provide financial support to   adult children, Merrill Lynch's survey found. And not small   amounts of support, either. Parents provide on average $7,000 per   year in assistance, transferring as much as $500 billion per year   from the older to the younger generation. Offering your kids thousands of dollars is sure to hurt your   retirement security. With   Social Security benefits    averaging just   $1,461 per month as of 2019    , giving your kids $7,000 a year amounts to losing about 40% of   your benefit. To make sure you're not spending too much of your nest egg   helping out your adult offspring, figure out a   safe withdrawal limit    from your retirement accounts and make a budget. After your own   essential needs are met,   then    determine if you can give your kids money, and what amount. Let   them know in advance what the outer limits of your aid are, so   they don't expect more than you can afford. Offer help that doesn't require your money It can be hard to say no to your kids if they're struggling,   but compromising your financial security for theirs won't help   any of you in the end. Instead, if your children have money troubles, offer   non-financial help. This could include providing unpaid child   care for limited periods of time, letting them move back in to   save money, or helping them make a budget. This type of   assistance can be worth as much as money to many young people,   and it won't drain your investment accounts too quickly. Don't let your adult children interfere with your financial   security Preparing your kids to stand on their own two feet will help   them become fully independent adults, and it will help you to   have a more secure retirement. Start talking to your kids now about financial independence   and responsible spending -- regardless of their ages -- and set   age-appropriate limits ASAP on the amount of financial aid you   offer. If your retirement is more secure because you helped make   sure your children don't depend upon you into your golden years,   all of you will be better off.   The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .   The Motley Fool has a     disclosure policy      .  ",
    "Having kids can enrich your life in many ways, but   unfortunately children don't generally make you financially   richer. In fact, many parents   compromise their own savings     and face more challenges supporting themselves during   retirement because of the financial demands children place upon   them.",
    "You want to help your children succeed, but doing so at the   expense of your own financial security can have disastrous   results. To make sure you don't find yourself running short of   savings because of money given to your children, take these key   steps to childproof your retirement.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "According to a recent   Merrill Lynch    survey, close to 75% of parents put the needs of their children   ahead of   saving for retirement    . Parents often do this by paying for their children's college   tuition and other educational expenses when they can't really   afford to -- sometimes even taking out student loans in their own   name.",
    "Unfortunately, this is a really bad idea. There are student   loans available to your kids to cover the costs of college, but   you cannot take out loans to fund your retirement in your 70s and   80s when you need a place to live, food to eat, and money for   medications and other healthcare needs. While you may not want to   see your kids graduate with debt, you and your kids are likely to   be a whole lot less happy if you end up with no money late in   life and you wind up relying on them.",
    "Instead of giving them money for college that you can't   afford, try to ensure they have as much for college as   possible from other sources. Throughout their lives, for   example, you can ask grandparents or other relatives to   contribute to a 529 account instead of buying yet another   toy.",
    "Parents can also help kids make informed choices about the   debt they're taking on. Encourage your children to earn some   credits at a community college to graduate in less time, or help   them do a detailed analysis as to whether paying for a more   expensive private school is really worth the premium compared   with a similar state university.",
    "Merrill Lynch's survey also found that 72% of parents wish   they had someone to teach their children about investing.",
    "If you're hoping to childproof your retirement, do more than   just wish that your children had a mentor for important financial   concepts. Instead, you should be that mentor.",
    "Start teaching your children about saving and investing when   they're very young, giving age-appropriate lessons and   encouraging them to budget and save. If you help children to   develop financial independence throughout their entire life,   they're less likely to rely on you in your old age.",
    "Close to eight in 10 parents provide financial support to   adult children, Merrill Lynch's survey found. And not small   amounts of support, either. Parents provide on average $7,000 per   year in assistance, transferring as much as $500 billion per year   from the older to the younger generation.",
    "Offering your kids thousands of dollars is sure to hurt your   retirement security. With   Social Security benefits    averaging just   $1,461 per month as of 2019    , giving your kids $7,000 a year amounts to losing about 40% of   your benefit.",
    "To make sure you're not spending too much of your nest egg   helping out your adult offspring, figure out a   safe withdrawal limit    from your retirement accounts and make a budget. After your own   essential needs are met,   then    determine if you can give your kids money, and what amount. Let   them know in advance what the outer limits of your aid are, so   they don't expect more than you can afford.",
    "It can be hard to say no to your kids if they're struggling,   but compromising your financial security for theirs won't help   any of you in the end.",
    "Instead, if your children have money troubles, offer   non-financial help. This could include providing unpaid child   care for limited periods of time, letting them move back in to   save money, or helping them make a budget. This type of   assistance can be worth as much as money to many young people,   and it won't drain your investment accounts too quickly.",
    "Preparing your kids to stand on their own two feet will help   them become fully independent adults, and it will help you to   have a more secure retirement.",
    "Start talking to your kids now about financial independence   and responsible spending -- regardless of their ages -- and set   age-appropriate limits ASAP on the amount of financial aid you   offer. If your retirement is more secure because you helped make   sure your children don't depend upon you into your golden years,   all of you will be better off.",
    "  The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      . ",
    " The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .",
    " The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:30:00"
}