{
  "url": "https://www.nasdaq.com/article/trade-hopes-lift-stocks-bond-yields-up-ahead-of-ecb-20190911-00674",
  "title": "Trade hopes lift stocks, bond yields up ahead of ECB - Nasdaq.com",
  "text": [
    "By Chuck Mikolajczak",
    "NEW YORK, Sept 11 (Reuters) - A gauge of global equity markets climbed on Wednesday, amid small signs of progress in the trade war between the United States and China, while bond yields rose as investors remained unsure what stimulus measures the European Central Bank will provide at its Thursday meeting.",
    "Stocks on Wall Street rose, buoyed by optimism on the trade front after China announced its first batch of tariff exemptions for 16 types of U.S. products, days ahead of a planned meeting between trade negotiators. ",
    "\"My own view is we shouldn't read too much into it because it is something of long shot we are going to get any meaningful breakthrough on that situation any time soon.\"",
    "The Dow Jones Industrial Average  rose 139.9 points, or 0.52%, to 27,049.33, the S&P 500  gained 13.48 points, or 0.45%, to 2,992.87 and the Nasdaq Composite  added 63.65 points, or 0.79%, to 8,147.80.",
    "The trade hopes also aided in pushing European shares to close at a six-week high, with shares of London Stock Exchange ending the session up 5.9% after Hong Kong Exchanges and Clearing  made a surprise $39 billion takeover approach. ",
    "The pan-European STOXX 600 index  rose 0.85% and MSCI's gauge of stocks across the globe  gained 0.56%, on pace for its sixth straight day of gains.",
    "U.S. Treasury yields rose for a third day, tracking those in the euro zone bond market, as investors were unsure about the stimulus measures the ECB will engage in, with a late report on Tuesday the central bank may delay quantitative easing adding to the uncertainty. ",
    "The 10-year yield hit a high of 1.752%, its highest level in just over a month.",
    "Benchmark 10-year notes  last fell 10/32 in price to yield 1.7368%, from 1.702% late on Tuesday.",
    "The European Central Bank's meeting comes ahead of next week's policy meeting by the U.S. Federal Reserve which is still widely expected to cut interest rates even as economic data showed producer prices unexpectedly rose in August. ",
    "Expectations for a 25-basis-point cut by the Fed at its next meeting stand at 88.8%, according to CME's FedWatch, down from 92.3% on Tuesday. Market participants currently see no chance of a 50-basis-point cut from the central bank.",
    "U.S. President Donald Trump pushed the Fed to cut interest rates to zero or into negative territory in a pair of Twitter posts on Wednesday. ",
    "In currencies, the euro weakened to a one-week low against the dollar ahead of the ECB meeting, while the dollar was on track for its best day in nearly two weeks against a basket of major currencies. ",
    "The dollar index  rose 0.33%, with the euro  down 0.34% to $1.1006.",
    "Oil prices slumped more than 2% after a report that Trump weighed easing sanctions on Iran, which could boost global crude supply. ",
    "U.S. crude  fell 2.56% to $55.93 per barrel and Brent  was last at $60.94, down 2.31% on the day.",
    "\nGRAPHIC: Global assets in 2019",
    "GRAPHIC: Global currencies vs. dollar",
    "\nGRAPHIC: MSCI All Country Wolrd Index Market Cap"
  ],
  "published_datetime": "2019-09-11 02:33:00"
}