{
  "url": "https://www.nasdaq.com/article/michaels-mik-beats-q2-earnings-and-revenue-estimates-cm1207063",
  "title": "Michaels (MIK) Beats Q2 Earnings and Revenue Estimates - Nasdaq.com",
  "text": [
    " Michaels (MIK) came out with quarterly earnings of $0.19 per share, beating the Zacks Consensus Estimate of $0.14 per share. This compares to earnings of $0.15 per share a year ago. These figures are adjusted for non-recurring items. This quarterly report represents an earnings surprise of 35.71%. A quarter ago, it was expected that this arts and crafts store operator would pos t earnings  of $0.31 per share when it actually produced earnings of $0.31, delivering no surprise. Over the last four quarters, the company has surpassed consensus EPS estimates three times. Michaels, which belongs to the Zacks Retail - Miscellaneous industry, posted revenues of $1.03 billion for the quarter ended July 2019, surpassing the Zacks Consensus Estimate by 1.98%. This compares to year-ago revenues of $1.05 billion. The company has topped consensus revenue estimates three times over the last four quarters. The sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the   earnings call  . Michaels shares have lost about 58.6% since the beginning of the year versus the S&P 500's gain of 15.9%.  What's Next for Michaels?  While Michaels has underperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock? There are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately. Empirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power o f earnings  estimate revisions. Ahead of this earnings release, the estimate revisions trend for Michaels was mixed. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #3 (Hold) for the stock. So, the shares are expected to perform in line with the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  . It will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $0.46 on $1.24 billion in revenues for the coming quarter and $2.34 on $5.17 billion in revenues for the current fiscal year. Investors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Retail - Miscellaneous is currently in the top 21% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  The Michaels Companies, Inc. (MIK): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Michaels (MIK) came out with quarterly earnings of $0.19 per share, beating the Zacks Consensus Estimate of $0.14 per share. This compares to earnings of $0.15 per share a year ago. These figures are adjusted for non-recurring items.",
    "This quarterly report represents an earnings surprise of 35.71%. A quarter ago, it was expected that this arts and crafts store operator would pos t earnings  of $0.31 per share when it actually produced earnings of $0.31, delivering no surprise.",
    "Over the last four quarters, the company has surpassed consensus EPS estimates three times.",
    "Michaels, which belongs to the Zacks Retail - Miscellaneous industry, posted revenues of $1.03 billion for the quarter ended July 2019, surpassing the Zacks Consensus Estimate by 1.98%. This compares to year-ago revenues of $1.05 billion. The company has topped consensus revenue estimates three times over the last four quarters.",
    "The sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the   earnings call  .",
    "Michaels shares have lost about 58.6% since the beginning of the year versus the S&P 500's gain of 15.9%.",
    " What's Next for Michaels? ",
    "While Michaels has underperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?",
    "There are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.",
    "Empirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power o f earnings  estimate revisions.",
    "Ahead of this earnings release, the estimate revisions trend for Michaels was mixed. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #3 (Hold) for the stock. So, the shares are expected to perform in line with the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .",
    "It will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $0.46 on $1.24 billion in revenues for the coming quarter and $2.34 on $5.17 billion in revenues for the current fiscal year.",
    "Investors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Retail - Miscellaneous is currently in the top 21% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:25:03"
}