{
  "url": "https://www.nasdaq.com/article/why-ulta-beauty-shares-got-hit-with-the-ugly-stick-cm1207921",
  "title": "Why Ulta Beauty Shares Got Hit With the Ugly Stick - Nasdaq.com",
  "text": [
    "Despite the ongoing e-commerce revolution, some traditional retail chains have been thriving. Case in point: Ulta Beauty (NASDAQ: ULTA) , which is a powerhouse in its niche, and which has an enviable history of same-store sales growth. The second-quarter results it delivered late last week were in character for the chain, and it essentially met expectations. Yet investors punished the stock to the tune of a 30% price drop Friday, and the clear cause was management's sharp 7.5% earnings guidance cut.",
    "In this segment from MarketFoolery , host Chris Hill and senior analyst Jason Moser discuss the investment thesis for Ulta Beauty, why its shares had been valued at such a premium prior to their recent tumble, and the underlying reasons behind management's significantly weaker outlook for the remainder of 2019.",
    "To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center . To get started investing, check out our quick-start guide to investing in stocks . A full transcript follows the video.",
    "10 stocks we like better than Ulta Beauty\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Ulta Beauty wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "This video was recorded on Sept. 3, 2019.",
    "Chris Hill: Let's start with something that happened last Friday, though. We got a bunch of emails and tweets about this. This is Ulta Salon. On Friday, the stock fell 28%. The second-quarter results looked good. They cut guidance for the full fiscal year. I'm wondering, was it that bad? Or was the stock just that expensive? Or was it something else entirely?",
    "Jason Moser: I think a fair combination of the two, probably, is the best answer there. I'm glad you mentioned that the quarter itself was good, because it was a good quarter. I mean, I guess technically, they missed expectations by a tiny bit. But who cares about that, really? You're talking about sales up 12%. Comps up 6.2%. Earnings per share grew 12.2%. It was a good quarter. Really, it was the guidance that I think freaked the market out. For the most part, you can't guide back the way they did and expect the market to not react. They took earnings per share guidance back significantly. And when I say significantly, it was in a range between $12.83 cents to $13.03, and they pulled that all the way back to a range of $11.86 cents to $12.06. Pretty significant guide back there. And the stock was not cheap by conventional metrics. I mean, it was trading at around 40 times earnings before this happened. Now, there's a reason why it trades at 40 times earnings, or, it did. It had been performing so well up to this point. Now, you've got the stock trading at around 20 times full-year estimates, the revisions. It certainly looks a bit more interesting now that it did last week.",
    "Hill: I want to go back to the same-store sales for a second. As you said, they're north of 6%. For all of the retailers we've been talking about over the last month or so on this show and on Motley Fool Money , a lot of them would kill to have same-store sales in north of 6%. But that was the thing that struck me in the guidance. It was not just the revenue number -- was it revenue or earnings that they ratcheted back by $1 a share?",
    "Moser: It was earnings.",
    "Hill: Earnings. It wasn't just that, it was the fact that they lowered full-year same-store sales from 6% to 4%, which means, having just put up more than 6% -- and we're halfway through the fiscal year, so, clearly, they're warning Wall Street, \"The next couple of comp numbers that you see are going to be,\" I mean, I don't think they'll be negative. That would be probably pretty shocking, if they were just flat-out negative. But certainly, they're probably going to be somewhere in the neighborhood of 2% to 3%.",
    "Moser: More than likely, I think. I feel like this is a misstep on management's part. I don't want to throw CEO Mary Dillon under the bus because I'm sure this wasn't solely her fault. But the fact is, they did a poor job of managing expectations here. That is such a significant guide down now.",
    "I do think the good news out of all this, it really does appear that it is less a business thing and more of a general market thing. In other words, it's not an Ulta-specific problem as much as it is a problem with headwinds in the cosmetics space writ large. We're talking about all sorts of companies that are having trouble in the cosmetics space right now. Cosmetics represents about 50% of Ulta's overall business, so it matters. Now, what is the cause of the headwinds in the space? She seems to believe it is more about hitting a lull in innovation and newness of products. There's this lull right now in innovation in the space. They've done a lot in a short period of time since she took over, and the space now has hit a lull. But when we talk about this space, investors need to remember, this is a big market opportunity. It is a global market opportunity. All-in, you're talking about, the U.S. beauty products and salon services industry represents about $145 billion in sales according to IBISWorld and Euromonitor. One hundred and forty-five billion dollars, and you break that down in all of these different markets, whether it's cosmetics or salon or whatever. That's the nice part about Ulta's business -- it's diversified away from just cosmetics. It is more things. Granted, cosmetics is a big part of the business. With all of that said, there are reasons to believe that they will be able to recover from this. This is one of the leaders in the space. When we talk about innovating, this is a company that is leading the way when it comes to innovation. So, I don't think this is something where investors need to be concerned that we have a business that's falling off a cliff or getting ready to get Amazon -ed, as much as it is a company just in a market right now that's seeing some headwinds.",
    "Hill: Last Thursday, the stock was at $337 a share. Right now, it's at $233. [laughs] Do you buy at this price?",
    "Moser: Listen, I'll be very clear. This is a recommendation in our augmented reality service. I like this business a lot. I don't know probably as much about makeup as I should, but I've learned a lot in the process of researching the business. And I do live in a house full of women, so that helps. I get at least some insight as to what's going on in the space. One thing I do see with companies like this, and we're seeing it more and more, is that partnerships matter a lot. Partnerships with well-known people, celebrities. For example, you see this relationship that they formed with Kim Kardashian West, and this KKW Beauty by Kim Kardashian is coming to Ulta in the back half of the year. That's a relationship that I think stands to help the company out. We talked a little while back about Amazon and how they formed a relationship with Lady Gaga as they make their foray into this space. You look at how important this Kim Kardashian thing could be, I mean, she's got 147 million Instagram followers. One hundred and forty-seven million. That's staggering. Lady Gaga? Thirty-seven million. Now, I don't use Instagram. I just researched those numbers this morning. But to me, that's 147 vs. 37, man. That's a big difference, OK?",
    "When you form relationships with people that have that kind of reach, I think those types of relationships help businesses like Ulta on the innovation side, for sure. And, you can market to the entire world, because so many people care about what these celebrities are using, products that they're using. Again, I think, personally, this is an opportunity to buy a good business at a sale price. It may not get back to that 40 times multiple anytime soon, but this is not a retailer that's getting Amazon-ed. It's not a bad business. It's a good business that's in a bit of tough stretch. They made a misstep on the guidance part of it, but I think that opens a window for investors.",
    "Hill: That was one of the things I was thinking. Every once in a while, we'll talk about a company that, four to six weeks before their quarterly results are due to be made public, they will come out and issue some sort of guide down, and we'll see a stock drop 10% or something like this. That kind of warning. This is a nice reminder of, this is the kind of thing that can happen if you don't do that. Because every once in a while, someone will be like, \"Why did they guide down? They have a little time to turn it around.\" It's like, because, if they don't, and it doesn't turn around, then this kind of thing happens.",
    "Moser: Yeah. I hate the expectations thing. I just prefer companies not even play that game if you don't have to. But I understand some are going to because they more or less have to, or feel like they have to. This was clearly a mismanaged number on their part. But, the flip side to that is, sometimes it can benefit investors in the form of opportunities. It's all about recognizing bad businesses vs. good businesses in a tough time. I think in Ulta's case, it's clearly the latter there. They'll recover from this, I think, no problem.",
    "John Mackey, CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Chris Hill owns shares of AMZN. Jason Moser owns shares of AMZN. The Motley Fool owns shares of and recommends AMZN. The Motley Fool recommends Ulta Beauty. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:19:43"
}