{
  "url": "https://www.nasdaq.com/article/canada-appoints-business-consultant-as-new-envoy-to-china-20190904-00919",
  "title": "Canada appoints business consultant as new envoy to China - Nasdaq.com",
  "text": [
    "By David Ljunggren",
    "OTTAWA, Sept 4 (Reuters) - Canada has appointed veteran business consultant Dominic Barton as ambassador to China, where he will try to address a major diplomatic and trade dispute, a government official said on Wednesday.",
    "Barton, a Ugandan-born Canadian who stepped down as global managing partner of consulting firm McKinsey & Co last year, has extensive experience in China and is close to the Liberal government of Prime Minister Justin Trudeau.",
    "Beijing, which insists Canada return Huawei Chief Financial Officer Meng Wanzhou, has blocked imports of Canadian canola seed and meat products. It has also charged two Canadian men with spying.",
    "\"There are few Canadians who have as extensive a network ... in Canada-China relations,\" said the government official, who requested anonymity given the sensitivity of the situation. \"He is extremely well prepared to advance Canadian interests there.\"",
    "The news indicates that the two governments are still talking despite months of fraught ties.",
    "\"This is the outcome of a months-long diplomatic process,\"  the official said.",
    "Last month, Canadian Foreign Minister Chrystia Freeland said she met her Chinese counterpart to discuss tensions \"and \"committed to continued discussions.\" ",
    "The dispute could become an issue in a federal election set for Oct 21. The Liberals face a tough fight against the Conservatives of Andrew Scheer, who complain Trudeau has not been tough enough on Beijing.",
    "For the past few months, Barton had been talking to his network in China about issues such as trade and the detained Canadians, the government official said.",
    "Barton also helped set up meetings with Chinese officials on the sidelines of a recent Group of 20 meeting. ",
    "In 2016, the Canadian government appointed Barton as head of an advisory council on economic growth."
  ],
  "published_datetime": "2019-09-04 01:31:00"
}