{
  "url": "https://www.nasdaq.com/article/electrocore-inc-ecor-shares-march-higher-can-it-continue-cm1207310",
  "title": "electroCore, Inc. (ECOR) Shares March Higher, Can It Continue? - Nasdaq.com",
  "text": [
    " As of late, it has definitely been a great time to be an investor in electroCore, Inc. ECOR  . The stock has moved higher by 51.6% in the past month, while it is also above its 20 Day SMA too. This combination of strong price performance and favorable technical, could suggest that the stock may be on the right path. We certainly think that this might be the case, particularly if you consider ECOR's recen t earnings  estimate revision activity. From this look, the company's future is quite favorable; as ECOR has earned itself a Zacks Rank #2 (Buy), meaning that its recent run may continue for a bit longer, and that this isn't the top for the in-focus company. You can see  the complete list of today's Zacks #1 Rank stocks   here  .   Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  electroCore, Inc. (ECOR): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "As of late, it has definitely been a great time to be an investor in electroCore, Inc. ECOR  . The stock has moved higher by 51.6% in the past month, while it is also above its 20 Day SMA too. This combination of strong price performance and favorable technical, could suggest that the stock may be on the right path.",
    "We certainly think that this might be the case, particularly if you consider ECOR's recen t earnings  estimate revision activity. From this look, the company's future is quite favorable; as ECOR has earned itself a Zacks Rank #2 (Buy), meaning that its recent run may continue for a bit longer, and that this isn't the top for the in-focus company. You can see  the complete list of today's Zacks #1 Rank stocks   here  . ",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:56:00"
}