{
  "url": "https://www.nasdaq.com/article/gold-slips-as-chinaus-trade-talk-hopes-lift-risk-appetite-20190905-00004",
  "title": "Gold slips as China-U.S. trade talk hopes lift risk appetite - Nasdaq.com",
  "text": [
    "By Karthika Suresh Namboothiri",
    "Sept 5 (Reuters) - Gold prices dropped on Thursday as risk-on sentiment got a boost after China and the United States agreed to hold talks to end their protracted trade dispute.",
    "Spot gold  fell 0.5% to $1,545.37 per ounce as of 0327 GMT, set to snap a three-day gaining streak. Prices touched $1,557 on Wednesday, their highest since April 2013.",
    "China'sCommerce Ministry said its trade team will hold talks with U.S. counterparts in mid-September in preparation for high-level negotiations in early October. ",
    "Gold has jumped about 23% this year as the bruising trade war between the world's two largest economies has sparked fears of a global economic slowdown and led to monetary easing by major central banks around the world.",
    "The news is \"driving everything at the moment\", said OANDA analyst Jeffrey Halley.",
    "\"Gold will remain under pressure, because trade tensions have been the elephant in the room. Any sign there is a thawing in that situation is going to see a rotation out of gold and into growth-orientated assets.\"",
    "Also encouraging risk sentiment was the withdrawal of an extradition bill that had triggered months of often violent protests in Hong Kong and an easing of Brexit- related uncertainties. ",
    "Bullion is seen as a safe-haven during times of political and economic uncertainty.",
    "MSCI's broadest index of Asia-Pacific shares outside Japan  was up 0.24%. U.S. Treasury yields extended gains in Asia and the yield curve steepened, signs that investors were willing to take on riskier assets. MKTS/GLOBUS/",
    "\"Gold is facing technical resistance at $1,560, and a break at that opens the door to $1,600 an ounce, probably not something we are going to see that this week,\" said Halley adding that gold has strong technical support at $1,520.",
    "Among other precious metals, silver  eased 0.8% to $19.41 per ounce, but was near a three-year high of $19.64 it touched in the previous session.",
    "Platinum  rose 0.5% to $990.37, marking its highest since Feb. 2018, while palladium  rose 0.4% to $1,558.26 per ounce."
  ],
  "published_datetime": "2019-09-05 12:03:00"
}