{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-agco-alphabet-kla-and-microsoft-cm1206605",
  "title": "The Zacks Analyst Blog Highlights: AGCO, Alphabet, KLA and Microsoft - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 3, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: AGCO Corp. AGCO  , Alphabet Inc. GOOGL  , KLA Corp. KLAC  and Microsoft Corp. MSFT  .  Here are highlights from Friday's Analyst Blog:    4 Best Stocks to Buy as Trade Tensions Abate   U.S. stocks posted strong gains in the last couple of trading sessions, mostly because China indicated that it won't react to the recent U.S. tariffs immediately. Ministry of Commerce spokesman Gao Feng confirmed that it is time to discuss measures to remove tariffs to prevent an escalation in the trade war. Lest we forget, troubles began after China announced plans of imposing new tariffs of 5% to 10% on nearly $75 billion of U.S. products. Beijing clarified that the move in reaction to the Trump administration's intention to impose 10% tariffs on $300 billion of Chinese imports. Trump, in the meantime, acted in response to China's decision by saying that the United States will increase tariffs on $250 billion of Chinese goods to 30% from an earlier 25%. And tariffs on additional $300 billion imports from China would go up to 15% from 10%. Nonetheless, a possible indication of a truce between two of the world's largest economies has alleviated risks in the equity market for now. A full-blown trade war would have had rippling effects on the global economy growth, casting a pall over businesses. Let us now look at stocks that have benefitted from the easing trade tensions:  Potential Winners as China Tamps Down Trade War   Escalation  As mentioned earlier, progress in trade talks has helped the Dow components, especially Boeing. After all, the aerospace giant sells about a fourth of its commercial aircraft to Chinese customers. And how can we forget that China had threatened to impose tariffs on several American products, including airplanes if there is no trade truce. Such a move could easily affect Boeing's 737-800, 737-700 and 737-900 ER models. But, with tariff scares behind us for now, Boeing has ample reasons to rejoice. Within the Dow, Intel in particular is expected to gain immensely. This is because Intel more or less generates bulk of its revenues from China, and it's more than what the semiconductor company makes in the United States. China, in fact, relies heavily on U.S. chipmakers, while semiconductors make up one of its largest import categories in terms of value. Hopes of abatement in U.S.-China trade tensions provided strength to the chip sector. To top it, China's latest plan to spur economic growth will surely boost semiconductor stocks, especially those in the region, in the near term as well. China is expecting to roll out a plan to improve disposable income this year. The broader tech sector has also a lot to gain from reduced trade war fears. The components of the SPDR Technology Select Sector had seen significant amount of revenues coming from China in recent years. In fact, China is in the second place in terms of revenue generation, behind the United States.  4 Top Picks  As trade war worries dissipate and broader markets move north, investing in stocks from the aforesaid sectors which are making the most of the recovery seems judicious. We have, thus, selected four stocks that can make the most of the encouraging trend. These stocks also flaunt a Zacks Rank #1 (Strong Buy) or 2 (Buy).  AGCO Corp.  manufactures and distributes agricultural equipment and related replacement parts worldwide. The company currently has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has increased 2.2% in the last 60 days. The company's expected earnings growth rate for the current year is 29.6% against the Manufacturing - Farm Equipment  industry's projected decline of 7.4%.  Alphabet Inc.  provides online advertising services worldwide. The company currently has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has increased 7.8% in the last 60 days. The company's expected earnings growth rate for the current year is 14.3%, compared with the Internet - Services  industry's projected rally of 5.8%.  KLA Corp.  designs, manufactures, and markets process control and yield management solutions for the semiconductor and related nanoelectronics industries worldwide. The company currently has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has increased 3.6% in the last 60 days. The company's expected earnings growth rate for the current year is 11.4%, compared with the Electronics - Miscellaneous Products  industry's estimated rally of 0.2%. You can see the complete list of today's Zacks #1 Rank stocks here  .  Microsoft Corp.  develops, licenses, and supports software, services, devices, and solutions worldwide. The company currently has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has increased 2.4% in the last 60 days. The company's expected earnings growth rate for the current year is 9.9%, compared with the Computer - Software  industry's projected rally of 1.1%. In fact, shares of AGCO, Alphabet, KLA and Microsoft have gained 23.1%, 14.3%, 63.6% and 36% respectively, so far this year.  Today's Best Stocks from Zacks  Would you like to see the updated picks from our best market-beating strategies? From 2017 through 2018, while the S&P 500 gained +15.8%, five of our screens returned +38.0%, +61.3%, +61.6%, +68.1%, and +98.3%. This outperformance has not just been a recent phenomenon. From 2000 - 2018, while the S&P averaged +4.8% per year, our top strategies averaged up to +56.2% per year.  See their latest picks free >>  Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Alphabet Inc. (GOOGL): Free Stock Analysis Report   Microsoft Corporation (MSFT): Free Stock Analysis Report   AGCO Corporation (AGCO): Free Stock Analysis Report   KLA-Tencor Corporation (KLAC): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 3, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: AGCO Corp. AGCO  , Alphabet Inc. GOOGL  , KLA Corp. KLAC  and Microsoft Corp. MSFT  .",
    " Here are highlights from Friday's Analyst Blog: ",
    "  4 Best Stocks to Buy as Trade Tensions Abate  ",
    "U.S. stocks posted strong gains in the last couple of trading sessions, mostly because China indicated that it won't react to the recent U.S. tariffs immediately. Ministry of Commerce spokesman Gao Feng confirmed that it is time to discuss measures to remove tariffs to prevent an escalation in the trade war.",
    "Lest we forget, troubles began after China announced plans of imposing new tariffs of 5% to 10% on nearly $75 billion of U.S. products. Beijing clarified that the move in reaction to the Trump administration's intention to impose 10% tariffs on $300 billion of Chinese imports.",
    "Trump, in the meantime, acted in response to China's decision by saying that the United States will increase tariffs on $250 billion of Chinese goods to 30% from an earlier 25%. And tariffs on additional $300 billion imports from China would go up to 15% from 10%.",
    "Nonetheless, a possible indication of a truce between two of the world's largest economies has alleviated risks in the equity market for now. A full-blown trade war would have had rippling effects on the global economy growth, casting a pall over businesses. Let us now look at stocks that have benefitted from the easing trade tensions:",
    " Potential Winners as China Tamps Down Trade War   Escalation ",
    "As mentioned earlier, progress in trade talks has helped the Dow components, especially Boeing. After all, the aerospace giant sells about a fourth of its commercial aircraft to Chinese customers.",
    "And how can we forget that China had threatened to impose tariffs on several American products, including airplanes if there is no trade truce. Such a move could easily affect Boeing's 737-800, 737-700 and 737-900 ER models. But, with tariff scares behind us for now, Boeing has ample reasons to rejoice.",
    "Within the Dow, Intel in particular is expected to gain immensely. This is because Intel more or less generates bulk of its revenues from China, and it's more than what the semiconductor company makes in the United States.",
    "China, in fact, relies heavily on U.S. chipmakers, while semiconductors make up one of its largest import categories in terms of value. Hopes of abatement in U.S.-China trade tensions provided strength to the chip sector. To top it, China's latest plan to spur economic growth will surely boost semiconductor stocks, especially those in the region, in the near term as well. China is expecting to roll out a plan to improve disposable income this year.",
    "The broader tech sector has also a lot to gain from reduced trade war fears. The components of the SPDR Technology Select Sector had seen significant amount of revenues coming from China in recent years. In fact, China is in the second place in terms of revenue generation, behind the United States.",
    " 4 Top Picks ",
    "As trade war worries dissipate and broader markets move north, investing in stocks from the aforesaid sectors which are making the most of the recovery seems judicious. We have, thus, selected four stocks that can make the most of the encouraging trend. These stocks also flaunt a Zacks Rank #1 (Strong Buy) or 2 (Buy).",
    " AGCO Corp.  manufactures and distributes agricultural equipment and related replacement parts worldwide. The company currently has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has increased 2.2% in the last 60 days. The company's expected earnings growth rate for the current year is 29.6% against the Manufacturing - Farm Equipment  industry's projected decline of 7.4%.",
    " Alphabet Inc.  provides online advertising services worldwide. The company currently has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has increased 7.8% in the last 60 days. The company's expected earnings growth rate for the current year is 14.3%, compared with the Internet - Services  industry's projected rally of 5.8%.",
    " KLA Corp.  designs, manufactures, and markets process control and yield management solutions for the semiconductor and related nanoelectronics industries worldwide. The company currently has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has increased 3.6% in the last 60 days. The company's expected earnings growth rate for the current year is 11.4%, compared with the Electronics - Miscellaneous Products  industry's estimated rally of 0.2%. You can see the complete list of today's Zacks #1 Rank stocks here  .",
    " Microsoft Corp.  develops, licenses, and supports software, services, devices, and solutions worldwide. The company currently has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has increased 2.4% in the last 60 days. The company's expected earnings growth rate for the current year is 9.9%, compared with the Computer - Software  industry's projected rally of 1.1%.",
    "In fact, shares of AGCO, Alphabet, KLA and Microsoft have gained 23.1%, 14.3%, 63.6% and 36% respectively, so far this year.",
    " Today's Best Stocks from Zacks ",
    "Would you like to see the updated picks from our best market-beating strategies? From 2017 through 2018, while the S&P 500 gained +15.8%, five of our screens returned +38.0%, +61.3%, +61.6%, +68.1%, and +98.3%.",
    "This outperformance has not just been a recent phenomenon. From 2000 - 2018, while the S&P averaged +4.8% per year, our top strategies averaged up to +56.2% per year.",
    " See their latest picks free >> ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:13:00"
}