{
  "url": "https://www.nasdaq.com/article/sprint-loses-in-maryland-cellphone-trafficking-appeal-20190905-00933",
  "title": "Sprint loses in Maryland cellphone trafficking appeal - Nasdaq.com",
  "text": [
    "By Jonathan Stempel",
    "NEW YORK, Sept 5 (Reuters) - A federal appeals court on Thursday threw out a $26.9 million award in favor of Sprint Corp , in a setback to the company's years-long campaign to stop what it calls cellphone trafficking.",
    "In a 3-0 decision, the 4th U.S. Circuit Court of Appeals in Richmond, Virginia, said Sprint's contracts with customers who bought \"upgraded\" phones did not unambiguously prohibit those customers from reselling their phones to third parties.",
    "Sprint had accused the Odenton, Maryland-based company of wrongfully enticing customers still under contract with the mobile phone provider to sell their phones, and then reselling the phones at higher prices.",
    "Lisa Belot, a spokeswoman for Sprint, said the company was disappointed and evaluating its next steps. Wireless Buybacks' lawyer could not immediately be reached for comment.",
    "The case concerned Sprint's contract with customers who buy \"upgraded\" phones at steep discounts, whose cost the Overland Park, Kansas-based company recoups through required service contracts that can last two years.",
    "Sprint claimed that resales cause harm because it loses money when it sells phones at loss-leader prices, and because customers may become dissatisfied if they sell upgraded phones with the latest technology and instead use older Sprint phones.",
    "Writing for the appeals court, Circuit Judge Jay Richardson parsed the language of Sprint's contracts, and said U.S. District Judge Catherine Blake in Baltimore erred in concluding that Wireless Buybacks intentionally interfered with them.",
    "\"Sprint was not entitled to judgment as a matter of law,\" Richardson wrote. The appeals court returned the case to Blake for further proceedings.",
    "After winning the $26.9 million award, Sprint had said there was a \"legitimate secondary market\" for cellphones, but customers were harmed by Wireless Buybacks' activities.",
    "The case is Sprint Nextel Corp et al v Wireless Buybacks Holdings LLC et al, 4th U.S. Circuit Court of Appeals, No. 18-1729."
  ],
  "published_datetime": "2019-09-05 02:42:00"
}