{
  "url": "https://www.nasdaq.com/article/venezuelas-armed-forces-bank-slams-mastercard-for-halting-card-service-20190904-01213",
  "title": "Venezuela's Armed Forces Bank slams Mastercard for halting card service - Nasdaq.com",
  "text": [
    "CARACAS, Sept 4 (Reuters) - A Venezuelan bank run by the troubled country's military on Wednesday slammed Mastercard for cutting off service to the bank's credit cards following U.S. sanctions against the government of President Nicolas Maduro.",
    "The measure is another sign of how U.S. sanctions are affecting the functioning of Venezuelan state institutions.",
    "But the practical impact is limited because the bank is small and hyperinflation has reduced use of credit cards, whose credit limits rarely keep up with price increases.",
    "The U.S. Treasury Department in March told Visa, Mastercard and American Express that they could not continue doing business with Venezuelan state institutions after March 2020.",
    "That was part of a broad set of sanctions against Venezuela's government that is meant to push Maduro from office and support opposition leader Juan Guaido, who in January invoked the constitution to assume a rival interim presidency.",
    "Commerce in Venezuela's collapsing economy depends heavily on debit card transactions, which operate principally on a local platform, and increasingly on dollars and euros in cash.",
    "Venezuelan bank regulator Sudeban earlier this year asked local banks to design a new payment system, according to a financial sector source, who added the project has not been completed.",
    "\"#Mastercard should know that its arbitrary action will not intimidate us,\" Bank of the Armed Forces President Dario Baute wrote via Twitter. \"The @BanFANB technology team is stronger than you think and our legal team will respond with the same force with which you attacked us.\"",
    "Mastercard, Venezuela'sInformation Ministry and the Bank of the Armed Forces did not respond to requests for comment.",
    "Mastercard also halted services to state-run Agricultural Bank. Phone numbers published on that bank's website were disconnected."
  ],
  "published_datetime": "2019-09-04 08:45:00"
}