{
  "url": "https://www.nasdaq.com/article/ultragenyx-to-submit-sbla-for-label-expansion-of-crysvita-cm1210598",
  "title": "Ultragenyx to Submit sBLA for Label Expansion of Crysvita - Nasdaq.com",
  "text": [
    "  Ultragenyx Pharmaceutical Inc. RARE  and partner Kyowa Kirin Co., Ltd., announced plans to submit a supplemental Biologics License Application (sBLA) to the FDA for the label expansion of Crysvita (burosumab). The sBLA will be submitted for the treatment of FGF23-related hypophosphatemia associated with phosphaturic mesenchymal tumors (tumor-induced osteomalacia; TIO) that cannot be curatively resected or localized. The company decided to  to submit the sBLA after completing a pre-sBLA meeting with the FDA and an agreement on the filing package. The submission of the sBLA is planned for the first half of 2020. The sBLA will be supported by data from two single-arm phase II studies - a 144-week phase II study in 14 adult patients conducted by Ultragenyx in the United States and an 88-week phase II study in 13 adult patients conducted by Kyowa Kirin in Japan and South Korea. In both studies, Crysvita was associated with increases in serum phosphorus and serum 1,25-dihydroxyvitamin D levels. Increased phosphate levels led to improvements in osteomalacia, mobility, and vitality. Shares of the company have inched up 0.9% year to date against the  industry  's decline of 1.9%.    Crysvita, an antibody targeting fibroblast growth factor 23 (FGF23), is approved in the United States for the treatment of X-linked hypophosphatemia (XLH) in adult and pediatric patients. The drug received European conditional marketing authorization in February 2018 for the treatment of XLH with radiographic evidence of bone disease in children one year of age or older, and adolescents with growing skeletons. The company also has some gene-therapy candidates in its pipeline. These include DTX301, which is an adeno-associated virus 8 (AAV8) being evaluated for the treatment of patients with Ornithine transcarbamylase (OTC) deficiency. I t report  ed data from the first two dose cohorts of DTX301 gene therapy in the same indication. DTX301 phase I/II data from the third dose cohort are expected in the third quarter of 2019. DTX401 is an AAV8 gene-therapy candidate being evaluated for the treatment of patients with glycogen storage disease type Ia (GSDIa).  The company is developing DTX201 in its FVIII gene-therapy program for the treatment of hemophilia A in collaboration with Bayer (BAYRY). The investigational new drug (IND) application was accepted by the FDA in the second quarter of 2018.     Ultragenyx Pharmaceutical Inc. Price        Ultragenyx Pharmaceutical Inc. price    |   Ultragenyx Pharmaceutical Inc. Quote    Zacks Rank & Stocks to Consider  Ultragenyx is currently a Zacks Rank #3 (Hold) stock. Some better-ranked stocks in the biotech sector are Amgen Inc. AMGN  , Acorda Therapeutics Inc. ACOR  and Celcuity Inc. CELC  . All of these sport a Zacks Rank #1 (Strong Buy), at present. You can see   the complete list of today's Zacks #1 Rank stocks   here  .  Amgen's earnings per share estimates have increased from $13.90 to $14.30 for 2019, and from $14.78 to $15.42 for 2020, in the past 60 days. The company delivered a positive earnings surprise in the trailing four quarters, the average beat being 6.72%.     Acorda's loss per share estimates for the current year narrowed from $3.59 to $2.74 over the past 60 days. The company recorded a positive earnings surprise in the preceding four quarters, the average beat being 69.68%.     Celcuity's loss per share estimates narrowed from 81 cents to 70 cents for 2019 and from 96 cents to 71 cents for 2020, in the past 60 days. The company delivered a positive earnings surprise in three of the trailing four quarters, the average beat being 25.76%.      Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana. Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Acorda Therapeutics, Inc. (ACOR): Free Stock Analysis Report   Ultragenyx Pharmaceutical Inc. (RARE): Free Stock Analysis Report   Amgen Inc. (AMGN): Free Stock Analysis Report   Celcuity, Inc. (CELC): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Ultragenyx Pharmaceutical Inc. RARE  and partner Kyowa Kirin Co., Ltd., announced plans to submit a supplemental Biologics License Application (sBLA) to the FDA for the label expansion of Crysvita (burosumab). The sBLA will be submitted for the treatment of FGF23-related hypophosphatemia associated with phosphaturic mesenchymal tumors (tumor-induced osteomalacia; TIO) that cannot be curatively resected or localized. The company decided to  to submit the sBLA after completing a pre-sBLA meeting with the FDA and an agreement on the filing package. The submission of the sBLA is planned for the first half of 2020.",
    "The sBLA will be supported by data from two single-arm phase II studies - a 144-week phase II study in 14 adult patients conducted by Ultragenyx in the United States and an 88-week phase II study in 13 adult patients conducted by Kyowa Kirin in Japan and South Korea. In both studies, Crysvita was associated with increases in serum phosphorus and serum 1,25-dihydroxyvitamin D levels. Increased phosphate levels led to improvements in osteomalacia, mobility, and vitality.",
    "Shares of the company have inched up 0.9% year to date against the  industry  's decline of 1.9%.",
    "Crysvita, an antibody targeting fibroblast growth factor 23 (FGF23), is approved in the United States for the treatment of X-linked hypophosphatemia (XLH) in adult and pediatric patients. The drug received European conditional marketing authorization in February 2018 for the treatment of XLH with radiographic evidence of bone disease in children one year of age or older, and adolescents with growing skeletons.",
    "The company also has some gene-therapy candidates in its pipeline. These include DTX301, which is an adeno-associated virus 8 (AAV8) being evaluated for the treatment of patients with Ornithine transcarbamylase (OTC) deficiency. I t report  ed data from the first two dose cohorts of DTX301 gene therapy in the same indication. DTX301 phase I/II data from the third dose cohort are expected in the third quarter of 2019.",
    "DTX401 is an AAV8 gene-therapy candidate being evaluated for the treatment of patients with glycogen storage disease type Ia (GSDIa). ",
    "The company is developing DTX201 in its FVIII gene-therapy program for the treatment of hemophilia A in collaboration with Bayer (BAYRY). The investigational new drug (IND) application was accepted by the FDA in the second quarter of 2018.",
    "  Ultragenyx Pharmaceutical Inc. Price        Ultragenyx Pharmaceutical Inc. price    |   Ultragenyx Pharmaceutical Inc. Quote  ",
    " Ultragenyx Pharmaceutical Inc. Price ",
    " Ultragenyx Pharmaceutical Inc. price    |   Ultragenyx Pharmaceutical Inc. Quote ",
    " Zacks Rank & Stocks to Consider ",
    "Ultragenyx is currently a Zacks Rank #3 (Hold) stock.",
    "Some better-ranked stocks in the biotech sector are Amgen Inc. AMGN  , Acorda Therapeutics Inc. ACOR  and Celcuity Inc. CELC  . All of these sport a Zacks Rank #1 (Strong Buy), at present. You can see   the complete list of today's Zacks #1 Rank stocks   here  . ",
    "Amgen's earnings per share estimates have increased from $13.90 to $14.30 for 2019, and from $14.78 to $15.42 for 2020, in the past 60 days. The company delivered a positive earnings surprise in the trailing four quarters, the average beat being 6.72%.    ",
    "Acorda's loss per share estimates for the current year narrowed from $3.59 to $2.74 over the past 60 days. The company recorded a positive earnings surprise in the preceding four quarters, the average beat being 69.68%.    ",
    "Celcuity's loss per share estimates narrowed from 81 cents to 70 cents for 2019 and from 96 cents to 71 cents for 2020, in the past 60 days. The company delivered a positive earnings surprise in three of the trailing four quarters, the average beat being 25.76%.    ",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana. Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:37:00"
}