{
  "url": "https://www.nasdaq.com/article/first-week-of-october-18th-options-trading-for-caseys-general-stores-casy-cm1207538",
  "title": "First Week of October 18th Options Trading For Casey's General Stores (CASY) - Nasdaq.com",
  "text": [
    "Investors in Casey's General Stores, Inc. (Symbol: CASY) saw new options become available this week, for the October 18th expiration. At Stock Options Channel , our YieldBoost formula has looked up and down the CASY options chain for the new October 18th contracts and identified one put and one call contract of particular interest.",
    "Because the $165.00 strike represents an approximate 1% discount to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the put contract would expire worthless. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 57%. Stock Options Channel will track those odds over time to see how they change, publishing a chart of those numbers on our website under the contract detail page for this contract . Should the contract expire worthless, the premium would represent a 3.39% return on the cash commitment, or 28.15% annualized - at Stock Options Channel we call this the YieldBoost .",
    "Considering the fact that the $170.00 strike represents an approximate 2% premium to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the covered call contract would expire worthless, in which case the investor would keep both their shares of stock and the premium collected. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 58%. On our website under the contract detail page for this contract , Stock Options Channel will track those odds over time to see how they change and publish a chart of those numbers (the trading history of the option contract will also be charted). Should the covered call contract expire worthless, the premium would represent a 3.06% boost of extra return to the investor, or 25.42% annualized, which we refer to as the YieldBoost .",
    "Top YieldBoost Calls of the S&P 500 »",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:19:11"
}