{
  "url": "https://www.nasdaq.com/article/has-keysight-technologies-keys-outpaced-other-computer-and-technology-stocks-this-year-cm1210451",
  "title": "Has Keysight Technologies (KEYS) Outpaced Other Computer and Technology Stocks This Year? - Nasdaq.com",
  "text": [
    " The Computer and Technology group has plenty of great stocks, but investors should always be looking for companies that are outperforming their peers. Has Keysight Technologies (KEYS) been one of those stocks this year? Let's take a closer look at the stock's year-to-date performance to find out. Keysight Technologies is one of 638 individual stocks in the Computer and Technology sector. Collectively, these companies sit at #7 in the Zacks Sector Rank. The Zacks Sector Rank includes 16 different groups and is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. The Zacks Rank is a proven model that highlights a variety of stocks with the right characteristics to outperform the market over the next one to three months. The system emphasizes earnings estimate revisions and favors companies with improving earnings outlooks. KEYS is currently sporting a Zacks Rank of #1 (Strong Buy). Over the past three months, the Zacks Consensus Estimate for KEYS's full-year earnings has moved 6.96% higher. This shows that analyst sentiment has improved and the company's earnings outlook is stronger. Based on the most recent data, KEYS has returned 58.57% so far this year. In comparison, Computer and Technology companies have returned an average of 21.59%. This means that Keysight Technologies is performing better than its sector in terms of year-to-date returns. Looking more specifically, KEYS belongs to the Electronics - Measuring Instruments industry, a group that includes 7 individual stocks and currently sits at #18 in the Zacks Industry Rank. This group has gained an average of 39.23% so far this year, so KEYS is performing better in this area. Investors with an interest in Computer and Technology stocks should continue to track KEYS. The stock will be looking to continue its solid performance.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Keysight Technologies Inc. (KEYS): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "The Computer and Technology group has plenty of great stocks, but investors should always be looking for companies that are outperforming their peers. Has Keysight Technologies (KEYS) been one of those stocks this year? Let's take a closer look at the stock's year-to-date performance to find out.",
    "Keysight Technologies is one of 638 individual stocks in the Computer and Technology sector. Collectively, these companies sit at #7 in the Zacks Sector Rank. The Zacks Sector Rank includes 16 different groups and is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors.",
    "The Zacks Rank is a proven model that highlights a variety of stocks with the right characteristics to outperform the market over the next one to three months. The system emphasizes earnings estimate revisions and favors companies with improving earnings outlooks. KEYS is currently sporting a Zacks Rank of #1 (Strong Buy).",
    "Over the past three months, the Zacks Consensus Estimate for KEYS's full-year earnings has moved 6.96% higher. This shows that analyst sentiment has improved and the company's earnings outlook is stronger.",
    "Based on the most recent data, KEYS has returned 58.57% so far this year. In comparison, Computer and Technology companies have returned an average of 21.59%. This means that Keysight Technologies is performing better than its sector in terms of year-to-date returns.",
    "Looking more specifically, KEYS belongs to the Electronics - Measuring Instruments industry, a group that includes 7 individual stocks and currently sits at #18 in the Zacks Industry Rank. This group has gained an average of 39.23% so far this year, so KEYS is performing better in this area.",
    "Investors with an interest in Computer and Technology stocks should continue to track KEYS. The stock will be looking to continue its solid performance.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:30:12"
}