{
  "url": "https://www.nasdaq.com/article/why-central-banks-are-running-out-of-ammo-cm1206793",
  "title": "Why central banks are running out of ammo - Nasdaq.com",
  "text": [
    "   After a decade of unprecedented monetary stimulus around the world, actual inflation and inflation expectations remain stubbornly low in most major economies. Inflation is falling persistently short of central bank targets even in economies operating beyond full employment-notably the U.S. It is even more unusual to see a drop in inflation expectations in the late-cycle stage when concerns would typically focus on overheating. See the chart below.     Monetary policy-both conventional and unconventional-works through lower interest rates. Lowering rates across the yield curve helps stimulate demand by lowering the cost of financing consumption or investment. It also gives investors incentives to re-balance into riskier assets, in principle reducing the cost of capital for companies. If policy rates are near their effective lower bound (ELB) and the scope for longer term rates to fall is limited, monetary policy cannot provide much more stimulus through this channel-a liquidity trap situation. We detailed the factors that have been driving the decline in interest rates in our November 2017 paper The safety premium driving low rates  . The secular decline in neutral interest rates (r-star)-the estimate of rates that neither stimulates nor hinders economic growth - has reduced the distance from the effective lower bound (ELB) and thereby how much the central bank can cut in a downturn. Lower potential growth is one factor, but our r-star estimate, based on a Federal Reserve model, has fallen by more than growth since the mid-2000s-especially after the crisis. We believe this wedge reflects the role played by an increase in global risk aversion, initially stoked after the late-1990s Asia financial crisis and later magnified by the global financial crisis (GFC). These severe shocks motivated persistently higher precautionary savings by both the public and private sectors, dragging down the neutral rate. Our estimates  suggest that greater risk aversion and lower potential growth each account equally for the roughly 150 basis point decline in the U.S. r-star since the GFC. Flattening the curve  Rising risk aversion also makes perceived safe assets more alluring and compresses their yields relative to other assets. This is why investors are pushing interest rates ever lower and flattening out yield curves. Nominal yields on long-term government bonds are at new record lows-the entire German bund yield curve is now negative-or back near historic ones in the U.S. The term premium-the compensation that investors typically demand for bearing the greater risk of long-term bonds-is negative again. Interest rates in Europe and Japan may already be near their ultimate floor as long as there is still physical cash.     The chart above shows the current U.S. Treasury yield curve compared with a hypothetical one based on the median curve moves during the recessions of recent decades, adjusted for structural changes to neutral rates. We do this to get a sense of how the curve might need to shift lower from current levels if it were to react in a similar fashion as during past recessions. To get a similar move now, short-term rates would need to drop to around -2%. We believe such a move is highly unlikely if not impossible-the ELB where central banks stop cutting rates, and investors stop chasing negative yields, is almost certainly higher than this. Central banks are running out of room to cut rates. What other options are available? In the next blog in this series, I will discuss fiscal policy-both its attractions and its limitations. For more on this topic, read our paper, \"Dealing with the next downturn.\"  Elga Bartsch  , PhD, Head of Economic and Markets Research for the BlackRock Investment Institute, is a regular contributor to  The   Blog   .  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:26:10"
}