{
  "url": "https://www.nasdaq.com/article/top-ranked-growth-stocks-to-buy-for-september-3rd-cm1206819",
  "title": "Top Ranked Growth Stocks to Buy for September 3rd - Nasdaq.com",
  "text": [
    "Here are four stocks with buy ranks and strong growth characteristics for investors to consider today, September 3rd :",
    "Meritage Homes Corporation (MTH): This home construction company, which carries a Zacks Rank #1 (Strong Buy), has witnessed the Zacks Consensus Estimate for its current year earnings increasing 13.7% over the last 60 days.",
    "Meritage Corporation price-consensus-chart | Meritage Corporation Quote",
    "Meritage Homes has a PEG ratio of 1.48 compared with 3.48 for the industry. The company possesses a  Growth Score  of B.",
    "Meritage Corporation peg-ratio-ttm | Meritage Corporation Quote",
    "Taylor Morrison Home Corporation (TMHC) :This homebuilder, which carries a Zacks Rank #1, has witnessed the Zacks Consensus Estimate for its current year earnings increasing 4.9% over the last 60 days.",
    "Taylor Morrison Home Corporation price-consensus-chart | Taylor Morrison Home Corporation Quote",
    "Taylor Morrison Home has a PEG ratio of 1.60, compared with 3.48 for the industry. The company possesses a Growth Score of A.",
    "Taylor Morrison Home Corporation peg-ratio-ttm | Taylor Morrison Home Corporation Quote",
    "D.R. Horton, Inc. (DHI): This home construction company, which carries a Zacks Rank #2 (Buy), has witnessed the Zacks Consensus Estimate for its current year earnings increasing 7.2% over the last 60 days.",
    "D.R. Horton, Inc. price-consensus-chart | D.R. Horton, Inc. Quote",
    "D.R. Horton has a PEG ratio of 1.08, compared with 3.48 for the industry. The company possesses a Growth Score of A.",
    "D.R. Horton, Inc. peg-ratio-ttm | D.R. Horton, Inc. Quote",
    "MiX Telematics Limited (MIXT) : This software company, which carries a Zacks Rank #2, has witnessed the Zacks Consensus Estimate for its current year earnings increasing 2.4% over the last 60 days.",
    "MiX Telematics Limited price-consensus-chart | MiX Telematics Limited Quote",
    "MiX Telematics has a PEG ratio of 0.66, compared with 1.47 for the industry. The company possesses a Growth Score of B.",
    "MiX Telematics Limited peg-ratio-ttm | MiX Telematics Limited Quote",
    "See the  full list of top ranked stocks here .",
    "Learn more about the  Growth score and how it is calculated here .",
    "Legalizing THIS Could Be Even Bigger than Marijuana",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "See these 5 \"sin stocks\" now >>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:23:00"
}