{
  "url": "https://www.nasdaq.com/article/health-care-sector-update-for-09032019-abeoebstmdtotmdiapls-cm1206896",
  "title": "Health Care Sector Update for 09/03/2019: ABEO,EBS,TMD.TO,TMDI,APLS - Nasdaq.com",
  "text": [
    "Top Health Care Stocks",
    "JNJ +0.32%",
    "PFE +1.45%",
    "ABT -1.71%",
    "MRK +0.19%",
    "AMGN -1.36%",
    "Health care stocks were moderately lower compared with most other sectors this afternoon, with the NYSE Health Care Index slipping about 0.3% while the shares of health care companies in the S&P 500 also were down almost 0.8% as a group. The Nasdaq Biotechnology index was falling just under 2.0%.",
    "Among health care stocks moving on news:",
    "(+) Abeona Therapeutics ( ABEO  ) roared 90% higher on Tuesday after the biopharmaceutical company said it has hired Jefferies to assist with a review of its strategic alternatives, which could include a potential sale or merger or partnering its clinical and pre-clinical programs with an outside party.",
    "In other sector news:",
    "(+) Emergent BioSolutions ( EBS  ) climbed 14% on Tuesday after saying it received a 10-year contract from the US Department of Health and Human Services to continue supplying the federal agency with the company's AM2000 smallpox vaccine. The new contract is valued up to $2 billion, with an initial one-year period paying around $170 million plus nine option years. The company is expecting to deliver most of the doses before Dec. 31, with those sales already included in its FY19 financial forecast.",
    "(+) Titan Medical ( TMDI  ) declined 2%, giving back a previous rise. The medical device company said it has received a US patent for the camera positioning and image-capture tools on its dual-view camera system for use during robotic surgery. The dual-view system consists of an endoscope module and one flexible 3-D and 2-D high-definition camera each along with independent light sources and a camera insertion tube.",
    "(-) Apellis Pharmaceuticals ( APLS  ) fell over 5% this afternoon. The biopharmaceutical company began dosing patients in a phase III study of its APL-2 drug candidate in patients with paroxysmal nocturnal hemoglobinuria who have not undergone prior treatment for the disease that impairs bone marrow function and destroys red blood cells.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-03 15:34:40"
}