{
  "url": "https://www.nasdaq.com/article/better-buy-baidu-vs-netease-cm1207440",
  "title": "Better Buy: Baidu vs. NetEase - Nasdaq.com",
  "text": [
    " Some of China's earliest publicly traded online companies are   getting pretty cheap.   Baidu    (NASDAQ: BIDU)  -- the country's leading search engine   provider -- is hitting   six-year lows    this summer. The stock is now trading for just 16 times next   year's projected earnings.   NetEase    (NASDAQ: NTES) is faring better, but the online gaming pioneer   has surrendered nearly a third of its value since peaking two   years ago. NetEase shares can be had at 19 times next year's   profit target. Stocks trading at forward earnings multiples in the high teens   aren't automatically bargains, but Baidu and NetEase have   historically traded at far juicier ratios. The two stocks have   been big winners for long-term investors. Baidu has soared 1,130%   and NetEase has skyrocketed 2,150% since being initially   recommended in Motley Fool Rule Breakers in 2006 and 2004,   respectively. Let's see which Chinese dot-com is the smarter   investment for the year ahead.   Image source: NetEase.makeArticleAd();  Getting back on track Baidu and NetEase aren't in ideal situations at the moment.   Baidu's business has decelerated dramatically, as China's slowing   economy has cooled budgets for paid search leads. NetEase saw its   revenue slow to a crawl since early last year when regulators   clamped down on China's gaming industry, but it has since started   to bounce back. Analysts see NetEase revenue accelerating next   year for the first time since 2015. Each company is facing unique challenges, but both Baidu and   NetEase are struggling with their signature businesses. Baidu's   online advertising business has seen its revenue growth turn   negative, and revenue from continuing operations   rose 6%     in its latest quarter. Overall profitability is going the   wrong way. NetEase is holding up relatively better, as revenue   and earnings rose 15% and 20%, respectively, in   its latest report    . However, the online gaming business that contributes 61% of the   top-line mix at NetEase still saw its growth rate come in at less   than half of what it was achieving in each of the three previous   quarters. Buying into   Chinese stocks    is risky these days. Trade tensions and a slowing economy in the   once red-hot nation are weighing on investor appetite for the   country's former market darlings. For now, NetEase is the one   that's better situated to deal with the new normal, and it also   rewards investors with a modest, yet tangible, dividend that   currently works out to being a 1.6% yield. If investors think that the rocky times will continue, NetEase   has proven the more apt of the two in navigating through this   rocky terrain. However, if you feel that the tariff standoff with   the U.S. will be resolved sooner rather than later and that   China's economy will eventually right itself -- and both of those   things are just a matter of time, one would think -- then Baidu   is positioned for the bigger bounce. Both companies have the well-entrenched businesses and   pedigree papers to beat the market once conditions stabilize, but   if and when investors get hungry for Chinese equities again it   will likely be Baidu leading the way.   10 stocks we like better than NetEase       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and NetEase wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Rick Munarriz      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Baidu and NetEase. The Motley     Fool has a     disclosure policy      .  ",
    "Some of China's earliest publicly traded online companies are   getting pretty cheap.   Baidu    (NASDAQ: BIDU)  -- the country's leading search engine   provider -- is hitting   six-year lows    this summer. The stock is now trading for just 16 times next   year's projected earnings.   NetEase    (NASDAQ: NTES) is faring better, but the online gaming pioneer   has surrendered nearly a third of its value since peaking two   years ago. NetEase shares can be had at 19 times next year's   profit target.",
    "Stocks trading at forward earnings multiples in the high teens   aren't automatically bargains, but Baidu and NetEase have   historically traded at far juicier ratios. The two stocks have   been big winners for long-term investors. Baidu has soared 1,130%   and NetEase has skyrocketed 2,150% since being initially   recommended in Motley Fool Rule Breakers in 2006 and 2004,   respectively. Let's see which Chinese dot-com is the smarter   investment for the year ahead.",
    "  Image source: NetEase.makeArticleAd(); ",
    "Image source: NetEase.",
    "Baidu and NetEase aren't in ideal situations at the moment.   Baidu's business has decelerated dramatically, as China's slowing   economy has cooled budgets for paid search leads. NetEase saw its   revenue slow to a crawl since early last year when regulators   clamped down on China's gaming industry, but it has since started   to bounce back. Analysts see NetEase revenue accelerating next   year for the first time since 2015.",
    "Each company is facing unique challenges, but both Baidu and   NetEase are struggling with their signature businesses. Baidu's   online advertising business has seen its revenue growth turn   negative, and revenue from continuing operations   rose 6%     in its latest quarter. Overall profitability is going the   wrong way. NetEase is holding up relatively better, as revenue   and earnings rose 15% and 20%, respectively, in   its latest report    . However, the online gaming business that contributes 61% of the   top-line mix at NetEase still saw its growth rate come in at less   than half of what it was achieving in each of the three previous   quarters.",
    "Buying into   Chinese stocks    is risky these days. Trade tensions and a slowing economy in the   once red-hot nation are weighing on investor appetite for the   country's former market darlings. For now, NetEase is the one   that's better situated to deal with the new normal, and it also   rewards investors with a modest, yet tangible, dividend that   currently works out to being a 1.6% yield.",
    "If investors think that the rocky times will continue, NetEase   has proven the more apt of the two in navigating through this   rocky terrain. However, if you feel that the tariff standoff with   the U.S. will be resolved sooner rather than later and that   China's economy will eventually right itself -- and both of those   things are just a matter of time, one would think -- then Baidu   is positioned for the bigger bounce.",
    "Both companies have the well-entrenched businesses and   pedigree papers to beat the market once conditions stabilize, but   if and when investors get hungry for Chinese equities again it   will likely be Baidu leading the way.",
    "  10 stocks we like better than NetEase       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and NetEase wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than NetEase       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and NetEase wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Rick Munarriz      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Baidu and NetEase. The Motley     Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:52:00"
}