{
  "url": "https://www.nasdaq.com/article/couple-wounded-in-el-paso-mass-shooting-sues-walmart-20190904-00937",
  "title": "Couple wounded in El Paso mass shooting sues Walmart - Nasdaq.com",
  "text": [
    "By Jonathan Stempel",
    "Sept 4 (Reuters) - A couple wounded in the Aug. 3 mass shooting at a Walmart in El Paso, Texas, has sued the retailer, claiming the store lacked proper security, in what their lawyers called the first lawsuit over the attack.",
    "Guillermo and Jessica Garcia believe Walmart's  failure to employ armed security guards at the store, despite using them in other stores, was a factor in the massacre, where 22 people were killed, their lawyers said on Wednesday.",
    "Guillermo Garcia remains hospitalized in critical condition after being shot in the spine, while Jessica Garcia was hospitalized and later released after being shot in the legs, their lawyers said.",
    "\"Jessica Garcia and Guillermo Garcia's injuries would not have occurred but for the negligence, gross negligence, and premises liability\" of Walmart, the complaint said.",
    "The Garcias are seeking a restraining order requiring Walmart, which has begun renovating the store, to preserve evidence from the shooting.",
    "They also want to question the world's largest retailer about its security practices following a June 2016 hostage taking by an armed employee at a Walmart in Amarillo, Texas.",
    "The lawsuit does not say whether the Garcias are seeking monetary damages.",
    "Walmart spokesman Randy Hargrove said \"safety was a top priority\" for the Bentonville, Arkansas-based retailer, which will respond to the complaint filed on Aug. 30 in the El Paso County District Court.",
    "\"This tragic event will be with us forever and our hearts go out to the families that were impacted,\" Hargrove said in a statement. \"We preserved what information we have, and we've worked meticulously with federal and local authorities as they documented everything that took place on August 3.\"",
    "Most of those killed in the shooting were Hispanic.",
    "Crusius, who is white, told police while surrendering that he had been targeting Mexicans, according to an El Paso police affidavit released on Aug. 9. ",
    "On Tuesday, Walmart said it would stop selling ammunition that could be used in assault-style rifles, and would discourage shoppers from openly carrying guns in its stores. It also called for stronger background checks for gun buyers. ",
    "The National Rifle Association, which supports gun rights, accused Walmart of succumbing to pressure from \"anti-gun elites.\""
  ],
  "published_datetime": "2019-09-04 02:45:00"
}