{
  "url": "https://www.nasdaq.com/article/wall-st-dips-dollar-climbs-on-weak-factory-data-trade-jitters-20190903-00872",
  "title": "Wall St dips, dollar climbs on weak factory data, trade jitters - Nasdaq.com",
  "text": [
    "By Stephen Culp",
    "NEW YORK, Sept 3 (Reuters) - Wall Street lost ground and the U.S. dollar strengthened to its highest level in more than two years on Tuesday as trade worries persisted and U.S. factory activity entered contraction territory for the first time since February 2016.",
    "As new tariffs on Chinese goods went into effect over the U.S. Labor Day weekend, market participants are apparently losing faith that the world's two largest economies will reach a near-term resolution to their long-running trade war, which has rattled markets for months and weighed on world economies.",
    "\"Any possible optimism regarding the trade talks (was) dashed by this ISM number, which showed a contraction in factory activity,\" said Tim Ghriskey, chief investment strategist at Inverness Counsel in New York.",
    "\"There's optimism that the U.S. will weather the storm with help from the Fed,\" Ghriskey added. \"But weakness in manufacturing seems to be persistent. This wasn't a fluke report.\"",
    "The Dow Jones Industrial Average  fell 340.49 points, or 1.29%, to 26,062.79, the S&P 500  lost 22.79 points, or 0.78%, to 2,903.67 and the Nasdaq Composite  dropped 67.90 points, or 0.85%, to 7,894.99.",
    "European shares fell for the first time in four sessions on Tuesday, as uncertainty over a looming no-deal Brexit and lingering U.S.-China trade tensions dampened investor optimism. ",
    "The pan-European STOXX 600 index  lost 0.38% and MSCI's gauge of stocks across the globe  shed 0.56%.",
    "Trade concerns also dampened emerging markets. ",
    "Emerging market stocks lost 0.89%. MSCI's broadest index of Asia-Pacific shares outside Japan  closed 0.75% lower, while Japan's Nikkei  rose 0.02%.",
    "Trade and Brexit concerns drove the dollar, against a basket of major world currencies, to its highest level since mid-May 2017, and sent the Euro plunging to a 28-month low versus the greenback. ",
    "The dollar index  rose 0.07%, with the euro  up 0.05% to $1.0972.",
    "The Japanese yen strengthened 0.32% versus the greenback at 105.89 per dollar, while Sterling  was last trading at $1.2068, up 0.02% on the day.",
    "U.S. Treasury yields fell, with the benchmark 10-year yield at its lowest since July 2016 following the downbeat ISM report and worries about a weakening global economy in the face of the U.S.-China trade war. ",
    "Benchmark 10-year notes  last rose 17/32 in price to yield 1.4489%, down from 1.506% late on Friday.",
    "The 30-year bond  last rose 34/32 in price to yield 1.9281%, down from 1.973% late on Friday.",
    "Rising OPEC and Russian production, combined with demand concerns due to a global economic slowdown dragged down oil prices. ",
    "U.S. crude  fell 3.39% to $53.23 per barrel and Brent  was last at $57.60, down 1.81% on the day.",
    "Gold prices held steady, with the safe-haven precious metal hovering just below its more than six-year high of $1,554.56. ",
    "Spot gold  added 0.9% to $1,543.47 an ounce.",
    "Copper  lost 0.78% to $5,576.00 a tonne.",
    "Three-month aluminum on the London Metal Exchange  lost 0.26% to $1,744.50 a tonne.",
    "Implied FX volatility: G7 FX, GBP (graphic)."
  ],
  "published_datetime": "2019-09-03 11:05:00"
}