{
  "url": "https://www.nasdaq.com/article/79-of-future-retirees-share-this-major-concern-cm1210851",
  "title": "79% of Future Retirees Share This Major Concern - Nasdaq.com",
  "text": [
    "Though retirement is an exciting milestone, many older Americans worry about covering their costs during that period of life. And of the various expenses that seniors are forced to grapple with, healthcare can be a major source of stress.",
    "Earlier this year, Fidelity estimated that the average 65-year-old couple retiring in 2019 would spend $285,000 on medical care throughout their golden years. Meanwhile, cost-projection software provider HealthView Services puts that number at $387,644 . These figures account for expenses like Medicare premiums, deductibles, coinsurance, co-pays, and services not covered by Medicare. It's no wonder, then, that 79% of future retirees cite healthcare costs as their top financial concern, according to a new survey by Nationwide.",
    "IMAGE SOURCE: GETTY IMAGES.",
    "If you're worried about paying for healthcare in retirement, the good news is that there are several savings vehicles that can make it easier to sock away funds for this expense. And the sooner you start taking advantage of them, the better.",
    "Though healthcare is only one of many expenses you'll face as a senior, it could easily be one of your largest. And, you may find that you're paying more for healthcare in retirement than you did during your working years. That's why it's crucial to save for healthcare ahead of time, and you have several options in this regard.",
    "First, you can aggressively fund an IRA or a 401(k) during your working years. Currently, the annual contribution limits for these accounts sit at $6,000 and $19,000, respectively, for workers under 50, and $7,000 and $25,000 for those 50 and over. The money you put into an IRA or 401(k) can be withdrawn in retirement to pay for any expenses you need to cover, healthcare included.",
    "If you save in a traditional IRA or 401(k), your withdrawals will be taxed during your golden years, but the money you contribute will go in tax-free during your working years, thereby lowering your IRS burden and making your account easier to fund. If you save in a Roth IRA or 401(k), you don't get an immediate tax break on your contributions, but your withdrawals can be taken tax-free during retirement.",
    "Another option it pays to consider, if you're eligible, is a health savings account , or HSA. An HSA is a savings and investment account that lets you contribute pre-tax dollars for current and future healthcare expenses. Any funds you don't immediately use can be invested for added growth, and withdrawals are tax-free, provided they're taken for qualified medical purposes.",
    "To be clear, HSAs aren't flexible spending accounts ; you don't have to use up your HSA balance year after year. In fact, the point of an HSA is to put in more money than you expect to use in the near future so that you can invest it and carry it into retirement.",
    "To qualify for an HSA, you must be on a high-deductible health insurance plan -- $1,350 or more for individual coverage, or $2,700 or more for family coverage. You must also have an annual out-of-pocket maximum of $6,750 as an individual, or $13,500 as a family.",
    "The current annual contribution limits for HSAs are $3,500 for individuals and $7,000 for families. If you're 55 or older, you can put in an additional $1,000 on top of whichever limit applies to you.",
    "It's natural to be concerned about healthcare costs in retirement, but rather than waste energy worrying about them, take steps to save for them. If you're not eligible to participate in an HSA, contribute as much as you can to an IRA or 401(k). The key, either way, is to have enough money to cover those costs when your paycheck goes away.",
    "The $16,728 Social Security bonus most retirees completely overlook\r\n If you're like most Americans, you're a few years (or more) behind on your retirement savings. But a handful of little-known \"Social Security secrets\" could help ensure a boost in your retirement income. For example: one easy trick could pay you as much as $16,728 more... each year! Once you learn how to maximize your Social Security benefits, we think you could retire confidently with the peace of mind we're all after. Simply click here to discover how to learn more about these strategies .",
    "The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 05:59:00"
}