{
  "url": "https://www.nasdaq.com/article/schwab-schw-plans-to-lay-off-600-employees-to-save-costs-cm1210418",
  "title": "Schwab (SCHW) Plans to Lay Off 600 Employees to Save Costs - Nasdaq.com",
  "text": [
    "  The   Charles Schwab  Corporation SCHW  is reducing headcount by about 600 employees from its offices nationwide in a bid to support bottom line, which it expects to be affected by the Federal Reserve's decision to cut rates. The news was firs t report  ed by The Wall Street Journal. The move comes post an internal review conducted by the company on its costs base. Also, the brokerage firm intends to keep expenses controlled so as to continue investing in opportunities such as platform improvements and technology that might help it expand and improve efficiency. Schwab's majority of revenues comes from its banking unit. Thus, decline in interest rates puts pressure on its top line.   Banks seek to borrow money at short-term rates and lend at long-term rates. As interest rates decline, they will earn less on lending. This compresses net interest margin, a key indicator of a bank's profitability. Further, banks earn net interest income (NII) by charging borrowers higher long-term interest rates while offering smaller interest rates to depositors. As rates decline, growth in NII will be affected. Similarly, Schwab derives majority of its revenues from net interest it earns on client cash held. Fall in interest rates tends to squeeze this revenue source. Moreover, almost all the banks, big and small, including PNC Financial PNC  , Wells Fargo WFC  and Huntington Bancshares HBAN  will be adversely impacted by lower interest rates. Factors such as geopolitical tensions, low inflation level and slowing global economy are expected to impact the decision of Fed officials, when they meet next week to decide the next course of action on interest rates. While Schwab's initiatives to build client base are likely to lead to improvement in trading income, the company's bottom-line growth is expected to be affected by continuously rising expenses and lower interest income. Shares of Schwab have gained 1% so far this year compared with 10.3% growth recorded by the industry  .    Currently, the stock carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .  Looking for Stocks with Skyrocketing Upside?  makeArticleAd();  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Wells Fargo & Company (WFC): Free Stock Analysis Report   The PNC Financial Services Group, Inc (PNC): Free Stock Analysis Report   Huntington Bancshares Incorporated (HBAN): Free Stock Analysis Report   The Charles Schwab Corporation (SCHW): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " The   Charles Schwab  Corporation SCHW  is reducing headcount by about 600 employees from its offices nationwide in a bid to support bottom line, which it expects to be affected by the Federal Reserve's decision to cut rates. The news was firs t report  ed by The Wall Street Journal.",
    "The move comes post an internal review conducted by the company on its costs base. Also, the brokerage firm intends to keep expenses controlled so as to continue investing in opportunities such as platform improvements and technology that might help it expand and improve efficiency.",
    "Schwab's majority of revenues comes from its banking unit. Thus, decline in interest rates puts pressure on its top line.  ",
    "Banks seek to borrow money at short-term rates and lend at long-term rates. As interest rates decline, they will earn less on lending. This compresses net interest margin, a key indicator of a bank's profitability.",
    "Further, banks earn net interest income (NII) by charging borrowers higher long-term interest rates while offering smaller interest rates to depositors. As rates decline, growth in NII will be affected.",
    "Similarly, Schwab derives majority of its revenues from net interest it earns on client cash held. Fall in interest rates tends to squeeze this revenue source.",
    "Moreover, almost all the banks, big and small, including PNC Financial PNC  , Wells Fargo WFC  and Huntington Bancshares HBAN  will be adversely impacted by lower interest rates.",
    "Factors such as geopolitical tensions, low inflation level and slowing global economy are expected to impact the decision of Fed officials, when they meet next week to decide the next course of action on interest rates.",
    "While Schwab's initiatives to build client base are likely to lead to improvement in trading income, the company's bottom-line growth is expected to be affected by continuously rising expenses and lower interest income.",
    "Shares of Schwab have gained 1% so far this year compared with 10.3% growth recorded by the industry  .",
    "Currently, the stock carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    " Looking for Stocks with Skyrocketing Upside?  makeArticleAd();  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:50:00"
}