{
  "url": "https://www.nasdaq.com/article/brazil-mining-standards-postvale-disaster-aim-to-boost-accountability-20190911-00687",
  "title": "Brazil mining standards, post-Vale disaster, aim to boost accountability - Nasdaq.com",
  "text": [
    "By Christian Plumb",
    "BELO HORIZONTE, Brazil, Sept 11 (Reuters) - A global mining industry panel, tasked with drawing up new safety standards after Vale SA's  January tailings dam disaster, will include rules to better define management accountability, an industry group head said in Brazil on Wednesday.",
    "The governance standard would also help ensure independent reviews of dams and adequate disclosure of safety risks, said Tom Butler, president of the International Council on Mining and Metals, the industry group which is setting the standards.",
    "The collapse came less than four years after another at a joint venture between Vale and BHP Group , both of which are ICMM members along with Barrick , Anglo American , Freeport McMoran  and others.",
    "While the cause of the Brumadinho disaster is still under review, some experts have suggested failings in governance at the miner as being partly to blame. The company's chief financial officer said in February that senior executives had never been shown internal security documents indicating the dam was at risk of collapse.",
    "The ICMM represents about a third of the mining industry but Butler said the standards, being drawn up by an eight-member panel of tailings, health, risk and legal experts, could influence the wider sector.",
    "\"We're hoping it will have sufficient scale to encourage take-up by others,\" he said at a packed session on tailings dam management at a mining conference in Belo Horizonte, about 20 miles (30 kilometers) from the site of the disaster.",
    "A draft version of the standards, which will also govern initial planning of dam sites as well as emergency preparedness and recovery plans, \"is almost ready to go out\" and is expected by late September early October, Butler said.",
    "That will be followed by a public consultation period, with the new standards likely to be finalized and disseminated in the first quarter of 2020, he said.",
    "Members of the panel visited Brazil in July and more recently British Colombia, the site of a 2014 breach at Imperial Metals Corp'sMount Polley Mine, which sent billions of gallons of wastewater and sludge into waterways."
  ],
  "published_datetime": "2019-09-11 02:54:00"
}