{
  "url": "https://www.nasdaq.com/article/perspectives-from-caseys-general-stores-new-ceo-cm1210814",
  "title": "Perspectives from Casey's General Stores' New CEO - Nasdaq.com",
  "text": [
    "  Casey's General Stores    ' (NASDAQ: CASY) fiscal first-quarter 2020 results, released on   Sept. 9, revealed a slight top-line increase of 1.5%, and   double-digi   t earnings    -per-share growth of 22%. Although   investors were ambivalent over the company's   quarterly scorecard    , recently appointed CEO Darren Rebelez sees much potential for   longer-term growth. Rebelez, the former president of   Dine Brands Global    's IHOP chain, took over in June from retiring CEO Terry   Handley. During   Casey's earnings conference call,    investors were able to hear executive feedback on Casey's   existing strategic plans from a fresh perspective. Below, we'll   review three of Rebelez's comments that indicate a generally   positive opinion of the company's current direction. A plan to lift fuel profitability shows early returns  During the first quarter, in the fuel category, we     experienced a favorable fuel margin environment combined with     our ability to leverage the implementation of Price Advantage,     which is our fuel price optimization tool. These factors     enabled us to achieve an average fuel margin of $0.244 per     gallon, up nearly 400     basis points      from the same period last year. This drove over a 22% increase     in gross profit dollars from the fuel category.makeArticleAd();  CEO Rebelez is referring here to one of the key attack lines   in the company's long-term \"value creation plan.\" Retail price   optimization, both at the pump and in-store, is something of a   found-money exercise for Casey's, as it generates higher   profitability on a given sales level, and reduces reliance on   volume for bottom-line profits. As I discussed   last quarter    , Price Advantage centralizes fuel pricing, and avoids some   potential pitfalls of pricing at the store level, which is often   inordinately influenced by nearby competition. Price Advantage was launched across all stores last quarter,   and while it's still a very young initiative, shareholders can   probably sense the benefit Casey's will derive. Higher fuel   margin this quarter took the sting out of a dip in fuel volume in   the current period. Same-store gallon sales were down 2% over the   last three months, as average miles driven in the Midwest   declined. Casey's was able to offset the volume slump with much   higher profitability, and, as Rebelez points out, this ultimately   returned greater gross profit dollars against the prior-year   quarter. More resources will be devoted to the fleet card program  We launched [our fleet program] in late October last year.     We currently have over 2,000 new accounts with approximately     11,000 new cards issued. Although the utilization of these     cards ramped up slower than we expected, it has gained momentum     recently as we focused additional resources around the     program.  Casey's fleet program consists of Casey's-branded   Mastercards which are accompanied by a suite of tools to   manage users, individual fuel spends, and credit limits, among   other features. The fleet card is aimed at the small businesses   that form the core of the company's commercial customer base --   these organizations typically fall in the two-to-five and   five-to-ten vehicle range. The fleet program has potential as a means to build loyalty   and recurring revenue, but its slow start may be due in part to   its rebate structure. The company advertises up to 6 cents in   rebate for every gallon purchased. However, to reach the six   cents reward, a fleet must collectively purchase at least 10,000   gallons in one month. This appears to be out of reach for the   typical two-to-ten vehicle fleet. Most businesses, then, will likely see more typical rebates of   one cent (earned with 1 to 499 monthly gallons purchased) to two   cents (earned with 500-1,499 monthly gallons purchased). This may   prove an underwhelming incentive structure, as a wide array of   business credit cards on the market offer cash-back rewards or   travel affinity points which have greater economic value than the   first few tiers of Casey's fleet program. Nonetheless, Casey's loyal cadre of customers may continue to   sign on as management shifts more marketing resources to the   fleet program, and perhaps adds additional perks in the   future.   Prepared foods, and especially pizza, is a growth driver for     Casey's General Stores. Image source: Getty Images.  Digitally enabled commerce will be a margin builder  We continue to progress with our digital engagement program     and have completed several key milestones over the last     quarter...[W]e rolled out our new mobile app during the first     quarter. This platform provides an enhanced guest experience by     streamlining the ordering and checkout process and allowing     guests to pay online. In addition, the system automatically     engages cross-sell opportunities for guests during every     order.  Rebelez observed that 28% of pizza orders are now transacted   online via the web or mobile devices, against 18% just a year   ago. Casey's prepared foods and fountain drinks comprise a   smaller segment by revenue than either gas or groceries. But the   business of selling pizza and soft drinks is by far the most   profitable for the chain: In the first quarter, the prepared   foods and fountain segment sported a gross margin of over 62%,   versus 31% for grocery and other merchandise, and 9% for   fuel. As it analyzes data from its new digital ordering channels,   Casey's is also preparing to launch a digital loyalty program to   further secure its customer base and boost revenue. The company   will begin with an employee pilot in the second quarter, which   will extend to a store pilot in a defined geographic area,   followed by a rollout to all stores. Casey's intends to utilize   customer-specific marketing strategies once the loyalty platform   is integrated with current e-commerce capabilities. Rebelez   stated management's belief that the loyalty program will   eventually drive both customer traffic and average check size   higher --   a basic building block for food stocks    seeking to deliver value to shareholders.   10 stocks we like better than Casey's General     Stores       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Casey's General Stores     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Asit Sharma      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Mastercard. The Motley Fool     recommends Casey's General Stores. The Motley Fool has a     disclosure policy      .  ",
    " Casey's General Stores    ' (NASDAQ: CASY) fiscal first-quarter 2020 results, released on   Sept. 9, revealed a slight top-line increase of 1.5%, and   double-digi   t earnings    -per-share growth of 22%. Although   investors were ambivalent over the company's   quarterly scorecard    , recently appointed CEO Darren Rebelez sees much potential for   longer-term growth.",
    "Rebelez, the former president of   Dine Brands Global    's IHOP chain, took over in June from retiring CEO Terry   Handley. During   Casey's earnings conference call,    investors were able to hear executive feedback on Casey's   existing strategic plans from a fresh perspective. Below, we'll   review three of Rebelez's comments that indicate a generally   positive opinion of the company's current direction.",
    "During the first quarter, in the fuel category, we     experienced a favorable fuel margin environment combined with     our ability to leverage the implementation of Price Advantage,     which is our fuel price optimization tool. These factors     enabled us to achieve an average fuel margin of $0.244 per     gallon, up nearly 400     basis points      from the same period last year. This drove over a 22% increase     in gross profit dollars from the fuel category.",
    "CEO Rebelez is referring here to one of the key attack lines   in the company's long-term \"value creation plan.\" Retail price   optimization, both at the pump and in-store, is something of a   found-money exercise for Casey's, as it generates higher   profitability on a given sales level, and reduces reliance on   volume for bottom-line profits. As I discussed   last quarter    , Price Advantage centralizes fuel pricing, and avoids some   potential pitfalls of pricing at the store level, which is often   inordinately influenced by nearby competition.",
    "Price Advantage was launched across all stores last quarter,   and while it's still a very young initiative, shareholders can   probably sense the benefit Casey's will derive. Higher fuel   margin this quarter took the sting out of a dip in fuel volume in   the current period. Same-store gallon sales were down 2% over the   last three months, as average miles driven in the Midwest   declined. Casey's was able to offset the volume slump with much   higher profitability, and, as Rebelez points out, this ultimately   returned greater gross profit dollars against the prior-year   quarter.",
    "We launched [our fleet program] in late October last year.     We currently have over 2,000 new accounts with approximately     11,000 new cards issued. Although the utilization of these     cards ramped up slower than we expected, it has gained momentum     recently as we focused additional resources around the     program.",
    "Casey's fleet program consists of Casey's-branded   Mastercards which are accompanied by a suite of tools to   manage users, individual fuel spends, and credit limits, among   other features. The fleet card is aimed at the small businesses   that form the core of the company's commercial customer base --   these organizations typically fall in the two-to-five and   five-to-ten vehicle range.",
    "The fleet program has potential as a means to build loyalty   and recurring revenue, but its slow start may be due in part to   its rebate structure. The company advertises up to 6 cents in   rebate for every gallon purchased. However, to reach the six   cents reward, a fleet must collectively purchase at least 10,000   gallons in one month. This appears to be out of reach for the   typical two-to-ten vehicle fleet.",
    "Most businesses, then, will likely see more typical rebates of   one cent (earned with 1 to 499 monthly gallons purchased) to two   cents (earned with 500-1,499 monthly gallons purchased). This may   prove an underwhelming incentive structure, as a wide array of   business credit cards on the market offer cash-back rewards or   travel affinity points which have greater economic value than the   first few tiers of Casey's fleet program.",
    "Nonetheless, Casey's loyal cadre of customers may continue to   sign on as management shifts more marketing resources to the   fleet program, and perhaps adds additional perks in the   future.",
    "  Prepared foods, and especially pizza, is a growth driver for     Casey's General Stores. Image source: Getty Images. ",
    "Prepared foods, and especially pizza, is a growth driver for     Casey's General Stores. Image source: Getty Images.",
    "We continue to progress with our digital engagement program     and have completed several key milestones over the last     quarter...[W]e rolled out our new mobile app during the first     quarter. This platform provides an enhanced guest experience by     streamlining the ordering and checkout process and allowing     guests to pay online. In addition, the system automatically     engages cross-sell opportunities for guests during every     order.",
    "Rebelez observed that 28% of pizza orders are now transacted   online via the web or mobile devices, against 18% just a year   ago. Casey's prepared foods and fountain drinks comprise a   smaller segment by revenue than either gas or groceries. But the   business of selling pizza and soft drinks is by far the most   profitable for the chain: In the first quarter, the prepared   foods and fountain segment sported a gross margin of over 62%,   versus 31% for grocery and other merchandise, and 9% for   fuel.",
    "As it analyzes data from its new digital ordering channels,   Casey's is also preparing to launch a digital loyalty program to   further secure its customer base and boost revenue. The company   will begin with an employee pilot in the second quarter, which   will extend to a store pilot in a defined geographic area,   followed by a rollout to all stores. Casey's intends to utilize   customer-specific marketing strategies once the loyalty platform   is integrated with current e-commerce capabilities. Rebelez   stated management's belief that the loyalty program will   eventually drive both customer traffic and average check size   higher --   a basic building block for food stocks    seeking to deliver value to shareholders.",
    "  10 stocks we like better than Casey's General     Stores       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Casey's General Stores     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Casey's General     Stores       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Casey's General Stores     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Asit Sharma      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Mastercard. The Motley Fool     recommends Casey's General Stores. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:15:00"
}