{
  "url": "https://www.nasdaq.com/article/trump-warns-china-against-dragging-its-feet-in-trade-talks-20190903-00778",
  "title": "Trump warns China against dragging its feet in trade talks - Nasdaq.com",
  "text": [
    "By Andrea Shalal and Makini Brice",
    "WASHINGTON, Sept 3 (Reuters) - U.S. President Donald Trump on Tuesday warned he would be \"tougher\" on Beijing in a second term if trade talks dragged on, compounding market fears that ongoing trade disputes between the United States and China could trigger a U.S. recession.",
    "The world's two largest economies imposed fresh tariffs on each other on Sunday, ratcheting up a tit-for-tat tariff war that has unsettled financial markets and raised the specter of a global recession. U.S. and Chinese negotiators are due to meet in person in Washington this month, but no date has yet been set. ",
    "Trump, ignoring recent negative U.S. economic data, said in a posting on Twitter that the United States was \"doing very well in our negotiations with China,\" and played up the damage U.S. tariffs were doing to the Chinese economy.",
    "He warned that Beijing faced even tougher terms if the two sides did not resolve their trade dispute and he won re-election in November 2020, writing, \"Deal would get MUCH TOUGHER! In the meantime, China's Supply Chain will crumble and businesses, jobs and money will be gone!\"",
    "He did not provide details about the negotiations or how they could become tougher.",
    "Thomas Donohue, chief executive of the U.S. Chamber of Commerce, told CNBC that U.S. companies and workers were bearing the brunt of the U.S. tariffs but China's economy was also hurting.",
    "He urged Trump to postpone the new tariffs that went into effect to give both sides time to reach an agreement.",
    "Congressional passage of the U.S-Mexico-Canada (USCMA) trade agreement was possible, and would help boost the U.S. economy while reassuring financial markets, he said. \"It would rub off on what we're doing in China.\"",
    "Trump, a Republican, has often publicly repeated his belief that Beijing is trying to slow-walk trade negotiations in the hopes a victory by a Democratic presidential candidate in 2020 may lead to better terms in an agreement.",
    "Washington began imposing 15% tariffs on an array of Chinese imports on Sunday, while China began placing new duties on U.S. crude oil. ",
    "China has since lodged a complaint against the United States at the World Trade Organization over U.S. import duties, its third lawsuit challenging Trump's China-specific tariffs. ",
    "Chinese Vice Premier Liu He said earlier on Tuesday that China vehemently opposes a trade war. "
  ],
  "published_datetime": "2019-09-03 09:22:00"
}