{
  "url": "https://www.nasdaq.com/article/top-ranked-momentum-stocks-to-buy-for-september-5th-cm1208215",
  "title": "Top Ranked Momentum Stocks to Buy for September 5th - Nasdaq.com",
  "text": [
    "Here are four stocks with buy rank and strong momentum characteristics for investors to consider today, September 5th:",
    "Hanger Inc. (HNGR): This provider of orthotic and prosthetic patient care has a Zacks Rank #1 (Strong Buy) and witnessed the Zacks Consensus Estimate for its current year earnings increasing 3.6% over the last 60 days.",
    "Hanger Inc. price-consensus-chart | Hanger Inc. Quote",
    "Hanger's shares gained 19.6% over the last one month more than S&P 500's rise of 3.2%. The company possesses a  Momentum Score  of A.",
    "Hanger Inc. price | Hanger Inc. Quote",
    "NewMarket Corporation (NEU): This company that operates in the petroleum additives industry has a Zacks Rank #1 and witnessed the Zacks Consensus Estimate for its current year earnings increasing 10.4% over the last 60 days.",
    "NewMarket Corporation price-consensus-chart | NewMarket Corporation Quote",
    "NewMarket's shares gained 8.6% over the last one month. The company possesses a Momentum Score of B.",
    "NewMarket Corporation price | NewMarket Corporation Quote",
    "Agnico Eagle Mines Limited (AEM): This mining company has a Zacks Rank #2 (Buy) and witnessed the Zacks Consensus Estimate for its current year earnings increasing 56.9% over the last 60 days.",
    "Agnico Eagle Mines Limited price-consensus-chart | Agnico Eagle Mines Limited Quote",
    "Agnico Eagle Mines' shares gained 10% over the last one month. The company possesses a Momentum Score of B.",
    "Agnico Eagle Mines Limited price | Agnico Eagle Mines Limited Quote",
    "Genesis Healthcare, Inc. (GEN): This nursing and care services provider has a Zacks Rank #2 and witnessed the Zacks Consensus Estimate for its current year earnings increasing 37.8% over the last 60 days.",
    "Genesis Healthcare, Inc. price-consensus-chart | Genesis Healthcare, Inc. Quote",
    "Genesis Healthcare's shares gained 17.8% over the last one month. The company possesses a Momentum Score of A.",
    "Genesis Healthcare, Inc. price | Genesis Healthcare, Inc. Quote",
    "See the full list of top ranked stocks here",
    "Learn more about the Momentum score and how it is calculated here.",
    "It's Illegal in 42 States, But Investors Will Make Billions Legally",
    "In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    "That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:47:00"
}