{
  "url": "https://www.nasdaq.com/article/top-ranked-momentum-stocks-to-buy-for-september-3rd-cm1206806",
  "title": "Top Ranked Momentum Stocks to Buy for September 3rd - Nasdaq.com",
  "text": [
    "Here are four stocks with buy rank and strong momentum characteristics for investors to consider today, September 3rd:",
    "Fly Leasing Limited (FLY): This aircraft leasing investment company has a Zacks Rank #2 (Buy) and witnessed the Zacks Consensus Estimate for its current year earnings increasing 47.1% over the last 60 days.",
    "Fly Leasing Limited price-consensus-chart | Fly Leasing Limited Quote",
    "Fly Leasing's shares gained 24.9% over the last one month more than S&P 500's rise of 1.8%. The company possesses a  Momentum Score  of A.",
    "Fly Leasing Limited price | Fly Leasing Limited Quote",
    "Alliant Energy Corporation (LNT): This public utility holding company has a Zacks Rank #2 and witnessed the Zacks Consensus Estimate for its current year earnings increasing 0.4% over the last 60 days.",
    "Alliant Energy Corporation price-consensus-chart | Alliant Energy Corporation Quote",
    "Alliant Energy's shares gained 6.3% over the last one month. The company possesses a Momentum Score of B.",
    "Alliant Energy Corporation price | Alliant Energy Corporation Quote",
    "Ryman Hospitality Properties, Inc. (RHP ): This entertainment company has a Zacks Rank #2 and witnessed the Zacks Consensus Estimate for its current year earnings increasing 1.3% over the last 60 days.",
    "Ryman Hospitality Properties, Inc. price-consensus-chart | Ryman Hospitality Properties, Inc. Quote",
    "Ryman Hospitality Properties' shares gained 9.6% over the last one month. The company possesses a Momentum Score of B.",
    "Ryman Hospitality Properties, Inc. price | Ryman Hospitality Properties, Inc. Quote",
    "New York Mortgage Trust, Inc. (NYMT): This real estate investment trust company has a Zacks Rank #2 and witnessed the Zacks Consensus Estimate for its current year earnings increasing 12.5% over the last 60 days.",
    "New York Mortgage Trust, Inc. price-consensus-chart | New York Mortgage Trust, Inc. Quote",
    "New York Mortgage Trust's shares gained 3% over the last one month. The company possesses a Momentum Score of B.",
    "New York Mortgage Trust, Inc. price | New York Mortgage Trust, Inc. Quote",
    "See the full list of top ranked stocks here",
    "Learn more about the Momentum score and how it is calculated here.",
    "Legalizing THIS Could Be Even Bigger than Marijuana",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "See these 5 \"sin stocks\" now >>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:44:00"
}