{
  "url": "https://www.nasdaq.com/article/why-intelsat-stock-dropped-16-this-morning-cm1206878",
  "title": "Why Intelsat Stock Dropped 16% This Morning - Nasdaq.com",
  "text": [
    "This morning, without warning -- and without any news relating to the company specifically, it seems -- shares of satellite communications company Intelsat (NYSE: I) abruptly plunged 16%.",
    "The stock has since recovered somewhat, and as of 11:40 a.m. EDT, it's trading down \"only\" 7%. But that still leaves investors scratching their heads: Why did Intelsat stock fall in the first place?",
    "One guess: SpaceX.",
    "Image source: Getty Images.",
    "Four months ago, Elon Musk's SpaceX made headlines when it launched 60 of its new \"Starlink\" broadband internet satellites into orbit aboard one of its Falcon 9 reusable rockets. And over the Labor Day weekend, some new news broke: Judging from recent filings with the Federal Communications Commission, it appears that SpaceX is planning to launch as many as four more Starlink missions over the next four months.",
    "SpaceX eclipsed the size of Intelsat's 50-satellite constellation in one fell swoop in May. By the end of the year, it could have 300 satellites in orbit, which could be six times as many as Intelsat has. (Admittedly, Intelsat's sats are bigger, more complex, and offer wider coverage because they're in geostationary orbit and not in low Earth orbit -- but still, that's a lot of sats).",
    "And with SpaceX using its own rockets to launch -- its own reusable rockets, which it's already built and only needs to pay for the fuel to launch them -- SpaceX's cost of deploying these satellites can only be a fraction of what Intelsat has to pay to expand its network.",
    "In contrast, when Intelsat was building its own satellite constellation, it had to hire -- and pay -- SpaceX to launch them. Partly as a result, Intelsat is nearly $15 billion in debt, further hampering its ability to compete. While I can't say for certain that this is the scenario that has Intelsat investors spooked this morning, I'd say it's a pretty fair guess -- and maybe it's not only Intelsat investors who should be worried.",
    "10 stocks we like better than Intelsat\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Intelsat wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Rich Smith has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:23:00"
}