{
  "url": "https://www.nasdaq.com/article/fda-approval-of-roche-cancer-drug-confirms-beginning-of-new-oncology-era-cm1210595",
  "title": "FDA Approval of Roche Cancer Drug Confirms Beginning of New Oncology Era - Nasdaq.com",
  "text": [
    "   With nothing more than a passing glance, the U.S. Food &   Drug Administration's (FDA) approval of   Roche Holdings'    (OTC: RHHBY) cancer drug entrectinib last month was a   run-of-the-mill announcement. In fact, it was almost boilerplate   in its tone and feel. Greenlighting the drug, however, means that Roche has secured   more than just another profit center. Entrectinib also helps to   usher in an entirely new era of oncology. It's only the third   FDA-approved treatment to combat certain types of tumors,   regardless of where they're found in the body. Until now,   pharmaceutical companies effectively were required to pinpoint   where a tumor was being targeted in order to secure regulatory   approval.makeArticleAd(); In other words, with the third such therapy now in the books,   Roche may have made the idea of \"tissue agnostic\" tumor   treatments a new norm. Rozlytrek is a big fish in a little pond Technically speaking, it was Roche subsidiary Genentech that   was able to win the FDA's approval. Entrectinib is also only the   scientific name. The drug will also be marketed as Rozlytrek. The monikers are largely irrelevant though. The take-away for   investors is the FDA's recognition of a drug's versatility   regardless of a tumor's bodily location. To be clear, it's not a sweeping cure for any and all cancers.   Rozlytrek/entrectinib is still only meant to combat the 1% of all   tumors that indicate a neurotrophic tyrosine receptor kinase   (NTRK) gene fusion, or the mutation of genetic code which can   cause the development of abnormal proteins. These proteins, in   turn, can give rise to tumors.  .   Image source: Getty Images.  But, it's a therapy that effectively targets tumors which are   not only tough to treat, but more likely to metastasize. The NTRK   fusion is found decidedly more often in cases of cutaneous   squamous cell carcinomas, prostate and pancreatic cancers,   mesoblastic nephroma, and Spitz tumors, as well as other rare and   difficult-to-treat instances. These cancers are particularly more   prone than others to spread to the brain, irrespective of their   origin point. As for efficacy, the drug was found to have reduced tumor   size for several months in more than half of patients with   the NTRK mutation. Better still, it demonstrated that   effectiveness across ten different tumor types found in various   bodily locations. Solid proof of the concept All told, the NTRK mutation in tumors opens up a market that   Jeffries believes could lead Rozlytrek to peak annualized sales   of $700 million for Roche subsidiary Genentech. It's not a lot of money, nor will it come easy for Genentech.   It will be competing with a drug called Vitrakvi,   marketed by a joint venture    of   Bayer    (OTC: BAYRY) and Loxo Oncology, which takes aim at the same   neurotrophic tyrosine receptor kinase mutation. As a proof-of-concept, though, Rozlytrek's approval makes it   increasingly clear that a genetics-based approach to treating   tumors has become palatable to regulatory bodies, at least in the   United States. To that end, it's no mere coincidence that Roche opted late   last year to shell out another $2.4 billion to   acquire the remainder of Foundation Medicine it   didn't already own    . Foundation Medicine specializes in identifying the genetic   makeup of cancer patients as a means of identifying which   therapies would prove most effective for them. There is no   FDA-approved test for NTRK fusions yet, but Foundation Medicine   is moving in that direction. Such a test clearly would make   Rozlytrek a highly marketable follow-up option. Becoming a new norm for oncology drugs Unfortunately, Genentech's help in pushing the cancer rock a   little further up the hill doesn't make Roche any more of a buy   than it was before. It will still take years for the   genetics-based approach to supplant molecular and radiation-based   treatments. A true cancer cure-all also remains elusive and probably   always will. The disease is too complicated at its roots to be   addressed by a one-stop solution. Indeed, at its heart, all forms   of cancer are the result of damaged DNA the body can't repair on   its own. Genetic material is inherently complex stuff. Years of DNA sequencing and genome work are starting to pay   off, however. With   Merck    's (NYSE: MRK) Keytruda, Vitrakvi, and now Genentech's Rozlytrek   all winning the FDA's approval , the path toward more broad-based   cancer solutions is clear.  All three drugs target the   faulty genetic code of cancerous cells rather than targeting a   specific spot within a body. Investors who make buy and sell   decisions based on scientific developments will want to add the   term \"tissue agnostic\" to their lexicon.   %sfr%  10 stocks we like better than Roche Holding Ltd.   (ADR)     When investing geniuses David and Tom Gardner have a stock tip,   it can pay to listen. After all, the newsletter they have run for   over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks    for investors to buy right now... and Roche Holding Ltd. (ADR)   wasn't one of them! That's right -- they think these 10 stocks   are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       James Brumley      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "With nothing more than a passing glance, the U.S. Food &   Drug Administration's (FDA) approval of   Roche Holdings'    (OTC: RHHBY) cancer drug entrectinib last month was a   run-of-the-mill announcement. In fact, it was almost boilerplate   in its tone and feel.",
    "Greenlighting the drug, however, means that Roche has secured   more than just another profit center. Entrectinib also helps to   usher in an entirely new era of oncology. It's only the third   FDA-approved treatment to combat certain types of tumors,   regardless of where they're found in the body. Until now,   pharmaceutical companies effectively were required to pinpoint   where a tumor was being targeted in order to secure regulatory   approval.",
    "In other words, with the third such therapy now in the books,   Roche may have made the idea of \"tissue agnostic\" tumor   treatments a new norm.",
    "Technically speaking, it was Roche subsidiary Genentech that   was able to win the FDA's approval. Entrectinib is also only the   scientific name. The drug will also be marketed as Rozlytrek.",
    "The monikers are largely irrelevant though. The take-away for   investors is the FDA's recognition of a drug's versatility   regardless of a tumor's bodily location.",
    "To be clear, it's not a sweeping cure for any and all cancers.   Rozlytrek/entrectinib is still only meant to combat the 1% of all   tumors that indicate a neurotrophic tyrosine receptor kinase   (NTRK) gene fusion, or the mutation of genetic code which can   cause the development of abnormal proteins. These proteins, in   turn, can give rise to tumors.  .",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "But, it's a therapy that effectively targets tumors which are   not only tough to treat, but more likely to metastasize. The NTRK   fusion is found decidedly more often in cases of cutaneous   squamous cell carcinomas, prostate and pancreatic cancers,   mesoblastic nephroma, and Spitz tumors, as well as other rare and   difficult-to-treat instances. These cancers are particularly more   prone than others to spread to the brain, irrespective of their   origin point.",
    "As for efficacy, the drug was found to have reduced tumor   size for several months in more than half of patients with   the NTRK mutation. Better still, it demonstrated that   effectiveness across ten different tumor types found in various   bodily locations.",
    "All told, the NTRK mutation in tumors opens up a market that   Jeffries believes could lead Rozlytrek to peak annualized sales   of $700 million for Roche subsidiary Genentech.",
    "It's not a lot of money, nor will it come easy for Genentech.   It will be competing with a drug called Vitrakvi,   marketed by a joint venture    of   Bayer    (OTC: BAYRY) and Loxo Oncology, which takes aim at the same   neurotrophic tyrosine receptor kinase mutation.",
    "As a proof-of-concept, though, Rozlytrek's approval makes it   increasingly clear that a genetics-based approach to treating   tumors has become palatable to regulatory bodies, at least in the   United States.",
    "To that end, it's no mere coincidence that Roche opted late   last year to shell out another $2.4 billion to   acquire the remainder of Foundation Medicine it   didn't already own    . Foundation Medicine specializes in identifying the genetic   makeup of cancer patients as a means of identifying which   therapies would prove most effective for them. There is no   FDA-approved test for NTRK fusions yet, but Foundation Medicine   is moving in that direction. Such a test clearly would make   Rozlytrek a highly marketable follow-up option.",
    "Unfortunately, Genentech's help in pushing the cancer rock a   little further up the hill doesn't make Roche any more of a buy   than it was before. It will still take years for the   genetics-based approach to supplant molecular and radiation-based   treatments.",
    "A true cancer cure-all also remains elusive and probably   always will. The disease is too complicated at its roots to be   addressed by a one-stop solution. Indeed, at its heart, all forms   of cancer are the result of damaged DNA the body can't repair on   its own. Genetic material is inherently complex stuff.",
    "Years of DNA sequencing and genome work are starting to pay   off, however. With   Merck    's (NYSE: MRK) Keytruda, Vitrakvi, and now Genentech's Rozlytrek   all winning the FDA's approval , the path toward more broad-based   cancer solutions is clear.  All three drugs target the   faulty genetic code of cancerous cells rather than targeting a   specific spot within a body. Investors who make buy and sell   decisions based on scientific developments will want to add the   term \"tissue agnostic\" to their lexicon.",
    "%sfr%",
    " 10 stocks we like better than Roche Holding Ltd.   (ADR)     When investing geniuses David and Tom Gardner have a stock tip,   it can pay to listen. After all, the newsletter they have run for   over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks    for investors to buy right now... and Roche Holding Ltd. (ADR)   wasn't one of them! That's right -- they think these 10 stocks   are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  James Brumley      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:03:00"
}