{
  "url": "https://www.nasdaq.com/article/kkr-to-sell-or-float-german-defence-supplier-hensoldt-20190905-00331",
  "title": "KKR to sell or float German defence supplier Hensoldt - Nasdaq.com",
  "text": [
    "By Arno Schuetze and Sabine Siebold",
    "FRANKFURT/BERLIN, Sept 5 (Reuters) - Private equity firm KKR  is preparing for a stock market flotation or sale of German defence supplier Hensoldt in a potential 2 billion euro ($2.2 billion) deal, people close to the matter said.",
    "The buyout group has in recent weeks listened to bankers present options for exiting its investment, including a listing of 20-30% on the stock exchange or a sale to a defence group or private equity business next year, they said, adding KKR was  expected to hire an adviser soon to help arrange a deal.",
    "The investor bought Airbus's  defence electronics business for 1.1 billion euros in 2016 and later rebranded it Hensoldt, naming it after a 19th century German maker of binoculars and telescopes.",
    "The business comprises military sensors, electronic warfare equipment, avionics and optronics. It employs 4,400 staff and has annual sales of 1.1 billion euros.",
    "Hensoldt has said it intends to double its revenues by 2022, benefiting from an expected European military spending spree.",
    "Hensoldt's high-tech cameras are used in products including  Tornado fighter jets that fly surveillance missions over Syria and Iraq, while it also supplies radars for Eurofighter jets as well as periscopes for submarines and Leopard and Puma tanks.",
    "The company also supplies identification systems for combat jets, night vision devices, radars for civil air traffic control and systems for civil and military efforts to counter drones.",
    "Hensoldt is set to benefit from equipping the new Franco-German fighter jet, currently Europe's largest defence project, which will replace Eurofighter and Rafale jets from 2040.",
    "The group is also expected to pitch for contracts to supply the German navy's new multi-purpose combat ship 180 and the German army's new missile defence system."
  ],
  "published_datetime": "2019-09-05 07:24:00"
}