{
  "url": "https://www.nasdaq.com/article/dr-horton-dhi-is-an-incredible-growth-stock-3-reasons-why-cm1210330",
  "title": "D.R. Horton (DHI) is an Incredible Growth Stock: 3 Reasons Why - Nasdaq.com",
  "text": [
    " Growth investors focus on stocks that are seeing above-average financial growth, as this feature helps these securities garner the market's attention and deliver solid returns. But finding a great growth stock is not easy at all. By their very nature, these stocks carry above-average risk and volatility. Moreover, if a company's growth story is over or nearing its end, betting on it could lead to significant loss. However, the Zacks Growth Style Score (part of the Zacks Style Scores  system), which looks beyond the traditional growth attributes to analyze a company's real growth prospects, makes it pretty easy to find cutting-edge growth stocks. Our proprietary system currently recommends D.R. Horton (DHI) as one such stock. This company not only has a favorable Growth Score, but also carries a top Zacks Rank. Studies have shown that stocks with the best growth features consistently outperform the market. And returns are even better for stocks that possess the combination of a Growth Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 (Buy). Here are three of the most important factors that make the stock of this homebuilder a great growth pick right now.  Earnings Growth  Arguably nothing is more important than earnings growth, as surging profit levels is what most investors are after. And for growth investors, double-digi t earnings  growth is definitely preferable, and often an indication of strong prospects (and stock price gains) for the company under consideration. While the historical EPS growth rate for D.R. Horton is 25.2%, investors should actually focus on the projected growth. The company's EPS is expected to grow 2.2% this year, crushing the industry average, which calls for EPS growth of -3.8%.  Impressive Asset Utilization Ratio  Growth investors often overlook asset utilization ratio, also known as sales-to-total-assets (S/TA) ratio, but it is an important feature of a real growth stock. This metric shows how efficiently a firm is utilizing its assets to generate sales. Right now, D.R. Horton has an S/TA ratio of 1.16, which means that the company gets $1.16 in sales for each dollar in assets. Comparing this to the industry average of 0.99, it can be said that the company is more efficient. While the level of efficiency in generating sales matters a lot, so does the sales growth of a company. And D.R. Horton looks attractive from a sales growth perspective as well. The company's sales are expected to grow 8% this year versus the industry average of 0%.  Promising Earnings Estimate Revisions  Superiority of a stock in terms of the metrics outlined above can be further validated by looking at the trend in earnings estimate revisions. A positive trend is of course favorable here. Empirical research shows that there is a strong correlation between trends in earnings estimate revisions and near-term stock price movements. The current-year earnings estimates for D.R. Horton have been revising upward. The Zacks Consensus Estimate for the current year has surged 0.4% over the past month.  Bottom Line  While the overall earnings estimate revisions have made D.R. Horton a Zacks Rank #2 stock, it has earned itself a Growth Score of A based on a number of factors, including the ones discussed above. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  . This combination indicates that D.R. Horton is a potential outperformer and a solid choice for growth investors.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  D.R. Horton, Inc. (DHI): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Growth investors focus on stocks that are seeing above-average financial growth, as this feature helps these securities garner the market's attention and deliver solid returns. But finding a great growth stock is not easy at all.",
    "By their very nature, these stocks carry above-average risk and volatility. Moreover, if a company's growth story is over or nearing its end, betting on it could lead to significant loss.",
    "However, the Zacks Growth Style Score (part of the Zacks Style Scores  system), which looks beyond the traditional growth attributes to analyze a company's real growth prospects, makes it pretty easy to find cutting-edge growth stocks.",
    "Our proprietary system currently recommends D.R. Horton (DHI) as one such stock. This company not only has a favorable Growth Score, but also carries a top Zacks Rank.",
    "Studies have shown that stocks with the best growth features consistently outperform the market. And returns are even better for stocks that possess the combination of a Growth Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 (Buy).",
    "Here are three of the most important factors that make the stock of this homebuilder a great growth pick right now.",
    " Earnings Growth ",
    "Arguably nothing is more important than earnings growth, as surging profit levels is what most investors are after. And for growth investors, double-digi t earnings  growth is definitely preferable, and often an indication of strong prospects (and stock price gains) for the company under consideration.",
    "While the historical EPS growth rate for D.R. Horton is 25.2%, investors should actually focus on the projected growth. The company's EPS is expected to grow 2.2% this year, crushing the industry average, which calls for EPS growth of -3.8%.",
    " Impressive Asset Utilization Ratio ",
    "Growth investors often overlook asset utilization ratio, also known as sales-to-total-assets (S/TA) ratio, but it is an important feature of a real growth stock. This metric shows how efficiently a firm is utilizing its assets to generate sales.",
    "Right now, D.R. Horton has an S/TA ratio of 1.16, which means that the company gets $1.16 in sales for each dollar in assets. Comparing this to the industry average of 0.99, it can be said that the company is more efficient.",
    "While the level of efficiency in generating sales matters a lot, so does the sales growth of a company. And D.R. Horton looks attractive from a sales growth perspective as well. The company's sales are expected to grow 8% this year versus the industry average of 0%.",
    " Promising Earnings Estimate Revisions ",
    "Superiority of a stock in terms of the metrics outlined above can be further validated by looking at the trend in earnings estimate revisions. A positive trend is of course favorable here. Empirical research shows that there is a strong correlation between trends in earnings estimate revisions and near-term stock price movements.",
    "The current-year earnings estimates for D.R. Horton have been revising upward. The Zacks Consensus Estimate for the current year has surged 0.4% over the past month.",
    " Bottom Line ",
    "While the overall earnings estimate revisions have made D.R. Horton a Zacks Rank #2 stock, it has earned itself a Growth Score of A based on a number of factors, including the ones discussed above.",
    "You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .",
    "This combination indicates that D.R. Horton is a potential outperformer and a solid choice for growth investors.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:45:04"
}