{
  "url": "https://www.nasdaq.com/article/activist-investor-driver-management-presses-anew-for-first-united-bank-to-sell-itself-20190904-01170",
  "title": "Activist investor Driver Management presses anew for First United Bank to sell itself - Nasdaq.com",
  "text": [
    "By Jessica DiNapoli",
    "Sept 4 (Reuters) - Driver Management Company LLC, an activist investor focused on U.S. banks, renewed calls on Wednesday for First United Corp , the holding company for Maryland community bank First United Bank & Trust, to sell itself.",
    "First United's shares have traded at a significant discount to its regional banking peers, and the company has fallen behind its competitors in making new loans, according to a letter Driver sent to the bank's board of directors.",
    "\"Some members have been on the board 25 years,\" Driver founder Abbott Cooper said in an interview. \"It's a fun club, there's a lot of prestige being a director at a bank in a small community. But, no one is (saying) 'Hey, what's going on with the stock?' They have all the perks of being a public company without responsibility.\"",
    "First United Bank did not immediately respond to a request for comment.",
    "Ahead of the bank's annual meeting earlier this year, Driver had also called for it to sell itself. Driver had a much smaller stake in First United at that time. It is now the bank's third largest shareholder with a more than 5% stake.",
    "Driver has had meetings with First United's board over the past several months but found it was not receptive to its suggestions, according to the letter. The investor thinks the bank's shares, now trading around $21, could fetch $26 to $33 in a sale, according to the letter.",
    "Cooper said in the interview that without significant changes to its business, First United was unlikely to reach that valuation absent a sale.",
    "The activist is urging that First United hire financial advisers to help the bank find a buyer."
  ],
  "published_datetime": "2019-09-04 06:34:00"
}