{
  "url": "https://www.nasdaq.com/article/consumer-sector-update-for-09032019-afyaconnsnapsono-cm1206900",
  "title": "Consumer Sector Update for 09/03/2019: AFYA,CONN,SNAP,SONO - Nasdaq.com",
  "text": [
    "Top Consumer Stocks",
    "WMT +0.29%",
    "MCD -0.46%",
    "DIS -1.24%",
    "CVS -0.48%",
    "KO +0.07%",
    "Consumer stocks were broadly mixed in late trade, with shares of consumer staples companies in the S&P 500 climbing nearly 0.3% this afternoon while shares of consumer discretionary firms in the S&P 500 were slipping almost 0.7%.",
    "Among consumer stocks moving on news:",
    "(+) Afya Ltd ( AFYA  ) climbed over 10% on Tuesday after the Brazilian for-profit educator said it was expecting between BRL415 million to BRL430 million in revenue during the second half of its FY19 ending Dec. 31, increasing its overall revenue this year to a range of BRL817 million to BRL832 million when coupled with its Q1 and Q2 results and easily beating the Capital IQ consensus looking for around $747.3 million in annual revenue.",
    "In other sector news:",
    "(+) Conn's ( CONN  ) raced more than 18% higher after the retailer Tuesday reported non-GAAP Q2 net income of $0.62 per share, improving on its $0.57 per share adjusted profit during the same quarter last year and exceeding the Capital IQ consensus for the three months ended July 31 by $0.11 per share. Net sales grew 4.3% over year-ago levels to $401.1 million, also beating the $398.1 million analyst mean.",
    "(+) Snap ( SNAP  ) was narrowly higher in late trade, giving back most of a prior 3.6% gain after Evercore raised its stock rating for the photo- and video-sharing website to outperform compared with its in-line call previously.",
    "(-) Sonos ( SONO  ) was declining this afternoon, falling 1.4%. The consumer electronics seller Tuesday authorized the repurchase of up to $50 million of its common stock through a new stock buyback program. The company had around $298.5 million in net cash at the end of its most recent fiscal period.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-03 15:30:04"
}