{
  "url": "https://www.nasdaq.com/article/why-is-zoetis-zts-up-55-since-last-earnings-report-cm1208007",
  "title": "Why Is Zoetis (ZTS) Up 5.5% Since Last Earnings Report? - Nasdaq.com",
  "text": [
    " A month has gone by since the las t earnings  report for Zoetis (ZTS). Shares have added about 5.5% in that time frame, outperforming the S&P 500. Will the recent positive trend continue leading up to its next earnings release, or is Zoetis due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important drivers.  Zoetis Beats on Earnings in Q2, Lifts 2019   Guidance  Zoetis posted second-quarter 2019 adjusted earnings of 90 cents per share (excluding one-time items), which not only increased 16.9% year over year from 77 cents but also beat the Zacks Consensus Estimate of 82 cents. Total revenues rose 9% year over year to $1.55 billion and exceeded the Zacks Consensus Estimate of $1.52 billion as well.  Quarterly Highlights  The company reports business results under two geographical operating segments, namely the United States and International. It has a diverse portfolio of products for livestock and companion animals. Revenues from the United States segment increased 15% year over year to $780 million. Moreover, sales of companion animal products in this region were up 23%, primarily owing to higher sales of the dermatology portfolio, the acquisition of Abaxis and a host of in-line products including Simparica, Clavamox, Cerenia and ProHeart. Further, sales of livestock products grew 3% in the quarter, driven mainly by poultry products from increased sales of alternatives to antibiotics in the medicated feed additives. Meanwhile, promotional activity resulted in modest growth in the swine portfolio. Revenues at the International segment inched up 2% year over year on a reported basis (up 7% operationally) to $742 million. On the contrary, livestock sales declined 4% (up 4% operationally) in the quarter. However, growth in the poultry portfolio was aided by higher sales of vaccines and medicated feed additives. Cattle product sales increased on the back of a  favorable comparison with the prior year, which bore the brunt of a national trucking strike in Brazil. Sales of swine products were flat with the prior-year figure while growth in vaccines including new products was offset by the adverse impact of the ongoing African Swine Fever in China. Moreover, sales of companion animal products grew 12% on a reported basis, reflecting sales rise in the dermatology portfolio and parasiticides including Simparica and Stronghold Plus. The acquisition of Abaxis also fueled growth.  2019 Outlook  The company raised its guidance for the full year. It expects adjusted earnings of $3.53-$3.60, up from the previous expectation of $3.42-$3.52 per share. Revenues are expected to be $6.175-$6.275 billion, up from the prior projection of $6.100-$6.225 billion. The guidance reflects the current strength and performance of the company's business. Plus, it mirrors the foreign exchange rates in late July.  Other Updates  In July 2019, Zoetis received a positive opinion from the European Medicines Agency's Committee for Medicinal Products for Veterinary Use (CVMP) on its three-way combination parasiticide for dogs. An approval from the European Commission is expected later this year. Regulatory reviews are also underway in the United States, Canada, Australia, Brazil and Japan with further submissions expected in China and Mexico during 2019. If approved, Zoetis expects to launch the product across Europe and the United States in 2020. The company received the FDA nod for ProHeart 12 (moxidectin), the industry's only once-yearly injection, to prevent heartworm disease in dogs aged 12 months and above. In the second quarter, Zoetis expanded its Fostera swine vaccine franchise with the approvals of different formulations across new geographies. Fostera Gold PCV MH was approved in Brazil while Fostera PCV, a single-dose vaccine that aids in the prevention of PCV2, was approved in China. Earlier, the company announced plans to acquire Platinum Performance, a privately held, nutrition-focused animal heath company. Platinum's premium nutritional product formulas and a unique approach to the field of scientific wellness for horses, dogs and cats will further boost and diversify Zoetis' portfolio in the equine and petcare markets. The buyout is expected to close in the third quarter of 2019.     How Have Estimates Been Moving Since Then?  It turns out, fresh estimates flatlined during the past month.  VGM Scores  At this time, Zoetis has a nice Growth Score of B, though it is lagging a bit on the Momentum Score front with a C. Following the exact same course, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy. Overall, the stock has an aggregate VGM Score of C. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Zoetis has a Zacks Rank #2 (Buy). We expect an above average return from the stock in the next few months.   makeArticleAd();  Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Zoetis Inc. (ZTS): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "A month has gone by since the las t earnings  report for Zoetis (ZTS). Shares have added about 5.5% in that time frame, outperforming the S&P 500.",
    "Will the recent positive trend continue leading up to its next earnings release, or is Zoetis due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important drivers.  Zoetis Beats on Earnings in Q2, Lifts 2019   Guidance  Zoetis posted second-quarter 2019 adjusted earnings of 90 cents per share (excluding one-time items), which not only increased 16.9% year over year from 77 cents but also beat the Zacks Consensus Estimate of 82 cents. Total revenues rose 9% year over year to $1.55 billion and exceeded the Zacks Consensus Estimate of $1.52 billion as well.  Quarterly Highlights  The company reports business results under two geographical operating segments, namely the United States and International. It has a diverse portfolio of products for livestock and companion animals. Revenues from the United States segment increased 15% year over year to $780 million. Moreover, sales of companion animal products in this region were up 23%, primarily owing to higher sales of the dermatology portfolio, the acquisition of Abaxis and a host of in-line products including Simparica, Clavamox, Cerenia and ProHeart. Further, sales of livestock products grew 3% in the quarter, driven mainly by poultry products from increased sales of alternatives to antibiotics in the medicated feed additives. Meanwhile, promotional activity resulted in modest growth in the swine portfolio. Revenues at the International segment inched up 2% year over year on a reported basis (up 7% operationally) to $742 million. On the contrary, livestock sales declined 4% (up 4% operationally) in the quarter. However, growth in the poultry portfolio was aided by higher sales of vaccines and medicated feed additives. Cattle product sales increased on the back of a  favorable comparison with the prior year, which bore the brunt of a national trucking strike in Brazil. Sales of swine products were flat with the prior-year figure while growth in vaccines including new products was offset by the adverse impact of the ongoing African Swine Fever in China. Moreover, sales of companion animal products grew 12% on a reported basis, reflecting sales rise in the dermatology portfolio and parasiticides including Simparica and Stronghold Plus. The acquisition of Abaxis also fueled growth.  2019 Outlook  The company raised its guidance for the full year. It expects adjusted earnings of $3.53-$3.60, up from the previous expectation of $3.42-$3.52 per share. Revenues are expected to be $6.175-$6.275 billion, up from the prior projection of $6.100-$6.225 billion. The guidance reflects the current strength and performance of the company's business. Plus, it mirrors the foreign exchange rates in late July.  Other Updates  In July 2019, Zoetis received a positive opinion from the European Medicines Agency's Committee for Medicinal Products for Veterinary Use (CVMP) on its three-way combination parasiticide for dogs. An approval from the European Commission is expected later this year. Regulatory reviews are also underway in the United States, Canada, Australia, Brazil and Japan with further submissions expected in China and Mexico during 2019. If approved, Zoetis expects to launch the product across Europe and the United States in 2020. The company received the FDA nod for ProHeart 12 (moxidectin), the industry's only once-yearly injection, to prevent heartworm disease in dogs aged 12 months and above. In the second quarter, Zoetis expanded its Fostera swine vaccine franchise with the approvals of different formulations across new geographies. Fostera Gold PCV MH was approved in Brazil while Fostera PCV, a single-dose vaccine that aids in the prevention of PCV2, was approved in China. Earlier, the company announced plans to acquire Platinum Performance, a privately held, nutrition-focused animal heath company. Platinum's premium nutritional product formulas and a unique approach to the field of scientific wellness for horses, dogs and cats will further boost and diversify Zoetis' portfolio in the equine and petcare markets. The buyout is expected to close in the third quarter of 2019.   ",
    " Zoetis Beats on Earnings in Q2, Lifts 2019   Guidance ",
    "Zoetis posted second-quarter 2019 adjusted earnings of 90 cents per share (excluding one-time items), which not only increased 16.9% year over year from 77 cents but also beat the Zacks Consensus Estimate of 82 cents.",
    "Total revenues rose 9% year over year to $1.55 billion and exceeded the Zacks Consensus Estimate of $1.52 billion as well.",
    " Quarterly Highlights ",
    "The company reports business results under two geographical operating segments, namely the United States and International. It has a diverse portfolio of products for livestock and companion animals.",
    "Revenues from the United States segment increased 15% year over year to $780 million. Moreover, sales of companion animal products in this region were up 23%, primarily owing to higher sales of the dermatology portfolio, the acquisition of Abaxis and a host of in-line products including Simparica, Clavamox, Cerenia and ProHeart. Further, sales of livestock products grew 3% in the quarter, driven mainly by poultry products from increased sales of alternatives to antibiotics in the medicated feed additives. Meanwhile, promotional activity resulted in modest growth in the swine portfolio.",
    "Revenues at the International segment inched up 2% year over year on a reported basis (up 7% operationally) to $742 million. On the contrary, livestock sales declined 4% (up 4% operationally) in the quarter. However, growth in the poultry portfolio was aided by higher sales of vaccines and medicated feed additives. Cattle product sales increased on the back of a  favorable comparison with the prior year, which bore the brunt of a national trucking strike in Brazil. Sales of swine products were flat with the prior-year figure while growth in vaccines including new products was offset by the adverse impact of the ongoing African Swine Fever in China.",
    "Moreover, sales of companion animal products grew 12% on a reported basis, reflecting sales rise in the dermatology portfolio and parasiticides including Simparica and Stronghold Plus. The acquisition of Abaxis also fueled growth.",
    " 2019 Outlook ",
    "The company raised its guidance for the full year. It expects adjusted earnings of $3.53-$3.60, up from the previous expectation of $3.42-$3.52 per share. Revenues are expected to be $6.175-$6.275 billion, up from the prior projection of $6.100-$6.225 billion.",
    "The guidance reflects the current strength and performance of the company's business. Plus, it mirrors the foreign exchange rates in late July.",
    " Other Updates ",
    "In July 2019, Zoetis received a positive opinion from the European Medicines Agency's Committee for Medicinal Products for Veterinary Use (CVMP) on its three-way combination parasiticide for dogs. An approval from the European Commission is expected later this year. Regulatory reviews are also underway in the United States, Canada, Australia, Brazil and Japan with further submissions expected in China and Mexico during 2019. If approved, Zoetis expects to launch the product across Europe and the United States in 2020.",
    "The company received the FDA nod for ProHeart 12 (moxidectin), the industry's only once-yearly injection, to prevent heartworm disease in dogs aged 12 months and above.",
    "In the second quarter, Zoetis expanded its Fostera swine vaccine franchise with the approvals of different formulations across new geographies. Fostera Gold PCV MH was approved in Brazil while Fostera PCV, a single-dose vaccine that aids in the prevention of PCV2, was approved in China.",
    "Earlier, the company announced plans to acquire Platinum Performance, a privately held, nutrition-focused animal heath company. Platinum's premium nutritional product formulas and a unique approach to the field of scientific wellness for horses, dogs and cats will further boost and diversify Zoetis' portfolio in the equine and petcare markets. The buyout is expected to close in the third quarter of 2019.  ",
    " How Have Estimates Been Moving Since Then? ",
    "It turns out, fresh estimates flatlined during the past month.",
    " VGM Scores ",
    "At this time, Zoetis has a nice Growth Score of B, though it is lagging a bit on the Momentum Score front with a C. Following the exact same course, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of C. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Zoetis has a Zacks Rank #2 (Buy). We expect an above average return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:31:35"
}