{
  "url": "https://www.nasdaq.com/article/7-well-positioned-oil-stocks-in-todays-trading-environment-cm1207605",
  "title": "7 Well-Positioned Oil Stocks in Today’s Trading Environment - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Thanks to a seemingly endless supply of oil coming from the Permian Basin of Texas and other places, oil and gas prices, and often oil stocks, have struggled to gain traction. While the price of crude oil remains above $50 per barrel, natural gas prices have fallen below $2.50 per 1000 British thermal units (BTUs).",
    "The companies hurt the most are the exploration & production (E&P), or \"upstream\" firms, which depend most heavily on high oil prices. Since all they do is drill and sell raw product, revenues move up and down with market prices. However, low prices do not necessarily make life easy for the \"midstream\" companies who transport oil and gas or the \"downstream\" firms who must refine and sell. Hence, oil stocks in general have suffered as they continue to overproduce.",
    "However, such conditions have created buying opportunities in many oil stocks. For those with an eye for bargains and the courage to speculate like an oil driller, some investors will set themselves up for a gusher of profits long-term. These stocks to buy could lead investors to such a windfall.",
    "Brookfield Infrastructure (NYSE: BIP ) has become one of the more diversified oil stocks, in this case, diversified by industry. It invests in what it calls the \"backbone of today's global economy.\"",
    "The company's assets go well beyond pipelines. It also owns transport assets for utilities, energy, transportation, and data. They own assets spread across the globe, keeping them diversified by both industry and geography.",
    "In the past, the company had grown by acquisition. Now, it continues to churn assets to buy assets it believes will produce higher returns. It also wants to focus more on organic growth.",
    "At a forward price-to-earnings (PE) ratio of almost 28.7, it might appear expensive. However, this is also a company expected to generate an earnings growth rate of 159.3% this year. Admittedly, the emphasis on organic growth will slow that down in future years. However, that slower growth will bring cash flows, which should fuel the dividend higher.",
    "Aside from a years-long pattern of slow but steady price growth, the dividend also makes BIP stock a lucrative choice. Its annual payout of $2.01 per share yield around 4.28%. The company has also hiked this payout for nine consecutive years. With this generous dividend and the ever-increasing dependence on these pipeline transport, BIP should continue as a reliable source of stock price growth and cash flow.",
    "Arguably, no company defines technological change for oil stocks more than Cheniere (NYSEAMERICAN: LNG ). Their growing network of export terminals turned natural gas exports from a hemispheric to a global industry.",
    "Many call the U.S. the \"Saudi Arabia of natural gas.\" Thanks mostly to Cheniere, America's abundant natural gas supplies can now reach the world. Natural gas prices in the European Union had often reached levels three times higher than in the U.S. Now in Europe, natural gas trades for around $3.60 per 1000 BTUs. One year ago, that price had crossed the $9.50 per 1000 BTUs level. Access to natural gas from North America played a significant role in this decline.",
    "Despite this improvement, LNG stock has struggled for years. Today, the forward PE ratio stands at about 19.6. This is due to falling profits for the year. However, next year, Wall Street expects a turnaround. Analysts forecast a 90.9% earnings increase for fiscal 2020. They also foresee profit growth averaging 29.3% per year over the next five years. As Cheniere helps to bring low-priced natural gas to the rest of the world, it should finally return LNG stock to a pattern of growth.",
    "In an environment of falling prices, large oil stocks such as Chevron (NYSE: CVX ) tend to stand out. Chevron is one of the larger and more diversified oil stocks. While lower oil prices hurt the bottom line, they also operate midstream and downstream segments than can still deliver profits.",
    "For one, its 33-year string of annual dividend increases shows the company can produce returns in just about any price point for oil. The current payout of $4.76 per share provides a return of just over 4%. Moreover, the forward PE ratio of 14 remains well below the average multiple of 30 it maintained over the previous five years.",
    "Admittedly, if not for the dividend, CVX stock would make much fewer stocks to buy lists. It has seen no net price growth over the last five years. Also, losing its bid to buy Anadarko Petroleum (NYSE: APC ) to Occidental Petroleum (NYSE: OXY ) caused further frustration.",
    "Even though it operates in green-focused California, almost all of the world, California included, remains heavily dependent on fossil fuels. At some point, energy prices will turn around. When that happens, CVX stock will follow its peers higher. Chevron will serve those investors well who want to collect dividends now and reap stock price growth later.",
    "Few oil stocks have suffered as much as Canadian driller Encana (NYSE: ECA ). Encana traded near the $100 per share level as late as 2008. However, the financial crisis began a slide that even the 2013-2014 boom in oil prices could not stem. By 2015, it had fallen below $10 per share. With natural gas prices depressed, it now trades at around $4.50 per share.",
    "ECA stock has become risky. Profit growth will likely fall this year, and it will probably register modest growth. Moreover, due to the massive declines over the years, the market cap has fallen to $6 billion. That appears dangerous for a company that holds about $8.3 billion in long-term debt.",
    "However, the tide for ECA stock could finally turn soon. Despite industry conditions, Wall Street expects the company to deliver its third consecutive annual profit this year. Moreover, analysts forecast average growth of 37.7% per year over the next five years. Investors who purchase now will buy this growth at around 5.9 times forward earnings. As a burgeoning natural gas export industry helps to foster a recovery, it could easily take ECA stock with it.",
    "Much like the aforementioned case for Chevron, ExxonMobil (NYSE: XOM ) serves as one of the safer oil stocks in the current price environment. XOM operates in all segments of the oil and gas industry. As such, their diversification insulates the equity from wild oil price fluctuations. Although higher energy prices help, XOM stock tends to remain profitable even when it struggles to gain pricing power.",
    "No other metric reflects this underlying strength better than the dividend. The XOM payout has risen for 36 consecutive years, and in that time, oil prices have not fallen low enough to stop this payout. At $3.48 per share, stockholders receive a return of just over 5% from the payout alone.",
    "To be sure, the price of XOM stock has seen a steady decline. However, fundamentals may turn that around soon. It currently supports a forward PE ratio of just under 14.5. That multiple has averaged 21.9 over the last five years. Moreover, analysts expect the 29.9% profit decline this year to turn into a 38% increase next year. They also forecast average growth at or near double-digit levels in future years.",
    "At its current level, XOM stock will not make anyone rich. However, it looks well-positioned to both keep investors wealthy and provide a little cash flow.",
    "Liberty (NYSE: LBRT ) provides hydraulic fracturing and other engineering services that enhance well production. It operates in some of the hottest fields including the Permian Basin, the Eagle Ford Shale, the Williston Basin, and several others.",
    "The company has existed since 2011. It is also one of the newer oil stocks, as it began trading in January 2018. LBRT debuted strong when it first opened at $17 per share. It briefly spiked as high as $23.51 per share later that year. Unfortunately, falling prices have weighed on the stock over the last year, and it now trades at around $10.75 per share.",
    "Wall Street expects profits to fall by 32.8% this year. The company has responded by slowing expansion and improving efficiency and utilization.",
    "Consequently, they also predict earnings will reverse course next year and increase by 10.6%. They also think it will lead to an average growth rate of 37% per year over the next five years. Right now, investors can buy this growth for about eight times forward earnings. Moreover, debt levels remain but manageable and modest compared with peers. Once the industry sees price recovery, LBRT stock should see a disproportionate benefit.",
    "Phillips 66 (NYSE: PSX ) operates as a midstream oil and gas company, who also operates in the chemicals, refining, and marketing industries. Like many oil stocks, it has fallen over the last year along with oil and gas prices.",
    "However, this has also left PSX stock trading at just under 9.5 times forward earnings. Moreover, Wall Street forecasts that profits will rebound in fiscal 2020, growing by 31.9%. This expansion should continue as the company adds both storage and pipeline capacity, especially in the Permian Basin, Oklahoma, and along the Texas Gulf Coast. New petrochemical facilities in both Texas and Qatar should also enhance that growth.",
    "Investors can also benefit from a stable dividend. The payout, now at $3.60 per share, yields 3.65%. Moreover, this payout has increased for seven years. Even the massive decline during the 2014-2016 oil price bust did not stop dividend increases. Hence, the price decreases the industry sees now should not stop payout increases.",
    "PSX stock may languish in the near term due to a lack of traction on oil and gas prices. However, as the industry recovers, Phillips 66 will continue to play a crucial and more significant role in bringing oil and gas to market.",
    "As of this writing, Will Healy did not hold a position in any of the aforementioned stocks. You canfollow Will on Twitterat @HealyWriting .",
    "The post 7 Well-Positioned Oil Stocks in Today's Trading Environment appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:16:07"
}