{
  "url": "https://www.nasdaq.com/article/latam-stocks-buoyed-by-stimulus-hopes-trade-optimism-20190911-00701",
  "title": "Latam stocks buoyed by stimulus hopes, trade optimism - Nasdaq.com",
  "text": [
    "By Ambar Warrick",
    "Sept 11 (Reuters) - Most Latin American stocks rose on Wednesday as the prospect of increased stimulus for major economies and positive cues from the Sino-U.S. trade front aided risk appetite, while currencies were mixed ahead of the European Central Bank's policy decision.",
    "MSCI's index of Latin American stocks  rose 1.3%, holding near a one-month high, mirroring gains across global stock markets. MKTS/GLOB",
    "Markets also awaited the European Central Bank's monetary policy meeting on Thursday, where officials are widely expected to trim interest rates and introduce a stimulus package to shore up economic growth.",
    "Brazilian stocks  firmed about 0.5%, with most support coming from consumer discretionary stocks after data showed that retail sales for July marked their best rise this year. ",
    "Retailers Lojas Renner SA  and Magazine Luiza SA  rose about 2.5% and 4.6%, respectively, and were among the biggest boosts to the Bovespa.",
    "Chilean stocks  rose about 1.6% to a more than one-month high as the country's equities continued to recover from a 2-1/2 year low in late-August.",
    "Mexican  and Colombian  equities added about 0.1% and 0.6%, respectively.",
    "Mexico's government will give state-owned Pemex $5 billion so the world's most indebted oil company can pay off bonds, the company said earlier in the day. ",
    "Latin American currencies were mixed against a stronger dollar , with Brazil's real  rising about 0.5% on the stronger retail sales reading. However, broader economic weakness in the country is expected to push Brazil's central bank to cut interest rates at a policy meeting next week.",
    "The central bank has already cut interest rates to a record low of 6.00%.",
    "\"There's still an easing bias after this, so the market's obviously priced in a further easing trajectory from the BCB,\" said Sacha Tihanyi, deputy head of emerging markets strategy at TD Securities.",
    "\"Chances are it (the real) is going to be dependent on broad dollar moves. Today's a bit of a deviation however, as the dollar's doing well against the euro.\"",
    "The Chilean peso  dropped 0.6% as prices of copper, the country's top export, dipped after a sharp fall in Chinese auto sales raised fears of weaker demand. MET/L",
    "Chile's central bank Governor Mario Marcel told Reuters that Chile could be heading for its third interest rate cut within six months, with trade and political tensions adding much pressure on the economy. ",
    "Latin American stock indexes and currencies at 1921 GMT:"
  ],
  "published_datetime": "2019-09-11 03:37:00"
}