{
  "url": "https://www.nasdaq.com/article/former-starboard-executive-pushes-for-sale-of-mobile-mini-20190911-00523",
  "title": "Former Starboard executive pushes for sale of Mobile Mini - Nasdaq.com",
  "text": [
    "By Greg Roumeliotis",
    "Sept 11 (Reuters) - The Donerail Group, an investment firm led by former activist hedge fund Starboard Value LP executive William Wyatt, has built a stake in Mobile Mini Inc  and is pushing the world's largest provider of portable storage solutions to explore a sale, people familiar with the matter said on Wednesday.",
    "The position, Donerail's first major investment, comes at a time of leadership changes at Phoenix, Arizona-based Mobile Mini, which announced in May that CEO Erik Olsson will become chairman in October. He will be succeeded at the helm by the President and Chief Operating Officer Kelly Williams.",
    "Mobile Mini did not immediately respond to a request for comment. Donerail, which was launched by Wyatt last year, declined to comment.",
    "Mobile Mini shares rose 5.3% to $34.90 on the news, giving the company a market capitalization of close to $1.6 billion. The company also had a debt pile of $900 million as of the end of June. ",
    "Mobile Mini has a rental fleet of about 198,000 storage containers and office units, as well 12,700 liquid and solid containment units and pumps that it also rents out. The company has 155 locations in the United States, Britain and Canada.",
    "Mobile Mini's shares have lost 17% of their value in the last 12 months. The company's most recent quarterly earnings call in July said the business has been pressured by uncertainty fueled by Britain's protracted negotiations to cease membership in the European Union.",
    "Mergers and acquisitions in the storage sector have been on the rise. Last year, WillScot Corp, another U.S. warehousing and storage services company, acquired Modular Space Holdings Inc, a provider of office trailers, portable storage units and modular buildings, for $1.2 billion."
  ],
  "published_datetime": "2019-09-11 10:13:00"
}