{
  "url": "https://www.nasdaq.com/article/august-2019-review-and-outlook-cm1206910",
  "title": "August 2019 Review and Outlook - Nasdaq.com",
  "text": [
    "Executive Summary:",
    "Start to finish August was jam packed with an extensive list of geopolitical events, provocative tweets, multiple fresh tariff announcements, and extreme market actions/reactions which combined triggered widespread risk-off sentiment while increasing the probability that the eventual recession is now on the clock.",
    "On the final day in July the Fed cut the overnight rate for the first time in twelve years, but a not so clear Chairman Powell described it as a \"mid-cycle adjustment\" and not the start of a typical rate cut cycle.  The \"hawkish cut\" led to a bullish breakout in the greenback to fresh two year highs, followed by President Trump tweeting \"Powell let us down …\" In hindsight Trump's typically harsh response proved relatively tame compared to his tweet later month, \"who is our bigger enemy, Jay Powell or Chairman Xi?\" which followed increased tariffs by China and Powell's \"neutral\" remarks at Jackson Hole.",
    "The U.S - China trade war escalation commenced in the first week of August when Trump responded to the Fed's \"hawkish cut\" by announcing plans for a 10% tariff on the remaining $300B in Chinese of Chinese goods imported into the U.S.  While their implementation was later postponed to December, the damage was done.  On Monday August 5 th China allowed the Yuan to depreciate above the psychologically important 7 level for the first time since August 2008, while directing its state-owned companies to suspend imports of US agricultural products.  The Trump administration immediately countered with a symbolic move by formerly labeling China a currency manipulator, an act Trump pledged to do during his 2016 campaign.  Later in the month on day two of the Jackson Hole symposium and ahead of Chairman Powell's speech, China announced new tariffs of 10% and 15% against the remaining $75B in U.S. imports.  The new tariffs combined with Powell's \"middle of the road speech\" incensed Trump into a twitter storm which among other things ordered U.S. companies to immediately start looking for an alternative to China.",
    "Fed independence was a theme throughout August, likely in response to President Trump's ongoing rebuke of Chairman Powell.  An August 6 th Op-Ed in the WSJ signed by four former Federal Reserve Chairs (Volcker, Greenspan, Bernanke, and Yellen) emphasized the importance of a Fed Chair who is \"permitted to act independently and in the best interests of the economy, free of short-term political pressures and, in particular, without the threat of removal or demotion\".  Three weeks later an eye-opening Op-Ed in Bloomberg by William Dudley, the former President of the New York Federal Reserve from 2009 - 2018 and vice chairman of the FOMC, argued the Fed should \"refuse to play along\" with Trump's bad policy in regards to the trade war with China.  In the closing paragraph Dudley proclaimed \"there's even an argument that the election itself falls within the Fed's purview …. Fed officials should consider how their decisions will affect the political outcome in 2020.\"  Interesting times indeed!",
    "The exhausting news flow comingled with contracting economic data both overseas and at home led to historic declines in global sovereign rates, a full inversion of the yield curve with the 30YR yield moving below the overnight rate, an inversion of the 10YR-2YR spread for the first time this cycle, and a 21% increase MoM in negative yielding bonds.",
    "In equities the major indices all saw declines.  Large cap outperformed small, defensives outperformed cyclicals, and notably growth outperformed value.  The Dow Jones Industrials (-1.8%) and S&P 500 (-1.9%) performed relatively better than the Russell 2000 (-5.1%) and the Russell Microcap (-6.5%) indices.",
    "The higher yielding Utilities (+4.6%), REITs (+4.7%), and Consumer Staples (+1.6%) were the only sectors to finish in the green.  On the opposite end of the spectrum were energy (-8.7%), financials (-5.1%), and Materials (-3.1%) which faced stiff headwinds from the deteriorating global growth, the escalating trade war, and collapsing rates/inverted curve.",
    "The U.S. Consumer:  Consumer strength has been an enduring theme fueling the longest bull run in history and the story largely remains intact. Historically low unemployment, year-over-year positive wage growth, and strong retail sales have helped create an environment that continues to fuel economic growth. To that effect, consumer spend accounts for nearly 2/3rds of U.S. GDP.",
    "The U.S. - China trade war has escalated this month with a tit-for-tat promise of higher tariffs. This saber rattling has reintroduced volatility to the markets, but what party will bear the higher costs of trade?  What will the impact be to the consumer and how much can merchants pass along?  Will the consumer accept these increased costs?  And will there be a continued spending shift such as we have been witnessing (bricks vs. clicks), or even another evolution as folks spend more on experiences and entertainment instead of material items. Let's take a look at August's data to see where we are heading.",
    "July's producer price index (PPI) numbers (released in early August) were in-line with analyst expectations, but core prices (ex-food & energy) declined for first time since early 2017. This left the index for final demand up +1.7% Y/o/Y. The key takeaway from the report is that inflationary pressures remain muted.",
    "Consumer inflation data is a focal point for the Federal Reserve and the capital markets. Both the July consumer price index (CPI) headline and the core monthly numbers rose by 0.3%. The headline number was in-line, but July's core CPI report was hotter than expected posting the biggest back-to-back monthly increase of prices of goods paid by consumers since 2006.",
    "Retail sales for July surprised to the upside showing unexpected consumer strength (+0.7% MoM vs. consensus +0.3% and were up +1% ex-autos vs consensus +0.3%). The report offered a clear reminder that the U.S. consumer is still in good shape.",
    "A shift in consumer spending is not necessarily a bad thing, though it could be devastating to a specific business. More broadly any signs of a weakening consumer should be taken seriously as a harbinger of a declining U.S. economy.",
    "Commodities & the Dollar:",
    "The continued decline in the global economy and in particular the global manufacturing recession (seven of 10 largest global economies posted sub-50 PMI for July, joined then by the U.S. with sub-50 reading in August) contributed to a 5.9% decline in crude oil.",
    "The euro heavy U.S. Dollar Index (DXY) gained a modest 0.4% in August but finished on a strong note gaining 1.3% gain in the final week to close at fresh two-year highs, 98.92.  The EURUSD currency pair closed below the 1.10 threshold as Euro continues a weakening trend.  The pair is now continuing lower towards its 2014 and 2016 lows at 1.034 - 1.045.   Along with the increasing risk of a \"no-deal\" Brexit, the greenback continues to attract flows due both to its safe haven status, as well as the sharp escalation in negative yielding debt.  On the latter front, the level of negative yielding bonds globally increased 21% in the month of August to $17T.",
    "While the dollar is at multi-year highs, in atypical fashion so too is gold.  Spot gold and silver gained 7.5% and 13% in August.  While gold is commonly known as its role as a hedge against inflation, it is also as a hedge against instability.  And with more than $17T of negative yielding debt, the return of capital vs. a return of capital makes it that much more alluring.  The gold and silver miner ETF's (GDX and SIL) are +41.6% and +23.4% YTD.",
    "Rates:",
    "The decline in Treasury yields was been nothing short of historic.  At the August low, 1.44%, the 10YR yield was down 57bps which if it held there would have marked the largest net decline on a closing basis since December 2008.  Both the 10YR and 30YR yields registered their 2nd biggest monthly declines in more than years.  The 10YR came within 12bps of its 2016 all-time lows while the 30YR made a new record low, 1.90%.  The explosive downside momentum left the 10YR and 30YR yields with weekly RSI's at 17 and 18, levels not seen since October 1998.  And the 30YR yield joined the rest of the curve to officially close below the overnight fed Funds Rate (FFR).",
    "Earnings:",
    "In Q2 75% of companies reported earnings above estimates, slightly below the one-year average (76%) but above the five-year average (72%).  Companies also reported earnings that were 5.6% above estimates, above the one-year (5.2%) and five-year averages (4.8%).",
    "However, all is not rosy.  Sales beats were below average (56% vs 63% for one year and 60% for five years.)  Put another way, 43% of companies reported actual sales below estimated sales.",
    "Earnings also fell 0.7%, the first time S&P 500 companies reported two consecutive quarters of y/y earnings declines since Q2 2016.  Revenue growth of 4.1% was also the lowest since Q3 2016.",
    "Five sectors reported year-over-year growth in earnings, led by the Health Care and Financials sectors. Six sectors reported year-over-year declines in earnings, led by the Materials and Industrials sectors.",
    "There was also a 40% increase in S&P 500 companies citing tariffs on earnings conference call s.  According to FactSet, 124 companies (28% pf 438 searched) cited the term tariff with Industrials having 35 companies mentioning the term.  In Q1, the total number of mentions was 88.  Until this quarter, the numbers had been declining (table below).",
    "Perhaps most concerning, earnings estimates for the second half of 2019 are falling.  Analysts now expect a Q3 earnings decline of 3.1% followed by 3.9% growth in Q4.   In the first quarter, these estimates were +1.7% and +8.3%.",
    "Volatility:",
    "We noted in our last monthly report that \"August seasonality is also not favorable.  Over the last ten years August has been the worst performing month, and since 1950 it has been the 2 nd worst performer.\"",
    "Well, August lived up to his reputation as a tough month for stocks.  It was the second worst performing month so far in 2019 with a 1.8% decline, though at mid-month, when the S&P 500 was down 6.8% and the Dow shed 2,000 points, it looked like it could be worse.  The last three years have seen a tame August but in 2010, 2011 and 2015 stocks lost more at 4.8%, 5.7% and 6.3% respectively.",
    "August had 11 days in which the S&P 500 moved 1% or more, far surpassing January's six.  The four declines of this magnitude also tied May for the most.  There were also seven gains of 1% or more.  The issue of course was that the declining sessions saw greater moves than the ones with gains, with three downward 2%+ moves against no similar gains.",
    "However, one gets the feeling it could have been worse.  Coming off the aforementioned 2,000 Dow point decline we said \"we are virtually assured to see more sharp moves - but are still at about 2018 levels of volatility\".   Since then, despite some unhelpful comments on trade and continued warning signals from the bond market we've had four moves of 1% or more but three of those were gains (weighted against a 2.6% loss).  Meanwhile, the VIX Index has fallen from the 22 level to the current 18.98.",
    "Once volatility is unleashed it's hard to suppress it, so we won't say we are out of the woods just yet, especially since President Trump still has a Twitter account.  September is historically the worst month for the Dow, S&P 500 and Nasdaq Composite indexes.  Over the past 10 years, the month has been a bit more constructive than August, with a 10-year trailing average return of +0.86% vs. the -0.78% decline in August but still has the potential to be volatile.",
    "Looking Ahead:",
    "Markets could remain on edge in September not simply because of poor seasonal trends, but more so due to the plethora of escalating geopolitical risks and uncertainty.  Tariff escalation is now leading some economists to reduce their China 2020 GDP forecasts to below 6%, the lowest levels seen in three decades.  Meanwhile in mid-August Germany reported a -0.1% Q2 GDP as its manufacturing sector fell deeper into contraction territory.  PM Boris Johnson is striving to take the U.K. out of the European Union on October 31 st , with or without a deal.",
    "In the U.S. the surging greenback should weigh on inflationary pressures and encourage more angst by Trump against the Fed.  The 10YR-2YR UST inversion has unofficially put recession on the clock, however this is not a timing signal to get \"beared up.\"  According to Canaccord's Tony Dwyer, the last three cycles that have been similarly fueled by an excessive use of leverage, following the initial inversion of the curve the SPX rallies a median 34% in 22 months with a recession 24 months away.\"  Over the last four weeks the SPX has been range bound between 2,820 and 2,944.  And despite all the extensive list of aforementioned headwinds, it closed August just 3% from all-time highs.  All bull markets have their own wall of worry to climb.  This one is certainly being put to the test.",
    "Nasdaq's Market Intelligence Desk (MID) Team includes:",
    "Charles Brown is Associate Vice President on The Market Intelligence Desk with over 20 years of equity capital markets experience. Charlie has extensive knowledge of equity trading on both floor and screen based marketplaces. Charlie assists with the management of The Market Intelligence Desk and works with Nasdaq listed companies providing them with insightful objective trading analysis.",
    "Steven Brown is a Managing Director on the Market Intelligence Desk (MID) at Nasdaq with over twenty years of experience in equities. With a focus on client retention he currently covers the Financial, Energy and Media sectors.",
    "Christopher Dearborn is a Managing Director on the Market Intelligence Desk (MID) at Nasdaq. Chris has over two decades of equity market experience including floor and screen based trading, corporate access, IPOs and asset allocation. Chris is responsible for providing timely, accurate and objective market and trading-related information to Nasdaq-listed companies.",
    "Brian Joyce, CMT is a Managing Director on the Market Intelligence Desk (MID) at Nasdaq. Before joining Nasdaq Brian spent 16 years as an institutional trader executing equity and options orders for both the buy side and sell side. He also provided trading ideas and wrote technical analysis commentary for an institutional research offering. Brian focuses on helping Nasdaq's Financial, Healthcare and Transportation companies, among others, understand the trading in their stock. Brian is a Chartered Market Technician (CMT).",
    "Michael Sokoll, CFA is Associate Vice President on the Market Intelligence Desk (MID) at Nasdaq with over 25 years of equity market experience. In this role, he manages a team of professionals responsible for providing NASDAQ-listed companies with real-time trading analysis and objective market information.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:55:00"
}