{
  "url": "https://www.nasdaq.com/article/wall-st-gains-on-easing-trade-tensions-strong-adp-jobs-data-20190905-00715",
  "title": "Wall St gains on easing trade tensions, strong ADP jobs data - Nasdaq.com",
  "text": [
    "By Uday Sampath Kumar",
    "Sept 5 (Reuters) - U.S. stocks rose on Thursday on hopes of a de-escalation in trade tensions after Washington and Beijing agreed to hold high-level talks next month, while data showing strong job addition in the private sector allayed some slowdown concerns.",
    "China'sCommerce Ministry said its trade team will lay the groundwork with their U.S. counterparts in mid-September for the October talks. ",
    "Those gains were driven by Apple Inc , which rose 2.02%, and chipmakers, with the Philadelphia Semiconductor index  jumping 3.43%.",
    "\"The resumption of trade talks is building enthusiasm that maybe some sort of deal, like suspension of tariffs for a while, might be in the works,\" said Peter Cardillo, chief market economist at Spartan Capital Securities in New York.",
    "Data showed U.S. private employers' payrolls grew at the fastest pace in four months in August led by big gains in service-sector jobs. ",
    "The ADP National Employment Report, considered a precursor to the Labor Department's more comprehensive jobs report, showed the private sector added 195,000 jobs in August, above  economists' expectations of an increase of 149,000 jobs.",
    "Following a contraction in U.S. factory activity in August, investors will turn their attention to any sign of a similar slowdown in the services sector.",
    "Data from the Institute for Supply Management's non-manufacturing activity index for August, due out at 10 a.m. ET, is expected to show a reading of 54.0, following July's 53.7.",
    "However, even if non-manufacturing data comes in below expectations, it will not overshadow positive trade news, Cardillo said.",
    "Investors will also keep a close watch on the crucial nonfarm payrolls data due on Friday, with analysts cautioning that any weakness could suggest a slowing U.S. economy.",
    "At 9:43 a.m. ET the Dow Jones Industrial Average  was up 347.73 points, or 1.32%, at 26,703.20, the S&P 500  was up 30.02 points, or 1.02%, at 2,967.80 and the Nasdaq Composite  was up 96.93 points, or 1.22%, at 8,073.81.",
    "In deal news, insurer Prudential Financial Inc  agreed to acquire online insurance startup Assurance IQ Inc for $2.35 billion. Shares of Prudential fell 1.4%.",
    "Among losers were the defensive utilities , real estate  and consumer staples  sectors.",
    "Advancing issues outnumbered decliners by a 2.96-to-1 ratio on the NYSE and by a 2.95-to-1 ratio on the Nasdaq.",
    "The S&P index recorded 47 new 52-week highs and no new low, while the Nasdaq recorded 46 new highs and 15 new lows."
  ],
  "published_datetime": "2019-09-05 09:56:00"
}