{
  "url": "https://www.nasdaq.com/article/energy-sector-update-for-09112019-pkd-mor-bpl-xom-cvx-cop-slb-oxy-cm1210300",
  "title": "Energy Sector Update for 09/11/2019: PKD, MOR, BPL, XOM, CVX, COP, SLB, OXY - Nasdaq.com",
  "text": [
    "Top Energy Stocks:",
    "XOM: +0.53%",
    "CVX: +0.57%",
    "COP: +0.41%",
    "SLB: +0.40%",
    "OXY: +0.62%",
    "Top energy stocks were advancing pre-bell Wednesday. West Texas Intermediate crude oil for October delivery was up $0.26 at $57.66 per barrel at the New York Mercantile Exchange. The global benchmark Brent crude November contract gained $0.59 to $62.75 per barrel and October natural gas futures were 2 cents lower at $2.56 per 1 million BTU. Among energy-related ETFs, the United States Oil Fund was flat, while the United States Natural Gas fund was 0.85% lower.",
    "Early movers include:",
    "(+) Parker Drilling ( PKD  ), which was up more than 17% after saying its finance and strategic planning committee has recommended that its board approve a plan to delist the company's shares. The company also plans to complete a reverse stock split, which will be followed immediately by a forward stock split and delisting from trading on the New York Stock Exchange.",
    "In other sector news:",
    "(+) ExxonMobil ( XOM  ), Murphy Oil ( MUR  ) and Enauta Participacoes have teamed up to buy deepwater assets offshore Sergipe-Alagoas Basin sold in Brazil's first open acreage auction, media reports said. ExxonMobil was recently advancing, while Murphy Oil was unchanged in recent trading.",
    "(=) Buckeye Partners ( BPL  ) was flat after saying it has partially restarted operations at its storage terminal facility in the Bahamas following the devastation caused by Hurricane Dorian last week.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-11 09:24:08"
}