{
  "url": "https://www.nasdaq.com/article/why-shockwave-medical-shares-are-tanking-today-cm1206950",
  "title": "Why ShockWave Medical Shares Are Tanking Today - Nasdaq.com",
  "text": [
    " What happened Though   ShockWave Medical    (NASDAQ: SWAV) shared upbeat news with investors Tuesday, shares   of the medical device company fell as much as 13% in afternoon   trading. The stock was down about 10% as of 3:20 p.m. EDT. So what Two news items appear to be impacting the share   price. First, Shockwave, which focuses on   treating calcified plaque    , announced it had received a Breakthrough Device Designation   from the Food and Drug Administration for its C   2     Coronary IVL Catheter. The device uses sonic waves to   fracture calcium deposits in the heart with the goal of improving   blood flow. The C   2     is already available for sale in Europe, and Shockwave is   currently enrolling patients in a pivotal study to hopefully   win  U.S. regulatory approval. Gaining that Breakthrough   Device Designation from the FDA certainly is a good sign that it   eventually will be approved.makeArticleAd(); Unfortunately, that positive news is being overshadowed by the   second news item. Cliffside Research issued a shor   t report    on ShockWave Medical Tuesday that called the stock a strong sell,   and set a short-term price target of $23. That was well below   Friday's closing price of $41.85. Cliffside asserts that a   seasonably weak third-quarter will combine with a lockup   expiration to drive the company's share price lower. The short report took center stage today, which explains why   shares are falling by double-digit percentages.   Image source: Getty Images.  Now what It's usually worthwhile for investors to read through short   sellers' reports to see if they contain any thesis-changing news.   In this case, the lockup expiration and a seasonably weak   third-quarter may or may not cause the share price to decline in   the short term, but it's hard to imagine how either of them could   have any impact on the long-term potential of the business. It isn't uncommon for shares of   fast-growing companies    like Shockwave to be highly volatile, nor to occasionally find   themselves on the receiving end of a short report. The good news   is that the share price will eventually take care of itself if   this company can continue to deliver triple-digit percentage   revenue growth and deliver on its   long-term potential    .   10 stocks we like better than ShockWave     Medical       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and ShockWave Medical wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Brian Feroldi      has no position in any of the stocks mentioned. The Motley Fool     recommends ShockWave Medical. The Motley Fool has a     disclosure policy      .  ",
    "Though   ShockWave Medical    (NASDAQ: SWAV) shared upbeat news with investors Tuesday, shares   of the medical device company fell as much as 13% in afternoon   trading. The stock was down about 10% as of 3:20 p.m. EDT.",
    "Two news items appear to be impacting the share   price.",
    "First, Shockwave, which focuses on   treating calcified plaque    , announced it had received a Breakthrough Device Designation   from the Food and Drug Administration for its C   2     Coronary IVL Catheter. The device uses sonic waves to   fracture calcium deposits in the heart with the goal of improving   blood flow. The C   2     is already available for sale in Europe, and Shockwave is   currently enrolling patients in a pivotal study to hopefully   win  U.S. regulatory approval. Gaining that Breakthrough   Device Designation from the FDA certainly is a good sign that it   eventually will be approved.",
    "Unfortunately, that positive news is being overshadowed by the   second news item.",
    "Cliffside Research issued a shor   t report    on ShockWave Medical Tuesday that called the stock a strong sell,   and set a short-term price target of $23. That was well below   Friday's closing price of $41.85. Cliffside asserts that a   seasonably weak third-quarter will combine with a lockup   expiration to drive the company's share price lower.",
    "The short report took center stage today, which explains why   shares are falling by double-digit percentages.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "It's usually worthwhile for investors to read through short   sellers' reports to see if they contain any thesis-changing news.   In this case, the lockup expiration and a seasonably weak   third-quarter may or may not cause the share price to decline in   the short term, but it's hard to imagine how either of them could   have any impact on the long-term potential of the business.",
    "It isn't uncommon for shares of   fast-growing companies    like Shockwave to be highly volatile, nor to occasionally find   themselves on the receiving end of a short report. The good news   is that the share price will eventually take care of itself if   this company can continue to deliver triple-digit percentage   revenue growth and deliver on its   long-term potential    .",
    "  10 stocks we like better than ShockWave     Medical       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and ShockWave Medical wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than ShockWave     Medical       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and ShockWave Medical wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Brian Feroldi      has no position in any of the stocks mentioned. The Motley Fool     recommends ShockWave Medical. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 15:50:00"
}