{
  "url": "https://www.nasdaq.com/article/nurture-peace-and-make-it-last-pope-tells-postwar-mozambique-20190905-00171",
  "title": "Nurture peace and make it last, Pope tells post-war Mozambique - Nasdaq.com",
  "text": [
    "By Philip Pullella and Manuel Mucari",
    "MAPUTO, Sept 5 (Reuters) - Pope Francis urged the people of Mozambique on Thursday to nurture their hard-earned peace and strive to provide equal opportunities for all so as not to slip back into civil war.",
    "Francis addressed President Filipe Nyusi of the ruling Frelimo party and leaders of the Renamo opposition at the colonial-style presidential palace, where peacocks roamed lush gardens in contrast to bustling streets outside.",
    "\"In the course of these years, you have come to realize how the pursuit of lasting peace - a mission incumbent upon all - calls for strenuous, constant and unremitting effort. For peace is like a delicate flower, struggling to blossom on the stony ground of violence,\" the pope told them.",
    "Some fear that as the country of 28 million people approaches new elections scheduled for next month, violence could break out, particularly in rural areas where the former rebels have more sway.",
    "Ossufo Momade, leader of Renamo, was in the audience for the papal address and received a round of applause when the president mentioned him.",
    "In his address to the pope, the president vowed to help build a nation \"where non-violence becomes a culture lived by all, where politics is practiced through the force of argument and not the force of arms.\"",
    "But Francis said if they wanted lasing peace, leaders had to discourage any form of fanaticism and exaltation and strive to improve conditions and opportunities for the marginalized.",
    "\"Without equal opportunities, the different forms of aggression and conflict will find a fertile terrain for growth and eventually explode,\" said the pope, who arrived in Mozambique on Wednesday night.",
    "\"GOOD DAY FOR PEACE\"",
    "According to the U.N. World Food Programme (WFP), 80% of Mozambique's population cannot afford the minimum costs for an adequate diet",
    "\"It's definitely a good day for peace and reconciliation,\" said Myrta Kaulard, the United Nations Resident Coordinator in Mozambique. \"For good elections you need peace. For development you need peace.\"",
    "Kaulard, who attended the meeting, said Francis' message would give a \"positive boost,\" but so would his mere presence, noting the last time Mozambique was in the spotlight was for cyclones that killed more that a thousand people in March.",
    "Francis also touched on environmental problems, another big theme of the trip that will take him on to Madagascar and Mauritius.",
    "He said Mozambicans should be vigilant against pillaging and unethical exploitation of natural resources \"driven by a greed generally not cultivated even by the inhabitants of these lands, nor motivated by the common good of your people\".",
    "According to the World Bank, Mozambique has lost 8 million hectares of forest, about the size of Portugal, since the 1970s.",
    "As Asian supplies of valuable hardwoods like rosewood used to make luxury furniture have been depleted, Chinese importers have shifted to Africa. Mozambique is currently the 10th largest supplier of rosewood to China, according to Chinese customs data cited by U.S.-based non-profit group Forest Trends."
  ],
  "published_datetime": "2019-09-05 05:14:00"
}