{
  "url": "https://www.nasdaq.com/article/french-glassware-maker-verallia-kicks-off-ipo-process-20190905-00165",
  "title": "French glassware maker Verallia kicks off IPO process - Nasdaq.com",
  "text": [
    "By Inti Landauro",
    "PARIS, Sept 5 (Reuters) - French glass bottle maker Verallia said on Thursday it had begun the process for an initial public offering in Paris, setting the stage for the largest new listing in the country this year.",
    "Verallia, controlled since 2015 by U.S. investment company Apollo, said on Wednesday the French stock market regulator had approved its IPO registration document.",
    "The plans for a listing remain dependent on favourable market conditions, the company said.",
    "\"The IPO will enable the company to increase its visibility among its customers and partners and provide it with greater flexibility to seize future growth opportunities,\" Verallia's CEO Michel Giannuzzi said in a statement.",
    "French companies have shied from launching IPOs on the Paris bourse which still trades below levels seen before the 2008 financial crisis.",
    "Verallia would be the largest IPO on Euronext'sParis stock market since June 2017 when Societe Generale  floated a stake in its car leasing arm ALD Automotive in a listing that valued the firm at more than 5 billion euros.",
    "Verallia, the world's third largest maker of glass bottles and jars, supplies containers to iconic consumer brands such as Dom Perignon champagne and chocolate spread Nutella.",
    "The company used to belong to French construction materials maker Saint-Gobain, which sold it to Apollo in 2015 for about 3 billion euros.",
    "In its Thursday statement, Verallia said Apollo would keep a controlling stake through its holding firm in which French state-owned lender Bpifrance has a minority stake.",
    "Verallia told potential investors it expects to pay 100 million euros in dividends out of expected 2019 profits.",
    "($1 = 0.8973 euros)"
  ],
  "published_datetime": "2019-09-05 05:15:00"
}