{
  "url": "https://www.nasdaq.com/article/the-trade-war-recapping-augusts-major-developments-cm1206872",
  "title": "The Trade War: Recapping August's Major Developments - Nasdaq.com",
  "text": [
    "August was a turbulent month in the stock market, and the ongoing trade war between the United States and China was the main reason. New tariffs were announced, both the new and the previously existing tariffs were subsequently increased, China retaliated with tariffs of its own, and President Trump went so far as to encourage American companies who do business with China to start looking for alternatives.",
    "There has been a lot to keep up with, so here's a quick rundown of the most recent developments, why a trade deal could finally happen, and who the biggest winners could be if it does.",
    "Image source: Getty Images.",
    "The most significant developments that have occurred recently in the trade war all stem from President Trump's latest round of tariffs.",
    "In a surprise announcement, the president announced on August 1 a 10% tariff on the $300 billion in Chinese imports that had thus far been unaffected by the trade war. This was initially set to go into effect on September 1, one month after the announcement.",
    "Well, a lot happened in that month.",
    "First, China retaliated with tariffs of its own. They are smaller in scale than the U.S. tariffs -- 5% to 10% on about $75 billion in U.S. exports. However, in response to this retaliation, President Trump decided that the recently announced tariffs would be 15%, not 10%. And the 25% tariffs currently in place on $250 billion in Chinese imports would rise to 30% on October 1. ",
    "Then, in an effort to minimize effects on the U.S. holiday shopping season, about half of the new 15% tariffs were delayed until December 15. This affects about $160 billion of the $300 billion in Chinese imports Trump referenced in his original announcement.",
    "The latest tariffs went into effect on September 1. The 15% tariffs have now been imposed on about $112 billion of Chinese imports. This is in addition to tariffs that were already in place, and China retaliated with tariffs of its own of 5%-10% on about $75 billion of U.S. exports. ",
    "These tariffs are particularly significant because they affect more consumer items than previous rounds. The Trump administration had largely focused the earlier tariffs in ways that would be least likely to affect retail goods.",
    "Finally, on August 23 President Trump also (via Twitter) ordered American businesses to \"immediately start looking for an alternative to China.\"",
    "In short, August was an eventful month for the trade war. It was also the main driving force behind the continuous stock market volatility during the month.",
    "One positive development in the trade war saga is that China seems to be indicating that it wants to make a deal without further hostility, saying that it seeks a \"calm\" end to the trade tensions. This news came after the president ordered American businesses to find alternatives to China, but before the latest round of tariffs went into effect. ",
    "President Trump later said that Chinese officials had reached out to the U.S. and expressed interest in getting back to the negotiating table.",
    "Obviously, the entire U.S. stock market would breathe a collective sigh of relief if a trade deal were to be reached. The exact market reaction to a hypothetical end to the trade war is anyone's guess at this point, but it's fair to assume that most major market indices would likely move higher at the news.",
    "The biggest direct winners of a trade deal would likely be those stocks and sectors that have been most adversely affected. For example, electronics manufacturers like Apple (NASDAQ: AAPL) , which relies on China for much of its supply chain.",
    "Other sectors could be indirect winners, such as the financial sector . As the trade war has escalated, it has added to recession fears in the market, which has driven interest rates lower. Lower interest rates generally translate to lower profit margins for banks, so a trade deal could lift market sentiment, which in turn could cause interest rates (and bank stocks) to rise.",
    "If no trade deal, or at least significant progress, is announced when leaders from the U.S. and China meet, I'd expect a negative reaction from the stock market. Any further announcements of tariffs or other action from either side would be even worse. I'd expect companies and sectors that do the most business with China to be affected most, but an ongoing trade war could be a big negative catalyst for the market, especially if it leads to a recession.",
    "The $16,728 Social Security bonus most retirees completely overlook\r\n If you're like most Americans, you're a few years (or more) behind on your retirement savings. But a handful of little-known \"Social Security secrets\" could help ensure a boost in your retirement income. For example: one easy trick could pay you as much as $16,728 more... each year! Once you learn how to maximize your Social Security benefits, we think you could retire confidently with the peace of mind we're all after. Simply click here to discover how to learn more about these strategies .",
    "Matthew Frankel, CFP owns shares of Apple. The Motley Fool owns shares of and recommends Apple. The Motley Fool has the following options: short January 2020 $155 calls on Apple, long January 2020 $150 calls on Apple, short January 2020 $155 calls on Apple, and long January 2020 $150 calls on Apple. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:46:00"
}