{
  "url": "https://www.nasdaq.com/article/top-stock-reports-for-apple-exxon-mobil-att-cm1210762",
  "title": "Top Stock Reports for Apple, Exxon Mobil & AT&T - Nasdaq.com",
  "text": [
    "Wednesday, September 11, 2019",
    "The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Apple (AAPL), Exxon Mobil (XOM) and AT&T (T). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.",
    "You can see  all of today's research reports here >>>",
    "Apple 's shares have outperformed the broader S&P 500 index on a year-to-date basis (37.3% vs. 18.8%). The Zacks analyst thinks that the company's focus on strengthening the Services business and a slate of upcoming app releases, including its streaming service Apple TV+, is a key catalyst. Aggressive pricing of Apple TV+ is expected to boost the competitive prowess in the streaming market.",
    "The company is also expected to benefit from the refreshed Macbook, iPad and Apple Watch product lines. Apple Arcade is anticipated to expand the company's footprint in the video game space. However, the ongoing U.S.-China trade war does not bode well for the company.",
    "Further, legal woes have increased due to a lawsuit by customers related to App Store charges. The company has also been accused of unfair practices by Spotify. These are significant headwinds for investors, at least for the near term.",
    "(You can  read the full research report on Apple here >>> ).",
    "Shares of Exxon Mobil have lost 2.7% in the past three months, outperforming the Zacks Integrated International Oil industry's fall of 5.9%. The Zacks analyst believes that the company's status as a bellwether in the energy space, optimal integrated capital structure that has historically produced industry-leading returns and management's track record of capex discipline across the commodity price cycle make it a relatively lower-risk player in the sector.",
    "The company owns some of the most prolific upstream assets globally, with more major projects coming online over the next few years. In the June quarter of 2019, ExxonMobil completed its 13th discovery in Guyana, where estimated recoverable resource was recently revised higher by the firm.",
    "However, the company's downstream and chemical segments are under pressure owing to heavy turnaround activities. The ongoing global economic slowdown can further take a toll on downstream & chemical businesses, as petrochemical demand may drastically fall.",
    "(You can  read the full research report on Exxon Mobil here >>> ).",
    "AT&T 's shares have gained 22.7% over the past six months, outperforming the Zacks Wireless National industry's rise of 11.3%.",
    "The Zacks analyst believes that AT&T is improving critical services that support Public Safety and first responders using the FirstNet communications platform. The wireless carrier's LTE network reaches more than 400 million people in North America. It aims to deploy a standards-based, nationwide mobile 5G network in early 2020.",
    "AT&T's 5G Evolution technology is live in more than 200 markets and is expected to reach more than 400 markets by the end of 2019. It is on track to achieve its target of 2.5x debt-to-EBITDA range by 2019.",
    "However, it is witnessing a steady decline in linear TV subscribers and legacy services. Its wireline division is facing loss in access line due to competitive pressure from Voice over Internet Protocol service providers. As the company tries to woo customers with discounts, freebies and cash credits, margin pressure is likely to rise.",
    "(You can  read the full research report on AT&T here >>> ).",
    "Other noteworthy reports we are featuring today include Universal Health Services (UHS), Cardinal Health (CAH) and ANSYS (ANSS).",
    "Looking for Stocks with Skyrocketing Upside?",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "See the pot trades we're targeting>>",
    "Mark Vickery\r\n Senior Editor",
    "Note: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trendsand Earnings Previewreports. If you want an email notification each time Sheraz publishes a new article, please click here>>>",
    "Apple TV+ & Arcade Launch to Boost Apple's (AAPL) Prospects",
    "ExxonMobil (XOM) Banks on Guyana Oil Finds, Downstream Hurts",
    "AT&T (T) Remains Poised for Nationwide 5G Rollout in 2020",
    "Toll Brothers (TOL) to Gain on Expansion Efforts, Orders Low",
    "Per the Zacks analyst, Toll Brothers to gain from geographic expansions and improving demographics. However, lower demand in high-end markets and lower orders are risk.",
    "Pharmaceutical Arm Aids Cardinal Health (CAH) Amid Rivalry",
    "Cardinal Health has been gaining from solid prospects of its core Pharmaceutical segment. The Zacks Analyst is however apprehensive about the intense competition in the MedTech space.",
    "Strategic Buyouts Aid, High Costs Hurt United Health (UHS)",
    "Per the Zacks analyst, certain strategic acquisitions made by the company has led to significant growth.",
    "Teva's (TEVA) Organic Growth Unlikely to Resume in 2019",
    "Though Teva is progressing well with its restructuring activities, the Zacks analyst believes that stability is still some way off.",
    "Noble Energy (NBL) Gains from Rising Demand, Strong Assets",
    "Per Zacks analyst Noble Energy's assets in the United States and offshore Israel caters to the rising demand in the respective region, strengthening company's position globally.",
    "Strength in Aerie to Augment American Eagle's (AEO) Top-Line",
    "Per the Zacks analyst, American Eagle's Aerie brand has reported double-digit comps growth for 19 straight quarters.",
    "Wolverine World Wide's (WWW) Soft Margin Trend is a Concern",
    "Per the Zacks analysts, Wolverine World Wide has been witnessing weak margin trends for a while. Unfavorable mix and higher closeout costs hurt the gross margin in second-quarter fiscal 2019.",
    "High Loan Demand, Diversification Aid Ally Financial (ALLY)",
    "Per the Zacks analyst, Ally Financial's strategy to diversify revenue base, rise in demand for consumer loans, inorganic growth efforts and strong balance sheet position will support profitability.",
    "EchoPark Growth, Cost Control to Aid Sonic Automotive (SAH)",
    "Per the Zacks Analyst, Sonic Automotive is poised to gain from the expansion of its used-car segment, EchoPark as well as focus on expense control and improving its balance sheet.",
    "Growth Projects and Cost Management to Aid Kinross (KGC)",
    "Per the Zacks analyst, Kinross should gain from efforts to advance its growth projects, especially Tasiast. It will also benefit from its focus on managing costs and improve cash flow.",
    "ANSYS (ANSS) Hurt By Stiff Competition & Higher Investments",
    "Per the Zacks analyst, ANSYS is affected by the rising competition from the CAD vendors, such as Cadence Design Systems. Moreover, increasing spend on acquisitions pose integration risks.",
    "High Costs, Concentration Risk Hurts Federated (FII)",
    "Per the Zacks analyst, consistently rising expenses due to strict compliance measures hurts Federated's financials.",
    "Weakness in Oil & Gas Market Weighs on Kirby (KEX)",
    "Per the Zacks analyst, softness in oil and gas market is hurting revenues at the distribution and services unit. As a result, segmental revenues declined 10% year over year in the first half of 2019.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:36:00"
}