{
  "url": "https://www.nasdaq.com/article/trade-war-weighs-on-us-agriculture-brazil-argentina-wins-cm1210540",
  "title": "Trade War Weighs on U.S. Agriculture, Brazil-Argentina Wins - Nasdaq.com",
  "text": [
    " China is one of the world's biggest importers of agricultural products, a significant portion of which comes from the United States each year. But, China has trimmed the import of farm products from the United States due to rising trade tensions. This has affected the U.S. agriculture sector as farmers keep building crop inventories and companies halt production due to lower demand. Meanwhile, China has now turned to South American countries like Brazil and Argentina instead of U.S. producers for soy.  Trade War Hurts U.S. Agriculture  Per a report from American Farm Bureau, China imported $19.5 billion farm products from the United States in 2017, which reduced to $9.1 billion in 2018 due to the trade war. Since March 2018, the tariff war has resulted in an 18% drop in soy prices. In fact, the shipment of U.S. soybeans to China sank to a 16-year low in 2018, as China shifted purchase to Brazil and other South American producers. Trade terms worsened in second-quarter 2019 as China reduced purchase of agricultural products from the United States as Trump's administration blacklisted Huawei and other Chinese technology firms citing security violations and increased tariffs on products. In spite of the tensions, trade talks resumed in July but failed as China insisted on the removal of additional tariff and lifting the ban on Huawei. Instead of going into any further negotiation Trump imposed additional tariffs and Beijing in retaliation levied higher duties and stopped agricultural purchases from the United States. On Sep 1, Trump imposed an additional 15% tariff on $125 billion of Chinese goods citing that China is manipulating the fall in its currency. China retaliated by imposing extra tariffs of 5% and 10% on 1,717 products and filed a complaint with the World Trade Organization over U.S. import duties for violating the consensus reached by both the countries in Osaka, Japan. The trade tussle has not only put farmers in a disadvantageous position but has also eaten into the profit margins of U.S. agricultural companies. For instance, Deere & Company DE  that produces agricultural machinery had to cut down production as American farmers are putting off equipment purchases due to declining sales and higher inventory levels. During the fiscal third-quarter earnings report, Deere had reported a drop in revenues at its agricultural and turf segment. Sales at the United States and Canada segment accounted for 60% of Deere's total sales. AGCO Corporation AGCO  and CNH Industrial N.V. CNHI  , both agricultural machine makers, had to slash production to balance inventory and retail demand. AGCO carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here.   Fertilizer makers Nutrien Ltd NTR  and The Mosaic Company MOS  have stated two major reasons for the revenue decline. Firstly, China's demand for fertilizers has been delayed by trade tariffs, which is also weighing on the income generated by U.S. farms, leaving farmers with limited funds. These companies are now shifting focus to the South American agricultural states as China is now focusing on Brazil and Argentina to fulfill its need for farm products, especially soy.  Brazil & Argentina Emerge Winners  Argentina and China has been negotiating over soy meal import and have finally agreed to sign a deal. Argentina is the one of the largest processed soy exporters in the world, per Reuters. It expects to export 26 million tons of soy meal and 8.5 million ton of raw beans this year globally as the U.S.-China trade war has compelled China to look for alternatives. Brazil's soybeans export rose 30% as China halted U.S. agricultural import. China, in the past 12 months, has imported 71 million tons of soybeans from Brazil alone. In fact, representatives from CNH Industrial in Augus t report  ed that there is a rise in order for tractors, planters and combined from South America especially, Brazil.  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.       Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.      See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  CNH Industrial N.V. (CNHI): Free Stock Analysis Report   The Mosaic Company (MOS): Free Stock Analysis Report   AGCO Corporation (AGCO): Free Stock Analysis Report   Deere & Company (DE): Free Stock Analysis Report   Nutrien Ltd. (NTR): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "China is one of the world's biggest importers of agricultural products, a significant portion of which comes from the United States each year. But, China has trimmed the import of farm products from the United States due to rising trade tensions.",
    "This has affected the U.S. agriculture sector as farmers keep building crop inventories and companies halt production due to lower demand. Meanwhile, China has now turned to South American countries like Brazil and Argentina instead of U.S. producers for soy.",
    " Trade War Hurts U.S. Agriculture ",
    "Per a report from American Farm Bureau, China imported $19.5 billion farm products from the United States in 2017, which reduced to $9.1 billion in 2018 due to the trade war. Since March 2018, the tariff war has resulted in an 18% drop in soy prices.",
    "In fact, the shipment of U.S. soybeans to China sank to a 16-year low in 2018, as China shifted purchase to Brazil and other South American producers.",
    "Trade terms worsened in second-quarter 2019 as China reduced purchase of agricultural products from the United States as Trump's administration blacklisted Huawei and other Chinese technology firms citing security violations and increased tariffs on products.",
    "In spite of the tensions, trade talks resumed in July but failed as China insisted on the removal of additional tariff and lifting the ban on Huawei. Instead of going into any further negotiation Trump imposed additional tariffs and Beijing in retaliation levied higher duties and stopped agricultural purchases from the United States.",
    "On Sep 1, Trump imposed an additional 15% tariff on $125 billion of Chinese goods citing that China is manipulating the fall in its currency. China retaliated by imposing extra tariffs of 5% and 10% on 1,717 products and filed a complaint with the World Trade Organization over U.S. import duties for violating the consensus reached by both the countries in Osaka, Japan.",
    "The trade tussle has not only put farmers in a disadvantageous position but has also eaten into the profit margins of U.S. agricultural companies.",
    "For instance, Deere & Company DE  that produces agricultural machinery had to cut down production as American farmers are putting off equipment purchases due to declining sales and higher inventory levels. During the fiscal third-quarter earnings report, Deere had reported a drop in revenues at its agricultural and turf segment. Sales at the United States and Canada segment accounted for 60% of Deere's total sales.",
    "AGCO Corporation AGCO  and CNH Industrial N.V. CNHI  , both agricultural machine makers, had to slash production to balance inventory and retail demand. AGCO carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here.  ",
    "Fertilizer makers Nutrien Ltd NTR  and The Mosaic Company MOS  have stated two major reasons for the revenue decline. Firstly, China's demand for fertilizers has been delayed by trade tariffs, which is also weighing on the income generated by U.S. farms, leaving farmers with limited funds.",
    "These companies are now shifting focus to the South American agricultural states as China is now focusing on Brazil and Argentina to fulfill its need for farm products, especially soy.",
    " Brazil & Argentina Emerge Winners ",
    "Argentina and China has been negotiating over soy meal import and have finally agreed to sign a deal. Argentina is the one of the largest processed soy exporters in the world, per Reuters. It expects to export 26 million tons of soy meal and 8.5 million ton of raw beans this year globally as the U.S.-China trade war has compelled China to look for alternatives.",
    "Brazil's soybeans export rose 30% as China halted U.S. agricultural import. China, in the past 12 months, has imported 71 million tons of soybeans from Brazil alone. In fact, representatives from CNH Industrial in Augus t report  ed that there is a rise in order for tractors, planters and combined from South America especially, Brazil.",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.      ",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   ",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:47:00"
}