{
  "url": "https://www.nasdaq.com/article/hong-kong-exchange-shares-fall-after-39-bln-takeover-bid-for-lse-20190911-00952",
  "title": "Hong Kong exchange shares fall after $39 bln takeover bid for LSE - Nasdaq.com",
  "text": [
    "HONG KONG, Sept 12 (Reuters) - Hong Kong Exchanges and Clearing Ltd (HKEX)  shares fell more than 3% on Thursday as investors weighed the merits of its $39 billion takeover approach to London Stock Exchange Plc (LSE) , a deal that would make it a global giant.",
    "HKEX shares fell as much as 3.7% in opening trade, while the benchmark Hang Seng Index  was up 0.1%, reflecting investor concerns about the financial impact of the deal on the Hong Kong market operator. The stock was down 3.4% at 10:15 a.m. (0215 GMT).",
    "The proposed deal is aimed at creating a combined group better able to compete with U.S. rivals such as Intercontinental Exchange Inc  and CME Group inc . It is contingent on LSE abandoning a $27 billion deal to acquire financial information provider Refinitiv. ",
    "\"At the same time, we believe that bringing the largest listed exchanges in Asia and Europe together could create new revenue streams and a lot depends on how well HKEx can capitalise on this,\" he wrote in a research report.",
    "Citigroup downgraded HKEX to 'sell' from 'buy', saying the acquisition price was high and could \"add downward pressure\" to the exchange's shares and valuation. Regulatory hurdles for the deal were also high, it said in its research note.",
    "Under the terms of the offer, LSE shareholders would receive 2,045 pence in cash and 2.495 newly issued HKEX shares. HKEX said it intended to apply for a secondary listing of its shares on the LSE if the deal went through.",
    "HKEX, whose main shareholder is the Hong Kong government, said its 31.6 billion pound ($38.97 billion) cash-and-share transaction proposal represented a 22.9% premium to the LSE's closing stock price on Tuesday of 8,361 pence. ",
    "The Hong Kong exchange's bid is considered a bet that a major international acquisition would help it overcome uncertainty at home.",
    "\"The transaction will require various regulatory approvals, which will stress-test the world's understanding of Hong Kong's 'one country, two systems' constitution,\" said David Blennerhassett, an independent analyst writing on the SmartKarma research platform.",
    "\"It will be politically tough now and in the near-term to get this through various regulatory channels,\" he added.",
    "($1 = 0.8110 pounds)"
  ],
  "published_datetime": "2019-09-11 09:48:00"
}