{
  "url": "https://www.nasdaq.com/article/5-reasons-to-buy-gold-etfs-as-price-may-touch-2000-cm1210634",
  "title": "5 Reasons to Buy Gold ETFs as Price May Touch $2000 - Nasdaq.com",
  "text": [
    " Gold prices have been on a tear, of late, with  SPDR Gold Shares GLD  rallying 11.8% (as of Sep 10, 2019) compared with the S&P 500's 3.2% gain. Heightened tensions related to the U.S.-China trade war in recent months have led to this upsurge. Investors should note that both parties hiked tariffs on Sep 1 in the latest round. The China government imposed higher tariffs on Sep 1 on the proportion of goods that only make up \"about  one third of the more than 5,000 product lines   listed in the latest announcement.\" Most of the duties will be implemented on Dec 15. China's latest move came on the heels of the U.S. government's Aug 1 announcement that it will impose a 10% tariff on $300 billion worth of Chinese goods. Washington delayed some of the tariffs on Aug 13 stating that those will be enacted in two tranches,  on Sep 1 and Dec 15  . However, following China's retaliation announcement, Trump said that he would \"raise tariffs on $250 billion worth of Chinese exports to  30% from 25% in October  .\" Moreover, tariffs planned on another $300 billion worth of Chinese goods have been revised to 15% from 10% (read:  August ETF Events That Grab Headlines  ).  Will Gold Top $2000 Any Time Soon?   Citigroup commodity analyst Edward Morse expects gold to top $2,000  an ounce over the next year or two, marking a roughly 33% surge from its current price of $1,499.60. Here we have laid out some reasons that could make this price target possible.  Trade Tensions Linger  Though China announced that its trade officials  will have talks   with U.S. counterparts in Washington early next month, the atmosphere still remains turbulent. Thus, markets will, undoubtedly, remain volatile, and prompt more attention for this safe-haven asset.  Global Bond Yields Likely to Slide  Thanks to renewed worries of a global growth slowdown, several global central banks have been banking on easy money policies, lately. In July, the Fed cut interest rates, with another anticipated in the coming days. This could keep the greenback subdued and boost gold. The ECB is also highly anticipated to ease its policy further or even restart QE at 40 billion euros per month ( per TD Securities  ). Investors should note that the Euro zone and Japan have already been practicing negative interest rates. Apart from these two, central banks in New Zealand, India, Thailand, South Korea, Indonesia, Turkey and South Africa resorted to rate cuts, in order to keep signs of a slowdown at bay. China too lowered its lending reference rate as part of a long-term modernization process  . Such low rates are encouraging for non-interest-bearing assets like gold (read: Play Global Bond ETFs to Join Central Banks' Rate Cut Euphoria  ).  Upcoming U.S. Presidential Election  The U.S. Presidential election due in November 2020 will likely make the market edgy. Poll results  will keep rolling in wherein one contesting party will have an upper hand one moment followed by another in the next moment. This, in turn, will keep boosting  gold prices  . Hence, prepare for a gold rush next year.  Brexit in the Cards  Britain's prime minister Boris Johnson has been an advertiser of a \"no deal\" Brexit and wants to sign a divorce paper with EU on Oct 31. Nevertheless, his proposals are not opposition free. KPMG projects that a no-deal Brexit could push Britain's economy toward recession in 2020  . This will likely keep investors jittery and lead to rise in gold prices (read: ETFs in Focus as a No-Deal Brexit May be in the Cards  ).  Upcoming Festive Season in India  India is one of the largest gold importers in the world. Though imports dropped to a three-year low in August on high prices, and may remain subdued if the prices continue being this high, an uptick in near-term demand is anticipated owing to the upcoming festive season. With the forthcoming wedding and festive season in India, gold prices will find another reason to flare up. Dhanteras, the first day of the festival Diwali, is in October this year. The occasion is marked by huge gold purchases. All these reasons could lead jewelers to stock the metal.  How to Play With ETFs  There are leveraged gold ETFs like VelocityShares 3x Long Gold ETN ( UGLD )  , ProShares Ultra Gold UGL  , DB Gold Double Long ETN DGP  , VelocityShares 3x Inverse Gold ETN DGLD  and so on. As far as regular ETFs are concerned, investors can play the products like  GLD  , iShares Gold Trust IAU  , Aberdeen Standard Physical Swiss Gold Shares ETF SGOL  , SPDR Gold MiniShares Trust GLDM  and GraniteShares Gold Trust BAR  (read: Here's Why Gold ETFs Are Set to Shine  ).  Want key ETF info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.   Get it free >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  ProShares Ultra Gold (UGL): ETF Research Reports   iShares Gold Trust (IAU): ETF Research Reports   VelocityShares 3x Long Gold ETN linked to the S&P GSCI Gold In (UGLD): ETF Research Reports   DB GD 2XL (DGP): ETF Research Reports   Aberdeen Standard Physical Gold Shares ETF (SGOL): ETF Research Reports   VelocityShares 3x Inverse Gold ETN linked to S&P GSCI Gold Ind (DGLD): ETF Research Reports   SPDR Gold Shares (GLD): ETF Research Reports   SPDR Gold MiniShares Trust (GLDM): ETF Research Reports   GraniteShares Gold Trust (BAR): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    "Gold prices have been on a tear, of late, with  SPDR Gold Shares GLD  rallying 11.8% (as of Sep 10, 2019) compared with the S&P 500's 3.2% gain. Heightened tensions related to the U.S.-China trade war in recent months have led to this upsurge.",
    "Investors should note that both parties hiked tariffs on Sep 1 in the latest round. The China government imposed higher tariffs on Sep 1 on the proportion of goods that only make up \"about  one third of the more than 5,000 product lines   listed in the latest announcement.\" Most of the duties will be implemented on Dec 15.",
    "China's latest move came on the heels of the U.S. government's Aug 1 announcement that it will impose a 10% tariff on $300 billion worth of Chinese goods. Washington delayed some of the tariffs on Aug 13 stating that those will be enacted in two tranches,  on Sep 1 and Dec 15  .",
    "However, following China's retaliation announcement, Trump said that he would \"raise tariffs on $250 billion worth of Chinese exports to  30% from 25% in October  .\" Moreover, tariffs planned on another $300 billion worth of Chinese goods have been revised to 15% from 10% (read:  August ETF Events That Grab Headlines  ).",
    " Will Gold Top $2000 Any Time Soon? ",
    " Citigroup commodity analyst Edward Morse expects gold to top $2,000  an ounce over the next year or two, marking a roughly 33% surge from its current price of $1,499.60.",
    "Here we have laid out some reasons that could make this price target possible.",
    " Trade Tensions Linger ",
    "Though China announced that its trade officials  will have talks   with U.S. counterparts in Washington early next month, the atmosphere still remains turbulent. Thus, markets will, undoubtedly, remain volatile, and prompt more attention for this safe-haven asset.",
    " Global Bond Yields Likely to Slide ",
    "Thanks to renewed worries of a global growth slowdown, several global central banks have been banking on easy money policies, lately. In July, the Fed cut interest rates, with another anticipated in the coming days. This could keep the greenback subdued and boost gold. The ECB is also highly anticipated to ease its policy further or even restart QE at 40 billion euros per month ( per TD Securities  ).",
    "Investors should note that the Euro zone and Japan have already been practicing negative interest rates. Apart from these two, central banks in New Zealand, India, Thailand, South Korea, Indonesia, Turkey and South Africa resorted to rate cuts, in order to keep signs of a slowdown at bay. China too lowered its lending reference rate as part of a long-term modernization process  . Such low rates are encouraging for non-interest-bearing assets like gold (read: Play Global Bond ETFs to Join Central Banks' Rate Cut Euphoria  ).",
    " Upcoming U.S. Presidential Election ",
    "The U.S. Presidential election due in November 2020 will likely make the market edgy. Poll results  will keep rolling in wherein one contesting party will have an upper hand one moment followed by another in the next moment. This, in turn, will keep boosting  gold prices  . Hence, prepare for a gold rush next year.",
    " Brexit in the Cards ",
    "Britain's prime minister Boris Johnson has been an advertiser of a \"no deal\" Brexit and wants to sign a divorce paper with EU on Oct 31. Nevertheless, his proposals are not opposition free. KPMG projects that a no-deal Brexit could push Britain's economy toward recession in 2020  . This will likely keep investors jittery and lead to rise in gold prices (read: ETFs in Focus as a No-Deal Brexit May be in the Cards  ).",
    " Upcoming Festive Season in India ",
    "India is one of the largest gold importers in the world. Though imports dropped to a three-year low in August on high prices, and may remain subdued if the prices continue being this high, an uptick in near-term demand is anticipated owing to the upcoming festive season.",
    "With the forthcoming wedding and festive season in India, gold prices will find another reason to flare up. Dhanteras, the first day of the festival Diwali, is in October this year. The occasion is marked by huge gold purchases. All these reasons could lead jewelers to stock the metal.",
    " How to Play With ETFs ",
    "There are leveraged gold ETFs like VelocityShares 3x Long Gold ETN ( UGLD )  , ProShares Ultra Gold UGL  , DB Gold Double Long ETN DGP  , VelocityShares 3x Inverse Gold ETN DGLD  and so on.",
    "As far as regular ETFs are concerned, investors can play the products like  GLD  , iShares Gold Trust IAU  , Aberdeen Standard Physical Swiss Gold Shares ETF SGOL  , SPDR Gold MiniShares Trust GLDM  and GraniteShares Gold Trust BAR  (read: Here's Why Gold ETFs Are Set to Shine  ).",
    " Want key ETF info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.   Get it free >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:00:00"
}