{
  "url": "https://www.nasdaq.com/article/portion-control-isnt-just-for-meal-time-cm1210836",
  "title": "Portion control isn’t just for meal time - Nasdaq.com",
  "text": [
    "   Late last summer, I returned to New York after two weeks at the Delaware Shore. Oddly, I felt horrible. I was at the highest weight of my life, with sluggish energy and general malaise. In fairness, for years, I pushed health and fitness behind work, believing that one had to come at the expense of the other. I needed change and tangible action to help me structure a path forward. I declared the balance of 2018, the \"Fall of Fitness\" and focused on some basics: exercise, sleep, nutrition and, perhaps most importantly, portion control. [storytout]Follow Martin on  Twitter.  [/storytout] I chose pre-portioned meal service for a while, and still use it for lunch. I got a food scale, even while mocked by some family and friends! I have spent a year getting an intuitive sense, through trial-and-error, of what good portions look like. (Some of my favorite visual cues for portion control are from the Mayo Clinic website  .) With exercise and diet, I dropped about 30 pounds, and am now aiming to add weight back in the form of lean muscle mass.  I feel much better too. How to fill your investment plate  What's this all have to do with investments? There are investing lessons to be learned from portion control and macro-nutrients; macros are the protein, fat and carb building blocks of nutrition. Investors often miss the idea of portion control. We ought to think of our overall investment portfolios in different portion sizes. We ought to be disciplined about the \"PPP\" too: the portion's portfolio purpose. For example, one PPP should be emergency funds: say, six to 12 months of rainy day, emergency money that stays invested in bank-guaranteed products at some reasonable yields. Certificates of deposit (CDs) and high-yield savings accounts can be useful tools for this portion. Another PPP might be a consumption goal, such as a home purchase against some timeline. Here a mix of stocks and bonds can help pave the way, typically though open-end mutual funds or exchange-traded funds (ETFs). Retirement is yet another PPP, aiming to deliver growth that can be translated into stable income to be spent down in retirement. Wagging the dog  My point is that most personal investors often let the tail wag the dog. Investment decisions should be guided by the purpose of the investment, and less so today's valuations or what's hot.  Spend some time first drawing up portion sizes. Then it's easier to decide the mix of investments that go on that plate. When working with a financial advisor, try to work up some portion sizing questions as a way to review your overall investment portfolio and broader financial planning. Last observation is about lazy versus recreational money. I still let myself work in \"cheat\" meals: dessert, a great bottle of wine and I am passionate about ice cream. I think the same can apply for investments. Some recreational money to play the markets is fine. Just portion it out sensibly. It's about what you do - in eating and investing - most of the time that counts. But, recreational money is different than lazy money. Lazy money is the money that builds up because you're not disciplined about portions. When dividends and cash build up in your brokerage and retirement accounts, get it back invested in line with your selected portions.  And, your investment goals will change as you go through life - same as your health and fitness - so re-apportion from time to time to reflect what you know and where you are going. We do know that financial and physical well-bring are related  . But, there are basic health and fitness disciplines that we ought to apply in our financial lives as well. Portion control can be a valuable guide for building toward your financial fitness goals. Looking for investment ideas? Here are some questions  to ask first.  Martin Small   is the Head of U.S. U.S. Wealth Advisory and a regular contributor to  The Blog  .  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 01:57:10"
}