{
  "url": "https://www.nasdaq.com/article/british-pm-johnson-kicks-off-election-campaign-as-parliament-blocks-nodeal-brexit-20190905-00176",
  "title": "British PM Johnson kicks off election campaign as parliament blocks no-deal Brexit - Nasdaq.com",
  "text": [
    "By Guy Faulconbridge and Elizabeth Piper",
    "LONDON, Sept 5 (Reuters) - British Prime Minister Boris Johnson was on Thursday kicking off what is in effect an election campaign, casting an alliance of opposition parties trying to block a 'no-deal' Brexit as defeatists surrendering to the European Union.",
    "As the United Kingdom spins towards a election, Brexit remains up in the air more than three years after Britons voted to leave the bloc in a 2016 referendum. Options range from a turbulent 'no-deal' exit to abandoning the whole endeavour.",
    "Behind the sound and the fury of the Brexit crisis, an election now beckons for a polarised country.",
    "The main choices on offer are Johnson's radical insistence on leaving the EU on Oct. 31, come what may, and Labour leader Jeremy Corbyn's hard-left socialist vision, coupled with a promise of a fresh referendum with an option to stay in the EU.",
    "\"Boris will argue that it is now time for the people to decide after parliament has failed them, so we can resolve this once and for all,\" a spokesman for the prime minister said.",
    "\"Jeremy Corbyn continues not only to block Brexit but is now also stopping the people having their say by refusing a general election.\"",
    "The opposition Labour Party cast Johnson's language - including calling Corbyn a \"chicken\" - as pathetic, said he was trying to act like U.S. President Donald Trump, and compared him to a 3-year-old toddler having a tantrum.",
    "An election adds a new twist to a Brexit crisis that has for three years overshadowed European Union affairs, eroded Britain's reputation as a stable pillar of the West and seen sterling twitch in tune to the probability of a 'no-deal' exit.",
    "Asked if Brexit would happen on Oct. 31, Johnson's senior adviser Dominic Cummings told Reuters: \"Trust the people.\"",
    "Against the dollar , the pound fell 0.3% to $1.2211, after jumping 1.4% on Wednesday on the sense that the prospect of a 'no-deal' exit had receded. UBS Global Wealth Management said sterling could rally to $1.30 if Brexit was delayed until January 2020 and an election was held after October. GBP/",
    "\"TRUST THE PEOPLE\"",
    "Johnson, the face of the 2016 Vote Leave campaign, has pushed for an election on Oct. 15, two weeks before the United Kingdom is due to leave the EU, though opposition parties are debating which date they would accept.",
    "\"We are saying, yeah, bring on an general election, of course,\" said John McDonnell, the Labour Party's second most powerful man.",
    "\"We will ensure that happens after we have got the legislation to protect against a 'no-deal' Brexit. But we will consult and do it on at the date on which we will think will have maximum advantage against a 'no-deal',\" he said.",
    "While sterling rose on parliament's bid to block a no-deal exit, an election before Brexit would allow him, if he won, to repeal the blocking bill, which was passed by 329-300 and then 327-299 in the House of Commons on Wednesday. The law will pass the upper house, the Lords, by Friday evening.",
    "Johnson's finance minister, Sajid Javid, opened up the possibility of a change to the Oct. 15 date but said the government could strike a renegotiated Brexit deal with Brussels and get it through parliament before Oct. 31.",
    "But the EU, and Germany and France in particular, have repeatedly called on Britain to make specific proposals on how it wants to change the agreement struck by Johnson's predecessor, Theresa May, in November.",
    "Diplomats said an election campaign would halt any Brexit talks with the EU and expressed frustration with the turmoil of British politics at such an important juncture in European history.",
    "\"The UK side continues to produce chaos and it is very hard to predict anything,\" said one EU diplomat.",
    "\nEikon Brexit overview page\n"
  ],
  "published_datetime": "2019-09-05 05:26:00"
}