{
  "url": "https://www.nasdaq.com/article/wait-out-the-market-funk-and-then-revisit-a-robotics-etf-cm1207252",
  "title": "Wait Out The Market Funk And Then Revisit A Robotics ETF - Nasdaq.com",
  "text": [
    "The current market decline is punishing growth fare and within that spectrum, exchange traded funds (ETFs) with highly nuanced investment niches  are suffering mightily.",
    "That is to be expected for at least two reasons. First, thematic ETFs, whether by incident or intent, are alpha-seeking in nature, meaning these funds  often deliver more upside than standard sector or industry fare in up markets. Second, as a result of that upside potential, many thematic ETFs are littered with growth and momentum stocks, the very factors that usually vulnerable to broader market declines.",
    "In part, those characteristics explain some of the recent malaise being endured by the Global X Robotics & Artificial Intelligence ETF (BOTZ). BOTZ, one of the largest ETFs focusing on the artificial intelligence (AI) and robotics themes, is off 20.35 percent from its 52-week, confirming a bear market. A cursory glance of BOTZ may not turn up much to like, but longer-term demand trends persist, making BOTZ a possible “buy on the dip” candidate.",
    "The Robots Are Coming",
    "Scores of academic studies and industry-level data point suggest the world is becoming increasingly automated and that robotics applications are developing at a fevered pitch. For BOTZ, one driver is increased demand for robots. If that isn't realized, the investment thesis is weakened. Fortunately, demand is quite robust.",
    "“In the first half of 2019, the North American industrial robotics market grew 7.2%,” according to the Robotics Industry Association (RIA) . “From January to June, North American companies ordered 16,488 industrial robots, valued at $869 million.”",
    "That statistic applies to just one market (North America) and just segment of the robotics universe (industrial). There are scores of other applications for robots, including semiconductors , healthcare innovation and consumer products, just to name a few.",
    "Courtesy: Robotics Industry Association",
    "Given the sophisticated array of components, parts and technology associated with robotics, meaning developers have to source products all over the world in some cases, it would be reasonable to expect that demand was hampered in the second quarter as the US/China trade imbroglio heightened. Price action in BOTZ suggests as much, but some data points indicate the ETF may have been punished too severely.",
    "“The RIA said in June 2019  orders of industrial robots in North America for Q1 2019 declined slightly in comparison with the first quarter of last year,” said the RIA. “From January through March 2019, North American companies ordered a total of 7,876 robots worth $423 million , said the RIA. That’s 3.5% fewer units and 3.2% less in value than in the first quarter of 2018.”",
    "Growth Ahead",
    "The RIA notes that in the second quarter, industrial robotics demand was $446 million in dollar terms. Even that figure is rounded up to the $500 million area, it represents less than one percent “of total capital spending by global industrial firms over the same span,” according to Barron's .",
    "That says industrial firms have substantial room to increase robotics spending and even a threefold increase would get the number to around a still minute $1.5 billion, confirming a potentially lucrative long-term trajectory for BOTZ.",
    "The $1.34 billion BOTZ has 39 holdings, which have an average market value of $12.22 billion, indicating that there is some volatility associated with the fund, it's not an ultra-turbulent small-cap growth product.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:47:35"
}