{
  "url": "https://www.nasdaq.com/article/4-big-time-dividend-stocks-with-marijuana-exposure-cm1210061",
  "title": "4 Big-Time Dividend Stocks With Marijuana Exposure - Nasdaq.com",
  "text": [
    " More often than not,    dividend   stocks are the foundation of great portfolios    and the X factor that leads to the creation of long-term wealth.   That's because dividend stocks offer investors a variety of   advantages. For starters, dividend stocks are a beacon of profitability   and have, historically, run circles around their   non-dividend-paying peers. This makes sense given that a company   is unlikely to pay a recurring dividend if it's not profitable   and doesn't have a time-tested business model. Furthermore, dividend stocks can help calm skittish investors   during inevitable stock market corrections.makeArticleAd(); Most important, though, is the fact that dividend income can   be reinvested back into more shares of dividend-paying stock in a   repeating pattern via a dividend reinvestment plan (DRIP). This   leads to larger dividend payments and more shares owned, and is   the same strategy that top-tier money managers use to create   wealth for their clients. Yet, what income investors may not realize is that they can   get recurring income from the fast-growing marijuana industry.   Here are four stocks that will not only put a dividend in your   pocket, but give you direct or indirect cannabis exposure.   Image source: Getty Images.   Altria  Although it's known as a U.S. tobacco giant,   Altria    (NYSE: MO) -- and its delectable 7.7% yield -- gives investors   exposure to the pot industry via its equity investment in   Cronos Group    (NASDAQ: CRON) . In March, Altria completed a deal that sent   $1.8 billion in cash to Cronos Group    in exchange for a non-diluted 45% stake in the cannabis company.   Aside from the fact that Cronos desperately needed cash, with   less than $25 million on its books when the equity investment   closed, the partnership with Altria could prove invaluable.   That's because Altria is a minority stakeholder in vaping device   Juul, and obviously has a wealth of knowledge in how to market   vice products to consumers. What's really exciting about this partnership is that   derivative cannabis products, such as vapes, are   set to hit dispensary shelves in Canada by   mid-December    . Derivatives sport considerably higher margins than dried   flower, so their launch is highly anticipated. Although estimates   on derivative sales vary, the overwhelming consensus is that   vapes and vape accessories will lead all other derivatives in   aggregate annual revenue. Clearly, tobacco will continue to generate the lion's share of   Altria's sales, and that's not going to change anytime soon. But   as Cronos Group matures and grows as a marijuana company, Altria   could begin to see its cannabis exposure pay off.   Image source: Getty Images.   Constellation Brands  Corona and Modelo beer maker   Constellation Brands    (NYSE: STZ) is another company with a portfolio of brand-name   products that can give investors exposure to cannabis with   recurring dividend income. Constellation's payout of 1.5%   annually is considerably more modest than Altria's high-yield   stipend. The company's tie-ins to the cannabis landscape are derived   from its   $4 billion equity investment    in   Canopy Growth    (NYSE: CGC) , the largest marijuana stock in the world by market   cap. In November, Constellation's investment in Canopy closed --   this was its third such investment in Canopy -- boosting its   stake in the company to 37%. This investment also allowed   Constellation Brands to place two of its executives and two   independent directors on Canopy Growth's board. Constellation aims to benefit from its investment in Canopy   Growth   in a variety of ways    . The duo will certainly be working on nonalcoholic infused   cannabis beverages, but will also lean on each other's expertise   to grow globally. Canopy's marijuana knowledge, branding, and   early stage partnerships coupled with Constellation's marketing   prowess and global reach should allow for a symbiotic   partnership. Of course, similar to Altria, Constellation Brands will   continue to generate nearly all of its sales and income from   beer, wine, and spirit sales.   Image source: Getty Images.   Scotts Miracle-Gro  Income investors can also net   indirect exposure to cannabis    through ownership in   Scotts Miracle-Gro    (NYSE: SMG) , which is currently sporting a 2.1% yield. Scotts is a company homeowners probably know best as providing   lawn and garden care products. Farmers will also be familiar with   Scotts Miracle-Gro for the crop-yield-boosting products it   provides. But what you may not realize is that its subsidiary,   Hawthorne Gardening, is focused on supporting the medical   marijuana industry in the United States. Hawthorne Gardening supplies hydroponic products for growers   -- i.e., growing cannabis plants in a nutrient-rich water   solvent, as opposed to soil -- as well as lighting, soil, and   nutrient solutions. Following the   acquisition of Sunlight Supply last year for $450   million    , Scotts Miracle-Gro's subsidiary has an even more expansive   product portfolio for the medical weed industry, and it could   wind up accounting for more than 20% of Scotts' sales in the   not-so-distant future. Given the rapid growth of marijuana in the   North American market, Hawthorne has a chance to really move the   needle for Scotts Miracle-Gro in the years to come.   Image source: Getty Images.   Innovative Industrial Properties  Lastly, income investors could always consider   Innovative Industrial Properties    (NYSE: IIPR) , which is the   only cannabis stock    that will give investors direct exposure to the high-growth   industry. IIP, as the company is known, is paying out 2.7% at the   moment. Innovative Industrial Properties is a cannabis real estate   investment trust (REIT). This means it acquires land and   buildings that are used in the growing or processing of medical   marijuana, then leases out these properties for an extended   period of time, reaping the rewards of rental income in the   process. After beginning the year with 11 properties in its   portfolio, IIP now has 27 properties spanning 12 states, with   $264.2 million invested thus far, and another $96.5 million   earmarked for construction and tenant improvements. Following its most recent property acquisition, Innovative   Industrial Properties notes that it's achieving an average yield   on invested capital of 14.5%. Put in another context, it should   take IIP less than five years to completely recoup all of the   money it's invested. What's more, IIP passes along a 3.25% annual   rental increase to its tenants, ensuring that it's able to grow   organically and keep up with inflation. Though REITs are   susceptible to share-based dilution    as they raise capital for further investment, their cash flow   tends to be highly predictable. That makes IIP an excellent   candidate to continue paying a healthy yield.   Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.         And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018. And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution. Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks. Simply click here to get the full story now.  Learn more     Sean Williams      has no position in any of the stocks mentioned. The Motley Fool     recommends Constellation Brands and Innovative Industrial     Properties. The Motley Fool has a     disclosure policy      .  ",
    "More often than not,    dividend   stocks are the foundation of great portfolios    and the X factor that leads to the creation of long-term wealth.   That's because dividend stocks offer investors a variety of   advantages.",
    "For starters, dividend stocks are a beacon of profitability   and have, historically, run circles around their   non-dividend-paying peers. This makes sense given that a company   is unlikely to pay a recurring dividend if it's not profitable   and doesn't have a time-tested business model.",
    "Furthermore, dividend stocks can help calm skittish investors   during inevitable stock market corrections.",
    "Most important, though, is the fact that dividend income can   be reinvested back into more shares of dividend-paying stock in a   repeating pattern via a dividend reinvestment plan (DRIP). This   leads to larger dividend payments and more shares owned, and is   the same strategy that top-tier money managers use to create   wealth for their clients.",
    "Yet, what income investors may not realize is that they can   get recurring income from the fast-growing marijuana industry.   Here are four stocks that will not only put a dividend in your   pocket, but give you direct or indirect cannabis exposure.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Although it's known as a U.S. tobacco giant,   Altria    (NYSE: MO) -- and its delectable 7.7% yield -- gives investors   exposure to the pot industry via its equity investment in   Cronos Group    (NASDAQ: CRON) .",
    "In March, Altria completed a deal that sent   $1.8 billion in cash to Cronos Group    in exchange for a non-diluted 45% stake in the cannabis company.   Aside from the fact that Cronos desperately needed cash, with   less than $25 million on its books when the equity investment   closed, the partnership with Altria could prove invaluable.   That's because Altria is a minority stakeholder in vaping device   Juul, and obviously has a wealth of knowledge in how to market   vice products to consumers.",
    "What's really exciting about this partnership is that   derivative cannabis products, such as vapes, are   set to hit dispensary shelves in Canada by   mid-December    . Derivatives sport considerably higher margins than dried   flower, so their launch is highly anticipated. Although estimates   on derivative sales vary, the overwhelming consensus is that   vapes and vape accessories will lead all other derivatives in   aggregate annual revenue.",
    "Clearly, tobacco will continue to generate the lion's share of   Altria's sales, and that's not going to change anytime soon. But   as Cronos Group matures and grows as a marijuana company, Altria   could begin to see its cannabis exposure pay off.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Corona and Modelo beer maker   Constellation Brands    (NYSE: STZ) is another company with a portfolio of brand-name   products that can give investors exposure to cannabis with   recurring dividend income. Constellation's payout of 1.5%   annually is considerably more modest than Altria's high-yield   stipend.",
    "The company's tie-ins to the cannabis landscape are derived   from its   $4 billion equity investment    in   Canopy Growth    (NYSE: CGC) , the largest marijuana stock in the world by market   cap. In November, Constellation's investment in Canopy closed --   this was its third such investment in Canopy -- boosting its   stake in the company to 37%. This investment also allowed   Constellation Brands to place two of its executives and two   independent directors on Canopy Growth's board.",
    "Constellation aims to benefit from its investment in Canopy   Growth   in a variety of ways    . The duo will certainly be working on nonalcoholic infused   cannabis beverages, but will also lean on each other's expertise   to grow globally. Canopy's marijuana knowledge, branding, and   early stage partnerships coupled with Constellation's marketing   prowess and global reach should allow for a symbiotic   partnership.",
    "Of course, similar to Altria, Constellation Brands will   continue to generate nearly all of its sales and income from   beer, wine, and spirit sales.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Income investors can also net   indirect exposure to cannabis    through ownership in   Scotts Miracle-Gro    (NYSE: SMG) , which is currently sporting a 2.1% yield.",
    "Scotts is a company homeowners probably know best as providing   lawn and garden care products. Farmers will also be familiar with   Scotts Miracle-Gro for the crop-yield-boosting products it   provides. But what you may not realize is that its subsidiary,   Hawthorne Gardening, is focused on supporting the medical   marijuana industry in the United States.",
    "Hawthorne Gardening supplies hydroponic products for growers   -- i.e., growing cannabis plants in a nutrient-rich water   solvent, as opposed to soil -- as well as lighting, soil, and   nutrient solutions. Following the   acquisition of Sunlight Supply last year for $450   million    , Scotts Miracle-Gro's subsidiary has an even more expansive   product portfolio for the medical weed industry, and it could   wind up accounting for more than 20% of Scotts' sales in the   not-so-distant future. Given the rapid growth of marijuana in the   North American market, Hawthorne has a chance to really move the   needle for Scotts Miracle-Gro in the years to come.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Lastly, income investors could always consider   Innovative Industrial Properties    (NYSE: IIPR) , which is the   only cannabis stock    that will give investors direct exposure to the high-growth   industry. IIP, as the company is known, is paying out 2.7% at the   moment.",
    "Innovative Industrial Properties is a cannabis real estate   investment trust (REIT). This means it acquires land and   buildings that are used in the growing or processing of medical   marijuana, then leases out these properties for an extended   period of time, reaping the rewards of rental income in the   process. After beginning the year with 11 properties in its   portfolio, IIP now has 27 properties spanning 12 states, with   $264.2 million invested thus far, and another $96.5 million   earmarked for construction and tenant improvements.",
    "Following its most recent property acquisition, Innovative   Industrial Properties notes that it's achieving an average yield   on invested capital of 14.5%. Put in another context, it should   take IIP less than five years to completely recoup all of the   money it's invested. What's more, IIP passes along a 3.25% annual   rental increase to its tenants, ensuring that it's able to grow   organically and keep up with inflation.",
    "Though REITs are   susceptible to share-based dilution    as they raise capital for further investment, their cash flow   tends to be highly predictable. That makes IIP an excellent   candidate to continue paying a healthy yield.",
    "  Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.         And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018. And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution. Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks. Simply click here to get the full story now.  Learn more  ",
    " Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.        ",
    "And make no mistake - it is coming.",
    "Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018.",
    "And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution.",
    "Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks.",
    "Simply click here to get the full story now.",
    " Learn more ",
    "  Sean Williams      has no position in any of the stocks mentioned. The Motley Fool     recommends Constellation Brands and Innovative Industrial     Properties. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:21:00"
}