{
  "url": "https://www.nasdaq.com/article/chinese-national-convicted-for-trespassing-at-trumps-florida-resort-20190911-00787",
  "title": "Chinese national convicted for trespassing at Trump's Florida resort - Nasdaq.com",
  "text": [
    "By Erik Bojnansky",
    "FORT LAUDERDALE, Fla., Sept 11 (Reuters) - A Chinese national arrested for bluffing her way into U.S. President Donald Trump's Mar-a-Lago Florida resort, sparking concerns she could pose an intelligence threat, was found guilty on Wednesday of lying to a federal officer and trespassing.",
    "The woman, Yujing Zhang, 33, stood blinking rapidly as each of the 12 jurors told U.S. District Judge Roy Altman they agreed with the verdict convicting her on all counts, a decision reached after roughly four hours of deliberation following a two-day trial.",
    "Flanked by two U.S. marshals, Zhang listened to the verdict and to the judge order her remanded to the Federal Bureau of Prisons. She was led out of the Fort Lauderdale courtroom without incident, smiling politely and wearing the same pink shirt and tan pants she has worn since she changed out of her brown jail garb at the start of the trial after a small brouhaha over missing undergarments.",
    "Zhang made international headlines in March when she was arrested carrying multiple electronic devices at Mar-a-Lago in Palm Beach.",
    "Baffling behavior marked Zhang's trial in U.S. District Court in Fort Lauderdale from the start. She insisted on acting as her own lawyer despite Judge Altman's entreaties.",
    "She also delayed the start of jury selection on Monday by complaining that she did not have the correct underwear she needed for the trial.",
    "The central question of what precisely Zhang was doing at the Trump private property remained unanswered, with prosecutors offering no explanation in court for her motives. Zhang's actions at the resort sparked concerns that she might have been a spy, though she was charged only with trespassing and making false statements.",
    "Prosecutors focused on trying to prove she used deception to gain unlawful access to private property.",
    "Zhang insisted she was entitled to admission to Mar-a-Lago by way of a contract for which she had paid $20,000 to attend a U.S.-China economic development event at the resort.",
    "\"I did nothing wrong,\" she told jurors in halting English in her closing argument. \"I did not lie.\"",
    "Assistant U.S. Attorney Rolando Garcia countered that Zhang had been notified in advance that the event she had planned to attend had been canceled and that she had demanded her money back.",
    "Garcia also detailed how Zhang allegedly hoodwinked U.S. Secret Service agents to get past resort security checkpoints and onto the property, in part by passing herself off as the relative of an actual club member of the same name.",
    "\"She knew she wasn't supposed to be there,\" Garcia said.",
    "At the time of her arrest, Zhang had four cellphones, a laptop computer, an external hard drive and a thumb drive later found to contain \"malicious malware\" in her possession, the Secret Service said in a court filing.",
    "A search of Zhang's Palm Beach hotel room reportedly uncovered a device meant to detect hidden cameras and nearly $8,000 in cash.",
    "Some U.S. experts say her attempt to enter the club was so clumsy that while she has been linked to the Chinese Communist Party in Beijing, it was hard to believe she was a professional spy.",
    "Speaking in Beijing on Tuesday, Chinese Foreign Ministry spokeswoman Hua Chunying said she had \"not heard\" anything about Zhang having any connection to the Chinese government."
  ],
  "published_datetime": "2019-09-11 02:29:00"
}