{
  "url": "https://www.nasdaq.com/article/accenture-to-help-sap-enhance-recipe-development-application-cm1210373",
  "title": "Accenture to Help SAP Enhance Recipe Development Application - Nasdaq.com",
  "text": [
    "  Accenture plc ACN  yesterday announced that it is partnering with SAP to enhance capabilities for the SAP Recipe Development application. Useful to process industry participants such as consumer goods, life sciences and chemical companies, the application uses real-time collaborative processes to provide calculations on costs, nutrients or ingredients on a single screen. It helps streamline product development, optimize supply chains and reduce wastes. With enhanced capabilities, the application will be able to share up-to-date information on costs, nutrients and compliance, and details reflecting vegetarian or vegan products, across the entire recipe development process. Nestlé is one of the first companies planning to use the enhanced solution. We believe that this partnership will benefit Accenture's Product segment that serves consumer goods and life sciences companies, and Resources Segment that serves chemical companies. Both segments did well in the las t report  ed quarter. Products revenues of $3.08 billion increased 4% year over year on a reported basis and 8% in local currency. Resources revenues of $1.75 billion increased 13% year over year on a reported basis and 19% in terms of local currency. We observe that shares of Accenture have gained 34.5% year to date, outperforming the 31.2% rally of the industry  it belongs to.     Zacks Rank and Stocks to Consider  Accenture currently carries a Zacks Rank #3 (Hold). Some better-ranked stocks in the broader Zacks  Business Services   sector are Huron Consulting HURN  , Charles River Associates CRAI  and Nielsen NLSN  , each carrying a Zacks Rank #2 (Buy). Long-term expected earnings (three to five years) growth rate for Huron, Charles River and Nielsen is 13.5%, 13% and 12%, respectively. You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana. Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Nielsen Holdings Plc (NLSN): Free Stock Analysis Report   Huron Consulting Group Inc. (HURN): Free Stock Analysis Report   Accenture PLC (ACN): Free Stock Analysis Report   Charles River Associates (CRAI): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " Accenture plc ACN  yesterday announced that it is partnering with SAP to enhance capabilities for the SAP Recipe Development application.",
    "Useful to process industry participants such as consumer goods, life sciences and chemical companies, the application uses real-time collaborative processes to provide calculations on costs, nutrients or ingredients on a single screen. It helps streamline product development, optimize supply chains and reduce wastes.",
    "With enhanced capabilities, the application will be able to share up-to-date information on costs, nutrients and compliance, and details reflecting vegetarian or vegan products, across the entire recipe development process. Nestlé is one of the first companies planning to use the enhanced solution.",
    "We believe that this partnership will benefit Accenture's Product segment that serves consumer goods and life sciences companies, and Resources Segment that serves chemical companies.",
    "Both segments did well in the las t report  ed quarter. Products revenues of $3.08 billion increased 4% year over year on a reported basis and 8% in local currency. Resources revenues of $1.75 billion increased 13% year over year on a reported basis and 19% in terms of local currency.",
    "We observe that shares of Accenture have gained 34.5% year to date, outperforming the 31.2% rally of the industry  it belongs to.",
    " Zacks Rank and Stocks to Consider ",
    "Accenture currently carries a Zacks Rank #3 (Hold).",
    "Some better-ranked stocks in the broader Zacks  Business Services   sector are Huron Consulting HURN  , Charles River Associates CRAI  and Nielsen NLSN  , each carrying a Zacks Rank #2 (Buy). Long-term expected earnings (three to five years) growth rate for Huron, Charles River and Nielsen is 13.5%, 13% and 12%, respectively. You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:09:00"
}