{
  "url": "https://www.nasdaq.com/article/why-uber-and-lyft-stock-prices-look-like-opportunity-to-me-cm1207195",
  "title": "Why UBER and LYFT Stock Prices Look Like Opportunity To Me - Nasdaq.com",
  "text": [
    "As remarkable as it is, the story of Amazon (AMZN) has created a problem for investors. I’m not talking about the obvious problem created by their dominance of certain areas of retail, but rather a more subtle one: It seems that every company these days, or at least every tech company, wants to adopt the same model, sacrificing profit for growth.",
    "That has led to a pattern in big tech stocks post-IPO that we are seeing repeated in both the public ride-sharing companies, Uber (UBER) and Lyft (LYFT). Both hit new lows yesterday, but the question for investors is, is that a warning sign or a long-term opportunity?",
    "At some point not long after they go public, shares in these type of tech companies tend to fall dramatically below their offering price. That may happen quickly, as it did with LYFT, or after a brief time, as happened with UBER, but it usually happens within months of the offering. To assess whether it is worth buying on that drop, it is important to understand what drives it, and to look at other examples of the same phenomenon.",
    "The main reason for a drop like that is obvious. Early, private investors want to see growth, but shareholders in public companies generally want to see profits. At the very least they want a clear path to profitability in the future.",
    "These types of companies, however, inspired by the history of Amazon, don’t feel that is a priority early on. They are open about it too. Uber CEO Dara Khosrowshahi said before they went public that they wanted to be the “Amazon of transportation.” You would think that that is fair warning, but stockholders are still dismayed by consistent losses.",
    "That is understandable in an historical context. What people forget about Amazon is that while they weren’t focused on profits in the early days, they didn’t run up huge losses either. They showed the ability to make money when they chose to do so. Operating at a small loss or effectively flat was therefore obviously a choice too.",
    "Investors aren’t currently convinced that the same can be said of Uber and Lyft, but Khosrowshahi's words suggest that it may be just that and that there is a path to profitability. It’s just that neither Uber nor Lyft are choosing to take it right now. If you believe in the industry though, you have to believe they will make that choice at some time in the future.",
    "The best post-IPO comparison for the ride-sharing companies is probably to social media stocks. That industry too was potentially revolutionary and would have an impact on our daily lives. Both Facebook (FB) and Twitter (TWTR) followed the pattern of a big drop below their offering price after their IPOs, but both have subsequently made significant gains from their lows.",
    "The two cases are quite different in one respect though. While Twitter did follow the “Amazon model” of prioritizing growth over profit to the point where they were losing consistently for a while, Facebook has never reported negative earnings as a public company. Yet, a couple of months after their IPO, their stock fell to less than half its offering price.",
    "Amazon came under pressure in their early days, despite being profitable. Again, it seems absurd with 20/20 hindsight, but it was not uncommon at the turn of the century to hear people say that online shopping was just a fad that would never really catch on. I mean, who wants to buy clothes without trying them on, or anything without seeing and touching it, right?",
    "So, while profit is important, there is obviously something else going on here. It seems that investors often just can’t grasp the potential of these disruptive new businesses. Articles like this from 2011, suggesting that social media was just a fad, may look a bit ridiculous now, but they were common enough at that time.",
    "The fact that both UBER and LYFT hit all-time lows around the same time suggests that there is a similar thing going on here.",
    "The question for potential investors then is, do you think ride sharing is just a fad? If you do, then follow those that doubted e-commerce and social media and sell, or at least stay away from UBER and LYFT. If, on the other hand, you cannot imagine us going back to a time when taxis were taxis and we waited in line for them, adding small amounts of one or both of those stocks to your long-term holdings on drops like this makes sense.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:22:33"
}