{
  "url": "https://www.nasdaq.com/article/huawei-says-us-enticing-coercing-staff-to-provide-company-info-20190903-01112",
  "title": "Huawei says U.S. enticing, coercing staff to provide company info - Nasdaq.com",
  "text": [
    "By Foo Yun Chee",
    "BRUSSELS, Sept 3 (Reuters) - China'sHuawei Technologies  on Tuesday said the U.S. government had instructed law enforcement to \"coerce\" and \"entice\" its employees to turn against the company, as it steps up its pushback against a U.S. campaign that could threaten its survival.",
    "Huawei made its assertions in a news release on Tuesday and in an undated document seen by Reuters.",
    "Huawei on Tuesday said the U.S. government was using its judicial and administrative powers as well as other means to disrupt its business and that of its partners.",
    "A Justice Department spokesman said that while they do not comment on specific investigations, \"in all matters, our investigative techniques comply with the law and all subjects of investigations enjoy the same rights to due process afforded by our Constitution and safeguarded by an independent judiciary.\"",
    "Huawei said in its public statement that staff and Huawei partners were subjected to unlawful searches, detention and arrest while some employees were visited by FBI agents at their homes and pressured to collect information on the company.",
    "According to the Huawei document, eight employees, several of them U.S. citizens, were involved in the incidents. All of them are mid- to high-level executives. The latest incident happened on Aug. 28 when an employee from Huawei's U.S. office informed the company of a visit from the FBI asking the person to be an informant.",
    "The Justice Department said the FBI would not have a separate comment.",
    "Huawei did not provide any evidence for its accusations, saying that their employees had reported them to the company. Reuters could not independently confirm the information provided by Huawei.",
    "Since the start of this year, at least three U.S. employees have been contacted by U.S. law enforcement agencies, the Huawei document said.",
    "Beyond the accusations of putting pressure on its employees, Huawei also claimed that the U.S. government was launching cyber attacks on the company and mobilising companies that work with Huawei to bring unsubstantiated accusations. The document did not provide specific details about these efforts.",
    "The company also accused U.S. authorities of selectively launching criminal investigations based on civil cases that have already been settled and filing criminal charges based on claims of technology theft.",
    "\"The fact remains that none of Huawei's core technology has been the subject of any criminal case brought against the company, and none of the accusations levied by the U.S. government have been supported with sufficient evidence,\" the company said."
  ],
  "published_datetime": "2019-09-03 16:00:00"
}