{
  "url": "https://www.nasdaq.com/article/tsx-futures-down-on-lower-oil-prices-20190903-00452",
  "title": "TSX futures down on lower oil prices - Nasdaq.com",
  "text": [
    "Sep 3 (Reuters) - Futures for Canada's main stock index were down on Tuesday, as oil prices fell due to the ongoing U.S.-China trade dispute as well as rising OPEC and Russian oil output.",
    "September futures on the S&P/TSX index  were down 0.22% at 7:15 a.m. ET.",
    "Canada's Markit manufacturing data is due at 09:30 a.m. ET",
    "Dow Jones Industrial Average e-mini futures  were down 0.79% at 7:15 a.m. ET, while S&P 500 e-mini futures  were down 0.74% and Nasdaq 100 e-mini futures  were down 0.84%. ",
    "TOP STORIES TOP/CAN",
    "Greece's new conservative government will soon issue permits for Canadian miner Eldorado Gold's  development in northern Greece, its energy ministry said on Monday. ",
    "Enbridge Inc  said it reached an agreement with shippers to place the Canadian portion of the Line 3 replacement pipeline into service by the end of this year. ",
    "Canadian retailer Hudson's Bay  will close its Dutch stores by the end of 2019, laying off some 1,400 employees, the Dutch business daily Financieel Dagblad reported on Saturday. ",
    "ANALYST RESEARCH HIGHLIGHTS RCH/CA",
    "AltaGas Canada Inc : JPMorgan raises target price to C$23 from C$22",
    "Cronos Group Inc : Cowen and Company cuts target price to C$17 from C$21",
    "Denison Mines Corp : Eight Capital raises target price to C$1.80 from C$1.70",
    "COMMODITIES AT 7:15 a.m. ET COM/WRAP",
    "Gold futures : $1532.4; +0.62 percent GOL/",
    "US crude : $54.07; -1.87 percent O/R",
    "Brent crude : $57.76; -1.53 percent O/R",
    "U.S. ECONOMIC DATA DUE ON TUESDAY",
    "0945 Markit Manufacturing PMI Final for Aug: Prior 49.9",
    "1000 Construction spending mm for Jul: Expected 0.3%; Prior -1.3%",
    "1000 ISM Manufacturing PMI for Aug: Expected 51.1; Prior 51.2",
    "1000 ISM Manufacturing Prices Paid for Aug: Expected 45.8; Prior 45.1",
    "1000 ISM Manufacturing Employment Index for Aug: Prior 51.7",
    "1000 ISM Manufacturing New Orders Index for Aug: Prior 50.8",
    "($1 = C$1.33)"
  ],
  "published_datetime": "2019-09-03 07:25:00"
}