{
  "url": "https://www.nasdaq.com/article/biotech-stock-roundup-regn-wins-against-amgn-vrtx-to-acquire-semma-more-cm1207300",
  "title": "Biotech Stock Roundup: REGN Wins Against AMGN, VRTX to Acquire Semma & More - Nasdaq.com",
  "text": [
    " It was a low-key week for the biotech sector, with updates from only a few players. While Regeneron REGN  won a long-standing duel against rival Amgen AMGN  , Vertex VRTX  is looking to diversify its pipeline with small tuck-in acquisitions. Meanwhile, there were a few updates from smaller biotechs as well.    Recap of the Week's Most Important Stories    :   Regeneron-Sanofi Get Favorable Ruling Against Amgen in   Court   : Regeneron and partner Sanofi SNY announced  that the U.S. District Court for the District of Delaware ruled in their favor in the ongoing litigation for PCSK9 inhibitor Praluent's (alirocumab) patent against rival Amgen, which has its own PCSK9 inhibitor, Repatha. The court determined that Amgen's asserted patent claims for antibodies targeting PCSK9 (proprotein convertase subtilisin/kexin type 9) are invalid based on lack of enablement. The latest ruling overturned portions of an earlier jury verdict upholding the validity of three claims. In February 2019, a jury determined two other asserted Amgen patent claims to be invalid. As a result, Regeneron and Sanofi have successfully invalidated all five asserted Amgen patent claims. The companies have been involved in a longstanding duel regarding Praluent and Repatha, whereby Amgen is trying to prevent the manufacture, use and sale of Praluent, claiming infringement of patents.   Vertex to Acquire Semma Therapeutics   : Vertex Pharmaceuticals announced that it will acquire the privately-held biotechnology company, Semma Therapeutics, for $950 million. Semma focuses on the use of stem cell-derived human islets as a potentially curative treatment for type 1 diabetes. Semma will become a separate operating subsidiary of Vertex. With the acquisition, Vertex aims to develop curative cell-based treatments for type 1 diabetes. The acquisition will close in the fourth quarter of 2019. The company will update its financial guidance for 2019 along with its third-quarter 2019 earnings release or upon closing the transaction, whichever occurs later. The acquisition will further diversify its non-CF pipeline, owing to the addition of a therapeutic option for type I diabetes. Vertex currently carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .   Fate Gets FDA Nod for IND Application of Cell Cancer   Immunotherapy   :  Fate Therapeutics, Inc. FATE  announced that the FDA has cleared its Investigational New Drug (IND) application for pipeline candidate, FT596. The candidate is the company's first off-the-shelf chimeric antigen receptor (CAR) natural killer (NK) cell cancer immunotherapy, which targets multiple tumor-associated antigens. Fate plans to evaluate FT596 as a monotherapy and in combination with CD20-directed monoclonal antibodies for the treatment of B-cell lymphoma and chronic lymphocytic leukemia. Fate is already conducting the first-in-human clinical trials of FT516, an off-the-shelf NK cell cancer immunotherapy engineered to express hnCD16, for the treatment of acute myeloid leukemia and B-cell lymphoma. It is also evaluating FT500, an off-the-shelf NK cell cancer immunotherapy, for the treatment of advanced solid tumors.   Ardelyx Soars on News of Study Success   :  Shares of Ardelyx, Inc. ARDX  surged significantly after the company announced that its late-stage study on tenapanor in combination with phosphate binders in patients with chronic kidney disease (CKD) met the primary and all key secondary endpoints. These patients were on dialysis and their hyperphosphatemia was not previously controlled with binders alone. Tenapanor in combination with binders met the primary endpoint, demonstrating a statistically significant reduction of serum phosphorus compared to binders alone. Approximately two times more patients achieved the established serum phosphorus treatment goal of less than 5.5mg/dL in the tenapanor arm compared to binders alone for each week of treatment. The company plans to report results from its second phase III monotherapy study, PHREEDOM, in the fourth quarter.   Akari Gets Orphan Drug Designation for Lead   Candidate   : Akari Therapeutics, Plc AKTX  announced that the FDA has granted an Orphan Drug designation to its lead pipeline candidate, nomacopan, for the treatment of hematopoietic stem cell transplantation-associated thrombotic microangiopathy (HSCT-TMA). Last month, the FDA granted a Fast Track designation to nomacopan for the same indication in the pediatric patient population. Akari plans to begin a pivotal study on the candidate for HSCT-TMA in the fourth quarter of 2019.  Performance  The Nasdaq Biotechnology index lost 3.72% in the last four trading sessions. Among the biotech giants, Regeneron gained 1.32% in the period. Over the past six months, shares of Celgene have gained 12.97%, whereas the Regeneron stock has slumped 34.28%. (See the last biotech stock roundup here:  Biotech Stock Roundup: AMGN to Buy CELG's Otezla,   ALXN's Soliris Gets EC Nod & More   )         What's Next in Biotech?  Stay tuned for more pipeline updates.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Sanofi (SNY): Free Stock Analysis Report   Regeneron Pharmaceuticals, Inc. (REGN): Free Stock Analysis Report   Amgen Inc. (AMGN): Free Stock Analysis Report   Vertex Pharmaceuticals Incorporated (VRTX): Free Stock Analysis Report   Fate Therapeutics, Inc. (FATE): Free Stock Analysis Report   Ardelyx, Inc. (ARDX): Free Stock Analysis Report   Akari Therapeutics PLC (AKTX): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "It was a low-key week for the biotech sector, with updates from only a few players. While Regeneron REGN  won a long-standing duel against rival Amgen AMGN  , Vertex VRTX  is looking to diversify its pipeline with small tuck-in acquisitions. Meanwhile, there were a few updates from smaller biotechs as well.",
    "   Recap of the Week's Most Important Stories    :",
    "  Regeneron-Sanofi Get Favorable Ruling Against Amgen in   Court   : Regeneron and partner Sanofi SNY announced  that the U.S. District Court for the District of Delaware ruled in their favor in the ongoing litigation for PCSK9 inhibitor Praluent's (alirocumab) patent against rival Amgen, which has its own PCSK9 inhibitor, Repatha. The court determined that Amgen's asserted patent claims for antibodies targeting PCSK9 (proprotein convertase subtilisin/kexin type 9) are invalid based on lack of enablement. The latest ruling overturned portions of an earlier jury verdict upholding the validity of three claims. In February 2019, a jury determined two other asserted Amgen patent claims to be invalid. As a result, Regeneron and Sanofi have successfully invalidated all five asserted Amgen patent claims. The companies have been involved in a longstanding duel regarding Praluent and Repatha, whereby Amgen is trying to prevent the manufacture, use and sale of Praluent, claiming infringement of patents.",
    "  Vertex to Acquire Semma Therapeutics   : Vertex Pharmaceuticals announced that it will acquire the privately-held biotechnology company, Semma Therapeutics, for $950 million. Semma focuses on the use of stem cell-derived human islets as a potentially curative treatment for type 1 diabetes. Semma will become a separate operating subsidiary of Vertex. With the acquisition, Vertex aims to develop curative cell-based treatments for type 1 diabetes. The acquisition will close in the fourth quarter of 2019. The company will update its financial guidance for 2019 along with its third-quarter 2019 earnings release or upon closing the transaction, whichever occurs later. The acquisition will further diversify its non-CF pipeline, owing to the addition of a therapeutic option for type I diabetes.",
    "Vertex currently carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    "  Fate Gets FDA Nod for IND Application of Cell Cancer   Immunotherapy   :  Fate Therapeutics, Inc. FATE  announced that the FDA has cleared its Investigational New Drug (IND) application for pipeline candidate, FT596. The candidate is the company's first off-the-shelf chimeric antigen receptor (CAR) natural killer (NK) cell cancer immunotherapy, which targets multiple tumor-associated antigens. Fate plans to evaluate FT596 as a monotherapy and in combination with CD20-directed monoclonal antibodies for the treatment of B-cell lymphoma and chronic lymphocytic leukemia. Fate is already conducting the first-in-human clinical trials of FT516, an off-the-shelf NK cell cancer immunotherapy engineered to express hnCD16, for the treatment of acute myeloid leukemia and B-cell lymphoma. It is also evaluating FT500, an off-the-shelf NK cell cancer immunotherapy, for the treatment of advanced solid tumors.",
    "  Ardelyx Soars on News of Study Success   :  Shares of Ardelyx, Inc. ARDX  surged significantly after the company announced that its late-stage study on tenapanor in combination with phosphate binders in patients with chronic kidney disease (CKD) met the primary and all key secondary endpoints. These patients were on dialysis and their hyperphosphatemia was not previously controlled with binders alone. Tenapanor in combination with binders met the primary endpoint, demonstrating a statistically significant reduction of serum phosphorus compared to binders alone. Approximately two times more patients achieved the established serum phosphorus treatment goal of less than 5.5mg/dL in the tenapanor arm compared to binders alone for each week of treatment. The company plans to report results from its second phase III monotherapy study, PHREEDOM, in the fourth quarter.",
    "  Akari Gets Orphan Drug Designation for Lead   Candidate   : Akari Therapeutics, Plc AKTX  announced that the FDA has granted an Orphan Drug designation to its lead pipeline candidate, nomacopan, for the treatment of hematopoietic stem cell transplantation-associated thrombotic microangiopathy (HSCT-TMA). Last month, the FDA granted a Fast Track designation to nomacopan for the same indication in the pediatric patient population. Akari plans to begin a pivotal study on the candidate for HSCT-TMA in the fourth quarter of 2019.",
    " Performance ",
    "The Nasdaq Biotechnology index lost 3.72% in the last four trading sessions. Among the biotech giants, Regeneron gained 1.32% in the period. Over the past six months, shares of Celgene have gained 12.97%, whereas the Regeneron stock has slumped 34.28%. (See the last biotech stock roundup here:  Biotech Stock Roundup: AMGN to Buy CELG's Otezla,   ALXN's Soliris Gets EC Nod & More   )",
    " What's Next in Biotech? ",
    "Stay tuned for more pipeline updates.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:02:00"
}