{
  "url": "https://www.nasdaq.com/article/where-will-epizyme-be-in-1-year-cm1207693",
  "title": "Where Will Epizyme Be in 1 Year? - Nasdaq.com",
  "text": [
    " Although shares of   Epizyme    (NASDAQ: EPZM) are trading at a fraction of the all-time high   achieved shortly after the initial public offering in 2013, the   company's current market valuation of $1.2 billion is close to a   high-water mark. Investors can thank a surge in stock dilution   (which keeps the market cap elevated) as well as signs of   tangible progress (which have sent shares soaring recently). The stock has more than doubled since the beginning of the   year on the heels of growing optimism for the lead drug   candidate, tazemetostat, which was placed on a clinical hold by   the U.S. Food and Drug Administration (FDA) not long ago. The   regulatory body has since accepted a new drug application (NDA)   for the drug candidate, and could give it a stamp of approval as   early as January 2020. While that puts Epizyme on the path to commercial operations,   it may not provide the financial boost the business needs to   achieve sustainable operations. Here's what could be ahead for   the business in the next year for   investors considering buying the stock    .makeArticleAd();   Image source: Getty Images.  Getting up to speed Epizyme's tazemetostat inhibits an enzyme called EZH2 that   allows certain cancer cells to proliferate. The enzyme isn't   present in all cancer cells, but the drug has the potential to   treat various forms of Non-Hodgkin Lymphoma (NHL) and several   types of genetically defined solid tumors. That potential   diversity could pay off for shareholders down the road, as could   the drug candidate's potential as both a maintenance therapy   (intended to keep cancers from progressing) and an earlier line   of treatment (intended to shrink tumors). The FDA placed a partial clinical hold on tazemetostat in   April 2018 after a pediatric patient receiving the drug compound   developed a secondary lymphoma. Epizyme provided a response   including data arguing that the risk-to-reward profile favored   continued development, and regulators lifted the clinical hold   several months later. Shortly thereafter, Epizyme   reported results from a phase 2 trial    evaluating tazemetostat as a treatment for epithelioid sarcoma   (ES) in 62 adults. The drug candidate achieved an objective   response rate (ORR) of 15% and a disease control rate (DCR) of   26%. That may not seem like much, but it's relatively significant   for a patient population with limited treatment options.   Nonetheless, some investors have been unsure that it will prove   sufficient to earn the drug marketing approval. While Epizyme is conducting a phase 3 trial to confirm the   results in ES, regulators agreed to allow the company to submit   an NDA based on the mid-stage study. The FDA will approve or   reject the application on January 23, 2020. The company is also preparing to submit an NDA for   tazemetostat as a treatment for follicular lymphoma, also based   on data generated from a mid-stage study. Epizyme reported an ORR   of 77% in patients with a mutated EZH2 enzyme and 34% in patients   with a non-mutated form. The former group responded for a median   time of 8.3 months, while the latter group reported a median   duration of response of 13 months. As development of tazemetostat continues as a stand-alone and   combination treatment for various types of cancers at varying   levels of progression, Epizyme is also beginning to look beyond   the asset. The company plans to have at least three new drug   candidates in clinical trials by the end of 2020, led by EZM8266   in sickle cell disease.   Image source: Getty Images.  Where is Epizyme headed? Epizyme sports an income statement typical of a clinical-stage   pharma. The business reported an operating loss of $81.7 million   in the first half of 2019, driven largely by a $67.8 million   charge for research and development. Unfortunately, earning   marketing approval for tazemetostat in ES won't bring much   relief. According to   Biopharma Dive    , Wall Street analysts see that indication topping out at just   $100 million in revenue per year. Given the small economic   opportunity, the initial increase in marketing and sales expenses   from the transition to commercial operations will likely make the   company's financial situation worse, especially considering the   confirmatory trials in ES and follicular lymphoma will be   larger and more expensive than the mid-stage trials underpinning   regulatory applications. Tazemetostat could still live up to its broad potential over   the long run. Andrew Berens, an analyst at Morgan Stanley,   estimates that the drug compound could reach peak annual sales of   $2.1 billion by 2030. And if pipeline programs with   GlaxoSmithKline    ,   Celgene    , and Boehringer Ingelheim progress, then Epizyme could earn   milestone payments to help offset rising operating expenses. So, where will Epizyme be in one year? Investors might not   notice much difference from a financial standpoint, and should   expect significant operating losses to continue. But if the   company earns market approvals for tazemetostat and launches   three new drug candidates into the clinic before the end of 2020   as expected, then shares could receive a bump as optimism grows.   That said, the company's $1.2 billion market cap suggests Wall   Street is taking a relatively cautious approach. Individual   investors should likely do the same.   10 stocks we like better than Epizyme       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Epizyme wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Maxx Chatsko      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Although shares of   Epizyme    (NASDAQ: EPZM) are trading at a fraction of the all-time high   achieved shortly after the initial public offering in 2013, the   company's current market valuation of $1.2 billion is close to a   high-water mark. Investors can thank a surge in stock dilution   (which keeps the market cap elevated) as well as signs of   tangible progress (which have sent shares soaring recently).",
    "The stock has more than doubled since the beginning of the   year on the heels of growing optimism for the lead drug   candidate, tazemetostat, which was placed on a clinical hold by   the U.S. Food and Drug Administration (FDA) not long ago. The   regulatory body has since accepted a new drug application (NDA)   for the drug candidate, and could give it a stamp of approval as   early as January 2020.",
    "While that puts Epizyme on the path to commercial operations,   it may not provide the financial boost the business needs to   achieve sustainable operations. Here's what could be ahead for   the business in the next year for   investors considering buying the stock    .",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Epizyme's tazemetostat inhibits an enzyme called EZH2 that   allows certain cancer cells to proliferate. The enzyme isn't   present in all cancer cells, but the drug has the potential to   treat various forms of Non-Hodgkin Lymphoma (NHL) and several   types of genetically defined solid tumors. That potential   diversity could pay off for shareholders down the road, as could   the drug candidate's potential as both a maintenance therapy   (intended to keep cancers from progressing) and an earlier line   of treatment (intended to shrink tumors).",
    "The FDA placed a partial clinical hold on tazemetostat in   April 2018 after a pediatric patient receiving the drug compound   developed a secondary lymphoma. Epizyme provided a response   including data arguing that the risk-to-reward profile favored   continued development, and regulators lifted the clinical hold   several months later.",
    "Shortly thereafter, Epizyme   reported results from a phase 2 trial    evaluating tazemetostat as a treatment for epithelioid sarcoma   (ES) in 62 adults. The drug candidate achieved an objective   response rate (ORR) of 15% and a disease control rate (DCR) of   26%. That may not seem like much, but it's relatively significant   for a patient population with limited treatment options.   Nonetheless, some investors have been unsure that it will prove   sufficient to earn the drug marketing approval.",
    "While Epizyme is conducting a phase 3 trial to confirm the   results in ES, regulators agreed to allow the company to submit   an NDA based on the mid-stage study. The FDA will approve or   reject the application on January 23, 2020.",
    "The company is also preparing to submit an NDA for   tazemetostat as a treatment for follicular lymphoma, also based   on data generated from a mid-stage study. Epizyme reported an ORR   of 77% in patients with a mutated EZH2 enzyme and 34% in patients   with a non-mutated form. The former group responded for a median   time of 8.3 months, while the latter group reported a median   duration of response of 13 months.",
    "As development of tazemetostat continues as a stand-alone and   combination treatment for various types of cancers at varying   levels of progression, Epizyme is also beginning to look beyond   the asset. The company plans to have at least three new drug   candidates in clinical trials by the end of 2020, led by EZM8266   in sickle cell disease.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Epizyme sports an income statement typical of a clinical-stage   pharma. The business reported an operating loss of $81.7 million   in the first half of 2019, driven largely by a $67.8 million   charge for research and development. Unfortunately, earning   marketing approval for tazemetostat in ES won't bring much   relief.",
    "According to   Biopharma Dive    , Wall Street analysts see that indication topping out at just   $100 million in revenue per year. Given the small economic   opportunity, the initial increase in marketing and sales expenses   from the transition to commercial operations will likely make the   company's financial situation worse, especially considering the   confirmatory trials in ES and follicular lymphoma will be   larger and more expensive than the mid-stage trials underpinning   regulatory applications.",
    "Tazemetostat could still live up to its broad potential over   the long run. Andrew Berens, an analyst at Morgan Stanley,   estimates that the drug compound could reach peak annual sales of   $2.1 billion by 2030. And if pipeline programs with   GlaxoSmithKline    ,   Celgene    , and Boehringer Ingelheim progress, then Epizyme could earn   milestone payments to help offset rising operating expenses.",
    "So, where will Epizyme be in one year? Investors might not   notice much difference from a financial standpoint, and should   expect significant operating losses to continue. But if the   company earns market approvals for tazemetostat and launches   three new drug candidates into the clinic before the end of 2020   as expected, then shares could receive a bump as optimism grows.   That said, the company's $1.2 billion market cap suggests Wall   Street is taking a relatively cautious approach. Individual   investors should likely do the same.",
    "  10 stocks we like better than Epizyme       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Epizyme wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Epizyme       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Epizyme wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Maxx Chatsko      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 06:00:00"
}