{
  "url": "https://www.nasdaq.com/article/analysts-trim-forecasts-for-aussie-nz-dollars-20190904-01204",
  "title": "Analysts trim forecasts for Aussie, NZ dollars - Nasdaq.com",
  "text": [
    "By Swati Pandey",
    "SYDNEY, Sept 5 (Reuters) - Analysts trimmed forecasts for the Australian and New Zealand dollars in the latest Reuters poll as both currencies languish near multi-year lows amid escalating trade wars and collapsing interest rates.",
    "The median one-month forecast for the Aussie was lowered to $0.6700 , from $0.6800 in last month's survey. Over the next six months, the Aussie is now seen at $0.6800, from $0.7000 previously, and $0.7000 on a one-year horizon.",
    "The downward trend began as investors dumped perceived risky assets with the Sino-U.S. tariff dispute showing no signs of abating.",
    "Fears of a U.S.-led global slowdown have prompted many central banks around the world to lower interest rates in an effort to tame their currencies and keep exports competitive.",
    "The Reserve Bank of Australia (RBA) cut rates in June and July to a record low of 1% to revive domestic growth and inflation, and has pledged to keep policy stimulatory for some time yet. It has also appeared open to quantitative easing if needed. ",
    "As a result, yields on 10-year Australian bonds  broke under 1% for the first time ever last month, upending the Aussie's traditional status as a high-yielding currency.",
    "Futures 0#YIB: are fully pricing in two more RBA rate cuts with a 40% chance of third move to 0.25% by late-2020 after data on Wednesday showed second-quarter economic growth stalled to the weakest since the global financial crisis. ",
    "\"With limited good news domestically, investors are now pricing in a chance that the RBA has to cut three times more,\" said Ben Udy, Singapore-based economist for Capital Economics.",
    "\"While we think the RBA will only cut rates twice more, we believe that further declines in commodity prices as well as weakness in equities prices and sustained global uncertainty, will cause the Australian dollar to decline...to $0.65 by the end of the year.\"",
    "Just as importantly, China has let its yuan depreciate to offset the pain from tariffs and investors are responding by shorting the Aussie as a liquid proxy.",
    "Similar forces were affecting the New Zealand dollar,  which crumbled to a four year trough of $0.6270 this week before steadying a little at $0.6350.",
    "Many analysts think it has found a floor, with the median three-month poll forecast at $0.6400 from 0.6500 in the previous poll.",
    "The kiwi is then seen at $0.6500 in six months' time and $0.6650 on a one-year horizon.",
    "That bullish forecast contrasts with the Reserve Bank of New Zealand's (RBNZ) intention to lower the currency when it cut rates by a surprisingly steep 50 basis points in August. ",
    "Policymakers even raised the spectre of taking rates below zero, citing the need to match the easing done by other central banks. ",
    "In response, yields on 10-year bonds yields  fell a massive 28 basis points to 1.11% as shocked investors assumed rates would stay super-low for years to come. It was last at 1.06%."
  ],
  "published_datetime": "2019-09-04 08:34:00"
}