{
  "url": "https://www.nasdaq.com/article/daily-dividend-report-boom-jci-vst-snv-vmi-cm1207486",
  "title": "Daily Dividend Report: BOOM, JCI, VST, SNV, VMI - Nasdaq.com",
  "text": [
    "      DMC Global today announced it has increased its annual cash dividend to $0.50 per share from $0.08 per share. The dividend will be paid quarterly at a rate of $0.125 per share, with the next payment scheduled for October 15, 2019, to shareholders of record as of September 30, 2019. The increase more than restores a $0.16 annual dividend that was reduced in 2015 following the downturn in the oil and gas industry.  makeArticleAd();    The board of directors of Johnson Controls International, has approved a regular quarterly cash dividend of $0.26 per common share payable on Oct. 4, 2019, to shareholders of record at the close of business on Sept. 16, 2019. Johnson Controls has paid a consecutive dividend since 1887.      Vistra Energy announced today that its Board of Directors has declared a quarterly dividend of $0.125 per share of Vistra's common stock, or $0.50 per share on an annualized basis. The dividend is payable on September 30, 2019 to shareholders of record as of September 16, 2019. The ex-dividend date will be September 13, 2019.      The Board of Directors of Synovus Financial has declared the following quarterly dividends: $0.30 per share on the company's common stock, payable on October 1, 2019, to shareholders of record as of September 19, 2019.      The Board of Directors of Valmont Industries, has declared a quarterly dividend of 37.5 cents per share payable on October 15, 2019, to shareholders of record on September 27, 2019. The dividend indicates an annual rate of $1.50 per share.          VIDEO: Daily Dividend Report: BOOM, JCI, VST, SNV,     VMI   ",
    "   VIDEO: Daily Dividend Report: BOOM, JCI, VST, SNV,     VMI  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:49:00"
}