{
  "url": "https://www.nasdaq.com/article/preciousgold-rises-on-lingering-growth-risks-as-spotlight-turns-to-ecb-20190912-00271",
  "title": "PRECIOUS-Gold rises on lingering growth risks as spotlight turns to ECB - Nasdaq.com",
  "text": [
    "    * ECB announcement expected at 1145 GMT",
    "* Investors also await U.S. Aug CPI at 1230 GMT",
    "* Palladium hits $1,600/oz, up for 4th session (Updates prices)",
    "Sept 12 (Reuters) - Gold rose on Thursday ahead of aEuropean Central Bank meeting, supported by lingering concernsaround global growth, while an uptick in financial marketsdriven by hopes of a thaw in U.S.-China trade tensions kept themetal's gains in check.",
    "Spot gold XAU= was up 0.4% at $1,503.04 per ounce as of1108 GMT. U.S. gold futures GCcv1 rose 0.5% to $1,510.06.",
    "\"We have the ECB meeting coming up and there are growingconcerns they may not be able to deliver what the market islooking for in terms of economic boost; in that case it willprovide a bid to gold,\" Saxo Bank commodity strategist OleHansen said.",
    "\"The underlying demand continues to remain strong for gold,there is a sense in the market that traders don't want to missout on any renewed rally. It does indicate that the buyers havebeen waiting and they're worried about not catching the bus whenit leaves the station.\"",
    "Investors are looking to the ECB meeting to see how farpolicymakers will go to support a flagging economy, given therisks posed by Britain's planned exit from the European Union.",
    "The ECB is set to announce its rate decision at 1145 GMT,followed by a news conference by the central bank's PresidentMario Draghi at 1230 GMT.",
    "Markets are also awaiting consumer price index (CPI) datafrom the United States for August, which is expected toaccelerate by merely 0.1%, compared with 0.3% in July, accordingto a Reuters poll, and reinforce expectations of an interestrate cut from the U.S. Federal Reserve at its meeting next week.",
    "Meanwhile, the United States on Wednesday agreed to delayincreasing tariffs on $250 billion worth of Chinese importsuntil Oct. 15, from Oct. 1 \"as a gesture of goodwill\". urn:newsml:reuters.com:*:nW1N24C02J",
    "Positive signs on the trade front lifted risk sentiment,with world stocks advancing to their highest in six weeks. MKTS/GLOB",
    "\"The risk-on tone on the back of positive trade news hasdone little to dent interest in gold,\" MKS PAMP said in a note.",
    "\"However, the metal still trades sub-$1,500 as ETF outflowslook to have dried up for the time being following recentdeclines to holdings.\"",
    "Holdings of the SPDR Gold TrustGLD , the world's largestgold-backed exchange-traded fund (ETF), have fallen nearly 2% sofar this month. GOL/ETF",
    "Elsewhere, silver XAG= gained 0.6% to $18.19 per ounce,and platinum XPT= rose 1% to $953.85. ",
    "Palladium XPD= was up 1.5% at $1,595.05 after hitting atwo-month high of $1,600.32 earlier in the session. (Reporting by Brijesh Patel in Bengaluru;Editing by Alexander Smith and Susan Fenton) ((Brijesh.Patel1@thomsonreuters.com; Within U.S. +1 651 8485832, Outside U.S. +91 8067493865; Reuters Messaging:Brijesh.Patel1.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-12 07:18:00"
}