{
  "url": "https://www.nasdaq.com/article/heres-why-you-should-add-amerisafe-amsf-to-your-portfolio-cm1210310",
  "title": "Here's Why You Should Add Amerisafe (AMSF) to Your Portfolio - Nasdaq.com",
  "text": [
    "  Amerisafe Inc. AMSF  is poised for growth on the back of its operating performance, which showed stronger-than-expected underwriting results in the first half of 2019, driven by favorable prior-year reserve development. The strong operating performance positions the company for solid growth after an extended phase of soft revenues since 2015. The Zacks Consensus Estimate for the company's current-year earnings has been revised 4.3% upward over the last 30 days. Amerisafe has experience of 33 years as a specialty provider of workers' compensation insurance for small to midsize employers in high-hazard industries. The line of business that the insurer follows is profitable. The business rakes in higher premium owing to inherent workplace dangers associated with such policies. The company is known for its balance sheet strength, group's strong operating performance, neutral business profile and appropriate enterprise risk management. Amerisafe also flaunts a competitive edge in focusing on specialized underwriting expertise as witnessed by its combined ratios, which are at more favorable levels than its peers. The company's combined ratio has stayed below 100% since 2006, except in 2011, which indicates underwriting profitability. The company focuses on loss control and safety programs plus active claims management have generated strong underwriting results. The company also boasts an efficient operating platform. Through extensive cost-management initiatives, Amerisafe executes one of the most efficient operations in the workers' compensation industry. This has enabled the company to maintain its operating return on equity at 14.3%, which is above the industry's ROE of 12.8%. Amerisafe is delivering solid cash flow from operations in the past many years. Favorable cash flow generation along with absence of any long-term debt prepares the company to adopt a disciplined capital management strategy. Also, the company's capital management policy via acquisitions as well as steady dividend and annual payouts since 2014 plus share buybacks have boosted shareholders' value. Year to date, the stock has gained 16.5% against the industry  's growth of 8.9%.      Amerisafe also carries an investment grade rating from A.M.Best with a stable outlook on risk-adjusted capitalization, consistent profitable operating performance as well as established position and experience in the workers' compensation market for high-hazard risks. Amerisafe currently has a Zacks Rank #2 (Buy). Some other top-ranked stocks worth considering are The Hartford Financial Services Group, Inc HIG  , Assurant Inc AIZ  and MetLife, Inc MET  . Each of these stocks carries a Zacks Rank #2. You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  .   Looking for Stocks with Skyrocketing Upside?  makeArticleAd();  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   AMERISAFE, Inc. (AMSF): Free Stock Analysis Report   Assurant, Inc. (AIZ): Free Stock Analysis Report   The Hartford Financial Services Group, Inc. (HIG): Free Stock Analysis Report   MetLife, Inc. (MET): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " Amerisafe Inc. AMSF  is poised for growth on the back of its operating performance, which showed stronger-than-expected underwriting results in the first half of 2019, driven by favorable prior-year reserve development. The strong operating performance positions the company for solid growth after an extended phase of soft revenues since 2015.",
    "The Zacks Consensus Estimate for the company's current-year earnings has been revised 4.3% upward over the last 30 days.",
    "Amerisafe has experience of 33 years as a specialty provider of workers' compensation insurance for small to midsize employers in high-hazard industries. The line of business that the insurer follows is profitable. The business rakes in higher premium owing to inherent workplace dangers associated with such policies.",
    "The company is known for its balance sheet strength, group's strong operating performance, neutral business profile and appropriate enterprise risk management.",
    "Amerisafe also flaunts a competitive edge in focusing on specialized underwriting expertise as witnessed by its combined ratios, which are at more favorable levels than its peers. The company's combined ratio has stayed below 100% since 2006, except in 2011, which indicates underwriting profitability. The company focuses on loss control and safety programs plus active claims management have generated strong underwriting results.",
    "The company also boasts an efficient operating platform. Through extensive cost-management initiatives, Amerisafe executes one of the most efficient operations in the workers' compensation industry. This has enabled the company to maintain its operating return on equity at 14.3%, which is above the industry's ROE of 12.8%.",
    "Amerisafe is delivering solid cash flow from operations in the past many years. Favorable cash flow generation along with absence of any long-term debt prepares the company to adopt a disciplined capital management strategy.",
    "Also, the company's capital management policy via acquisitions as well as steady dividend and annual payouts since 2014 plus share buybacks have boosted shareholders' value.",
    "Year to date, the stock has gained 16.5% against the industry  's growth of 8.9%.  ",
    "Amerisafe also carries an investment grade rating from A.M.Best with a stable outlook on risk-adjusted capitalization, consistent profitable operating performance as well as established position and experience in the workers' compensation market for high-hazard risks.",
    "Amerisafe currently has a Zacks Rank #2 (Buy). Some other top-ranked stocks worth considering are The Hartford Financial Services Group, Inc HIG  , Assurant Inc AIZ  and MetLife, Inc MET  . Each of these stocks carries a Zacks Rank #2. You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  . ",
    " Looking for Stocks with Skyrocketing Upside?  makeArticleAd();  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:00:00"
}