{
  "url": "https://www.nasdaq.com/article/japanese-shares-jump-to-1month-high-on-hong-kong-brexit-uschina-trade-news-20190904-01243",
  "title": "Japanese shares jump to 1-month high on Hong Kong, Brexit, US-China trade news - Nasdaq.com",
  "text": [
    "    By Tomo Uetake",
    "TOKYO, Sept 5 (Reuters) - Japanese shares advanced to a onemonth-high on Thursday as investors cheered some easing tensionin Hong Kong, British lawmakers' vote against a \"no-deal\" Brexitand signs of progress in U.S.-China trade talks.",
    "The benchmark Nikkei average .N225 gained as much as 2.5%to 21,157.15 in the morning session, its highest level sinceAug. 2, while the broader Topix .TOPX rose as much as 2.3% to1,540.59, its highest in a month.",
    "The market extended early gains after Beijing said China andthe United States agreed to hold trade talks in Washington inearly October. urn:newsml:reuters.com:*:nB9N25400R",
    "All of the Tokyo Stock Exchange's 33 subsectors were inpositive territory as the market attracted hefty purchasesacross the board.",
    "Cyclical sectors were particularly in demand, with seatransport .ISHIP.T , electrical machinery .IELEC.T andprecision machinery .IPRCS.T the top three performingsubindexes on the Topix, up between 3.2 and 3.7%.",
    "Other notable movers include TSE REIT index .TREIT , edging up 0.3% higher to hit a fresh 12-year high since 2007. urn:newsml:reuters.com:*:nL4N25G1P8urn:newsml:reuters.com:*:nL4N24D238",
    "M3 Inc2413.T soared 11.4% and Tokyo Dome Corp9681.T dived 7.0% after index provider Nikkei announced it will dropthe baseball stadium operator from the Nikkei 225 share averageand replace it with the medical-related service provider, fromOct 1.",
    "Candidates which did not make the list were down, due to disappointment. Kakaku.com2371.T , Zozo3092.T and Nintendo7974.T shed 5.5%, 1.7% and 1.2%, respectively.",
    "Nissan Motor Co7201.T gained 2.6% despite media reportsquoting its chief executive as admitting to improperly receivingstock-related compensation, in the latest case of financialmisconduct among executives at Japan's second-largest automaker. urn:newsml:reuters.com:*:nL3N25V4QI",
    " (Reporting by Tomo Uetake; Editing by Richard Borsuk) ((tomo.uetake@thomsonreuters.com; +81-3-6441-1645))"
  ],
  "published_datetime": "2019-09-04 11:09:00"
}