{
  "url": "https://www.nasdaq.com/article/why-apple-is-giving-tv-away-cm1210725",
  "title": "Why Apple Is Giving TV+ Away - Nasdaq.com",
  "text": [
    " Nearly a year ago, rumors surfaced that   Apple    (NASDAQ: AAPL) might let Apple device owners have   free access    to Apple TV+. The idea would be to get users onboard, hopefully   hook them with content, and then start charging them a   subscription fee later on. It turns out that Apple indeed decided   to pursue a similar strategy: One of the big shockers from the   company's   big event yesterday    was that Apple would give away a free year of Apple TV+ to   any customer who buys an iPhone, iPad, Apple TV, iPod Touch, or   Mac. That's a remarkably generous move for a company known for   premium pricing. Here's why the Cupertino   tech giant    is giving the service away.   CEO Tim Cook shows off See, an Apple Original starring Jason     Momoa. Image source: Apple.makeArticleAd();  Apple will give away tens of millions of subscriptions For starters, the slate of originals that will be ready at   launch is extremely small: Just nine titles will be available   when TV+ launches in November. Apple is betting on quality over   quantity at first, but quality is subjective and there simply   won't be a lot of content to watch initially. Even at the low   price point of $5 per month, Apple TV+ doesn't stack up well   against   Netflix    or   Disney    's competing Disney+ service that will launch less than two weeks   later. In all likelihood, Apple is expecting the bulk of TV+   subscribers to come from the free offer, as Apple will end up   selling around 90 million to 100 million eligible devices in the   fourth quarter. Bundling a $60 offer with pricier products like a   maxed-out iPhone 11 Pro Max ($1,450) or 15-inch MacBook Pro   ($2,400) might not hurt margins meaningfully, but even certified   refurbished products are eligible. That means that someone could   buy a refurbished Apple TV HD for just $139 and take   advantage of the offer -- which is worth nearly half of that   product's price. A new Apple TV 4K ($180) is reportedly sold at cost, so   Apple is essentially willing to accept a negative margin for   certain products in order to promote TV+. Playing the long game In other words, Apple is in no rush to recoup the billions of   dollars that it has invested thus far in original content. The   company will get tens of millions of users on the service with   the free offer, at which point it will have a year to convince   them to renew their subscriptions by adding more and more content   to justify the $5 per-month cost. The entire strategy underscores Apple's yearslong focus on its   services business, which the company has framed to investors as a   way to mitigate seasonality and reduce reliance on hardware unit   sales. Services are also   far    more profitable than products, on average.  Data source: SEC filings. Apple is very much playing the long game here, so investors   will have to be patient to see if the multibillion-dollar   original content bet ultimately pays off.   10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Evan Niu, CFA      owns shares of Apple, NFLX, and DIS. The Motley Fool owns     shares of and recommends Apple, NFLX, and DIS. The Motley Fool     has the following options: long January 2021 $60 calls on DIS,     short October 2019 $125 calls on DIS, short January 2020 $155     calls on Apple, and long January 2020 $150 calls on Apple. The     Motley Fool has a     disclosure policy      .  ",
    "Nearly a year ago, rumors surfaced that   Apple    (NASDAQ: AAPL) might let Apple device owners have   free access    to Apple TV+. The idea would be to get users onboard, hopefully   hook them with content, and then start charging them a   subscription fee later on. It turns out that Apple indeed decided   to pursue a similar strategy: One of the big shockers from the   company's   big event yesterday    was that Apple would give away a free year of Apple TV+ to   any customer who buys an iPhone, iPad, Apple TV, iPod Touch, or   Mac.",
    "That's a remarkably generous move for a company known for   premium pricing. Here's why the Cupertino   tech giant    is giving the service away.",
    "  CEO Tim Cook shows off See, an Apple Original starring Jason     Momoa. Image source: Apple.makeArticleAd(); ",
    "CEO Tim Cook shows off See, an Apple Original starring Jason     Momoa. Image source: Apple.",
    "For starters, the slate of originals that will be ready at   launch is extremely small: Just nine titles will be available   when TV+ launches in November. Apple is betting on quality over   quantity at first, but quality is subjective and there simply   won't be a lot of content to watch initially. Even at the low   price point of $5 per month, Apple TV+ doesn't stack up well   against   Netflix    or   Disney    's competing Disney+ service that will launch less than two weeks   later.",
    "In all likelihood, Apple is expecting the bulk of TV+   subscribers to come from the free offer, as Apple will end up   selling around 90 million to 100 million eligible devices in the   fourth quarter. Bundling a $60 offer with pricier products like a   maxed-out iPhone 11 Pro Max ($1,450) or 15-inch MacBook Pro   ($2,400) might not hurt margins meaningfully, but even certified   refurbished products are eligible. That means that someone could   buy a refurbished Apple TV HD for just $139 and take   advantage of the offer -- which is worth nearly half of that   product's price.",
    "A new Apple TV 4K ($180) is reportedly sold at cost, so   Apple is essentially willing to accept a negative margin for   certain products in order to promote TV+.",
    "In other words, Apple is in no rush to recoup the billions of   dollars that it has invested thus far in original content. The   company will get tens of millions of users on the service with   the free offer, at which point it will have a year to convince   them to renew their subscriptions by adding more and more content   to justify the $5 per-month cost.",
    "The entire strategy underscores Apple's yearslong focus on its   services business, which the company has framed to investors as a   way to mitigate seasonality and reduce reliance on hardware unit   sales. Services are also   far    more profitable than products, on average.",
    "Data source: SEC filings.",
    "Apple is very much playing the long game here, so investors   will have to be patient to see if the multibillion-dollar   original content bet ultimately pays off.",
    "  10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Evan Niu, CFA      owns shares of Apple, NFLX, and DIS. The Motley Fool owns     shares of and recommends Apple, NFLX, and DIS. The Motley Fool     has the following options: long January 2021 $60 calls on DIS,     short October 2019 $125 calls on DIS, short January 2020 $155     calls on Apple, and long January 2020 $150 calls on Apple. The     Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:40:00"
}