{
  "url": "https://www.nasdaq.com/article/digital-realty-trust-inc-dlr-ex-dividend-date-scheduled-for-september-12-2019-cm1210196",
  "title": "Digital Realty Trust, Inc. (DLR) Ex-Dividend Date Scheduled for September 12, 2019 - Nasdaq.com",
  "text": [
    "Digital Realty Trust, Inc. ( DLR  ) will begin trading ex-dividend on September 12, 2019. A cash dividend payment of $1.08 per share is scheduled to be paid on September 30, 2019. Shareholders who purchased DLR prior to the ex-dividend date are eligible for the cash dividend payment. This marks the 3rd quarter that DLR has paid the same dividend. At the current stock price of $127.65, the dividend yield is 3.38%.",
    "The previous trading day's last sale of DLR was $127.65, representing a -0.82% decrease from the 52 week high of $128.71 and a 27.59% increase over the 52 week low of $100.05.",
    "DLR is a part of the Consumer Services sector, which includes companies such as American Tower Corporation (REIT) ( AMT  ) and Crown Castle International Corporation ( CCI  ). DLR's current earnings per share, an indicator of a company's profitability, is $1.09. Zacks Investment Research reports DLR's forecasted earnings growth in 2019 as .57%, compared to an industry average of %.",
    "For more information on the declaration, record and payment dates, visit the DLR Dividend History  page. Our  Dividend Calendar  has the full list of stocks that have an ex-dividend today.",
    " Interested in gaining exposure to DLR through an Exchange Traded Fund [ETF]?   The following ETF(s) have DLR as a top-10 holding:  SPDR DJ Wilshire REIT ETF (   RWR    ) Schwab U.S. REIT ETF (   SCHH    ) First Trust S&P REIT Index Fund (   FRI    ) iShares Core U.S. REIT ETF (   USRT    ) SPDR DJ Wilshire Global Real Estate ETF (   RWO    ).  ",
    "The top-performing ETF of this group is USRT with an increase of 8.47% over the last 100 days. RWR has the highest percent weighting of DLR at 3.69%.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:00:05"
}