{
  "url": "https://www.nasdaq.com/article/general-motors-stock-yet-another-victim-of-tweet-rampage-cm1206959",
  "title": "General Motors Stock Yet Another Victim of Tweet Rampage - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "General Motors (NYSE: GM ) has seen off, for now, the danger of Tesla (NASDAQ: TSLA ) overtaking it as America's most valuable car company.",
    " But GM stock and the company's financial results have barely budged since Mary Barra became CEO five years ago. The company also faces a host of new problems, including a president who seems determined to hammer it with misinformation.",
    "The latest tweets calling GM America's smallest car company , claiming its workforce is smaller than that of Ford Motor (NYSE: F ) or Fiat Chrysler (NASDAQ: FCAU ), are just wrong. Even journalists who printed the facts misrepresented the reality .",
    "That doesn't help as the company enters union contract negotiations. The current contract expires Sept. 14, and the United Auto Workers will be under pressure to be tough, facing their own corruption probe .",
    "What's clear is that GM is at risk of becoming yet-another victim of the trade war as well as the president's continuing tweet war.",
    "China is now GM's largest market. GM has 11 joint ventures in China, two subsidiaries, 58,000 employees and had 3.64 million sales there in 2018. In North America, by contrast, its sales were 3.5 million vehicles. It's not flooding the U.S. market with Chinese-made cars, but it is producing them where they're sold.",
    "China is also closer to fast-growing markets in India and Southeast Asia than Detroit is. Situating production near those markets makes financial sense. But it does mean GM now has more total workers in China than it has union workers in the U.S., of which it has about 46,000. Reporting on this fact is almost certain to hurt contract talks , which could easily lead to a strike.",
    "This isn't the only area where Trump is getting in GM's way. He's also angry that the industry is going along with California's efforts to rein-in car pollution, ignoring an administration waiver on mileage standards. Growing fleets of hybrid and all-electric cars, like the Chevy Bolt , mean they can meet tougher standards.",
    "Even without Trump's piling-on, General Motors has enough problems to make investors want to shy away from it.",
    "Over the last five years GM stock is up only 6.45%, while the average S&P stock is up 47%. It can still afford the 38 cents per share dividend, as it has averaged $1.57 per share of earnings over the last four quarters. The company's operating cash flow remains strong, at over $15 billion in 2018 and over $5 billion in just the last quarter.",
    "But the company's debt load has more than doubled under Barra, and while the dividend does yield 4.1% to current investors, at a time when the U.S. 30-year bond trades at under 2%, it has barely budged in five years. The dividend hasn't been raised since the end of 2015.",
    "While the price earnings multiple of 5.86 looks attractive, and the yield will make the average retiree smile, GM stock has barely budged since it returned to the public market in 2011. It lives, but it's going nowhere fast.",
    "GM is a dividend stock you buy for income. GM can afford the dividend payout.",
    "But General Motors is facing many problems. It faces the turn toward all-electric and self-driving vehicles, a government that is doing it no favors, and a tough labor negotiation.",
    "Like other U.S. car makers, GM has practically abandoned the car market in favor of pick-up trucks and sport utility vehicles. It faces a challenging pricing environment and pressure on commodity costs.",
    "GM is the kind of great old American company, like General Electric (NYSE: GE ), that I like to root for. But it's not the kind of company I like to invest in.",
    "Dana Blankenhornis a financial and technology journalist. He is the author of the mystery thriller, The Reluctant Detective Finds Her Family, available at the Amazon Kindle store. Write him at danablankenhorn@gmail.comor follow him on Twitter at @danablankenhorn . As of this writing he owned no shares in companies mentioned in this article.",
    "The post General Motors Stock Yet Another Victim of Tweet Rampage appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:05:10"
}