{
  "url": "https://www.nasdaq.com/article/allegiant-international-paper-amazon-atlas-air-and-air-transport-services-highlighted-as-zacks-bull-and-bear-of-the-day-cm1207316",
  "title": "Allegiant, International Paper, Amazon, Atlas Air and Air Transport Services highlighted as Zacks Bull and Bear of the Day - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL - September 4, 2019 - Zacks Equity Research  Allegiant Travel Company ALGT  as the Bull of the Day, International Paper IP  as the Bear of the Day. In addition, Zacks Equity Research provides analysis on Amazon AMZN  , Atlas Air Worldwide Holdings AAWW  and Air Transport Services Group ATSG  . Here is a synopsis of all five stocks:   Bull of the Day  :  Shares of Allegiant Travel Company have soared in 2019 to easily outpace the broader Transportation-Air Market. Many of the discount airline firm's fundamentals appear strong and its top and bottom lines are projected to climb significantly both this year and next.    The Basics  Allegiant refers to itself as an \"integrated travel company with an airline at its heart.\" The Las Vegas-based firm offers customers low-cost flights from smaller cities throughout the U.S., as well as to vacation hubs such as Phoenix, Orlando, and of course, Las Vegas. Allegiant also sells travel package bundles that include flights, hotels, rental cars, and tickets to local entertainment events. Investors should also note that the firm doesn't even fly every day, opting instead for flights on \"only the days when most people want to fly.\" This helps the company that was founded in the late 1990s save money. In fact, Allegiant's 22% airline operating margin led the industry in the first quarter and that figure popped to 24% in Q2. Allegiant currently runs more than 450 routes across the country and provides nonstop, scheduled service from over 110 U.S. cities. The firm also boasts that its base fares cost less than half than average domestic roundtrip ticket. ALGT doesn't really compete against giants such as United , American or even JetBlue. Instead, it likely finds itself up against the likes of Spirit and other discount airlines. Nonetheless, Allegiant looks poised to expand its business, which includes bringing its leisure model to Mexico and the Caribbean in the \"coming years.\"  Price Movement  Moving on, ALGT stock has crushed its industry over the last decade. The last three years have, however, been far more turbulent for Allegiant and the Transportation-Air Market-both up just around 4%. With this in mind, shares of the discount airline firm have had a comeback over the last year. ALGT stock is up 5% over the last 12 months, against its industry's 14% decline. Better yet, Allegiant has soared over 41% in 2019. Despite its strong overall performance, shares of ALGT currently rest roughly 10% below their 52-week highs, which could set up a solid buying opportunity for those high on Allegiant.  Other Fundamentals  Allegiant currently utilizes two aircraft: the 156-seat Airbus A319 and the roughly 180-sear Airbus A320. The simple fact that Allegiant hasn't been exposed to Boeing's 737 Max groundings is a good thing. Allegiant executives also praised Airbus' fuel efficiencies. With this in mind, lower global  oil prices  could help the company during the upcoming holiday travel period. Furthermore, Allegiant's total passengers surged 12.6% last quarter, with revenue passenger miles up 11.5% and available seat miles up 13.4%. On top of that, the overall airline industry appears strong right now, which might help boost Allegiant. The Transportation - Airline industry currently ranks in the top 12% of our 256 Zacks industries. Investors should note that ALGT holds \"B\" grades for both Value and Momentum in our Style Scores system. The company is also set to pay a dividend of $0.70 per share on September 27 to shareholders of record as of September 20. Allegiant's annualized payout currently comes out to $2.80 a share, with a 1.97% yield that looks very strong as the yields on the 10-year U.S. Treasury sit at 1.46%.  Outlook & Earnings Trends  Looking ahead, our current Zacks Consensus Estimates call for the firm's Q3 2019 revenue to jump 9.23% to reach $429.39 million. This would fall short of last quarter's 12.6% operating revenue expansion. Still, the firm's Q4 revenue is projected to grow by over 11% to help lift full-year fiscal 2019 revenue by 9.7% to $1.83 billion. Then, peeking ahead to 2020, Allegiant's revenue is projected to climb 11.3% above our current-year estimate to reach $2.04 billion. At the bottom end of the income statement, ALGT's adjusted third-quarter earnings are projected to skyrocket from $0.94 per share in the year-ago period to reach $2.23 a share. The firm's Q4 earnings are expected to climb 40%, with fiscal 2019's EPS figure then projected pop 36.5%. And this insane bottom-line growth is projected to be followed up with another 12.4% expansion in 2020.  Bottom Line  Allegiant has seen its earnings estimate revision activity trend more heavily in the right direction recently, especially for fiscal 2019 and 2020. This positivity helps ALGT earn a Zacks Rank #1 (Strong Buy) and look like a stock that investors might want to consider picking up at the moment. Lastly, the company announced in early August that it landed the naming rights for \"the under-construction future home of the Raiders and UNLV football,\" which could help provide more national exposure.  Bear of the Day  : Shares of International Paper have tumbled over 25% in the past year as part of a much broader industry downturn that has seen the paper market slide over 45%. And International Paper's outlook doesn't appear as though it will inspire much investor confidence anytime soon.  Quick Overview  International Paper is a global paper giant that produces renewable fiber-based packaging, pulp, and paper products. The Memphis, Tennessee-based firm manufactures products around the world and its more than 25,000 customers helped it pull in $23 billion in revenue last year. Overall, 69% of the company's total sales come from its Industrial Packaging division, with most of that coming from its North American segment. This includes packaging and boxes used in everything from processed food and beverages to durable/non-durable goods. The firm also runs a North American recycling business. Meanwhile, International Paper makes pulp used in tissue, diapers, and other personal hygiene products. Its global Cellulose Fibers division accounts for 12% of revenue. Lastly, IP produces a variety of papers geared toward both businesses and households, which makes up 19% of sales. International Paper is still a global powerhouse, but it faces some tough market conditions. In April, Bank of America Merrill Lynch analyst George Staphos downgraded IP stock on the back of larger, non-company specific forces. \"Recent containerboard and box data suggests producers are having challenges managing excess inventory and production, and pricing could remain subdued for the foreseeable time,\" Staphos wrote  in a note. Last quarter, IP's net sales slipped roughly 2.8% and fell short of our estimates.  Outlook & Earnings Trends  Looking ahead, International Paper's third-quarter fiscal 2019 revenue is projected to come in at $5.73 billion, based on our current Zacks Consensus Estimates. This would mark a similar 2.8% decline from the year-ago period. The firm's Q4 sales are then projected to fall roughly 3.7% to help bring full-year fiscal 2019 sales down 1.9%. Peeking further ahead, fiscal 2020 revenues are expected to come in roughly 1% below our current-year estimate. The bottom end of the income statement looks much worse for International Paper. The company's adjusted Q3 earnings are projected to tumble approximately 36% from the prior-year quarter. IP's fourth-quarter EPS figure is expected to sink over 25%. And the firm's full-year fiscal 2019 earnings are projected to slip 15.6%, with 2020 expected to come in 13.3% lower than our current-year estimate.  Bottom Line  International Paper is still a strong company that returns money to investors through dividends and repurchases. The firm also boasts some solid valuation metrics, which are somewhat inflated based on its recent downturn. Nonetheless, IP's earnings estimate revision activity has trended heavily in the wrong direction recently. This helps it earn a Zacks Rank #5 (Strong Sell) and a \"D\" grade for Momentum in our Style Scores system.   Amazon Roundup: India, Indonesia, Canada, Logistics &     More   Amazon is strengthening its position in India despite regulatory setbacks; it is investing in a leading Indonesian ecommerce company; increasing logistics capabilities in Canada; and helping the police, getting sued by publishers and defeating the IRS in the U.S.  India  India's crackdown on fraudulent practices by non-banking financial institutions and its move to ban international auditing firm Deloitte and a KPMG affiliate has rattled corporate heads, contributing to lower growth rates and impacting the stock market. Amazon India head Amit Agarwal took the opportunity to say that India could improve its growth rates by promoting ecommerce rather than holding it back with red tape and unfriendly laws. He also said that Amazon's push for SMB exports had contributed a billion dollars to the country's exports and that the next three years would see this number climb to $5 billion. Amazon is specifically opposing the government's move to protect small sellers that can't compete with the deep discounts on the platform. The Confederation of All India Traders (CAIT) are accusing big retailers like Amazon of continuing to use complex measures to circumvent the protective law that went into effect this February. Agarwal's comments seem to indicate that the company is opposing rather than requesting time to build the data centers necessary to store Indian data within its borders, in line with global sentiments. Amazon has however inaugurated a new campus in the southern city of Hyderabad and there are no known plans of slowing down investment in the country, where Prime memberships continue to grow at the fastest rate in the world. Amazon is making arrangements to acquire a larger stake in Future Retail, one of the leading traditional retail chains in India. So, through Amazon.Com NV Investment Holdings LLC it has agreed to buy a 49% stake in Future Coupons Ltd, which holds warrants that can be converted partly or wholly into Future Retail shares. The warrants can be exercised in the next three to 10 years. It was earlier reported that Amazon was looking to buy a 10% stake in the company, valued at 20 billion rupees, or $278 million.  Investment in Indonesia's Gojek App  Bloomberg and Reuters are saying that Amazon is in talks to acquire a stake in Indonesian super app Gojek. Presumably the super prefix is because the app lets you hail rides, order dinner, shop groceries, make payments through a digital wallet, appoint cleaners, masseuses, hairdressers, etc, order medicines, and many other things. Its usefulness has enabled its expansion across Indonesia, the Philippines, Singapore, Thailand and Vietnam, where it serves 260 million people and competes with Alibaba (BABA) and Shopee. In Indonesia, where it launched, ecommerce sales are expected to jump from the current $12.2 billion to $53 billion in the next five years. The terms of the deal aren't known, but it definitely looks like a good place to kick-start Amazon's investment in the region.  Equity Stake in Canadian Airline Cargojet  Amazon continues to corner logistics capabilities in an attempt to serve its customers better. So similar to its agreements with U.S. air carriers Atlas Air Worldwide Holdings and Air Transport Services Group, it has signed an agreement with Toronto-based Cargojet, which operates 21 freighters (Boeing 757s and 767s). Accordingly, Cargojet will issue warrants that can, after seven years, be converted into voting shares, giving Amazon a 9.9% stake in the company. In exchange, Amazon will make sure it contributes C$ 400 million in volumes through the period. There's also a separate agreement giving Amazon warrants to buy, after seven years, an additional 5% of variable voting shares, for C$ 200 million.  Partnership with 400 Police Forces  Amazon-owned Ring has set itself up for fresh controversy by partnering with 400 police departments across the country. It allows law enforcement access to video recorded by the camera system that typically detects motion and transmits to the user, which can be viewed and shared as desired. Policemen won't get live access to the data unless publicly shared, but only by requesting the home owner, who has the prerogative to refuse.   Privacy advocates and critics fear this could increase racial profiling, while turning police officers into salespeople for surveillance-systems and increase community paranoia. Amazon, however, has said that the technology is so great that it can also identify emotions like fear, happiness, sadness, anger, surprise, disgust, calmness and confusion although it isn't against a certain amount of regulation. Its shareholders rejected proposals to stop selling the technology to government agencies and also to investigate privacy violations.  Amazon's Audible Sued for Copyright Infringement  Amazon doesn't appear to learn well from past mistakes, or tries to stretch what it can do with everything at its disposal. In the past, the company has got on the wrong side of publishers, authors and the Authors Guild because of unauthorized use of copyrights. And now it's doing pretty much the same thing with its audio book company Audible. Its new speech-to-text feature called \"Captions\" can use machine learning to reproduce voice recordings so children can see the text that they're hearing. The text may not be a hundred percent accurate, Amazon warns, and is intended to be more an education aid than anything else, according to the company. This is supposed to legalize the textual reproduction notwithstanding the fact that it will in all probability impact sales of print and digital book sales, hurting authors and publishers.  Of course, publishers, including Hachette, HarperCollins, Macmillan, Penguin Random House, Simon & Schuster, Chronicle Books and Scholastic don't agree with the thinking. So they and the Association of American Publishers, to which they subscribe, have sued Amazon in the Southern District Court of New York for copyright infringement.  IRS Appeal in U.S. Tax Dispute  Amazon won a 3-0 ruling in its favor at the 9th U.S. Circuit Court of Appeals in Seattle. The court upheld the 2017 U.S. tax court ruling against the IRS, represented by the Justice Department. The case was in relation to the definition of intangibles that were transferred to its Luxemburg headquarters in Europe. Amazon claimed that the value was limited to independently transferable assets, while the IRS wanted to include things like goodwill, employees and \"culture of innovation.\" A 2017 amendment to the tax law does include these things, and would have enabled the IRS to increase the tax bill. But the judge held that since the increased scope of intangibles in 2017 did not apply to what Amazon transacted in 2005 and 2006, it couldn't be held liable.  Recommendation  Amazon shares carry a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>   Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      https://www.zacks.com  Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer  . Past performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  https://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Allegiant Travel Company (ALGT): Free Stock Analysis Report   Amazon.com, Inc. (AMZN): Free Stock Analysis Report   International Paper Company (IP): Free Stock Analysis Report   Atlas Air Worldwide Holdings (AAWW): Free Stock Analysis Report   Air Transport Services Group, Inc (ATSG): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " For Immediate Release ",
    "Chicago, IL - September 4, 2019 - Zacks Equity Research  Allegiant Travel Company ALGT  as the Bull of the Day, International Paper IP  as the Bear of the Day. In addition, Zacks Equity Research provides analysis on Amazon AMZN  , Atlas Air Worldwide Holdings AAWW  and Air Transport Services Group ATSG  .",
    "Here is a synopsis of all five stocks:",
    "  Bull of the Day  : ",
    "Shares of Allegiant Travel Company have soared in 2019 to easily outpace the broader Transportation-Air Market. Many of the discount airline firm's fundamentals appear strong and its top and bottom lines are projected to climb significantly both this year and next.  ",
    " The Basics ",
    "Allegiant refers to itself as an \"integrated travel company with an airline at its heart.\" The Las Vegas-based firm offers customers low-cost flights from smaller cities throughout the U.S., as well as to vacation hubs such as Phoenix, Orlando, and of course, Las Vegas. Allegiant also sells travel package bundles that include flights, hotels, rental cars, and tickets to local entertainment events.",
    "Investors should also note that the firm doesn't even fly every day, opting instead for flights on \"only the days when most people want to fly.\" This helps the company that was founded in the late 1990s save money. In fact, Allegiant's 22% airline operating margin led the industry in the first quarter and that figure popped to 24% in Q2.",
    "Allegiant currently runs more than 450 routes across the country and provides nonstop, scheduled service from over 110 U.S. cities. The firm also boasts that its base fares cost less than half than average domestic roundtrip ticket. ALGT doesn't really compete against giants such as United , American or even JetBlue. Instead, it likely finds itself up against the likes of Spirit and other discount airlines. Nonetheless, Allegiant looks poised to expand its business, which includes bringing its leisure model to Mexico and the Caribbean in the \"coming years.\"",
    " Price Movement ",
    "Moving on, ALGT stock has crushed its industry over the last decade. The last three years have, however, been far more turbulent for Allegiant and the Transportation-Air Market-both up just around 4%. With this in mind, shares of the discount airline firm have had a comeback over the last year. ALGT stock is up 5% over the last 12 months, against its industry's 14% decline.",
    "Better yet, Allegiant has soared over 41% in 2019. Despite its strong overall performance, shares of ALGT currently rest roughly 10% below their 52-week highs, which could set up a solid buying opportunity for those high on Allegiant.",
    " Other Fundamentals ",
    "Allegiant currently utilizes two aircraft: the 156-seat Airbus A319 and the roughly 180-sear Airbus A320. The simple fact that Allegiant hasn't been exposed to Boeing's 737 Max groundings is a good thing. Allegiant executives also praised Airbus' fuel efficiencies. With this in mind, lower global  oil prices  could help the company during the upcoming holiday travel period.",
    "Furthermore, Allegiant's total passengers surged 12.6% last quarter, with revenue passenger miles up 11.5% and available seat miles up 13.4%. On top of that, the overall airline industry appears strong right now, which might help boost Allegiant. The Transportation - Airline industry currently ranks in the top 12% of our 256 Zacks industries.",
    "Investors should note that ALGT holds \"B\" grades for both Value and Momentum in our Style Scores system. The company is also set to pay a dividend of $0.70 per share on September 27 to shareholders of record as of September 20. Allegiant's annualized payout currently comes out to $2.80 a share, with a 1.97% yield that looks very strong as the yields on the 10-year U.S. Treasury sit at 1.46%.",
    " Outlook & Earnings Trends ",
    "Looking ahead, our current Zacks Consensus Estimates call for the firm's Q3 2019 revenue to jump 9.23% to reach $429.39 million. This would fall short of last quarter's 12.6% operating revenue expansion. Still, the firm's Q4 revenue is projected to grow by over 11% to help lift full-year fiscal 2019 revenue by 9.7% to $1.83 billion. Then, peeking ahead to 2020, Allegiant's revenue is projected to climb 11.3% above our current-year estimate to reach $2.04 billion.",
    "At the bottom end of the income statement, ALGT's adjusted third-quarter earnings are projected to skyrocket from $0.94 per share in the year-ago period to reach $2.23 a share. The firm's Q4 earnings are expected to climb 40%, with fiscal 2019's EPS figure then projected pop 36.5%. And this insane bottom-line growth is projected to be followed up with another 12.4% expansion in 2020.",
    " Bottom Line ",
    "Allegiant has seen its earnings estimate revision activity trend more heavily in the right direction recently, especially for fiscal 2019 and 2020. This positivity helps ALGT earn a Zacks Rank #1 (Strong Buy) and look like a stock that investors might want to consider picking up at the moment.",
    "Lastly, the company announced in early August that it landed the naming rights for \"the under-construction future home of the Raiders and UNLV football,\" which could help provide more national exposure.",
    " Bear of the Day  :",
    "Shares of International Paper have tumbled over 25% in the past year as part of a much broader industry downturn that has seen the paper market slide over 45%. And International Paper's outlook doesn't appear as though it will inspire much investor confidence anytime soon.",
    " Quick Overview ",
    "International Paper is a global paper giant that produces renewable fiber-based packaging, pulp, and paper products. The Memphis, Tennessee-based firm manufactures products around the world and its more than 25,000 customers helped it pull in $23 billion in revenue last year. Overall, 69% of the company's total sales come from its Industrial Packaging division, with most of that coming from its North American segment. This includes packaging and boxes used in everything from processed food and beverages to durable/non-durable goods.",
    "The firm also runs a North American recycling business. Meanwhile, International Paper makes pulp used in tissue, diapers, and other personal hygiene products. Its global Cellulose Fibers division accounts for 12% of revenue. Lastly, IP produces a variety of papers geared toward both businesses and households, which makes up 19% of sales.",
    "International Paper is still a global powerhouse, but it faces some tough market conditions. In April, Bank of America Merrill Lynch analyst George Staphos downgraded IP stock on the back of larger, non-company specific forces. \"Recent containerboard and box data suggests producers are having challenges managing excess inventory and production, and pricing could remain subdued for the foreseeable time,\" Staphos wrote  in a note. Last quarter, IP's net sales slipped roughly 2.8% and fell short of our estimates.",
    " Outlook & Earnings Trends ",
    "Looking ahead, International Paper's third-quarter fiscal 2019 revenue is projected to come in at $5.73 billion, based on our current Zacks Consensus Estimates. This would mark a similar 2.8% decline from the year-ago period. The firm's Q4 sales are then projected to fall roughly 3.7% to help bring full-year fiscal 2019 sales down 1.9%. Peeking further ahead, fiscal 2020 revenues are expected to come in roughly 1% below our current-year estimate.",
    "The bottom end of the income statement looks much worse for International Paper. The company's adjusted Q3 earnings are projected to tumble approximately 36% from the prior-year quarter. IP's fourth-quarter EPS figure is expected to sink over 25%. And the firm's full-year fiscal 2019 earnings are projected to slip 15.6%, with 2020 expected to come in 13.3% lower than our current-year estimate.",
    " Bottom Line ",
    "International Paper is still a strong company that returns money to investors through dividends and repurchases. The firm also boasts some solid valuation metrics, which are somewhat inflated based on its recent downturn. Nonetheless, IP's earnings estimate revision activity has trended heavily in the wrong direction recently. This helps it earn a Zacks Rank #5 (Strong Sell) and a \"D\" grade for Momentum in our Style Scores system.",
    "  Amazon Roundup: India, Indonesia, Canada, Logistics &     More  ",
    "Amazon is strengthening its position in India despite regulatory setbacks; it is investing in a leading Indonesian ecommerce company; increasing logistics capabilities in Canada; and helping the police, getting sued by publishers and defeating the IRS in the U.S.",
    " India ",
    "India's crackdown on fraudulent practices by non-banking financial institutions and its move to ban international auditing firm Deloitte and a KPMG affiliate has rattled corporate heads, contributing to lower growth rates and impacting the stock market. Amazon India head Amit Agarwal took the opportunity to say that India could improve its growth rates by promoting ecommerce rather than holding it back with red tape and unfriendly laws.",
    "He also said that Amazon's push for SMB exports had contributed a billion dollars to the country's exports and that the next three years would see this number climb to $5 billion.",
    "Amazon is specifically opposing the government's move to protect small sellers that can't compete with the deep discounts on the platform. The Confederation of All India Traders (CAIT) are accusing big retailers like Amazon of continuing to use complex measures to circumvent the protective law that went into effect this February.",
    "Agarwal's comments seem to indicate that the company is opposing rather than requesting time to build the data centers necessary to store Indian data within its borders, in line with global sentiments.",
    "Amazon has however inaugurated a new campus in the southern city of Hyderabad and there are no known plans of slowing down investment in the country, where Prime memberships continue to grow at the fastest rate in the world.",
    "Amazon is making arrangements to acquire a larger stake in Future Retail, one of the leading traditional retail chains in India. So, through Amazon.Com NV Investment Holdings LLC it has agreed to buy a 49% stake in Future Coupons Ltd, which holds warrants that can be converted partly or wholly into Future Retail shares. The warrants can be exercised in the next three to 10 years. It was earlier reported that Amazon was looking to buy a 10% stake in the company, valued at 20 billion rupees, or $278 million.",
    " Investment in Indonesia's Gojek App ",
    "Bloomberg and Reuters are saying that Amazon is in talks to acquire a stake in Indonesian super app Gojek.",
    "Presumably the super prefix is because the app lets you hail rides, order dinner, shop groceries, make payments through a digital wallet, appoint cleaners, masseuses, hairdressers, etc, order medicines, and many other things. Its usefulness has enabled its expansion across Indonesia, the Philippines, Singapore, Thailand and Vietnam, where it serves 260 million people and competes with Alibaba (BABA) and Shopee. In Indonesia, where it launched, ecommerce sales are expected to jump from the current $12.2 billion to $53 billion in the next five years.",
    "The terms of the deal aren't known, but it definitely looks like a good place to kick-start Amazon's investment in the region.",
    " Equity Stake in Canadian Airline Cargojet ",
    "Amazon continues to corner logistics capabilities in an attempt to serve its customers better. So similar to its agreements with U.S. air carriers Atlas Air Worldwide Holdings and Air Transport Services Group, it has signed an agreement with Toronto-based Cargojet, which operates 21 freighters (Boeing 757s and 767s).",
    "Accordingly, Cargojet will issue warrants that can, after seven years, be converted into voting shares, giving Amazon a 9.9% stake in the company. In exchange, Amazon will make sure it contributes C$ 400 million in volumes through the period. There's also a separate agreement giving Amazon warrants to buy, after seven years, an additional 5% of variable voting shares, for C$ 200 million.",
    " Partnership with 400 Police Forces ",
    "Amazon-owned Ring has set itself up for fresh controversy by partnering with 400 police departments across the country.",
    "It allows law enforcement access to video recorded by the camera system that typically detects motion and transmits to the user, which can be viewed and shared as desired. Policemen won't get live access to the data unless publicly shared, but only by requesting the home owner, who has the prerogative to refuse.  ",
    "Privacy advocates and critics fear this could increase racial profiling, while turning police officers into salespeople for surveillance-systems and increase community paranoia.",
    "Amazon, however, has said that the technology is so great that it can also identify emotions like fear, happiness, sadness, anger, surprise, disgust, calmness and confusion although it isn't against a certain amount of regulation.",
    "Its shareholders rejected proposals to stop selling the technology to government agencies and also to investigate privacy violations.",
    " Amazon's Audible Sued for Copyright Infringement ",
    "Amazon doesn't appear to learn well from past mistakes, or tries to stretch what it can do with everything at its disposal. In the past, the company has got on the wrong side of publishers, authors and the Authors Guild because of unauthorized use of copyrights. And now it's doing pretty much the same thing with its audio book company Audible.",
    "Its new speech-to-text feature called \"Captions\" can use machine learning to reproduce voice recordings so children can see the text that they're hearing. The text may not be a hundred percent accurate, Amazon warns, and is intended to be more an education aid than anything else, according to the company. This is supposed to legalize the textual reproduction notwithstanding the fact that it will in all probability impact sales of print and digital book sales, hurting authors and publishers. ",
    "Of course, publishers, including Hachette, HarperCollins, Macmillan, Penguin Random House, Simon & Schuster, Chronicle Books and Scholastic don't agree with the thinking. So they and the Association of American Publishers, to which they subscribe, have sued Amazon in the Southern District Court of New York for copyright infringement.",
    " IRS Appeal in U.S. Tax Dispute ",
    "Amazon won a 3-0 ruling in its favor at the 9th U.S. Circuit Court of Appeals in Seattle. The court upheld the 2017 U.S. tax court ruling against the IRS, represented by the Justice Department.",
    "The case was in relation to the definition of intangibles that were transferred to its Luxemburg headquarters in Europe. Amazon claimed that the value was limited to independently transferable assets, while the IRS wanted to include things like goodwill, employees and \"culture of innovation.\"",
    "A 2017 amendment to the tax law does include these things, and would have enabled the IRS to increase the tax bill. But the judge held that since the increased scope of intangibles in 2017 did not apply to what Amazon transacted in 2005 and 2006, it couldn't be held liable.",
    " Recommendation ",
    "Amazon shares carry a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    https://www.zacks.com ",
    "Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer  .",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  https://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:50:00"
}