{
  "url": "https://www.nasdaq.com/article/dubai-house-prices-to-fall-sharply-20190905-00003",
  "title": "Dubai house prices to fall sharply - Nasdaq.com",
  "text": [
    "By Md Manzer Hussain and Shrutee Sarkar",
    "BENGALURU, Sept 5 (Reuters) - Dubai house prices will decline sharply this year and next, according to property market experts in a Reuters poll, who said a slowdown in the economy and an oversupply of housing units are big downside risks to their already weak outlook.",
    "Dubai - with a diversified trade and tourism economy and one of the seven territories of the United Arab Emirates - has faced a sharp slowdown in its real estate market for most of this decade, barring a pick up for a brief period more than five years ago.",
    "The Aug. 14-Sept. 3 Reuters poll of market analysts at 11 investment firms and research institutions showed house prices in Dubai would fall 10% this year and 5% next. They are forecast to decline 3.3% in 2021.",
    "Those views also driven by worries the U.S.-China trade war is hurting global growth, and lines up with similar Reuters polls which showed housing market activity in the United States, Britain, Canada and India is struggling.US/HOMESGB/HOMESCA/HOMESIN/HOMES",
    "Last year, Dubai's economy grew just 1.94%, the slowest since the 2009 financial crisis, hurt by a rough patch amid a downturn in its real estate market. ",
    "Dubai, whose economy is focused on tourism and international business services, is now forecast to grow 3.8% in 2020 and 2.8% in 2021, according to the government but much will depend on external factors. ",
    "\"MARKET CORRECTION\"",
    "While a recently announced government stimulus package could spur a recovery in the real estate market, the chances are high an over-supply of housing units would hurt prices and demand.",
    "\"At the moment, there is a glut of supply coming into the market, which has been the case over the last couple of years,\" said Haider Tuaima, head of real estate research at ValuStrat.",
    "\"There have been record numbers of off-plan projects since 2017 that were met by very successful sales campaigns promising very attractive payment plans for investors that run post-handover for a number of years, which has impacted the capital values of existing properties in Dubai,\" he added.",
    "But when asked what would boost the weakening property market, a majority of analysts in the poll said any introduction of affordable homes would provide the biggest upside.",
    "Other options available were strong economic performance, visa reforms and the upcoming 2020 World Expo.",
    "\"Overall, price declines have been healthy for Dubai as prices were inflated,\" said Lynnette Abad, director of research and data for the Propertyfinder group.",
    "\"The new supply coming in will continue to put pressure on prices and we will see declines in the double digits, however this will make housing more affordable.\"",
    "Property prices have contracted by 25-35% since a mid-2014 peak and there will be no respite until 2022 at least, the poll showed.",
    "Yet when asked on a scale of one to 10, where one is extremely cheap and 10 extremely expensive, what best describes the level of Dubai house prices, the median was seven which is leaning towards the expensive side.",
    "\"The Dubai realty market is witnessing a market correction as property prices are adjusting to the increased new supply,\" said Shajai Jacob, CEO of Middle East business at ANAROCK Property Consultants.",
    "\"This benefits consumers who may have previously aspired to own a property but were priced out.\""
  ],
  "published_datetime": "2019-09-05 12:05:00"
}