{
  "url": "https://www.nasdaq.com/article/wall-street-upgraded-this-popular-pot-stock-but-youd-best-avoid-it-cm1210848",
  "title": "Wall Street Upgraded This Popular Pot Stock, but You'd Best Avoid It - Nasdaq.com",
  "text": [
    "The cannabis industry is budding in front of our eyes , and it's really caught the attention of Wall Street over the past couple of years. While growth estimates tend to vary pretty wildly -- which is to be expected of an industry with no legal precedence -- the takeaway is that global marijuana sales should soar over the next decade.",
    "For its role, Wall Street has tended to be mostly bullish on what few cannabis stocks have merited coverage. The usual suspects, such as Canopy Growth and Aurora Cannabis , have mostly received buy recommendations from Wall Street, with analysts noting that their superior production and global positioning put both companies in great position to succeed over the long run.",
    "Image source: Getty Images.",
    "On the other side of the coin, Wall Street has had little love for Cronos Group (NASDAQ: CRON) . Mind you, this is a company that's one of the most popular among millennial investors , but which has had four separate sell-equivalent ratings issued by Wall Street. However, that changed last week when BMO Capital Markets upgraded Cronos from underperform to a new rating of neutral, although the company's price target was lowered modestly to 16 Canadian dollars ($12.15 U.S.) from a previous target of CA$17.",
    "Covering analyst Tamy Chen at BMO pointed out in a research note to clients that Cronos Group's recent 40%-plus decline now has it trading more or less on par with its similarly sized licensed producers -- about 13 times estimated 2020 sales.",
    "Though it's a company I've been highly critical of in the past , Cronos Group does have two factors that would seemingly make it attractive to investors.",
    "First, there's the fact that in mid-March it completed a deal to receive $1.8 billion in cash from tobacco giant Altria in exchange for a 45% non-diluted stake in the company. This cash is transformative for Cronos in that it'll allow the company to make earnings accretive acquisitions, as well as expand into international markets. Plus, having Altria as an investment partner isn't too bad, given its prowess for marketing and international expansion. This cash provides Cronos Group with some semblance of downside protection.",
    "Image source: Getty Images.",
    "The second factor likely to attract investors is Cronos Group's focus on being a cannabinoid company. Unlike other major growers, Cronos Group isn't trying to outdo its peers on production. Rather, this is a company that wants to devote its attention to higher-margin derivative sales , such as vapes. Cronos also has a noteworthy deal with Ginkgo Bioworks that could lead to the commercial production of targeted cannabinoids.",
    "Then again, while Cronos did receive a rare boost from Wall Street, it still doesn't represent a very attractive investment opportunity -- and even Chen partially agrees.",
    "In her research note to clients, Chen also notes that Cronos Group's production and adult-use sales have lagged its peers. She also points to uncertainties surrounding the supply chain of cannabis products in Canada, especially with derivatives set to hit dispensary shelves in mid-December.",
    "The latter point made by Chen is one that I believe bears repeating. Since recreational weed sales commenced on Oct. 17, 2018, supply issues have been fairly persistent throughout Canada. Regulatory agency Health Canada has worked to remedy its licensing backlog , while compliant packaging suppliers are attempting to work through recent shortages. Nevertheless, it's increasingly unlikely that supply chain issues will be resolved by the time derivative products launch in a little more than three months. This suggests that derivative-focused companies like Cronos will deal with the same headaches as it did with the dried flower launch last year.",
    "Image source: Getty Images.",
    "I'd also offer a note of caution given growing health concerns surrounding vaping . In the United States, the Centers for Disease Control and Prevention has identified more than 450 lung illnesses tied to vaping, along with five deaths. At this point, it remains somewhat of a mystery as to what's specifically causing these lung diseases, other than that they've been more prevalent with users of tetrahydrocannabinol (THC)-infused vape products. THC is the psychoactive cannabinoid that gets users high. With Cronos Group's direct ties to Altria, and its clear desire to be a major cannabis vape player, this news could prove damaging in the near term.",
    "Another reason for investors to say \"nay\" to Cronos Group is the company's disappointing operating results . If you were to look solely at the headline figures, you'd see that Cronos generated a huge per-share profit in each of the past two quarters. However, this was the result of revaluing derivative liabilities tied to warrants given to Altria. If all of these one-time benefits and costs are stripped out, the company's CA$251 million comprehensive income during the second quarter turns into an operating loss of CA$20.8 million (excluding fair-value adjustments, too). This company isn't anywhere close to being profitable without a number of one-time benefits and revaluations, and that should be reflected in its share price.",
    "Make no mistake about it, Cronos Group is far closer to a realistic valuation than it was during February or March. However, it hasn't exactly shown much in the operating department to suggest that it merits a valuation that's significantly higher than other licensed producers. That makes this a pot stock worth avoiding, even if Wall Street's opinion on the company has begun to soften a bit.",
    "Here's The Marijuana Stock You've Been Waiting For A little-known Canadian company just unlocked what some experts think could be the key to profiting off the coming marijuana boom. ",
    "And make no mistake - it is coming.",
    "Cannabis legalization is sweeping over North America - 10 states plus Washington, D.C., have all legalized recreational marijuana over the last few years, and full legalization came to Canada in October 2018.",
    "And one under-the-radar Canadian company is poised to explode from this coming marijuana revolution.",
    "Because a game-changing deal just went down between the Ontario government and this powerhouse company...and you need to hear this story today if you have even considered investing in pot stocks.",
    "Simply click here to get the full story now.",
    "Learn more",
    "Sean Williams has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 06:06:00"
}