{
  "url": "https://www.nasdaq.com/article/the-monetary-policy-endgame-cm1207679",
  "title": "The monetary policy endgame - Nasdaq.com",
  "text": [
    "   The major global central banks continue to draw bigger guns in their battle against deflation  , yet in some places, it appears to be of no avail. The fact is that the share of sovereign yields that are in negative territory keeps increasing and the average level of these interest rates becomes ever more negative. Further, quantitative easing  (QE) purchases of sovereign debt have transitioned to purchases of corporate debt, and in some places equities; with inflation still elusive and improved growth prospects in question. That all leads one to wonder where (and how) these policies end? What is today's monetary policy endgame? Turn to economic history for perspective  In order to envision the monetary policy endgame several years (or a decade) from now, let's start by stepping back and examining two of the foundational tenets that have driven the global economy and financial markets since the 1970s. The first principle is that the major central banks embraced a roughly 2% inflation target (implicit for the Federal Reserve  since, at least, 1995 and explicitly stated since 2012), and the second factor is the end of the Bretton Woods  monetary system; marking the shift away from the gold standard and into a world of fiat currency fluctuation. The commitment to the 2% inflation target is extremely important for understanding our current monetary policy challenges, because that target was premised around structural forces that no longer exist (given this era of demographic aging and rapid technological development, which both hold down broad-based inflation). Still, the switch to fiat currency about two decades before the 2% inflation target was set, ironically paves the way for the inflation target to be met - eventually. The question that remains, then, is just \"how\" this will be the case? However, before we answer that we must examine why inflation peaked in 1979 and why it has been in a downtrend since then? In other words, what are the structural forces creating disinflation  ? There are four major forces that created inflation prior to 1979 and resulted in disinflation afterward. First, the population growth rate following the post war Baby Boom peaked around 1979/1980 and subsequently slowed. Second, the growth rate of female participants in the labor force also peaked around 1979/1980 and subsequently slowed. Third, the U.S. and China opened diplomatic and trade relations in 1979, as a result of Deng Xiaoping's reforms, arguably marking the beginning of the latest stage of globalization. Finally, the oil shocks of the 1970s, ending with the 1979 Iranian Revolution and a surge in oil-driven inflation were a critical factor in the price rises of that time. This latter event was followed by the subsequent commitment from a then relatively newly formed  OPEC  that it would act as an oil supplier of last resort, helping to keep  oil prices  from becoming too volatile (a role it has largely maintained until today). Fascinatingly, in recent years technological innovations have taken hold that form an important new disinflationary force. Specifically, we've seen price transparency and information symmetry, which are driven by the proliferation of smartphones, the Internet and the Information Age, more broadly. These forces are flattening supply curves  across a huge variety of products, making traditional aggregate demand stimulus less effective in creating inflation. Demand expands, but prices don't rise as they did in the past, because everyone is aware of exactly what the marginal good should cost and will not pay a cent more than can be (instantly) found at the cheapest online supplier. [storytout]Follow Rick Rieder on Twitter  . [/storytout] Thus, some huge inflationary forces pre-1979 have since abated, and some tremendous disinflationary forces have entered the picture post-1979, but at the end of the day these are all significant, secular, factors that are not likely to be reversible (with the possible exception of globalization, but even then, only to a modest degree). The fact is that central banks' actions, so far, have simply been too modest to matter against the backdrop of these tectonic changes. Moreover, we would argue that central banks have already achieved meaningful price stability (for instance, the volatility of CPI is near its lowest levels in history), but the natural rate of inflation is simply not 2%, but rather is something lower. So, despite the seemingly large size of monetary policy stimulus by historic standards, central banks have still only brought \"a knife to a gun fight,\" to paraphrase a film from the late-1980s, at least as far as creating sustained 2% inflation  is concerned. What ammunition central banks have yet to deploy  While the point is debatable, we do not think the arsenal of central bank tools is near exhausted, which brings us to the endgame and the concept of fiat currency  . There are two ways inflation  is created: one is to actually raise the prices of goods and services organically, but the other is to debase the currency in which those goods and services are sold (think helicopter money). Because the former method relies on traditional aggregate demand stimulus (lower interest rates), which has not been working, since the natural rate of aggregate demand growth is now so low (and in some places is contracting) and the supply curve is so flat; the endgame may well be monetary debasement  . Under the gold standard this would not have been possible, as every new dollar would have to be backed by physical gold mined from the earth (a very slow and expensive process, and likely without the requisite volumes), but today money is created by printing presses, or even a few computer keystrokes. In order to debase a currency, money needs to be created at a faster pace than goods and services are (essentially, liquidity growth needs to exceed world GDP growth). What does this mean for investors? Real rates  will definitionally need to be negative - and in fact more negative than the real rates of competitors (think competitive devaluation). The U.S. is not quite there yet, but we will see as soon as next month how much closer the ECB gets to monetary debasement (we think they're still some ways away, as they haven't fully exhausted their negative interest rate path, it seems). Ironically, the beggar-thy-neighbor implications of competitive devaluations will almost certainly incite a response from countries who may not originally even have needed to resort to currency debasement in the first place, raising the potential for full blown currency war  . Investment implications  How should one position for such an endgame? As is probably evident, any nominal instrument will be devalued in real terms, so the solution is to hold an asset that maintains its real value - an asset that cannot be printed  . We would include stocks (dividend yields are set on payout ratios, companies have some degree of pricing power, and shares outstanding are limited in number), real estate (it is difficult and expensive to expand the stock of real estate), and even commodity currencies, like gold  (again, limited supply and expensive to extract). By definition, the worst asset to hold would be a sovereign bond with a negative yield, closely followed by paper money at zero yield, both with a theoretically infinite supply. Unfortunately, such extreme devaluations in currencies could not only inflate the prices of real assets  but could also push Gini coefficients  to historically wide levels (a measure of the rich/poor divide) and may well fuel a continued rise in populist politics. Ultimately, this could have a real influence on central banking as we know it today, and/or the value of fiat currency. All of this is very difficult to anticipate in terms of the breadth and influence of these types of actions and ultimate reactions in terms of how prices, markets, investors, and central banks consequently adjust. Coming back from these extreme policies is very difficult, particularly as the aging demographic and concurrent potential growth trends embedded in the system provide a ceiling on above-trend growth, which otherwise could aid the economy in soft-landing from these policies. And, potentially more importantly, extremely low rates can and will encourage fiscal actors to add more, and potentially dramatically more, debt to an already historically-levered set of economies (e.g. the increased discussion of MMT). Hence, all of this leads one today to consider assets that can participate in an inherent devaluation  of the local currency, which is to say: equities, real estate, and even hard assets that have historic value-relevance, such as gold.  Rick Rieder,  Managing Director, is BlackRock's Chief Investment Officer of Global Fixed Income, is Head of the Global Allocation Investment Team, and is a regular contributor to The Blog  . Russell Brownback, Managing Director, Head of Global Macro positioning for Fixed Income, and Navin Saigal, Vice President, analyst and portfolio manager on BlackRock's Global Macro Strategies Team, both contributed to this post.  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 01:51:43"
}