{
  "url": "https://www.nasdaq.com/article/futures-fall-new-tariffs-take-effect-focus-shifts-to-central-banks-cm1206843",
  "title": "Futures Fall, New Tariffs Take Effect, Focus Shifts To Central Banks - Nasdaq.com",
  "text": [
    "The U.S. futures are lower in early Tuesday trading following an escalation of tariffs last weekend. U.S. tariffs on Chinese goods were increased on Sunday while those on U.S. goods going into China increased yesterday. Both sides indicate talks will continue and display a willingness to resolve the dispute. The caveat is that no deal is in sight and negotiations remain stalled. The two sides are expected to meet later this month but what happens then, if anything, is anyone's guess. China has also taken the dispute to the WTO in hopes they will force a resolution however unlikely that is.",
    "The major indices are all down about -0.80% to -0.85% in early trading. The chips stocks are in the lead but losses are broad if focused on international businesses. The retail sector is also moving lower because this latest round of tariffs is expected to impact consumers more than in the past. Later today, traders will be watching out for manufacturing PMI and construction spending figures. Later this week, economic data includes the ADP labor report, the NFP report, and ISM services. Next week the FOMC meets.",
    "The European markets are moving lower at midday on Tuesday on growing geopolitical fears. While the U.S./China trade war is the driving force of global market action it is the Brexit drama that has the attention of traders in the EU. This week there is a chance a bi-partisan group of MPs will force an emergency debate, reopening Parliament, and effectively blocking the no-deal Hard-Brexit. PM Boris Johnson's ruling party has let it be known he will call for a snap election if the MPs are successful in their bid to take over control of Parliamentary direction.",
    "The French CAC is leading the EU market lower with a loss of -0.45% while the DAX and FTSE trail with losses near -0.25%. In stock news , shares of Iliad are down nearly -2.75% after the company reported weaker than expected 1st half results. Shares of Takeaway are also down more than -2.5% after a leading shareholder of JustEat voted to block a proposed merger.",
    "Asian markets closed mixed after Tuesday's session as focus shifts to the central bankers. In today's news, the Reserve Bank of Australia decided to hold rates steady but left the door open for future cuts. The banks chief said they are waiting to see what kind of boost the last two rate cuts would provide. The RBA also says to expect lower rates for an extended period of time. And that it doesn't think the last two cuts were enough to get inflation back on track. The Nikkei and Shanghai both posted advances of 0.02% and 0.21%. the Hang Seng, ASX, and Kospi all posted losses, the Hang Seng leads with -0.39% the ASX lags at -0.90%.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:59:34"
}