{
  "url": "https://www.nasdaq.com/article/hooker-furniture-corp-hoft-q2-2019-earnings-call-transcript-cm1207917",
  "title": "Hooker Furniture Corp (HOFT) Q2 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "Image source: The Motley Fool.",
    "Hooker Furniture Corp (NASDAQ: HOFT)\r\n Q2 2019 Earnings Call\r\n Sep 5, 2019 , 8:00 a.m. ET",
    "Operator",
    "Greetings ladies and gentlemen and welcome to the Hooker Furniture Quarterly Investor Conference Call reporting its Operating Results for the Second Quarter. [Operator Instructions] A brief question-and-answer session will follow the formal presentation. [Operator Instructions]",
    "It is now my pleasure to introduce your host, Paul Huckfeldt, Vice President, Finance and Chief Financial Officer for Hooker Furniture Corporation.",
    "Paul Huckfeldt -- Vice President, Finance and Chief Financial Officer",
    "Thank you, Michael. Good morning and welcome to our quarterly call to review financial results for our fiscal 2020 second quarter, which ended on August 4, 2019. We appreciate your participation today.",
    "Paul Toms, our Chairman and CEO, and Doug Townsend, the Co-President of our Home Meridian Division, will join me for our prepared remarks. For the question and answer portion of the call, several of our business unit heads will be available to take questions, including Michael Delgatti, President of Hooker Domestic Upholstery and Emerging Channel; Home Meridian Co-President of Lee Boone; and Jeremy Hoff, President of our Hooker Branded segment and Anne Jacobson, our Chief Administrative Officer.",
    "During our call, we may make forward-looking statements, which are subject to risks and uncertainties. A discussion of factors that could cause our actual results to differ materially from management's expectations is contained in our press release and SEC filing announcing our fiscal 2020 second quarter results. Any forward-looking statements speak only as of today, we undertake no obligation to update or revise any forward-looking statement to reflect events or circumstances after today's call.",
    "This morning, we reported consolidated net sales of $152 million and net income of $4.2 million, or $0.35 per diluted share for the fiscal 2020 second quarter, which ended August 4, 2019. Compared to last year's second quarter, our net sales decreased $16.4 million or 9.7% and net income decreased $4.5 million or 52%. Earnings per diluted share decreased 52% from $0.74 a year ago.",
    "For the fiscal 2020 first half, consolidated net sales were $288 million with net income of $6.1 million or $0.52 per diluted share. Net sales were down 7.6% or $23.8 million compared to last year's first half. Earnings per diluted share decreased to $0.52 from $1.34 last year, a 61% decline from the prior year first half.",
    "Paul Toms will now comment on our fiscal 2020 second quarter results.",
    "Paul Toms -- Chairman & Chief Executive Officer",
    "Thanks, Paul and good morning everyone. As we expected after our first quarter, business in the second quarter was significantly impacted by tariffs on finished goods and component parts imported from China, as well as weak retail demand through the first eight months of this year. In addition, lingering effects of several cost related issues that began late last year at Home Meridian deflated our performance in the quarter. We believe the macroeconomic challenges related to the tariffs and soft retail conditions are affecting many companies in the furniture industry.",
    "Looking across our industry, many public furniture companies are reporting weaker sells and reduced earnings. Business disruptions from the 10% tariff imposed last September and the additional 15% tariff imposed, June 15 this year, have impacted both our top and bottom line.",
    "Revenues have been negatively affected by tariff rhetoric and turbulence in the market place and buy tariff-related price increases. These tariff dynamics have reduced retailer and consumer demand. Profitability has been negatively impacted by higher costs, which have also lowered margins.",
    "Despite all the headwinds, I believe we're doing an incredible job executing various measures to mitigate the impact of the tariff on our business going forward. These include negotiating vendor price concessions, passing through modest price increases to our retail customers, the first of which was put in place last fall and the most recent one in mid-June.",
    "And most importantly, we're well on schedule on shifting production away from China. While slightly over 40% of our product line was imported from China at the end of our most recent fiscal year, we expect about 22% of our products will be produced in China by the end of this fiscal year. The lower year-over-year sales trend that began in the first quarter continued in the second quarter.",
    "Home Meridians 14% or $13.8 million sales decline had the most impact on lower consolidated sales, while sales from the Hooker Branded segment and all other decreased modestly by $1.1 million or 2.8% at Hooker Branded and $1.4 million or 5.3% at all others compared to the prior-year second quarter. Home Meridian revenues were hit harder by tariff disruptions, because the company's base of larger retailers went into the year over inventoried and delayed reorders until late in the second quarter. As we approach the end of the quarter in July, retailers appeared to complete their inventory rebalancing and we began to see retail demand improve at HMI. HMI Division's Pulaski, Samuel Lawrence Furniture and Samuel Lawrence Hospitality all finished the quarter with double digit increases in their backlogs.",
    "The incoming order picture also brightened in July on a consolidated basis. Corporate wide incoming orders are trending positively compared to last quarter and the year-ago period. Since July, large retailers have been asking us to expedite orders so they can stock-up for the upcoming fall selling season, which is traditionally the strongest of the year for furniture sales.",
    "Backlogs are also -- are improving, with six of our 11 business units reporting higher backlogs than a year ago. While the sales trend was a bit weaker in the second quarter compared to the first, net income doubled, primarily because of better performance at HMI. HMI operating results improved to nearly break-even compared to the $5 million operating loss in Q1.",
    "Income at Home Meridian was nonetheless subdued from the lower top line tariff-related margin deterioration, inflated warehousing costs from increased inventories and other operational disruptions and resourcing costs caused by the tariffs.",
    "Taking a closer look at each of our segments, I'll begin with Hooker Branded. Net sales for the Hooker Branded segment decreased $1.1 million to 2.8% in the fiscal 2020 second quarter, driven by a low-single-digit sales decrease in the Hooker Casegoods division, partially offset by net revenue growth in the mid-to-upper single digits at Hooker Upholstery. Hooker Upholstery continues to benefit from an expanded product offering and higher average prices for a more sofa and sectional sales in its product mix.",
    "Momentum at Hooker Upholstery is also strong, with incoming orders up over 20% in the second quarter. At Hooker Casegoods, we passed on some tariff-related price increases in general, Casegoods are high-ticket, discretionary purchase. In an environment where retail sales are already weak and you layer in the tariff dynamics, it just gives an another reason for the consumer to postpone the purchase.",
    "Despite the sales decline and increased product cost, Hooker Branded was still highly profitable, with over 30% gross profit margin and 10% operating income margin during the quarter and for the first half. Upholstery stock were approximately six months of casegoods inventory in our Virginia warehouses. The impact of tariffs was felt much more on the demand side than in margins in the second quarter, although margins were not entirely unaffected and we recorded about $500,000 of increased LIFO expense in the quarter.",
    "All other, includes domestically produced upholstery divisions Bradington-Young, Shenandoah and Sam Moore, along with H contract, reported a net sales decrease of $1.4 million or 5.3% from $27.1 million in last year's second quarter to $25.7 million in the fiscal 2020 second quarter. Lower sales were driven by a sales decline in our upholstery manufacturing divisions due to lower demand, partially offset by continued growth at H contract, which specializes in furnishings for senior living and retirement facilities.",
    "Targeted sales efforts, product line expansions, innovations and mid-year product introductions had paid dividends in the segment with three of the four divisions reporting double-digit order increases in July.",
    "Under a new division President, Sam Moore is starting to grow again, with incoming orders up nearly 16% in July and backlogs up 2.5% compared to the prior year second quarter. Despite a sales increase -- I'm sorry, despite a sales decrease, all other gross profit increase in absolute terms and as a percentage of net sales due to lower materials cost and better cost containment. This segmen t report ed operating income margins of 6.8% for the fiscal second quarter and 8.3% for the first half.",
    "Now I'd like to call on Doug Townsend, our HMI Co-President to get more detail on the HMI segment performance this quarter.",
    "Douglas Townsend -- EVP and Chief Executive Officer of SLH",
    "Thanks, Paul. HMI sales in Q2 were $87.2 million, down $13.8 million or 14% versus last year. Continued softness at retail across all residential channel for distribution, compounded by ongoing industry disruptions resulting from the China tariffs, where the primary causes of the sales decreases. The retail softness negatively impacted four of our five business units, with sales down across all traditional furniture retail segments.",
    "SLH, our hospitality business unit reported strong sales growth in the second quarter with sales up 44% in the quarter as new sales initiatives and new customers increased demand in that segment.",
    "For the quarter, consolidated incoming orders were flat versus the prior year and backlog at the end of Q2 was down 9.7%. Both the order and backlog trends have improved significantly from Q1.",
    "Q2 operating results improved to break-even, also a substantial improvement from the loss reported in Q1. Second quarter income performance, while a step in the right direction was nonetheless reduced by lower top line sales, continued tariff-related product cost, continued warehousing-related expenses from our Q4 product returns and other operational disruptions caused by the tariffs.",
    "Major initiatives to improve results are well under way and can be summarized as follows. Firstly, our China exit strategy. Our strategy to avoid tariffs on imports from China, as well as reduce the uncertainty resulting from our country's current trade relationship with China, is to resource production away from China as much as feasible. Prior to the tariffs, approximately 44% of HMI products were manufactured in China. As of August, approximately 29% of our production remains in China and that number will continue to come down.",
    "Our progress resourcing upholstery production for PRI division has made even more dramatic progress than that. Prior to the tariffs, a 100% of PRI production was manufactured in China and as of August that percentage has decreased to less than 36%. We would like to move faster, but additional production capacity in Vietnam and other countries is coming online slowly. Given our long-standing history and deep business relationships in Vietnam, HMI is well positioned to secure new production capacities as they become available.",
    "Our second strategy is -- our PRI turnaround. As mentioned, PRI is making good progress moving production out of China, which is the most critical factor in providing competitive products and in returning PRI to target profitability. In addition, we are implementing select price increases where necessary and eliminating some unprofitable business. The combination of these efforts is delivering results. PRI performance improved from net contribution loss in Q1 to positive contribution in Q2. Further, we are on track to continue increasing the PRI net contribution as we move forward resourcing.",
    "On the growth front, new sales initiatives are in process to grow the PRI top line through our club channel, our mass channel and our traditional mega accounts. A portion of the new growth efforts are in better products, targeted to premium retailers we can effectively sell higher prices which normally carry enhanced profitability. The majority of this new merchandise is part of an exciting new brand launch at the October market, that will create significant incremental growth and profit opportunities.",
    "As made public last week, Home Meridian has signed a contract with Terry Bradshaw to endorse and promote an exclusive line of PRI motion upholstery to the retail trade and the consumer. Given Terry's enormous popularity across all ages and demographics, particularly in the entertainment and sports entertainment markets, we believe he is a perfect fit for the target motion upholstery customer. Already we've had multiple major retailers commit to carry the brand. We expect the Terry Bradshaw branded products to begin shipping in late Q4.",
    "Another initiative is our clubs -- is reorganizing our clubs business. We are restructuring our club business organization to enhance controls, ensure performance and deliver the bottom line results we expect from that channel. Our clubs business will now operate with a dedicated P&L structure and more importantly, will consolidate and report to a single executive leader.",
    "Jay Jordan, who was hired in May to direct our entry into the Mass Channel, will assume responsibility for leading our clubs business. Jay has proven experience in the clubs channel as well as with big-box stores and there's a natural fit for this role. We have already identified and are implementing multiple operational improvements to our clubs business procedures. Furthermore, we are focusing our clubs merchandising efforts on specific proven product opportunities that are established sellers and fit our core competencies.",
    "Other growth strategies. In addition to growth in clubs and branded sales, we have growth strategies in other parts of our business as well. Although our traditional mega accounts have experienced slow retail conditions all year, we have nonetheless succeeded in developing and selling multiple new product placements within the traditional mega account channel that we expect to generate over $50 million in new product sales on an annualized basis. While not all of that business is incremental, it still is a healthy indicator of our strength within that segment.",
    "In addition, we are focusing our fast growing e-commerce business, with year-to-date sales up 16% on the best retailers in the channel. This focus will enable us to grow faster with the biggest players and will result in better business partnerships, faster growth and more profitable sales within the channel.",
    "Last quarter, we announced the launch of a new division to focus on the mass retail channel. This division, named HM Idea, has developed approximately 40 RTA casegood SKUs planned for introduction at the October furniture market. The RTA category is new for HMI and represents significant incremental growth opportunity for our company. Another new product product category we introduced last year, performance, laminate, dining and bedroom collections are at retail stores now and selling very well. We will continue to invest a new products and customers in this product segment.",
    "Finally, mixed product container shipments from a consolidated warehouse in Vietnam is a new service model that we just introduced earlier this year. This service is particularly attractive to the midsize accounts and major retailers who prefer to buy smaller lot sizes of product to be a direct container. This service enables those retailers to enjoy direct container values while managing their inventories more precisely.",
    "Another ongoing initiative is margin improvements. We have multiple margin improvement initiatives in process to improve our bottom line. These initiatives include the aforementioned production resourcing efforts away from China as well as resourcing to lower cost suppliers. In several cases, we are resourcing Vietnam-based production to other lower cost Vietnam factories to improve margins. We are also increasing our sourcing base in Malaysia as that country continues to develop and offer strong values relative to China and Vietnam.",
    "We are also selectively raising prices to counter various recent cost increases, such as higher production costs in Vietnam, freight and trade associated expenses and higher government directed compliance issues.",
    "Finally, we have a comprehensive cost reduction exercise under way to reduce overhead, inventory and spending, commensurate with the challenging business climate. Specifically, we are reducing 8% of our headcount through attrition and a hiring freight. We have already begun reassigning staff to cover responsibilities of current and pending vacant positions. The largest portion of our staff reductions will occur in China as we exit that country in favor of tariff-free production in Vietnam and Malaysia.",
    "Our largest spend on an annual basis is for the inventory to service our business. Our inventories have increased recently, some of which is intentional to service our growing e-commerce business and some as a result of lower sales. We are targeting a 14% reduction of inventory by Q1 of next year, which will allow us to eliminate warehouse space and free up cash. These reductions will come from a new, more accurate forecasting process, the reduction of certain customer-based inventory programs and selling off excess inventory. Additional targeted spending reductions are occurring across all cost centers, including showrooms, photography, printing, travel, operations and product distribution.",
    "Looking forward, we expect significant improvement in our operating results as our remediation actions gain traction. Ending on a positive note, consolidated orders have recently improved as retailers begin to place orders for the fall selling season. As of the end of August, HMI orders were up 6.4% versus the prior year and backlog has increased to within 3% of last year. Both trends reflect continued improvement over Q1 and Q2.",
    "At this time, I'd like to turn the call back over to Paul Huckfeldt, who will elaborate further on our quarterly results.",
    "Paul Huckfeldt -- Vice President, Finance and Chief Financial Officer",
    "Thank you, Doug. Consolidated average selling prices increased 4%, mostly due to favorable product and customer mix. That was not sufficient to offset the unit volume decrease of 13.6%, which resulted from lower order volumes in both of our reporting segments and all other.",
    "Unit volumes were down high single digit to low double digits across our segments. Consolidated gross profit decreased $6.8 million to $28.8 million in the fiscal 2020 second quarter and decreased from 21.1% to 18.9% as a percentage of net sales.",
    "Hooker Branded gross profit decreased both in absolute terms and as a percentage of net sales due to lower Hooker Casegoods sales, to a lesser extent increased product costs, partially offset by increased sales and higher gross margin in our Hooker Upholstery division, which is benefiting from the well-placed product introductions last year and has made good progress mitigating the impact of tariffs.",
    "In the Home Meridian segment, gross profit declined significantly in absolute terms and as a percentage of net sales. Home Meridian's gross margin was negatively impacted by several factors in addition to unrecovered tariff and freight costs and some lower -- and some lower margin sales programs that we've been working to improve. Some of those items included about $900,000 in quality charge backs, excess freight and handling costs of about $950,000 and about $350,000 of higher warehouse costs during the quarter.",
    "Despite a sales decline, gross margin increased in absolute terms and as a percentage of net sales in all other due primarily to lower material costs in our domestic upholstery units as well as increased sales and profitability in H Contract. These gains were partially offset by higher direct labor and overhead costs as a percent of sales attributable to the lower production and order volumes.",
    "Consolidated selling and administrative expenses decreased in absolute terms, but increased as a percentage of sales due to the lower net sales base in the quarter. Selling expenses were lower due to lower sales volume in the quarter. And we also recognized a previously previously deferred gain of about $275,000 related to the sale of a former distribution center, which partially offset the absence of $1 million gain on company-owned life insurance that we recorded last year.",
    "For these reasons, operating income for the fiscal 2020 second quarter decreased $6 million to $5.8 million. Operating income decreased -- operating margin decreased from 7% to 3.8%.",
    "Our cash balance increased nearly $2 million from the fiscal 2019 year-end to $13.3 million. So far this year, we've generated $11 million in cash from our operating activities, much of it from the collection of accounts receivable and $1.4 million in proceeds from the sale of a former distribution facility, which we had owner-finance.",
    "I should also note that we adopted ASC 842 lease accounting at the beginning of the year. This new standard put about $43 million in new assets and a similar liability on our balance sheet and affects some of the comparisons to last year's balance sheet.",
    "At the end of the fiscal 2020 second quarter, we had access to almost $28 million on our revolving line of credit and almost -- about $25 million of cash surrender value of our company-owned life insurance, which gives us some financial flexibility and security.",
    "Now, I'd like to turn the discussion back to Paul Toms, for his closing remarks and an outlook.",
    "Paul Toms -- Chairman & Chief Executive Officer",
    "Thanks, Paul. We remain cautiously optimistic about the second half of the year and still expect that retail business and demand will improve to better levels beginning this fall, traditionally the strongest season of the year for furniture sales. Requests from some large retailers to expedite orders, so they'll have adequate inventory for the fall selling season have been encouraging.",
    "Our tariff mitigation strategies and sourcing shift away from China are well under way and we're reducing cost and non-essential spending, along with delaying some capital expenditures until the environment improves.",
    "We expect the benefits of our tariff mitigation strategies and resourcing efforts will begin to be felt in the third quarter and increasingly thereafter. Even with the uncertain economic environment, we're proactively taking many steps to expand our company, including launching new business units and product line extensions. At the fall market, we will introduce a product licensing program at PRI Division with Terry Bradshaw that Doug mentioned, launch a new HMI division targeting mass merchants and introduce an expanded upholstery offering at Sam Moore.",
    "We remain highly engaged as a management team in strategic planning and continue to benefit from having a diverse portfolio of 11 operating units across many different distribution channels, price points and product categories. We remain confident in our business model, our market position and the strategies we have and believe we will adapt successfully any challenges ahead.",
    "This ends a formal part of our discussions. At this time, I'll turn the call back over to our operator Michael for the questions.",
    "Operator",
    "[Operator Instructions] Our first question comes from Anthony Lebiedzinski of Sidoti. Your line is open.",
    "Anthony Lebiedzinski -- Sidoti & Company -- Analyst",
    "Yes. Good morning. Thank you for taking the question. So first on the Home Meridian. So you mentioned that it was hit harder by the tariff disruptions. I know there was obviously much greater exposure to a large retailers, so just wanted to get a better sense as to what percentage of -- specifically HMI sales come from China as far as for the quarter?",
    "Paul Huckfeldt -- Vice President, Finance and Chief Financial Officer",
    "We broke out for this quarter, the...",
    "Anthony Lebiedzinski -- Sidoti & Company -- Analyst",
    "Or maybe for last year, like just to get a better sense for just HMI, specifically.",
    "Douglas Townsend -- EVP and Chief Executive Officer of SLH",
    "Q3, Q4 was in the 44% range and around -- in this quarter and last couple months in the 29% range from China.",
    "Anthony Lebiedzinski -- Sidoti & Company -- Analyst",
    "Okay. Got it. Okay. And as far as the excess freight costs, do you have any expectation where that will be in the third quarter?",
    "Paul Huckfeldt -- Vice President, Finance and Chief Financial Officer",
    "Looks to be about $600,000, and that's gonna wrap. I think that's gonna wrap that up.",
    "Anthony Lebiedzinski -- Sidoti & Company -- Analyst",
    "Got it. Okay. All right. So obviously you're moving as scheduled as planned for your shift away from China. You said that it was going to be about 22% as far as your exposure by the end of the year. Would you expect that number to decrease further next year? Or would it be kind of more or less kind of stable at that level?",
    "Douglas Townsend -- EVP and Chief Executive Officer of SLH",
    "It will decrease slightly from there. There will always be some products from China. And even with the tariff rates on them, there will still be a better value there than other places. Yeah, it'll keep decreasing, but slowly from there.",
    "Anthony Lebiedzinski -- Sidoti & Company -- Analyst",
    "Got it, OK. Thank you for that. And as far as your overall penetration, as far as exposure to e-commerce retail, which is certainly one of your bright spots. So what percentage of your consolidated sales are tied to e-commerce channel?",
    "Paul Toms -- Chairman & Chief Executive Officer",
    "Anthony, this is Paul Toms. I think that number on a consolidated basis would be about 15% of sales in the channel.",
    "Anthony Lebiedzinski -- Sidoti & Company -- Analyst",
    "Got it. Got it, OK. And you talked about some of some new sales initiatives. Obviously, you mentioned the Terry Bradshaw line as well. So overall, is the number of skews that you will introduce at the full market, is that going to be kind of more or less consistent with other markets? Or would you say that number will be higher as far as new product introductions?",
    "Paul Toms -- Chairman & Chief Executive Officer",
    "I can. Well, maybe it would be better to address that almost by segment. Generally, Hooker Casegoods, import upholstery -- product introductions would be comparable to past markets.",
    "Paul Huckfeldt -- Vice President, Finance and Chief Financial Officer",
    "Very comparable. Pretty similar. Same number of collections, pretty relative number of skews as well.",
    "Paul Toms -- Chairman & Chief Executive Officer",
    "Okay. And Mike, on domestic upholstery, what's your sense?",
    "Michael Delgatti -- President of our Hooker Domestic Upholstery and Emerging Channels",
    "Comparable -- one exception would be Sam Moore, there's less emphasis on shares, more emphasis on sofas and sectionals.",
    "Anthony Lebiedzinski -- Sidoti & Company -- Analyst",
    "Got it. Okay.",
    "Paul Huckfeldt -- Vice President, Finance and Chief Financial Officer",
    "For HMI, Lee?",
    "Lee Boone -- Co-President of Home Meridian",
    "This is Lee Boone from Home Meridian. For Home Meridian the overall skew count deduction [Phonetic] will be about the same. And Terry Bradshaw collection will represent about 75 skews of motion upholstery and entertainment accent items within our total count.",
    "Anthony Lebiedzinski -- Sidoti & Company -- Analyst",
    "Got it. Okay. And as far as the incoming order improvement that you cited, I think, Doug, you had mentioned actually for HMI specifically, the August numbers were up 6.4% versus the prior year. Do you have, Paul, perhaps maybe just numbers for -- on the consolidated basis, would you be able to share that? How that's trending in August versus a year ago?",
    "Paul Toms -- Chairman & Chief Executive Officer",
    "For the quarter, consolidated orders were about flat to last year, which is a big improvement over the first quarter.",
    "Anthony Lebiedzinski -- Sidoti & Company -- Analyst",
    "Okay. But do you have this specifically for -- do you have -- because you called out the HMI numbers, which is certainly encouraging, a 6.4% improvement in August versus a year ago. But I'd be curious if you have those...",
    "Douglas Townsend -- EVP and Chief Executive Officer of SLH",
    "For July specifically -- July specifically was up 20%, a little bit for the total company. A little bit of that, some of that in domestic upholstery is the timing of when orders are received, there's a vacation shut down either in June or July. But yes, they were up 20%, but just for the month of July. So either way, I think that's encouraging.",
    "Anthony Lebiedzinski -- Sidoti & Company -- Analyst",
    "Yes. Okay. All right. Well, thank you very much. And best of luck.",
    "Paul Huckfeldt -- Vice President, Finance and Chief Financial Officer",
    "Thanks, Anthony.",
    "Operator",
    "[Operator Instructions] There are no further questions. I'd like to turn the call back over to Paul Toms for any closing remarks.",
    "Paul Toms -- Chairman & Chief Executive Officer",
    "We really have no further remarks. We appreciate everybody joining us this morning. We've changed the schedule slightly from prior conference calls, where we try to put our conference call closer to the release o f earnings . That was a request we received from several industries and we'll continue to tweak that. We look forward to being back with you in early December and reporting better results than we did this quarter. Thanks for joining us today.",
    "Operator",
    "[Operator Closing Remarks]",
    "Duration: 32 minutes",
    "Paul Huckfeldt -- Vice President, Finance and Chief Financial Officer",
    "Paul Toms -- Chairman & Chief Executive Officer",
    "Douglas Townsend -- EVP and Chief Executive Officer of SLH",
    "Michael Delgatti -- President of our Hooker Domestic Upholstery and Emerging Channels",
    "Lee Boone -- Co-President of Home Meridian",
    "Anthony Lebiedzinski -- Sidoti & Company -- Analyst",
    "More HOFT analysis",
    "All earnings call transcripts",
    "10 stocks we like better than Hooker Furniture\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks  for investors to buy right now... and Hooker Furniture wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "This article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.",
    "Motley Fool Transcribers has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:23:34"
}