{
  "url": "https://www.nasdaq.com/article/futures-slip-as-trade-tensions-weigh-20190903-00476",
  "title": "Futures slip as trade tensions weigh - Nasdaq.com",
  "text": [
    "By Uday Sampath Kumar",
    "Sept 3 (Reuters) - U.S. stock index futures fell on Tuesday, as Washington's new round of tariffs on some Chinese goods kicked in and after a report that officials from both sides were struggling to decide on the schedule for a meeting this month.",
    "Shares of trade-sensitive industrial bellwethers Caterpillar Inc  and Boeing Co  fell 1.5% each in premarket trading, while those of Apple Inc  fell 1%.",
    "The S&P 500 index fell 1.8% in August, its biggest monthly drop since May, after escalating U.S.-China trade tensions and the inversion of a key part of the U.S. yield curve, seen as a recessionary signal, drove investors toward safe-haven assets.",
    "The benchmark index, however, ended the week up nearly 3% as trade tensions were dialed down following signals that Beijing and Washington would meet in September for talks.",
    "Bloomberg, however, reported on Monday that the two sides were yet to agree on a date for the planned meeting.",
    "The Trump administration on Sunday began collecting 15% tariffs on more than $125 billion in Chinese imports, while China began imposing new duties on U.S. crude. ",
    "Chipmakers, which draw a large portion of their revenue from China, also fell, with Intel Corp , Advanced Micro Devices  and Micron Technology Inc  off between 1.4% and 2%.",
    "At 7:27 a.m. ET, Dow e-minis  were down 207 points, or 0.78%. S&P 500 e-minis  were down 21.25 points, or 0.73% and Nasdaq 100 e-minis  were down 63.25 points, or 0.82%.",
    "Along with the manufacturing data, investors will also keep a close watch on the monthly jobs report due Friday for clues on the health of the U.S. economy.",
    "Also on Friday, Federal Reserve Chair Jerome Powell will speak at an event hosted by the Swiss Institute of International Studies, University of Zurich."
  ],
  "published_datetime": "2019-09-03 08:13:00"
}