{
  "url": "https://www.nasdaq.com/article/yen-slips-as-global-tensions-abate-pound-gains-20190905-00835",
  "title": "Yen slips as global tensions abate, pound gains - Nasdaq.com",
  "text": [
    "By Richard Leong",
    "NEW YORK, Sept 5 (Reuters) - The yen fell on Thursday as global tensions including the U.S.-China trade conflict showed signs of thawing, bolstering investor confidence and reducing demand for safe-haven currencies.",
    "The pound rose to its highest level against the dollar in more than a month on hopes that a no-deal Brexit would be avoided.",
    "The most notable development was China and the United States agreeing on Thursday to hold high-level talks in early October in Washington. That stoked hopes the world's biggest economies would move toward a deal to resolve their trade differences. ",
    "Their heated rhetoric and tit-for-tat tariffs have rattled investors and their outlook on the global economy since this summer.",
    "At 12:08 a.m. (1608 GMT), the dollar  was up 0.53% at 106.975 yen after reaching 107.235 yen, which was its highest level since late July. ",
    "Against the euro, the yen  was 0.57% lower at 118.1 after falling to 118.6, marking a three-week low versus the common currency.",
    "The dollar was 0.07% weaker versus a basket of currencies  on lower safe-haven demand, but its losses was limited by some encouraging news on the U.S. labor market.",
    "\"We have relatively robust U.S. employment data that suggest the U.S. is still the consumer of last resort for the world economy,\" Schamotta said.",
    "Payroll processor ADP said U.S. companies hired 195,000 workers in August, which was more than the 158,000 increase that  analysts polled by Reuters had forecast. ",
    "Traders and analysts await the government's monthly payrolls report due at 8:30 a.m. (1230 GMT) on Friday as a confirmation of resilience in the labor market.",
    "Sterling continued its rally after British lawmakers approved legislation on Wednesday to extend the Brexit deadline for the third time and rejected Prime Minister Boris Johnson's motion to hold a snap election. ",
    "The pound  was last trading up 0.63% at $1.233, moving further from a three-year low reached on Tuesday.",
    "Against the euro, sterling  gained 0.54% at 89.54 pence after touching near six-week high of 89.49 pence.",
    "Among other major currencies, the Swedish crown jumped after Riksbank, the country's central bank, said it still expected to tighten monetary policy around the turn of the year, surprising markets and sparking big gains in the long-suffering currency. ",
    "The Swedish crown jumped to a two-week high of 10.6575 against the euro , and also rallied 0.6% against the dollar . ",
    "========================================================",
    "Currency bid prices at 12:09PM (1609 GMT)"
  ],
  "published_datetime": "2019-09-05 12:18:00"
}