{
  "url": "https://www.nasdaq.com/article/note-to-trump-negative-rates-have-delivered-few-positive-results-20190912-00267",
  "title": "Note to Trump: Negative rates have delivered few positive results - Nasdaq.com",
  "text": [
    "By Richard Leong",
    "Sept 12 (Reuters) - U.S. President Donald Trump tweeted with envy on Wednesday about the ultra-low, even negative interest rates in other parts of the world, berating what he called the \"boneheads\" at the Federal Reserve for not following suit. ",
    "But Trump would be well-advised to be careful what he wishes for lest he get it - and all the troublesome economic baggage that comes with it.",
    "As economic policy tools go, negative interest rates have a checkered track record in achieving any of those goals.",
    "In the sluggish economic landscape that has persisted in the wake of the financial crisis a decade ago, five central banks around the world have adopted negative interest rates, including the two largest after the Fed: the European Central Bank and the Bank of Japan.",
    "None have scored lasting wins with the effort.",
    "\"What good has it done there in Europe?\" said Mary Ann Hurley, vice president of fixed income at D.A. Davidson in Seattle. \"They don't help banks. It might help the governments of the issuing countries.\"",
    "Fed officials, looking at the experience of their overseas colleagues, remain highly skeptical. ",
    "The following charts show how the negative rates experiment has played out in the five economies that have tried them.",
    "EUROPE",
    "The ECB introduced negative rates in 2014 in the face of chronic disinflation and low growth. It is expected to cut its benchmark rate deeper into negative territory on Thursday.",
    "So far, it has not provided a lasting boost to either prices or output.",
    "JAPAN",
    "The BOJ embarked on its own journey into negative rates in 2016, with even less to show for the effort than the ECB.",
    "SWEDEN",
    "Sweden's Riksbank turned to sub-zero rates in 2015, and for a while it appeared to be working. Growth picked up and inflation accelerated.",
    "\"If their currencies depreciate, you can get a bigger benefit. Sweden has gone there. It's been more helpful to them,\" said Torsten Slok, chief international economist at Deutsche Bank in New York.",
    "But those benefits now seem to be diminishing, Slok noted.",
    "SWITZERLAND",
    "The Swiss National Bank has pushed rates deeper into negative territory than any other central bank.",
    "The resulting devaluation of the Swiss franc appeared to provide a tailwind for an export-oriented economy. Again, though, the lift has not lasted.",
    "DENMARK",
    "The Danish central bank was early off the mark with negative rates, launching below-zero certificates of deposit in 2012. Growth accelerated for a time but inflation has remained weak nonetheless.",
    "\nGRAPHIC-European, Japanese yields"
  ],
  "published_datetime": "2019-09-12 07:00:00"
}