{
  "url": "https://www.nasdaq.com/article/stocks-to-watch-in-september-cm1206820",
  "title": "Stocks to Watch in September - Nasdaq.com",
  "text": [
    "September is here, and as the weather shifts and leaves fall, investors are trying to shake out what's next for the broader market and individual companies in their portfolios and on their watch lists. Temperatures may be cooling, but concerns about a global economic slowdown and the trade dispute between the U.S. and China have recently been heating up, and stock pickers are looking for signs to determine whether the bull market will continue its run.",
    "With that in mind, let's look at some companies with earnings reports this month that could grab headlines and have broader implications for the market. The table below lists seven of them.",
    "Data source: Yahoo! Finance.",
    "Here's why their stocks are worth keeping an eye on this month.",
    "Image source: Getty Images.",
    "It's been on a roll with its quarterly reports, surpassing the average analys t earnings target in each of its last four quarters and putting up stellar revenue growth and stock performance. The database computing company has been on a tear this year, and its stock has climbed roughly 375% since market close on the day of its initial public offering in October 2017.",
    "Investors will be watching to see if it can keep its strong sales growth streak alive and whether its Atlas database-as-a-service business serves up another quarter of blistering growth. MongoDB is also scheduled to present at the Citi Global Technology Conference on Sept. 6 and the Deutsche Bank Technology Conference on Sept. 10, so it's shaping up to be a big news month for the high-flying tech company.",
    "GameStop has struggled as video game sales have continued to migrate to digital-distribution channels. And the company's efforts to build its business in areas like game development and publishing and mobile-phone stores have fallen short. It suspended its dividend earlier this year because it needs to redirect cash back into the business in order to better position itself for the changing games market.",
    "The upcoming second-quarter report should provide some insight on how same-store sales and cost-reduction initiatives are doing -- as well as some color and guidance related to the performance of video game console hardware, games from leading publishers, and the pop-culture merchandise space that hosts big players like Funko .",
    "The semiconductor market can be a good bellwether for the broader technology sector because chips are core components in consumer-level and enterprise-level devices and infrastructure.",
    "Broadcom's management shed light on how big tech companies are reading and dealing with some macroeconomic headwinds. The company has seen its outlook affected by the U.S.-China trade war. And restrictions placed on dealing with Chinese hardware company Huawei have meant that it appears to have lost (at least temporarily) one of its biggest customers.",
    "Broadcom revealed several weeks ago that it would be acquiring Symantec 's enterprise security business for $10.7 billion, and investors may get extra information on the big deal, which is expected to close before the year is out. Management could offer additional color about its big push into software and its appetite for additional acquisitions.",
    "Big tech stocks have shown some weakness in recent weeks as signs of softening demand among leading industry players have combined with some worrying economic indicators in global market s to shake investor confidence. Oracle stock has retreated from the record high it hit with its las t earnings report , but investors will still be looking for signs of solid momentum for its cloud service offerings. The company's role as a top enterprise software provider means that its upcoming quarterly report and guidance could also provide a view into broader corporate sentiment about macroeconomic conditions.",
    "September could bring some legal news for the company as well. Oracle has appealed the July dismissal of its lawsuit challenging the Pentagon's bidding process for the Joint Enterprise Defense Infrastructure (JEDI) cloud computing contract that is valued at upward of $10 billion. The suit alleges that the government violated procurement laws and that the bidding process unfairly favored Amazon and was unduly influenced by personal relationships.",
    "Oracle's board of directors also gave the go-ahead in August for a billion-dollar shareholder lawsuit against company executives Larry Ellison and Safra Catz, with the suit alleging that the executives breached their fiduciary duties by paying a substantial premium to acquire NetSuite in a $9.3 billion deal that was completed in 2016.",
    "Shareholders will be watching to see if the company's first-quarter report and guidance have the business on track to continue its impressive sales and earnings growth. Its performance and outlook could also provide insight into broader economic sentiment. Because it provides workplace uniforms and cleaning services, demand for its products could be an indicator of whether businesses are still feeling confident about expanding.",
    "The uniform rental company's stock trades in the neighborhood of its record high and has benefited from strong economic growth over the last decade. With concerns about worsening macroeconomic conditions potentially starting to mount, Cintas'  upcoming first-quarter report could provide a better picture of the business' near-term outlook and a marker for gauging enterprise sentiment on a wider scale.",
    "Micron's fourth-quarter release will provide new information for assessing how the DRAM (or dynamic random access memory) and NAND flash-memory markets are shaping up. DRAM and NAND chip prices have been dragged down by inventory glut, but signs that the memory-chip market may have already reached the bottom of its cycle have propelled stock rebounds for industry leaders in 2019.",
    "Micron's results and guidance may provide some outlook on the broader consumer-tech space, enterprise categories like data centers, and what to expect from other memory-chip specialists like Western Digital  and SMART Global Holdings . Micron's earnings report and conference call may also shed some extra light on the business' dealings with Huawei, one of Micron's biggest customers. The memory specialist has stated that it has a legal workaround that will allow it to continue selling some of its products to the Chinese company. It's worth keeping an eye on how that plays out.",
    "It las t report ed earnings in June, raising its full-year guidance and powering the stock to a record high. Investors will want to see if management's bullish outlook has shifted at all with the upcoming third-quarter report and conference call. J.P. Morgan analyst Ken Goldman cut his rating on the spice giant from neutral to underweight in August, creating some recent downward pressure for the stock. Its second-quarter report arrived with comments from management suggesting there would be strong sales performance in the second half of the year, and in the holiday period particularly, so third-quarter revenue and guidance will be under the microscope.",
    "Investors will also get more news about Brexit, which could have an impact on McCormick's business -- as cited in Ken Goldman's note. Whether there will be a \"no deal\" exit that could lead to increased shipping expenses should be clear by the end of September.",
    "McCormick will also be presenting at the Barclays Global Consumer Staples Conference on Sept. 4.",
    "10 stocks we like better than Oracle\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Oracle wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Keith Noonan has no position in any of the stocks mentioned. The Motley Fool owns shares of and recommends MongoDB. The Motley Fool owns shares of GameStop. The Motley Fool recommends Cintas and McCormick. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:45:00"
}