{
  "url": "https://www.nasdaq.com/article/indian-rupee-unlikely-to-gain-traction-as-investors-stay-shy-20190904-01238",
  "title": "Indian rupee unlikely to gain traction as investors stay shy - Nasdaq.com",
  "text": [
    "By Tushar Goenka and Indradip Ghosh",
    "BENGALURU, Sept 5 (Reuters) - The Indian rupee will not regain ground lost against the dollar in the coming year, according to strategists polled by Reuters, who believe a recent rollback of a surcharge on foreign investments will have no impact on the currency.",
    "After gaining about 2% following a sweeping victory in the general election by the incumbent government late in May, the rupee has lost nearly 6% since a July 5 budget when a surcharge on foreign investments was introduced.",
    "Although those higher taxes were withdrawn last month, the move did not alleviate the rupee's weakness and about 60% of respondents did not expect it to have any impact for the remainder of the year.",
    "The rupee fell to 72.40 per dollar on Tuesday, its weakest this year, still suffering from data last week that showed the economy grew at its slowest pace in over six years in the last quarter. ",
    "The Aug 29-Sept 4 Reuters poll of over 50 strategists predicted the currency  will trade around 72 per dollar over the coming year.",
    "While the median forecast showed the rupee will not retest Tuesday's low, the 12-month view was the most pessimistic in Reuters polls since December.",
    "\"Although the measures by the government to rollback the surcharge is a step in the right direction, the damage is already done, as foreign investors continue to withdraw from the Indian equity market,\" said Hugo Erken head of international economics at Rabobank, referring to its impact on the rupee.",
    "\"Given other factors which fuel a further risk-off sentiment - such as...weak GDP print of 5% for fiscal Q1 and further escalation of the China-U.S. trade war - we feel it is difficult to attract investors to make up for the losses in portfolio flows.\"",
    "That weaker rupee view lines up with a separate Reuters positioning poll which showed short bets for the currency rose to the highest since November 2018 on growing concerns about the U.S.-China trade war. ASIA/FXP",
    "Emerging market currencies, including the Indian rupee, have been hit hard by the intensifying trade war. China has allowed the yuan (CNY) to weaken further beyond 7 per dollar to help offset new tariffs imposed by the United States. CNY/POLLEMRG/POLL",
    "\"USDINR continues to watch CNY movements and broader dollar bias, which at this juncture points towards further INR weakness owing to a weak global environment,\" noted Radhika Rao, economist at DBS in Singapore.",
    "Slowing growth concerns pushed central banks across a group of 37 developing economies to deliver a net fourteen interest rate cuts last month - the largest since the financial crisis. ",
    "Of those, the Reserve Bank of India was one of the most aggressive. It has lowered interest rates several times this year and is expected to do so again. RBI/INT",
    "However, over 75% of strategists in response to a separate question said expected RBI rate cuts would have no impact on the rupee or be negative. The remainder said easing would benefit the currency.",
    "\"Even after the 110 (basis points of) cuts, the impact on the rupee was felt more recently when a number of other factors emerged, including the slowdown in both domestic and global demand,\" said Kunal Kundu, India economist at Societe Generale, the most accurate forecaster for Asian currencies in 2018.",
    "\"That is why interest rates as a stand-alone factor will only have a marginal effect on the rupee.\""
  ],
  "published_datetime": "2019-09-04 10:35:00"
}