{
  "url": "https://www.nasdaq.com/article/aveo-surges-on-favorable-updated-os-results-on-rcc-drug-cm1210596",
  "title": "AVEO Surges on Favorable Updated OS Results on RCC Drug - Nasdaq.com",
  "text": [
    "  AVEO Pharmaceuticals, Inc. AVEO  announced updated data from the second prespecified analysis of overall survival (OS) in a late-stage TIVO-3 study on its vascular endothelial growth factor (VEGF) tyrosine kinase inhibitor (TKI) Fotivda (tivozanib). The randomized, open-label phase III study evaluated Fotivda for the treatment of patients with highly refractory metastatic renal cell carcinoma (RCC) compared with Bayer AG's BAYRY  Nexavar (sorafenib). These results include an OS hazard ratio of less than one, favoring Fotivda. The OS hazard ratio assessed the relative risk of death for the entire data set of 350 subjects. Shares of AVEO were up nearly 31% following this news on Tuesday. However, the stock has plunged 42.3% so far this year, underperforming the industry's  decrease of 3.3%.    Notably, Aug 15, 2019 was the data cut-off date for the second prespecified OS analysis, almost a 10-month gap from the data cut-off date for the first prespecified analysis. 16 additional OS events were reported on the Fotivda arm while 28 on the Nexavar arm between the two data cut-off dates. Importantly, in the Fotivda arm, 20 patients remained progression free compared with only two in the Nexavar arm with a median duration on study of 32.5 months. The median OS for Fotivda was 16.4 months while for Nexavar, 19.7 months. AVEO now plans to discuss these updated OS results with the FDA to decide on the path forward for Fotivda during the fourth quarter. Subsequently, the company will decide on the potential new drug application (NDA) filing for Fotivda following the FDA recommendation. We would like to remind investors that in January this year, AVEO faced a major setback when it had to delay the NDA submission on Fotivda for treating highly refractory advanced or metastatic RCC. The company decided not to file an NDA in the United States after the FDA informed that it was not satisfied with the preliminary OS data reported along with the top-line results from the TIVO-3 study announced last November. Previously, the company intended to submit the NDA in the first half of 2019. Notably, in August 2017, AVEO and partner EUSA Pharma received an approval from the European Commission for Fotivda for the first-line treatment of advanced RCC. It is the first approved drug in the company's portfolio. AVEO is focused on launching the medicine across various European countries. Meanwhile, AVEO is evaluating Fotivda in combination with Bristol-Myers' BMY  Opdivo (an immune checkpoint PD-1 inhibitor) in a phase II study for the treatment of advanced RCC. The company is also investigating the drug in a phase I/II study coupled with AstraZeneca's AZN  Imfinzi for the first-line treatment of advanced unresectable hepatocellular carcinoma, a form of liver cancer.  Zacks Rank  AVEO currently carries a Zacks Rank #3 (Hold). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.  makeArticleAd();  Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   AstraZeneca PLC (AZN): Free Stock Analysis Report   Bristol-Myers Squibb Company (BMY): Free Stock Analysis Report   Bayer Aktiengesellschaft (BAYRY): Free Stock Analysis Report   AVEO Pharmaceuticals, Inc. (AVEO): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " AVEO Pharmaceuticals, Inc. AVEO  announced updated data from the second prespecified analysis of overall survival (OS) in a late-stage TIVO-3 study on its vascular endothelial growth factor (VEGF) tyrosine kinase inhibitor (TKI) Fotivda (tivozanib). The randomized, open-label phase III study evaluated Fotivda for the treatment of patients with highly refractory metastatic renal cell carcinoma (RCC) compared with Bayer AG's BAYRY  Nexavar (sorafenib).",
    "These results include an OS hazard ratio of less than one, favoring Fotivda. The OS hazard ratio assessed the relative risk of death for the entire data set of 350 subjects.",
    "Shares of AVEO were up nearly 31% following this news on Tuesday. However, the stock has plunged 42.3% so far this year, underperforming the industry's  decrease of 3.3%.",
    "Notably, Aug 15, 2019 was the data cut-off date for the second prespecified OS analysis, almost a 10-month gap from the data cut-off date for the first prespecified analysis. 16 additional OS events were reported on the Fotivda arm while 28 on the Nexavar arm between the two data cut-off dates.",
    "Importantly, in the Fotivda arm, 20 patients remained progression free compared with only two in the Nexavar arm with a median duration on study of 32.5 months. The median OS for Fotivda was 16.4 months while for Nexavar, 19.7 months.",
    "AVEO now plans to discuss these updated OS results with the FDA to decide on the path forward for Fotivda during the fourth quarter. Subsequently, the company will decide on the potential new drug application (NDA) filing for Fotivda following the FDA recommendation.",
    "We would like to remind investors that in January this year, AVEO faced a major setback when it had to delay the NDA submission on Fotivda for treating highly refractory advanced or metastatic RCC. The company decided not to file an NDA in the United States after the FDA informed that it was not satisfied with the preliminary OS data reported along with the top-line results from the TIVO-3 study announced last November. Previously, the company intended to submit the NDA in the first half of 2019.",
    "Notably, in August 2017, AVEO and partner EUSA Pharma received an approval from the European Commission for Fotivda for the first-line treatment of advanced RCC. It is the first approved drug in the company's portfolio. AVEO is focused on launching the medicine across various European countries.",
    "Meanwhile, AVEO is evaluating Fotivda in combination with Bristol-Myers' BMY  Opdivo (an immune checkpoint PD-1 inhibitor) in a phase II study for the treatment of advanced RCC. The company is also investigating the drug in a phase I/II study coupled with AstraZeneca's AZN  Imfinzi for the first-line treatment of advanced unresectable hepatocellular carcinoma, a form of liver cancer.",
    " Zacks Rank ",
    "AVEO currently carries a Zacks Rank #3 (Hold). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.  makeArticleAd();  Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:40:00"
}