{
  "url": "https://www.nasdaq.com/article/stocks-rise-sharply-as-us-and-china-agree-to-october-talks-cm1208202",
  "title": "Stocks Rise Sharply As U.S. and China Agree to October Talks - Nasdaq.com",
  "text": [
    "Market Movers:",
    "Mike's Commentary",
    "Well we are saved. Broad indices moved higher on the mere suggestion that US and Chinese representatives will meet in Washington D.C. in early October to discuss trade issues.  Despite the immense difficulty in getting an agreement across the line any time soon the sign of progress was enough to rally stocks, which have seen mostly negative developments with regards to China trade lately.",
    "Stocks are up over 400 Dow points as we write, adding to the 237 point gain yesterday and therefore erasing the 285 point drop that greeted us Tuesday to start the month. Brian also wrote about technical factors yesterday and the S&P moving above the key 2,944 level likely has program buyers joining the party (See Technical Take below for more).",
    "Bigger picture, this seems like a market that wants to go up. Even with manufacturing PMIs in Europe (and now the U.S.) in contraction, trade concerns and flat/declining earnings in the first half and projected for Q3, we are only 1.5% away from the S&P's all time high reached at the end of July. My view is that easy money globally is supporting stocks and none of the aforementioned news has been 'bad enough' to change the fact that the ECB and Fed are very likely to cut rates further.",
    "The market has in the past shown it can move higher even with fla t earnings and slow-growing GDP.  Low rates also translate to good things for companies in the real world. Apple, Disney and Deere are among large companies tapping debt markets for financing - all three issued 30 year debt with yields below 3%, a first for the corporate debt market. Twenty-one investment grade companies issued over $27 billion in debt on Tuesday according to a Bloomberg story, which quoted  B of A's head of investment grade capital markets as saying that's the equivalent of a busy week of activity in one day.  Put another way, in the second quarter, 62 IPO's raised $25 billion according to Renaissance Capital, so the action yesterday eclipsed the entire sum raised by all Q2 IPOs. More corporate debt is sure to follow. And 100-year Treasuries are also being discussed.",
    "Today the economic news was pretty good too. ADP's employment chan ge report showed a gain of 195,000 jobs - the most in four months - vs. 148,00 expected.  ADP's report is based on private payrolls and often seen as a preview to the survey-based government employmen t report expected tomorrow. That report is projected to show the economy added 160,000 jobs vs. 164,000 the prior month and a steady 3.7% unemployment rate. Nonfarm Payrolls yesterday were referred to by a CNBC guest as a \"random number generator\", which is in reference to the prints since January of 312, 56, 153, 216, 62, 193 and 164 thousand jobs. So tomorrow could beat or miss by a lot.",
    "Initial Jobless claims were 217,000 vs. 215,000 expected so no real news there as the labor market remains strong. Nonfarm productivity rose 2.3% vs. 2.2% expected, Durable goods orders rise 2.0% vs. 2.1% estimated and Factory orders rose 0.8% to 1.4%, beating the 1.0% consensus. Finally, the ISM Non-Manufacturing Index beat the 54 survey expectation and reclaimed 56 territory with a 56.4 print vs. 53.7 last month, in sharp contrast to Monday's ISM Manufacturing PMI of 49.1 that soured the mood.",
    "So today, we are saved it seems. Risky stocks are once again in favor, with Financials, Tech, Industrials and crude oil seeing sizable upward moves over the past two days. Meanwhile over the same time frame Treasuries, Consumer Staples, Real Estate and Utilities have moved lower. It feels nice to have some solid gains, but given August's action we know we are one tweet away from another turn. Stay tuned!",
    "Sector Recap",
    "Click the image for larger view",
    "Brian's Technical Take",
    "Markets are zipping higher today after China and the U.S. announced they will hold trade talks in Washington sometime in October. Color me skeptical for not believing this will result in a trade war resolution, however I am much more optimistic regarding today's price action in stocks.",
    "So far today the SPX is up more than 1.5% with its opening gap breakout and run above the 50-day sma and 2,944 resistance level in place over the last four weeks (see yesterday's MIDDAY Update). Despite all the turmoil since the lat FOMC on July 31st, the flagship US large cap index is within 1.5% of making new all-time highs. Across the pond in Germany, which has some of the worst manufacturing PMI data, the DAX Index is +0.9% and today has moved above its 50-d and 100-d moving averages. Good in the near term however the DAX remains nearly 12% below its January 2018 highs and is fast approaching a key test of resistance at the 12,129 - 12,200 range.",
    "The semiconductor industry is leading all groups today with a +4.2% gain for the SOX Index and a YTD gain of 37%. Next is oil services with the OIH ETF +4%. Unlike the SOX Index which has been the hallmark of the bull market over the last three years, the move today in the OIH is better characterized, for now, as a dead cat bounce which still has room to run.",
    "The OIH made a closing low in early August at $10.89 and later in the month successfully tested and held those lows. Today's gains have broken out of the midpoint of what looks like a relatively small double bottom pattern. The next key price level is +8% at $13.10 representing the prior lows from December and May/June, and now the declining 50-day sma, $13.11. This is where the big test will be for determining whether or not the OIH is ready for a more prolonged rally from what has been a severe crash. On the longer term time frame it is worth noting the sizeable bullish divergence between momentum and price made during the August lows. For now however let's see if the OIH can get to $13.10.",
    "Click the image for larger view",
    "Nasdaq's Market Intelligence Desk (MID) Team includes:",
    "Charles Brown is Associate Vice President on The Market Intelligence Desk with over 20 years of equity capital markets experience. Charlie has extensive knowledge of equity trading on both floor and screen based marketplaces. Charlie assists with the management of The Market Intelligence Desk and works with Nasdaq listed companies providing them with insightful objective trading analysis.",
    "Steven Brown is a Managing Director on the Market Intelligence Desk (MID) at Nasdaq with over twenty years of experience in equities. With a focus on client retention he currently covers the Financial, Energy and Media sectors.",
    "Christopher Dearborn is a Managing Director on the Market Intelligence Desk (MID) at Nasdaq. Chris has over two decades of equity market experience including floor and screen based trading, corporate access, IPOs and asset allocation. Chris is responsible for providing timely, accurate and objective market and trading-related information to Nasdaq-listed companies.",
    "Brian Joyce, CMT is a Managing Director on the Market Intelligence Desk (MID) at Nasdaq. Before joining Nasdaq Brian spent 16 years as an institutional trader executing equity and options orders for both the buy side and sell side. He also provided trading ideas and wrote technical analysis commentary for an institutional research offering. Brian focuses on helping Nasdaq's Financial, Healthcare and Transportation companies, among others, understand the trading in their stock. Brian is a Chartered Market Technician (CMT).",
    "Michael Sokoll, CFA is Associate Vice President on the Market Intelligence Desk (MID) at Nasdaq with over 25 years of equity market experience. In this role, he manages a team of professionals responsible for providing NASDAQ-listed companies with real-time trading analysis and objective market information.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 01:20:34"
}