{
  "url": "https://www.nasdaq.com/article/gold-surges-to-6-year-high-on-contraction-in-us-manufacturing-cm1207278",
  "title": "Gold Surges to 6-Year High on Contraction in US Manufacturing - Nasdaq.com",
  "text": [
    " Gold prices surged to a six-year high as manufacturing activity decelerated in August for the first time in three years, renewing fears of an economic slowdown. Gold prices were at $1,546.08 an ounce on Sep 3, gaining 1.1% in a day. The yellow metal has gained 21% so far this year on the back of a dovish fed, safe haven demand triggered by ongoing trade war between United States and China, and concerns over the global economic outlook.  makeArticleAd();  Per the Institute for Supply Management's lates t report  , Purchasing Managers' Index (PMI) for August declined to 49.1% from 51.2% in July. Notably, new orders, production and hiring have declined sharply. Even though the manufacturing sector has been decelerating for the past four months - this was the first instance where the reading has gone below 50. This marks the end of 35 straight months of growth for the manufacturing sector.    This raises anticipation of further rate cuts by the Fed, which will eventually work in gold's favor. Lower the interest rates, the lesser will be the opportunity cost of holding non-yielding bullion, making gold attractive for investors holding other currencies. Further, volatile stock markets, uncertainty on the Brexit front, and protests in Hong Kong will fuel  gold prices  . Moreover, with the U.S.-China trade war showing no signs of abatement, investors remain jittery, which in turn will work in favor of gold.    The prospects of a dwindling supply looms large on the gold-mining industry while demand remains strong with India and China acting as the major drivers. Further, the last few months of the year are seasonally stronger in India due to wedding and festive seasons. The combination of lower mined gold supply and higher demand, and geopolitical tensions could eventually drive prices north, which bodes well for gold-miners.   Gold Industry Performance         The Gold Mining  industry has rallied 51.6% so far this year compared with the S&P 500's growth of 15.3%. Going by the forward 12 months EV/EBITDA multiple (a preferred valuation metric for mining companies that have high capital expenditures), the gold mining industry has a multiple of 8.0, much lower than the S&P 500's multiple of 11.6.    The group's Zacks Industry Rank  , which is basically the average of the Zacks Rank of all the member stocks, indicates bright prospects in the near term. The Zacks Mining- Gold Industry, which is a 33-stock group within the broader Zacks Basic Materials  Sector, currently carries a Zacks Industry Rank #9, which places it at the top 4% of 256 Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperforms the bottom 50% by a factor of more than 2 to 1. We suggest five gold-mining stocks carrying a Zacks Rank of #1 (Strong Buy) or 2 (Buy) that investors can take a look at. You can see  the complete list of today's Zacks #1 Rank stocks   here   .  Kirkland Lake Gold Ltd. KL  : This Toronto, Canada-based company carries a Zacks Rank #1. The company has expected earnings growth of 69.85% for the current year and 13.85% for the next. The Zacks Consensus Estimate for the current year and for fiscal 2020 has moved up 12% and 14%, respectively, over the last 90 days. The company has an average positive earnings surprise of 6.07% over the trailing four quarters. The stock has surged 91% so far this year.  Franco-Nevada Corporation FNV  : The Zacks Consensus Estimate for earnings for this Toronto, Canada-based company indicates year-over-year improvement of 34.19%. Further, the estimate has moved improved 20% over the past 90 days. The company has an average positive earnings surprise history of 9.63% over the trailing four quarters. The company has a long-term estimated earnings growth rate of 4%. Shares of this Zacks Ranked #1 stock has gone up 40.8% year to date.  Agnico Eagle Mines Limited AEM  : This Toronto, Canada-based company carries a Zacks Rank #2. The Zacks Consensus Estimate for earnings per share for fiscal 2019 suggests year-over-year growth of 157.14%. The estimate moved up 57% over the past 90 days. The company has a long-term estimated earnings growth rate of 1%. The company has an average positive earnings surprise history of 266.67%. Shares of this company have surged 56.6% year to date.   Barrick Gold Corporation GOLD  : This Toronto, Canada-based company carries a Zacks Rank #2. The Zacks Consensus Estimate for earnings for fiscal 2019 suggests year-over-year growth of 54.29%. The estimate has gone up 38% over the past 90 days. The company has an average positive earnings surprise of 8.33% over the trailing four quarters. The company has a long-term estimated earnings growth rate of 2.00%. Year to date, the company's shares have appreciated 43.4%.   B2Gold Corp. BTG  : This Vancouver, Canada-based company carries a Zacks Rank #2. The company has expected earnings growth of 25% for the current year. The Zacks Consensus Estimate for the current year has improved 25% over the last 90 days. The company has an average positive earnings surprise of 4.17% over the trailing four quarters. The stock has surged 22.6% so far this year.   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Barrick Gold Corporation (GOLD): Free Stock Analysis Report   Franco-Nevada Corporation (FNV): Free Stock Analysis Report   B2Gold Corp (BTG): Free Stock Analysis Report   Agnico Eagle Mines Limited (AEM): Free Stock Analysis Report   Kirkland Lake Gold Ltd. (KL): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Gold prices surged to a six-year high as manufacturing activity decelerated in August for the first time in three years, renewing fears of an economic slowdown. Gold prices were at $1,546.08 an ounce on Sep 3, gaining 1.1% in a day. The yellow metal has gained 21% so far this year on the back of a dovish fed, safe haven demand triggered by ongoing trade war between United States and China, and concerns over the global economic outlook.  makeArticleAd();  Per the Institute for Supply Management's lates t report  , Purchasing Managers' Index (PMI) for August declined to 49.1% from 51.2% in July. Notably, new orders, production and hiring have declined sharply. Even though the manufacturing sector has been decelerating for the past four months - this was the first instance where the reading has gone below 50. This marks the end of 35 straight months of growth for the manufacturing sector.    This raises anticipation of further rate cuts by the Fed, which will eventually work in gold's favor. Lower the interest rates, the lesser will be the opportunity cost of holding non-yielding bullion, making gold attractive for investors holding other currencies. Further, volatile stock markets, uncertainty on the Brexit front, and protests in Hong Kong will fuel  gold prices  . Moreover, with the U.S.-China trade war showing no signs of abatement, investors remain jittery, which in turn will work in favor of gold.    The prospects of a dwindling supply looms large on the gold-mining industry while demand remains strong with India and China acting as the major drivers. Further, the last few months of the year are seasonally stronger in India due to wedding and festive seasons. The combination of lower mined gold supply and higher demand, and geopolitical tensions could eventually drive prices north, which bodes well for gold-miners.   Gold Industry Performance  ",
    "   The Gold Mining  industry has rallied 51.6% so far this year compared with the S&P 500's growth of 15.3%. Going by the forward 12 months EV/EBITDA multiple (a preferred valuation metric for mining companies that have high capital expenditures), the gold mining industry has a multiple of 8.0, much lower than the S&P 500's multiple of 11.6.",
    "The group's Zacks Industry Rank  , which is basically the average of the Zacks Rank of all the member stocks, indicates bright prospects in the near term. The Zacks Mining- Gold Industry, which is a 33-stock group within the broader Zacks Basic Materials  Sector, currently carries a Zacks Industry Rank #9, which places it at the top 4% of 256 Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperforms the bottom 50% by a factor of more than 2 to 1.",
    "We suggest five gold-mining stocks carrying a Zacks Rank of #1 (Strong Buy) or 2 (Buy) that investors can take a look at. You can see  the complete list of today's Zacks #1 Rank stocks   here   .",
    " Kirkland Lake Gold Ltd. KL  : This Toronto, Canada-based company carries a Zacks Rank #1. The company has expected earnings growth of 69.85% for the current year and 13.85% for the next. The Zacks Consensus Estimate for the current year and for fiscal 2020 has moved up 12% and 14%, respectively, over the last 90 days. The company has an average positive earnings surprise of 6.07% over the trailing four quarters. The stock has surged 91% so far this year.",
    " Franco-Nevada Corporation FNV  : The Zacks Consensus Estimate for earnings for this Toronto, Canada-based company indicates year-over-year improvement of 34.19%. Further, the estimate has moved improved 20% over the past 90 days. The company has an average positive earnings surprise history of 9.63% over the trailing four quarters. The company has a long-term estimated earnings growth rate of 4%. Shares of this Zacks Ranked #1 stock has gone up 40.8% year to date.",
    " Agnico Eagle Mines Limited AEM  : This Toronto, Canada-based company carries a Zacks Rank #2. The Zacks Consensus Estimate for earnings per share for fiscal 2019 suggests year-over-year growth of 157.14%. The estimate moved up 57% over the past 90 days. The company has a long-term estimated earnings growth rate of 1%. The company has an average positive earnings surprise history of 266.67%. Shares of this company have surged 56.6% year to date.   Barrick Gold Corporation GOLD  : This Toronto, Canada-based company carries a Zacks Rank #2. The Zacks Consensus Estimate for earnings for fiscal 2019 suggests year-over-year growth of 54.29%. The estimate has gone up 38% over the past 90 days. The company has an average positive earnings surprise of 8.33% over the trailing four quarters. The company has a long-term estimated earnings growth rate of 2.00%. Year to date, the company's shares have appreciated 43.4%.   B2Gold Corp. BTG  : This Vancouver, Canada-based company carries a Zacks Rank #2. The company has expected earnings growth of 25% for the current year. The Zacks Consensus Estimate for the current year has improved 25% over the last 90 days. The company has an average positive earnings surprise of 4.17% over the trailing four quarters. The stock has surged 22.6% so far this year.   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:24:00"
}