{
  "url": "https://www.nasdaq.com/article/why-companhia-siderurgica-sid-is-such-a-great-value-stock-pick-right-now-cm1210560",
  "title": "Why Companhia Siderurgica (SID) is Such a Great Value Stock Pick Right Now - Nasdaq.com",
  "text": [
    " Value investing is always a very popular strategy, and for good reason. After all, who doesn't want to find stocks that have low PEs, solid outlooks, and decen t dividends  ?  makeArticleAd();  Fortunately for investors looking for this combination, we have identified a strong candidate which may be an impressive value; Companhia Siderúrgica Nacional SID  .   Companhia Siderurgica in Focus    SID may be an interesting play thanks to its forward PE of 5.1, its P/S ratio of 0.7, and its decen t dividend yield  of 4.6%. These factors suggest that Companhia Siderurgica is a pretty good value pick, as investors have to pay a relatively low level for each dollar o f earnings  , and that SID has decent revenue metrics to back up its earnings.   Companhia Siderurgica PS Ratio (TTM)         Companhia Siderurgica  ps-ratio-ttm    |   Companhia Siderurgica Quote   But before you think that Companhia Siderurgica is just a pure value play, it is important to note that it has been seeing solid activity on the earnings estimate front as well. For current year earnings, the consensus has gone up significantly in the past 30 days, thanks to two upward revisions in the past one month compared to none lower.    This estimate strength is actually enough to push SID to a Zacks Rank #2 (Buy), suggesting it is poised to outperform. You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here.     So really, Companhia Siderurgica is looking great from a number of angles thanks to its PE below 20, a P/S ratio below one, and a strong Zacks Rank, meaning that this company could be a great choice for value investors at this time.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   National Steel Company (SID): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Value investing is always a very popular strategy, and for good reason. After all, who doesn't want to find stocks that have low PEs, solid outlooks, and decen t dividends  ?  makeArticleAd();  Fortunately for investors looking for this combination, we have identified a strong candidate which may be an impressive value; Companhia Siderúrgica Nacional SID  .   Companhia Siderurgica in Focus    SID may be an interesting play thanks to its forward PE of 5.1, its P/S ratio of 0.7, and its decen t dividend yield  of 4.6%. These factors suggest that Companhia Siderurgica is a pretty good value pick, as investors have to pay a relatively low level for each dollar o f earnings  , and that SID has decent revenue metrics to back up its earnings. ",
    " Companhia Siderurgica PS Ratio (TTM) ",
    "       Companhia Siderurgica  ps-ratio-ttm    |   Companhia Siderurgica Quote  ",
    " Companhia Siderurgica  ps-ratio-ttm    |   Companhia Siderurgica Quote ",
    "But before you think that Companhia Siderurgica is just a pure value play, it is important to note that it has been seeing solid activity on the earnings estimate front as well. For current year earnings, the consensus has gone up significantly in the past 30 days, thanks to two upward revisions in the past one month compared to none lower.    This estimate strength is actually enough to push SID to a Zacks Rank #2 (Buy), suggesting it is poised to outperform. You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here.     So really, Companhia Siderurgica is looking great from a number of angles thanks to its PE below 20, a P/S ratio below one, and a strong Zacks Rank, meaning that this company could be a great choice for value investors at this time.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:33:00"
}