{
  "url": "https://www.nasdaq.com/article/accenture-acn-outpaces-stock-market-gains-what-you-should-know-cm1210778",
  "title": "Accenture (ACN) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Accenture (ACN) closed at $191.37 in the latest trading session, marking a +0.9% move from the prior day. This change outpaced the S&P 500's 0.72% gain on the day. Elsewhere, the Dow gained 0.85%, while the tech-heavy Nasdaq added 1.06%. Prior to today's trading, shares of the consulting company had lost 1.67% over the past month. This has lagged the Business Services sector's loss of 1.19% and the S&P 500's gain of 2.25% in that time. Wall Street will be looking for positivity from ACN as it approaches its nex t earnings  report date. This is expected to be September 26, 2019. In tha t report  , analysts expect ACN to post earnings of $1.71 per share. This would mark year-over-year growth of 8.23%. Our most recent consensus estimate is calling for quarterly revenue of $11.08 billion, up 9.17% from the year-ago period. It is also important to note the recent changes to analyst estimates for ACN. These revisions help to show the ever-changing nature of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 0.27% lower. ACN is currently sporting a Zacks Rank of #3 (Hold). In terms of valuation, ACN is currently trading at a Forward P/E ratio of 23.86. For comparison, its industry has an average Forward P/E of 19, which means ACN is trading at a premium to the group. It is also worth noting that ACN currently has a PEG ratio of 2.31. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Consulting Services was holding an average PEG ratio of 1.62 at yesterday's closing price. The Consulting Services industry is part of the Business Services sector. This industry currently has a Zacks Industry Rank of 65, which puts it in the top 26% of all 250+ industries. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Accenture PLC (ACN): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Accenture (ACN) closed at $191.37 in the latest trading session, marking a +0.9% move from the prior day. This change outpaced the S&P 500's 0.72% gain on the day. Elsewhere, the Dow gained 0.85%, while the tech-heavy Nasdaq added 1.06%.",
    "Prior to today's trading, shares of the consulting company had lost 1.67% over the past month. This has lagged the Business Services sector's loss of 1.19% and the S&P 500's gain of 2.25% in that time.",
    "Wall Street will be looking for positivity from ACN as it approaches its nex t earnings  report date. This is expected to be September 26, 2019. In tha t report  , analysts expect ACN to post earnings of $1.71 per share. This would mark year-over-year growth of 8.23%. Our most recent consensus estimate is calling for quarterly revenue of $11.08 billion, up 9.17% from the year-ago period.",
    "It is also important to note the recent changes to analyst estimates for ACN. These revisions help to show the ever-changing nature of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 0.27% lower. ACN is currently sporting a Zacks Rank of #3 (Hold).",
    "In terms of valuation, ACN is currently trading at a Forward P/E ratio of 23.86. For comparison, its industry has an average Forward P/E of 19, which means ACN is trading at a premium to the group.",
    "It is also worth noting that ACN currently has a PEG ratio of 2.31. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Consulting Services was holding an average PEG ratio of 1.62 at yesterday's closing price.",
    "The Consulting Services industry is part of the Business Services sector. This industry currently has a Zacks Industry Rank of 65, which puts it in the top 26% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:50:13"
}