{
  "url": "https://www.nasdaq.com/article/you-wont-find-better-value-than-hexo-stock-in-the-canna-business-cm1210633",
  "title": "You Won’t Find Better Value Than Hexo Stock in the Canna-business - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "The summer of 2019 was a period of malaise for the cannabis sector, and unfortunately that meant a selloff in Hexo (NYSE: HEXO ) stock, whether it deserved the downward price pressure or not. As I see it, adverse developments from well-known names like Canopy Growth (NYSE: CGC ), and Aurora Cannabis (NYSE: ACB ) induced a panic that spilled over into the rest of the cannabis sector.",
    "Since many outlets predict Sept. 12 earnings, it might be a smart idea to wait and see which way the Hexo stock price goes before taking a position. It's also fine to start a position if you believe in the recovery of cannabis stocks.",
    "Hexo in particular has great potential as a turnaround story.",
    "I recall when Hexo reported its third-quarter 2019 earnings, and it's no exaggeration to say that the results were outstanding. For one thing, Hexo completed its acquisition of  Newstrike Brands during that quarter and in doing so, increased its production space to an astonishing 1.8 million square feet and its estimated annual cannabis production capacity to 150,000 kilograms.",
    "Sebastien St.-Louis, the CEO and co-founder of Hexo, also delighted shareholders with the projection that the company will earn $400 million in revenues during fiscal year 2020. He also forecasted that Hexo will double its net revenues in the fiscal Q4.",
    "I've heard analysts refer to 2019's market as \"Cannabis 2.0\" or \"Legalization 2.0,\" and Hexo is a prime example of what they're referring to. The company is not only bigger and better than it was before. It's also proactively preparing for the future. Hexo's agreement with Molson Coors (NYSE: TAP ) to sell cannabis-enhanced beverages is a perfect example of how the industry is moving forward.",
    "An upcoming earnings announcement means that analysts are coming out of the woodwork to share their opinions on HEXO stock. For the fourth quarter of 2019, analysts project that Hexo will announce revenues of $25.5 million CAD. They expect the company to sustain a loss of 5 cents per share for the Canadian version of Hexo stock.",
    "These are very modest expectations influenced by the dismal performance of the cannabis sector as a whole. I don't see any reason why the actual results won't exceed analyst expectations. And I wouldn't be surprised if the Hexo stock price retraces upwards.",
    "Don't get me wrong. Hexo is a much smaller company than CGC, ACB and other famous brands in the legalized cannabis space. I do not recommend taking a large position in HEXO stock shares, even after the upcoming earnings announcement. There are future developments that could create volatility for the entire cannabis market.",
    "The event that immediately comes to mind is the day when Health Canada will allow an array of cannabis products (edibles, extracts, creams, etc.) to be consumed. That day is slated for Dec. 16, but I won't be shocked if the legalization date gets delayed for one reason or another.",
    "Therefore, I will advise that prospective HEXO buyers exercise due caution. Accumulate shares gradually, prepare for possible downside in the price, respect your stop-losses if you use them and always keep your position sizes reasonable.",
    "Despite my warnings, I remain bullish on the Hexo stock price as I see the company as proactive. It's expanding quickly and preparing for a new and exciting era in legalized cannabis.",
    "As of this writing, David Moadel did not hold a position in any of the aforementioned securities.",
    "The post You Won't Find Better Value Than Hexo Stock in the Canna-business appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:16:24"
}