{
  "url": "https://www.nasdaq.com/article/why-this-activist-investor-thinks-att-stock-could-hit-60-in-2-years-cm1210680",
  "title": "Why This Activist Investor Thinks AT&T Stock Could Hit $60 in 2 Years - Nasdaq.com",
  "text": [
    " Activist investors buy large stakes in underperforming yet   undervalued companies, then advocate for change. So when one   takes on a large, well-known company such as   AT&T    (NYSE: T) , it's certainly news. On Monday, activist hedge fund   Elliot Management, run by founder and co-CEO Paul Singer,   disclosed a $3.2 billion stake in AT&T and put forward a   comprehensive plan for change. The hedge fund operators think that the telecom giant, which   traded for just over $36 per share to start the week, could reach   a whopping $60 per share by 2021 ... if the company follows   Elliot's plan, of course. So what is this plan, exactly?makeArticleAd();   AT&T has itself an activist investor. Image source:     Getty Images.  Wouldn't have, shouldn't have Much of Elliot Management's thesis consists of blaming   AT&T's management for past blunders. Mainly, Elliot   criticizes the telecom's massive acquisition spree over the past   decade. These include AT&T's failed acquisition of T-Mobile   (while having to pay T-Mobile a substantial breakup fee,   kick-starting the competitor's rise in the process), the   2014-2015 acquisition of DirecTV, the 2016-2018 acquisition of   Time Warner, as well as the company's foray into the Mexican and   Latin American telecom market. These are just the largest of   AT&T's acquisitions -- Elliot didn't even mention smaller   buys such as AppNexus and others. Elliot also believes AT&T is operationally inefficient, as   the aforementioned acquisitions have distracted management from   its core operations, causing the company to fall behind peers   such as   Verizon    . Elliot contends that AT&T lost focus, ceding the premium   network leadership to the more focused Verizon, while also ceding   the lower end of the market to disruptive innovator   T-Mobile    . Of note, Elliot mentions that AT&T's service earnings   before interest, taxes, depreciation, and amortization (   EBITDA    ) margins are a huge 1,500 basis points lower than Verizon's --   that's 15 percentage points! Meanwhile, Elliot goes on to criticize AT&T's total lack   of a strategy in the media space, a new business for AT&T's   leadership. Elliot cites dwindling pay-TV subscribers, the   lackluster launch of AT&T's   DirecTV Now    over-the-top service, as well as the company's   ever-changing plan    for integrating and delivering all of Time Warner's assets. With all of these missteps, one wonders what Elliot might see   in the lumbering telecom. The answer:   5G services    . A chance to reset the industry Elliot's main bull case for AT&T is its potential to leap   ahead of Verizon and reclaim wireless leadership for the 5G   wireless standard, as Verizon did with 4G. 5G will enable   lightning-fast communications and ultra-low latency, and   therefore, a new wave of futuristic applications. Currently, the   5G buildout is in the very early stages, and herein lies the   opportunity. As I wrote in July -- and which Elliot mentioned in its thesis   -- AT&T has the advantage of building out   FirstNet    , a nationwide network for first responders. Winning this   contract in 2017 also gave AT&T valuable spectrum, as well as   some subsidies for the buildout -- which means that the company   will have an advantageous head start in the costly and   time-consuming construction of its 5G network. Elliot calls the   5G opportunity one that AT&T \"cannot afford to miss.\" He   elaborates further:  We believe AT&T will be able to quickly move forward     while its main competitors remain either spectrum-disadvantaged     or distracted as they integrate major transactions. However,     while AT&T is well positioned, success in 5G will require     meaningful investment and improved execution; anything less and     AT&T risks missing this opportunity and falling behind     again.  Elliot is likely referring to the   Sprint     and T-Mobile merger in the quote above, leaving just   Verizon for AT&T to surpass. Elliot's argument seems a bit obvious For the most part, Elliot's arguments are spot-on. AT&T   has seemed to stretch itself too far away from its core wireless   operations, and its new media strategy doesn't seem particularly   well-thought-out. In addition, leaping ahead of competitors in   the race to 5G is certainly of utmost importance. However, it appears that management is already aware of this   and already investing heavily in 5G. And while one can never be   sure, it doesn't seem like AT&T is going to do any more   acquisitions in the near future. In addition, AT&T has, in   fact, been generating some synergies from recent acquisitions and   expanded its adjusted operating margins by 90 basis points last   quarter. So it doesn't seem like Elliot is proposing much of   anything that AT&T isn't already doing. While Elliot did call for AT&T to divest some of its   assets -- specifically, its Latin American operations and small   home-security business -- the hedge fund stopped short of calling   for a divestiture of the large media assets, though it did   advocate that \"numerous major portfolio actions\" should be   \"thoroughly explored.\" But if Elliot isn't proposing that   AT&T sell off its Time Warner and DirecTV assets, they'll   still be part of the company and thus still represent the same   distraction that they've always been. In fact, much of what Elliot was calling for was generally   pretty vague. The company wants AT&T to become more   efficient, yet didn't really detail what it thought it should do,   other than hiring third-party experts and advisors as part of a   strategic review. The hedge fund's plan for capital allocation --   keeping the dividend    while dividing the remaining cash flows between buybacks and debt   paydown -- is pretty much in line with what AT&T is currently   doing. A value investment with a hint of activism While I agree with much of what Elliot said in terms of   AT&T's past missteps -- especially buying DirecTV at \"peak   cable\" just before mass cord-cutting -- much of Elliot's   prescription for improving AT&T is less clear. While Elliot's   prodding may help the process around the edges, it's likely that   the investment was based on finding a big enough target trading   at just 10 times forward earnings with a multiple that could very   well be boosted by the mere presence of an activist investor in   the large-cap laggard.   10 stocks we like better than AT&T       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and AT&T wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Billy Duberstein      owns shares of AT&T. His clients may own shares of the     companies mentioned. The Motley Fool recommends T-Mobile US and     Verizon Communications. The Motley Fool has a     disclosure policy      .  ",
    "Activist investors buy large stakes in underperforming yet   undervalued companies, then advocate for change. So when one   takes on a large, well-known company such as   AT&T    (NYSE: T) , it's certainly news. On Monday, activist hedge fund   Elliot Management, run by founder and co-CEO Paul Singer,   disclosed a $3.2 billion stake in AT&T and put forward a   comprehensive plan for change.",
    "The hedge fund operators think that the telecom giant, which   traded for just over $36 per share to start the week, could reach   a whopping $60 per share by 2021 ... if the company follows   Elliot's plan, of course.",
    "So what is this plan, exactly?",
    "  AT&T has itself an activist investor. Image source:     Getty Images. ",
    "AT&T has itself an activist investor. Image source:     Getty Images.",
    "Much of Elliot Management's thesis consists of blaming   AT&T's management for past blunders. Mainly, Elliot   criticizes the telecom's massive acquisition spree over the past   decade. These include AT&T's failed acquisition of T-Mobile   (while having to pay T-Mobile a substantial breakup fee,   kick-starting the competitor's rise in the process), the   2014-2015 acquisition of DirecTV, the 2016-2018 acquisition of   Time Warner, as well as the company's foray into the Mexican and   Latin American telecom market. These are just the largest of   AT&T's acquisitions -- Elliot didn't even mention smaller   buys such as AppNexus and others.",
    "Elliot also believes AT&T is operationally inefficient, as   the aforementioned acquisitions have distracted management from   its core operations, causing the company to fall behind peers   such as   Verizon    . Elliot contends that AT&T lost focus, ceding the premium   network leadership to the more focused Verizon, while also ceding   the lower end of the market to disruptive innovator   T-Mobile    . Of note, Elliot mentions that AT&T's service earnings   before interest, taxes, depreciation, and amortization (   EBITDA    ) margins are a huge 1,500 basis points lower than Verizon's --   that's 15 percentage points!",
    "Meanwhile, Elliot goes on to criticize AT&T's total lack   of a strategy in the media space, a new business for AT&T's   leadership. Elliot cites dwindling pay-TV subscribers, the   lackluster launch of AT&T's   DirecTV Now    over-the-top service, as well as the company's   ever-changing plan    for integrating and delivering all of Time Warner's assets.",
    "With all of these missteps, one wonders what Elliot might see   in the lumbering telecom. The answer:   5G services    .",
    "Elliot's main bull case for AT&T is its potential to leap   ahead of Verizon and reclaim wireless leadership for the 5G   wireless standard, as Verizon did with 4G. 5G will enable   lightning-fast communications and ultra-low latency, and   therefore, a new wave of futuristic applications. Currently, the   5G buildout is in the very early stages, and herein lies the   opportunity.",
    "As I wrote in July -- and which Elliot mentioned in its thesis   -- AT&T has the advantage of building out   FirstNet    , a nationwide network for first responders. Winning this   contract in 2017 also gave AT&T valuable spectrum, as well as   some subsidies for the buildout -- which means that the company   will have an advantageous head start in the costly and   time-consuming construction of its 5G network. Elliot calls the   5G opportunity one that AT&T \"cannot afford to miss.\" He   elaborates further:",
    "We believe AT&T will be able to quickly move forward     while its main competitors remain either spectrum-disadvantaged     or distracted as they integrate major transactions. However,     while AT&T is well positioned, success in 5G will require     meaningful investment and improved execution; anything less and     AT&T risks missing this opportunity and falling behind     again.",
    "Elliot is likely referring to the   Sprint     and T-Mobile merger in the quote above, leaving just   Verizon for AT&T to surpass.",
    "For the most part, Elliot's arguments are spot-on. AT&T   has seemed to stretch itself too far away from its core wireless   operations, and its new media strategy doesn't seem particularly   well-thought-out. In addition, leaping ahead of competitors in   the race to 5G is certainly of utmost importance.",
    "However, it appears that management is already aware of this   and already investing heavily in 5G. And while one can never be   sure, it doesn't seem like AT&T is going to do any more   acquisitions in the near future. In addition, AT&T has, in   fact, been generating some synergies from recent acquisitions and   expanded its adjusted operating margins by 90 basis points last   quarter. So it doesn't seem like Elliot is proposing much of   anything that AT&T isn't already doing.",
    "While Elliot did call for AT&T to divest some of its   assets -- specifically, its Latin American operations and small   home-security business -- the hedge fund stopped short of calling   for a divestiture of the large media assets, though it did   advocate that \"numerous major portfolio actions\" should be   \"thoroughly explored.\" But if Elliot isn't proposing that   AT&T sell off its Time Warner and DirecTV assets, they'll   still be part of the company and thus still represent the same   distraction that they've always been.",
    "In fact, much of what Elliot was calling for was generally   pretty vague. The company wants AT&T to become more   efficient, yet didn't really detail what it thought it should do,   other than hiring third-party experts and advisors as part of a   strategic review. The hedge fund's plan for capital allocation --   keeping the dividend    while dividing the remaining cash flows between buybacks and debt   paydown -- is pretty much in line with what AT&T is currently   doing.",
    "While I agree with much of what Elliot said in terms of   AT&T's past missteps -- especially buying DirecTV at \"peak   cable\" just before mass cord-cutting -- much of Elliot's   prescription for improving AT&T is less clear. While Elliot's   prodding may help the process around the edges, it's likely that   the investment was based on finding a big enough target trading   at just 10 times forward earnings with a multiple that could very   well be boosted by the mere presence of an activist investor in   the large-cap laggard.",
    "  10 stocks we like better than AT&T       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and AT&T wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than AT&T       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and AT&T wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Billy Duberstein      owns shares of AT&T. His clients may own shares of the     companies mentioned. The Motley Fool recommends T-Mobile US and     Verizon Communications. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:47:58"
}