{
  "url": "https://www.nasdaq.com/article/chinas-weibo-takes-down-instagramlike-app-after-logo-plagiarism-spat-20190905-00207",
  "title": "China's Weibo takes down Instagram-like app after logo plagiarism spat - Nasdaq.com",
  "text": [
    "BEIJING, Sept 5 (Reuters) - Chinese microblogging website Weibo Corp  has taken down an Instagram-like app just three days after its launch and apologised following accusations of plagiarism about the app's logo, a stumble in efforts to find new sources of growth.",
    "Weibo, launched by Sina Corp  in 2009, is one of China's most established social networking companies, alongside the likes of Tencent Holdings Ltd . But it has been seeking new ways to grow in the face of competition from startups, including short video apps Douyin and Kuaishou.",
    "The company, backed by Alibaba Group Holding Ltd , launched image-sharing app Oasis on Monday. Media likened it to Facebook Inc's  Instagram app as it had a similar interface and allowed users to browse, share and edit photos and videos through the app. Instagram is blocked in China.",
    "But Weibo then took the app offline after a microblogger said the logo was nearly identical to one designed by South Korean studio fnt for the Ulju Mountain Film Festival in 2015.",
    "\"We apologise to the designer and also to our friends that care for us!\" it said in a post on Weibo. \"We especially thank the user who flagged this to us.\"",
    "\"We have initiated an internal inspection of our design process and contacted the designer to solve the copyright issue.\"",
    "An official of studio fnt said it had received an email and an apology from Weibo on Thursday.",
    "\"They also said the internal investigation was underway,\" the official, who requested anonymity, told Reuters. \"We are monitoring the situation.\"",
    "Oasis said it would relaunch the app \"soon\".",
    "A Weibo representative did not immediately respond to an email from Reuters to seek comment."
  ],
  "published_datetime": "2019-09-05 06:10:00"
}