{
  "url": "https://www.nasdaq.com/article/to-cut-or-not-dueling-fed-views-boost-pressure-on-powell-20190903-01326",
  "title": "To cut or not? Dueling Fed views boost pressure on Powell - Nasdaq.com",
  "text": [
    "By Howard Schneider and Ann Saphir",
    "ST. LOUIS/SAN FRANCISCO, Sept 3 (Reuters) - The Federal Reserve should use its meeting in two weeks to aggressively cut interest rates, one U.S. central banker said on Tuesday.",
    "Less than an hour later, a second U.S. central banker said he saw no need to use up the Fed's precious firepower when the economy is growing, inflation looks stable and labor markets are in good shape.",
    "On one hand, the escalating U.S.-China trade war and a global economic slowdown have begun to pinch U.S. business spending and manufacturing output, posing a threat to the broader U.S. economy.",
    "President Donald Trump has demanded the Fed cut rates to bolster growth as he piles tariffs on Chinese imports to try to win a better trade deal.",
    "But Americans continue to spend, wages are rising and employers keep adding jobs, suggesting a downturn is not on the horizon.",
    "Although Powell has said the Fed will act \"as appropriate\" to keep the economy growing, there is plenty of disagreement among his fellow rate-setters about what that two-word phrase means in practice.",
    "In an interview with Reuters on Tuesday, Bullard argued that the Fed needs to get ahead of both financial market expectations for a small rate cut and a global trade war that has become a broader \"reckoning\" over how the world economy is organized. ",
    "Underscoring his concerns, data released earlier on Tuesday showed the U.S. manufacturing sector had contracted for the first time in three years. U.S. stocks slid and benchmark Treasury yields hit their lowest in three years on concern the drawn-out trade war was taking an increasing toll on the U.S. and global economies.",
    "\"We are too high,\" Bullard said of Fed interest rates, noting that the central bank's current target policy rate of between 2% and 2.25% was higher than the current yield of all U.S. Treasury securities. Even the 30-year bond has dipped below 2%.",
    "Speaking with students and teachers in Easton, Massachusetts, Rosengren said he saw no need to pre-emptively cut rates to offset risks that were not clearly making themselves felt in the U.S. economic data. He chalked up low long-term U.S. rates to troubles abroad that had not yet been felt at home.",
    "With the Fed's policy rate only eight potential quarter-point rate cuts above zero - limited rate-cutting space to fight a downturn, he said - \"I don't want to use up that valuable space at a time where we actually think prices are pretty stable and the labor markets are pretty tight.\"",
    "\"As long as we are growing around 2%, I don't see nearly as much of a need for taking immediate policy action,\" he said.",
    "Bullard supported the Fed's quarter-point rate cut at its last meeting. Rosengren was one of two dissents in the 8-2 decision. The rate cut in July was the first since 2008.",
    "Financial markets are currently splitting the difference, with short-term interest-rate futures contracts pricing in a 90% chance of a quarter-point rate cut when policymakers gather in Washington on Sept. 17 and 18 to set rates for the world's biggest economy."
  ],
  "published_datetime": "2019-09-03 20:18:00"
}