{
  "url": "https://www.nasdaq.com/article/4-best-non-us-mutual-fund-for-your-portfolio-cm1206490",
  "title": "4 Best Non-US Mutual Fund for Your Portfolio - Nasdaq.com",
  "text": [
    " Investors looking to diversify across a wide range of foreign countries, including both emerging and developed nations, can consider non-U.S. mutual funds. These are excellent choices for those who prefer funds that invest in companies based in foreign markets to those with significant domestic exposure. Below we share with you four top-ranked non-U.S. mutual funds. Each has earned a  Zacks Mutual Fund Rank #1   (Strong Buy) and is expected to outperform its peers in the future. To view the Zacks Rank and past performance of all non-U.S. mutual funds, investors can  click here to see the complete list of Non-US funds  .  Fidelity International Capital Appreciation Fund FIVFX  primarily invests in securities of foreign companies including those that operate in emerging markets. FIVFX seeks growth of capital for the long run. It measures the industry's position as well as the financial and market condition of each company before selecting investments. The fund focuses on acquiring securities of companies from different countries. Fidelity International Capital Appreciation fund has three-year annualized returns of 10.3%. Sammy Simnegar is the fund manager of FIVFX since 2008.  Invesco Oppenheimer International Small-Mid Company Fund Class Y  OSMYX  seeks capital growth by investing the majority of its assets in equity securities of small and mid-cap companies. OSMYX invests in those companies whose market cap is similar to those that are within the range of the MSCI All Country World (ACWI) ex-U.S. SMID Index. Oppenheimer International Small-Mid Company Y has three-year annualized returns of 12.7%. OSMYX has an expense ratio of 1.07% compared with the category average of 1.42%.  Hartford International Opportunities HLS Fund  HBIOX  aims for long-term capital appreciation. The fund invests most of its assets in equity securities, comprising non-dollar securities of foreign issuers. In a bid to diversify its investments, the fund invests its assets across different countries with no bar on the amount of assets it invests in each. Hartford International Opportunities HLS Fund has three-year annualized returns of 5.8%. As of July 2019, HBIOX held 111 issues with 3.38% of its assets invested in Nestle SA.  Fidelity Japan Fund  FJPNX   seeks long-term capital growth. The fund invests a large portion of its assets in securities of companies in Japan. FJPNX invests in common stocks of companies that are influenced by the economic conditions of Japan. Fidelity Japan Fund has three-year annualized returns of 7.9%. Kirk Neureiter has been the fund manager of FJPNX since 2014. To view the Zacks Rank and past performance of all Non-US mutual funds, investors can  click here to see the complete list of Non-US funds  .  Want key mutual fund info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing mutual funds, each week.  Get it free >>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Get Your Free (HBIOX): Fund Analysis Report   Get Your Free (FJPNX): Fund Analysis Report   Get Your Free (FIVFX): Fund Analysis Report   Get Your Free (OSMYX): Fund Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors looking to diversify across a wide range of foreign countries, including both emerging and developed nations, can consider non-U.S. mutual funds. These are excellent choices for those who prefer funds that invest in companies based in foreign markets to those with significant domestic exposure.",
    "Below we share with you four top-ranked non-U.S. mutual funds. Each has earned a  Zacks Mutual Fund Rank #1   (Strong Buy) and is expected to outperform its peers in the future. To view the Zacks Rank and past performance of all non-U.S. mutual funds, investors can  click here to see the complete list of Non-US funds  .",
    " Fidelity International Capital Appreciation Fund FIVFX  primarily invests in securities of foreign companies including those that operate in emerging markets. FIVFX seeks growth of capital for the long run. It measures the industry's position as well as the financial and market condition of each company before selecting investments. The fund focuses on acquiring securities of companies from different countries. Fidelity International Capital Appreciation fund has three-year annualized returns of 10.3%.",
    "Sammy Simnegar is the fund manager of FIVFX since 2008.",
    " Invesco Oppenheimer International Small-Mid Company Fund Class Y  OSMYX  seeks capital growth by investing the majority of its assets in equity securities of small and mid-cap companies. OSMYX invests in those companies whose market cap is similar to those that are within the range of the MSCI All Country World (ACWI) ex-U.S. SMID Index. Oppenheimer International Small-Mid Company Y has three-year annualized returns of 12.7%.",
    "OSMYX has an expense ratio of 1.07% compared with the category average of 1.42%.",
    " Hartford International Opportunities HLS Fund  HBIOX  aims for long-term capital appreciation. The fund invests most of its assets in equity securities, comprising non-dollar securities of foreign issuers. In a bid to diversify its investments, the fund invests its assets across different countries with no bar on the amount of assets it invests in each. Hartford International Opportunities HLS Fund has three-year annualized returns of 5.8%.",
    "As of July 2019, HBIOX held 111 issues with 3.38% of its assets invested in Nestle SA.",
    " Fidelity Japan Fund  FJPNX   seeks long-term capital growth. The fund invests a large portion of its assets in securities of companies in Japan. FJPNX invests in common stocks of companies that are influenced by the economic conditions of Japan. Fidelity Japan Fund has three-year annualized returns of 7.9%.",
    "Kirk Neureiter has been the fund manager of FJPNX since 2014.",
    "To view the Zacks Rank and past performance of all Non-US mutual funds, investors can  click here to see the complete list of Non-US funds  .",
    " Want key mutual fund info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing mutual funds, each week.  Get it free >> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 07:24:00"
}