{
  "url": "https://www.nasdaq.com/article/apples-aggressive-entrance-into-the-subscription-market-cm1210685",
  "title": "Apple's Aggressive Entrance Into The Subscription Market - Nasdaq.com",
  "text": [
    " Apple AAPL  just unveiled its new line-up of products on Tuesday along with more news about its new digital subscription services. AAPL is up almost 3% in trading today as investors are excited about what is to come for this tech behemoth.  Apple Inc. Price and Consensus     Apple Inc. price-consensus-chart    |   Apple Inc. Quote   Reliable reoccurring revenue is the dream for any firm today. The consistency that comes with subscription-based sales gives firms a significant amount of financial flexibility and allows investors to be comfortable with excessively high valuation multiples. Apple is attempting to make that dream come true.  Streaming  Cable TV is becoming antiquated as consumers' patients for drawn-out ads thins. The only reasons that most people even get cable packages are either because of sports or bundled deals with Wi-Fi. Apple revealed that its streaming service would undercut the cost of every other streaming subscription at $4.99 a month. Apple TV+ is attempting to penetrate the streaming services market as a late adopter. Apple will be competing against firms that have been building out their library for years including Netflix NFLX  , Disney and its subsidiary Hulu DIS  , Prime Video AMZN  , and HBO T  . Apple has been able to recruit some of the top talent for its anticipated original content, including Steve Carell, Jennifer Aniston, and Reese Witherspoon. Apple will undoubtedly be far behind its competitors in original content and will need to pour a significant amount of cash in to keep up with the unending consumer appetite for new content. The $4.99 subscription price starting November 1 st  , is likely just a promotional price to gain traction and will likely not stand. Analysts anticipate that the price will rise to around $10 once they have gained a sufficient amount of market share. Apple needs to be willing to lose money on this segment in order to achieve ample market share for long term profitability. It is a question of how much money will they need to hemorrhage to be seen by the populous as a needed subscription service. There is a significant amount of potential for Apple in this streaming segment, and starting at the lowest price point is the right first step. The average household is willing to spend up to $50 on monthly subscriptions as cable becomes obsolete. There is room for all of the subscription players to grow in this space.  Gaming  Apple is also releasing Apple Arcade, a subscription-based gaming platform that will offer over 100 new games starting September 19 th  . Apple is offering this subscription for only $4.99 per month and will be available on the iPhone, iPad, Mac, and Apple TV. Competition for this type of arcade game subscription is light at the moment though Google is anticipating to release its Play Pass soon. The Play Pass is in testing right now, but it will be competing head to head with Apple Arcade for market share.    Take Away  Apple disciples, streaming fiends, and low-key gamers have their credit cards ready to sign-up for Apple's new subscription services. Both of these subscription services are likely going to lose the company money initially. If Apple can execute this model effectively, it will allow the company to hedge its bets away from the maturing smartphone industry. A successful subscription business will drive AAPL's valuations back to growth levels. Look for more color on Apple's ability to penetrate the streaming and gaming markets in earnings releases moving forward.    Looking for Stocks with Skyrocketing Upside?  makeArticleAd();  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   The Walt Disney Company (DIS): Free Stock Analysis Report   Amazon.com, Inc. (AMZN): Free Stock Analysis Report   Netflix, Inc. (NFLX): Free Stock Analysis Report   AT&T Inc. (T): Free Stock Analysis Report   Apple Inc. (AAPL): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Apple AAPL  just unveiled its new line-up of products on Tuesday along with more news about its new digital subscription services. AAPL is up almost 3% in trading today as investors are excited about what is to come for this tech behemoth.",
    " Apple Inc. Price and Consensus     Apple Inc. price-consensus-chart    |   Apple Inc. Quote  ",
    " Apple Inc. price-consensus-chart    |   Apple Inc. Quote ",
    "Reliable reoccurring revenue is the dream for any firm today. The consistency that comes with subscription-based sales gives firms a significant amount of financial flexibility and allows investors to be comfortable with excessively high valuation multiples. Apple is attempting to make that dream come true.",
    " Streaming ",
    "Cable TV is becoming antiquated as consumers' patients for drawn-out ads thins. The only reasons that most people even get cable packages are either because of sports or bundled deals with Wi-Fi.",
    "Apple revealed that its streaming service would undercut the cost of every other streaming subscription at $4.99 a month. Apple TV+ is attempting to penetrate the streaming services market as a late adopter. Apple will be competing against firms that have been building out their library for years including Netflix NFLX  , Disney and its subsidiary Hulu DIS  , Prime Video AMZN  , and HBO T  .",
    "Apple has been able to recruit some of the top talent for its anticipated original content, including Steve Carell, Jennifer Aniston, and Reese Witherspoon. Apple will undoubtedly be far behind its competitors in original content and will need to pour a significant amount of cash in to keep up with the unending consumer appetite for new content.",
    "The $4.99 subscription price starting November 1 st  , is likely just a promotional price to gain traction and will likely not stand. Analysts anticipate that the price will rise to around $10 once they have gained a sufficient amount of market share.",
    "Apple needs to be willing to lose money on this segment in order to achieve ample market share for long term profitability. It is a question of how much money will they need to hemorrhage to be seen by the populous as a needed subscription service.",
    "There is a significant amount of potential for Apple in this streaming segment, and starting at the lowest price point is the right first step. The average household is willing to spend up to $50 on monthly subscriptions as cable becomes obsolete. There is room for all of the subscription players to grow in this space.",
    " Gaming ",
    "Apple is also releasing Apple Arcade, a subscription-based gaming platform that will offer over 100 new games starting September 19 th  . Apple is offering this subscription for only $4.99 per month and will be available on the iPhone, iPad, Mac, and Apple TV.",
    "Competition for this type of arcade game subscription is light at the moment though Google is anticipating to release its Play Pass soon. The Play Pass is in testing right now, but it will be competing head to head with Apple Arcade for market share.  ",
    " Take Away ",
    "Apple disciples, streaming fiends, and low-key gamers have their credit cards ready to sign-up for Apple's new subscription services.",
    "Both of these subscription services are likely going to lose the company money initially. If Apple can execute this model effectively, it will allow the company to hedge its bets away from the maturing smartphone industry. A successful subscription business will drive AAPL's valuations back to growth levels.",
    "Look for more color on Apple's ability to penetrate the streaming and gaming markets in earnings releases moving forward.",
    " Looking for Stocks with Skyrocketing Upside?  makeArticleAd();  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:51:00"
}