{
  "url": "https://www.nasdaq.com/article/preciousgold-recovers-on-shortcovering-ahead-of-ecb-20190912-00119",
  "title": "PRECIOUS-Gold recovers on short-covering ahead of ECB - Nasdaq.com",
  "text": [
    "    * ECB announcement expected at 1145 GMT",
    "* Investors also await U.S. Aug CPI at 1230 GMT",
    "* Palladium set for 4th session of gains (Adds comments, updates prices)",
    "Sept 12 (Reuters) - Gold erased earlier losses on Thursdayas investors covered short positions ahead of a European CentralBank meeting, but improved risk appetite on hopes of a thaw inU.S.-China trade tensions limited the bullion's advance.",
    "Spot gold XAU= gained 0.4% to $1,503.00 per ounce at 0807GMT. U.S. gold futures GCcv1 rose 0.5% to $1,510.80 .",
    "\"Investors are now waiting for the ECB meeting, and U.S. CPIdata is expected to come negative... We may see some upside ingold,\" said Vandana Bharti, assistant vice-president ofcommodity research at SMC Comtrade, adding that there was someshort covering in the market.",
    "\"So long as it is trading above $1,490, I do not consider itbearish.\"",
    "Consumer price index (CPI) from the United States for Augustis expected to accelerate by merely 0.1%, compared to 0.3% inJuly, according to a Reuters poll, amid expectations the FederalReserve will cut interest rates at its meeting next week. ",
    "Also expected to hint at monetary policy easing was the ECB,closely watched for measures the bank was willing to take tosupport a dampened economy in the depth of Brexit concerns.",
    "The ECB is set to announce its rate decision at 1145 GMT onThursday, followed by ECB President Mario Draghi's newsconference at 1230 GMT.",
    "Meanwhile, the United States on Wednesday agreed to delayincreasing tariffs on $250 billion worth of Chinese imports toOct. 15 from Oct. 1 \"as a gesture of good will\". urn:newsml:reuters.com:*:nW1N24C02Jurn:newsml:reuters.com:*:nL3N2624DJ",
    "Hopes of a breakthrough in negotiations between the world'stwo biggest economies lifted risk sentiment in early trade, withMSCI's broadest index of Asia-Pacific shares outside Japan.MIAPJ0000PUS jumping to a six-week high. MKTS/GLOB",
    "Gold prices have dropped about 4% from a more than six-yearhigh of $1,557 it hit on Sept. 4 as renewed risk appetite andimproved global economic data dampened demand for the safe-havenmetal. Gold is highly sensitive to rising interest rates, whichlift the opportunity cost of holding non-yielding bullion.    ",
    "Signals are mixed for spot gold, as it is stuck in a neutralrange of $1,480-$1,497 per ounce, said Reuters technical analystWang Tao. urn:newsml:reuters.com:*:nL3N2630UY",
    "Among other precious metals, silver XAG= inched 0.6%higher to $18.19 per ounce, while platinum XPT= rose 0.7% to$950.60. Meanwhile, palladium XPD= gained 1.4% to $1,593.31 anounce.",
    "Palladium was on track for a fourth straight session ofgains, and hit a two-month peak of $1594.61 an ounce. (Reporting by Karthika Suresh Namboothiri in Bengaluru; Editingby Rashmi Aich and Uttaresh.V) ((karthikasuresh.namboothiri@thomsonreuters.com; +91 80 67490997 (If within U.S. call 651-848-5832); Reuters Messaging:karthikasuresh.namboothiri.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-12 04:36:00"
}