{
  "url": "https://www.nasdaq.com/article/could-the-trade-war-be-bullish-for-stocks-cm1210586",
  "title": "Could the Trade War be Bullish for Stocks? - Nasdaq.com",
  "text": [
    "      (0:30) - Predictions for The Continuing Trade War (2:00) - Whats Wrong With The Current Strategy (15:10) - Finding Buying Opportunities: How Will This Impact   Investors? (23:20) - Fed Rate Cut, Gold Investing and Brexit (27:00) - Is There A Recession On The Way? (33:05) - Episode Roundup:   UNH, CNC, MTZ, BAC, GLD, OZK, BMY     Welcome to Episode #193 of the Zacks Market Edge Podcast. Every week, host and Zacks stock strategist, Tracey Ryniec, will be joined by guests to discuss the hottest investing topics in stocks, bonds and ETFs and how it impacts your life. This week, Tracey is joined by John Blank, Zacks Chief Equity Strategist, to talk about the trade war and the economy. Where could stocks go from here? Where should investors be parking their money? Gold? Bitcoin? Value stocks?  3 Parts to the Trade War  1.       The intellectual property issues: trademarks, patents, branding etc. The FBI has said there are a thousand cases of theft from China. The two sides need to sit down and figure out improvement. 2.       The trade deficit is about $500 billion. If the US has a $21 trillion economy, that's about 4% of the US economy. 3.       Must bring down the US deficit.  The Stock Market's Response  Even with the tariffs and the trade issues as overhang, for the past 18 months, the stock market has been essentially flat. It hasn't gone up, or down. Is the pessimism already baked in?  Stocks to Hide Out In  1.       UnitedHealth Group UNH   is among the healthcare stocks that have been ignored in 2019. It has a forward P/E of just 15.5 yet it's supposed to grow earnings by 15% in 2019 and 12.2% in 2020. 2.       Centene CNC   is even cheaper than UNH. It has a P/E of just 10.5. But it too has grea t earnings  growth with analysts expecting 25% in 2019 and another 12% in 2012. That gives it a PEG of 0.7 which indicates its both a growth and a value stock. 3.       MasTec MTZ   is an infrastructure play in energy and utilities including wind farms and wireless networks. Shares have really popped in 2019, adding 60% year-to-date. But they're still cheap at just 13x. Earnings are expected to jump 32% in 2019. 4.       Bank of America BAC   is also cheap, with a forward P/E of 10. John isn't a fan of the banks with the Fed cutting though. But investors will get a dividend yielding 2.5% for their patience. 5.       Bristol-Myers Squibb BMY   is a Zacks Rank #1 (Strong Buy). The drug giant is also cheap with a forward P/E of just 11.2. Investors also get a dividend yielding 3.4%. What else should you know about investing during this period of economic uncertainty? Listen to this week's podcast to find out.  Biggest Tech Breakthrough in a Generation  makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Bank of America Corporation (BAC): Free Stock Analysis Report   Bristol-Myers Squibb Company (BMY): Free Stock Analysis Report   MasTec, Inc. (MTZ): Free Stock Analysis Report   UnitedHealth Group Incorporated (UNH): Free Stock Analysis Report   Centene Corporation (CNC): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Welcome to Episode #193 of the Zacks Market Edge Podcast.",
    "Every week, host and Zacks stock strategist, Tracey Ryniec, will be joined by guests to discuss the hottest investing topics in stocks, bonds and ETFs and how it impacts your life.",
    "This week, Tracey is joined by John Blank, Zacks Chief Equity Strategist, to talk about the trade war and the economy.",
    "Where could stocks go from here? Where should investors be parking their money?",
    "Gold? Bitcoin? Value stocks?",
    " 3 Parts to the Trade War ",
    "1.       The intellectual property issues: trademarks, patents, branding etc. The FBI has said there are a thousand cases of theft from China. The two sides need to sit down and figure out improvement.",
    "2.       The trade deficit is about $500 billion. If the US has a $21 trillion economy, that's about 4% of the US economy.",
    "3.       Must bring down the US deficit.",
    " The Stock Market's Response ",
    "Even with the tariffs and the trade issues as overhang, for the past 18 months, the stock market has been essentially flat. It hasn't gone up, or down.",
    "Is the pessimism already baked in?",
    " Stocks to Hide Out In ",
    "1.       UnitedHealth Group UNH   is among the healthcare stocks that have been ignored in 2019. It has a forward P/E of just 15.5 yet it's supposed to grow earnings by 15% in 2019 and 12.2% in 2020.",
    "2.       Centene CNC   is even cheaper than UNH. It has a P/E of just 10.5. But it too has grea t earnings  growth with analysts expecting 25% in 2019 and another 12% in 2012. That gives it a PEG of 0.7 which indicates its both a growth and a value stock.",
    "3.       MasTec MTZ   is an infrastructure play in energy and utilities including wind farms and wireless networks. Shares have really popped in 2019, adding 60% year-to-date. But they're still cheap at just 13x. Earnings are expected to jump 32% in 2019.",
    "4.       Bank of America BAC   is also cheap, with a forward P/E of 10. John isn't a fan of the banks with the Fed cutting though. But investors will get a dividend yielding 2.5% for their patience.",
    "5.       Bristol-Myers Squibb BMY   is a Zacks Rank #1 (Strong Buy). The drug giant is also cheap with a forward P/E of just 11.2. Investors also get a dividend yielding 3.4%.",
    "What else should you know about investing during this period of economic uncertainty?",
    "Listen to this week's podcast to find out.",
    " Biggest Tech Breakthrough in a Generation  makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 12:05:00"
}