{
  "url": "https://www.nasdaq.com/article/amazon-reportedly-testing-hand-scanning-payment-system-in-hopes-of-driving-sales-cm1207640",
  "title": "Amazon Reportedly Testing Hand Scanning Payment System in Hopes of Driving Sales - Nasdaq.com",
  "text": [
    " News broke out to today that Amazon AMZN  is potentially testing a payment system that would allow consumers to pay for products by scanning their hand print. The new payment system would be installed in Whole Foods stores. The technology reportedly scans the size and shape of your hand before charging the credit card on file for the matching customer. The high-tech biometric sensors differ from the fingerprint scanning technology utilized in Apple's AAPL  iPhones. The rumored hand scanning technology requires consumers to hover their hand over a platform and not physically touch the scanner. The system is code named \"Orville\" and will allow Amazon Prime account holders to link their credit cards to their hands for purchases made at Whole Foods.  According to sources  familiar with the matter, employees at Amazon's New York offices are voluntarily testing out the biometric technology to make purchases at some of the office vending machines. The source also went on to comment that It's accurate to within one ten-thousandth of 1%, but Amazon engineers are scrambling to improve it to a millionth of 1% ahead of its launch. The company is hoping to introduce the new payment system to select Whole Foods stores by the beginning of next year. While a regular credit card transaction takes between three and four seconds, Amazon's new technology is said to process the charge in less than 300 milliseconds. Grocery stores have been looking for new ways to cut down the lines at their registers. They have implemented self-check-out lanes and other methods in recent years but this new initiative might be the most eccentric yet. Amazon has been actively trying to get consumers to look past its inflated Whole Foods prices.  Whole Foods Struggles to Lower Prices  Amazon has been working hard to lower the prices of its Whole Foods products since it acquired to company over two years ago. Lowering prices has been easier said than done, as the company hiked prices in February after suppliers' contracts ended and they complained about higher costs. Lower prices would help attract more people to Whole Foods and Amazon can leverage their online presence to drive traffic into their stores. However, Amazon may have to sacrifice margins to be on par with less expensive stores like Kroger KR  and Walmart WMT  . Amazon has never shied away from taking short term profit cuts to ensure its long-term growth. Although, the grocery industry's margins are already razor thin and growth is no easy task.  Amazon report  ed that its same-store sales were roughly flat in its second quarter but if you adjust for online pick-up or delivery orders from Whole Foods, then sales went up 5%. This adjusted growth surpasses Kroger and Walmart's same-store gains of 2% and 2.9%, respectively. Amazon's main goal is to convert 100 million Amazon Prime members into Whole Foods customers. To achieve this goal the company has offered exclusive deals and discounts to Prime members.  Takeaway  Increasing grocery sales can eventually provide Amazon with the leverage it needs to sustain price cuts and renegotiate better deals with suppliers. Investors should note that Amazon is still trying to figure out how to efficiently increase sales and price fluctuations are expected to continue until sustainable growth is achieved. The reported biometric technology that amazon is testing seems to be the newest initiative the company has comprised to drive foot traffic and eventually sales in Whole Foods. However, the question of whether consumers will be fond of the idea of giving up their biometric information to Amazon still remains. Amazon is a Zacks Rank #3 (Hold).  Biggest Tech Breakthrough in a Generation  makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>         Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Amazon.com, Inc. (AMZN): Free Stock Analysis Report   Apple Inc. (AAPL): Free Stock Analysis Report   Walmart Inc. (WMT): Free Stock Analysis Report   The Kroger Co. (KR): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "News broke out to today that Amazon AMZN  is potentially testing a payment system that would allow consumers to pay for products by scanning their hand print. The new payment system would be installed in Whole Foods stores. The technology reportedly scans the size and shape of your hand before charging the credit card on file for the matching customer. The high-tech biometric sensors differ from the fingerprint scanning technology utilized in Apple's AAPL  iPhones. The rumored hand scanning technology requires consumers to hover their hand over a platform and not physically touch the scanner. The system is code named \"Orville\" and will allow Amazon Prime account holders to link their credit cards to their hands for purchases made at Whole Foods.",
    " According to sources  familiar with the matter, employees at Amazon's New York offices are voluntarily testing out the biometric technology to make purchases at some of the office vending machines. The source also went on to comment that It's accurate to within one ten-thousandth of 1%, but Amazon engineers are scrambling to improve it to a millionth of 1% ahead of its launch. The company is hoping to introduce the new payment system to select Whole Foods stores by the beginning of next year.",
    "While a regular credit card transaction takes between three and four seconds, Amazon's new technology is said to process the charge in less than 300 milliseconds. Grocery stores have been looking for new ways to cut down the lines at their registers. They have implemented self-check-out lanes and other methods in recent years but this new initiative might be the most eccentric yet. Amazon has been actively trying to get consumers to look past its inflated Whole Foods prices.",
    " Whole Foods Struggles to Lower Prices ",
    "Amazon has been working hard to lower the prices of its Whole Foods products since it acquired to company over two years ago. Lowering prices has been easier said than done, as the company hiked prices in February after suppliers' contracts ended and they complained about higher costs. Lower prices would help attract more people to Whole Foods and Amazon can leverage their online presence to drive traffic into their stores. However, Amazon may have to sacrifice margins to be on par with less expensive stores like Kroger KR  and Walmart WMT  .",
    "Amazon has never shied away from taking short term profit cuts to ensure its long-term growth. Although, the grocery industry's margins are already razor thin and growth is no easy task.  Amazon report  ed that its same-store sales were roughly flat in its second quarter but if you adjust for online pick-up or delivery orders from Whole Foods, then sales went up 5%. This adjusted growth surpasses Kroger and Walmart's same-store gains of 2% and 2.9%, respectively.",
    "Amazon's main goal is to convert 100 million Amazon Prime members into Whole Foods customers. To achieve this goal the company has offered exclusive deals and discounts to Prime members.",
    " Takeaway ",
    "Increasing grocery sales can eventually provide Amazon with the leverage it needs to sustain price cuts and renegotiate better deals with suppliers. Investors should note that Amazon is still trying to figure out how to efficiently increase sales and price fluctuations are expected to continue until sustainable growth is achieved.",
    "The reported biometric technology that amazon is testing seems to be the newest initiative the company has comprised to drive foot traffic and eventually sales in Whole Foods. However, the question of whether consumers will be fond of the idea of giving up their biometric information to Amazon still remains.",
    "Amazon is a Zacks Rank #3 (Hold).",
    " Biggest Tech Breakthrough in a Generation  makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>    ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 06:31:00"
}