{
  "url": "https://www.nasdaq.com/article/carnival-ccl-gains-but-lags-market-what-you-should-know-cm1207596",
  "title": "Carnival (CCL) Gains But Lags Market: What You Should Know - Nasdaq.com",
  "text": [
    " In the latest trading session, Carnival (CCL) closed at $43.89, marking a +0.5% move from the previous day. This move lagged the S&P 500's daily gain of 1.08%. Elsewhere, the Dow gained 0.91%, while the tech-heavy Nasdaq added 1.31%. Heading into today, shares of the cruise operator had lost 3.08% over the past month, lagging the Consumer Discretionary sector's loss of 1.93% and the S&P 500's loss of 0.68% in that time. CCL will be looking to display strength as it nears its nex t earnings  release. The company is expected to report EPS of $2.53, up 7.2% from the prior-year quarter. Meanwhile, our latest consensus estimate is calling for revenue of $6.21 billion, up 6.47% from the prior-year quarter. Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $4.34 per share and revenue of $20.35 billion. These totals would mark changes of +1.88% and +7.79%, respectively, from last year. Any recent changes to analyst estimates for CCL should also be noted by investors. These revisions help to show the ever-changing nature of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Within the past 30 days, our consensus EPS projection remained stagnant. CCL is holding a Zacks Rank of #3 (Hold) right now. In terms of valuation, CCL is currently trading at a Forward P/E ratio of 10.06. Its industry sports an average Forward P/E of 17.24, so we one might conclude that CCL is trading at a discount comparatively. We can also see that CCL currently has a PEG ratio of 1.04. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. Leisure and Recreation Services stocks are, on average, holding a PEG ratio of 1.6 based on yesterday's closing prices. The Leisure and Recreation Services industry is part of the Consumer Discretionary sector. This group has a Zacks Industry Rank of 194, putting it in the bottom 25% of all 250+ industries. The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. You can find more information on all of these metrics, and much more, on Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Carnival Corporation (CCL): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "In the latest trading session, Carnival (CCL) closed at $43.89, marking a +0.5% move from the previous day. This move lagged the S&P 500's daily gain of 1.08%. Elsewhere, the Dow gained 0.91%, while the tech-heavy Nasdaq added 1.31%.",
    "Heading into today, shares of the cruise operator had lost 3.08% over the past month, lagging the Consumer Discretionary sector's loss of 1.93% and the S&P 500's loss of 0.68% in that time.",
    "CCL will be looking to display strength as it nears its nex t earnings  release. The company is expected to report EPS of $2.53, up 7.2% from the prior-year quarter. Meanwhile, our latest consensus estimate is calling for revenue of $6.21 billion, up 6.47% from the prior-year quarter.",
    "Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $4.34 per share and revenue of $20.35 billion. These totals would mark changes of +1.88% and +7.79%, respectively, from last year.",
    "Any recent changes to analyst estimates for CCL should also be noted by investors. These revisions help to show the ever-changing nature of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Within the past 30 days, our consensus EPS projection remained stagnant. CCL is holding a Zacks Rank of #3 (Hold) right now.",
    "In terms of valuation, CCL is currently trading at a Forward P/E ratio of 10.06. Its industry sports an average Forward P/E of 17.24, so we one might conclude that CCL is trading at a discount comparatively.",
    "We can also see that CCL currently has a PEG ratio of 1.04. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. Leisure and Recreation Services stocks are, on average, holding a PEG ratio of 1.6 based on yesterday's closing prices.",
    "The Leisure and Recreation Services industry is part of the Consumer Discretionary sector. This group has a Zacks Industry Rank of 194, putting it in the bottom 25% of all 250+ industries.",
    "The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "You can find more information on all of these metrics, and much more, on Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:50:22"
}