{
  "url": "https://www.nasdaq.com/article/infinity-initiates-2-studies-for-lead-candidate-ipi-549-cm1207954",
  "title": "Infinity Initiates 2 Studies for Lead Candidate IPI-549 - Nasdaq.com",
  "text": [
    "  Infinity Pharmaceuticals Inc. INFI  has announced the initiation of two studies for its lead pipeline candidate-IPI-549, a first-in-class, oral immuno-oncology product candidate that selectively inhibits phosphoinositide-3 kinase (PI3K)-gamma. Shares of the company have increased 2.6% compared with the industry  's growth of 6.5%.    The company initiated a phase II, MARIO-3 study in collaboration with Roche AG RHHBY  , evaluating IPI-549 in combination with Tecentriq and Abraxane (nab-paclitaxel) in front-line triple negative breast cancer (TNBC), and in combination with Tecentriq. We note that, the combination of Tecentriq plus Abraxane is approved for TNBC. MARIO-3 is evaluating the addition of PI-549 to this regimen in both PDL1+ and PDL1- front-line TNBC patients.  MARIO-3 also includes a cohort evaluating IPI-549 in combination with Tecentriq and Avastin (bevacizumab) in front-line PDL1+ and PDL1- renal cell cancer (RCC) patients. Separately, Arcus Biosciences RCUS   has initiated a phase I/Ib study, in collaboration with Infinity, evaluating IPI-549 in a combination regimen with AB298, Arcus's dual adenosine receptor antagonist, and Doxil, a chemotherapy, in patients with advanced TNBC. By partnering with leading pharmaceutical and biotech companies, Infinity is evaluating IPI-549 for various diseases.  The company has a collaboration agreement with Bristol Myers BMY   to evaluate its lead pipeline candidate IPI-549 with the latter's PD-1 immune checkpoint inhibitor, Opdivo, in patients with advanced solid tumors. The company expects to complete enrollment in the second half of 2019 in the expanded combination cohorts in MARIO-1, an ongoing phase I/Ib study of IPI-549 as a monotherapy, and in combination with Opdivo in approximately 220 patients with advanced solid tumors. Infinity currently carries a Zacks Rank #3 (Hold). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here.       Infinity Pharmaceuticals, Inc. Price          Infinity Pharmaceuticals, Inc. price    |   Infinity Pharmaceuticals, Inc. Quote    It's Illegal in 42 States, But Investors Will Make   Billions Legally  In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year. That's twice as much as they spend on marijuana, legally or otherwise. Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.   See these 5 \"sin stocks\" now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Bristol-Myers Squibb Company (BMY): Free Stock Analysis Report   Roche Holding AG (RHHBY): Free Stock Analysis Report   Infinity Pharmaceuticals, Inc. (INFI): Free Stock Analysis Report   Arcus Biosciences, Inc. (RCUS): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " Infinity Pharmaceuticals Inc. INFI  has announced the initiation of two studies for its lead pipeline candidate-IPI-549, a first-in-class, oral immuno-oncology product candidate that selectively inhibits phosphoinositide-3 kinase (PI3K)-gamma.",
    "Shares of the company have increased 2.6% compared with the industry  's growth of 6.5%.",
    "The company initiated a phase II, MARIO-3 study in collaboration with Roche AG RHHBY  , evaluating IPI-549 in combination with Tecentriq and Abraxane (nab-paclitaxel) in front-line triple negative breast cancer (TNBC), and in combination with Tecentriq. We note that, the combination of Tecentriq plus Abraxane is approved for TNBC. MARIO-3 is evaluating the addition of PI-549 to this regimen in both PDL1+ and PDL1- front-line TNBC patients.  MARIO-3 also includes a cohort evaluating IPI-549 in combination with Tecentriq and Avastin (bevacizumab) in front-line PDL1+ and PDL1- renal cell cancer (RCC) patients.",
    "Separately, Arcus Biosciences RCUS   has initiated a phase I/Ib study, in collaboration with Infinity, evaluating IPI-549 in a combination regimen with AB298, Arcus's dual adenosine receptor antagonist, and Doxil, a chemotherapy, in patients with advanced TNBC.",
    "By partnering with leading pharmaceutical and biotech companies, Infinity is evaluating IPI-549 for various diseases.  The company has a collaboration agreement with Bristol Myers BMY   to evaluate its lead pipeline candidate IPI-549 with the latter's PD-1 immune checkpoint inhibitor, Opdivo, in patients with advanced solid tumors. The company expects to complete enrollment in the second half of 2019 in the expanded combination cohorts in MARIO-1, an ongoing phase I/Ib study of IPI-549 as a monotherapy, and in combination with Opdivo in approximately 220 patients with advanced solid tumors.",
    "Infinity currently carries a Zacks Rank #3 (Hold). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here.  ",
    "  Infinity Pharmaceuticals, Inc. Price          Infinity Pharmaceuticals, Inc. price    |   Infinity Pharmaceuticals, Inc. Quote  ",
    " Infinity Pharmaceuticals, Inc. Price ",
    " Infinity Pharmaceuticals, Inc. price    |   Infinity Pharmaceuticals, Inc. Quote ",
    " It's Illegal in 42 States, But Investors Will Make   Billions Legally ",
    "In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year. That's twice as much as they spend on marijuana, legally or otherwise. Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "  See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:24:00"
}