{
  "url": "https://www.nasdaq.com/article/is-columbia-sportswear-colm-stock-outpacing-its-consumer-discretionary-peers-this-year-cm1207188",
  "title": "Is Columbia Sportswear (COLM) Stock Outpacing Its Consumer Discretionary Peers This Year? - Nasdaq.com",
  "text": [
    " Investors focused on the Consumer Discretionary space have likely heard of Columbia Sportswear (COLM), but is the stock performing well in comparison to the rest of its sector peers? Let's take a closer look at the stock's year-to-date performance to find out. Columbia Sportswear is one of 249 individual stocks in the Consumer Discretionary sector. Collectively, these companies sit at #11 in the Zacks Sector Rank. The Zacks Sector Rank considers 16 different sector groups. The average Zacks Rank of the individual stocks within the groups is measured, and the sectors are listed from best to worst. The Zacks Rank is a successful stock-picking model that emphasizes earnings estimates and estimate revisions. The system highlights a number of different stocks that could be poised to outperform the broader market over the next one to three months. COLM is currently sporting a Zacks Rank of #2 (Buy). Over the past 90 days, the Zacks Consensus Estimate for COLM's full-year earnings has moved 3.77% higher. This signals that analyst sentiment is improving and the stock's earnings outlook is more positive. Based on the most recent data, COLM has returned 8.78% so far this year. Meanwhile, the Consumer Discretionary sector has returned an average of 15.79% on a year-to-date basis. As we can see, Columbia Sportswear is performing better than its sector in the calendar year. Looking more specifically, COLM belongs to the Textile - Apparel industry, which includes 22 individual stocks and currently sits at #74 in the Zacks Industry Rank. Stocks in this group have gained about 6.72% so far this year, so COLM is performing better this group in terms of year-to-date returns. Investors in the Consumer Discretionary sector will want to keep a close eye on COLM as it attempts to continue its solid performance.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Columbia Sportswear Company (COLM): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors focused on the Consumer Discretionary space have likely heard of Columbia Sportswear (COLM), but is the stock performing well in comparison to the rest of its sector peers? Let's take a closer look at the stock's year-to-date performance to find out.",
    "Columbia Sportswear is one of 249 individual stocks in the Consumer Discretionary sector. Collectively, these companies sit at #11 in the Zacks Sector Rank. The Zacks Sector Rank considers 16 different sector groups. The average Zacks Rank of the individual stocks within the groups is measured, and the sectors are listed from best to worst.",
    "The Zacks Rank is a successful stock-picking model that emphasizes earnings estimates and estimate revisions. The system highlights a number of different stocks that could be poised to outperform the broader market over the next one to three months. COLM is currently sporting a Zacks Rank of #2 (Buy).",
    "Over the past 90 days, the Zacks Consensus Estimate for COLM's full-year earnings has moved 3.77% higher. This signals that analyst sentiment is improving and the stock's earnings outlook is more positive.",
    "Based on the most recent data, COLM has returned 8.78% so far this year. Meanwhile, the Consumer Discretionary sector has returned an average of 15.79% on a year-to-date basis. As we can see, Columbia Sportswear is performing better than its sector in the calendar year.",
    "Looking more specifically, COLM belongs to the Textile - Apparel industry, which includes 22 individual stocks and currently sits at #74 in the Zacks Industry Rank. Stocks in this group have gained about 6.72% so far this year, so COLM is performing better this group in terms of year-to-date returns.",
    "Investors in the Consumer Discretionary sector will want to keep a close eye on COLM as it attempts to continue its solid performance.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:10"
}