{
  "url": "https://www.nasdaq.com/article/roche-extends-offer-to-acquire-spark-therapeutics-yet-again-cm1207328",
  "title": "Roche Extends Offer to Acquire Spark Therapeutics Yet Again - Nasdaq.com",
  "text": [
    "  Roche RHHBY  announced that it has extended the period of its previously-announced tender offer to purchase the outstanding shares of common stock of Spark Therapeutics for $114.50 per share. Roche had announced in February 2019 that it will acquire gene-therapy company Spark to bolster its portfolio. The offer has now been extended to Oct 1 to provide additional time to the U.S. Federal Trade Commission (\"FTC\") and the U.K. Competition and Markets Authority (\"CMA\") to complete their previously-disclosed reviews of the pending acquisition. In June 2019, both companies had received a request for additional information from the FTC under the Hart-Scott-Rodino Act. Roche had then announced an extension of the tender offer to purchase the outstanding shares of common stock of Spark to Jul 31. Thereafter, the offer was again extended to Sep 3 to provide additional time to the FTC and the CMA to complete their previously-disclosed reviews of the pending acquisition. While details of the FTC review were not mentioned, it has been widely speculated that the acquisition would make Roche a formidable player in the hemophilia A market, with its own drug Hemlibra and two gene-therapy candidates Spark is working on to treat the same. However, the persistent delay has been disappointing. Nevertheless, Roche's stock has gained 10.4% in the year so far against the industry  's decline of 0.7%.      We remind investors that many other mergers have also been delayed due to FTC demands. Bristol-Myers Squibb Company BMY  recently announced that Celgene Corporation CELG  has inked an agreement to sell its plaque psoriasis and psoriatic arthritis drug, Otezla, to Amgen AMGN  . The deal is in connection with the Bristol-Myers-Celgene merger. Bristol-Myers decided to divest Otezla to close the Celgene acquisition on a timely basis in light of concerns expressed by the FTC. We remind investors that Bristol-Myers has a tyrosine kinase 2 (TYK2) inhibitor, BMS-986165, in its pipeline, which is being evaluated in several autoimmune diseases, including psoriasis. The regulatory agency was concerned about a possible overlap between Otezla and BMS-986165 in the pipeline. Hence, the company decided to sell Otezla. Roche currently carries a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>      makeArticleAd();  Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Bristol-Myers Squibb Company (BMY): Free Stock Analysis Report   Roche Holding AG (RHHBY): Free Stock Analysis Report   Amgen Inc. (AMGN): Free Stock Analysis Report   Celgene Corporation (CELG): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Roche RHHBY  announced that it has extended the period of its previously-announced tender offer to purchase the outstanding shares of common stock of Spark Therapeutics for $114.50 per share.",
    "Roche had announced in February 2019 that it will acquire gene-therapy company Spark to bolster its portfolio.",
    "The offer has now been extended to Oct 1 to provide additional time to the U.S. Federal Trade Commission (\"FTC\") and the U.K. Competition and Markets Authority (\"CMA\") to complete their previously-disclosed reviews of the pending acquisition.",
    "In June 2019, both companies had received a request for additional information from the FTC under the Hart-Scott-Rodino Act. Roche had then announced an extension of the tender offer to purchase the outstanding shares of common stock of Spark to Jul 31. Thereafter, the offer was again extended to Sep 3 to provide additional time to the FTC and the CMA to complete their previously-disclosed reviews of the pending acquisition. While details of the FTC review were not mentioned, it has been widely speculated that the acquisition would make Roche a formidable player in the hemophilia A market, with its own drug Hemlibra and two gene-therapy candidates Spark is working on to treat the same.",
    "However, the persistent delay has been disappointing. Nevertheless, Roche's stock has gained 10.4% in the year so far against the industry  's decline of 0.7%.",
    "We remind investors that many other mergers have also been delayed due to FTC demands. Bristol-Myers Squibb Company BMY  recently announced that Celgene Corporation CELG  has inked an agreement to sell its plaque psoriasis and psoriatic arthritis drug, Otezla, to Amgen AMGN  . The deal is in connection with the Bristol-Myers-Celgene merger. Bristol-Myers decided to divest Otezla to close the Celgene acquisition on a timely basis in light of concerns expressed by the FTC. We remind investors that Bristol-Myers has a tyrosine kinase 2 (TYK2) inhibitor, BMS-986165, in its pipeline, which is being evaluated in several autoimmune diseases, including psoriasis. The regulatory agency was concerned about a possible overlap between Otezla and BMS-986165 in the pipeline. Hence, the company decided to sell Otezla.",
    "Roche currently carries a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:39:00"
}