{
  "url": "https://www.nasdaq.com/article/russian-agri-minister-saudis-falih-to-discuss-russiasaudi-trade-20190904-00947",
  "title": "Russian Agri Minister, Saudi's Falih to discuss Russia-Saudi trade - Nasdaq.com",
  "text": [
    "MOSCOW, Sept 4 (Reuters) - Russian Agriculture Minister Dmitry Patrushev and Saudi Arabian Energy Minister Khalid al-Falih will discuss the development of bilateral relations, including agricultural trade, during their meeting on Thursday, the Russian ministry said.",
    "In August, Saudi Arabia decided to relax its bug-damage specifications for wheat imports, opening the door to Black Sea imports and strengthening ties with Russia beyond energy cooperation. ",
    "Falih and Patrushev will meet as part of Patrushev's visit to Saudi Arabia on Wednesday, the ministry added. Patrushev will also meet his Saudi Arabian counterpart, Abdulrahman al-Fadhli, and visit one of Saudi Arabia's agriculture companies.",
    "\"We propose developing a joint programme for expansion of exports of Russian food products to Saudi Arabia so that exports of Russian agriculture products exceed $2 billion by 2024,\" Patrushev was quoted as saying in the statement.",
    "He said Russian producers of poultry, honey, milk, flour and confectionary were interested in boosting supplies to Saudi Arabia.",
    "The ministry is also ready to support Saudi companies willing to take part in agriculture products projects in Russia, he said.",
    "Russia, the world's largest wheat exporter, has long sought access to Saudi Arabia's wheat market as Moscow tries to take further market share in Middle Eastern and North African wheat markets from the European Union and the United States.",
    "After Saudi Arabia said in August it would relax its limits for bug-damage in hard wheat to 0.5% from 0% from its next tender, a Russian industry source told Reuters that Moscow would  continue to press Saudi Arabia to reduce the bug damage level to 1%. ",
    "The change in these specifications has had wider implications as Riyadh - which regards the United States as its most important ally - moves closer to Moscow, with Russian President Vladimir Putin due to visit Saudi Arabia in October.",
    "A delegation from Russia which includes major Russian grain, meat and dairy companies has also arrived with Patrushev to Saudi Arabia, the Russian ministry said. It did not disclose their names.",
    "The meeting between Falih and Patrushev is also due days after Saudi Arabia named Yasir al-Rumayyan, head of the kingdom's PIF sovereign wealth fund, as chairman of Saudi Aramco, replacing Falih as the company prepares for an initial public offering (IPO).",
    "Russia's top Saudi negotiators have praised Falih, saying changes in Saudi Arabia's oil industry would not affect cooperation between Moscow and Riyadh. "
  ],
  "published_datetime": "2019-09-04 03:24:00"
}