{
  "url": "https://www.nasdaq.com/article/general-electric-is-a-buy-despite-the-markopolos-report-cm1210381",
  "title": "General Electric Is a Buy Despite the Markopolos Report - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "General Electric (NYSE: GE ) finally looked to be out of the woods. GE stock bounced nicely earlier this year, and the company appeared to be turning things around. But a short seller has put GE stock back in the center of controversy once again. Harry Markopolos, famous for helping expose Bernie Madoff down, has sought out his next big target: General Electric.",
    "Markopolos dropped a 175-page report alleging all sorts of fraud and misrepresentations at GE. As a result, traders immediately dumped GE stock, though it quickly recovered much of its losses. Various analysts, including other short sellers, pointed out errors and hasty thinking in Markopolos' report. Still, many traders are operating under the thinking that where there's smoke there may be fire. GE stock has yet to reclaim the $10 per share mark following Markopolos' negative analysis of the firm.",
    "As  InvestorPlace's  James Brumley noted , there are many reasons to question the Markopolos report. For one, various folks ranging from bank analysts to fellow short sellers and even an ex-SEC chairman have suggested there were \"suspicious\" things about his work. Bronte Capital's fund manager John Hempton slammed the report as \"utterly misleading\" and \"flat-out silly\".",
    "While Markopolos deservedly earned his reputation with the Bernie Madoff investigation, it's far different going after a public company. It's one thing to expose a total ponzi scheme. But with GE, Markopolos is going after nuanced accounting things such as assumptions on long-term insurance policies where accountants can disagree.",
    "Look at something like  Brighthouse Financial (NYSE: BHF ) where the famed David Einhorn is long, short sellers are on the other side , and they are having a healthy debate around the value of its long-term insurance policies.",
    "Markopolos, by contrast, is running around screaming fraud while discussing complicated details.",
    "Why is Markopolos taking such a direct approach? He seems to be going for a financial reward. Markopolos is angling to earn money from an SEC whistleblower program along with working with a hedge fund that profits if the GE stock price goes down. These reasons would give Markopolos motivation to play up the incendiary language in his allegations.",
    "While I'm skeptical about the Markopolos report and its intentions, there are some points the bears have latched onto that are worthy of further consideration. For example, GE has negative working capital - and a lot of it. The figure pencils out around $10 to $20 billion depending on what all you count.",
    "What's this mean? General Electric owes more in short-term liabilities than it has in short-term assets. This can be a good thing. For example, think of a subscription business, where people pay you before you deliver a service to them. In the case of an industrial firm like GE, however, a large negative working capital position could mean the company is in weaker financial position than you'd think from a quick glance at its credit rating.",
    "In addition to the negative working capital point, analysts concede that Markopolos has some valid concerns on other things such as valuation marks on some divisions and how the value of long-term insurance contracts are calculated. But there's little evidence of anything close to outright fraud.",
    "One of the weirder things about calling GE a massive fraud is its management team. General Electric already cleaned the deck of its old team and brought in Larry Culp. For those unfamiliar, Culp was the longtime head of industrial powerhouse  Danaher (NYSE: DHR ). During Culp's tenure, Danaher stock appreciated roughly 500%. Culp is clearly a skilled leader, and there was no evidence of any wrongdoing in his previous highly-successful company.",
    "Once Markopolos leveled his charges against GE, Culp stepped in and bought GE stock aggressively. Culp said the allegations are baseless and defended the company with the strongest currency possible, his own money. In fact, Culp invested more in GE stock following the fraud claims than he invested in Danaher during his triumphant run at that firm. That's how much conviction Culp has that Markopolos is shooting blanks.",
    "Does a great leader guarantee that GE will succeed? Of course not. Sometimes even the greatest management teams face insurmountable challenges. And General Electric is admittedly in a pretty difficult situation. But in Culp, you have an honest and proven leader.",
    "If you're looking for a safe industrial stock to buy, don't pick GE. GE just announced its measly one cent quarterly dividend payment last week. That's a stark reminder of how far GE has fallen from when it was one of America's most respected blue chip holdings. If you want a safe reliable holding, something like  Honeywell (NYSE: HON ) or  United Technologies (NYSE: UTX ) is a better bet.",
    "But if you are willing to speculate on a turnaround with a decent shot at success, GE is interesting. This Markopolos report could be a blessing in disguise, as it has aired some pointed questions about GE's accounting and offered investors a lot more transparency into the firm. As folks get more comfortable with Culp's vision for an improved General Electric, shares could rally nicely in coming quarters.",
    "At the time of this writing, Ian Bezek owned UTX and BHF stock. You can reach him on Twitter at @irbezek.",
    "The post General Electric Is a Buy Despite the Markopolos Report appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 06:15:16"
}