{
  "url": "https://www.nasdaq.com/article/copart-cprt-q4-earnings-revenues-top-estimates-up-yy-cm1207969",
  "title": "Copart (CPRT) Q4 Earnings & Revenues Top Estimates, Up Y/Y - Nasdaq.com",
  "text": [
    "  Copart, Inc. CPRT  reported adjusted earnings per share of 60 cents in fourth-quarter fiscal 2019 (ended Jul 31, 2019), surpassing the Zacks Consensus Estimate of 57 cents. The bottom-line figure also surged 42.8% year over year. Including one-time items, earnings per share came in at 64 cents in the July-end quarter, up from the 45 cents in the comparable period last year.   Net income was $153.5 million, reflecting an increase of 39.9% from fourth-quarter fiscal 2018. For fiscal 2019, Copar t report  ed adjusted earnings per share of $2.25, up from the prior-year figure of $1.73. Earnings also beat the Zacks Consensus Estimate of $2.21. In fiscal 2019, revenues came in at $2 billion, up from the fiscal 2018 figure of $1.8 billion and in line with the Zacks Consensus Estimate.  Copart, Inc. Price, Consensus and EPS Surprise         Copart, Inc.   price-consensus-eps-surprise-chart    |   Copart, Inc. Quote    Operational Update    In the fiscal fourth quarter, Copart's revenues jumped 20.8% to $542.6 million from the year-ago quarter tally. Further, revenues surpassed the Zacks Consensus Estimate of $507 million. Service revenues increased to $470.4 million, year on year, from $391.7 million. Revenues from vehicle sales were $72 million compared with the $57 million recorded in fourth-quarter fiscal 2018. Gross profit was up 28.8% year over year to $242.6 million. Total operating expenses flared up to $349.7 million from $314.3 million recorded in the prior-year period. Operating income increased to $192.8 million from $134.8 million reported a year ago.  Financial Details  Copart had cash and cash equivalents of $186.3 million as of Jul 31, 2019, compared with $274.5 million as of Jul 31, 2018. Long-term debt, revolving loan facility and capital lease obligations were $400 million as of Jul 31, 2019, up from $399 million as of Jul 31, 2018. In fiscal 2019, Copart generated net cash flow of $647 million from operations compared with $535 million in the prior fiscal.  Zacks Rank & Stocks to Consider  Currently, Copart carries a Zacks Rank #3 (Hold). A few better-ranked stocks in the Business Services sector are Booz Allen Hamilton Holding Corporation BAH  , Clean Harbors, Inc. CLH  and Diebold Nixdorf, Incorporated DBD  , each carrying a Zacks Rank #1 (Strong Buy) at present. You can see  the complete list of today's Zacks #1 Rank stocks here  .  Booz Allen Hamilton has a projected earnings growth rate of 10.8% for the current year. The stock has gained 46.5% in a year's time. Clean Harbors has an estimated earnings growth rate of 53.9% for 2019. The company's shares have rallied 7.7% in the past year. Diebold Nixdorf has an expected earnings growth rate of 113.6% for the ongoing year. The stock has appreciated 141.2% over the past year.  It's Illegal in 42 States, But Investors Will Make   Billions Legally  In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year. That's twice as much as they spend on marijuana, legally or otherwise. Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.   See these 5 \"sin stocks\" now>>   makeArticleAd();  Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Diebold Nixdorf, Incorporated (DBD): Free Stock Analysis Report   Copart, Inc. (CPRT): Free Stock Analysis Report   Booz Allen Hamilton Holding Corporation (BAH): Free Stock Analysis Report   Clean Harbors, Inc. (CLH): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " Copart, Inc. CPRT  reported adjusted earnings per share of 60 cents in fourth-quarter fiscal 2019 (ended Jul 31, 2019), surpassing the Zacks Consensus Estimate of 57 cents. The bottom-line figure also surged 42.8% year over year.",
    "Including one-time items, earnings per share came in at 64 cents in the July-end quarter, up from the 45 cents in the comparable period last year.   Net income was $153.5 million, reflecting an increase of 39.9% from fourth-quarter fiscal 2018.",
    "For fiscal 2019, Copar t report  ed adjusted earnings per share of $2.25, up from the prior-year figure of $1.73. Earnings also beat the Zacks Consensus Estimate of $2.21. In fiscal 2019, revenues came in at $2 billion, up from the fiscal 2018 figure of $1.8 billion and in line with the Zacks Consensus Estimate.",
    " Copart, Inc. Price, Consensus and EPS Surprise ",
    "       Copart, Inc.   price-consensus-eps-surprise-chart    |   Copart, Inc. Quote  ",
    " Copart, Inc.   price-consensus-eps-surprise-chart    |   Copart, Inc. Quote ",
    " Operational Update ",
    "In the fiscal fourth quarter, Copart's revenues jumped 20.8% to $542.6 million from the year-ago quarter tally. Further, revenues surpassed the Zacks Consensus Estimate of $507 million. Service revenues increased to $470.4 million, year on year, from $391.7 million. Revenues from vehicle sales were $72 million compared with the $57 million recorded in fourth-quarter fiscal 2018.",
    "Gross profit was up 28.8% year over year to $242.6 million. Total operating expenses flared up to $349.7 million from $314.3 million recorded in the prior-year period. Operating income increased to $192.8 million from $134.8 million reported a year ago.",
    " Financial Details ",
    "Copart had cash and cash equivalents of $186.3 million as of Jul 31, 2019, compared with $274.5 million as of Jul 31, 2018. Long-term debt, revolving loan facility and capital lease obligations were $400 million as of Jul 31, 2019, up from $399 million as of Jul 31, 2018.",
    "In fiscal 2019, Copart generated net cash flow of $647 million from operations compared with $535 million in the prior fiscal.",
    " Zacks Rank & Stocks to Consider ",
    "Currently, Copart carries a Zacks Rank #3 (Hold).",
    "A few better-ranked stocks in the Business Services sector are Booz Allen Hamilton Holding Corporation BAH  , Clean Harbors, Inc. CLH  and Diebold Nixdorf, Incorporated DBD  , each carrying a Zacks Rank #1 (Strong Buy) at present. You can see  the complete list of today's Zacks #1 Rank stocks here  . ",
    "Booz Allen Hamilton has a projected earnings growth rate of 10.8% for the current year. The stock has gained 46.5% in a year's time.",
    "Clean Harbors has an estimated earnings growth rate of 53.9% for 2019. The company's shares have rallied 7.7% in the past year.",
    "Diebold Nixdorf has an expected earnings growth rate of 113.6% for the ongoing year. The stock has appreciated 141.2% over the past year.",
    " It's Illegal in 42 States, But Investors Will Make   Billions Legally ",
    "In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    "That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "  See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:11:00"
}