{
  "url": "https://www.nasdaq.com/article/oil-prices-rise-over-4-on-positive-economic-data-from-china-20190904-00887",
  "title": "Oil prices rise over 4% on positive economic data from China - Nasdaq.com",
  "text": [
    "    * Survey finds expansion of China's services sector",
    "* U.S. manufacturing contracted in August - data",
    "* Trump warns he will be tougher on Beijing if trade talksdrag",
    "* Coming up: U.S. weekly oil inventory data from API (2030GMT) (Adds closing prices)",
    "By Scott DiSavino",
    "NEW YORK, Sept 4 (Reuters) - Oil prices rose more than 4% onWednesday, boosted by a wider market pickup on positive newsfrom China, after three days of losses due to fears about aweakening global economy. ",
    "Brent futures LCOc1 rose $2.44, or 4.2%, to settle at$60.70 a barrel, while U.S. West Texas Intermediate (WTI) crude CLc1 gained $2.32, or 4.3%, to $56.26.",
    "That was the biggest daily percentage increase for WTI sinceJuly 10.",
    "Stock indexes worldwide rebounded as easing geopoliticalconcerns and upbeat economic data from China brought buyers backto the equities market. MKTS/GLOB",
    "A private survey showed that activity in China's servicessector expanded at the fastest pace in three months in August asnew orders rose, prompting the biggest increase in hiring inmore than a year. urn:newsml:reuters.com:*:nL3N25U2EKurn:newsml:reuters.com:*:nL3N25V2UC",
    "In addition, investor risk appetite was further revivedafter Hong Kong withdrew the contentious extradition bill at theheart of recent protests. urn:newsml:reuters.com:*:nL3N25V0NC",
    "China is the world's second-largest oil consumer and largestimporter.",
    "In the United States, crude stockpiles were expected to havedeclined for a third straight week, a Reuters poll showed, aheadof weekly data from the American Petroleum Institute (API) onWednesday and the government on Thursday. Both reports aredelayed a day due to the U.S. Labor Day holiday. EIA/S",
    "Some analysts, however, noted overall fundamentals of theoil market remained discouraging.",
    "\"Oil prices however remain focused on the trade war and thelonger we don't see a date scheduled for a face-to-face meetingbetween Chinese and U.S. officials, the greater the odds wecould see a retest of the summer lows,\" Edward Moya, seniormarket analyst at OANDA in New York, said in a report.",
    "U.S. President Donald Trump warned on Tuesday he would be\"tougher\" on Beijing in a second term if trade talks dragged on,compounding market fears that trade disputes between the twocountries could trigger a U.S. recession. urn:newsml:reuters.com:*:nL2N25U0FT",
    "U.S. data released on Tuesday showed manufacturing activitycontracted in August for the first time in three years, whileeuro zone activity shrank for a seventh month. urn:newsml:reuters.com:*:nL2N25R073",
    "\"Crude oil remains troubled by reports that production fromOPEC, Russia and the U.S. all rose last month. This (comes) at atime when the strength of demand growth, due to trade warpessimism, has increasingly been called into question,\" SaxoBank commodity strategist Ole Hansen said.",
    "BP Plc'sBP.L Chief Financial Officer Brian Gilvary toldReuters that global oil demand is expected to grow by less than1 million barrels per day (bpd) in 2019 as consumption slows. urn:newsml:reuters.com:*:nL5N25V4RT",
    "But supply looks set to stay constrained as Russianofficials and sources from the Organization of the PetroleumExporting Countries indicated the countries would remaincommitted to their agreement to rein in production despite ashake-up in Saudi Arabia's oil industry. urn:newsml:reuters.com:*:nL5N25V0BK",
    "In a possible sign of tension easing in the energy-richGulf, Iranian state television reported on Wednesday that Tehranwould free seven crew members of the detained British-flaggedtanker Stena Impero. ",
    "The vessel was seized two weeks after Britain detained anIranian tanker off the territory of Gibraltar which was releasedin August. urn:newsml:reuters.com:*:nL5N25V20B (Additional reporting by Noah Browning in London and FlorenceTan in Singapore; Editing by Marguerita Choy, Dale Hudson andCynthia Osterman) ((mailto:scott.disavino@thomsonreuters.com; +1 646 223-6072;Reuters Messaging:rm://scott.disavino.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-04 01:01:00"
}