{
  "url": "https://www.nasdaq.com/article/euro-zone-bond-markets-calm-ahead-of-ecb-storm-20190912-00086",
  "title": "Euro zone bond markets calm ahead of ECB storm - Nasdaq.com",
  "text": [
    "By Dhara Ranasinghe and Yoruk  Bahceli",
    "LONDON, Sept 12 (Reuters) - Euro zone bond markets were braced on Thursday for the European Central Bank to announce fresh stimulus measures, but uncertainty reigned over the bank's precise moves.",
    "Government bond yields in the bloc, a touch lower in morning trade, have risen from record lows reached just a week ago on growing doubts that the ECB will begin a fresh round of asset purchases, known as quantitative easing (QE).",
    "\"Whether the ECB cuts rates by 10 or 20 bps is neither here or there,\" said Chris Scicluna, head of economic research at Daiwa Capital Markets.  \"The big question is whether they restart QE, and if they don't, we will see a further sell-off in bonds, especially longer-dated ones.\"",
    "Daiwa expects the ECB to announce asset purchases worth 30 billion euros a month for nine months.",
    "Expectations for stimulus to boost weak growth are high, so the risk is that the ECB disappoints markets and its action pushes up borrowing costs, rather than lowers them.",
    "The Ifo institute on Thursday cut its 2019 growth forecast for Germany and said a recession would hit Europe's largest economy in the third quarter, the latest gloomy forecast raising pressure on the ECB to loosen policy. ",
    "Even after the recent sell-off, bond yields remain deeply negative, which itself limits the impact of rate cuts.",
    "Italy on Thursday sold the top planned amount of 7.75 billion euros ($9 billion) at an auction, paying the lowest-ever seven-year yield. ",
    "\"Given the depth of negative rates in Europe, you wonder how moving them more negative would help,\" said Mark Heppenstall, CIO at Penn Mutual Asset Management.",
    "Germany's 10-year bond yield was a tad lower on the day at -0.57% . Even signs of a thaw in U.S.-China trade tensions failed to shake the safe-haven bond market before the ECB meets. ",
    "Bund yields are 17 bps above early September's record lows, but still down 80 bps this year.",
    "Central bank chiefs from Germany, France, the Netherlands and Austria have all expressed scepticism about the need for fresh QE recently. That has weighed on long-dated bonds in particular, and helped nudge 30-year German yields back towards positive territory .",
    "\"If you saw an absence of a QE announcement or significant dilution, I would expect that to weigh on yields in the longer end,\" said Richard McGuire, head of rates strategy at Rabobank.",
    "\"But it is difficult to ascertain how much of this is priced in, as there are other factors weighing on Bund yields and demand for safe havens, geopolitical risks around the trade war, and Brexit.\""
  ],
  "published_datetime": "2019-09-12 03:19:00"
}