{
  "url": "https://www.nasdaq.com/article/us-audit-regulator-levied-only-65-mln-in-fines-in-16-years-20190905-00330",
  "title": "U.S. audit regulator levied only $6.5 mln in fines in 16 years - Nasdaq.com",
  "text": [
    "By Katanga Johnson",
    "WASHINGTON, Sept 5 (Reuters) - A top U.S. accounting watchdog has brought only 18 enforcement actions and levied just $6.5 million in fines against the Big Four accounting firms in its 16-year existence, according to a study published on Thursday.",
    "The report by the Project On Government Oversight (POGO) claims the Public Company Accounting Oversight Board (PCAOB), which oversees audit firms that are supposed to help keep publicly traded companies in check, is falling down on the job.",
    "The Washington-based group's analysis of 16 years' of PCAOB inspection reports on the U.S. arms of the Big Four audit firms - Deloitte & Touche, Ernst & Young, PricewaterhouseCoopers and KPMG - found the regulator identified 808 instances in which the firms issued defective audits.",
    "But the agency has only brought 18 enforcement cases related to 21 audits against the Big Four. The Big Four audit 99% of companies in the S&P 500, according to POGO.",
    "Created by the 2002 Sarbanes-Oxley Act as a private-sector nonprofit corporation, the PCAOB is tasked with policing the accounting firms that sign off on the books of the nation's listed companies. Sarbanes-Oxley aimed to tighten controls on the auditing industry following a string of accounting scandals, most notably the 2001 collapse of energy company Enron Corp.",
    "Thursday's study comes after a long-anticipated shake-up at the regulator in January 2018 that led to the replacement of James Doty as the chairman and the appointment of four new board members. Unlike many other agency roles, the chairman of the PCAOB does not require confirmation by the Senate.",
    "POGO's report did not provide any breakdown of enforcement actions taken when Doty was the chairman and after he was replaced.",
    "According to the report, under its powers the agency could have fined the Big Four a minimum of $1.6 billion, but public records indicate fines of only $6.5 million.",
    "\"It's unacceptable that the agency is taking such a light-handed approach in holding these large audit firms accountable,\" said POGO's executive director, Danielle Brian. \"Exercising financial penalties against these firms might be the only way to get this industry on track. By failing to hold the Big Four accountable, the board is putting all Americans' financial futures in jeopardy.\"",
    "The Securities and Exchange Commission oversees the PCAOB and also has the authority to inspect and fine auditors in breach of the rules. It has brought steep fines in the past.",
    "Some industry advocates and former PCAOB board members say the regulator should not be held to the same standard as the SEC and that its primary function is not to bring enforcement actions but to help raise the quality of audits.",
    "In its report, POGO cites written comment sought from PCAOB spokesperson Torrie Matous who said that due to resource constraints the regulator is selective about the enforcement cases it pursues.",
    "\"Not every inspection-related deficiency rises to such a level of severity that it should result in an enforcement investigation or the institution of an enforcement proceeding,\" Matous wrote, according to POGO."
  ],
  "published_datetime": "2019-09-05 07:00:00"
}