{
  "url": "https://www.nasdaq.com/article/momos-new-app-goes-viral-but-sparks-privacy-concerns-cm1207170",
  "title": "Momo's New App Goes Viral but Sparks Privacy Concerns - Nasdaq.com",
  "text": [
    " Chinese tech company   Momo    (NASDAQ: MOMO) recently launched Zao, a face-swapping app powered   by artificial intelligence that lets users insert themselves into   clips of popular TV shows and movies with a single selfie. It   quickly went viral and became the most downloaded free iOS app in   China, according to App Annie. Yet Zao immediately faced a user backlash regarding its   privacy agreement, which grants Momo a \"free, irrevocable,   permanent, transferable, and relicensable\" license to all its   user-created content. In other words, Momo could own users' faces   and license their images to other companies.   Image source: Getty Images.makeArticleAd();  Momo responded by saying that it would only use users' photos   to improve the app and that users could delete their data.   However, the company also owns the popular dating apps Momo and   Tantan -- and it's unclear whether Zao's data will be shared with   those platforms. Zao's popularity also raises fresh concerns   about \"deepfake\" videos blurring the lines between fantasy and   reality. How does Momo make money? To understand why Momo launched Zao, we should first   understand its core business. Momo generated 93% of its revenue   last quarter from its namesake app. Momo helps users find each   other based on their interests and locations, and it's widely   used as a dating app. Its revenue surged after it added live   videos in 2015, allowing users to buy virtual gifts for their   favorite video creators. Tantan, which generated the remaining 7% of revenue, is a   Tinder clone that Momo acquired last May. Tinder's parent company   Match Group    (NASDAQ: MTCH) sued Tantan over the similarities between the   apps, and Tantan agreed to pay Match royalties to retain key   features like swiping left and right. Momo and Tantan both offer   premium subscription tiers (comparable to Tinder Plus and Tinder   Gold) that add improved search and exposure features. Momo generates three-quarters of its total revenue from its   live video ecosystem, and the rest comes from subscriptions, ads,   and mini games in Momo. Momo's growth in revenue, MAUs (monthly   active users) on its main app, and paid users on both platforms   consistently grew over the past year.  YOY = Year-over-year. MAUs = monthly active users. Data   source: Momo quarterly reports. Momo's growth hit speed bumps in April and May after Chinese   regulators   ordered the removal of its Tantan app    from Chinese app stores,   Apple    suspended in-app payments in Tantan, and the company temporarily   suspended news-feed posts on both apps for an internal   review. Those troubles were reportedly caused by ads for prostitution   popping up across its network. Momo was slammed by China's state   media several years ago for being the preferred app for sex   workers, so the new allegations opened up some old wounds. Why Momo launched Zao Momo's apps were fully restored at the end of its second   quarter in late July. However, the painful experience suggested   that Momo was too heavily dependent on dating apps. Live video   platforms have also been   closely scrutinized by Chinese regulators    over allegations of inappropriate and pornographic content. That's where Zao comes in. It's completely different from Momo   and Tantan, and it cleverly encourages users to share their fake   videos -- nurturing the app's viral growth.   Zao. Image source: Zao.  Yet Momo didn't mention Zao or its developer Changsha   Shenduronghe Network Technology (a fully owned subsidiary of   Momo) in its   latest conference call    . That silence indicates that Zao is an experimental app that   gained much more momentum than Momo anticipated. Momo hasn't explained how it plans to monetize Zao, but the   app only comes with a few pre-rendered videos for users -- so it   could potentially sell additional clips. Momo could also convince   companies to launch free sponsored videos for the platform --   which would resemble   Snap    's strategy for sponsored lenses and filters. It could also   integrate Zao's videos with Momo and Tantan to boost user   engagement rates. The bottom line I've   repeatedly stated    that Momo is an undervalued   growth stock    , as a company with plenty of irons in the fire. Zao is now one   of those irons. It could evolve into a new revenue stream if Momo   plays its cards right and quickly addresses users' privacy   concerns.   10 stocks we like better than Momo       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Momo wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Leo Sun      owns shares of AAPL and SNAP. The Motley Fool owns shares of     and recommends AAPL and Match Group. The Motley Fool has the     following options: short January 2020 $155 calls on AAPL, long     January 2020 $150 calls on AAPL, short January 2020 $155 calls     on AAPL, and long January 2020 $150 calls on AAPL. The Motley     Fool recommends Momo. The Motley Fool has a     disclosure policy      .  ",
    "Chinese tech company   Momo    (NASDAQ: MOMO) recently launched Zao, a face-swapping app powered   by artificial intelligence that lets users insert themselves into   clips of popular TV shows and movies with a single selfie. It   quickly went viral and became the most downloaded free iOS app in   China, according to App Annie.",
    "Yet Zao immediately faced a user backlash regarding its   privacy agreement, which grants Momo a \"free, irrevocable,   permanent, transferable, and relicensable\" license to all its   user-created content. In other words, Momo could own users' faces   and license their images to other companies.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Momo responded by saying that it would only use users' photos   to improve the app and that users could delete their data.   However, the company also owns the popular dating apps Momo and   Tantan -- and it's unclear whether Zao's data will be shared with   those platforms. Zao's popularity also raises fresh concerns   about \"deepfake\" videos blurring the lines between fantasy and   reality.",
    "To understand why Momo launched Zao, we should first   understand its core business. Momo generated 93% of its revenue   last quarter from its namesake app. Momo helps users find each   other based on their interests and locations, and it's widely   used as a dating app. Its revenue surged after it added live   videos in 2015, allowing users to buy virtual gifts for their   favorite video creators.",
    "Tantan, which generated the remaining 7% of revenue, is a   Tinder clone that Momo acquired last May. Tinder's parent company   Match Group    (NASDAQ: MTCH) sued Tantan over the similarities between the   apps, and Tantan agreed to pay Match royalties to retain key   features like swiping left and right. Momo and Tantan both offer   premium subscription tiers (comparable to Tinder Plus and Tinder   Gold) that add improved search and exposure features.",
    "Momo generates three-quarters of its total revenue from its   live video ecosystem, and the rest comes from subscriptions, ads,   and mini games in Momo. Momo's growth in revenue, MAUs (monthly   active users) on its main app, and paid users on both platforms   consistently grew over the past year.",
    "YOY = Year-over-year. MAUs = monthly active users. Data   source: Momo quarterly reports.",
    "Momo's growth hit speed bumps in April and May after Chinese   regulators   ordered the removal of its Tantan app    from Chinese app stores,   Apple    suspended in-app payments in Tantan, and the company temporarily   suspended news-feed posts on both apps for an internal   review.",
    "Those troubles were reportedly caused by ads for prostitution   popping up across its network. Momo was slammed by China's state   media several years ago for being the preferred app for sex   workers, so the new allegations opened up some old wounds.",
    "Momo's apps were fully restored at the end of its second   quarter in late July. However, the painful experience suggested   that Momo was too heavily dependent on dating apps. Live video   platforms have also been   closely scrutinized by Chinese regulators    over allegations of inappropriate and pornographic content.",
    "That's where Zao comes in. It's completely different from Momo   and Tantan, and it cleverly encourages users to share their fake   videos -- nurturing the app's viral growth.",
    "  Zao. Image source: Zao. ",
    "Zao. Image source: Zao.",
    "Yet Momo didn't mention Zao or its developer Changsha   Shenduronghe Network Technology (a fully owned subsidiary of   Momo) in its   latest conference call    . That silence indicates that Zao is an experimental app that   gained much more momentum than Momo anticipated.",
    "Momo hasn't explained how it plans to monetize Zao, but the   app only comes with a few pre-rendered videos for users -- so it   could potentially sell additional clips. Momo could also convince   companies to launch free sponsored videos for the platform --   which would resemble   Snap    's strategy for sponsored lenses and filters. It could also   integrate Zao's videos with Momo and Tantan to boost user   engagement rates.",
    "I've   repeatedly stated    that Momo is an undervalued   growth stock    , as a company with plenty of irons in the fire. Zao is now one   of those irons. It could evolve into a new revenue stream if Momo   plays its cards right and quickly addresses users' privacy   concerns.",
    "  10 stocks we like better than Momo       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Momo wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Momo       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Momo wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Leo Sun      owns shares of AAPL and SNAP. The Motley Fool owns shares of     and recommends AAPL and Match Group. The Motley Fool has the     following options: short January 2020 $155 calls on AAPL, long     January 2020 $150 calls on AAPL, short January 2020 $155 calls     on AAPL, and long January 2020 $150 calls on AAPL. The Motley     Fool recommends Momo. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:52:42"
}