{
  "url": "https://www.nasdaq.com/article/celgene-celg-outpaces-stock-market-gains-what-you-should-know-cm1210772",
  "title": "Celgene (CELG) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " In the latest trading session, Celgene (CELG) closed at $98.41, marking a +0.78% move from the previous day. This change outpaced the S&P 500's 0.72% gain on the day. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%. Prior to today's trading, shares of the biotechnology company had gained 3.66% over the past month. This has outpaced the Medical sector's loss of 1.41% and the S&P 500's gain of 2.25% in that time. CELG will be looking to display strength as it nears its nex t earnings  release. In tha t report  , analysts expect CELG to post earnings of $2.73 per share. This would mark year-over-year growth of 19.21%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $4.46 billion, up 14.55% from the year-ago period. Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $10.91 per share and revenue of $17.44 billion. These totals would mark changes of +23% and +14.11%, respectively, from last year. Investors should also note any recent changes to analyst estimates for CELG. These revisions help to show the ever-changing nature of near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. CELG is holding a Zacks Rank of #3 (Hold) right now. Investors should also note CELG's current valuation metrics, including its Forward P/E ratio of 8.95. For comparison, its industry has an average Forward P/E of 23.98, which means CELG is trading at a discount to the group. Investors should also note that CELG has a PEG ratio of 0.42 right now. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Medical - Biomedical and Genetics industry currently had an average PEG ratio of 1.71 as of yesterday's close. The Medical - Biomedical and Genetics industry is part of the Medical sector. This industry currently has a Zacks Industry Rank of 79, which puts it in the top 31% of all 250+ industries. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. You can find more information on all of these metrics, and much more, on Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Celgene Corporation (CELG): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "In the latest trading session, Celgene (CELG) closed at $98.41, marking a +0.78% move from the previous day. This change outpaced the S&P 500's 0.72% gain on the day. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%.",
    "Prior to today's trading, shares of the biotechnology company had gained 3.66% over the past month. This has outpaced the Medical sector's loss of 1.41% and the S&P 500's gain of 2.25% in that time.",
    "CELG will be looking to display strength as it nears its nex t earnings  release. In tha t report  , analysts expect CELG to post earnings of $2.73 per share. This would mark year-over-year growth of 19.21%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $4.46 billion, up 14.55% from the year-ago period.",
    "Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $10.91 per share and revenue of $17.44 billion. These totals would mark changes of +23% and +14.11%, respectively, from last year.",
    "Investors should also note any recent changes to analyst estimates for CELG. These revisions help to show the ever-changing nature of near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.",
    "Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. CELG is holding a Zacks Rank of #3 (Hold) right now.",
    "Investors should also note CELG's current valuation metrics, including its Forward P/E ratio of 8.95. For comparison, its industry has an average Forward P/E of 23.98, which means CELG is trading at a discount to the group.",
    "Investors should also note that CELG has a PEG ratio of 0.42 right now. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Medical - Biomedical and Genetics industry currently had an average PEG ratio of 1.71 as of yesterday's close.",
    "The Medical - Biomedical and Genetics industry is part of the Medical sector. This industry currently has a Zacks Industry Rank of 79, which puts it in the top 31% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "You can find more information on all of these metrics, and much more, on Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:50:15"
}