{
  "url": "https://www.nasdaq.com/article/preciousgold-slides-2-silver-sheds-4-on-trade-optimism-strong-us-data-20190905-00830",
  "title": "PRECIOUS-Gold slides 2%, silver sheds 4% on trade optimism, strong U.S. data - Nasdaq.com",
  "text": [
    "    * Palladium sole gainer, up 0.6%",
    "* U.S., China to hold high-level trade talks in October (Adds comments, details, updates prices)",
    "By Asha Sistla and Arpan Varghese",
    "Spot gold XAU= fell 2.1% to $1,520.60 per ounce at 11:34a.m. EDT (1534 GMT) and silver fell 4% to $18.79 per ounce,after having earlier dipped as low as $1,509.03 and $18.48,respectively, with both set for their worst daily percentagedecline in more than 2-1/2 years.",
    "U.S. gold futures GCcv1 dropped 2% to $1,528.90 per ounce.",
    "Platinum also declined about 2.4% to $962.00 per ounce,after having touched a low for the day of $940.50.",
    "Data showing U.S. private employers' payrolls rose and U.S.services sectors growth accelerated in August boosted stockmarkets, which were already buoyed by positive signs onU.S.-China trade.  MKTS/GLOBurn:newsml:reuters.com:*:nN9N24I001",
    "\"The gold market trading at highs was ambushed by strongU.S. data from ADP to ISM; the data also savaged a frothy bondmarket, which helped drive the slide in gold,\" said Tai Wong,head of base and precious metals derivatives trading at BMO.",
    "Driving hopes of a thaw in the protracted dispute betweenthe world's two largest economies, China's Commerce Ministryconfirmed high-level trade discussions with the United Statesset for early October. urn:newsml:reuters.com:*:nL3N25W0JF",
    "\"The risk sentiment that was sparked by the ebbing tradesituation is leading to gold market participants to take some oftheir bets off,\" said Daniel Ghali, commodity strategist at TDSecurities.",
    " The changes in gold and Treasury yields are both symptomsof the same economic circumstances, Ghali said. \"The longeryields are rising because growth expectations are.\"",
    " Treasury yields jumped on the positive developments onU.S.-China trade as well as the strong U.S. data. US/",
    " Investors will now turn their attention to the U.S. nonfarmpayrolls data on Friday for further clarity on the U.S. economichealth. ",
    "With additional positive payrolls data, \"you could see afurther retreat from bonds and gold,\" BMO's Wong said.",
    "\"But barring a stunning trade resolution it remains abullish bond market in the U.S. due in large part to the factthat yields in the rest of the developed world are practicallynon-existent. Gold might correct but the overall positiveoutlook will remain,\" Wong added.",
    "Palladium was the sole gainer, rising 0.6% to $1,561.93 perounce, having hit $1,567.68 its highest in more than 1-1/2months earlier in the session. (Reporting by Arpan Varghese and Asha Sistla in Bengaluru;editing by Bill Berkrot) ((Asha.Sistla@thomsonreuters.com; If within U.S. +1 646 2238780; outside U.S. +91 80 6749 5072; Reuters Messaging: ReutersMessaging: asha.sistla.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-05 12:22:00"
}