{
  "url": "https://www.nasdaq.com/article/for-rite-aid-stock-everything-depends-on-millennials-cm1210757",
  "title": "For Rite Aid Stock, Everything Depends on Millennials - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "It's a rare moment when a losing call on volatile Rite Aid (NYSE: RAD ) makes you a 28% profit. Let me explain: Back on Aug.7, I made a ridiculous statement that buying RAD stock for a short-term bet wasn't as crazy as initial looks might suggest. However, the markets made my bullishness look incredibly foolish very quickly.",
    "Near mid-August, the embattled pharmacy retailer announced an executive shakeup. Former CEO John Standley stepped down from the top post. In his place came Heyward Donigan , who previously served as CEO for Sapphire Digital. During her time leading the company, she led the organization to record growth and consumer engagement.",
    "Under ordinary circumstances, Donigan would be a welcome lift to Rite Aid stock. After all, the once-powerful pharmacy retailer has massive competition. We're not just talking about peers, such as CVS Health (NYSE: CVS ) or Walgreens Boots Alliance (NASDAQ: WBA ). Instead, the RAD stock price is under pressure from disruptive names like Amazon (NASDAQ: AMZN ).",
    "In that context, perhaps the fallout in shares wasn't surprising. When Rite Aid announced Donigan as CEO, the RAD stock price was hovering just above $7. Just a few days later, the equity hit a multi-year low of $5.27. With that, my speculative thesis blew up in my face.",
    "But before the rounds of \"I told you so's\" could flood my inbox, Rite Aid stock started to turn around. From Aug. 27, the equity veritably skyrocketed, gaining nearly 75% to the close of Sept. 10. That made me look less foolish, for which I'm grateful.",
    "But what about RAD stock? Is there still an opportunity here after such a mercurial rise?",
    "Like most market investments, the answer depends on millennials. As the largest generation in the workforce, this demographic essentially enjoys the China narrative: they're emerging as a true political and economic force, and there are a lot of them.",
    "Better yet, millennials bring many potential positives for Rite Aid stock and the broader pharmacy business. For one thing, their sheer numbers bring robust dollars into the mix. More significantly, 45% of millennials prefer using over-the-counter drugs versus depending on a doctor for a prescription.",
    "This is one stat for which Donigan and her team must focus on. She has a clear opportunity to convert visitors to sales.",
    "And they will come. Based on the Amazon Counter deal that I referenced in last month's story, this will incentivize a new breed of consumers to visit Rite Aid stores. I wrote that \" Amazon shoppers are young , tech savvy, and  make serious bank .\" This is exactly the type of demo that you need to get RAD stock out of its funk.",
    "Unfortunately, some bad news exists for Rite Aid stock as well. According to MarketingCharts.com , millennials are the most price-sensitive generation for consumer-packaged goods. For instance, millennials more so than any other generation are likely to buy over-the-counter meds on sale as opposed to their preferred brands.",
    "Obviously, the easy answer is to pump out some discounts to attract and secure millennial shoppers. But nothing associated with RAD stock is easy. Primarily, the company does not have the margins to play the discount game for a prolonged period.",
    "Therefore, Rite Aid stock is a race: can management attract and retain enough millennial shoppers to justify an initial cut to margins? This is not a believable route for many investors, and that's why they dumped shares.",
    "Given the recent and dramatic changes in the RAD stock price, we have several ways to approach shares. First, if you made that 75% profit that I referenced earlier, congratulations! Now, it's time to dump out.",
    "Even if you made the smaller 28% profit, it's time to sell. Certainly, you don't want to get greedy with a volatile investment like Rite Aid stock.",
    "On the other hand, if you're approaching shares now, I'd wait. For starters, it's unlikely that RAD stock will continue to make double-digit jumps. Second, some stats, like the excessive institutional ownership worries me in this present context. If insiders panic, RAD will plummet faster than you can hit the \"sell\" button.",
    "Third, Rite Aid is scheduled to release their second quarter of fiscal 2020 earnings report near September end. I don't want to have excessive exposure here, especially since RAD stock can go anywhere following this report.",
    "But after that dust clears, the pharmacy giant might get interesting again. As I said, it really depends on whether Donigan can convert millennials. It's a herculean task, to be sure. But the opportunity is there, which represents the longer-term speculative case for Rite Aid stock.",
    "As of this writing, Josh Enomoto did not hold a position in any of the aforementioned securities.",
    "The post For Rite Aid Stock, Everything Depends on Millennials appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:12:22"
}