{
  "url": "https://www.nasdaq.com/article/validea-motley-fool-strategy-daily-upgrade-report-952019-cm1207700",
  "title": "Validea Motley Fool Strategy Daily Upgrade Report - 9/5/2019 - Nasdaq.com",
  "text": [
    "The following are today's upgrades for Validea's Small-Cap Growth Investor model based on the published strategy of Motley Fool . This strategy looks for small cap growth stocks with solid fundamentals and strong price performance.",
    "PARK AEROSPACE CORP ( PKE ) is a small-cap growth stock in the Aerospace & Defense industry. The rating according to our strategy based on Motley Fool changed from 53% to 80% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Park Aerospace Corp., formerly Park Electrochemical Corp., is an aerospace company. The Company develops and manufactures solution and hot-melt advanced composite materials used to produce composite structures for the global aerospace markets. The Company's advanced composite materials include film adhesives (undergoing qualification) and lightning strike materials. It offers an array of composite materials designed for hand lay-up or automated fiber placement (AFP) manufacturing applications. Its advanced composite materials are used to produce primary and secondary structures for jet engines, large and regional transport aircraft, military aircraft, Unmanned Aerial Vehicles, business jets, general aviation aircraft and rotary wing aircraft. It offers specialty ablative materials for rocket motors and nozzles and specially designed materials for radome applications. It designs and fabricates composite parts, structures and assemblies and low volume tooling for the aerospace industry.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "Since its inception, Validea's strategy based on Motley Fool has returned 571.37% vs. 195.52% for the S&P 500. For more details on this strategy, click here",
    "About Motley Fool : Brothers David and Tom Gardner often wear funny hats in public appearances, but they're hardly fools -- at least not the kind whose advice you should readily dismiss. The Gardners are the founders of the popular Motley Fool web site, which offers frank and often irreverent commentary on investing, the stock market, and personal finance. The Gardners' \"Fool\" really is a multi-media endeavor, offering not only its web content but also several books written by the brothers, a weekly syndicated newspaper column, and subscription newsletter services.",
    "About Validea : Validea is an investment research service that follows the published strategies of investment legends. Validea offers both stock analysis and model portfolios based on gurus who have outperformed the market over the long-term, including Warren Buffett, Benjamin Graham, Peter Lynch and Martin Zweig. For more information about Validea, click here",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 08:04:16"
}