{
  "url": "https://www.nasdaq.com/article/its-the-economy-stupid--sometimes-20190911-00535",
  "title": "It's the economy, stupid – sometimes - Nasdaq.com",
  "text": [
    "By Edward Hadas",
    "(The author is a Reuters Breakingviews columnist.)",
    "LONDON, Sept 11 (Reuters Breakingviews) - These days, many watchers of politics are quasi-Marxists. Like the eponymous 19th century German thinker, they are confident economic factors determine the course of history. Their slogan could be former U.S. President Bill Clinton's: \"It's the economy, stupid\". But as with many tenets of economics, it's not that simple.",
    "In this theory, it is not the economy itself which drives history but people's feelings about their economic prospects. Voters who are rich by historical standard may still feel hard done by if they perceive their incomes are not rising fast enough or their career outlooks are poor.  Jealousy of more luxurious lifestyles can also induce bitter feelings, and support for outsiders at the ballot box.",
    "The Marxists and quasi-Marxists are not worried when voters deny that their political views are shaped by the economy, because the pressure is supposed to exerted at an unconscious level.",
    "The big problem with this line of argument is that a cause-and-effect relationship between economics and politics is unprovable. As statisticians never tire of pointing out, correlations, say between GDP growth rates and election results, do not demonstrate causality.",
    "This critique could hardly be more pertinent. It is central, for example, to attempts to identify President Donald Trump's appeal. Brian Schaffner of Tufts University tried to answer that question by studying voters in the 2016 U.S. presidential election. He found that the more unhappy they were about their personal economic situations, the more likely they were to vote for Trump. That's one for the economic Marxist-determinists.",
    "But Schaffner also found that what he described as racist and sexist attitudes were correlated with Trump votes among white people. He could have added lower levels of education and higher levels of religious practice. That makes it plausible that economic factors could be secondary.",
    "A similar mystery surrounds the prospective British departure from the European Union. Researchers from the University of Warwick determined that voting to leave the EU in the 2016 referendum was associated with \"unemployment, or employment in certain industries such as manufacturing\". In other words, economic issues were important.",
    "However, there were also correlations with \"older age, white ethnicity, low educational attainment … adverse health and low life satisfaction\". Non-economic factors were relevant too.",
    "In Russia, meanwhile, President Vladimir Putin's popularity has been dented by an effort to increase the retirement age, an economic issue. Yet it is much harder to discern the relative political importance of the economic pain caused by sanctions against his regime and national pride in Putin's tough image on the world stage and his government's sanctions-causing behaviour.",
    "The political impact of economic discontent could well be tested soon in several other countries. Most notably, the China-U.S. trade war makes both countries vulnerable to economic disappointments.",
    "On the American side, the quasi-Marxists argue that a trade-related slowdown would drive many Trump supporters to turn against the incumbent in the 2020 presidential election. There are no equivalent elections in China, but economic logic suggests that slowing GDP growth will bring popular unrest, and not just in Hong Kong.",
    "Returning to the UK's ongoing political dysfunction, a sudden departure from the EU without a trade deal - the so-called hard Brexit - would immediately take some goods off the shelves, and could be followed by years of economic attrition. In response, British voters might revolt against the proponents of Brexit as the people who led them into the mess.",
    "Such a quasi-Marxist reaction is certainly possible, but it is far from certain. Ideas can matter as much as or even more than money. In some circumstances, greater economic bitterness might breed greater political loyalty rather than rebellion. Some people who want to restore lost national greatness, reject a society's cultural values, or object to repression are willing to suffer economically in the service of other goals.",
    "Even such campaigners surely prefer prosperity, but the lesson for politicians is clear. A weak economy is bad for you, because some voters will blame you for their hardship. But a flourishing economy is no guarantee of success because, for others, ideas and ideals can be more important.",
    "\nOn Twitter\n"
  ],
  "published_datetime": "2019-09-11 10:33:00"
}