{
  "url": "https://www.nasdaq.com/article/aurora-cannabis-stock-still-eyeing-8-cm1210720",
  "title": "Aurora Cannabis Stock Still Eyeing $8 - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "A few weeks ago I shared an opinion on Aurora Cannabis (NYSE: ACB ) stock when it had upside potential. The celebration was short since after a just a brief pop, the whole cannabis sector fell apart in heavy selling. ACB, Canopy Growth (NYSE: CGC ), Cronos (NYSE: CRON ), and ETFMG Alternative Harvest ETF (NYSEARCA: MJ ) stocks all fell 10% to 20% in a matter of hours.",
    " Needless to say, consequently, the ACB stock bulls left a $3 potential spike on the table. The good news is that they have since found footing and now again there is another upside opportunity in the making.",
    "The pot stocks are still in the process of recovering the losses. Aurora Cannabis stock looks relatively strong among them in this effort. Even with its recent misfortunes, Aurora Cannabis stock is still up 21% year-to-date. So a few bad days on a chart don't necessarily kill the whole story of a stock.",
    "In my last Aurora Cannabis stock write-up, I also noted that equities in general were headed into geopolitical headline hell, so it was a risky trade at the time. The idea was that ACB had support below $6 per share so that the bulls had a solid base from which to spring.",
    "The good news is that this latest test proved that support held. In spite of resistance above, there should be another attempt at a rally in ACB stock even from here.",
    "For almost four months, Aurora Cannabis stock has slid inside a descending channel of lower highs and lower lows. This last dip from mid-August may have forced the issue because it formed a short-term bottom.",
    "If so, then all the ACB bulls need to do is maintain a series of higher highs to close above $6.4 per share. Then they would retake the reins and have the opportunity to finally breakout from the descending trend. The result would be the opportunity to target $8 per share or higher. Aurora Cannabis is a momentum stock so it runs fast enough that they could plow through resistance.",
    "I caution against heavy conviction in this trade. The fundamentals for ACB and the entire sector are horrendous. ACB stock sells at 140 times sales so it is very bloated from the traditional sense. Unless the investor knows otherwise, I treat this like a trade and not an investment and set tight stops.",
    "The important levels below are between $5.9 and $5.6 per share. Below that and ACB could easily lose another dollar, so traders need to be nimble on bad days. Because just like there is upside potential to $8, there is downside risk to $5 or lower.",
    "The mid-term technical oscillators and price-to-moving-averages relationships support the theory that there is an upswing in momentum brewing: One that could fuel this rally in Aurora Cannabis stock. Experts in the field remain unanimous in their optimism.",
    "But again I caution about the nature of the opportunity. This is a speculative stock. Unless the timeline is long for the bet, traders need to be spry and aware of the levels.",
    "These are risky stocks. This is nothing against ACB, but this industry didn't even exist just mere months ago. Furthermore, it is still illegal in the United States. Yes, there are states that have legalized marijuana but the federal government still has not followed suit.",
    "The enthusiasm on Wall Street for these stocks stems from the wide application for cannabis. Recreational use is already popular but investors' interests extend far beyond that. Companies from all industries are interested in cannabis including the medical, cosmetics, dermatology, beverage, food, and many more industries. It's only a matter of time before it finds its way to retail store shelves.",
    "Long term, the game changer source of optimism will probably be a favorable change in U.S. federal law. Imagine what ACB stock and its brethren would do if the U.S. follows Canada and legalizes cannabis nationwide.",
    "Nicolas Chahine is the managing director of  SellSpreads.com . As of this writing, he did not hold a position in any of the aforementioned securities. Join his live chat room for free  here .",
    "The post Aurora Cannabis Stock Still Eyeing $8 appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 12:17:54"
}