{
  "url": "https://www.nasdaq.com/article/us-manufacturing-contracts-as-trade-war-with-china-bites-20190903-00958",
  "title": "U.S. manufacturing contracts as trade war with China bites - Nasdaq.com",
  "text": [
    "By Lucia Mutikani",
    "WASHINGTON, Sept 3 (Reuters) - U.S. manufacturing activity contracted for the first time in three years in August, with new orders and hiring declining sharply as trade tensions weighed on business confidence, raising financial market fears of a recession.",
    "Concerns about the economy, which is in its longest expansion ever, were also exacerbated by other data on Tuesday showing construction spending barely rising in July. The reports somewhat offset last week's upbeat data on consumer spending that had suggested that while the economy was slowing, it was not losing momentum as rapidly as financial markets were flagging.",
    "\"The canary in the mine may be falling off its perch,\" said Joel Naroff, chief economist at Naroff Economic Advisors in Holland, Pennsylvania. \"With manufacturing now starting to contract, it is even more critical that the consumer keeps spending.\"",
    "The Institute for Supply Management (ISM) said its index of national factory activity dropped to a reading of 49.1 last month from 51.2 in July. A reading below 50 indicates contraction in the manufacturing sector, which accounts for about 12% of the U.S. economy. Last month marked the first time since August 2016 that the index broke below the 50 threshold.",
    "August's reading was also the lowest since January 2016 and was the fifth straight monthly decline in the index. The United States now joins the euro zone, Japan, the United Kingdom and China, which have long been experiencing a contraction in factory activity.",
    "Still, the ISM index remains above the 43 level, which economists associate with a recession. The U.S.-China trade tensions also coincide with diminishing stimulus from last year's $1.5 trillion tax cut package.",
    "The ISM said there had been \"a notable decrease in business confidence,\" adding that \"trade remains the most significant issue, indicated by the strong contraction in new export orders.\" Economists polled by Reuters had forecast the ISM index would slip to 51.0 in August.",
    "The U.S.-China trade fight is eroding business sentiment, with business investment contracting in the second quarter for the first time in more than three years. That, together with an inventory bloat, is undercutting manufacturing, with output declining for two straight quarters.",
    "Consumers have largely shrugged off the trade dispute and continued to spend, propping up the economy. But that could change with the trade war spilling over to shopping malls.",
    "A new round of U.S. tariffs on imports of Chinese goods, mostly consumer products like clothing, footwear and televisions, took effect on Sept. 1. Additional U.S. tariffs are due to be imposed in December.",
    "With trade tensions simmering in the background, the Federal Reserve is expected to cut interest rates again this month to keep the economic expansion, now in its 11th year, on track.",
    "The Fed lowered its short-term interest rate by 25 basis points in July for the first time since 2008, citing trade tensions and slowing global growth. Financial markets have fully priced in another quarter-percentage-point cut at the Fed's Sept. 17-18 policy meeting.",
    "U.S. Treasury prices rose on the factory data, with the yield in the benchmark 10-year note dropping to its lowest since July 2016. The Treasury yield curve has inverted, signaling that a recession is looming. Stocks on Wall Street fell, while the dollar  was little changed against a basket of currencies. ",
    "ORDERS TUMBLE",
    "The ISM's forward-looking new orders sub-index dropped to a reading of 47.2 last month, the lowest level since June 2012, from 50.8 in July. A measure of export orders plunged 4.8 points to the lowest level since April 2009.",
    "The survey's factory employment tumbled to 47.4, the weakest reading since March 2016, from 51.7 in July. This raises the risk that factory payrolls contracted in August. Manufacturers cut hours in July, pushing the factory workweek to its lowest level since November 2011. Factories also cut overtime in July.",
    "The government will publish August's employment report on Friday.",
    "\"This (ISM) report is a warning that the tariff and trade uncertainty is continuing to weigh on manufacturing activity, and that this uncertainty is a growing risk to the expansion,\" said John Ryding, chief economist at RDQ Economics in New York.",
    "The ISM said nine industries, including furniture and related products, machinery and chemical products reported growth last month. Transportation equipment, primary metals and electrical equipment, appliances and components were among the seven industries reporting a contraction.",
    "Machinery manufacturers said \"business is starting to show signs of a broad slowdown.\" Electrical equipment, appliances and components makers complained that \"tariffs continue to be a strain on the supply chain and the economy overall.\"",
    "That sentiment resonated across all industries.  Manufacturers of furniture and related products said \"incoming sales seem to be slowing down, and this is usually our busiest season.\"",
    "\"The story up until now has been global manufacturing recession, with the U.S. standing out as the strongest among the weakening players,\" said Chris Low, chief economist at FTN Financial in New York. \"The White House could help enormously by delaying further escalation of the trade conflict.\"",
    "In a separate report on Tuesday, the Commerce Department said construction spending edged up 0.1% in July. Data for June was revised up to show construction outlays decreasing 0.7 instead of falling 1.3% as previously reported.",
    "Economists polled by Reuters had forecast construction spending would rise 0.3% in July. Construction spending fell 2.7% on a year-on-year basis in July. "
  ],
  "published_datetime": "2019-09-03 10:41:00"
}