{
  "url": "https://www.nasdaq.com/article/what-will-square-do-with-its-caviar-money-cm1207646",
  "title": "What Will Square Do With Its Caviar Money? - Nasdaq.com",
  "text": [
    " Along with its second-quarter results,   Square    (NYSE: SQ) announced the sale of its food delivery app, Caviar,   to DoorDash for $410 million in cash and preferred stock. Square   originally acquired Caviar for $90 million in 2014, but it's   unclear how much it may have sunk into it while operating the   service. At the very least, however, selling Caviar provides Square   with a good chunk of capital to reinvest and grow its business.   In its letter to shareholders, management said, \"This transaction   allows us to increase our focus on and investment in our two   large, growing ecosystems -- one for businesses and one for   individuals.\" Here are some areas investors can expect Square to explore   with its new capital infusion.makeArticleAd();   Image source: Square.  On the business side During Square's second-quarter       earnings call    , CEO Jack Dorsey specified the company will initially increase   its investments in sales and marketing, as well as hardware. Selling Caviar to DoorDash will allow Square to focus on   serving restaurants and other food sellers its Square for   Restaurants platform, as well as its Orders API. Square will no   longer be offering both the platform (Square for Restaurants) and   the sales channel (Caviar) for merchants, enabling it to sell   with greater specificity. That should help make its marketing   spend on restaurants more efficient. Square already sees strong return on investment from its   marketing. CFO Amrita Ahuja noted the company's payback period is   still sitting close to three quarters even as it increases its   marketing spend. Specifically, the company sees opportunities to   advertise its entire   ecosystem    of products and services. That's where investments in new   hardware could come into play as well. Square has an opportunity to improve its services in both   restaurants and retail, according to SunTrust Robinson Humphrey   analyst Andrew Jeffrey. \"Investments should bolster capabilities   for large, inventory-intensive retailers where we believe it   currently competes poorly,\" he wrote in a note upgrading the   stock earlier this month. Indeed, offering more inventory   management and multistore services could play into the Square   ecosystem strategy. On the individual side Square's product for individuals is Cash App, which it   disclosed brought in $135 million in adjusted revenue last   quarter. One of the biggest opportunities for Square to increase the   revenue of the app is its Boosts feature. Boosts give discounts   to Cash App users that use their connected Cash Card at specified   merchants. Square foots the bill for nearly all of those   discounts. Along with the sale of Caviar to DoorDash, Square announced   the food delivery service is also supporting the Boost available   in Cash App, which is the first step toward Square's real goal   with the program. Ultimately, Square sees Boosts as an   advertising product for businesses looking to reach the 15   million-plus active Cash App users. Linking the offer directly to   a spending account allows Square to provide a clear picture of   the uplift Boosts really provide merchants. Beyond Boosts, Square has visions of offering more robust   financial services targeted at the   underbanked    . That could mean products like savings accounts or an investing   platform. Ahuja sees the launch of new products as an opportunity   to attract new users, as well as cross-sell the new features to   existing users, which should enable it to grow with minimal   incremental acquisition costs. Cash App has become a significant source of revenue for   Square, accounting for nearly one-quarter of its adjusted revenue   last quarter. Increasing the app's usage and monetization is   becoming nearly as important as growing the merchant side of   things. Meanwhile, Square is cleverly starting to integrate services   across merchants and consumers with features like Square   Installments and Boosts. The more integrated all of its services   become, the stronger the business and the more opportunities it   has to grow. Investors should look for Square to improve its   merchant services -- specifically for restaurants -- as well as   build out new products in Cash App. But the key is how the   company keeps everything integrated into a tight ecosystem in   order to maximize its marketing efficiency and keep scaling the   business.   10 stocks we like better than Square       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Square wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Adam Levy      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Square. The Motley Fool has the     following options: short September 2019 $70 puts on Square. The     Motley Fool has a     disclosure policy      .  ",
    "Along with its second-quarter results,   Square    (NYSE: SQ) announced the sale of its food delivery app, Caviar,   to DoorDash for $410 million in cash and preferred stock. Square   originally acquired Caviar for $90 million in 2014, but it's   unclear how much it may have sunk into it while operating the   service.",
    "At the very least, however, selling Caviar provides Square   with a good chunk of capital to reinvest and grow its business.   In its letter to shareholders, management said, \"This transaction   allows us to increase our focus on and investment in our two   large, growing ecosystems -- one for businesses and one for   individuals.\"",
    "Here are some areas investors can expect Square to explore   with its new capital infusion.",
    "  Image source: Square. ",
    "Image source: Square.",
    "During Square's second-quarter       earnings call    , CEO Jack Dorsey specified the company will initially increase   its investments in sales and marketing, as well as hardware.",
    "Selling Caviar to DoorDash will allow Square to focus on   serving restaurants and other food sellers its Square for   Restaurants platform, as well as its Orders API. Square will no   longer be offering both the platform (Square for Restaurants) and   the sales channel (Caviar) for merchants, enabling it to sell   with greater specificity. That should help make its marketing   spend on restaurants more efficient.",
    "Square already sees strong return on investment from its   marketing. CFO Amrita Ahuja noted the company's payback period is   still sitting close to three quarters even as it increases its   marketing spend. Specifically, the company sees opportunities to   advertise its entire   ecosystem    of products and services. That's where investments in new   hardware could come into play as well.",
    "Square has an opportunity to improve its services in both   restaurants and retail, according to SunTrust Robinson Humphrey   analyst Andrew Jeffrey. \"Investments should bolster capabilities   for large, inventory-intensive retailers where we believe it   currently competes poorly,\" he wrote in a note upgrading the   stock earlier this month. Indeed, offering more inventory   management and multistore services could play into the Square   ecosystem strategy.",
    "Square's product for individuals is Cash App, which it   disclosed brought in $135 million in adjusted revenue last   quarter.",
    "One of the biggest opportunities for Square to increase the   revenue of the app is its Boosts feature. Boosts give discounts   to Cash App users that use their connected Cash Card at specified   merchants. Square foots the bill for nearly all of those   discounts.",
    "Along with the sale of Caviar to DoorDash, Square announced   the food delivery service is also supporting the Boost available   in Cash App, which is the first step toward Square's real goal   with the program. Ultimately, Square sees Boosts as an   advertising product for businesses looking to reach the 15   million-plus active Cash App users. Linking the offer directly to   a spending account allows Square to provide a clear picture of   the uplift Boosts really provide merchants.",
    "Beyond Boosts, Square has visions of offering more robust   financial services targeted at the   underbanked    . That could mean products like savings accounts or an investing   platform. Ahuja sees the launch of new products as an opportunity   to attract new users, as well as cross-sell the new features to   existing users, which should enable it to grow with minimal   incremental acquisition costs.",
    "Cash App has become a significant source of revenue for   Square, accounting for nearly one-quarter of its adjusted revenue   last quarter. Increasing the app's usage and monetization is   becoming nearly as important as growing the merchant side of   things.",
    "Meanwhile, Square is cleverly starting to integrate services   across merchants and consumers with features like Square   Installments and Boosts. The more integrated all of its services   become, the stronger the business and the more opportunities it   has to grow. Investors should look for Square to improve its   merchant services -- specifically for restaurants -- as well as   build out new products in Cash App. But the key is how the   company keeps everything integrated into a tight ecosystem in   order to maximize its marketing efficiency and keep scaling the   business.",
    "  10 stocks we like better than Square       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Square wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Square       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Square wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Adam Levy      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Square. The Motley Fool has the     following options: short September 2019 $70 puts on Square. The     Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:30:00"
}