{
  "url": "https://www.nasdaq.com/article/cricketengland-drop-roy-for-final-ashes-test-20190911-00533",
  "title": "Cricket-England drop Roy for final Ashes test - Nasdaq.com",
  "text": [
    "By Martyn Herman",
    "LONDON, Sept 11 (Reuters) - England have dropped batsman Jason Roy for the fifth and final test against Australia starting at The Oval on Thursday as they try to level the series after failing to claim the Ashes.",
    "The out-of-form Roy is one of two changes to the side that lost the fourth test at Old Trafford on Sunday by 185 runs, with bowler Craig Overton also missing out. ",
    "Australia, who retained the Ashes by taking a 2-1 series lead in Manchester, make one change with all-rounder Mitchell Marsh coming in to bolster the bowling attack. He replaces Travis Head.",
    "Roy's omission is no great surprise as he has struggled throughout the series having made his test debut in the warm-up match against Ireland.",
    "The one-day specialist was the latest attempt to solve England's opening woes but the gamble has not paid off and he has managed only 110 runs in eight innings with a top score of 31 at Old Trafford when he dropped down the order.",
    "England are trying to avoid a home series defeat by Australia for the first time since 2001.",
    "\"It has not quite gone the way he would have liked but I'm sure he will go away and work hard and come back again. I'm sure he'll have that attitude and try and prove a point,\" England captain Joe Root told a news conference on Wednesday.",
    "ROOT UPBEAT",
    "Root's captaincy, and his form, has come under the spotlight but he sounded an upbeat tone as he looked forward to trying to level the series.",
    "\"There is plenty to play for and the guys are determined to make sure we finish the season 2-2,\" he said.",
    "\"We have not lost anything yet. Of course, we are disappointed not to win the Ashes back but we are fully focused to finish the series 2-2.",
    "\"I know what direction I want to take this team forward. I want to win this game, use this game as a stepping stone and move forward as a group.\"",
    "Root has made three ducks in the series and averages 30 but played down suggestions his batting had suffered because of being captain.",
    "\"It's been a tough year for batting, tough on both sides,\" he said. \"I've not performed how I would have liked but that's part and parcel of test cricket.\"",
    "Despite retaining the Ashes, Australia skipper Tim Paine described the Oval test as a grand final.",
    "\"We are very hungry, we have already spoken a lot about it,\" he told reporters on Wednesday.",
    "\"We came here to win the Ashes not just retain them. As a group last week's result was brilliant and we played very well but the guys are aware this match is bigger than that one, this is our grand final.\"",
    "Explaining the selection of Marsh, he said: \"Bringing in Marsh will ease a little bit of the workload on the bowlers at the end of a long series. It was a tough call on Travis Head who has had a great start to his test career.\"",
    "England: Joe Root (captain), Jofra Archer, Jonny Bairstow (wicketkeeper), Stuart Broad, Rory Burns, Jos Buttler, Sam Curran, Joe Denly, Jack Leach, Ben Stokes, Chris Woakes.",
    "Australia: David Warner, Marcus Harris, Marnus Labuschagne, Steven Smith, Matthew Wade, Mitchell Marsh, Tim Paine (capt & wk), Pat Cummins, Mitchell Starc, Peter Siddle, Josh Hazlewood, Nathan Lyon"
  ],
  "published_datetime": "2019-09-11 09:57:00"
}