{
  "url": "https://www.nasdaq.com/article/4-goldman-sachs-mutual-funds-for-stellar-returns-cm1207221",
  "title": "4 Goldman Sachs Mutual Funds for Stellar Returns - Nasdaq.com",
  "text": [
    " Incepted in 1988, Goldman Sachs Asset Management (GSAM) seeks to provide financial services, including investment and advisory solutions, and risk-management expertise to institutional and individual investors throughout the globe. With more than $1 trillion assets under management, GSAM is considered one of the world's leading financial management companies, with more than 2,000 professionals in 30 offices worldwide. The fund family develops investment strategies with respect to geographical regions, industries and asset classes. Below we share with you four top-ranked Goldman Sachs mutual funds. Each has a  Zacks Mutual Fund Rank #1  (Strong Buy) and is expected to outperform peers in the future. Investors can  click here to see the complete list of funds  .  Goldman Sachs Blue Chip Fund Class C GCGVX  seeks appreciation of capital in the long run. The fund invests the lion's share of its assets in a diverse portfolio of blue-chip companies. Additionally, the fund may invest up to a fifth of its assets in securities of foreign companies. Goldman Sachs Blue Chip Fund Class C has three-year annualized returns of 12.1%. As of June 2019, GCGVX held 50 issues, with 5.16% of its assets invested in Microsoft Corp.  Goldman Sachs Satellite Strategies Portfolio Class A GXSAX  seeks appreciation of capital in the long run. Normally, the fund invests about four-fifths of its assets in 'underlying funds' which its investment advisor believes are invested in satellite asset classes. Goldman Sachs Satellite Strategies Portfolio Class A has three-year annualized returns of 4.2%. Christopher Lvoff is one of the fund managers of GXSAX since 2017.  Goldman Sachs Global Income Fund Investor Shares  GBIRX  aims for high total returns by focusing on current income and capital growth. The fund invests most of its net assets and any borrowings in fixed-income securities of U.S. and non-U.S. companies. Goldman Sachs Global Income Fund Investor Shares has three-year annualized returns of 2.8%. GBIRX has an expense ratio of 0.75% as compared to the category average of 0.82%.  Goldman Sachs Small Cap Equity Insights Fund Investor Class GDSTX  aims for capital growth over the long term. The fund invests majority of its assets in a broadly diversified portfolio of equity investments in small-cap U.S. companies as well as foreign issuers that are traded in the United States. Goldman Sachs Small Cap Equity Insights Fund Investor Class has three-year annualized returns of 10.4%. Len Ioffe is one of the fund managers of GDSTX since 2011. To view the Zacks Rank and past performance of all Goldman Sachs mutual funds, investors can  click here to see the complete list of Goldman Sachs mutual funds  .  Want key mutual fund info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing mutual funds, each week.   Get it free >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Get Your Free (GBIRX): Fund Analysis Report   Get Your Free (GDSTX): Fund Analysis Report   Get Your Free (GXSAX): Fund Analysis Report   Get Your Free (GCGVX): Fund Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Incepted in 1988, Goldman Sachs Asset Management (GSAM) seeks to provide financial services, including investment and advisory solutions, and risk-management expertise to institutional and individual investors throughout the globe.",
    "With more than $1 trillion assets under management, GSAM is considered one of the world's leading financial management companies, with more than 2,000 professionals in 30 offices worldwide. The fund family develops investment strategies with respect to geographical regions, industries and asset classes.",
    "Below we share with you four top-ranked Goldman Sachs mutual funds. Each has a  Zacks Mutual Fund Rank #1  (Strong Buy) and is expected to outperform peers in the future. Investors can  click here to see the complete list of funds  .",
    " Goldman Sachs Blue Chip Fund Class C GCGVX  seeks appreciation of capital in the long run. The fund invests the lion's share of its assets in a diverse portfolio of blue-chip companies. Additionally, the fund may invest up to a fifth of its assets in securities of foreign companies. Goldman Sachs Blue Chip Fund Class C has three-year annualized returns of 12.1%.",
    "As of June 2019, GCGVX held 50 issues, with 5.16% of its assets invested in Microsoft Corp.",
    " Goldman Sachs Satellite Strategies Portfolio Class A GXSAX  seeks appreciation of capital in the long run. Normally, the fund invests about four-fifths of its assets in 'underlying funds' which its investment advisor believes are invested in satellite asset classes. Goldman Sachs Satellite Strategies Portfolio Class A has three-year annualized returns of 4.2%.",
    "Christopher Lvoff is one of the fund managers of GXSAX since 2017.",
    " Goldman Sachs Global Income Fund Investor Shares  GBIRX  aims for high total returns by focusing on current income and capital growth. The fund invests most of its net assets and any borrowings in fixed-income securities of U.S. and non-U.S. companies. Goldman Sachs Global Income Fund Investor Shares has three-year annualized returns of 2.8%.",
    "GBIRX has an expense ratio of 0.75% as compared to the category average of 0.82%.",
    " Goldman Sachs Small Cap Equity Insights Fund Investor Class GDSTX  aims for capital growth over the long term. The fund invests majority of its assets in a broadly diversified portfolio of equity investments in small-cap U.S. companies as well as foreign issuers that are traded in the United States. Goldman Sachs Small Cap Equity Insights Fund Investor Class has three-year annualized returns of 10.4%.",
    "Len Ioffe is one of the fund managers of GDSTX since 2011.",
    "To view the Zacks Rank and past performance of all Goldman Sachs mutual funds, investors can  click here to see the complete list of Goldman Sachs mutual funds  .",
    " Want key mutual fund info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing mutual funds, each week.   Get it free >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:07:00"
}