{
  "url": "https://www.nasdaq.com/article/european-stocks-hit-onemonth-highs-on-news-of-uschina-trade-talks-20190905-00146",
  "title": "European stocks hit one-month highs on news of U.S.-China trade talks - Nasdaq.com",
  "text": [
    "By Tom Arnold",
    "LONDON, Sept 5 (Reuters) - European shares rose to fresh one-month highs and safe-haven assets like gold and the yen fell on Thursday after U.S.-China talks were flagged for October, raising hopes their trade war will de-escalate before it further damages the world economy.",
    "The pan-European STOXX 600 index  was up 0.6% in late morning trading in Europe, a touch lower from earlier levels marking its highest level since Aug. 1. France's CAC 40 index  jumped 0.9% to hit a more than one-month high, outperforming major European bourses, aided by a 6.3% rise in shares of engine maker Safran  after the company upped its full-year profit forecasts.",
    "Pointing to a firmer opening on Wall Street, U.S. stock futures  gained 0.9%.",
    "The Chinese yuan jumped versus the dollar in offshore trade, while safe-haven assets such as gold, the Swiss franc, and the yen fell.",
    "China'sCommerce Ministry said on Thursday that its trade team would consult with their U.S. counterparts in mid-September in preparation for negotiations in early October, hinting at progress in reducing trade friction. ",
    "Both sides agreed to take action to create favourable conditions, the ministry added, without giving more details.",
    "\"The general market tone is driven by the announcement of the meeting of high-ranking officials between China and the U.S,\" said Francois Savary, chief investment officer at Swiss wealth manager Prime Partners.",
    "\"But this is not a sustained move into risk-on mode as nothing concrete has come out of it yet and investors need to wait to see whether the meeting will happen and what the results from it will be.\"",
    "BREXIT NEWS ALSO A POSITIVE",
    "Adding to the upbeat mood, a parliamentary vote in Britain put the brakes on a no-deal exit from the European Union, Hong Kong withdrew a contentious extradition bill that sparked mass protests in the Chinese-ruled city, and weeks of political turmoil in Italy appeared to ease.",
    "\"Since yesterday, there has been limited downside in markets because of what happened in Hong Kong, but now the U.S.-China talks are the story,\" said Masayuki Kichikawa, chief macro strategist at Sumitomo Mitsui Asset Management Co in Tokyo.",
    "\"It's the same about Brexit, which means less downside risk.\"",
    "Any sign that Washington and Beijing are closer to scaling back or resolving their trade dispute would lift a significant burden from the global economy, but many analysts believe the two sides are dug in for a longer and costlier battle.",
    "Weighing on sentiment was data that showed German industrial orders fell more than expected in July on poor demand from abroad, indicating manufacturers in Europe's biggest economy continue to struggle in the third quarter. ",
    "In European stocks, Dassault Aviation  joined Safran in a sharp rise thanks to upbeat earnings updates. Dassault rose 7.9%. News of a $5 billion share buyback sent Equinor  up 8.0%.",
    "UK bank CYBG  slumped 21.3% after saying it expected to increase its provision for legacy payment protection insurance by to 450 million pounds ($552 million).",
    "In currency markets, the British pound surged to a one-week high following a vote by lawmakers to force Prime Minister Boris Johnson to seek a three-month delay to Brexit if he failed to secure a transition agreement with the European Union.",
    "Although the market was supported by relief that a no-deal Brexit seemed to have been averted, political uncertainty remained high as Johnson renewed his efforts to seek an election next month after a first attempt was defeated on Wednesday.",
    "The British currency  rose 0.4% to above $1.23, its highest since Aug. 28 and extending an overnight 1.4% surge, its biggest one-day jump since March.",
    "Against the dollar, the offshore yuan  was slightly stronger at 7.1425 yuan per dollar but well above an intraday high of 7.1213 yuan in Asian trade.",
    "Spot gold  fell 0.7% to $1541.20 per ounce having reached $1,557 on Wednesday, its highest since April 2013. ",
    "The dollar rose 0.17% to 106.60 yen .",
    "The 10-year German Bund  yield rose over 6 basis points to -0.61%, its highest in almost two weeks and above Tuesday's record lows of -0.743%. ",
    "Seizing on recent doubts about whether a European Central Bank stimulus package next week can match expectations, other top-rated euro zone yields also increased , , although the rises were small.",
    "Italian bond yields rose after slipping earlier in the week as investors hoped the formation of a new government could pave the way for greater fiscal responsibility.",
    "The 10-year Italian yield rose 7 bps to 0.88% , off Wednesday's record low of 0.803%.",
    "U.S. West Texas Intermediate crude  was 0.2% down at $56.16 per barrel."
  ],
  "published_datetime": "2019-09-05 04:50:00"
}