{
  "url": "https://www.nasdaq.com/articles/validea-john-neff-strategy-daily-upgrade-report-9-14-2019-2019-09-14",
  "title": "Validea John Neff Strategy Daily Upgrade Report - 9/14/2019 | Nasdaq",
  "text": [
    "The following are today's upgrades for Validea's Low PE Investor model based on the published strategy of John Neff. This strategy looks for firms with persistent earnings growth that trade at a discount relative to their earnings growth and dividend yield.",
    "SILVERCREST ASSET MANAGEMENT GROUP INC (SAMG) is a small-cap value stock in the Investment Services industry. The rating according to our strategy based on John Neff changed from 60% to 79% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Silvercrest Asset Management Group Inc. (Silvercrest) is a full-service wealth management firm focused on providing financial advisory and related family office services to ultra-high net worth individuals and institutional investors. The Company offers a suite of family office services for families seeking oversight of financial affairs. It advises clients on traditional investment strategies focused on equities, fixed income and cash, as well as non-traditional investment strategies, including hedge funds, private equity funds, real estate and commodities. It offers clients an array of investment solutions together with an array of non-proprietary solutions offered by unaffiliated firms selected. Silvercrest's family office services include financial planning; tax planning and preparation; partnership accounting and fund administration; consolidated wealth reporting; estate or trust agency, and art consultancy and management.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "Since its inception, Validea's strategy based on John Neff has returned 322.01% vs. 171.31% for the S&P 500. For more details on this strategy, click here",
    "About John Neff: While known as the manager with whom many top managers entrusted their own money, Neff was far from the smooth-talking, high-profile Wall Streeter you might expect. He was mild-mannered and low-key, and the same might be said of the Windsor Fund that he managed for more than three decades. In fact, Neff himself described the fund as \"relatively prosaic, dull, [and] conservative.\" There was nothing dull about his results, however. From 1964 to 1995, Neff guided Windsor to a 13.7 percent average annual return, easily outpacing the S&P 500's 10.6 percent return during that time. That 3.1 percentage point difference is huge over time -- a $10,000 investment in Windsor (with dividends reinvested) at the start of Neff's tenure would have ended up as more than $564,000 by the time he retired, more than twice what the same investment in the S&P would have yielded (about $233,000). Considering the length of his tenure, that track record may be the best ever for a manager of such a large fund.",
    "About Validea: Validea is an investment research service that follows the published strategies of investment legends. Validea offers both stock analysis and model portfolios based on gurus who have outperformed the market over the long-term, including Warren Buffett, Benjamin Graham, Peter Lynch and Martin Zweig. For more information about Validea, click here",
    "The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
  ],
  "published_datetime": "2019-09-14 11:00:00"
}