{
  "url": "https://www.nasdaq.com/article/us-imposes-duties-on-structural-steel-from-china-mexico-20190905-00017",
  "title": "U.S. imposes duties on structural steel from China, Mexico - Nasdaq.com",
  "text": [
    "WASHINGTON, Sept 5 (Reuters) - The U.S. Commerce Department said on Wednesday it imposed duties on Chinese and Mexican structural steel after making a preliminary determination that producers in both countries had dumped fabricated structural steel on the U.S. market at prices below fair market value.",
    "The department said it imposed duties of up to 141% on Chinese structural steel and up to 31% on Mexican structural steel and will begin collecting cash deposits for imports based on those rates.",
    "Commerce said it had found that imports of Canadian fabricated structural steel did not violate U.S. anti-dumping laws.",
    "Commerce found that one Chinese producer, Modern Heavy Industries (Taicang) Co Ltd, did not dump product into the United States, but it imposed dumping rates of 52% on Wison (Nanton) Heavy Industry Co Ltd and 57.86% on Jinhuan Construction Group Co Ltd. It also assigned a preliminary dumping rate of 141% for all other Chinese fabricators.",
    "Wison (Nantong) Heavy Industry did immediately respond to a request for comment by Reuters.",
    "   Reuters was unable to contact anyone at Jinhuan Construction who could comment on the duties.  ",
    "FINAL REPORT",
    "The Commerce Department is scheduled to release final anti-dumping duties in its fabricated structural steel investigation on or about Jan. 24, 2020. The U.S. International Trade Commission needs to find that American steel fabricators suffered injury from Chinese and Mexican imports for the duties to be locked in place for a five-year period.",
    "Mexico'sEconomy Ministry said the duties imposed on some Mexican structural steel are part of a \"normal investigation ... when an industry feels it is being affected by imports that use unfair practices, such as dumping or subsidies.\"",
    "The Economy Ministry said it would continue to support the affected Mexican firms.",
    "It also underscored that the new duties have no relation to 25% tariffs on imported steel and 10% tariffs on imported aluminum that Trump imposed in March 2018 based on national security grounds. Mexico was exempted from those tariffs in May.",
    "In 2018, U.S. imports of fabricated structural steel were valued at from $722.5 million from Canada, $897.5 million from China, and $622.4 million from Mexico, Commerce said.",
    "The products covered by the investigation are prefabricated from beams, girders, columns plates and flanges for erection or assembly into structures, such as buildings, parking decks, hospitals, arenas and ports. The investigation excludes concrete reinforcing bar structures, steel bridge sections, pre-fabricated steel buildings and steel utility poles, among other products."
  ],
  "published_datetime": "2019-09-05 01:09:00"
}