{
  "url": "https://www.nasdaq.com/article/us-stocksfutures-slip-as-trade-tensions-weigh-20190903-00478",
  "title": "US STOCKS-Futures slip as trade tensions weigh - Nasdaq.com",
  "text": [
    " (For a live blog on the U.S. stock market, click LIVE/ ortype LIVE/ in a news window.)",
    "* Futures down: Dow 0.78%, S&P 0.73%, Nasdaq 0.82% ",
    "By Uday Sampath Kumar",
    "Shares of trade-sensitive industrial bellwethers CaterpillarInc CAT.N and Boeing CoBA.N fell 1.5% each in premarkettrading, while those of Apple IncAAPL.O fell 1%. ",
    "A monthly survey on manufacturing activity by the Institutefor Supply Management, due at 10 a.m. ET, is expected to shedsome light on the impact of the trade war on the U.S. industrialsector.",
    "The S&P 500 index fell 1.8% in August, its biggest monthlydrop since May, after escalating U.S.-China trade tensions andthe inversion of a key part of the U.S. yield curve, seen as arecessionary signal, drove investors toward safe-haven assets.",
    "The benchmark index, however, ended the week up nearly 3% astrade tensions were dialed down following signals that Beijingand Washington would meet in September for talks.",
    "Bloomberg, however, reported on Monday that the two sideswere yet to agree on a date for the planned meeting.",
    "The Trump administration on Sunday began collecting 15%tariffs on more than $125 billion in Chinese imports, whileChina began imposing new duties on U.S. crude. urn:newsml:reuters.com:*:nL3N25S01P",
    "Chipmakers, which draw a large portion of their revenue fromChina, also fell, with Intel CorpINTC.O , Advanced MicroDevices AMD.O and Micron Technology IncMU.O off between1.4% and 2%.",
    "At 7:27 a.m. ET, Dow e-minis 1YMcv1 were down 207 points,or 0.78%. S&P 500 e-minis EScv1 were down 21.25 points, or0.73% and Nasdaq 100 e-minis NQcv1 were down 63.25 points, or0.82%. ",
    "Along with the manufacturing data, investors will also keepa close watch on the monthly jobs report due Friday for clues onthe health of the U.S. economy. ",
    "Also on Friday, Federal Reserve Chair Jerome Powell willspeak at an event hosted by the Swiss Institute of InternationalStudies, University of Zurich.",
    " (Reporting by Uday Sampath in Bengaluru; Editing by AnilD'Silva) ((UdaySampath.Kumar@thomsonreuters.com; within U.S.+1 646 2238780; Twitter: @sampath_uday; Reuters Messaging:UdaySampath.Kumar.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-03 08:13:00"
}