{
  "url": "https://www.nasdaq.com/article/now-more-than-ever-microsoft-stock-is-a-buy-cm1206907",
  "title": "Now More Than Ever, Microsoft Stock Is a Buy - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "If investors are searching for market-weighted leadership off and on the price chart, look no further than Microsoft (NASDAQ: MSFT ). If you also want above-average returns with less risk, these two MSFT stock strategies make going long all the more compelling. Let me explain.",
    "Despite August's market volatility and mostly pressured price action, it continues to be a standout year for MSFT stock. Relative to the S&P 500's own burly gain of 16%, shares of Microsoft are up an impressive 36%.",
    "This return differential amounts to more than a double. What's more, while the S&P 500 dropped 1.7% this past month - as much as 4.5% at its worst - and gave up key price supports on the price chart, shares of MSFT continued to demonstrate their durability as a market standout.",
    "At its weakest, MSFT pulled back less than 3%. Critical trend-line supports remain intact and for the month, shares finished up 1.45%. The price performance has also allowed Microsoft stock to retain the top spot as the world's largest publicly traded company and keep its market capitalization in excess of $1 trillion.",
    "Microsoft's tenacity isn't without merit either. Microsoft's most recent earnings topper in late July backs that positive view. Right now MSFT's leadership is also unmatched among mega-cap stocks. Wall Street's former and long-standing crown jewel Apple (NASDAQ: AAPL ) and brief top dog Amazon (NASDAQ: AMZN )  both finished underwater in August. Similar to the broader market, both stocks undermined their bullish price trends to varying degrees.",
    "Blame it on what you will, but MSFT stock continues to look like the stronger all-around investment. Taking a visual inspection of MSFT's technical wherewithal proves this.",
    "Since clearing its Dot.com all-time-high of $60 in late 2016, MSFT has put together a constructive bull run which has yielded about 125% for shareholders. The rally also continues to demonstrate healthy pattern characteristics. Market leadership strongly suggests that Microsoft shares are headed even higher.",
    "Currently MSFT stock is in the process of building a weekly chart base-on-base formation. The sturdy pattern of nearly three months has successfully tested an existing uptrend and lateral price support. That's bullish compared to the broader market's performance last month. Now, and with Microsoft shares on the cusp of  a stochastics crossover and the market stealthily putting together a bullish follow-through day signal on Aug. 13, all the elements for a successful breakout are in place.",
    "One suggested trend approach for entering Microsoft is to position as shares rally through the base-on-base formation high of $141.20. That's roughly 2.5% above the current MSFT stock price. Should a breakout occur, I'd set an initial target for taking partial profits near $165.",
    "The 17% premium relative to the pattern and all-time-high looks justified given MSFT's resiliency. And in anticipation, today's durable platform will lead to a price gain similar to the December to April leg within Microsoft's price trend.",
    "To keep long exposure looking smart off and on the price chart I'd recommend an initial stop-loss beneath $133. This amounts to risk of just under 6% and gives sufficient technical leeway without waiting for a full-fledged failure of the base breakout.",
    "Alternatively, for intermediate-term investors looking to make MSFT stock a core holding, an adjustable collar position is an attractive way to position.",
    "This flexible strategy limits and reduces risk, can allow investors to accumulate shares more safely and captures upside profits if Microsoft continues to rally. One favored collar is the November $150 call/$130 put combination for $139.50 with shares trading at $137.86.",
    "Investment accounts under Christopher Tyler's management do not currently own positions in any securities mentioned in this article. The information offered is based upon Christopher Tyler's observations and strictly intended for educational purposes only; the use of which is the responsibility of the individual.. For additional market insights and related musings, follow Chris on Twitter @Options_CAT and StockTwits .",
    "The post Now More Than Ever, Microsoft Stock Is a Buy appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:37:54"
}