{
  "url": "https://www.nasdaq.com/article/hanes-is-riding-the-retro-wave-and-set-to-make-a-comeback-in-2020-cm1207459",
  "title": "Hanes Is Riding the Retro Wave and Set to Make A Comeback In 2020 - Nasdaq.com",
  "text": [
    " Just when you were enjoying the comfort of boxers,   tighty-whities are threatening to make a comeback. Fashions are   cyclical, and the Gen Z crowd is bringing back the unexpected   thanks to pop culture, social media, and celebrity influencers.   This fashion movement is giving one old faithful,   HanesBrands    (NYSE: HBI) , a new lease on life. Champion is a Hanes brand and has been a decades-long   Walmart    and   Target    staple for budget shoppers. However, the Champion brand is now a   force in its own right as a result of urban nostalgia and a   rising demand for loungewear. Back in late March, a new Champion   store opened in Philadelphia -- with plenty of media buzz. The   store featured retro styles with neon colors on neutral   backgrounds exciting a throng of young fashionistas.   Image source: Getty ImagesmakeArticleAd();  This was the fifth retail store to be opened for the Champion   brand and, located in an elite shopping district, proved that   Champion had shed its budget stigma. For Hanes, which was pushed   to the sidelines for years in the competitive retail clothing   market, it is a remarkable reversal.  From chump to champ  Champion has chosen well when it comes to design partnerships.   The brand's clothing is versatile; sweatshirts, and skateboard   culture in a way that others have not. According to Bloomberg,   teenage boys   rank    Champion in their top 15 favorite fashion brands alongside   bastions such as Gucci and Tommy Hilfiger. Also, influencers such as Kendall Jenner, Chance the Rapper,   and Beyoncé, all of whom have millions of Gen Z social media   followers, have fueled the retro craze. To this generation, what   influencers are wearing on Instagram matters.  Other demographics  The athleisure market is also growing largely in response to a   demand from another demographic. Women are increasingly donning   yoga pants and designer tops that can be worn for working out,   running errands, and socializing.    Lululemon     and Athleta of    Gap    can attest     to this trend. Lululemon reported a 14% increase in   same-store sales in the first quarter of 2019 while the Athleta   brand plans to open 25 new stores in 2019. Then, there is the   youth movement that is eschewing jeans for more relaxed   sportswear reflecting an active lifestyle.  Market outlook  Initial growth occurred along with the improved economy after   the financial crisis. Champion's domestic sales jumped from $600   million in 2010 to $1.4 billion in 2017. Since then, Champion has   continued to hit the mark. By 2022, outside sales from stores   like Target and Walmart, are expected to reach   $2 billion    in a still-growing market. A 2017 report published by Allied   Market Research stated that the global activewear market was   valued at $3.5 billion in 2017 and was expected to reach $5.5   billion by 2024. Nevertheless, retail is a fierce market. Trends come, are   quickly saturated, and then go; many competitors die out quickly.   However, Champion is ahead of the pack and stands a better chance   than most at retaining that position.  Hanes' lates     t     earnings   Hanes' second-quarter earnings report for 2019 were strong and   at the high end of guidance. Second-quarter net sales of $1.76   billion showed an increase of 3%, and this was the eight   consecutive quarter of sales growth. Innerwear, not the company's   strongest point at the moment, increased by 3%; activewear by   more than 10%; and international growth was better than expected   at 4% with international sales growing by 50%. The GAAP EPS   increased by 8% and earnings per share was the same as a year ago   at $0.45. The company expects to meet guidance for the whole year and   feels confident that it will meet cash flow and debt obligations   with an expanding operating margin. In the second quarter, cash   flow from operations more than doubled to $137 million because of   improved working capital and net income growth. Debt levels were   down; debt leverage at the end of the quarter was down almost 3.9   times at the end of the year-ago quarter.  Riding the wave  The Champion brand is obviously the cash cow for Hanes during   this era of retro fashion, but Hanes' innerwear is also showing   growth. The company is producing new innerwear products using new   fabrics and designs. With respect to international expansion, the demand from China   for US brands shows no signs of slowing. In China, Hanes has   added a retail partner and plans to expand its stores and online   sales in 2020. Thankfully, for the older generations, donning tighty-whities   might not be necessary if this fashion cycle is short-lived.   However, Hanes looks to remain strong for as long as retro is the   choice of Gen Z and social media influencers.   10 stocks we like better than Hanesbrands       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Hanesbrands wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Caroline Banton      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Lululemon Athletica. The Motley     Fool has a     disclosure policy      .  ",
    "Just when you were enjoying the comfort of boxers,   tighty-whities are threatening to make a comeback. Fashions are   cyclical, and the Gen Z crowd is bringing back the unexpected   thanks to pop culture, social media, and celebrity influencers.   This fashion movement is giving one old faithful,   HanesBrands    (NYSE: HBI) , a new lease on life.",
    "Champion is a Hanes brand and has been a decades-long   Walmart    and   Target    staple for budget shoppers. However, the Champion brand is now a   force in its own right as a result of urban nostalgia and a   rising demand for loungewear. Back in late March, a new Champion   store opened in Philadelphia -- with plenty of media buzz. The   store featured retro styles with neon colors on neutral   backgrounds exciting a throng of young fashionistas.",
    "  Image source: Getty ImagesmakeArticleAd(); ",
    "Image source: Getty Images",
    "This was the fifth retail store to be opened for the Champion   brand and, located in an elite shopping district, proved that   Champion had shed its budget stigma. For Hanes, which was pushed   to the sidelines for years in the competitive retail clothing   market, it is a remarkable reversal.",
    "Champion has chosen well when it comes to design partnerships.   The brand's clothing is versatile; sweatshirts, and skateboard   culture in a way that others have not. According to Bloomberg,   teenage boys   rank    Champion in their top 15 favorite fashion brands alongside   bastions such as Gucci and Tommy Hilfiger.",
    "Also, influencers such as Kendall Jenner, Chance the Rapper,   and Beyoncé, all of whom have millions of Gen Z social media   followers, have fueled the retro craze. To this generation, what   influencers are wearing on Instagram matters.",
    "The athleisure market is also growing largely in response to a   demand from another demographic. Women are increasingly donning   yoga pants and designer tops that can be worn for working out,   running errands, and socializing.    Lululemon     and Athleta of    Gap    can attest     to this trend. Lululemon reported a 14% increase in   same-store sales in the first quarter of 2019 while the Athleta   brand plans to open 25 new stores in 2019. Then, there is the   youth movement that is eschewing jeans for more relaxed   sportswear reflecting an active lifestyle.",
    "Initial growth occurred along with the improved economy after   the financial crisis. Champion's domestic sales jumped from $600   million in 2010 to $1.4 billion in 2017. Since then, Champion has   continued to hit the mark. By 2022, outside sales from stores   like Target and Walmart, are expected to reach   $2 billion    in a still-growing market. A 2017 report published by Allied   Market Research stated that the global activewear market was   valued at $3.5 billion in 2017 and was expected to reach $5.5   billion by 2024.",
    "Nevertheless, retail is a fierce market. Trends come, are   quickly saturated, and then go; many competitors die out quickly.   However, Champion is ahead of the pack and stands a better chance   than most at retaining that position.",
    "Hanes' second-quarter earnings report for 2019 were strong and   at the high end of guidance. Second-quarter net sales of $1.76   billion showed an increase of 3%, and this was the eight   consecutive quarter of sales growth. Innerwear, not the company's   strongest point at the moment, increased by 3%; activewear by   more than 10%; and international growth was better than expected   at 4% with international sales growing by 50%. The GAAP EPS   increased by 8% and earnings per share was the same as a year ago   at $0.45.",
    "The company expects to meet guidance for the whole year and   feels confident that it will meet cash flow and debt obligations   with an expanding operating margin. In the second quarter, cash   flow from operations more than doubled to $137 million because of   improved working capital and net income growth. Debt levels were   down; debt leverage at the end of the quarter was down almost 3.9   times at the end of the year-ago quarter.",
    "The Champion brand is obviously the cash cow for Hanes during   this era of retro fashion, but Hanes' innerwear is also showing   growth. The company is producing new innerwear products using new   fabrics and designs.",
    "With respect to international expansion, the demand from China   for US brands shows no signs of slowing. In China, Hanes has   added a retail partner and plans to expand its stores and online   sales in 2020.",
    "Thankfully, for the older generations, donning tighty-whities   might not be necessary if this fashion cycle is short-lived.   However, Hanes looks to remain strong for as long as retro is the   choice of Gen Z and social media influencers.",
    "  10 stocks we like better than Hanesbrands       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Hanesbrands wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Hanesbrands       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Hanesbrands wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Caroline Banton      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Lululemon Athletica. The Motley     Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 01:13:00"
}