{
  "url": "https://www.nasdaq.com/article/mini-computers-industry-outlook-prospects-hold-promise-cm1206794",
  "title": "Mini Computers Industry Outlook: Prospects Hold Promise - Nasdaq.com",
  "text": [
    "The Zacks Computer - Mini Computers industry comprises prominent companies like Apple (AAPL) and HP (HPQ) that offer devices including smartphones, desktops, laptops, printers, wearables and 3-D printers.\r\n Such devices primarily adopt a multi-operating system, multi-architecture strategies using Apple's iOS, MacOS, Microsoft Windows, Google Chrome and Android operating systems. They predominantly use processors from Apple, Intel (INTC), AMD, Qualcomm (QCOM), NVIDIA (NVDA), Samsung, Broadcom and MediaTek, among others.\r\n Here are the four major industry themes:",
    "Zacks Industry Rank Indicates Bright Prospects\r\n The Zacks Computer - Mini Computers industry is housed within the broader Zacks Computer And Technology sector. It carries a Zacks Industry Rank #59, which places it in the top 23% of more than 250 Zacks industries.\r\n The group's Zacks Industry Rank , which is basically the average of the Zacks Rank of all the member stocks, indicates continued outperformance in the near term. Our research shows that the top 50% of the Zacks-ranked industries outperforms the bottom 50% by a factor of more than 2 to 1.\r\n The industry's positioning in the top 50% of the Zacks-ranked industries is a result of positive earnings outlook for the constituent companies in aggregate. Looking at the aggregate earnings estimate revisions, it appears that analysts are gaining confidence in this group's earnings growth potential. Since Apr 30, 2019, the industry's earnings estimate for the current year has increased almost 2.7%.\r\n Before we present a few stocks that you may want to consider for your portfolio, let's take a look at the industry's recent stock-market performance and valuation picture.Industry Lags Sector and S&P 500\r\n The Zacks Computer - Mini Computers industry has underperformed the broader Zacks Computer And Technology sector as well as the S&P 500 Index over the past year.\r\n The industry has lost 9.2% over this period compared with the S&P 500's fall of 0.5% and the broader sector's decline of 3.4%.One-Year Price Performance",
    "Industry's Current Valuation\r\n On the basis of forward 12-month P/E, which is a commonly used multiple for valuing computer stocks, we see that the industry is currently trading at 15.58X compared with the S&P 500's 16.72X. It is also above the sector's forward-12-month P/E of 19.97X.\r\n Over the last five years, the industry has traded as high as 17.13X, as low as 10.12X and at the median of 13.66X, as the chart below shows.Forward 12-Month Price-to-Earnings (P/E) RatioStocks to Consider\r\n None of the stocks in the Computer - Mini Computers industry sport a Zacks Rank #1 (Strong Buy). You can see the complete list of today's Zacks #1 Rank stocks here .\r\n However, Rock Hill, SC-based 3D Systems (DDD) carries a Zacks Rank #2 (Buy). The company offers hardware and software for 3D printing. Notably, the Zacks Consensus Estimate for 2019 loss per share has been flat at 11 cents over the past seven days.Price and Consensus: DDD\r\n We also present a couple of stocks with a Zacks Rank #3 (Hold) that investors may currently hold on to.\r\n Cupertino, CA-based Apple is well-known for its flagship iPhone, iPad and Mac personal computers. Apple Watch, HomePod and AirPods are some of its newest consumer offerings. The consensus mark for fiscal 2019 earnings has increased by 4 cents to $11.67 over the past week.Price and Consensus: AAPL\r\n Palo Alto, CA-based HP is a leading global provider of PCs and imaging and printing products. The Zacks Consensus Estimate for fiscal 2019 earnings stayed put at $2.21 over the past seven days.Price and Consensus: HPQ",
    "Legalizing THIS Could Be Even Bigger than Marijuana\r\n Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.\r\n Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.See these 5 \"sin stocks\" now >>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:17:00"
}