{
  "url": "https://www.nasdaq.com/article/5-dividend-stocks-with-large-share-buybacks-cm1210694",
  "title": "5 Dividend Stocks with Large Share Buybacks - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Stocks that pay good dividends and also have significant stock buyback programs provide numerous benefits to investors. These benefits include:",
    "For these reasons, there is a clear trend in the United States stock market for companies to spend more on share buybacks. CNBC recently reported that according to a Goldman Sachs  (NYSE: GS ) study, U.S. share buybacks are expected to hit $1 trillion this year. Corporations are using over 104% of their free cash flow for buybacks, up from 82% last year.",
    "I'm going to focus on five stocks that pay shareholders dividends and have large share buyback programs. Combined, these dividends and buybacks provide large total yields. And over time, these stocks are likely to be good investments.",
    "Dividend Yield:  1.4%",
    "Apple  (NASDAQ: AAPL ) stock has an attractive 1.4% dividend yield. But it returns even more capital to shareholders through its large share buyback program. AAPL has spent over 107% of its free cash flow on buybacks in the past year. The company has cut its shares by 32% in the last six years.",
    "Based on recent analysis , Apple stock will have an estimated 6.5% buyback yield over the next year, giving it a nearly 8% total yield.",
    "For example, AAPL recently reported that it spent $17 billion in share repurchases and $3.6 billion in dividends in its most recent quarter. The buybacks alone, if continued each quarter, represent on an annualized basis just under 7% of its market value ($68 billion dividend by $975 billion).",
    "Expect good things from Apple's stock buyback program in the years to come, including higher dividends per share and higher earnings per share.",
    "Dividend Yield:  1.4%",
    "Microsoft (NASDAQ: MSFT ) stock yields 1.4% and has a large share buyback program. It just completed a $25 billion share repurchase program. In the past quarter alone , MSFT spent $7.7 billion on shareholders, including $4.2 billion in share buybacks.",
    "These repurchases have reduced the amount of MSFT shares outstanding by over 30% in the past 15 years. Since Microsoft stock has a $1 trillion market value, its annual spending of over $16 billion in buybacks represents a 1.6% buyback yield. Combined with the 1.4% dividend yield, MSFT sports a 3% total yield.",
    "Dividend Yield:  1.7%",
    "Oracle  (NYSE: ORCL ) stock has a 1.7% dividend yield, but has a massive buyback program. In the past year alone, ORCL spent $36 billion on buybacks, representing 20% of its $182 billion market value.",
    "In its last eight fiscal years, ORCL has reduced its share count by over 33% using its free cash flow to repurchase shares. All eyes are going to be on ORCL's August fiscal first-quarter earnings statement to see how many shares it has bought back. Since ORCL spent over 280% of its free cash flow on buybacks, effectively drawing down its cash balance, I suspect ORCL's buyback activity may have been reduced for the August quarter.",
    "Nevertheless, at the rate its buybacks occurred last fiscal year (ending in May), Oracle stock sports an annualized 20% buyback yield. Its free cash flow yield is 7.5% of its market value.",
    "ORCL will post its earnings Sept. 12, including its cash flow statement which will show the share repurchase amounts.",
    "Dividend Yield:  2.8%",
    "Cisco (NASDAQ: CSCO ) stock has an attractive 2.8% dividend yield. Cisco stock also has an attractive buyback program. This is because the company is expected to make $7.7 billion in share repurchases this year.",
    "Compared to its $206 billion market value, this gives CSCO stock a 3.7% buyback yield. Its total yield is an appealing 6.5% (2.8% dividend yield plus 3.7% buyback yield).",
    "In the past ten years, CSCO has reduced its shares outstanding by 27%, and should reach close to a 30% reduction this year. The main reason for this is that CSCO produces abundant free cash flow - over $15 billion in this year alone.",
    "Expect that shares will continue to fall at CSCO. This has the benefit of allowing CSCO to be able to raise its dividend per share for the same amount of earnings its produces. It also increases earnings per share. Lastly the share buybacks act as a continuing source of demand for the stock, will help push the stock higher over time.",
    "Dividend Yield:  2.2%",
    "McDonald's  (NYSE: MCD ) stock enjoys a 2.2% dividend yield, but also engages in large share buyback activity. MCD reported that it expects to complete its three-year $25 billion share buyback program by the end of this year.",
    "This represents an average of $8.3 billion in share buybacks per year. Since MCD stock has a $158 billion market value, the average buyback yield is 5.3% of its stock market value.",
    "Combined with the 2.2% dividend yield, the buyback yield gives MCD an estimated 7.5% total yield. This means that over 7% of MCD's stock value is returned to shareholders on average each year through either dividends or buybacks.",
    "On Aug. 30 Mark Hake launched the Total Yield Value Guide , which focuses on high-total-yield value stocks. Subscribers during September receive a 20% discount and a two-week free trial.As of this writing, Mark Hake, CFA does not hold a position in any of the aforementioned securities. Mark Hake runs the Total Yield Value Guide which you can review here .",
    "The post 5 Dividend Stocks with Large Share Buybacks appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:13:28"
}