{
  "url": "https://www.nasdaq.com/article/4-top-stock-trades-for-wednesday-twtr-wmt-clf-nvta-cm1206995",
  "title": "4 Top Stock Trades for Wednesday: TWTR, WMT, CLF, NVTA - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Tuesday marked the first trading session of September, as well as the first session in the holiday-shortened week, with U.S. equity markets closed on Monday in observance of Labor Day. It wasn't an easy session for traders to get reacquainted with though. Let's look at a few top stock trades.",
    "Twitter (NYSE: TWTR ) stock have been moving really well and even on Tuesday, the early price action looked promising. Shares were trying to breakout of an ascending triangle, a bullish setup where rising uptrend support continues to squeeze a stock against a static level of resistance.",
    "That resistance came into play around $43. The stock was swiftly rejected from this level while the broader market was under notable pressure.",
    "However, uptrend support (blue line) is still holding strong, while the 20-day moving average is just below current levels.",
    "If these marks give way, $40 is on the table. A move over $43 could still trigger a breakout, but TWTR needs to close over this level.",
    "Walmart (NYSE: WMT ) stock also continues to trade relatively well so far this month. However, the stock continues to struggle with this $114 to $115 level.",
    "In the last two months, WMT has found itself in this area on three separate occasions. Each test of $115 comes following a higher low, as highlighted by the purple arrows on the chart above.",
    "If the overall market falls apart, it will be harder for WMT stock to breakout. However, shares are sitting rightunder the trigger spot. A close over $115 could cause an even larger move to the upside, with $120 on many traders' radar.",
    "On the downside, I would really like to see the 20-day and 50-day moving averages hold as support.",
    "Cleveland Cliffs (NYSE: CLF ) is getting hammered on the day, falling about 15% on Tuesday. It's more than just a tough day though, as CLF falls below its 200-week moving average.",
    "Should CLF reclaim this area and hold it by Friday's close, bulls can breathe a sigh of relief. However, a close below this mark puts the $6 mark on the table for the struggling stock.",
    "Shares were putting in a series of lower highs (blue line) above the $10 mark, and since breaking down over the past few months, CLF has lost almost 50% from its 2019 highs. Down seven weeks in a row has made this one a tough stock to own.",
    "Let's see if CLF gets down to $6 and how it responds if it does. From here, investors either need to see CLF reclaim the 200-week or test $6. We'll have a better idea on CLF after that.",
    "A 2019 favorite of mine, Invitae (NASDAQ: NVTA ) has not been trading all that well as of late. Shares gapped up in early August on drastically better-than-expected quarterly results.",
    "But as the stock market chopped back and forth, NVTA wasn't able to demonstrate any relative strength. Worse, since that post-earnings gap up shares of Invitae have been under pressure, as downtrend resistance squeezes it lower.",
    "With the 50-day moving average turning from support to resistance, NVTA has a true test potentially coming up: Will the $21 to $22 area support the stock? This level was support in March and April before giving way and acting as resistance in May and June.",
    "At the end of June, NVTA reclaimed this level and it again served as support. Let's see if it does again. Below it and the 200-day moving average may be on the table.",
    "Bret Kenwell is the manager and author of Future Blue Chips and is on Twitter @BretKenwell . As of this writing, Bret Kenwell is long NVTA.",
    "The post 4 Top Stock Trades for Wednesday: TWTR, WMT, CLF, NVTA appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 15:48:15"
}