{
  "url": "https://www.nasdaq.com/article/how-social-security-changes-your-monthly-payment-based-on-when-you-file-cm1210585",
  "title": "How Social Security Changes Your Monthly Payment Based on When You File - Nasdaq.com",
  "text": [
    " Social Security is an incredibly important retirement benefits   program, with close to 90% of individuals 65 and over in the   United States receiving benefits. These benefits represent about   one-third of all the income of elderly Americans, with 48% of   married couples and 69% of unmarried persons relying on them for   at least 50% of their household income in retirement. Since Social Security will likely be   an important source of funds in your golden   years    , it's essential to understand how your payments are determined   and what actions you could take that might increase or decrease   them. One of the most important decisions you'll make -- and one   that has a huge impact on your monthly check -- is the choice of   when to file for benefits and begin receiving Social Security   income for the first time. Social Security changes your monthly payments based on when   you file because benefits are decreased if you file early and   increased if you wait -- up until age 70. While the retirement   benefits program is intended to be structured so retirees receive   the same lifetime benefits no matter when they retire, the amount   of monthly checks differs a lot depending on your age when you   claim.makeArticleAd(); This guide will explain the changes to your monthly payment   you can expect depending on when you file so you can make an   informed choice about what's right for you.   Image source: Getty Images.  How do Social Security benefits change based on when you   file? The Social Security Administration looks at your earnings over   your career to calculate a basic benefit you'll receive if you   retire at an age designated by law as your   full retirement age    (FRA). If you file for Social Security prior to FRA, benefits are   reduced slightly for each month early that you claim. The   specific reduction depends whether you've claimed more than 36   months before FRA or within 36 months of hitting this milestone   age. It's about 6.7% per year for the first three years before   FRA and 5% per year if you've claimed more than three years   early. If you file for benefits after FRA, your monthly checks are   increased slightly for each month you claim. The total increase   is 8% annually. Benefits increase only until the age of 70, after   which time there's no further rise in monthly checks if you wait   to claim. Filing later has other effects as well. If you wait until FRA   to file, you can work and earn income while receiving benefits   with no deductions. But if you file before FRA, earnings from   working could result in a smaller Social Security check. Working   longer could also result in an increase in monthly benefits if   you earn more at the tail end of your career and thus increase   the average wages your benefits are based on. What does it mean to file for benefits at full retirement   age? When the Social Security Act was signed into law, retirement   benefits became available to workers at the age of 65, with   workers receiving monthly benefits based on payroll tax   contributions made during their working lifetime. Later   amendments also allowed benefits to be paid to widows and   widowers of covered workers, as well as to spouses and minor   dependent children. Another change to the law in 1956 established   the right of women to claim benefits as early as age 62, and this   right was extended to men in 1961. Those amendments introducing the idea of early retirement   meant that benefits had to be actuarially reduced; those who   claimed benefits prior to 65 must receive a reduced monthly   income to account for receiving benefits longer. Sixty-five was   considered full retirement age (FRA), so claiming prior to this   time triggered the benefits reduction. However, 1983 amendments to Social Security law adjusted FRA   in recognition of lengthening life spans. Now full retirement age   -- the earliest age at which you can file to receive your   standard unreduced Social Security benefit -- will be determined   based on your birth year. The table below shows what your FRA is,   depending on when you were born.  Table source:   Social Security Administration    . How much would your monthly Social Security payment be if you   file for benefits at full retirement age? Not everyone receives the same standard benefit amount if they   retire at FRA, because your monthly benefit is determined based   on your specific work history. The standard benefit amount you   receive at FRA is called your   primary insurance amount    (PIA), and there's a specific formula to determine it. To   calculate PIA, the Social Security Administration:   Looks at your earning record over your entire career to     determine annual wages in each year you worked.      Only wages up to the     Social Security wage base limit      count. This is an annual income limit above which your income     isn't taxed and isn't counted in determining benefits. For     2019, the limit is $132,900, so no income above this threshold     is taxed or counted when determining annual wages.  Adjusts annual wages for each year to account for     inflation.      This adjustment is made using the Average Wage Index from the     year you turned 60. You can learn more about how this     adjustment is made in this     guide to the Social Security benefits     formula      .  Calculates your     Average Indexed Monthly Earnings      (AIME).      SSA adds up your inflation-adjusted wages during the 35 years     you earned the most and divides by 420 (12 months x 35 years)     to find your average inflation-adjusted wages over your     career.  Sets your primary insurance amount equal to a specific     percentage of your AIME.      Your primary insurance amount is equal to only a part of AIME     because Social Security isn't designed to replace your full     wages. And because the Social Security benefit formula is     progressive, lower earners actually get benefits equal to a     higher percentage of wages than higher-income workers do.  You'll receive your PIA only if you file for benefits to begin   at exactly FRA. If you claim benefits even one month before, PIA   must be adjusted downward. If you claim even one month after, it   must be adjusted upward. What does it mean to file for benefits early? Filing for benefits early means you request your Social   Security benefits prior to reaching FRA. You could start   receiving monthly checks as early as age 62. However, retiring   any time before ages 65 to 67 might be considered early filing,   depending on your birth year. You can't file   too    early, though. You must at least earn enough work credits to   become eligible for retirement benefits. You're required to have   at least 40 credits and can earn a maximum of 4 per year. You   earn credits by earning a certain amount of income each year that   you pay Social Security tax on. In 2019, you'd need $1,360 in   covered income to receive each credit and would receive the   maximum four credits for the year once your annual earnings hit   $5,440. The \"cost\" of a credit, or income necessary to earn one,   can change annually. How much would your monthly Social Security benefit change if   you file early? As already mentioned, early filing results in a reduction in   your PIA, so your monthly Social Security check will be smaller   than if you'd waited to claim benefits until FRA. The reduction   is equal to:   5/9 of 1% for the first 36 months before FRA.      This is the equivalent of about a 6.7% reduction per year. To     figure out your specific reduction, multiply the number of     months before FRA by ((5/9) x 0.01). If you retire 18 months     early, you'd be looking at around a 10% benefit reduction     because 18 x ((5/9) x 0.01) = .10.  An additional 5/12 of 1% for each prior month.      This is the equivalent of around a 5% annual reduction. Say     you're retiring 44 months before FRA. You'd first figure out     your reduction for the first 36 months by multiplying 36 x     ((5/9) x 0.01) = .20. Then add in the additional reduction for     the additional 8 months calculated by 8 x ((5/12) x 0.01) =     .03. So you'd be looking at around a 23% reduction in     benefits.  Multiply your PIA by the reduction for early filing to see   what your monthly benefit would be. If you'd receive $1,200 from   Social Security at FRA and you retire 44 months early, your   reduction would be 23% of $1,200 or $276 -- so your monthly   Social Security check would fall from $1,200 to $924. To help you better understand how Social Security will change   your monthly payment based on when you file, the chart below   shows the reduction in your monthly benefits check if you file   prior to FRA.  What does it mean to file for benefits late? If you file for benefits late, you claim them after FRA. If   your Social Security income starts even a month after FRA, you'll   see an increase in your monthly benefits. For each month of   delay, you earn   delayed retirement credits    that increase your monthly check. However, you see no further   increase after age 70, so there's no benefit in waiting any   longer once you become a septuagenarian. Since you stop earning benefits after 70, there's a limit to   how many months you can earn delayed retirement credits:  If FRA is 67, you can earn delayed retirement credits for a     maximum of 36 months before turning 70. If FRA is 66, you can earn delayed retirement credits for a     maximum of 48 months.  How much would your monthly Social Security check change if   you file late? For each month after FRA that you wait to claim benefits, your   PIA will be increased by 2/3 of 1% -- up until age 70. This means   your monthly Social Security check will be:  8% higher than your benefit would've been at FRA if you     wait one year to claim 16% higher than at FRA if you wait two years 24% higher than at FRA if you wait three years 32% higher if you wait four years  You can figure out your specific benefit increase by   multiplying the number of months of delay by ((2/3) x 0.01). If   you wait 14 months after FRA, this would be:  14 x ((2/3) x 0.01) = .09  You'd see around a 9% increase in your check compared to what   it would've been at FRA. If you'd have received $1,200 at FRA,   you'd get $108 more for a total benefit of $1,308 if you waited   14 months to claim. How else could filing early or late affect your monthly   Social Security checks? Your AIME could also be affected based on when you decide to   stop working. This could have a big impact on monthly Social   Security checks.  If you decide to retire early and your work history is     shorter than 35 years, the SSA still figures out AIME by     looking at average wages over 35 years. Unfortunately, you have     years of $0 wages factored in. This reduces your AIME compared     to if you'd worked a full 35 years -- resulting in a lower     monthly benefit check. If you're earning more in your later years than you did at     the beginning of your career, which is very common, you could     also benefit from working longer. Since SSA takes the highest     35 years o     f     earnings      , you could replace some years of lower earnings with later     years of higher earnings and raise your AIME. This would result     in a higher monthly check.  You could also file, start receiving benefits, and continue   working if you want. But the age at which you claim benefits also   affects what happens if you work while receiving them.   If you have already reached FRA      and you still work, you can earn as much as you want and     continue to receive your full Social Security check.  If you work in any year before you reach FRA      , your monthly check could decline, or your entire benefit     could be withheld. That's because SSA withholds $1 of your     benefit for every $2 earned above a certain income limit. In     2019, the income limit is $1,470 monthly or $17,640 annually.     If you earn $20,640, you've exceeded the limit by $3,000, so     $1,500 of your annual benefit would be withheld.  If you begin working in the year you reach FRA      , you could also see a reduction in benefits or get no benefits     at all. The SSA withholds benefits if you earn too much in the     months before FRA. You'll see a reduction in benefits equal to     $1 for every $3 in income above a different income limit. For     2019, the limit is $46,920 or $3,910 monthly. If you earn     $49,920 and exceed the limit by $3,000, $1,000 of your annual     benefit would be withheld. But once you hit FRA, you can work     as much as you want without any reduction in your check.  Consider your work history, as well as whether you plan to   work while receiving benefits, to understand how the time you   file will impact your check. If benefits are withheld because of   working, you do get credit for this and will receive higher   Social Security checks later. But there's little point in filing   for benefits only to see the entirety of your checks withheld   because you're earning too much. When should you file to maximize your Social Security   income? Social Security is designed so that it shouldn't matter at   what age you claim benefits, and you'd still receive the same   amount of total lifetime income. If you file early, you get more   checks but at a lower amount. If you file late, you get fewer   checks but a higher amount. However, people don't always die at   the time that actuarial tables predict. If you outlive your   projected lifespan, you'd do better by waiting to claim so you   get higher benefits for a longer time. If you die before the SSA   projected you would, you'd have done better to claim benefits   early. No one has a crystal ball to predict their date of death, so   it's impossible to know when to file to get the absolute most   income from Social Security. You can, however, calculate how long   you'd need to live to break even for delaying benefits and make   an educated guess about whether you'll live that long by taking   into account your family's health history and your own health   history. To calculate your break-even point for delayed filing:   Figure out how much your benefit would be at     62.      If your FRA is 66 and you retire at 62, you're filing four     years early, so you'll see a 25% benefits reduction. If you'd     have received $1,200 at FRA, you'll get 75% of that amount at     62 -- $900.  Determine how many years you want to delay.      If you'll wait until 67 to file, you'll wait five years.  Figure out how much income you'll miss out on by     delaying.      You'll miss out on receiving $900 checks for 60 months, so you     will forego $54,000 in income ($900 per month x 60     months).  Figure out your benefit at the later age.      If you're comparing retiring at 62 to retiring at 67, figure     out your benefit at 67. It's one year after an FRA of 66, so     you see an 8% increase to your $1,200 benefit and will get     $1,296 per month.  Calculate how much higher your monthly income will be     at the later age than the earlier age.      By waiting, you'll get $396 more per month ($1,296 -     $900).  Determine how many months you'll need to get the higher     check to break even for foregone income.      Do this by dividing the missed income ($54,000) by the     difference in monthly benefits ($396). You'd need to receive an     extra $396 for 136.36 months to make up for missing out on     $54,000.  It would take you about 11.36 years to break even. If you   begin receiving benefits at 67, you would have to live until   78.36 years old to break even. Live any longer, and you'll get   more total Social Security income than you otherwise would've   because you keep getting that extra $396 per month for the rest   of your life. Your monthly payment can change a lot based on when you file   for Social Security As you can see, your monthly payment can change a whole lot   depending on when you file for benefits. You need to consider   your work history before filing, whether you plan to continue   working after claiming benefits, and whether you've reached full   retirement age or are claiming early or late. If you take all   these factors into account, you can decide if you'd rather   receive more checks that are smaller or fewer, bigger checks   later in life. Only you can make the decision about what's best   for your retirement needs.   The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .   The Motley Fool has a     disclosure policy      .  ",
    "Social Security is an incredibly important retirement benefits   program, with close to 90% of individuals 65 and over in the   United States receiving benefits. These benefits represent about   one-third of all the income of elderly Americans, with 48% of   married couples and 69% of unmarried persons relying on them for   at least 50% of their household income in retirement.",
    "Since Social Security will likely be   an important source of funds in your golden   years    , it's essential to understand how your payments are determined   and what actions you could take that might increase or decrease   them. One of the most important decisions you'll make -- and one   that has a huge impact on your monthly check -- is the choice of   when to file for benefits and begin receiving Social Security   income for the first time.",
    "Social Security changes your monthly payments based on when   you file because benefits are decreased if you file early and   increased if you wait -- up until age 70. While the retirement   benefits program is intended to be structured so retirees receive   the same lifetime benefits no matter when they retire, the amount   of monthly checks differs a lot depending on your age when you   claim.",
    "This guide will explain the changes to your monthly payment   you can expect depending on when you file so you can make an   informed choice about what's right for you.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "The Social Security Administration looks at your earnings over   your career to calculate a basic benefit you'll receive if you   retire at an age designated by law as your   full retirement age    (FRA).",
    "If you file for Social Security prior to FRA, benefits are   reduced slightly for each month early that you claim. The   specific reduction depends whether you've claimed more than 36   months before FRA or within 36 months of hitting this milestone   age. It's about 6.7% per year for the first three years before   FRA and 5% per year if you've claimed more than three years   early.",
    "If you file for benefits after FRA, your monthly checks are   increased slightly for each month you claim. The total increase   is 8% annually. Benefits increase only until the age of 70, after   which time there's no further rise in monthly checks if you wait   to claim.",
    "Filing later has other effects as well. If you wait until FRA   to file, you can work and earn income while receiving benefits   with no deductions. But if you file before FRA, earnings from   working could result in a smaller Social Security check. Working   longer could also result in an increase in monthly benefits if   you earn more at the tail end of your career and thus increase   the average wages your benefits are based on.",
    "When the Social Security Act was signed into law, retirement   benefits became available to workers at the age of 65, with   workers receiving monthly benefits based on payroll tax   contributions made during their working lifetime. Later   amendments also allowed benefits to be paid to widows and   widowers of covered workers, as well as to spouses and minor   dependent children. Another change to the law in 1956 established   the right of women to claim benefits as early as age 62, and this   right was extended to men in 1961.",
    "Those amendments introducing the idea of early retirement   meant that benefits had to be actuarially reduced; those who   claimed benefits prior to 65 must receive a reduced monthly   income to account for receiving benefits longer. Sixty-five was   considered full retirement age (FRA), so claiming prior to this   time triggered the benefits reduction.",
    "However, 1983 amendments to Social Security law adjusted FRA   in recognition of lengthening life spans. Now full retirement age   -- the earliest age at which you can file to receive your   standard unreduced Social Security benefit -- will be determined   based on your birth year. The table below shows what your FRA is,   depending on when you were born.",
    "Table source:   Social Security Administration    .",
    "Not everyone receives the same standard benefit amount if they   retire at FRA, because your monthly benefit is determined based   on your specific work history. The standard benefit amount you   receive at FRA is called your   primary insurance amount    (PIA), and there's a specific formula to determine it. To   calculate PIA, the Social Security Administration:",
    "You'll receive your PIA only if you file for benefits to begin   at exactly FRA. If you claim benefits even one month before, PIA   must be adjusted downward. If you claim even one month after, it   must be adjusted upward.",
    "Filing for benefits early means you request your Social   Security benefits prior to reaching FRA. You could start   receiving monthly checks as early as age 62. However, retiring   any time before ages 65 to 67 might be considered early filing,   depending on your birth year.",
    "You can't file   too    early, though. You must at least earn enough work credits to   become eligible for retirement benefits. You're required to have   at least 40 credits and can earn a maximum of 4 per year. You   earn credits by earning a certain amount of income each year that   you pay Social Security tax on. In 2019, you'd need $1,360 in   covered income to receive each credit and would receive the   maximum four credits for the year once your annual earnings hit   $5,440. The \"cost\" of a credit, or income necessary to earn one,   can change annually.",
    "As already mentioned, early filing results in a reduction in   your PIA, so your monthly Social Security check will be smaller   than if you'd waited to claim benefits until FRA. The reduction   is equal to:",
    "Multiply your PIA by the reduction for early filing to see   what your monthly benefit would be. If you'd receive $1,200 from   Social Security at FRA and you retire 44 months early, your   reduction would be 23% of $1,200 or $276 -- so your monthly   Social Security check would fall from $1,200 to $924.",
    "To help you better understand how Social Security will change   your monthly payment based on when you file, the chart below   shows the reduction in your monthly benefits check if you file   prior to FRA.",
    "If you file for benefits late, you claim them after FRA. If   your Social Security income starts even a month after FRA, you'll   see an increase in your monthly benefits. For each month of   delay, you earn   delayed retirement credits    that increase your monthly check. However, you see no further   increase after age 70, so there's no benefit in waiting any   longer once you become a septuagenarian.",
    "Since you stop earning benefits after 70, there's a limit to   how many months you can earn delayed retirement credits:",
    "For each month after FRA that you wait to claim benefits, your   PIA will be increased by 2/3 of 1% -- up until age 70. This means   your monthly Social Security check will be:",
    "You can figure out your specific benefit increase by   multiplying the number of months of delay by ((2/3) x 0.01). If   you wait 14 months after FRA, this would be:",
    "You'd see around a 9% increase in your check compared to what   it would've been at FRA. If you'd have received $1,200 at FRA,   you'd get $108 more for a total benefit of $1,308 if you waited   14 months to claim.",
    "Your AIME could also be affected based on when you decide to   stop working. This could have a big impact on monthly Social   Security checks.",
    "You could also file, start receiving benefits, and continue   working if you want. But the age at which you claim benefits also   affects what happens if you work while receiving them.",
    "Consider your work history, as well as whether you plan to   work while receiving benefits, to understand how the time you   file will impact your check. If benefits are withheld because of   working, you do get credit for this and will receive higher   Social Security checks later. But there's little point in filing   for benefits only to see the entirety of your checks withheld   because you're earning too much.",
    "Social Security is designed so that it shouldn't matter at   what age you claim benefits, and you'd still receive the same   amount of total lifetime income. If you file early, you get more   checks but at a lower amount. If you file late, you get fewer   checks but a higher amount. However, people don't always die at   the time that actuarial tables predict. If you outlive your   projected lifespan, you'd do better by waiting to claim so you   get higher benefits for a longer time. If you die before the SSA   projected you would, you'd have done better to claim benefits   early.",
    "No one has a crystal ball to predict their date of death, so   it's impossible to know when to file to get the absolute most   income from Social Security. You can, however, calculate how long   you'd need to live to break even for delaying benefits and make   an educated guess about whether you'll live that long by taking   into account your family's health history and your own health   history.",
    "To calculate your break-even point for delayed filing:",
    "It would take you about 11.36 years to break even. If you   begin receiving benefits at 67, you would have to live until   78.36 years old to break even. Live any longer, and you'll get   more total Social Security income than you otherwise would've   because you keep getting that extra $396 per month for the rest   of your life.",
    "As you can see, your monthly payment can change a whole lot   depending on when you file for benefits. You need to consider   your work history before filing, whether you plan to continue   working after claiming benefits, and whether you've reached full   retirement age or are claiming early or late. If you take all   these factors into account, you can decide if you'd rather   receive more checks that are smaller or fewer, bigger checks   later in life. Only you can make the decision about what's best   for your retirement needs.",
    "  The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      . ",
    " The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .",
    " The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:33:00"
}