{
  "url": "https://www.nasdaq.com/article/grupo-bimbo-breaks-latam-lull-with-low-30year-coupon-20190903-01328",
  "title": "Grupo Bimbo breaks LatAm lull with low 30-year coupon - Nasdaq.com",
  "text": [
    "By Miluska Berrospi",
    "NEW YORK, Sept 3 (IFR) - Mexican multinational bakery Grupo Bimbo became the first LatAm issuer to raise dollars in over a month on Tuesday, drawing strong demand for a 30-year offering.",
    "The firm, rated Baa2/BBB/BBB, upsized an initial US$500m deal to print US$600m with final order books reaching US$2.5bn.",
    "Leads on Bimbo's new deal, BBVA, Citi, JP Morgan, Morgan Stanley and MUFG tightened pricing by about 25bps to T+215bp from initial price thoughts.",
    "The 4.00% 2049 note priced at 98.334, to yield 4.097%, slightly outside of the company's existing 4.7% 2047 notes, which were trading at 111.307 to yield 4.019% on Tuesday afternoon, according to MarketAxess.",
    "\"There is a lot of demand on that name from US institutional investors,\" said Roger Horn, a senior emerging markets strategist at SMBC Nikko Securities America.",
    "\"[Investors] can compare it to other US investment-grade or even global food product companies. It's a strong credit. Most of its activity is outside of Mexico and it has been treated like a safe heaven.\"",
    "Similarly rated American food products company Campbell Soup, rated Baa2/BBB-/BBB, has an existing 4.8% March 2048 bond currently changing hands at a price of around 112.047, to yield 4.045%, according to MarketAxess.",
    "Moody's and Fitch both cited Bimbo's solid business position and strong liquidity in their analysis of the company.",
    "\"In light of the current market volatility, there might be a flight to quality and, given its long tenor, the (Grupo Bimbo) bond appears 'tailor-made' for pension funds,\" said credit analytics and research firm Tellimer in a report.",
    "Proceeds of the transaction will go toward refinancing a portion of the company's existing $800 million 4.875% notes due 2020.",
    "Grupo Bimbo was last in the dollar market in April 2018 when it sold a US$500m NC5 bond with a 5.950% coupon."
  ],
  "published_datetime": "2019-09-03 17:14:00"
}