{
  "url": "https://www.nasdaq.com/article/why-shares-of-royal-dutch-shell-fell-more-than-10-in-august-cm1207589",
  "title": "Why Shares of Royal Dutch Shell Fell More Than 10% in August - Nasdaq.com",
  "text": [
    " What happened Shares of   Royal Dutch Shell    (NYSE: RDS-A) (NYSE: RDS-B) fell more than 10% in August,   according to data provided by      S&P Global Market Intelligence    . Shell has two classes of American depositary receipts (   ADR    ) shares that trade on the New York Stock Exchange. The B shares,   down 12.2%, fared slightly worse than the A shares, which were   only down 11.6%. This was a bit worse than other oil majors,   although many   stocks in the energy sector    retreated in August thanks to a decline in    oil   prices    . So what The bulk of the drop came on the first day of the month, as   Shell reported worse-than-expected Q2 2019 earnings. Quarterly   earnings were down 50% -- you read that right --   fifty percent,    both sequentially and year over year. In a press release, Shell   CEO Ben Van Beurden blamed \"lower realized oil, gas and LNG   prices, [and] weaker realized chemicals and refining margins\" for   the drop.   Royal Dutch Shell's usual outperformance wasn't on display     in August. Image source: Getty Images.makeArticleAd();  Investors became accustomed to Shell shrugging off weakness in   the energy sector. For example, in Q4 2018, when oil prices   toppled, Shell's   realized gas prices soared    , boosting earnings 48% year over year. In Q1 2019, when other   oil majors were seeing weaker margins in their downstream   segments, Shell managed to   buck the trend    again, thanks in part to the bulk of its refining and chemical   operations being located outside the U.S. But in Q2, it appears that the industrywide trends finally   caught up to Shell, although the company still managed to churn   out impressive cash flow -- up 16% year over year -- despite the   earnings miss. Now what While Shell had the worst August performance of the oil   majors, none of its peers escaped unscathed. French giant   Total    saw shares slip by 3.5% while giant   ExxonMobil    's stock price slumped 7.9%. As long as oil prices stay at   current levels or fall further, Shell shareholders may be in for   a rocky ride, along with the industry, in general. Still, this means Shell's stock price is the lowest it's been   all year... and its dividend yield the highest. If you're a   long-term dividend investor looking for a buying opportunity,   this may be an ideal moment to nab some shares.   10 stocks we like better than Royal Dutch Shell     A       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Royal Dutch Shell wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        John Bromels      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   Royal Dutch Shell    (NYSE: RDS-A) (NYSE: RDS-B) fell more than 10% in August,   according to data provided by      S&P Global Market Intelligence    . Shell has two classes of American depositary receipts (   ADR    ) shares that trade on the New York Stock Exchange. The B shares,   down 12.2%, fared slightly worse than the A shares, which were   only down 11.6%. This was a bit worse than other oil majors,   although many   stocks in the energy sector    retreated in August thanks to a decline in    oil   prices    .",
    "The bulk of the drop came on the first day of the month, as   Shell reported worse-than-expected Q2 2019 earnings. Quarterly   earnings were down 50% -- you read that right --   fifty percent,    both sequentially and year over year. In a press release, Shell   CEO Ben Van Beurden blamed \"lower realized oil, gas and LNG   prices, [and] weaker realized chemicals and refining margins\" for   the drop.",
    "  Royal Dutch Shell's usual outperformance wasn't on display     in August. Image source: Getty Images.makeArticleAd(); ",
    "Royal Dutch Shell's usual outperformance wasn't on display     in August. Image source: Getty Images.",
    "Investors became accustomed to Shell shrugging off weakness in   the energy sector. For example, in Q4 2018, when oil prices   toppled, Shell's   realized gas prices soared    , boosting earnings 48% year over year. In Q1 2019, when other   oil majors were seeing weaker margins in their downstream   segments, Shell managed to   buck the trend    again, thanks in part to the bulk of its refining and chemical   operations being located outside the U.S.",
    "But in Q2, it appears that the industrywide trends finally   caught up to Shell, although the company still managed to churn   out impressive cash flow -- up 16% year over year -- despite the   earnings miss.",
    "While Shell had the worst August performance of the oil   majors, none of its peers escaped unscathed. French giant   Total    saw shares slip by 3.5% while giant   ExxonMobil    's stock price slumped 7.9%. As long as oil prices stay at   current levels or fall further, Shell shareholders may be in for   a rocky ride, along with the industry, in general.",
    "Still, this means Shell's stock price is the lowest it's been   all year... and its dividend yield the highest. If you're a   long-term dividend investor looking for a buying opportunity,   this may be an ideal moment to nab some shares.",
    "  10 stocks we like better than Royal Dutch Shell     A       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Royal Dutch Shell wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Royal Dutch Shell     A       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Royal Dutch Shell wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  John Bromels      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 04:47:00"
}