{
  "url": "https://www.nasdaq.com/article/uk-highspeed-rail-link-is-over-budget-years-behind-schedule-government-says-20190903-00750",
  "title": "UK high-speed rail link is over budget, years behind schedule, government says - Nasdaq.com",
  "text": [
    "LONDON, Sept 3 (Reuters) - A proposed high-speed rail project to improve links from London to central and northern England will cost about 20 billion pounds more than originally expected and is up to five years behind schedule, the government said on Tuesday.",
    "The High Speed 2 project (HS2) aims to slash journey times between the capital and Birmingham, which supporters say would give Britain the kind of fast rail services enjoyed by other major countries.",
    "A second phase envisages a new link from Birmingham to Manchester and Leeds in northern England.",
    "In a statement to parliament, transport minister Grant Shapps said the scheme would not be delivered at the original budget of 62.4 billion pounds ($76.6 billion) but would instead cost 81-88 billion pounds.",
    "The line was due to open in 2026 but the date has now been put back to 2028-2031 with the second phase launching between 2035 and 2040, potentially seven year late, Shapps said.",
    "The government announced last month that it would hold an independent review into whether the scheme should go ahead, with a final report due by the end of the year.",
    "\"I want to be clear with colleagues that there is no future for a project like this without being transparent and open, so we will be candid when challenges emerge,\" Shapps said in his statement.",
    "Opposition parties accused the government of incompetence.",
    "\"This government has misled both parliament and the public about the cost of HS2,\" said Labour transport spokesman Andy McDonald. \"People need to have confidence in the project, so this delay is bad news for the UK transport system as a whole and the north of England in particular.\""
  ],
  "published_datetime": "2019-09-03 09:08:00"
}