{
  "url": "https://www.nasdaq.com/article/czech-investor-takes-stake-in-casino-after-failed-metro-bid-20190905-00328",
  "title": "Czech investor takes stake in Casino after failed Metro bid - Nasdaq.com",
  "text": [
    "By Dominique Vidalon and Pascale Denis",
    "PARIS, Sept 5 (Reuters) - Czech businessman Daniel Kretinsky and Slovak partner Patrik Tkac have bought a 4.63% stake in debt-laden French retailer Casino , a month after failing to take over Germany'sMetro AG .",
    "The duo, who bought the stake via their Vesa Equity Investment company, become Casino's second-largest shareholder at a time CEO and controlling shareholder Jean-Charles Naouri is hunting for ways to ease the company's debts - and those of parent company Rallye  - in part through asset sales.",
    "In a joint statement, Kretinsky, who also owns stakes in French newspaper Le Monde and Czech soccer club Sparta Prague, described Casino as \"one of the European leaders best placed to respond to the (retail) sector's profound transformation.\"",
    "Rallye was placed under protection from creditors in May as Naouri sought to avoid the group's collapse. ",
    "While Casino itself was not placed under bankruptcy protection, it was hit with downgrades that left its credit rating deeper in junk territory. Rating agencies Moody's and S&P cited concerns over debts at Casino's parent companies.",
    "Casino's brands range from Geant hypermarkets and Leader Price budget stores to online retailer Cdiscount. It also has a large retail business in Brazil.",
    "FRIENDLY MOVE?",
    "Naouri immediately offered a board seat at the next shareholders meeting to Vesa Equity Investment.",
    "Kretinsky bought the stake in Casino on the market during the summer in what a source close to the French group described as a friendly move.",
    "At an average share price of 36 euros over the summer, the investment would total around 180 million euros ($201 million).",
    "Casino shares were up 4% to 42.63 euros at 1030 GMT, but are still down 28% this year.",
    "\"Today's news of a new investor entering the company's equity is welcomed by Mr Naouri and will please institutional shareholders. We doubt this is a prelude to change of control, but it will provide a strong backstop after a number of embattled months for the French group,\" Jefferies analysts said.",
    "Bernstein analysts said the announcement was \"all about confidence building that all is well at Casino and the future secure.\"",
    "In early August, Kretinsky said his 5.8 billion euro bid to increase his 17.52% stake in wholesaler Metro AG had not succeeded and that it was up to Metro's management to show the company was worth more. He also holds a 40% stake in Mall group, an e-commerce player in central and eastern Europe.",
    "Kretinsky's media investments in France include a 49% stake in Nouveau Monde, the top shareholder of Le Monde newspaper and some magazines belonging to the Lagardere group.",
    "The 44-year-old, who made his name at central European investment group J&T,  also recently bought French assets of German energy group Uniper .",
    "($1 = 0.8973 euros)"
  ],
  "published_datetime": "2019-09-05 03:42:00"
}