{
  "url": "https://www.nasdaq.com/article/lexicon-lxrx-settles-with-sanofi-for-260m-shares-rally-cm1210420",
  "title": "Lexicon (LXRX) Settles With Sanofi for $260M, Shares Rally - Nasdaq.com",
  "text": [
    "  Lexicon Pharmaceuticals, Inc. LXRX  announced that it will regain re-gain global rights to diabetes drug, Zynquista (sotagliflozin), and will receive $260 million from Sanofi SNY  per the terms of a deal related to termination of their alliance for the product's development. The deal includes settlement of all related disputes with Sanofi. The termination of the alliance between the companies stands effective from Sep 9. The total amount includes $208 million in upfront payment and the rest of the amount will be paid by Sanofi over the next 12 months. This payment will significantly boost Lexicon's cash resources. Shares of Lexicon surged 30.2% in after-market trading on Sep 10, following the announcement. However, the company's shares have declined 74.1% so far this year compared with the industry  's decrease of 3.2%.        Please note that Lexicon and Sanofi had entered into the alliance four years ago for the development of Zynquista, a dual SGLT1 and SGLT2 inhibitor, for the treatment of patients with type I or type II diabetes. In July, Sanofi announced its decision to terminate the alliance following the announcement of top-line data from three phase III studies evaluating Zynquista in type II diabetes in patients receiving metformin or with stage 3 chronic kidney disease (\"CKD\") or stage 4 CKD. Data from the studies showed Zynquista achieved statistically significant reduction in HbA1c (blood sugar) levels in patients on metformin and overall patient population in stage 3 CKD study. However, Zynquista failed to achieve reduction in HbA1c levels of statistical significance in patients with stage 3b or 4 CKD. However, Lexicon will continue to analyze data from these three studies. Meanwhile, in April, Zynquista received approval for the treatment of type I diabetes in Europe. However, the FDA had issued  a complete response letter (\"CRL\") to the new drug application seeking approval for Zynquista for a similar indication. Although investors cheered the payment from Sanofi, the loss of a strong partner is likely to have an unfavorable impact on Lexicon going forward. Following the termination, Lexicon may face hiccups with the launch of Zynquista in Europe, which otherwise could have been smooth given strong presence of Sanofi in that market. The company is currently looking for partnerships for development, regulatory approval and commercialization of Zynquista. We note that the diabetes segment is a competitive space. In March, AstraZeneca's AZN  SGLT2 inhibitor, Forxiga, received approval in EU for type I diabetes. However, the drug has received CRL in the United States. Meanwhile, several companies are also developing SGLT2 inhibitor, like J&J's JNJ  Invokana and Eli Lilly's Jardiance, targeting type II diabetes.   Lexicon Pharmaceuticals, Inc. Price        Lexicon Pharmaceuticals, Inc. price    |   Lexicon Pharmaceuticals, Inc. Quote    Zacks Rank  Lexicon currently carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana. Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  AstraZeneca PLC (AZN): Free Stock Analysis Report   Johnson & Johnson (JNJ): Free Stock Analysis Report   Sanofi (SNY): Free Stock Analysis Report   Lexicon Pharmaceuticals, Inc. (LXRX): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Lexicon Pharmaceuticals, Inc. LXRX  announced that it will regain re-gain global rights to diabetes drug, Zynquista (sotagliflozin), and will receive $260 million from Sanofi SNY  per the terms of a deal related to termination of their alliance for the product's development. The deal includes settlement of all related disputes with Sanofi. The termination of the alliance between the companies stands effective from Sep 9.",
    "The total amount includes $208 million in upfront payment and the rest of the amount will be paid by Sanofi over the next 12 months. This payment will significantly boost Lexicon's cash resources.",
    "Shares of Lexicon surged 30.2% in after-market trading on Sep 10, following the announcement. However, the company's shares have declined 74.1% so far this year compared with the industry  's decrease of 3.2%.",
    "Please note that Lexicon and Sanofi had entered into the alliance four years ago for the development of Zynquista, a dual SGLT1 and SGLT2 inhibitor, for the treatment of patients with type I or type II diabetes. In July, Sanofi announced its decision to terminate the alliance following the announcement of top-line data from three phase III studies evaluating Zynquista in type II diabetes in patients receiving metformin or with stage 3 chronic kidney disease (\"CKD\") or stage 4 CKD.",
    "Data from the studies showed Zynquista achieved statistically significant reduction in HbA1c (blood sugar) levels in patients on metformin and overall patient population in stage 3 CKD study. However, Zynquista failed to achieve reduction in HbA1c levels of statistical significance in patients with stage 3b or 4 CKD. However, Lexicon will continue to analyze data from these three studies.",
    "Meanwhile, in April, Zynquista received approval for the treatment of type I diabetes in Europe. However, the FDA had issued  a complete response letter (\"CRL\") to the new drug application seeking approval for Zynquista for a similar indication.",
    "Although investors cheered the payment from Sanofi, the loss of a strong partner is likely to have an unfavorable impact on Lexicon going forward. Following the termination, Lexicon may face hiccups with the launch of Zynquista in Europe, which otherwise could have been smooth given strong presence of Sanofi in that market. The company is currently looking for partnerships for development, regulatory approval and commercialization of Zynquista.",
    "We note that the diabetes segment is a competitive space. In March, AstraZeneca's AZN  SGLT2 inhibitor, Forxiga, received approval in EU for type I diabetes. However, the drug has received CRL in the United States. Meanwhile, several companies are also developing SGLT2 inhibitor, like J&J's JNJ  Invokana and Eli Lilly's Jardiance, targeting type II diabetes.",
    "  Lexicon Pharmaceuticals, Inc. Price        Lexicon Pharmaceuticals, Inc. price    |   Lexicon Pharmaceuticals, Inc. Quote  ",
    " Lexicon Pharmaceuticals, Inc. Price ",
    " Lexicon Pharmaceuticals, Inc. price    |   Lexicon Pharmaceuticals, Inc. Quote ",
    " Zacks Rank ",
    "Lexicon currently carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:46:00"
}