{
  "url": "https://www.nasdaq.com/article/trade-war-impacts-manufacturing-winners-losers-cm1207429",
  "title": "Trade War Impacts Manufacturing: Winners & Losers - Nasdaq.com",
  "text": [
    " It has been a year now that the United States and China are in an intense trade tussle. Needless to say, that the trade war has impacted the manufacturing sector deeply in August. Seven industries in the manufacturing sector that depend on trade have contracted. Manufacturing supply chain that includes steelmakers to heavy equipment companies have been impacted by tariffs. While nine sectors have performed quiet well and reported growth, let us take a look at them.  Manufacturing Sector Contracts for the First Time in 3   Years  On Sep 3, Institute of Supply Management (ISM) reported that its index of national factory activity came in at 49.1 in August, while in July it was 51.2. The ISM reading was lowest for the first time since January 2016, and has declined persistently for the last five months. The factory activities have been witnessing contraction in Europe, Japan, China and now United States. ISM's report also mentions a decline in the measure of new orders to 47.2 for the first time since December 2015. Meanwhile, the ISM's production gauge fell to 49.5 last month. Thanks to the trade war, ISM's measure of export orders has sunk to 43.3 in August. The reading hit its lowest level since April 2009.  Trade War Hurts U.S. Manufacturing  The U.S. manufacturing sector suffered losses owing to trade tensions. Trump's administration on Sep 1 announced an additional 15% tariff on $125 billion of Chinese goods that include shoes, clothing and household appliances like coffee makers, toasters and microwave. In retaliation, China on Sep 2 imposed additional tariffs on $75-billion U.S. imports, which include 5% duties on U.S. crude oil. China has also filed a complaint with the World Trade Organization over U.S. import duties for violating the consensus reached by both the countries in Osaka, Japan. The extra tariffs of 5% and 10% have been imposed by China on 1,717 products out of the total of 5,078 products originating from the United States. Chinese administration will start collecting additional tariffs on the rest of the products from Dec 15.  Losers  Per ISM's report, the seven sectorsApparel, Leather & Allied Products; Fabricated Metal Products; Transportation Equipment; Primary Metals; Plastics & Rubber Products; Paper Products; and Electrical Equipment, Appliances & Components, have reported a contraction. The rise in tariffs has impacted their supply chain, resulting in a drop in new orders. President Trump was hoping that his tariffs on steel and aluminum imports would help U.S. manufacturers but the effect is quite the contrary. The U.S. steel producers industry was boosted by growth in Chinese production, while demand for steel has slowed down in China owing to the trade war. This is causing a decline in steel prices, eventually affecting American producers. Major automakers, including General Motors Company GM  , had to cease production in the Ohio car plant and Michigan transmission factory due to the trade war. General Motors' shares fell 0.5% on Sep 3. Meanwhile, Nissan Motor, Fiat Chrysler and Honda Motor are all reducing their production shifts. Shares of construction and mining equipment maker, Caterpillar Inc. CAT  fell 1.7% on Sep 3, thanks to trade tensions. Demand for the company's machinery also got hampered by the slowdown in crude extraction from the Permian Basis. Caterpillar carries a Zacks Rank #3 (Hold). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .  Winners  The industries that expanded in August are Textile Mills; Furniture & Related Products; Food, Beverage & Tobacco Products; Wood Products; Petroleum & Coal Products; Nonmetallic Mineral Products; Machinery; Miscellaneous Manufacturing; and Chemical Products. Companies that deal with wood products and makes furniture, in particular, were boosted by single-family housing starts driven by low mortgage rates, low unemployment rate and strong consumer spending. In fact, repairing and remodeling activities will further raise demands. Some industries especially consumer staples like food and beverages are less affected by trade war as their revenues are more domestic focused. For instance food stocks like J & J Snack Foods Corp. JJSF  and General Mills, Inc. GIS  rose 1.3% and 0.9%, respectively. Sin stocks are also on demand as whatever may be the market condition these products are bound by habits than need. Tobacco manufacturing giant, Vector Group Ltd. VGR  stock rose 3.3%.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  General Motors Company (GM): Free Stock Analysis Report   General Mills, Inc. (GIS): Free Stock Analysis Report   J & J Snack Foods Corp. (JJSF): Free Stock Analysis Report   Caterpillar Inc. (CAT): Free Stock Analysis Report   Vector Group Ltd. (VGR): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "It has been a year now that the United States and China are in an intense trade tussle. Needless to say, that the trade war has impacted the manufacturing sector deeply in August. Seven industries in the manufacturing sector that depend on trade have contracted.",
    "Manufacturing supply chain that includes steelmakers to heavy equipment companies have been impacted by tariffs. While nine sectors have performed quiet well and reported growth, let us take a look at them.",
    " Manufacturing Sector Contracts for the First Time in 3   Years ",
    "On Sep 3, Institute of Supply Management (ISM) reported that its index of national factory activity came in at 49.1 in August, while in July it was 51.2.",
    "The ISM reading was lowest for the first time since January 2016, and has declined persistently for the last five months. The factory activities have been witnessing contraction in Europe, Japan, China and now United States.",
    "ISM's report also mentions a decline in the measure of new orders to 47.2 for the first time since December 2015. Meanwhile, the ISM's production gauge fell to 49.5 last month. Thanks to the trade war, ISM's measure of export orders has sunk to 43.3 in August. The reading hit its lowest level since April 2009.",
    " Trade War Hurts U.S. Manufacturing ",
    "The U.S. manufacturing sector suffered losses owing to trade tensions. Trump's administration on Sep 1 announced an additional 15% tariff on $125 billion of Chinese goods that include shoes, clothing and household appliances like coffee makers, toasters and microwave.",
    "In retaliation, China on Sep 2 imposed additional tariffs on $75-billion U.S. imports, which include 5% duties on U.S. crude oil. China has also filed a complaint with the World Trade Organization over U.S. import duties for violating the consensus reached by both the countries in Osaka, Japan.",
    "The extra tariffs of 5% and 10% have been imposed by China on 1,717 products out of the total of 5,078 products originating from the United States. Chinese administration will start collecting additional tariffs on the rest of the products from Dec 15.",
    " Losers ",
    "Per ISM's report, the seven sectorsApparel, Leather & Allied Products; Fabricated Metal Products; Transportation Equipment; Primary Metals; Plastics & Rubber Products; Paper Products; and Electrical Equipment, Appliances & Components, have reported a contraction. The rise in tariffs has impacted their supply chain, resulting in a drop in new orders.",
    "President Trump was hoping that his tariffs on steel and aluminum imports would help U.S. manufacturers but the effect is quite the contrary.",
    "The U.S. steel producers industry was boosted by growth in Chinese production, while demand for steel has slowed down in China owing to the trade war. This is causing a decline in steel prices, eventually affecting American producers.",
    "Major automakers, including General Motors Company GM  , had to cease production in the Ohio car plant and Michigan transmission factory due to the trade war. General Motors' shares fell 0.5% on Sep 3. Meanwhile, Nissan Motor, Fiat Chrysler and Honda Motor are all reducing their production shifts.",
    "Shares of construction and mining equipment maker, Caterpillar Inc. CAT  fell 1.7% on Sep 3, thanks to trade tensions. Demand for the company's machinery also got hampered by the slowdown in crude extraction from the Permian Basis. Caterpillar carries a Zacks Rank #3 (Hold). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    " Winners ",
    "The industries that expanded in August are Textile Mills; Furniture & Related Products; Food, Beverage & Tobacco Products; Wood Products; Petroleum & Coal Products; Nonmetallic Mineral Products; Machinery; Miscellaneous Manufacturing; and Chemical Products.",
    "Companies that deal with wood products and makes furniture, in particular, were boosted by single-family housing starts driven by low mortgage rates, low unemployment rate and strong consumer spending. In fact, repairing and remodeling activities will further raise demands.",
    "Some industries especially consumer staples like food and beverages are less affected by trade war as their revenues are more domestic focused. For instance food stocks like J & J Snack Foods Corp. JJSF  and General Mills, Inc. GIS  rose 1.3% and 0.9%, respectively.",
    "Sin stocks are also on demand as whatever may be the market condition these products are bound by habits than need. Tobacco manufacturing giant, Vector Group Ltd. VGR  stock rose 3.3%.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:38:00"
}