{
  "url": "https://www.nasdaq.com/article/south-africas-rand-falls-on-growth-worries-naspers-slumps-20190911-00599",
  "title": "South Africa's rand falls on growth worries, Naspers slumps - Nasdaq.com",
  "text": [
    "JOHANNESBURG, Sept 11 (Reuters) - South Africa's rand weakened on Wednesday after data showing business confidence in the country has collapsed, undermining a push by President Cyril Ramaphosa to kick-start growth after a decade of stagnation.",
    "Stocks rose, despite a plunge is bourse heavyweight Naspers Ltd, as the prospect of increased stimulus in major economies underpinned risk-on buying in emerging markets.",
    "At 1540 GMT the rand  was 0.79% weaker at 14.7525 per dollar, giving up some of its recent gains spurred by better-than-expected second-quarter economic growth data and comments by ratings firm Moody's that a downgrade to sub-investment was unlikely in the near term. ",
    "On the other hand, the Rand Merchant Bank business confidence index compiled by the Bureau for Economic Research plunged to a 20-year low in the third quarter. ",
    "\"With confidence in all sectors net negative, there is clearly no prospect of a sustained recovery in fixed investment spending or job creation in the short to medium term,\" Elize Kruger at NKC African Economics said in a note.",
    "\"Time is running out for the economy, as businesses that have lost hope will soon look for opportunities elsewhere, to the detriment of the South African economy.\"",
    "On the bourse, the Johannesburg All-Share Index  was up 1.64% to 56,243 points, while the benchmark top-40 index  gained 1.77% to 50,359 points.",
    "Naspers tumbled 30% to 2,465 rand, following the market debut of its spin-off Prosus  in Amsterdam, acting similar to a share that has gone ex-dividend. ",
    "Prosus comprises Naspers' global empire of consumer internet assets, with the jewel in the crown a 31% stake in Chinese tech titan Tencent Holdings Ltd .",
    "Naspers is retaining a controlling 75% stake in Prosus. The Tencent stake has been worth more than Naspers itself for years and dominated the $103 billion group's finances. One motivation for spinning off Prosus was to narrow that value gap.",
    "In fixed income, the yield on the benchmark paper due in 2026  was up 3 basis points to 8.16%."
  ],
  "published_datetime": "2019-09-11 11:54:00"
}