{
  "url": "https://www.nasdaq.com/article/imkta-vs-wmt-which-stock-should-value-investors-buy-now-cm1207990",
  "title": "IMKTA vs. WMT: Which Stock Should Value Investors Buy Now? - Nasdaq.com",
  "text": [
    " Investors interested in stocks from the Retail - Supermarkets sector have probably already heard of Ingles (IMKTA) and Walmart (WMT). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look. The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The Zacks Rank is a proven strategy that targets companies with positive earnings estimate revision trends, while our Style Scores work to grade companies based on specific traits. Right now, Ingles is sporting a Zacks Rank of #1 (Strong Buy), while Walmart has a Zacks Rank of #3 (Hold). This means that IMKTA's earnings estimate revision activity has been more impressive, so investors should feel comfortable with its improving analyst outlook. But this is only part of the picture for value investors. Value investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels. The Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P/E ratio, P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value. IMKTA currently has a forward P/E ratio of 10.16, while WMT has a forward P/E of 23.63. We also note that IMKTA has a PEG ratio of 0.70. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. WMT currently has a PEG ratio of 5. Another notable valuation metric for IMKTA is its P/B ratio of 1.24. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, WMT has a P/B of 4.29. These metrics, and several others, help IMKTA earn a Value grade of A, while WMT has been given a Value grade of C. IMKTA has seen stronger estimate revision activity and sports more attractive valuation metrics than WMT, so it seems like value investors will conclude that IMKTA is the superior option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Ingles Markets, Incorporated (IMKTA): Free Stock Analysis Report   Walmart Inc. (WMT): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors interested in stocks from the Retail - Supermarkets sector have probably already heard of Ingles (IMKTA) and Walmart (WMT). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look.",
    "The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The Zacks Rank is a proven strategy that targets companies with positive earnings estimate revision trends, while our Style Scores work to grade companies based on specific traits.",
    "Right now, Ingles is sporting a Zacks Rank of #1 (Strong Buy), while Walmart has a Zacks Rank of #3 (Hold). This means that IMKTA's earnings estimate revision activity has been more impressive, so investors should feel comfortable with its improving analyst outlook. But this is only part of the picture for value investors.",
    "Value investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels.",
    "The Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P/E ratio, P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value.",
    "IMKTA currently has a forward P/E ratio of 10.16, while WMT has a forward P/E of 23.63. We also note that IMKTA has a PEG ratio of 0.70. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. WMT currently has a PEG ratio of 5.",
    "Another notable valuation metric for IMKTA is its P/B ratio of 1.24. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, WMT has a P/B of 4.29.",
    "These metrics, and several others, help IMKTA earn a Value grade of A, while WMT has been given a Value grade of C.",
    "IMKTA has seen stronger estimate revision activity and sports more attractive valuation metrics than WMT, so it seems like value investors will conclude that IMKTA is the superior option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:40:22"
}