{
  "url": "https://www.nasdaq.com/article/top-stock-reports-for-att-thermo-fisher-schwab-cm1206953",
  "title": "Top Stock Reports for AT&T, Thermo Fisher & Schwab - Nasdaq.com",
  "text": [
    "Tuesday, September 3, 2019",
    "The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features updated research reports on 16 major stocks, including AT&T (T), Thermo Fisher (TMO) and Schwab (SCHW). These research reports have been hand-picked from roughly 70 reports published by our analyst team today.",
    "You can see  all of today's research reports here >>>",
    "AT&T 's shares have gained +10.7% over the past year, outperforming the Zacks Wireless National industry's increase of +7.7%. AT&T is improving critical services that support Public Safety and first responders using the FirstNet communications platform.",
    "The wireless carrier's LTE network reaches more than 400 million people in North America. It aims to deploy a standards-based, nationwide mobile 5G network in early 2020. AT&T's 5G Evolution technology is live in more than 200 markets, and is expected to reach more than 400 markets by the end of 2019. It is on track to achieve its target of 2.5x debt-to-EBITDA range by 2019.",
    "However, the Zacks analyst thinks the company is witnessing a steady decline in linear TV subscribers and legacy services. Its wireline division is facing loss in access line due to competitive pressure from Voice over Internet Protocol service providers. As the company tries to woo customers with discounts, freebies and cash credits, margin pressures tend to soar.",
    "(You can  read the full research report on AT&T here >>> ).",
    "Shares of Thermo Fisher have outperformed the Zacks Medical Instruments industry in the past three months (+7.1% vs. +5.6%). The Zacks analyst thinks Thermo Fisher has recently been demonstrating strength in all end markets categorized by customer type or geography. In the second quarter, the company registered solid international performance with growth in Europe and Asia-Pacific including China.",
    "A series of product launches aided its performance. The company's recent purchase of Brammer Bio in the field of Gene and Cell Therapy is a major positive. Thermo Fisher's Specialty Diagnostics business, even in the face of the divestment of its anatomical pathology unit, holds immense potential.",
    "The company's raised 2019 guidance looks encouraging. On the flip side, Thermo Fisher's operating segments are getting impacted by unfavorable business mix. Competitive headwinds and escalating costs pose threat.",
    "(You can  read the full research report on Thermo Fisher here >>> ).",
    "Schwab 's shares have underperformed the Zacks Investment Brokers industry over the past six months, declining -16.2% vs. -7.5%. However, the Zacks analyst thinks the company has a decen t earnings surprise history. Its earnings have surpassed expectations in three of the trailing four quarters.",
    "The company's planned acquisition of USAA's Investment Management Company, efforts to strengthen trading business and improvement in operating efficiency bode well for the future. Additionally, the company's steady capital deployment actions are commendable and are expected to continue to enhance shareholder value.",
    "Nevertheless, a dismal rate scenario remains a major concern for the company and will likely hamper margin and top-line growth in the upcoming quarters. Rising operating expenses (mainly related to compensation costs and regulatory charges) are likely to hurt bottom-line growth to some extent.",
    "(You can  read the full research report on Schwab here >>> ).",
    "Other noteworthy reports we are featuring today include HEICO (HEI), Veeva Systems (VEEV) and PVH Corp. (PVH).",
    "Legalizing THIS Could Be Even Bigger than Marijuana",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "See these 5 \"sin stocks\" now >>",
    "Note: Our Director of Research Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trendsand Earnings Previewreports. If you want an email notification each time Sheraz publishes a new article, please click here>>>",
    "AT&T (T) Buoyed by Communications Unit, Deleveraging Efforts",
    "Recent Purchase of Brammer Bio Aids Thermo Fisher (TMO).",
    "Focus on Trading Revenues Aid Schwab (SCHW) Amid Rate Cuts",
    "Core Subscription Segment Aids Veeva (VEEV) Amid Competition",
    "Veeva has been gaining from strong contributions of its core Subscription business segment. The Zacks analyst is apprehensive about the intense competition in the healthcare IT market.",
    "Core Animal Health Unit Boosts Patterson Companies (PDCO)",
    "Per the Zacks analyst, Patterson Companies continues to benefit from lucrative prospects in its core Animal Health unit. However, rise in operating costs remains a concern.",
    "AECOM (ACM) Rides on Strategic Initiatives, Low Demand Hurts",
    "Per the Zacks analyst, strategic restructuring initiatives to improve profitability and de-risk its business profile bode well for AECOM. However, cyclical demand for services raises concerns.",
    "Immunomedics (IMMU) Focuses on Lead Candidate Amid Competition",
    "Per the Zacks analyst, the company remains focused on the development of its lead candidate sacituzumab govitecan is currently under review with the FDA as a third-line therapy for metastatic breast",
    "Low Costs Aid Golar LNG (GLNG) Amid Shipping Market Weakness",
    "Per the Zacks analyst, low expenses owing to reduced vessel operating costs are a boon to the company. However, seasonal sluggishness in the shipping market and high debt levels are worrisome.",
    "Acquisition Strategy, Strong Financials Aids HEICO (HEI)",
    "Per the Zacks analyst, disciplined acquisition strategy has been a pivotal element for the company's overall growth.",
    "Brand Strength Aids PVH Corp (PVH), Foreign Currency Hurts",
    "Per Zacks analyst, PVH Corp has been experiencing continued strength across its brands, particularly Tommy Hilfiger.",
    "FTI Consulting (FCN) Rides on Portfolio & Network Strength",
    "The Zacks analyst is impressed by FTI Consulting's ability to offer damage assessment, accounting, economics, statistics, finance and industry on a single platform, which attracts clients globally.",
    "Application Software Segment Drives Roper Technologies (ROP)",
    "Per the Zacks analyst, solid performance of Roper's Application Software segment, led by growth in SaaS & subscription revenue stream and strength in Strata business will lend momentum to the company.",
    "Lithia's (LAD) Acquisition of Dealerships to Boost Prospects",
    "Per the Zacks analyst, the recent acquisitions of Lincoln Morgantown and Hazleton Honda dealerships are expected to boost Lithia Motors' profitability and prospects going forward.",
    "Rate Cuts, Higher Expenses to Hurt State Street (STT) Growth",
    "Per the Zacks analyst, the Federal Reserve's accommodative stance on interest rates, disappointing capital markets performance and mounting expenses will hurt State Street's financials to some extent.",
    "Trimble (TRMB) Hurt by U.S.-China Trade War & Brexit Impacts",
    "Per the Zacks analyst, U.S.-China trade war is impacting Trimble's agriculture business negatively. Further, Brexit is hindering new investments in European plant and infrastructure.",
    "High SG&A Costs a Concern for Sprouts Farmers' (SFM) Margins",
    "Per the Zacks analyst, rise in SG&A costs due to investments in new outlets and higher interchange fees may hurt margins. Sprouts Farmers expects full year SG&A to climb 10.5% year over year.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:36:00"
}