{
  "url": "https://www.nasdaq.com/article/preciousgold-eases-as-equities-gain-on-brexit-hong-kong-progress-20190904-01228",
  "title": "PRECIOUS-Gold eases as equities gain on Brexit, Hong Kong progress - Nasdaq.com",
  "text": [
    "Sept 5 (Reuters) - Gold prices fell on early Thursday, withan uptick in equities propped up by positive developments aroundBrexit deadlock and Hong Kong protests, but prices hovered nearover six-year high hit in the last session on persistentconcerns about slowing global growth.   ",
    "FUNDAMENTALS",
    "* U.S. gold futures GCv1 were down 0.2% at $1,557.8 anounce.",
    "* The dollar index .DXY , which measures the greenbackagainst a basket of currencies, dipped to a one-week low, whileAsian stocks perked up on progress in the political crises inBritain and Hong Kong. USD/MKTS/GLOB",
    "* Hong Kong leader Carrie Lam, in a pre-recorded televisedmessage, on Wednesday formally withdrew the bill, acceding toone of the five demands by pro-democracy protesters, althoughmany demonstrators and lawmakers said the move was too little,too late. urn:newsml:reuters.com:*:nL3N25V0NCurn:newsml:reuters.com:*:nL3N25V2I3",
    "* The British parliament voted on Wednesday to prevent PrimeMinister Boris Johnson taking Britain out of the European Unionwithout a deal on Oct. 31, but rejected his first bid to call asnap election two weeks before the scheduled exit. urn:newsml:reuters.com:*:nL5N25V2FD",
    "* The U.S. economy grew at a modest pace in recent weeks,with manufacturing buffeted by a global slowdown while consumerpurchases gave mixed signals on the strength of householdspending, the Federal Reserve reported on Wednesday. urn:newsml:reuters.com:*:nTLA4KEF7L [ urn:newsml:reuters.com:*:nL2N25V0V8]",
    "* Christine Lagarde took a major step towards becoming theEuropean Central Bank's next president on Wednesday, securingthe backing of a European Parliament committee after pledging tokeep policy loose while undertaking a broader strategy review. urn:newsml:reuters.com:*:nL5N25V2H7urn:newsml:reuters.com:*:nL5N25V5LU",
    "* The London Metal Exchange's gold and silver futures arebeing thrown into doubt, with the imminent resignation ofSociete Generale SOGN.PA as a market maker threatening todeepen a decline in trading activity, three sources said. urn:newsml:reuters.com:*:nL5N25H50Z",
    "* Holdings in SPDR Gold TrustGLD , the world's largestgold-backed exchange-traded fund, rose 0.66% to 895.90 tonnes onWednesday. urn:newsml:reuters.com:*:nAQN0000KR",
    "* India's gold imports plunged 73% in August from a year agoto the lowest level in three years as a rally in local prices toa record high and a hike in import duty discouraged retailbuying, a government source said on Wednesday. urn:newsml:reuters.com:*:nL3N25V15O",
    "DATA AHEAD0600   Germany    Industrial Orders MM          July1230   U.S.       Initial Jobless Claims        Weekly1345   U.S.       Markit Comp, Svcs Final PMIs  Aug1400   U.S.       Factory Orders MM             July1400   U.S.       ISM N-Mfg PMI                 Aug",
    " (Reporting by Eileen Soreng in Bengaluru; Editing by RashmiAich) ((eileen.soreng@thomsonreuters.com; Within U.S. +1 646 2238780, Outside U.S. +91 80 6749 6131; Reuters Messaging:eileen.soreng.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-04 09:59:00"
}