{
  "url": "https://www.nasdaq.com/article/hd-supplys-presto-buyout-to-boost-mro-distribution-business-cm1207715",
  "title": "HD Supply's Presto Buyout to Boost MRO Distribution Business - Nasdaq.com",
  "text": [
    "HD Supply Holdings, Inc.HDS , on Sep 3, announced that it successfully completed the acquisition of Presto Maintenance Supply. Financial terms of the transaction were not disclosed.\r\n Notably, the company's share price has increased roughly 0.7% in the past two days, closing the trading session at $39.19.\r\n Presto is a Houston-based Maintenance, Repair and Operations (\"MRO\") distribution company for customers in the multifamily industry. It primarily provides products related to plumbing, electrical, janitorial, pool, lighting and others. Popular product brands include Kwikset, Lysol, NuTone and Pentair. In 2018, Presto generated $15 million in revenues.\r\n As noted, HD Supply will integrate Presto with its Facilities Maintenance segment. The segment engages in distributing MRO products, providing customer products and value-added services to customers in the healthcare, multifamily, institutional and hospitality industry.\r\n In the first quarter of fiscal 2019 (ended May 5, 2019), Facilities Maintenance accounted for 51.7% of HD Supply's revenues. On a year-over-year basis, the segment's revenues represented growth of 6.8% from the year-ago quarter.\r\n HD Supply believes that the Presto buyout will strengthen its abilities to serve customers more efficiently. Also, it will help the company expand business footprints in end-markets served by Presto.\r\n For fiscal 2019 (ending January 2020), HD Supply anticipates that approximately 1-2% growth in \"Living Space\" MRO will boost the performance of the Facilities Maintenance segment. Net sales for the company are predicted to be $6,250-$6,350 million in the year.Zacks Rank & Key Picks\r\n With a market capitalization of nearly $6.7 billion, HD Supply currently carries a Zacks Rank #3 (Hold). The company stands to gain from the strengthening non-residential construction market, reduced financial flexibility and acquired assets. However, woes related to tariffs on China imports, unfavorable weather conditions and shortage of skilled labor might hurt its operations and thus its profitability.\r\n In the past 60 days, the Zacks Consensus Estimate for HD Supply's earnings has been lowered by 0.3% to $3.58 for fiscal 2019 and maintained at $3.34 for fiscal 2020 (ending January 2021).HD Supply Holdings, Inc. Price and Consensus",
    "HD Supply Holdings, Inc. price-consensus-chart | HD Supply Holdings, Inc. Quote\r\n Also, the company's share price has dipped 6.3% in the past three months compared with the industry 's decline of 6.8%.",
    "\r\n Some better-ranked stocks in the Zacks Industrial Products sector are Graham Corporation GHM , DXP Enterprises, Inc. DXPE and Chart Industries, Inc. GTLS . All these stocks currently carry a Zacks Rank #2 (Buy). You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here .\r\n In the past 60 days, earnings estimates for these companies improved for the current year. Further, earnings surprise for the las t report ed quarter was 100% for Graham, 4.29% for DXP Enterprises and 11.48% for Chart Industries.It's Illegal in 42 States, But Investors Will Make Billions Legally\r\n In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.\r\n That's twice as much as they spend on marijuana, legally or otherwise.\r\n Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special\r\n Report revealing 5 top stocks to watch in this space.See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 07:22:00"
}