{
  "url": "https://www.nasdaq.com/article/2-of-the-safest-bets-in-the-cannabis-industry-cm1207660",
  "title": "2 of the Safest Bets in the Cannabis Industry - Nasdaq.com",
  "text": [
    " Cannabis stocks have been crashing over   recent months    . Investors have turned bearish on the industry as companies   have continued to record significant losses even as sales have   been soaring. There's no doubt the cannabis sector offers   great potential, with a recent estimate   projecting the Canadian and U.S. markets to be   worth a combined $47.3 billion by 2024    . But finding safe opportunities to take advantage of that   growth can be difficult for investors. The good news is that   because other industries are getting involved in cannabis, you   don't have to buy pure-play cannabis stocks to take advantage of   those opportunities. Here are two more established companies with   sustainable businesses that will be able to benefit from the   growth in the industry as well.  1. Altria Group  Cigarette company   Altria Group    (NYSE: MO),  which owns the popular Marlboro brand within   the U.S., could be in a great position to take advantage of the   industry's growth without that much risk. With revenues north of   $19 billion in each of the past three years and no trouble   turning a profit, Altria is a strong business that pays a high   dividend yield    of more than 7.6%. Although the stock has fallen 10% this year,   it could still be a great buy all on its own.makeArticleAd();   Image source: Getty Imcages.  What makes Altria more attractive, however, is that the   company has   invested    in cannabis producer   Cronos Group    (NASDAQ: CRON) . Getting into cannabis gives the cigarette maker   the potential to benefit from a lot of crossover between the two   industries. Vaping, for instance, is popular among both cannabis   and tobacco users, and with Altria holding a 35% stake in Juul   Labs, it presents an attractive growth opportunity in both   industries. The opportunity could be even bigger if Altria ends up merging   with   Philip Morris    (NYSE: PM) , adding even more resources into the mix. But even   without the merger, at the very least, Altria gives cannabis   investors a way to benefit from a more financially stable stock   that has great exposure to marijuana.  2. Scotts Miracle-Gro   Scotts Miracle-Gro    (NYSE: SMG) is a good option for investors who don't want to   invest in the tobacco industry. It has also been doing a lot   better than Altria this year, with shares rising around 75% since   January. The company has tapped into the cannabis market through   its subsidiary, the Hawthorne Gardening Company. Hawthorne helps meet the agricultural needs of cannabis   growers, and as legalization continues to spread across the   country and more companies set up operations, demand for   hydroponic (growing plants without soil) supplies is going   to soar. The company aims to be a one-stop shop for cannabis   growers of all sizes. The bulk of Scotts' sales still come from its organic   business, but sales from Hawthorne have been growing much more   rapidly. In its most recent quarterly results, the company   reported year-to-date sales from Hawthorne of $461 million, or   just 17% of the company's total revenue. By comparison, more than   $2 billion in sales still came from Scotts' consumer segment.   However, with sales growth of 139%, Hawthorne has been   responsible for much of the improvement in the top line as   consumer sales have risen by just 9% from the prior year.   Cannabis-related sales have clearly had a very positive impact on   the company's financials.     Investing in Scotts is a great way to benefit from the   industry's growth without having to worry about cannabis prices   or illegal growing operations. Scotts is much safer and, like   Altria, profitability has not been a big concern.  The key takeaway  Both of these companies offer investors ways to benefit from   the popularity of cannabis without directly buying pot stocks.   With stronger financials and less risk related to the industry,   Scotts and Altria could be much safer options for investors who   want to capture the cannabis craze in their own portfolios.  10 stocks we like better than Altria Group     When investing geniuses David and Tom Gardner have a stock tip,   it can pay to listen. After all, the newsletter they have run for   over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks    for investors to buy right now... and Altria Group wasn't one of   them! That's right -- they think these 10 stocks are even better   buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       David Jagielski      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Cannabis stocks have been crashing over   recent months    . Investors have turned bearish on the industry as companies   have continued to record significant losses even as sales have   been soaring. There's no doubt the cannabis sector offers   great potential, with a recent estimate   projecting the Canadian and U.S. markets to be   worth a combined $47.3 billion by 2024    .",
    "But finding safe opportunities to take advantage of that   growth can be difficult for investors. The good news is that   because other industries are getting involved in cannabis, you   don't have to buy pure-play cannabis stocks to take advantage of   those opportunities. Here are two more established companies with   sustainable businesses that will be able to benefit from the   growth in the industry as well.",
    "Cigarette company   Altria Group    (NYSE: MO),  which owns the popular Marlboro brand within   the U.S., could be in a great position to take advantage of the   industry's growth without that much risk. With revenues north of   $19 billion in each of the past three years and no trouble   turning a profit, Altria is a strong business that pays a high   dividend yield    of more than 7.6%. Although the stock has fallen 10% this year,   it could still be a great buy all on its own.",
    "  Image source: Getty Imcages. ",
    "Image source: Getty Imcages.",
    "What makes Altria more attractive, however, is that the   company has   invested    in cannabis producer   Cronos Group    (NASDAQ: CRON) . Getting into cannabis gives the cigarette maker   the potential to benefit from a lot of crossover between the two   industries. Vaping, for instance, is popular among both cannabis   and tobacco users, and with Altria holding a 35% stake in Juul   Labs, it presents an attractive growth opportunity in both   industries.",
    "The opportunity could be even bigger if Altria ends up merging   with   Philip Morris    (NYSE: PM) , adding even more resources into the mix. But even   without the merger, at the very least, Altria gives cannabis   investors a way to benefit from a more financially stable stock   that has great exposure to marijuana.",
    " Scotts Miracle-Gro    (NYSE: SMG) is a good option for investors who don't want to   invest in the tobacco industry. It has also been doing a lot   better than Altria this year, with shares rising around 75% since   January. The company has tapped into the cannabis market through   its subsidiary, the Hawthorne Gardening Company.",
    "Hawthorne helps meet the agricultural needs of cannabis   growers, and as legalization continues to spread across the   country and more companies set up operations, demand for   hydroponic (growing plants without soil) supplies is going   to soar. The company aims to be a one-stop shop for cannabis   growers of all sizes.",
    "The bulk of Scotts' sales still come from its organic   business, but sales from Hawthorne have been growing much more   rapidly. In its most recent quarterly results, the company   reported year-to-date sales from Hawthorne of $461 million, or   just 17% of the company's total revenue. By comparison, more than   $2 billion in sales still came from Scotts' consumer segment.   However, with sales growth of 139%, Hawthorne has been   responsible for much of the improvement in the top line as   consumer sales have risen by just 9% from the prior year.   Cannabis-related sales have clearly had a very positive impact on   the company's financials.",
    "Investing in Scotts is a great way to benefit from the   industry's growth without having to worry about cannabis prices   or illegal growing operations. Scotts is much safer and, like   Altria, profitability has not been a big concern.",
    "Both of these companies offer investors ways to benefit from   the popularity of cannabis without directly buying pot stocks.   With stronger financials and less risk related to the industry,   Scotts and Altria could be much safer options for investors who   want to capture the cannabis craze in their own portfolios.",
    " 10 stocks we like better than Altria Group     When investing geniuses David and Tom Gardner have a stock tip,   it can pay to listen. After all, the newsletter they have run for   over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks    for investors to buy right now... and Altria Group wasn't one of   them! That's right -- they think these 10 stocks are even better   buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  David Jagielski      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:04:31"
}