{
  "url": "https://www.nasdaq.com/article/what-does-chinas-falling-rmb-mean-for-macau-gaming-stocks-cm1210844",
  "title": "What Does China’s Falling RMB Mean For Macau Gaming Stocks? - Nasdaq.com",
  "text": [
    " Given that it's illegal to gamble in China, Macau has been a   popular destination for Chinese tourists for years. Not only is   gambling legal in Macau but the city has also transformed itself   into an entertainment destination. With Macau situated right next to some of China's richest   provinces, casinos there attract a substantial portion of Chinese   gamblers. While the gaming experiences available in Singapore and   Las Vegas are comparable, they are much further away   geographically.   Image Source: Getty Images.makeArticleAd();  It may not be widely known but Macau used to rely on the   high-roller VIP crowd to power revenue growth, but lately the   city has become more determined to court ordinary Chinese, also   known as the \"mass market\" crowd, for sales. This is a positive development trend for Macau casinos given   that the mass market crowd keep growing as China's middle class   expands. Not only this but the mass market is also a more   sustainable revenue driver than VIP high rollers. In terms of the mass market share,   Sands China Ltd    (SEHK: 01928) is the leader at around 29.5%.   Galaxy Entertainment Group Limited    (SEHK: 0027) is second at 18.7%, while   Wynn Macau    (SEHK: 1128) has 12.2%.  RMB depreciation  Meanwhile, the Chinese economy has slowed recently. The trade   tensions between the US and China have injected uncertainty into   the economy, and the Chinese government's stimulus response has   yet to turn the economy around. After years of growing at around   7%, China's economy could now grow at 6% or less. Some economists think China's economy will only grow 6.2-6.3%   in 2019 and many analysts have cut their GDP growth forecasts to   below 6% for 2020. The dim outlook has caused the RMB to weaken.   Before August, the RMB had never traded below the symbolic   7-level to the US dollar since 2008. Due to the Chinese's government response to US tariffs,   however, the currency now trades around 7.15 times to the US   dollar. Some analysts think that the RMB could depreciate to as   low as 7.2 times the US dollar and this can end up   negatively impacting a lot of Chinese   businesses    .  How weak RMB plays out in Macau  Although a currency drop of 4% or 5% doesn't sound like much,   it can matter a lot. Many businesses operate on net margins of   10% or less and a 5% decrease in sales for a business, with   mainly fixed costs, could mean a decline in profit of around   50%. Broadly, casinos fit the criteria of currency-sensitive   businesses. They have high fixed costs due to the need to buy   gambling licenses and the need to pay for expensive casino   buildings upfront. Given that casinos in Macau derive most of   their business from Chinese punters, a lower RMB means lower   spending power for gamblers, which could translate to lower   sales. Indeed, as a result of the weaker RMB, as well as the slowing   Chinese economy, and the social unrest in Hong Kong, Macau gross   sales have weakened. In August, gross gaming revenue (GGR) for   the gambling hub was 24.3 billion patacas (US$3.0 billion), down   8.6% year-on-year. In July, GGR in Macau also fell 3.5%   year-on-year.  Foolish takeaway  Given that \"leisure\" sectors tend to be economically   sensitive, casino stocks depend a lot on the state of the Chinese   economy. When times are bad or uncertain, consumers are less   inclined to spend on discretionary items such as watching   entertainment shows or gambling. In the short run, Macau's casino stocks face negative exposure   from the trade war and the depreciating RMB. If the RMB   depreciates further - or the trade tensions worsen - Macau casino   stocks might not do as well. In the long run, though, Macau casinos benefit from the   opening of the Hong Kong-Zhuhai-Macau bridge as well as the   growth of the Chinese middle class. Macau casino stocks could   still be solid long-term investments but investors will likely   have to ride out volatility in the near term.  A version of this article originally appeared on our Fool     Asia site. For more coverage like this head over to      Fool.hk.en.    10 stocks we like better than GALAXY ENTMNT GROUP     ORD       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and GALAXY ENTMNT GROUP ORD     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       The Motley Fool has no position in any of the stocks     mentioned. The Motley Fool has a     disclosure policy      .  ",
    "Given that it's illegal to gamble in China, Macau has been a   popular destination for Chinese tourists for years. Not only is   gambling legal in Macau but the city has also transformed itself   into an entertainment destination.",
    "With Macau situated right next to some of China's richest   provinces, casinos there attract a substantial portion of Chinese   gamblers. While the gaming experiences available in Singapore and   Las Vegas are comparable, they are much further away   geographically.",
    "  Image Source: Getty Images.makeArticleAd(); ",
    "Image Source: Getty Images.",
    "It may not be widely known but Macau used to rely on the   high-roller VIP crowd to power revenue growth, but lately the   city has become more determined to court ordinary Chinese, also   known as the \"mass market\" crowd, for sales.",
    "This is a positive development trend for Macau casinos given   that the mass market crowd keep growing as China's middle class   expands. Not only this but the mass market is also a more   sustainable revenue driver than VIP high rollers.",
    "In terms of the mass market share,   Sands China Ltd    (SEHK: 01928) is the leader at around 29.5%.   Galaxy Entertainment Group Limited    (SEHK: 0027) is second at 18.7%, while   Wynn Macau    (SEHK: 1128) has 12.2%.",
    "Meanwhile, the Chinese economy has slowed recently. The trade   tensions between the US and China have injected uncertainty into   the economy, and the Chinese government's stimulus response has   yet to turn the economy around. After years of growing at around   7%, China's economy could now grow at 6% or less.",
    "Some economists think China's economy will only grow 6.2-6.3%   in 2019 and many analysts have cut their GDP growth forecasts to   below 6% for 2020. The dim outlook has caused the RMB to weaken.   Before August, the RMB had never traded below the symbolic   7-level to the US dollar since 2008.",
    "Due to the Chinese's government response to US tariffs,   however, the currency now trades around 7.15 times to the US   dollar. Some analysts think that the RMB could depreciate to as   low as 7.2 times the US dollar and this can end up   negatively impacting a lot of Chinese   businesses    .",
    "Although a currency drop of 4% or 5% doesn't sound like much,   it can matter a lot. Many businesses operate on net margins of   10% or less and a 5% decrease in sales for a business, with   mainly fixed costs, could mean a decline in profit of around   50%.",
    "Broadly, casinos fit the criteria of currency-sensitive   businesses. They have high fixed costs due to the need to buy   gambling licenses and the need to pay for expensive casino   buildings upfront. Given that casinos in Macau derive most of   their business from Chinese punters, a lower RMB means lower   spending power for gamblers, which could translate to lower   sales.",
    "Indeed, as a result of the weaker RMB, as well as the slowing   Chinese economy, and the social unrest in Hong Kong, Macau gross   sales have weakened. In August, gross gaming revenue (GGR) for   the gambling hub was 24.3 billion patacas (US$3.0 billion), down   8.6% year-on-year. In July, GGR in Macau also fell 3.5%   year-on-year.",
    "Given that \"leisure\" sectors tend to be economically   sensitive, casino stocks depend a lot on the state of the Chinese   economy. When times are bad or uncertain, consumers are less   inclined to spend on discretionary items such as watching   entertainment shows or gambling.",
    "In the short run, Macau's casino stocks face negative exposure   from the trade war and the depreciating RMB. If the RMB   depreciates further - or the trade tensions worsen - Macau casino   stocks might not do as well.",
    "In the long run, though, Macau casinos benefit from the   opening of the Hong Kong-Zhuhai-Macau bridge as well as the   growth of the Chinese middle class. Macau casino stocks could   still be solid long-term investments but investors will likely   have to ride out volatility in the near term.",
    " A version of this article originally appeared on our Fool     Asia site. For more coverage like this head over to      Fool.hk.en. ",
    "  10 stocks we like better than GALAXY ENTMNT GROUP     ORD       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and GALAXY ENTMNT GROUP ORD     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than GALAXY ENTMNT GROUP     ORD       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and GALAXY ENTMNT GROUP ORD     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " The Motley Fool has no position in any of the stocks     mentioned. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 05:23:00"
}