{
  "url": "https://www.nasdaq.com/article/patterson-companies-is-oversold-cm1206933",
  "title": "Patterson Companies is Oversold - Nasdaq.com",
  "text": [
    "The DividendRank  formula at Dividend Channel  ranks a coverage universe of thousands of  dividend stocks  , according to a proprietary formula designed to identify those stocks that combine two important characteristics - strong fundamentals and a valuation that looks inexpensive. Patterson Companies Inc (Symbol: PDCO) presently has an above average rank, in the top 50% of the coverage universe, which suggests it is among the top most \"interesting\" ideas that merit further research by investors.    But making Patterson Companies Inc an even more interesting and timely stock to look at, is the fact that in trading on Tuesday, shares of PDCO entered into oversold territory, changing hands as low as $15.98 per share. We define oversold territory using the Relative Strength Index, or RSI, which is a technical analysis indicator used to measure momentum on a scale of zero to 100. A stock is considered to be oversold if the RSI reading falls below 30. In the case of Patterson Companies Inc, the RSI reading has hit 29.9 - by comparison, the universe of dividend stocks covered by Dividend Channel  currently has an average RSI of 47.2. A falling stock price - all else being equal - creates a better opportunity for dividend investors to capture a higher yield. Indeed, PDCO's recent annualized dividend of 1.04/share (currently paid in quarterly installments) works out to an annual yield of 6.22% based upon the recent $16.72 share price.    A bullish investor could look at PDCO's 29.9 RSI reading today as a sign that the recent heavy selling is in the process of exhausting itself, and begin to look for entry point opportunities on the buy side. Among the fundamental datapoints dividend investors should investigate to decide if they are bullish on PDCO is its dividend history. In general, dividends are not always predictable; but, looking at the history chart below can help in judging whether the most recent dividend is likely to continue.  makeArticleAd();        Click here to find out what 9 other oversold   dividend stocks you need to know about »  ",
    "  Click here to find out what 9 other oversold   dividend stocks you need to know about » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:28:35"
}