{
  "url": "https://www.nasdaq.com/article/mobile-phone-sales-plunge-at-britains-dixons-carphone-20190905-00089",
  "title": "Mobile phone sales plunge at Britain's Dixons Carphone - Nasdaq.com",
  "text": [
    "LONDON, Sept 5 (Reuters) - Britain'sDixons Carphone  on Thursday reported another big fall in mobile phone sales in its latest quarter, though it maintained its financial guidance for the full 2019-20 year and said its turnaround was on track.",
    "Dixons Carphone has been hurt by a shift in the mobile phone market as customers keep their handsets for longer, choose",
    "cheaper SIM-only deals, and turn to more flexible credit-based",
    "In June the group said it would accelerate its response to the changing mobile market after reporting a 22% slump in annual profit and warned of another big fall in the current year. ",
    "The group, which trades as Currys, PC World and Carphone Warehouse in Britain, said like-for-like sales in its UK & Ireland mobile phones division fell 10% in the 13 weeks to July 27, its fiscal first quarter, having fallen 4% in the last financial year.",
    "\"The mobile market is as challenging as expected, underlining the need for the decisive actions that we set out in June,\" said Chief Executive Alex Baldock.",
    "Baldock has renegotiated all of the group's legacy contracts with network providers Vodafone , EE  and O2 . He is also revamping the group's mobile product range, including improved choice in SIM-only deals and flexible credit based bundles.",
    "Its shares were up 1.7% at 0723 GMT, paring losses over the last year to 29%.",
    "\"TROUGH YEAR\"",
    "Dixons Carphone said first quarter like-for-like sales in its UK & Ireland electricals division rose 2%, while sales in its international division on the same basis were up 4%. Overall group like-for-like sales were flat - in line with analysts' consensus expectations.",
    "\"The current political and economic climate is volatile but, assuming no material disruption from that, we stand by our full year guidance,\" added Baldock, who expects 2019-20 to be \"the trough year\" for mobile losses.",
    "Industry data published on Tuesday showed British retailers saw their sales flat-line in August as shoppers cut back on non-essentials. ",
    "Economists say recent signs of a weakening in spending by households raise the risk of a recession as the country prepares to leave the European Union.",
    "Guidance is for a group underlying pretax profit of around 210 million pounds ($258 million) in 2019-20, down from 298 million pounds made in 2018-19.",
    "\"As the year progresses, we will be able to assess more fully management's delivery against the early stages of its plan,\" said Liberum analyst Adam Tomlinson.",
    "\"Success here could generate some positive momentum in the shares.\"",
    "($1 = 0.8145 pounds)"
  ],
  "published_datetime": "2019-09-05 02:44:00"
}