{
  "url": "https://www.nasdaq.com/article/nokia-nok-flat-as-market-gains-what-you-should-know-cm1210781",
  "title": "Nokia (NOK) Flat As Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " In the latest trading session, Nokia (NOK) closed at $5.10, marking no change from the previous day. This change lagged the S&P 500's daily gain of 0.72%. Elsewhere, the Dow gained 0.85%, while the tech-heavy Nasdaq added 1.06%. Heading into today, shares of the technology company had lost 4.32% over the past month, lagging the Computer and Technology sector's gain of 2.17% and the S&P 500's gain of 2.25% in that time. NOK will be looking to display strength as it nears its nex t earnings  release. In tha t report  , analysts expect NOK to post earnings of $0.07 per share. This would mark no growth from the prior-year quarter. Meanwhile, our latest consensus estimate is calling for revenue of $6.31 billion, down 0.68% from the prior-year quarter. For the full year, our Zacks Consensus Estimates are projecting earnings of $0.27 per share and revenue of $26.22 billion, which would represent changes of 0% and -1.36%, respectively, from the prior year. Any recent changes to analyst estimates for NOK should also be noted by investors. These revisions typically reflect the latest short-term business trends, which can change frequently. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. NOK is currently a Zacks Rank #2 (Buy). Investors should also note NOK's current valuation metrics, including its Forward P/E ratio of 19.07. This valuation marks a discount compared to its industry's average Forward P/E of 22.41. The Wireless Equipment industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 101, which puts it in the top 40% of all 250+ industries. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. To follow NOK in the coming trading sessions, be sure to utilize Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Nokia Corporation (NOK): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "In the latest trading session, Nokia (NOK) closed at $5.10, marking no change from the previous day. This change lagged the S&P 500's daily gain of 0.72%. Elsewhere, the Dow gained 0.85%, while the tech-heavy Nasdaq added 1.06%.",
    "Heading into today, shares of the technology company had lost 4.32% over the past month, lagging the Computer and Technology sector's gain of 2.17% and the S&P 500's gain of 2.25% in that time.",
    "NOK will be looking to display strength as it nears its nex t earnings  release. In tha t report  , analysts expect NOK to post earnings of $0.07 per share. This would mark no growth from the prior-year quarter. Meanwhile, our latest consensus estimate is calling for revenue of $6.31 billion, down 0.68% from the prior-year quarter.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of $0.27 per share and revenue of $26.22 billion, which would represent changes of 0% and -1.36%, respectively, from the prior year.",
    "Any recent changes to analyst estimates for NOK should also be noted by investors. These revisions typically reflect the latest short-term business trends, which can change frequently. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. NOK is currently a Zacks Rank #2 (Buy).",
    "Investors should also note NOK's current valuation metrics, including its Forward P/E ratio of 19.07. This valuation marks a discount compared to its industry's average Forward P/E of 22.41.",
    "The Wireless Equipment industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 101, which puts it in the top 40% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "To follow NOK in the coming trading sessions, be sure to utilize Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:50:12"
}