{
  "url": "https://www.nasdaq.com/article/us-stockswall-street-falls-on-weak-data-trade-frictions-20190903-00842",
  "title": "US STOCKS-Wall Street falls on weak data, trade frictions - Nasdaq.com",
  "text": [
    " (For a live blog on the U.S. stock market, click LIVE/ ortype LIVE/ in a news window.)",
    "* U.S. factory sector contracts for first time since 2016",
    "* China, U.S. kick off new round of tariffs ",
    "* Casino stocks under pressure from weak Macau data",
    "* Indexes fall: Dow 1.48%, S&P 500 1.06%, Nasdaq 1.11%  (Updates to open)",
    "By Uday Sampath Kumar",
    "Sept 3 (Reuters) - Wall Street fell on Tuesday after datashowed U.S. manufacturing sector contracted for the first timesince 2016 in August, adding to fears that a protractedU.S.-China trade war could tip the world's largest economy intorecession.",
    "The Institute for Supply Management said its index ofnational factory activity decreased to 49.1, compared with areading of 51.1 estimated by analysts polled by Reuters. urn:newsml:reuters.com:*:nL2N25U0KY",
    "The weak data also weighed on U.S. Treasury yields, with thebenchmark 10-year yield US10YT=RR falling to its lowest sinceJuly 2016. Shares of banks .SPXBK , which typically come underpressure in a low interest rate environment, slid 2%. ",
    "Trade-sensitive industrials .SPLRCI slipped 1.77%, whiletechnology stocks .SPLRCT fell 1.38%. ",
    "In an escalation of their trade war, the United States onSunday began imposing 15% tariffs on a variety of Chinese goods,and China began imposing new duties on U.S. crude oil.",
    "The tariffs that went into effect on Sunday are makinginvestors increasingly cynical towards the trade war, PeterCardillo, chief market economist at Spartan Capital Securitiesin New York said. ",
    "The S&P 500 index fell 1.8% in August, its biggest monthlydrop since May, after escalating trade tensions and theinversion of a key part of the U.S. yield curve, seen as a signof recession, drove investors toward safe-haven assets.",
    "However, trade tensions were dialed down last week followingsignals that Beijing and Washington would meet in September fortalks, but Bloomberg reported on Monday that the two sides wereyet to agree on a date for the planned meeting.",
    "The energy sector .SPNY tumbled nearly 2% and was thebiggest loser among the 11 major S&P sectors, as rising OPEC andRussian crude output drove a 4% slump in oil prices. O/R",
    "Chipmakers, which draw a large portion of their revenue fromChina, also fell, with the Philadelphia Semiconductor index .SOX off 2.06%. ",
    "At 10:16 a.m. ET the Dow Jones Industrial Average .DJI wasdown 391.94 points, or 1.48%, at 26,011.34, the S&P 500 .SPX was down 30.94 points, or 1.06%, at 2,895.52 and the NasdaqComposite .IXIC was down 88.11 points, or 1.11%, at 7,874.77.",
    "U.S. casino operators felt the brunt of slowing economicgrowth in China as gambling hub Macau posted an 8.6% decline inAugust casino revenue, sending shares of Wynn Resorts LtdWYNN.O , Las Vegas Sands CorpLVS.N and MGM ResortsInternational MGM.N down between 3% and 4%. urn:newsml:reuters.com:*:nL3N25U2WY",
    "Declining issues outnumbered advancers for a 2.47-to-1 ratioon the NYSE and for a 2.65-to-1 ratio on the Nasdaq.",
    "The S&P index recorded 19 new 52-week highs and four newlows, while the Nasdaq recorded 25 new highs and 76 new lows. (Reporting by Uday Sampath in Bengaluru; Editing by AnilD'Silva and Arun Koyyur) ((UdaySampath.Kumar@thomsonreuters.com; within U.S.+1 646 2238780; Twitter: @sampath_uday; Reuters Messaging:UdaySampath.Kumar.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-03 10:43:00"
}