{
  "url": "https://www.nasdaq.com/article/why-seagate-technology-looks-like-a-good-bet-cm1210376",
  "title": "Why Seagate Technology Looks Like A Good Bet - Nasdaq.com",
  "text": [
    " Information Technology (I.T.) experts are seeing a shift in   focus to enterprise hardware and services, away from the consumer   orientation of smartphones and tablets. This will benefit   International Business Machines Corporation    , which is reinventing itself once again with acquisitions like   Red Hat, and   Hewlett Packard Enterprises    , which was spun off in 2015 from   Hewlett-Packard    . But a purer play in enterprise hardware is   Seagate Technology    (NASDAQ: STX) , as companies collect massive amounts of data that   will need Seagate's hard disk drives for storage.   Image source: Getty Images.makeArticleAd();   Seagate's competitive advantage  Seagate, a global leader in data storage, deploys   heat-assisted magnetic recording (HAMR) as the next step in   increasing hard disc capacity. HAMR uses a media magnetic   technology that allows data bits to become smaller and more   densely packed, while remaining stable. The technique uses a laser diode to heat a tiny spot on the   disc to 450 degrees Centigrade to flip the magnetic polarity of   each bit and allow data to be written. The technology vastly   increases the capacity from the preceding perpendicular magnetic   recording (PMR) technology, itself an improvement on traditional   longitudinal recording. The HAMR technology positions Seagate to pull ahead in its   rivalry with   Western Digital    (NASDAQ: WDC) , which favors solid state drive (SSD) technology,   as enterprises enter the \"data era\" and need to store and manage   massive amounts of data. Neither flash memory nor cloud storage   can begin to handle all this data so that even hybrid solutions   will need local storage capacity -- including Seagate's HDD   technology. Seagate is one of those \"left for dead\" tech hardware stocks   that is now poised to come back to life. It has struggled to keep   up with Western Digital, which has kept the lead in SSD and now   is rolling out its own new HDD technology. But Western Digital ran into a speed bump with its flash   memory technology as prices collapsed over the past year.   Recovery in that market isn't expected until 2022, when demand   should catch up with supply. This turns Seagate into the tortoise, now pulling ahead of the   hare. The company, officially based in Dublin but operating out   of Cupertino, California, is proceeding at a more conservative   pace. It has steadily increased its dividend and   bought back shares    to boost the stock price while developing its new technology. Seagate is betting on enterprise demand as the collection and   use of data skyrockets. An IDC report prepared for the company   forecast the global datasphere will grow from 33 zettabytes in   2018 to 175 zettabytes by 2025. Enterprises are less interested in technical details of how a   disk works and more interested in capacity, cost, and speed. Hard   disks have traditionally been cheaper, while solid state has been   faster and smaller, though more expensive on a storage-per-dollar   basis. The higher-capacity HDDs will maintain enterprise   interest, not only in the cloud market, but in near-line storage   as companies move to hybrid solutions using both methods.  Growth on the way  The current year, impacted by the roller coaster of trade   negotiations between the U.S. and China, is not the best gauge   for Seagate performance. The company is   ramping up its 16 terabyte HAMR disk    this year and will introduce the 20 terabyte disk next year. Adjusted earnings per share are expected to fall 7% to 8% this   fiscal year (2020) and then rise more than 10% the next fiscal   year. Average annual growth over the next five years is forecast   at 6.4%. Western Digital, by contrast, is forecast to show annual   declines of 13.8% over the next five years. Seagate stock is currently up more than 20% since i   t report    ed fiscal fourth-quarter earnings in early August, but it still   looks to be undervalued with a forward price-to-earnings (P/E)   multiple of 10.8.  The gain has shifted analysts'   recommendations, however, with several moving to hold from buy or   strong buy, while the first sell recommendations have appeared.   The consensus target price of $46.64 is well below the current   $54, hovering at the 52-week high.  Investing in this tech stock    is a bet on the explosive growth of data. It's also a bet on   Seagate's ability to deploy its HAMR technology and adapt HDD to   the challenges of artificial intelligence, big data analysis, and   the   Internet of Things    . I think that these appear to be pretty good bets.   10 stocks we like better than Seagate     Technology       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Seagate Technology wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Darrell Delamaide      has no position in any of the stocks mentioned. The Motley Fool     is short shares of IBM and has the following options: short     January 2020 $200 puts on IBM, short September 2019 $145 calls     on IBM, and long January 2020 $200 calls on IBM. The Motley     Fool has a     disclosure policy      .  ",
    "Information Technology (I.T.) experts are seeing a shift in   focus to enterprise hardware and services, away from the consumer   orientation of smartphones and tablets. This will benefit   International Business Machines Corporation    , which is reinventing itself once again with acquisitions like   Red Hat, and   Hewlett Packard Enterprises    , which was spun off in 2015 from   Hewlett-Packard    .",
    "But a purer play in enterprise hardware is   Seagate Technology    (NASDAQ: STX) , as companies collect massive amounts of data that   will need Seagate's hard disk drives for storage.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Seagate, a global leader in data storage, deploys   heat-assisted magnetic recording (HAMR) as the next step in   increasing hard disc capacity. HAMR uses a media magnetic   technology that allows data bits to become smaller and more   densely packed, while remaining stable.",
    "The technique uses a laser diode to heat a tiny spot on the   disc to 450 degrees Centigrade to flip the magnetic polarity of   each bit and allow data to be written. The technology vastly   increases the capacity from the preceding perpendicular magnetic   recording (PMR) technology, itself an improvement on traditional   longitudinal recording.",
    "The HAMR technology positions Seagate to pull ahead in its   rivalry with   Western Digital    (NASDAQ: WDC) , which favors solid state drive (SSD) technology,   as enterprises enter the \"data era\" and need to store and manage   massive amounts of data. Neither flash memory nor cloud storage   can begin to handle all this data so that even hybrid solutions   will need local storage capacity -- including Seagate's HDD   technology.",
    "Seagate is one of those \"left for dead\" tech hardware stocks   that is now poised to come back to life. It has struggled to keep   up with Western Digital, which has kept the lead in SSD and now   is rolling out its own new HDD technology.",
    "But Western Digital ran into a speed bump with its flash   memory technology as prices collapsed over the past year.   Recovery in that market isn't expected until 2022, when demand   should catch up with supply.",
    "This turns Seagate into the tortoise, now pulling ahead of the   hare. The company, officially based in Dublin but operating out   of Cupertino, California, is proceeding at a more conservative   pace. It has steadily increased its dividend and   bought back shares    to boost the stock price while developing its new technology.",
    "Seagate is betting on enterprise demand as the collection and   use of data skyrockets. An IDC report prepared for the company   forecast the global datasphere will grow from 33 zettabytes in   2018 to 175 zettabytes by 2025.",
    "Enterprises are less interested in technical details of how a   disk works and more interested in capacity, cost, and speed. Hard   disks have traditionally been cheaper, while solid state has been   faster and smaller, though more expensive on a storage-per-dollar   basis. The higher-capacity HDDs will maintain enterprise   interest, not only in the cloud market, but in near-line storage   as companies move to hybrid solutions using both methods.",
    "The current year, impacted by the roller coaster of trade   negotiations between the U.S. and China, is not the best gauge   for Seagate performance. The company is   ramping up its 16 terabyte HAMR disk    this year and will introduce the 20 terabyte disk next year.",
    "Adjusted earnings per share are expected to fall 7% to 8% this   fiscal year (2020) and then rise more than 10% the next fiscal   year. Average annual growth over the next five years is forecast   at 6.4%. Western Digital, by contrast, is forecast to show annual   declines of 13.8% over the next five years.",
    "Seagate stock is currently up more than 20% since i   t report    ed fiscal fourth-quarter earnings in early August, but it still   looks to be undervalued with a forward price-to-earnings (P/E)   multiple of 10.8.  The gain has shifted analysts'   recommendations, however, with several moving to hold from buy or   strong buy, while the first sell recommendations have appeared.   The consensus target price of $46.64 is well below the current   $54, hovering at the 52-week high.",
    " Investing in this tech stock    is a bet on the explosive growth of data. It's also a bet on   Seagate's ability to deploy its HAMR technology and adapt HDD to   the challenges of artificial intelligence, big data analysis, and   the   Internet of Things    . I think that these appear to be pretty good bets.",
    "  10 stocks we like better than Seagate     Technology       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Seagate Technology wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Seagate     Technology       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Seagate Technology wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Darrell Delamaide      has no position in any of the stocks mentioned. The Motley Fool     is short shares of IBM and has the following options: short     January 2020 $200 puts on IBM, short September 2019 $145 calls     on IBM, and long January 2020 $200 calls on IBM. The Motley     Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:30:00"
}