{
  "url": "https://www.nasdaq.com/article/are-you-looking-for-a-top-momentum-pick-why-epam-epam-is-a-great-choice-cm1207980",
  "title": "Are You Looking for a Top Momentum Pick? Why Epam (EPAM) is a Great Choice - Nasdaq.com",
  "text": [
    " Momentum investing revolves around the idea of following a stock's recent trend in either direction. In the 'long' context, investors will be essentially be \"buying high, but hoping to sell even higher.\" With this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving that way. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades. While many investors like to look for momentum in stocks, this can be very tough to define. There is a lot of debate surrounding which metrics are the best to focus on and which are poor quality indicators of future performance. The Zacks Momentum Style Score, part of the Zacks Style Scores  , helps address this issue for us. Below, we take a look at Epam (EPAM)  , which currently has a Momentum Style Score of B. We also discuss some of the main drivers of the Momentum Style Score, like price change and earnings estimate revisions. It's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Epam currently has a Zacks Rank of #2 (Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of A or B outperform the market over the following one-month period. You can see the current list of Zacks #1 Rank Stocks here >>>   Set to Beat the Market?  In order to see if EPAM is a promising momentum pick, let's examine some Momentum Style elements to see if this information technology services provider holds up. Looking at a stock's short-term price activity is a great way to gauge if it has momentum, since this can reflect both the current interest in a stock and if buyers or sellers have the upper hand at the moment. It is also useful to compare a security to its industry, as this can help investors pinpoint the top companies in a particular area. For EPAM, shares are up 1.64% over the past week while the Zacks Computers - IT Services industry is up 1.29% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 6.53% compares favorably with the industry's 1.2% performance as well. While any stock can see its price increase, it takes a real winner to consistently beat the market. That is why looking at longer term price metrics -- such as performance over the past three months or year -- can be useful as well. Over the past quarter, shares of Epam have risen 7.62%, and are up 39.56% in the last year. On the other hand, the S&P 500 has only moved 5.35% and 3.45%, respectively. Investors should also take note of EPAM's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. Right now, EPAM is averaging 366,463 shares for the last 20 days.  Earnings Outlook  The Zacks Momentum Style Score encompasses many things, including estimate revisions and a stock's price movement. Investors should note tha t earnings  estimates are also significant to the Zacks Rank, and a nice path here can be promising. We have recently been noticing this with EPAM. Over the past two months, 8 earnings estimates moved higher compared to none lower for the full year. These revisions helped boost EPAM's consensus estimate, increasing from $5.23 to $5.29 in the past 60 days. Looking at the next fiscal year, 8 estimates have moved upwards while there have been no downward revisions in the same time period.  Bottom Line  Taking into account all of these elements, it should come as no surprise that EPAM is a #2 (Buy) stock with a Momentum Score of B. If you've been searching for a fresh pick that's set to rise in the near-term, make sure to keep Epam on your short list.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  EPAM Systems, Inc. (EPAM): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Momentum investing revolves around the idea of following a stock's recent trend in either direction. In the 'long' context, investors will be essentially be \"buying high, but hoping to sell even higher.\" With this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving that way. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades.",
    "While many investors like to look for momentum in stocks, this can be very tough to define. There is a lot of debate surrounding which metrics are the best to focus on and which are poor quality indicators of future performance. The Zacks Momentum Style Score, part of the Zacks Style Scores  , helps address this issue for us.",
    "Below, we take a look at Epam (EPAM)  , which currently has a Momentum Style Score of B. We also discuss some of the main drivers of the Momentum Style Score, like price change and earnings estimate revisions.",
    "It's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Epam currently has a Zacks Rank of #2 (Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of A or B outperform the market over the following one-month period.",
    "You can see the current list of Zacks #1 Rank Stocks here >>> ",
    " Set to Beat the Market? ",
    "In order to see if EPAM is a promising momentum pick, let's examine some Momentum Style elements to see if this information technology services provider holds up.",
    "Looking at a stock's short-term price activity is a great way to gauge if it has momentum, since this can reflect both the current interest in a stock and if buyers or sellers have the upper hand at the moment. It is also useful to compare a security to its industry, as this can help investors pinpoint the top companies in a particular area.",
    "For EPAM, shares are up 1.64% over the past week while the Zacks Computers - IT Services industry is up 1.29% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 6.53% compares favorably with the industry's 1.2% performance as well.",
    "While any stock can see its price increase, it takes a real winner to consistently beat the market. That is why looking at longer term price metrics -- such as performance over the past three months or year -- can be useful as well. Over the past quarter, shares of Epam have risen 7.62%, and are up 39.56% in the last year. On the other hand, the S&P 500 has only moved 5.35% and 3.45%, respectively.",
    "Investors should also take note of EPAM's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. Right now, EPAM is averaging 366,463 shares for the last 20 days.",
    " Earnings Outlook ",
    "The Zacks Momentum Style Score encompasses many things, including estimate revisions and a stock's price movement. Investors should note tha t earnings  estimates are also significant to the Zacks Rank, and a nice path here can be promising. We have recently been noticing this with EPAM.",
    "Over the past two months, 8 earnings estimates moved higher compared to none lower for the full year. These revisions helped boost EPAM's consensus estimate, increasing from $5.23 to $5.29 in the past 60 days. Looking at the next fiscal year, 8 estimates have moved upwards while there have been no downward revisions in the same time period.",
    " Bottom Line ",
    "Taking into account all of these elements, it should come as no surprise that EPAM is a #2 (Buy) stock with a Momentum Score of B. If you've been searching for a fresh pick that's set to rise in the near-term, make sure to keep Epam on your short list.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:00:07"
}