{
  "url": "https://www.nasdaq.com/article/is-molina-healthcare-moh-outperforming-other-medical-stocks-this-year-cm1210450",
  "title": "Is Molina Healthcare (MOH) Outperforming Other Medical Stocks This Year? - Nasdaq.com",
  "text": [
    " Investors focused on the Medical space have likely heard of Molina Healthcare (MOH), but is the stock performing well in comparison to the rest of its sector peers? A quick glance at the company's year-to-date performance in comparison to the rest of the Medical sector should help us answer this question. Molina Healthcare is one of 867 companies in the Medical group. The Medical group currently sits at #3 within the Zacks Sector Rank. The Zacks Sector Rank considers 16 different groups, measuring the average Zacks Rank of the individual stocks within the sector to gauge the strength of each group. The Zacks Rank emphasizes earnings estimates and estimate revisions to find stocks with improving earnings outlooks. This system has a long record of success, and these stocks tend to be on track to beat the market over the next one to three months. MOH is currently sporting a Zacks Rank of #2 (Buy). Over the past three months, the Zacks Consensus Estimate for MOH's full-year earnings has moved 4.18% higher. This is a sign of improving analyst sentiment and a positive earnings outlook trend. Our latest available data shows that MOH has returned about 3.25% since the start of the calendar year. In comparison, Medical companies have returned an average of 2.05%. As we can see, Molina Healthcare is performing better than its sector in the calendar year. To break things down more, MOH belongs to the Medical - HMOs industry, a group that includes 11 individual companies and currently sits at #54 in the Zacks Industry Rank. Stocks in this group have lost about 5.13% so far this year, so MOH is performing better this group in terms of year-to-date returns. Investors in the Medical sector will want to keep a close eye on MOH as it attempts to continue its solid performance.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Molina Healthcare, Inc (MOH): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors focused on the Medical space have likely heard of Molina Healthcare (MOH), but is the stock performing well in comparison to the rest of its sector peers? A quick glance at the company's year-to-date performance in comparison to the rest of the Medical sector should help us answer this question.",
    "Molina Healthcare is one of 867 companies in the Medical group. The Medical group currently sits at #3 within the Zacks Sector Rank. The Zacks Sector Rank considers 16 different groups, measuring the average Zacks Rank of the individual stocks within the sector to gauge the strength of each group.",
    "The Zacks Rank emphasizes earnings estimates and estimate revisions to find stocks with improving earnings outlooks. This system has a long record of success, and these stocks tend to be on track to beat the market over the next one to three months. MOH is currently sporting a Zacks Rank of #2 (Buy).",
    "Over the past three months, the Zacks Consensus Estimate for MOH's full-year earnings has moved 4.18% higher. This is a sign of improving analyst sentiment and a positive earnings outlook trend.",
    "Our latest available data shows that MOH has returned about 3.25% since the start of the calendar year. In comparison, Medical companies have returned an average of 2.05%. As we can see, Molina Healthcare is performing better than its sector in the calendar year.",
    "To break things down more, MOH belongs to the Medical - HMOs industry, a group that includes 11 individual companies and currently sits at #54 in the Zacks Industry Rank. Stocks in this group have lost about 5.13% so far this year, so MOH is performing better this group in terms of year-to-date returns.",
    "Investors in the Medical sector will want to keep a close eye on MOH as it attempts to continue its solid performance.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:30:12"
}