{
  "url": "https://www.nasdaq.com/article/tesla-stock-jumped-54-on-wednesday-cm1210764",
  "title": "Tesla Stock Jumped 5.4% on Wednesday - Nasdaq.com",
  "text": [
    "  What happened  Shares of electric-car company   Tesla    (NASDAQ: TSLA) rose 5.2% as of 3:30 p.m. EDT on Wednesday. The   gain was Tesla's biggest jump in seven weeks, according to   MarketWatch    . Though there wasn't any news on Wednesday material enough to   justify such a sharp gain in the automaker's stock price, Tesla   shares have notably seen a clear positive upward trend recently.   This is likely an extension of this trend.   Image source: Tesla.makeArticleAd();   So what  Including Wednesday's gain, Tesla shares have risen 17% since   Aug. 23. In addition, the stock is up 12% in the past five days   alone. Some of the stock's rise may reflect sentiment from some   investors that shares were oversold in the time period leading up   to this rebound. Despite the   growth stock    's recent run-up, shares are down 33% from the stock's high of   about $366 last year. Further, a combination of soaring revenue   and headwinds for the stock price over the last 12 months has   meant Tesla's price-to-sales ratio fell from about 3.5 to 1.7. In   addition, Tesla has gone from negative free cash flow of $4.1   billion in 2017 to positive free cash flow of $1.4 billion in the   trailing-12-month period. Perhaps investors are now warming up to    Tesla stock    at this lower valuation, considering this to be a nice entry   point.  Now what  While it's interesting to ponder what's behind Tesla's   near-term stock movements, investors should remain focused on the   electric-car maker's underlying business. Specifically, investors   should look for Tesla to continue executing on its ambitious   targets for a 45% to 65% year-over-year increase in vehicle sales   in 2019 and positive net income in Q3 and beyond.   10 stocks we like better than Tesla       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Tesla wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Daniel Sparks      owns shares of Tesla. The Motley Fool owns shares of and     recommends Tesla. The Motley Fool has a     disclosure policy      .  ",
    "Shares of electric-car company   Tesla    (NASDAQ: TSLA) rose 5.2% as of 3:30 p.m. EDT on Wednesday. The   gain was Tesla's biggest jump in seven weeks, according to   MarketWatch    .",
    "Though there wasn't any news on Wednesday material enough to   justify such a sharp gain in the automaker's stock price, Tesla   shares have notably seen a clear positive upward trend recently.   This is likely an extension of this trend.",
    "  Image source: Tesla.makeArticleAd(); ",
    "Image source: Tesla.",
    "Including Wednesday's gain, Tesla shares have risen 17% since   Aug. 23. In addition, the stock is up 12% in the past five days   alone.",
    "Some of the stock's rise may reflect sentiment from some   investors that shares were oversold in the time period leading up   to this rebound. Despite the   growth stock    's recent run-up, shares are down 33% from the stock's high of   about $366 last year. Further, a combination of soaring revenue   and headwinds for the stock price over the last 12 months has   meant Tesla's price-to-sales ratio fell from about 3.5 to 1.7. In   addition, Tesla has gone from negative free cash flow of $4.1   billion in 2017 to positive free cash flow of $1.4 billion in the   trailing-12-month period.",
    "Perhaps investors are now warming up to    Tesla stock    at this lower valuation, considering this to be a nice entry   point.",
    "While it's interesting to ponder what's behind Tesla's   near-term stock movements, investors should remain focused on the   electric-car maker's underlying business. Specifically, investors   should look for Tesla to continue executing on its ambitious   targets for a 45% to 65% year-over-year increase in vehicle sales   in 2019 and positive net income in Q3 and beyond.",
    "  10 stocks we like better than Tesla       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Tesla wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Tesla       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Tesla wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Daniel Sparks      owns shares of Tesla. The Motley Fool owns shares of and     recommends Tesla. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 04:06:00"
}