{
  "url": "https://www.nasdaq.com/article/eex-to-tie-french-gas-bourse-power-next-more-closely-to-main-group-20190903-00652",
  "title": "EEX to tie French gas bourse Power next more closely to main group - Nasdaq.com",
  "text": [
    "FRANKFURT, Sept 3 (Reuters) - The European Energy Exchange (EEX) on Tuesday announced it would bring the activities of its subsidiary Powernext under the EEX group umbrella as of January 1, 2020, as it develops a global exchange with a strong European footprint.",
    "This way EEX, a subsidiary of Deutsche Boerse , will integrate platform-based power, gas and carbon emissions trading to extend liquidity, simplify admissions, and combine clearing house services, it said in a statement.",
    "\"We are confident that this step will answer our customers' need to trade a wide range of products on one platform,\" said chief executive offer Peter Reitz.",
    "But it retains Paris as the centre of natural gas expertise, stakeholder relations and registry services for a range of market-related certificates including guarantees of origin for renewables, the statement said.",
    "EEX has been on a growth path in electricity and gas across Europe but also branched out to acquire U.S. peer Nodal and has widened its access to all time zones with Asian ventures. ",
    "Benefitting from growth in global fuel demand, demand for clearing services and tighter finance market regulation, the EEX is seeking to absorb more energy trading away from broker-based over-the-counter markets, to earn more fees.",
    "EEX platforms serve more than 600 participants trading  energy, freight, metals and agricultural products.",
    "EEX and Powernext combined their power and gas market activities in early 2012 and in 2013 launched the joint gas trading platform Pegas under one rule book.",
    "\"A set-up with uniform market access will boost the cross-selling potential of the power and natural derivatives market,\" said Tobias Paulun, Powernext president and chief strategy officer of EEX.",
    "European trading of gas in the first six months of 2019 on Pegas grew 32% year-on-year to 1,265 terawatt hours (TWh) compared with 950 TWh of German gas usage alone last calendar year.",
    "Flagship German power futures on EEX traded 53% more volume at 1,275 TWh in the six months, twice Germany's annual consumption."
  ],
  "published_datetime": "2019-09-03 08:55:00"
}