{
  "url": "https://www.nasdaq.com/article/technology-sector-update-for-09032019-imamsgibgib-atodzsi-cm1206897",
  "title": "Technology Sector Update for 09/03/2019: I,MAMS,GIB,GIB-A.TO,DZSI - Nasdaq.com",
  "text": [
    "Top Tech Stocks",
    "MSFT -1.42%",
    "AAPL -1.64%",
    "IBM -0.84%",
    "CSCO -0.93%",
    "GOOG -1.99%",
    "Technology stocks retreated Tuesday, with the shares of tech stocks in the S&P 500 dropping nearly 1.4% while the Philadelphia Semiconductor Index was falling over 1.9% in late trade.",
    "Among technology stocks moving on news:",
    "(-) Intelsat ( I  ) slid nearly 7% lower on Tuesday after French satellite operator Eutelsat said it was leaving the C-Band Alliance and would instead take a \"direct active\" role in clearing and repurposing its C-Band satellite spectrum. The Alliance, which still represents Intelsat and two other large satellite companies, has been seeking potential buyers for the group's older C-Band capabilities and assisting with the upcoming launch of 5G, or fifth-generation, mobile telecommunication services.",
    "In other sector news:",
    "(+) MAM Software Group ( MAMS  ) climbed over 15% after agreeing to a $154.2 million buyout offer from privately held Kerridge Commercial Systems, which pay $12.12 per share in cash for each common MAM Software share, representing a 14% premium over Friday's closing price.",
    "(-) CGI Group ( GIB  ) was fractionally lower after Tuesday announcing its purchase of Annams Systems Corp, a privately-held asset management software company for an undisclosed price. The transaction closed on Friday, the Canadian information-technology firm said.",
    "(-) Dasan Zhone Solutions ( DZSI  ) dropped almost 3% on Tuesday after saying chief financial officer Michael Golomb resigned on Friday to pursue another opportunity. The networking equipment company did not immediately name a successor.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-03 15:32:46"
}