{
  "url": "https://www.nasdaq.com/article/volaris-turnaround-stays-on-track-as-summer-air-traffic-soars-cm1210810",
  "title": "Volaris' Turnaround Stays on Track as Summer Air Traffic Soars - Nasdaq.com",
  "text": [
    " After a couple of years of severe earnings pressure, Mexican   budget airline   Volaris    (NYSE: VLRS) began to turn things around about a year ago. While   the carrier posted a big loss during the first nine months of   2018 -- and its operating margin deteriorated by more than 6   percentage points year over year -- its operating margin reached   4.5% in the fourth quarter, up from 0.3% in the prior-year   period. The turnaround has accelerated this year. Volaris'   operating margin   improved by more than 10 percentage points    in the first half of 2019, reaching 4.4%. Furthermore, all signs   point toward continued margin expansion in the back half of the   year, with more room for improvement in 2020 and beyond. The demand recovery continues During Volaris' second-quarter       earnings call    , management projected that margin expansion would   continue in the third quarter    , despite somewhat tougher year-over-year comparisons. Strong   demand and rising ancillary revenue are driving unit revenue   growth, even though fares remain low in many markets.makeArticleAd(); Traffic results for the summer season validate management's   bullish outlook. In July, traffic surged 17.2% on a 17.1%   increase in capacity, with strong growth in both the domestic and   international markets. This caused Volaris' load factor -- the   percentage of seats filled with paying customers -- to remain at   88.8%, roughly flat year over year. The carrier's results in August were even more impressive.   Traffic surged 19.8% on 15.2% capacity growth. As a result,   Volaris' load factor improved by more than 3 percentage points   from where it stood in August 2018, reaching 83.4%.   Volaris posted huge gains in passenger traffic this summer.     Image source: Volaris.  Expecting further cost improvements Because it is steadily reducing its unit costs, Volaris should   be able to drive solid margin expansions even with modest unit   revenue growth. In the first half of the year, nonfuel unit costs   fell by a little more than 5%. This more than offset an uptick in   fuel expense, which was driven by an increase in fuel transfer   costs in Mexico. There's a good chance that Volaris will be able to continue   cutting its nonfuel unit costs in the third quarter. The strong   demand environment has allowed the carrier to maintain aircraft   utilization at a high rate, and it's disciplined about managing   its costs. Furthermore, fuel cost pressure is likely to abate. Volaris   signed new purchase agreements last quarter that will reduce its   fuel transfer costs by a third. The market price of jet fuel is   also significantly lower than it was at this time last year.   Finally, the addition of new planes to Volaris' fleet is driving   steady gains in fuel efficiency. Volaris' dominance is growing In recent years, Volaris has   gained market share steadily    . It now carries more passengers in Mexico than any other   airline, having surpassed former market leader Aeromexico earlier   this year. Its top rivals, Aeromexico and Interjet, have both   been losing money recently, constraining their ability to   grow. Volaris' high growth rate has allowed it to widen its cost   advantage, and it's well-positioned for further cost improvements   in the coming years. It will more than double the proportion of   Airbus    A320neo-series jets in its fleet by the end of 2022, and it has   locked in favorable financing terms for those aircraft. Meanwhile, Interjet is struggling to survive. It has been   consistently unprofitable for many years, and is now embroiled in   a tax dispute with the Mexican government. An unfavorable ruling   would further stress Interjet's weak balance sheet. If that   airline collapses at some point in the next few years -- which   seems like a plausible outcome -- Volaris will be in prime   position to further consolidate its  lead in the Mexican   market.   10 stocks we like better than Controladora Vuela     Compañia de Aviación       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Controladora Vuela     Compañia de Aviación wasn't one of them! That's right -- they     think these 10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Adam Levine-Weinberg      owns shares of Volaris. The Motley Fool has no position in any     of the stocks mentioned. The Motley Fool has a     disclosure policy      .  ",
    "After a couple of years of severe earnings pressure, Mexican   budget airline   Volaris    (NYSE: VLRS) began to turn things around about a year ago. While   the carrier posted a big loss during the first nine months of   2018 -- and its operating margin deteriorated by more than 6   percentage points year over year -- its operating margin reached   4.5% in the fourth quarter, up from 0.3% in the prior-year   period.",
    "The turnaround has accelerated this year. Volaris'   operating margin   improved by more than 10 percentage points    in the first half of 2019, reaching 4.4%. Furthermore, all signs   point toward continued margin expansion in the back half of the   year, with more room for improvement in 2020 and beyond.",
    "During Volaris' second-quarter       earnings call    , management projected that margin expansion would   continue in the third quarter    , despite somewhat tougher year-over-year comparisons. Strong   demand and rising ancillary revenue are driving unit revenue   growth, even though fares remain low in many markets.",
    "Traffic results for the summer season validate management's   bullish outlook. In July, traffic surged 17.2% on a 17.1%   increase in capacity, with strong growth in both the domestic and   international markets. This caused Volaris' load factor -- the   percentage of seats filled with paying customers -- to remain at   88.8%, roughly flat year over year.",
    "The carrier's results in August were even more impressive.   Traffic surged 19.8% on 15.2% capacity growth. As a result,   Volaris' load factor improved by more than 3 percentage points   from where it stood in August 2018, reaching 83.4%.",
    "  Volaris posted huge gains in passenger traffic this summer.     Image source: Volaris. ",
    "Volaris posted huge gains in passenger traffic this summer.     Image source: Volaris.",
    "Because it is steadily reducing its unit costs, Volaris should   be able to drive solid margin expansions even with modest unit   revenue growth. In the first half of the year, nonfuel unit costs   fell by a little more than 5%. This more than offset an uptick in   fuel expense, which was driven by an increase in fuel transfer   costs in Mexico.",
    "There's a good chance that Volaris will be able to continue   cutting its nonfuel unit costs in the third quarter. The strong   demand environment has allowed the carrier to maintain aircraft   utilization at a high rate, and it's disciplined about managing   its costs.",
    "Furthermore, fuel cost pressure is likely to abate. Volaris   signed new purchase agreements last quarter that will reduce its   fuel transfer costs by a third. The market price of jet fuel is   also significantly lower than it was at this time last year.   Finally, the addition of new planes to Volaris' fleet is driving   steady gains in fuel efficiency.",
    "In recent years, Volaris has   gained market share steadily    . It now carries more passengers in Mexico than any other   airline, having surpassed former market leader Aeromexico earlier   this year. Its top rivals, Aeromexico and Interjet, have both   been losing money recently, constraining their ability to   grow.",
    "Volaris' high growth rate has allowed it to widen its cost   advantage, and it's well-positioned for further cost improvements   in the coming years. It will more than double the proportion of   Airbus    A320neo-series jets in its fleet by the end of 2022, and it has   locked in favorable financing terms for those aircraft.",
    "Meanwhile, Interjet is struggling to survive. It has been   consistently unprofitable for many years, and is now embroiled in   a tax dispute with the Mexican government. An unfavorable ruling   would further stress Interjet's weak balance sheet. If that   airline collapses at some point in the next few years -- which   seems like a plausible outcome -- Volaris will be in prime   position to further consolidate its  lead in the Mexican   market.",
    "  10 stocks we like better than Controladora Vuela     Compañia de Aviación       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Controladora Vuela     Compañia de Aviación wasn't one of them! That's right -- they     think these 10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Controladora Vuela     Compañia de Aviación       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Controladora Vuela     Compañia de Aviación wasn't one of them! That's right -- they     think these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Adam Levine-Weinberg      owns shares of Volaris. The Motley Fool has no position in any     of the stocks mentioned. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 06:07:00"
}