{
  "url": "https://www.nasdaq.com/article/restaurant-brands-international-stocks-market-keeps-growing-cm1207585",
  "title": "Restaurant Brands International Stock’s Market Keeps Growing - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Restaurant Brands International (NYSE: QSR ) got a late start in the food game. It was launched in August 2014 but has since accumulated three of the hottest quick service franchises in North America today.",
    "Under QSR stock's umbrella is Canada's version of Dunkin (NASDAQ: DNKN ), Tim Horton's . In the U.S. QSR operates Burger King and Popeye's .",
    "Each of these brands is independently operated. QSR is the holding company. It began as a merger between Burger King and Tim Horton's in 2014, then Popeye's was added in 2017. It's the fifth-largest quick service company in the world.",
    "The names in its brand connote much more than size and power. They are actually some of the most beloved names in fast food. It's the quality products and distinctive identities of these brands that really add value to Restaurant Brands International and QSR stock.",
    "A perfect example is the recent furor over Popeye's chicken sandwich launch. For months before the launch there was an untold numbers of stories out there talking about the Chick-fil-A brand as America's most beloved chicken sandwich and fast food restaurant. Then Popeye's dropped their sandwich, and the market went nuts.",
    "Now, the stories are about how incredible the sandwich is. The CEO is even doing interviews apologizing for not expecting the enormous popularity of the sandwich. The sandwiches sold out in most stores in a matter of days. And there are accounts of people pulling guns on employees , demanding the sandwiches.",
    "That is how you change a news cycle and attract diners. Quirky marketing might be smart, but the best way to attract and keep customers is by serving good food; and food your customers want.",
    "While Burger King is like the smart-alecky, smaller younger brother to McDonald's (NYSE: MCD ) who can't fight him toe-to-toe, so he just annoys him to no end, Tim Horton's is the quiet down-to-earth older brother to Dunkin' and hipster sister Starbucks (NASDAQ: SBUX ).",
    "And Popeye's marches to the beat of its own drummer as well. All make for a compelling company that goes about its business making money around the world.",
    "Tim Horton's has 850 restaurants in the U.S. - Michigan, Indiana, Ohio, New York, West Virginia, Kentucky, Pennsylvania, Maine - and 4,400 systemwide, with most of the remainder in Canada.",
    "QSR stock is up 44% year to date and 31% in the past 12 months, plus it delivers a very respectable 2.55% dividend.",
    "Obviously, QSR stock is gaining some attention at this point. But this is the kind of stock that is attractive in this sector because its brands are somewhat unconventional. They attract younger customers that are looking for quality brands that stand for more than just cheap food to stuff in their mouths.",
    "Bear in mind that the company recently released that it will be launching a secondary share offering of just under 1.7 million shares later this month. The public float is 268 million shares, so this won't be too dilutive.",
    "Regardless of how well or poorly the economy is moving forward, QSR stock should continue to do well as its price points and quality products make it attractive to consumers in all seasons.",
    "Louis Navellier  is a renowned growth investor. He is the editor of four investing newsletters:  Growth Investor ,  Breakthrough Stocks ,  Accelerated Profits  and  Platinum Growth . His most popular service, Growth Investor, has a track record of beating the market 3:1 over the last 14 years. He uses a combination of quantitative and fundamental analysis to identify market-beating stocks. Mr. Navellier has made his proven formula accessible to investors via his free, online stock rating tool,  PortfolioGrader.com . Louis Navellier may hold some of the aforementioned securities in one or more of his newsletters.",
    "The post Restaurant Brands International Stock's Market Keeps Growing appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 01:13:16"
}