{
  "url": "https://www.nasdaq.com/article/the-solution-to-apples-services-growth-puzzle-package-deals-cm1207094",
  "title": "The Solution to Apple's Services Growth Puzzle? Package deals - Nasdaq.com",
  "text": [
    " Recen   t report    s from   Bloomberg    that   Apple    (NASDAQ: AAPL) will price its TV+ subscription at $9.99 a month   were a bit jarring to industry observers, given that   Disney    (NYSE: DIS) has set the price of the soon-to-debut Disney+   streaming service at $6.99 and the base option from   Netflix    (NASDAQ: NFLX) goes for $8.99. But the Cupertino tech giant has   never positioned its products to be the lowest-priced options in   the market, and Apple TV+ isn't necessarily going to be a   business   designed to attract hundreds of millions of   subscribers    as Disney and Netflix hope to do. What I think will be interesting to watch is how Apple starts   to look at its full suite of services with Music, News+, iCloud,   and upcoming TV+ and Arcade offerings. On their own, none are the   best on the market, nor are they particularly compelling   investments for Apple or its shareholders. But they could   make an attractive package. Are we approaching the moment when   Apple starts bundling services to   bring more of its nearly 1 billion installed   users    into the services tent?   Image source: Apple.makeArticleAd();  Apple's growing services business Below, I've laid out Apple's most notable current services   along with its two upcoming TV+ and Arcade offerings. You   can see that the company is fond of the $9.99 price point.  Source: Apple. TV+ price is reported but not confirmed by   Apple. The challenge is that   none of these products is a no-brainer purchase   at its current price    . Music is competitive with   Spotify    , but it's easy to argue that users have better values in news,   cloud storage, and streaming at their fingertips. If Apple really   wants to attract hundreds of millions of users, it will need to   price its products accordingly. Is a bundle on the horizon? A services bundle already seems like a natural offering. If   customers could get all of the above, including 2 TB of storage   for say, $19.99 or $24.99 per month, that could be attractive to   customers who might be on the fence about any of   the services individually. What makes this an uphill battle for Apple is an issue of   scale. It's No. 2 in music, but it's still behind Spotify. In the   cloud, it's a small player behind   Amazon    ,   Microsoft    ,   Dropbox    , and others. In streaming video, it could be fifth or sixth in   the number of subscribers to services from Disney, Netflix,   ViacomCBS    , Disney's Hulu, and   Comcast    's NBC/Universal. Apple's incentive is to increase its installed   user base so it doesn't fall further behind service competitors,   and a bundle is a natural way to increase the perceived value of   multiple services.   Image source: Apple.  A giveaway with high-margin products? Another option for Apple would be to give away some of these   services in a pairing with its high-margin hardware, or even with   the Apple Card. For example, consumers who sign up for the Apple   Card or buy a top-of-the-line iPhone could get a year of Apple   TV+ for free. A 15-inch Macbook Pro could come with the full   suite of services for a year, making it a more compelling   deal. Apple has given away software before that it thought added   value to the ecosystem, like Pages and Keynote. It also offers   the first three months free for Apple Music to get users to try   the service. It may do something similar here. Pricing is key in Apple's new services model For the first decade of the iPhone, it didn't seem like Apple   needed to worry about competitors undercutting its prices. The   smartphone and its ecosystem were so compelling that users were   willing to pay a premium for it. But in services, there are lots of strong options in every   market Apple is moving into. That makes pricing a critical issue   and adds weight to the argument for bundling. It's a simple   strategy, and with so many new offerings to promote, I think now   is the time for Apple to employ it.   10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. Teresa Kersten, an employee of LinkedIn, a Microsoft     subsidiary, is a member of The Motley Fool's board of     directors.     Travis Hoium      owns shares of Apple and Walt Disney. The Motley Fool owns     shares of and recommends Amazon, Apple, Microsoft, Netflix,     Spotify Technology, and Walt Disney. The Motley Fool has the     following options: long January 2021 $60 calls on Walt Disney,     short October 2019 $125 calls on Walt Disney, short January     2020 $155 calls on Apple, long January 2020 $150 calls on     Apple, short January 2020 $155 calls on Apple, long January     2020 $150 calls on Apple, and long January 2021 $85 calls on     Microsoft. The Motley Fool has a     disclosure policy      .  ",
    "Recen   t report    s from   Bloomberg    that   Apple    (NASDAQ: AAPL) will price its TV+ subscription at $9.99 a month   were a bit jarring to industry observers, given that   Disney    (NYSE: DIS) has set the price of the soon-to-debut Disney+   streaming service at $6.99 and the base option from   Netflix    (NASDAQ: NFLX) goes for $8.99. But the Cupertino tech giant has   never positioned its products to be the lowest-priced options in   the market, and Apple TV+ isn't necessarily going to be a   business   designed to attract hundreds of millions of   subscribers    as Disney and Netflix hope to do.",
    "What I think will be interesting to watch is how Apple starts   to look at its full suite of services with Music, News+, iCloud,   and upcoming TV+ and Arcade offerings. On their own, none are the   best on the market, nor are they particularly compelling   investments for Apple or its shareholders. But they could   make an attractive package. Are we approaching the moment when   Apple starts bundling services to   bring more of its nearly 1 billion installed   users    into the services tent?",
    "  Image source: Apple.makeArticleAd(); ",
    "Image source: Apple.",
    "Below, I've laid out Apple's most notable current services   along with its two upcoming TV+ and Arcade offerings. You   can see that the company is fond of the $9.99 price point.",
    "Source: Apple. TV+ price is reported but not confirmed by   Apple.",
    "The challenge is that   none of these products is a no-brainer purchase   at its current price    . Music is competitive with   Spotify    , but it's easy to argue that users have better values in news,   cloud storage, and streaming at their fingertips. If Apple really   wants to attract hundreds of millions of users, it will need to   price its products accordingly.",
    "A services bundle already seems like a natural offering. If   customers could get all of the above, including 2 TB of storage   for say, $19.99 or $24.99 per month, that could be attractive to   customers who might be on the fence about any of   the services individually.",
    "What makes this an uphill battle for Apple is an issue of   scale. It's No. 2 in music, but it's still behind Spotify. In the   cloud, it's a small player behind   Amazon    ,   Microsoft    ,   Dropbox    , and others. In streaming video, it could be fifth or sixth in   the number of subscribers to services from Disney, Netflix,   ViacomCBS    , Disney's Hulu, and   Comcast    's NBC/Universal. Apple's incentive is to increase its installed   user base so it doesn't fall further behind service competitors,   and a bundle is a natural way to increase the perceived value of   multiple services.",
    "  Image source: Apple. ",
    "Image source: Apple.",
    "Another option for Apple would be to give away some of these   services in a pairing with its high-margin hardware, or even with   the Apple Card. For example, consumers who sign up for the Apple   Card or buy a top-of-the-line iPhone could get a year of Apple   TV+ for free. A 15-inch Macbook Pro could come with the full   suite of services for a year, making it a more compelling   deal.",
    "Apple has given away software before that it thought added   value to the ecosystem, like Pages and Keynote. It also offers   the first three months free for Apple Music to get users to try   the service. It may do something similar here.",
    "For the first decade of the iPhone, it didn't seem like Apple   needed to worry about competitors undercutting its prices. The   smartphone and its ecosystem were so compelling that users were   willing to pay a premium for it.",
    "But in services, there are lots of strong options in every   market Apple is moving into. That makes pricing a critical issue   and adds weight to the argument for bundling. It's a simple   strategy, and with so many new offerings to promote, I think now   is the time for Apple to employ it.",
    "  10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. Teresa Kersten, an employee of LinkedIn, a Microsoft     subsidiary, is a member of The Motley Fool's board of     directors.     Travis Hoium      owns shares of Apple and Walt Disney. The Motley Fool owns     shares of and recommends Amazon, Apple, Microsoft, Netflix,     Spotify Technology, and Walt Disney. The Motley Fool has the     following options: long January 2021 $60 calls on Walt Disney,     short October 2019 $125 calls on Walt Disney, short January     2020 $155 calls on Apple, long January 2020 $150 calls on     Apple, short January 2020 $155 calls on Apple, long January     2020 $150 calls on Apple, and long January 2021 $85 calls on     Microsoft. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:00:00"
}