{
  "url": "https://www.nasdaq.com/article/investing-predictions-fall-2019-cm1206799",
  "title": "Investing Predictions: Fall 2019 - Nasdaq.com",
  "text": [
    "In this week's episode of Motley Fool Money , host Chris Hill chats with Motley Fool analysts Jason Moser and Andy Cross about what may be next for the market. What's on their radars this fall? What should investors definitely pay attention to? Which companies should be given a short leash going forward? Which ones are Jason and Andy even more bullish on than before? What private companies do they wish would go public? And what's one reckless prediction for the next few months?",
    "Tune in to find out where Disney (NYSE: DIS) , Tesla (NASDAQ: TSLA) , Netflix (NASDAQ: NFLX) , Microsoft (NASDAQ: MSFT) , and many more fit in the discussion. Plus, stay tuned for an interview with restaurant industry expert David Henkes about ghost kitchens, delivery, increasing food costs, CBD, and the state of the industry today.",
    "To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center . A full transcript follows the video.",
    "10 stocks we like better than Walmart\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, the Motley Fool Stock Advisor, has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks  for investors to buy right now... and Walmart wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "Click here  to learn about these picks!",
    "*Stock Advisor returns as of June 1, 2019\r\n The author(s) may have a position in any stocks mentioned.",
    "This video was recorded on Aug. 30, 2019.",
    "Chris Hill: We've got Apple 's (NASDAQ: AAPL) event in September, we've got Disney's video streaming service that launches in November. And, of course, the most important time of the year for so many retailers with Thanksgiving, Christmas, all the holidays.",
    "Andy Cross, let me start with you. What's going to be on your radar this fall in terms of business related events?",
    "Andy Cross: Chris, I don't know if you've paid attention to what's happening to big tech this year. Apparently, there's some not-so-fans of what's happening with them, from the investigations from the DOJ and from the FTC, Department of Justice, the FTC making some investigations. What happens starting January is, in California, they had passed the CCPA, the California Consumer Privacy Act. There's a lot of conversation as all companies now have to deal first with GDPR over in Europe, now with the CCPA in California. So what I'm really watching is the continued conversation around the regulatory environment, the antitrust environment, what is happening from the likes of Facebook , Amazon , Apple, Alphabet , Google, how these companies continue to manage a landscape when congressional investigations and regulatory bodies continue to come after them. So, ahead of the launching and the CCPA going into effect in January, I'm kind of watching how these companies continue to evolve this landscape.",
    "Hill: You think it's possible any of the politicians on either side of the political aisle running for president in 2020 might take some shots at big tech over the next 12 to 18 months?",
    "Cross: [laughs] The next 12 to 18 months, Chris, is going to be just fascinating to watch from the political landscape. Even over the next few months ahead of January, I'm watching to see how these companies -- they're going to spend a lot of dollars lobbying, but just, how they continue to talk about privacy and regulatory issues from the big picture for them.",
    "Hill:  Jason Moser, what about you?",
    "Jason Moser: You mentioned Disney's streaming service. That's one of the things I'm excited to watch. No. 1, as time goes on here, we're learning more about what Disney+ is going to be, what it's going to offer. We were talking about this before taping, it really does seem like they have a lot of stuff for every age group, from babies to teenagers to adults like us. I think it was really fascinating to see at the D23 conference they had here recently where they were starting to talk about all the different stuff that Disney as a company is doing. And they pulled back the curtain a little bit on this streaming service. Announced a lot of the content. It was impressive to me. Somebody on the management team, somebody on the executive team, had the wherewithal to say, \"You know what? Let's go ahead and take pre sign ups because people are going to be really enthusiastic about this content right as we show it all to them. We'll get people to go ahead and sign up for this thing early.\" Remember, it doesn't launch until November 12th. At $6.99, that's a great deal. $6.99 a month. It's really hard to argue with that. They're going to bundle it, of course, with ESPN+ and Hulu ad supported product for people who want more than just the Disney+.",
    "But it's also worth noting, they have a deal out there, buy two years, get the third year free. It's kind of like Mac and Costco , right? You're doing yourself a disservice if you don't subscribe at this point. They're setting themselves up to have even more pricing power through this. I think it's going to be just fascinating to watch how this plays out over the rest of the streaming landscape in the coming years.",
    "Hill: Also, you think about the ripple effects to the other big players in the video streaming space. Presumably we're going to get more information from Apple about Apple+. And let's not forget Comcast looming out there. Heading into 2020, they say they're on track to launch NBC Universal's streaming service as well. And, of course, a little company called Netflix.",
    "Moser: Little company called Netflix. I mean, I think all of these possibles, these potentials, they are just that. At this point, I think it's going to be really fascinating to see how this plays out on Netflix, just because they're going to lose so much content so quickly. And not only are they losing that content, but they're really losing the potential for that future content as well. Again, I feel like Netflix is one of those staples that a lot of people will continue to subscribe to. I just wonder how much more they're going to be able to raise prices given the content wars.",
    "Hill: It seems like, the last few months of the year, there's more noise for investors than there is at any other time during the year. Particularly as we head into the fall, Andy, you get more people beating the drum for a potential recession. As we mentioned, the presidential primaries are heating up. There's going to be a lot of noise. That makes it easier for investors to miss things. What is something you want to highlight and encourage investors not to miss?",
    "Cross: I put this out on Twitter , there's always been a wall of worry that the media loves to talk about. And certainly, we have issues that are real. Brexit, the U.K. may leave the EU without a deal. We have an inverted yield curve, which historically has implied that maybe we'll have recessions on the way. We have earnings growth that's only going to be about 2% to 3% for the S&P 500 companies this year. So it's not like things are completely cheery. And Chris, you mentioned the political environment. But I think it's really important for investors to maintain and think about their perspective. We are long-term investors. When you receive these kinds of concerns, you have to understand, if I can't stomach the volatility, maybe I should have a little bit more cash on the sidelines. Really understanding your investing mentality. If you're investing, like I am for my daughter's education, which is 10-plus years away, that's a lot of time to be able to compound returns. The blips of the volatility we may see, not as much of a worry. But I think it's really important for investors to understand their mindset, and really focus on their goals, and then invest accordingly.",
    "Hill: Jason, what about you?",
    "Moser: A little bit in line with what Andy was talking about there at the beginning of the show. We're coming into a very polarizing election cycle here in 2020. I would encourage investors not to miss the forest for the trees. What I mean by that is, as with every election season, we're going to see a lot of political posturing. We're going to see a lot of promises made with the hope that those promises maybe will get the people making those promises elected. We all know, generally speaking, it's really tough to actually uphold those promises because you can't just call the shots yourself. We live in a democracy, after all. But we do see a lot of posturing. I think that what that can do, No. 1, it can create some fear. I think we're hearing a lot about how antitrust concerns play out with companies like Alphabet and Amazon and Microsoft and Facebook and Apple. I personally think that politicians are missing the point there with antitrust concerns. I think probably more along the privacy line, like you were talking about there, Andy. But I think that this creates opportunities, potentially, over the coming year and beyond. When you see all this political posturing, the headlines that go on, the market reacts to this stuff day after day. That volatility certainly can create some windows. I would encourage investors to keep a focus on the forest, not the trees. Keep some money ready, because there'll be some opportunities out there.",
    "Hill: Alright, before we head into the break, one business prediction. It can be about a company, an industry, a CEO. Give me something, Andy!",
    "Cross: I think we may see Berkshire Hathaway make an acquisition. We talked about this in April. We all tossed out some ideas there. I said Sherwin-Williams . That might be a little bit too big. He owns Southwest . Maybe it could be Moody's . Maybe Travelers . I think, as stocks maybe go through this volatile period Jason just mentioned, with interest rates continuing to fall, and they probably will fall, it looks like, I think we might see Warren Buffett and Berkshire Hathaway put some of that massive cash they have on the balance sheet to work.",
    "Hill: We talk about having a watch list of stocks for when we have a little bit of cash and opportunity arises. Safe to assume Warren Buffett also has his own watch list?",
    "Cross: Oh, yeah, he does. It's very valuation-centric. That's why I was looking at Travelers. $40 billion market cap, sells at 1.8X book, and Berkshire already owns 2.3% of it.",
    "Moser: Or McCormick !",
    "Cross: [laughs] Of course, McCormick.",
    "Hill: [laughs] Do you own a little bit of Travelers stock? You worked there once upon a time.",
    "Moser: I do not anymore, no. I used to. I did work there for a spell, though, about a year before I came up here. Very good business. Well-run insurer.",
    "Hill: Give me one prediction.",
    "Moser: Crypto bulls, don't take this the wrong way... I think that Facebook's Libra initiative, at the very least, will be put on hold. But really, I think Facebook's Libra initiative as we know it today is going to be dead in the water. I just don't give this thing a chance in its current form. There are too many regulatory concerns to begin with, but we're already seeing some of the partners that are signing up for this express some concern. Some of the partners are talking about backing out. All it takes is a couple for the rest to fall in line. Ultimately, when you look at the problem that Facebook is trying to solve -- or at least the problem they say they're trying to solve --bringing more services to the unbanked and underbanked, listen, that's admirable, but inventing a new currency ain't the solution, Chris. I think they need to go back to the drawing board. I just don't understand how this moves forward.",
    "Hill: Our email address is radio@fool.com , for any crypto bulls who want to send a note. We'll be sure to forward it to Jason. 2019, safe to say it's been a hot one for IPOs. Jason, I'll start with you. Is there a private company out there that you'd like to see make the leap to the public markets?",
    "Moser: Chris, there is, and it's not Chick-fil-A, believe it or not. As you know, I head up our augmented reality service here at The Motley Fool. One company I really would love to be able to get in there is Niantic. Niantic is the creator of Pokémon Go . Perhaps you've heard of it. Their follow-up hit with Harry Potter: Wizards Unite . Maybe not as big of a hit as Pokémon Go . But still, the technology is pretty sound. Niantic used to be a part of Google, actually. Google spun that out on its own. Google still owns a little piece of it, maybe around 6% of it. There is talk of Niantic going public. Earlier in the year, they raised some more money to about a $4 billion valuation. A company that's doing a lot of neat things with augmented reality and gaming technology. I suspect we will see them go public, and I suspect I will have them on my watch list in short order.",
    "Hill: Andy, what about you?",
    "Cross:  Chris, I'm building off the Peloton S-1. They just filed sometime this week. I'm looking at Strava. It's an online fitness tracker. You may use Strava, Chris. I know you're a runner. Strava mean strive in Swedish. It has 42 million users. It adds one million users a month. I don't think they have any site to go public, but it's a really sticky service if you like to track your fitness online. It's very scalable. It has a community of users. 80% of the user base is outside the United States. It's a business that I use a lot. It's one that I would love to see get a little bit more funding behind them. The last valuation was about $400 million, so it's not a small company, but still not a huge one, either.",
    "Hill: We don't have an exact date on when WeWork is going public, but that all the reporting is, they're targeting an IPO in September. Which one of the three of us is bringing the popcorn for that? Am I the only one who thinks that's going to be a memorable IPO, either for good reasons or for bad?",
    "Moser: I think we all need to bring the popcorn. It'll probably be very, very entertaining.",
    "Hill: One of the things we talk about with stocks is the whole concept of leash -- how long a leash are you going to give a stock in your portfolio? Jason, what's a stock you think, whether you own it or not, needs to be on a short leash right now?",
    "Moser: I'll preface this by, going back to a year ago, my leash stock on our fall preview show was Chipotle . Fast forward to today, it's up about 100%. You're welcome, investors. This year's leash stock, I'm putting Tesla on a short leash. A couple of reasons. If you look at the company's financials, just a snapshot of the company's financials, I have a hard time believing that even one person out of 100 would say, \"Oh, yeah, I want to invest in that.\" Their financials look atrocious. They actually don't even have the operating income to cover their interest expense. That's a problem. The company's always resorting to this financial chicanery, more or less, to keep things going. So, why would people invest in it? Well, clearly, Elon Musk and his vision. And that's fine. I appreciate that. I applaud it. I like Musk. I think I've been very public in saying we need more people like him. But I do think that he needs to get things in order and prioritize what matters most to him. As we talk more about the potential for global recession, geopolitical risk that may come about, when we start looking at some of these companies and how they may perform in tougher economic times, Tesla is set up to have a very rough go of it if we run into a buzz saw here. So, I think investors need to keep a very close eye on it.",
    "Hill: Andy, what about you?",
    "Cross:  JMo, you're not the only one with a little bit of egg, or burrito, on his face. I was bullish on the bank stocks coming into this year. Obviously, with the interest rate environment we've seen, it's not been a place to go. I still think it's going to be a low interest rate environment. Now I think it's going to be a lower interest rate environment. That doesn't portend well for the bank stocks. Axos Financial , formerly Bank of Internet, which had done so well helping grow online banking as a small bank -- it's a $2 billion bank. I just think this one is going to struggle because so many of the big banks now are continuing to invest in online banking. Goldman is hiring more techies than they are bankers these days. With a low interest rate environment, different environment than when they were growing their business, and one of the first ones out there, Axos Financial... I just don't think it's going to be a long-term winner from here.",
    "Hill: I'll just add, as a group, the general sports retailers -- not the individual ones. I'm certainly not talking about Nike and their individual stores; or even for that matter, a company like Columbia Sportswear , which has bricks and mortar locations selling their own stuff. You look back over the past five years, that stock has more than doubled. We talked about this recently on this show -- the more I look at the environment that Foot Locker , Dick's Sporting Goods , Hibbett , they're all operating in, I just think I would stay far away from them. It's not to say they're all going the way of Sports Authority, but it really looks like a tough environment for the general sports retailers.",
    "Moser: It's difficult to come up with a compelling reason as to why they should prosper.",
    "Hill: Before we wrap up, let's go to the flip side. What is a stock, Jason, that you are even more bullish on now than you were a year ago?",
    "Moser: It's one that I own. It's one that I recently added more shares to my position. That's Etsy . Going through the most recent quarterly numbers for the second quarter, the company continues to do so many good things with its niche craft market audience. Active sellers on the platform grew to over 2.3 million. Active buyers, more than 42.7 million. Their network pushed through about $1.1 billion in gross merchandise sales for the quarter. If you look at those metrics, those core metrics over time, they have done nothing but go up and to the right. These guys are just doing a lot of great things. And they're bringing it down the bottom line. It's a profitable company. They make a healthy amount of cash flow there. Josh Silverman, the CEO, has been there for just a little over two years. He's just done some tremendous things. I like his thinking about leadership and about the team that he assembles there at Etsy, and the retail market writ large, and how he shapes his team in regard to that view there. You look at the things that they're doing. They've got some catalysts on the horizon with a free shipping initiative they're introducing, a new unified platform called Etsy Ads, and they just wrapped up this acquisition of a company called Reverb, which is essentially like Etsy, but it's for musical instruments. That adds another unique dynamic to that network that they didn't have before. I think there's just a lot to look forward to with this company.",
    "Hill: Andy Cross, what about you?",
    "Cross: I still like The Trade Desk , TTD. It's a $10 billion market cap, leader in helping big clients place ads online in the non-walled-gardens. So, not Facebook, not Alphabet. But, if you are a client who is looking to place ads online and more and more into connected TV, Chris, as we continue to use things like Roku , Apple streaming, Fire Stick, The Trade Desk helps their clients reach more and more people in those newer environments. It's run by Jeff Green. He founded the company. He's built a wonderful culture, owns 9% of the business. It continues to grow at 40% to 50% a year. As I look at the market and the market evolving online, and these connected devices, as we are looking at different ways to embrace entertainment, I think advertising support is going to continue to be a place to go and to invest, and Trade Desk is making those investments, and it's doing well.",
    "Hill: Interesting that these two companies operate in spaces that, on paper, you would think, \"Who would try to launch an advertising business?\" \"Who would try to launch a retailer when Amazon looms out there?\" Anyway. Interesting stuff.",
    "[...]",
    "Hill: David Henkes is a senior principal at Technomic, a global consulting firm for the food service industry. Recently, I got the chance to talk with David about a range of industry issues, including the rise of delivery, Chick-fil-A's success, trends to watch, and more. But I began our conversation by asking him about the current state of the restaurant business.",
    "__",
    "David Henkes: Based on traditional metrics that we would usually look at for the health of the industry -- things like consumer confidence, things like unemployment, things like disposable income -- all of those are extremely healthy right now. I think you could argue that some of those are from the best metrics we've seen in ages, in a long period of time. And yet the restaurant business, I would say, is challenged. It's certainly not in decline. People are still eating out, but it's not growing. We're essentially in a state where traffic -- and by traffic, I mean people's transactions, people visiting restaurants -- is essentially flat. The growth is coming primarily through price increases and/or mix change. By mix change, I mean adding higher-price, higher-margin items to the menu where consumers are spending more. So, most of the growth that's coming from the industry is really being driven by those two activities, by those two initiatives, price increases and mix change. So, what you fundamentally have is a business that's growing, or not growing, based on people coming in, and fundamentally, we worry about that, because the value equation is starting to get skewed and restaurants to the point where -- and this has been going on for some time -- the value for a family of four or five dining out is becoming unattainable. It's becoming so expensive that people aren't doing it. So, I think what you see is, people spend to a level. As prices go up in the restaurants, people are spending to that. What that means is, they're not increasing their frequency, they're not increasing their visits. So, the industry is growing. We have the entire restaurant industry pegged to grow about 4.4% in 2019 and about 4% in 2020. It's certainly not unhealthy, but, again, most of that growth is being driven by price increase, and some of the underlying fundamentals remain pretty challenged, much more challenged than we would expect, given how good the economy has been for the last couple of years.",
    "Hill:  We talked about this recently on Motley Fool Money , the relative health of consumer spending in America right now. It's in good shape. If you're a retailer, it comes down to execution. There are certainly major retailers that are doing well. They're executing well both through e-commerce and in stores. And then you have others that just aren't getting it done. I'm thinking about the restaurant industry in similar ways. For restaurants that are executing at a high level, they're probably going to be better positioned than others. And I say all of that as a prelude to talk about delivery. It seems like delivery is now one of those things for restaurants that is table stakes. If you don't have a delivery strategy, then you're probably not going to survive the next 10 years. Is that reasonable?",
    "Henkes: It is reasonable. Let me back up to your first point. I think execution is key, but I think what we've seen in restaurants is a dichotomy appear, where restaurants are meeting two different need states. One is the experiential need states, where places like independent restaurants excel. That's one reason chain sit down restaurants are struggling, is because they don't necessarily provide a unique, differentiated experience. So on the one hand, you've got this experiential factor, which is critical for that dining occasion. And then, the other need state that restaurants are really migrating toward is convenience. You really need to be executing at a high level in probably one of those areas. Fast food, McDonald's and the drive thru, and increasingly delivery, is going to meet that need state of convenience, food on demand. And then, people are still dining out and using their dining dollars as entertainment dollars. The more they sit in and watch Netflix at home, there's still a need to go out and socialize and see your friends, so dining becomes that entertainment dollar. And when you want to be entertained, you're not necessarily going to go to a non-differentiated chain restaurant, right? You're going to go to a local restaurant, you're going to go someplace that has a great drinks program, or is known for something, or where you're going to get something you can't normally get. That's the state of where we are. So, the execution that you referred to, I think, has to be looked at in either: are you executing on a unique point of difference? Or, are you executing against the convenience, given that consumers have what we would call hyper choice now?",
    "There's so many food options available now, so, how do you appeal to hyper choice? Well, you need to be on the apps that they're using for food on demand -- Grubhub , Uber Eats, and Postmates, and all of those. And I would argue that the industry would be in an even bigger state of misery right now without delivery because delivery right now -- just to give you some stats on it, because we've been following delivery now for some time. Delivery overall is about a $40 billion business. It's about 7% of restaurant sales right now. That's overall delivery, both full service and limited service. It includes the Domino's drivers that deliver their own pizza, as well as Postmates, Uber Eats, Grubhub, and all of those. Third-party delivery in 2018 was about $10.2 billion. So if you put that in the context, and if you just said, \"In aggregate, delivery is $10 billion,\" if you assume that was one chain restaurant, that would be the fourth largest chain restaurant in the country. So, delivery has grown to such an extent that, you're right, it's table stakes. How you do it, and whether you have your own drivers or you're using one of these third-party delivery apps, is up for discussion, but it absolutely is critical. That's how consumers are behaving now. On that convenience-driven occasion that I talked about, delivery is increasingly the go-to solution for those consumers.",
    "Hill: A few days ago, I saw a term in the restaurant industry that I'd never seen before. I'm hoping you can explain it for me. What is a \"ghost kitchen\"?",
    "Henkes: A ghost kitchen is essentially... there's a number of terms for it. Ghost kitchen, dark kitchen, headless restaurant. These all refer to essentially kitchens that are creating food for the delivery occasion. They do not have any kind of sit-down area at all. They only cater to delivery. What has happened to as delivery has grown, restauranteurs as well as the third-party providers have found, \"Perhaps we don't need all of these in-store seats. Perhaps we can make a living only by delivering food, not necessarily by having servers and waitstaff and all of this stuff.\" It's hard to get a number around how many of them there are. It's not as big as you'd think. But they're certainly on the West Coast, and in places like New York, you have some of these, where they get set up, and essentially, the only real real estate they have is that space on the app. With all the growth in these third-party delivery services, none of them are making money right now.",
    "Times are good, and people are willing to pay $12 for their McDonald's delivery. On a $6 meal, they're going to pay a lot more, but people have some extra money in their pocket and they're feeling good about it. But I have a sense that if and when a recession hits, these guys are going to get hit pretty hard. For anyone building a long-term strategy on a dark kitchen, ghost restaurant, whatever you want to call it, I think they've got to think twice about that, because I'm not sure that long-term, it's necessarily a solution. It's a great idea right now, but... we'll see how it plays out over the next three to five years.",
    "Hill: Let's talk about a big restaurant. McDonald's franchisees came out earlier this year in a letter to company management and said loud and clear, \"We want you to prioritize a premium chicken sandwich.\" This is aimed squarely at Chick-fil-A, which is not open on Sundays. The most recent things I've seen from McDonalds management were pretty lukewarm in terms of a response. You obviously cover the industry a lot more closely than I do. Is McDonald's working on this? And if they're not, should they be?",
    "Henkes: The way I'll answer that is to say that everybody wants to be Chick-fil-A at this point. Chick-fil-A has executed beyond anyone's wildest imagination in terms of just their growth. They're now over a $10 billion chain. They grew almost 14% last year, and have been on this upward trajectory where they're doing a very high volume for a chain that, to your point, is not open on Sundays. So, to a large degree, is it about the chicken? Yeah, listen, Chick-fil-A does a great chicken sandwich. They use a pressure cooker, which is very hard to execute. It would be very hard for them to do that type of chicken in a McDonald's. The way Chick-fil-A does their chicken is a little bit different. But, listen, Chick-fil-A's success is not only driven by the chicken sandwich. It's driven by the overall excellence and the way they've structured their business. The owner-operators that they have, the fact that each owner typically only runs one restaurant. They don't have big franchisee groups like McDonald's or some of the other big chains. Most of the individual franchisees own one restaurant, and they do that intentionally to make sure that that owner-operator is focused solely on growing that business. The service and the hospitality that you get when you walk into a Chick-fil-A is second to none and is unique among quick service restaurants for doing that. So, yeah, listen, the chicken sandwich is great, and they obviously have a great product that people are clamoring for and that they line out the door for, but the secret to Chick-fil-A is not only in the product. It's in how they treat their employees and how they treat their guests. So, I think you can argue, yeah, we want to have a great chicken sandwich, but unless you're doing everything else that Chick-fil-A is doing, you can have the best chicken sandwich in the world, and it may help a little bit, but you're never going to replicate what Chick-fil-A has done unless you replicate the entire model. That's something that is very hard for McDonald's or any other quick service restaurant to do.",
    "Hill: What is something on your radar right now that you think is going to be growing in the next couple of years? It could be an individual restaurant, it could be a restaurant concept. What should we be keeping our eyes on?",
    "Henkes: There's a couple of things. As we give presentations, we talk about trends. I would say the two that are most of interest to people right now, people in the industry, would be plant-based proteins -- I referenced earlier the Impossible Whopper. People are not suddenly going vegan or vegetarian, but there is an overwhelming surge in demand for plant-based alternatives to meat. Whether it's because of meatless Mondays, whether it's because of sustainability and the perception that meat is harming the planet, there's a lot of things that go into it. You could argue it's health and wellness, although if you look at something like the Impossible Whopper, it actually has more calories and fat than the traditional Whopper does. Clearly, they're selling that not necessarily because of health, but because of other things. I would argue that plant-based proteins are something -- you could argue it's already here, but it's something that, we keep seeing more and more chains that are getting involved with that.",
    "The other thing is what the impact of legalization of marijuana is going to have on the industry. That's true not only in the context of how it impacts consumer visits, but also what it's doing to the menu. A lot of interest in CBD as an ingredient within different menu items, whether it's beverages, cocktails, whether its food items. Now, there's still some federal legislative issues that need to be handled before most big manufacturers start throwing their hat into this ring. But, marijuana's legal up in Canada, and it's legalized in a number of states, so I think that's something that the industry is starting to try and figure out. What is going on with this, and how do we take advantage of that?",
    "So, at least from a product category perspective, those are two big things. Delivery and off-premise are things that we keep hearing about. Those are the three big things that are probably most talked about when we go to an industry conference or when you talk to a restauranteur about what's impacting or could impact their business.",
    "Hill: What is the thing we should be watching with beverages over the next few years? Particularly if you look at public companies that have a foot in the hard seltzer space, it really seems like hard seltzer is the hot new thing.",
    "Henkes: It is. As a Generation X person, I equate it to Zima back in the 80s and 90s.",
    "Hill: [laughs] I'm glad I'm not the only one!",
    "Henkes: Nope! But, listen, here's the hard truth of the matter. We do a lot of research around beverage alcohol. For how challenged the restaurant business is, the beverage alcohol part of the restaurant and bar businesses growing even slower. So, what you end up having is, if you're a restaurant that sells alcohol, not only are you faced with these overall traffic challenges that we've been talking about, but now you've got to get people to order a drink once they come in the restaurant. Volume on beer, wine, and spirits has all been essentially flat. Spirits is doing a little bit better. Beer has been in a slight decline. The only reason they're keeping up is craft beer, and even that's starting to slow now. And wine has been challenged, especially in casual dining.",
    "Again, what's happening is a changing consumer. They're drinking less, but they're drinking better. A lot more pre-gaming, especially among younger consumers, where they don't want to spend restaurant prices when they go out to eat, so they'll drink at home. You've got all these delivery services that are offering alcohol where you can essentially get it on demand, again, through Drizly and those types of things. So, the bar business is challenged. Even more so than then the food side of things. If you're selling alcohol, you're trying to figure out how we can capture that beverage occasion. Low-alcohol drinks, because people aren't drinking as much alcohol. We're seeing a lot more mocktails, alcohol-free cocktails. And then, these things like seltzers. I'm probably not the target market for it, but it is something that has taken over. It's light, refreshing. If you look at some of the non-alcohol beverage categories that are growing, sparkling water is one of the fastest growing beverages right now, whether it's sold in grocery stores or in restaurants. So, this takes that seltzer, sparkling water trend, and adds a little bit of a twist, a little bit of a spike to it. It's obviously captivated a lot of Millennials and Generation Z consumers, which I think is who it's aimed at. It's something that has already gotten to be bigger than cider. Cider has been around a long time. The fact that this has exploded the way it has tells me that certainly, there's a lot of interest right now. And I think the question is in the staying power. Like Zima, which when I was in college was the next hot thing, and within five years, it was gone, these seem like they have a little bit more staying power, given the demographic interest and focus that they have. The underlying trends are clear in terms of low-alcohol, refreshing, aimed at the at-home occasion. All of those things are really helping drive things like the spiked seltzer.",
    "Hill: David Henkes, thanks so much for being here!",
    "Henkes: Thanks for having me! I appreciate it!",
    "Hill: You can follow David on Twitter @DavidHenkes. You can learn more at technomic.com. That's going to do it for this week's edition of Motley Fool Money ! Our engineer is Austin Morgan. The show's mixed by Steve Broido. Our producer's Mac Greer. I'm Chris Hill. Thanks for listening! We'll see you next week!",
    "John Mackey, CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Teresa Kersten, an employee of LinkedIn, a Microsoft subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to its CEO, Mark Zuckerberg, is a member of The Motley Fool's board of directors. Andy Cross owns shares of Berkshire Hathaway (B shares), Chipotle Mexican Grill, Comcast, Facebook, and Netflix. Chris Hill owns shares of Amazon and Walt Disney. Jason Moser owns shares of Alphabet (C shares), Amazon, Apple, Chipotle Mexican Grill, Etsy, McCormick, Nike, The Trade Desk, Twitter, and Walt Disney. The Motley Fool owns shares of and recommends Alphabet (A shares), Alphabet (C shares), Amazon, Apple, Axos Financial, Inc., Berkshire Hathaway (B shares), Chipotle Mexican Grill, Etsy, Facebook, Microsoft, Moody's, Netflix, Nike, Roku, Southwest Airlines, Tesla, The Trade Desk, Twitter, and Walt Disney. The Motley Fool has the following options: long January 2021 $60 calls on Walt Disney, short January 2020 $125 calls on The Trade Desk, long January 2020 $60 calls on The Trade Desk, short October 2019 $125 calls on Walt Disney, short January 2020 $155 calls on Apple, long January 2020 $150 calls on Apple, short January 2020 $180 calls on Costco Wholesale, long January 2021 $200 calls on Berkshire Hathaway (B shares), short January 2021 $200 puts on Berkshire Hathaway (B shares), long January 2020 $115 calls on Costco Wholesale, short January 2020 $155 calls on Apple, long January 2020 $150 calls on Apple, and long January 2021 $85 calls on Microsoft. The Motley Fool recommends Comcast, Costco Wholesale, Grubhub, McCormick, Sherwin-Williams, and Uber Technologies. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:25:00"
}