{
  "url": "https://www.nasdaq.com/article/nues-strong-dividend-history-helps-get-it-to-the-top-5-cm1210068",
  "title": "NUE's Strong Dividend History Helps Get It To The Top 5 - Nasdaq.com",
  "text": [
    "Nucor Corp. (Symbol: NUE) has been named as a Top 5 dividend paying metals and mining stock, according to Dividend Channel  , which published its weekly ''DividendRank''  report. The report noted that among metals and mining companies, NUE shares displayed both attractive valuation metrics and strong profitability metrics. For example, the recent NUE share price of $52.63 represents a price-to-book ratio of 1.5 and an annual dividend yield of 3.04% - by comparison, the average metals and mining stock in Dividend Channel's coverage universe yields 1.9% and trades at a price-to-book ratio of 2.1. The report also cited the strong quarterly dividend history at Nucor Corp., and favorable long-term multi-year growth rates in key fundamental data points.      The report stated, '' Dividend investors approaching investing from a value standpoint are generally most interested in researching the strongest most profitable companies, that also happen to be trading at an attractive valuation. That's what we aim to find using our proprietary DividendRank formula, which ranks the coverage universe based upon our various criteria for both profitability and valuation, to generate a list of the top most 'interesting' stocks, meant for investors as a source of ideas that merit further research.  ''  makeArticleAd();  The annualized dividend paid by Nucor Corp. is $1.6/share, currently paid in quarterly installments, and its most recent dividend has an upcoming ex-date of 09/26/2019. Below is a long-term dividend history chart for NUE, which Dividend Channel stressed as being of key importance. Indeed, studying a company's past  dividend history  can be of good help in judging whether the most recent dividend is likely to continue.      The Top 5 DividendRank'ed Metals Stocks »  ",
    "  The Top 5 DividendRank'ed Metals Stocks » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:09:12"
}