{
  "url": "https://www.nasdaq.com/article/why-jc-penney-stock-jumped-23-today-cm1210828",
  "title": "Why J.C. Penney Stock Jumped 23% Today - Nasdaq.com",
  "text": [
    "  What happened   J.C. Penney    (NYSE: JCP) shares were surging for the third day in a row today   after investors continued to respond favorably to the retailer's   decision to launch its own men's outdoor apparel brand, trying to   grab a piece of a fast-growing segment. The stock finished Wednesday up 23.8% following a gain of   18.8% the day before. Tuesday's announcement seemed to spark a   short squeeze    that boosted the stock for a second straight day as investors who   had bet against the stock rushed in to cover their bets.   Image source: J.C. Penney.makeArticleAd();   So what  On Tuesday, J.C. Penney said that it was launching St. John's   Bay Outdoor, a spinoff of one of its biggest house brands. It   called the brand \"a new category designed to inspire and serve   customer experiences and build on the strength and relevance of   the retailer's popular men's private brand.\" The company said that St. John's Bay Outdoor would launch in   600 stores on Thursday and online, and it will open outdoor shops   featuring several brands of outdoor gear and apparel in 100   stores on Oct. 4. Separately, J.C. Penney also said it had hired a new senior   vice president, finance, Colin Dougherty.  Now what  The outdoor launch is the company's biggest step forward under   CEO Jill Soltau, who took the helm nearly a year ago. Soltau   pulled the plug on the company's push into appliances, which her   predecessor Marvin Ellison had started, and promised instead to   focus on   apparel    , the company's biggest and most important segment. The launch of St. John's Bay Outdoor and the shops seems like   a smart move, as casual and outdoor clothing have grown more   popular with changing cultural mores, but it will take a lot to   turn around J.C. Penney at this point. Investors should hope that   this is the first of several such launches the company has   planned ahead of the holiday season, as it desperately needs to   take advantage of the shopping rush that comes in December if the   stock's rebound is going to continue.   10 stocks we like better than J.C. Penney       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and J.C. Penney wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Jeremy Bowman      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    " J.C. Penney    (NYSE: JCP) shares were surging for the third day in a row today   after investors continued to respond favorably to the retailer's   decision to launch its own men's outdoor apparel brand, trying to   grab a piece of a fast-growing segment.",
    "The stock finished Wednesday up 23.8% following a gain of   18.8% the day before. Tuesday's announcement seemed to spark a   short squeeze    that boosted the stock for a second straight day as investors who   had bet against the stock rushed in to cover their bets.",
    "  Image source: J.C. Penney.makeArticleAd(); ",
    "Image source: J.C. Penney.",
    "On Tuesday, J.C. Penney said that it was launching St. John's   Bay Outdoor, a spinoff of one of its biggest house brands. It   called the brand \"a new category designed to inspire and serve   customer experiences and build on the strength and relevance of   the retailer's popular men's private brand.\"",
    "The company said that St. John's Bay Outdoor would launch in   600 stores on Thursday and online, and it will open outdoor shops   featuring several brands of outdoor gear and apparel in 100   stores on Oct. 4.",
    "Separately, J.C. Penney also said it had hired a new senior   vice president, finance, Colin Dougherty.",
    "The outdoor launch is the company's biggest step forward under   CEO Jill Soltau, who took the helm nearly a year ago. Soltau   pulled the plug on the company's push into appliances, which her   predecessor Marvin Ellison had started, and promised instead to   focus on   apparel    , the company's biggest and most important segment.",
    "The launch of St. John's Bay Outdoor and the shops seems like   a smart move, as casual and outdoor clothing have grown more   popular with changing cultural mores, but it will take a lot to   turn around J.C. Penney at this point. Investors should hope that   this is the first of several such launches the company has   planned ahead of the holiday season, as it desperately needs to   take advantage of the shopping rush that comes in December if the   stock's rebound is going to continue.",
    "  10 stocks we like better than J.C. Penney       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and J.C. Penney wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than J.C. Penney       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and J.C. Penney wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Jeremy Bowman      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:05:00"
}