{
  "url": "https://www.nasdaq.com/article/the-10-reasons-to-buy-alibaba-stock-cm1206831",
  "title": "The 10 Reasons to Buy Alibaba Stock - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "As the U.S.-China trade war has ebbed and flowed over the past year, so has Alibaba  (NYSE: BABA ) stock. BABA  stock has bounced wildly over the past 12 months. Ultimately, though, Alibaba stock has not made any progress.",
    "The price of Alibaba stock in late August 2018 was $175. The closing price on Friday was $175.",
    "In other words, as the trade war has hung over Alibaba stock, the shares have gone nowhere. Alibaba stock has  been volatile, but it's been flat. The big question now is: how long will it continue on that path?",
    "The answer is, not much longer. In fact, I believe there are ten reasons why investors should  be bullish on Alibaba stock over the next few months and over the next few years. Those ten reasons can be divided into two segments:  the five most important reasons to buy BABA stock and the five less important reasons to buy BABA stock.",
    "Without further ado, let's jump into looking at those ten reasons.",
    "In no particular order, here are the five most important reasons to buy Alibaba stock.",
    "1. The Overall Outlook of Alibaba Group Remains Favorable. Throughout China and Southeast Asia, internet penetration, per capita income and consumer spending remain well below the averages of  developed nations. But the,internet penetration, per capita income and consumer spending  of China and Southeast Asia  are grinding higher. They will move still higher over the next several years as the Chinese government continues to support the expansion of its technology industry. That means that Southeast Asia's digital economy will also continue to expand at a rapid rate for the foreseeable future. Alibaba Group finds itself at the epicenter of that digital economy, so its days of strong growth are just beginning.",
    "2. China's Consumer Economy Is Turning Around. Multiple data points suggest that China's consumer economy, which slowed meaningfully in 2018 and early 2019, is accelerating  in mid-2019. These data points include the improvement of a composite leading indicator and of a consumer confidence index, an acceleration of retail-sales growth, and the stabilization of the nation's manufacturing activity and trade data.",
    "3. Trade Tensions Should Ease Going Forward. This trade war follows a rather predictable cycle. Trade tensions escalate, causing markets to sell  off. Then, the two countries come back to the negotiation table, easing tensions and causing markets to rally. We are currently in the \"coming back to the table\" part of the cycle. So tensions should ease over the next few weeks to months. Markets should rally, pushing Alibaba stock higher.",
    "4. Alibaba's Margins Are Improving. A big knock against Alibaba stock over the past few years has been its lack of profit growth. This situation has persisted because its margins have dropped as the company has spent an arm and a leg to fuel its strong growth. Now Alibaba Group is reducing some of that spending. As a  result, its margins are moving higher. In Q2, for the first time in two years, Alibaba's profit margins over the previous 12 months  actually were higher than in the 12 months preceding the previous quarter.",
    "5. The valuation of Alibaba Stock Is Attractive. Last quarter, Alibaba's revenue growth came in at over 40%, and its profit growth, excluding some items, was over 50%. BABA stock trades at just 25 times Alibaba's expected 2019 earnings. That's a pretty reasonable multiple, considering the company's  profit growth. As a result, Alibaba stock can rise meaningfully.",
    "Here are five less important reasons to be bullish on Alibaba stock in both the near-term and the long-term.",
    "1. Alibaba Is Adding New Revenue Streams. Alibaba Group is so much more than an e-commerce company. It's a cloud company, a media company, and more recently, it's become a data-as-a-service company. By diversifying its revenue streams, Alibaba has increased its exposure to the continuous-growth Southeast Asia digital economy. The higher BABA's exposure to that sector becomes, the higher its growth can be in the long-term.",
    "2. Alibaba Is Going Global. Up until now, Alibaba's marketplace has been open to U.S. buyers, but closed to U.S. sellers. That just recently changed. Alibaba is now letting Americans sell products on its platform . Many American sellers are anxious to sell products to China's huge consumer class. Consequently, over the next several quarters, a flurry of U.S. merchants will flock to Alibaba Group, and this rush of new sellers will meaningfully increase its revenues over the next few quarters.",
    "3. The Technicals of Alibaba Stock Look Good. Despite the trade war, BABA stock has formed a solid uptrend in 2019, based on consistently higher lows. This uptrend appears alive and well, despite the escalation of the trade war in August. Consequently, from a technical standpoint, Alibaba stock looks poised to grind higher into the end of the year.",
    "4. Wall Street Is Bullish on BABA Stock. Wall Street analysts aren't always right. But they are a smart group of stock pickers worth listening to. According to YCharts , the average Wall Street recommendation on Alibaba Group is a  \"Strong Buy.\" The average  price target on Alibaba stock is $215, over 20% above Friday's closing price.",
    "5. Interest Rates Are Low. Interest rates around the world are at all-time lows. Although that means investors are pessimistic about long-term growth prospects, ironically, low rates are good for growth stocks. Growth stocks - like Alibaba stock - are more attractive in a low-interest world in which safe investments produce very little return.  Consequently, growth stocks like BABA stock should continue to be attractive.",
    "Over the long-term, Alibaba stock will be a winner. In the near-term, once trade-war tensions permanently ease, BABA stock will fly higher.",
    "Thus, when it comes to BABA stock, patience is key. Don't stress the trade war. Stay the course and wait for headlines  about the trade war to pass.",
    "As of this writing, Luke Lango was long BABA.",
    "The post The 10 Reasons to Buy Alibaba Stock appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:26:46"
}