{
  "url": "https://www.nasdaq.com/article/why-beyond-meat-stock-dropped-15-in-august-cm1207267",
  "title": "Why Beyond Meat Stock Dropped 15% in August - Nasdaq.com",
  "text": [
    " What happened  Beyond Meat    (NASDAQ: BYND) investors trailed the market last month as their   stock lost 15% compared to a 2% decrease in the   S&P 500    , according to data provided by      S&P Global Market Intelligence    . The decline just erased a small portion of the   food company    's big gains so far this year. Beyond Meat remains higher by   roughly 150% since its initial public offering.   Image source: Getty Images.makeArticleAd();  So what August was a busy month for investors, who were digesting   Beyond Meat's second-quarter earnings report from late July,   along with news of an additional public offering of stock aimed   at raising cash for the growing business. That offering likely   played the biggest role in last month's price decline since a   growing base of shares dilutes the value of existing stock. Now what The key question going forward is whether Beyond Meat can make   good use of the capital it is raising to deepen its partnerships   with restaurants. Many fast-food chains are   finding room on their menus    for plant-based meat substitutes today, but only time will tell   whether these additions will prove popular enough to earn   year-round spots as menu options for burgers, breakfast patties,   eggs, ground beef, and more.   10 stocks we like better than Beyond Meat,     Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Beyond Meat, Inc. wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Demitrios Kalogeropoulos      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    " Beyond Meat    (NASDAQ: BYND) investors trailed the market last month as their   stock lost 15% compared to a 2% decrease in the   S&P 500    , according to data provided by      S&P Global Market Intelligence    .",
    "The decline just erased a small portion of the   food company    's big gains so far this year. Beyond Meat remains higher by   roughly 150% since its initial public offering.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "August was a busy month for investors, who were digesting   Beyond Meat's second-quarter earnings report from late July,   along with news of an additional public offering of stock aimed   at raising cash for the growing business. That offering likely   played the biggest role in last month's price decline since a   growing base of shares dilutes the value of existing stock.",
    "The key question going forward is whether Beyond Meat can make   good use of the capital it is raising to deepen its partnerships   with restaurants. Many fast-food chains are   finding room on their menus    for plant-based meat substitutes today, but only time will tell   whether these additions will prove popular enough to earn   year-round spots as menu options for burgers, breakfast patties,   eggs, ground beef, and more.",
    "  10 stocks we like better than Beyond Meat,     Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Beyond Meat, Inc. wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Beyond Meat,     Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Beyond Meat, Inc. wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Demitrios Kalogeropoulos      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:53:00"
}