{
  "url": "https://www.nasdaq.com/article/five-below-stays-focused-on-profitable-growth-cm1206870",
  "title": "Five Below Stays Focused on Profitable Growth - Nasdaq.com",
  "text": [
    "Five Below 's (NASDAQ: FIVE) second-quarter earnings report last week was mostly within expectations. Revenue was slightly lower than analysts expected, but the company squeaked pas t earnings estimates by $0.01. The stock price still jumped following the report, as investors were impressed with the retail chain's execution, especially its ability to raise prices to mitigate potential tariffs from the U.S.-China trade war.",
    "Let's look at a few things management discussed during the conference call that have investors feeling more confident that Five Below can remain firmly in growth mode in spite of potential headwinds.",
    "IMAGE SOURCE: FIVE BELOW.",
    "Second-quarter sales were up 20% year over year -- within management's expectations and the level that growth stock investors want to see out of a richly valued company. However, comparable-sales growth clocked in lower than expectations at 1.4%. But the company delivered better-than-expected results where it counts, as adjusted earnings per share increased by 19% year over year.",
    "Speaking to the strong performance on the bottom line, CEO Joel Anderson said, \"Strong new store performance enabled us to deliver earnings per share near the high end of our guidance range.\"",
    "Sales growth got a boost from the addition of four new stores that were opened ahead of plan during the quarter. The company is on track to open 150 new stores for the full year, which would bring the total store count to 900 by the end of 2019.",
    "Given how profitable Five Below stores are within the first year, it makes sense for the company to keep opening stores at a steady pace. As Anderson explained, \"With an industry-leading less than one-year average payback on our new store investment, we continue to believe new stores are the best use of capital.\"",
    "As Five Below continues to map the country with stores, management is also investing in distribution centers, recently opening a new one to serve the southeast region of the company's footprint. The chain started the year with three distribution centers located in Mississippi, Georgia, and New Jersey to support the growth in the Southeast and Northeast, where most of the company's stores are located right now.",
    "Investors can get a hint about where the company is looking to expand next by watching where it opens these distribution centers. Three new distribution centers are coming to Texas, the Midwest, and the West Coast. Long term, management believes they can expand the store footprint about three times larger than it is now.",
    "Effective inventory management is part of Five Below's secret sauce of maintaining an industry-leading return on investment on its stores. Management likes to open new distribution centers in the early phase of store growth in a new region. This allows the company to respond to demand very quickly when traffic is high immediately following a new store opening.",
    "The company is doubling down on supply-chain management with the formation of a new executive role. In the second quarter, Five Below announced it was hiring Rich Tannenbaum as the new senior vice president of supply chain. Tannenbaum has previous experience working at other national retailers, such as PetSmart and Vitamin Shoppe. During the call, Anderson said, \"This newly created position at Five Below shows our commitment to building a world-class supply chain.\"",
    "This commitment reflects Anderson's previous experience working as an executive at Walmart , which is known for its highly efficient inventory management. He wants to bring that level of efficiency to Five Below .",
    "One of the benefits of increasing scale is the ability to source merchandise at volume to deliver better value to customers. Basically, the more Five Below grows, the better products the company can source from suppliers, which keeps shoppers coming back for the treasure hunt. The company has expanded from selling sporting goods, for example, for less than $5 to selling consumer electronics at the same low prices.",
    "Five Below is testing its new 10 Below! category, including video games and spa items like neck massagers, all priced below $10. Anderson said, \"These represent items and categories we could not previously carry at Five Below and all that extreme value for our customers.\"",
    "The threat of tariffs has been a thorn in the side of Five Below this year, but the chain has proven resilient with its ability to raise prices. Management has designed the store experience to be a fun place to shop, where customers will be surprised at what they can buy for just a few dollars. What this means is that customers are not likely going to complain if they have to pay a little more for a Bluetooth speaker that is already a bargain at $5.",
    "Five Below has been testing price increases on certain goods priced from $1 to $4, and the results have been favorable. Anderson said, \"Given continued positive results from the pricing tests we expect to roll out the pricing changes across the chain by the fourth quarter.\"",
    "Looking ahead, the combination of new store remodels, new licensed items based on 2019 films, such as Toy Story 4 and The Lion King , and the recent price increases should position Five Below for a strong finish to the year.",
    "Management is calling for comp sales to increase in the range of 2% to 3% in the third quarter and 3% for the full year. Earnings per share are expected to be up 15.8% over 2018 at the low end of guidance, which includes the expected impact from tariffs.",
    "10 stocks we like better than Five Below\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Five Below wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "John Ballard has no position in any of the stocks mentioned. The Motley Fool recommends Five Below. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:55:17"
}