{
  "url": "https://www.nasdaq.com/article/are-you-looking-for-a-high-growth-dividend-stock-alexandria-real-estate-equities-are-could-be-a-great-choice-cm1210473",
  "title": "Are You Looking for a High-Growth Dividend Stock? Alexandria Real Estate Equities (ARE) Could Be a Great Choice - Nasdaq.com",
  "text": [
    " Getting big returns from financial portfolios, whether through stocks, bonds, ETFs, other securities, or a combination of all, is an investor's dream. However, when you're an income investor, your primary focus is generating consistent cash flow from each of your liquid investments. Cash flow can come from bond interest, interest from other types of investments, and of course, dividends. A dividend is that coveted distribution of a company's earnings paid out to shareholders, and investors often view it by its dividend yield, a metric that measures the dividend as a percent of the current stock price. Many academic studies show tha t dividends  account for significant portions of long-term returns, with dividend contributions exceeding one-third of total returns in many cases.  Alexandria Real Estate Equities in Focus  Based in Pasadena, Alexandria Real Estate Equities (ARE) is in the Finance sector, and so far this year, shares have seen a price change of 31.56%. The life science real estate company is currently shelling out a dividend of $1 per share, with a dividend yield of 2.64%. This compares to the REIT and Equity Trust - Other industry's yield of 4.18% and the S&P 500's yield of 1.9%. Taking a look at the company's dividend growth, its current annualized dividend of $4 is up 7.2% from last year. In the past five-year period, Alexandria Real Estate Equities has increased its dividend 5 times on a year-over-year basis for an average annual increase of 6.92%. Any future dividend growth will depend on both earnings growth and the company's payout ratio; a payout ratio is the proportion of a firm's annual earnings per share that it pays out as a dividend. Right now, Alexandria Real Estate Equities's payout ratio is 59%, which means it paid out 59% of its trailing 12-month EPS as dividend. Looking at this fiscal year, ARE expects solid earnings growth. The Zacks Consensus Estimate for 2019 is $6.98 per share, which represents a year-over-year growth rate of 5.76%.  Bottom Line  From greatly improving stock investing profits and reducing overall portfolio risk to providing tax advantages, investors like dividends for a variety of different reasons. It's important to keep in mind that not all companies provide a quarterly payout. High-growth firms or tech start-ups, for example, rarely provide their shareholders a dividend, while larger, more established companies that have more secure profits are often seen as the best dividend options. During periods of rising interest rates, income investors must be mindful that high-yielding stocks tend to struggle. That said, they can take comfort from the fact that ARE is not only an attractive dividend play, but is also a compelling investment opportunity with a Zacks Rank of #2 (Buy).   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Alexandria Real Estate Equities, Inc. (ARE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Getting big returns from financial portfolios, whether through stocks, bonds, ETFs, other securities, or a combination of all, is an investor's dream. However, when you're an income investor, your primary focus is generating consistent cash flow from each of your liquid investments.",
    "Cash flow can come from bond interest, interest from other types of investments, and of course, dividends. A dividend is that coveted distribution of a company's earnings paid out to shareholders, and investors often view it by its dividend yield, a metric that measures the dividend as a percent of the current stock price. Many academic studies show tha t dividends  account for significant portions of long-term returns, with dividend contributions exceeding one-third of total returns in many cases.",
    " Alexandria Real Estate Equities in Focus ",
    "Based in Pasadena, Alexandria Real Estate Equities (ARE) is in the Finance sector, and so far this year, shares have seen a price change of 31.56%. The life science real estate company is currently shelling out a dividend of $1 per share, with a dividend yield of 2.64%. This compares to the REIT and Equity Trust - Other industry's yield of 4.18% and the S&P 500's yield of 1.9%.",
    "Taking a look at the company's dividend growth, its current annualized dividend of $4 is up 7.2% from last year. In the past five-year period, Alexandria Real Estate Equities has increased its dividend 5 times on a year-over-year basis for an average annual increase of 6.92%. Any future dividend growth will depend on both earnings growth and the company's payout ratio; a payout ratio is the proportion of a firm's annual earnings per share that it pays out as a dividend. Right now, Alexandria Real Estate Equities's payout ratio is 59%, which means it paid out 59% of its trailing 12-month EPS as dividend.",
    "Looking at this fiscal year, ARE expects solid earnings growth. The Zacks Consensus Estimate for 2019 is $6.98 per share, which represents a year-over-year growth rate of 5.76%.",
    " Bottom Line ",
    "From greatly improving stock investing profits and reducing overall portfolio risk to providing tax advantages, investors like dividends for a variety of different reasons. It's important to keep in mind that not all companies provide a quarterly payout.",
    "High-growth firms or tech start-ups, for example, rarely provide their shareholders a dividend, while larger, more established companies that have more secure profits are often seen as the best dividend options. During periods of rising interest rates, income investors must be mindful that high-yielding stocks tend to struggle. That said, they can take comfort from the fact that ARE is not only an attractive dividend play, but is also a compelling investment opportunity with a Zacks Rank of #2 (Buy).",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:15:11"
}