{
  "url": "https://www.nasdaq.com/article/validea-martin-zweig-strategy-daily-upgrade-report-952019-cm1207699",
  "title": "Validea Martin Zweig Strategy Daily Upgrade Report - 9/5/2019 - Nasdaq.com",
  "text": [
    "The following are today's upgrades for Validea's Growth Investor model based on the published strategy of Martin Zweig . This strategy looks for growth stocks with persistent accelerating earnings and sales growth, reasonable valuations and low debt.",
    "BANCOLOMBIA SA (ADR) ( CIB ) is a large-cap value stock in the Regional Banks industry. The rating according to our strategy based on Martin Zweig changed from 77% to 85% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Bancolombia S.A. (Bancolombia) is a financial institution engaged in providing a range of financial products and services to a diversified individual, corporate, and government customer base throughout Colombia, Latin America and the Caribbean region. The Bank operates through 10 segments: Banking Colombia, Banking Panama, Banking El Salvador, Leasing, Trust, Investment Banking, Brokerage, Off Shore and All other. It delivers its products and services through its regional network comprising Colombia's non-Government owned banking network, El Salvador's financial conglomerate by gross loans, Guatemala's bank, Panama's bank and off-shore banking subsidiaries in Panama, Cayman and Puerto Rico, as well as subsidiaries in Peru. The Bank and its subsidiaries offer Savings And Investment, Ahorro A La Mano, Financing, Mortgage Banking, Factoring, Financial and Operating Leases, Capital Markets, eTrading, Cash Management, Foreign Currency, Bancassurance, Investment Banking and Trust Services.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "Since its inception, Validea's strategy based on Martin Zweig has returned 359.15% vs. 195.52% for the S&P 500. For more details on this strategy, click here",
    "About Martin Zweig : During the 15 years that it was monitored, Zweig's stock recommendation newsletter returned an average of 15.9 percent per year, during which time it was ranked number one based on risk-adjusted returns by Hulbert Financial Digest. Zweig has managed both mutual and hedge funds during his career, and he's put the fortune he's compiled to some interesting uses. He has owned what Forbes reported was the most expensive apartment in New York, a $70 million penthouse that sits atop Manhattan's Pierre Hotel, and he is a collector of all sorts of pop culture and historical memorabilia -- among his purchases are the gun used by Clint Eastwood in \"Dirty Harry\", a stock certificate signed by Commodore Vanderbilt, and even two old-fashioned gas pumps similar to those he'd seen at a nearby gas station while growing up in Cleveland, according to published reports.",
    "About Validea : Validea is an investment research service that follows the published strategies of investment legends. Validea offers both stock analysis and model portfolios based on gurus who have outperformed the market over the long-term, including Warren Buffett, Benjamin Graham, Peter Lynch and Martin Zweig. For more information about Validea, click here",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 08:04:11"
}