{
  "url": "https://www.nasdaq.com/article/technology-sector-update-for-09112019-bbbbtoiqmaxrzs-cm1210703",
  "title": "Technology Sector Update for 09/11/2019: BB,BB.TO,IQ,MAXR,ZS - Nasdaq.com",
  "text": [
    "Top Tech Stocks",
    "MSFT -0.15%",
    "AAPL +2.91%",
    "IBM -1.23%",
    "CSCO +1.60%",
    "GOOG +0.97%",
    "Technology stocks extended their mid-day advance, with the shares of tech stocks in the S&P 500 climbing over 0.9% this afternoon while the Philadelphia Semiconductor Index was rising more than 1.3% in late trade.",
    "Among technology stocks moving on news:",
    "(+) BlackBerry Ltd ( BB  ) was ahead nearly 5% in late Wednesday trading after the enterprise software firm said the DENSO Harmony Core - a digital cockpit system for automobiles combining BlackBerry's QNX virtualization technology with DENSO Corp's user interfaces - are now available on 2020 Subaru Legacy and Outback models. More carmakers are expected to also begin selling selected models with the new operating system and interface later this month, the companies said.",
    "In other sector news:",
    "(+) Maxar Technologies ( MAXR  ) climbed more than 10% after the company's MDA subsidiary has been hired to design and build navigation antennas for use on the MEASAT-3D satellite, a new communication satellite that Airbus is making to deliver internet connectivity over Malaysia. Terms of the deal were not disclosed.",
    "(+) iQIYI ( IQ  ) rose 7% after early Wednesday announcing the launch of a new group to develop standard format specifications for interactive video entertainment in China associated with the upcoming arrival of 5G mobile service. Other participants include privately-held content providers Youku, Tencent Video and Mango TV, along with Tsinghua and Beihang universities and the National Radio and Television Administration. The new standards are slated for release before the end of the year.",
    "(-) Zscaler ( ZS  ) plunged 20% after the cloud security company late Tuesday issued fiscal Q1 and FY20 profit outlooks trailing Wall Street expectations. The company is projecting Q1 net income in a range of $0.00 to $0.01 per share trailing the Capital IQ consensus expecting a $0.03 per share profit.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-11 03:59:04"
}