{
  "url": "https://www.nasdaq.com/article/austrias-ams-makes-48-bln-osram-counter-offer-outbidding-private-equity-20190903-00823",
  "title": "Austria's AMS makes $4.8 bln Osram counter offer, outbidding private equity - Nasdaq.com",
  "text": [
    "By Kirsti Knolle",
    "VIENNA, Sept 3 (Reuters) - Austrian sensor specialist AMS  made a 4.3 billion euro($4.8 billion) counter-offer for larger German lighting group Osram  on Tuesday, raising the prospect of a bidding war with private equity duo Bain Capital and Carlyle .",
    "AMS made its 38.50 euro($42.90) per share offer for Osram, which is 10% above the price offered by the buyout firms, after approval from German finance watchdog Bafin, adding that the acceptance period will run from Sept. 3 until Oct. 1.",
    "A spokesman for Bain and Carlyle declined to comment on Tuesday following the bid by AMS.",
    "AMS, which makes a large part of its revenues from sensors for the face recognition technology in the latest iPhones but wants to reduce its dependence on Apple , is interested in Osram's technologies for self-driving cars and wants to create a global power in sensors and photonics.",
    "Osram shareholders who have already decided to tender for the private equity groups' offer of 35 euros per share can withdraw and retender, AMS said.",
    "Both bidders have provided for a minimum acceptance threshold of 70%.",
    "\"Our offer and the combination of Osram and AMS represents a better option to all stakeholders than the private equity proposal,\" AMS Chief Executive Alexander Everke said.",
    "The AMS bid includes a 4.2 billion euro bridging loan facility underwritten by UBS  and HSBC , which AMS plans to refinance by issuing debt and equity.",
    "SHARES RISE ",
    "Osram shares gained as much as 2.3% but did not rise above 37.20 euros. Shares in Swiss-listed AMS rose 1.9%, still 10 Swiss francs below the closing price before it detailed its takeover plans last month.",
    "The transaction, if successful, would be the largest purchase in AMS's history. In the 1990s, the group had miscalculated with two acquisitions in Germany and South Africa and had to sell the businesses later at a loss.",
    "Osram, whose lightbulbs were once ubiquitous in European homes, got into difficulties with a strategy to reinvent itself as a high-tech photonics company that included several acquisitions and a billion-euro investment in Asia.",
    "Under Everke, who took the helm three years ago, AMS has focused on buying new technologies. Its largest acquisition so far was the purchase of Singapore-based sensor maker Heptagon in 2016 for $855 million.",
    "Analysts said the combination of AMS's and Osram's lidar systems - sensors that use laser light pulses to render precise images of the environment around a car - would make sense.",
    "However, it might take several years until these systems bring solid revenue flows, IHS Markit analyst Dexin Chen said.",
    "Investors also questioned how the Austrian company, which has 8,500 employees, will be able to integrate the German group, which last year had more than 24,200 staff working in more than 120 countries and at 27 production facilities worldwide. ($1 = 0.8973 euros)"
  ],
  "published_datetime": "2019-09-03 10:09:00"
}