{
  "url": "https://www.nasdaq.com/article/amd-stock-isnt-a-buy-yet-cm1206972",
  "title": "AMD Stock Isn’t a Buy… Yet - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Like the rest of its peers in the semiconductor industry, Advanced Micro Devices (NASDAQ: AMD ) has had a bumpy year. Concerns about the ongoing trade war with China has cast a shadow over the industry for the foreseeable future, making it difficult to pick a winner. Aside from the trade war, however, AMD stock appears to be on track for a pretty solid future. .",
    "But that doesn't mean you should rush out to buy AMD stock just yet",
    "AMD has a lot going for itself right now. Its Ryzen processors are about to see an update, which is expected to boost the firm's performance significantly. The new 7-nanometer Ryzen CPUs are said to offer superior performance while using less power than competing chips - something that should help AMD continue to snatch marketshare away from its competitors.",
    "The firm is also making major strides in the data center industry with its newest server processor, dubbed Rome. According to CEO Lisa Su, the chip has attracted a number of partners who are using it to develop their own platforms before it has even launched. Twitter (NYSE: TWTR ) is also using AMD chips to power its servers , another big win for the firm. ",
    "That's important because data centers are where semiconductor stocks are doing battle right now. Each firm - Nvidia (NASDAQ: NVDA ), AMD, and Intel (NASDAQ: INTC ) - has its strengths, but they all claim their strong position in the data center business will be a growth catalyst over the next few years.",
    "With the rise of cloud computing and Artificial Intelligence, there will be a rising wave of demand for better, faster and more efficient servers -  but it's still unclear who the winner will be. Right now, AMD stock is looking like a pretty solid frontrunner and if all goes well the firm could be on track to become the leader in that market.",
    "Aside from data centers, AMD also has its hands in the gaming space. Falling demand for the firm's semi-custom chips hurt its Q2 results, but some believe the firm will make up for that come next year . That's because gaming consoles that use the chips have seen softer demand as players wait for new hardware to come out. The new consoles are due out in 2020, which means next year AMD should see demand for the semi-custom chips kick in.",
    "After reading about so many positive growth catalysts, you might be wondering how I could possibly shy away from buying AMD stock. But if you buy now, you've missed out on the majority of the good news. All that I've written about above - and perhaps more - is already priced into Advanced Micro Devices stock. AMD's stock price is already more than 50% higher year-to-date - that's a lot to ask of a semiconductor stock in today's environment.",
    "That means any tidbit of bad news could tip AMD stock over a cliff.",
    "While AMD has largely bucked the trend within its industry when it comes to China trade rhetoric, that doesn't mean the firm will remain protected forever. News that a fresh round of tariffs have been implemented by the Trump administration suggests that tension between the U.S. and China will likely persist for the foreseeable future. Not only could that hurt AMD's future prospects, but it could create an economic downturn which would dampen the demand the firm is counting on in 2020.",
    "Advanced Micro Devices looks like a solid semiconductor stock, and I'd certainly keep it on my radar to buy on a significant pullback over the next few months.",
    "However, now isn't the time to add the firm to your portfolio because it looks unlikely to deliver much more in the remainder of 2019. Next year, could be a break out year for AMD stock if all goes as planned, especially if the trade tension with China starts to fizzle out.",
    "Unfortunately, that's just too many ifs to justify AMD's share price right now, so I'd wait for a better entry point if you're looking to take a long-term position.",
    "As of this writing Laura Hoy did not hold a position in any of the aforementioned securities. ",
    "The post AMD Stock Isn't a Buy… Yet appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:08:25"
}