{
  "url": "https://www.nasdaq.com/article/why-the-hartford-hig-is-a-great-dividend-stock-right-now-cm1210470",
  "title": "Why The Hartford (HIG) is a Great Dividend Stock Right Now - Nasdaq.com",
  "text": [
    " All investors love getting big returns from their portfolio, whether it's through stocks, bonds, ETFs, or other types of securities. But for income investors, generating consistent cash flow from each of your liquid investments is your primary focus. While cash flow can come from bond interest or interest from other types of investments, income investors hone in on dividends. A dividend is the distribution of a company's earnings paid out to shareholders; it's often viewed by its dividend yield, a metric that measures a dividend as a percent of the current stock price. Many academic studies show tha t dividends  account for significant portions of long-term returns, with dividend contributions exceeding one-third of total returns in many cases.  The Hartford in Focus  The Hartford (HIG) is headquartered in Hartford, and is in the Finance sector. The stock has seen a price change of 33.41% since the start of the year. The insurance and financial services company is currently shelling out a dividend of $0.3 per share, with a dividend yield of 2.02%. This compares to the Insurance - Multi line industry's yield of 2.15% and the S&P 500's yield of 1.9%. In terms of dividend growth, the company's current annualized dividend of $1.20 is up 9.1% from last year. In the past five-year period, The Hartford has increased its dividend 5 times on a year-over-year basis for an average annual increase of 12.15%. Looking ahead, future dividend growth will be dependent on earnings growth and payout ratio, which is the proportion of a company's annual earnings per share that it pays out as a dividend. The Hartford's current payout ratio is 26%, meaning it paid out 26% of its trailing 12-month EPS as dividend. Looking at this fiscal year, HIG expects solid earnings growth. The Zacks Consensus Estimate for 2019 is $5.24 per share, representing a year-over-year earnings growth rate of 21.02%.  Bottom Line  Investors like dividends for many reasons; they greatly improve stock investing profits, decrease overall portfolio risk, and carry tax advantages, among others. But, not every company offers a quarterly payout. For instance, it's a rare occurrence when a tech start-up or big growth business offers their shareholders a dividend. It's more common to see larger companies with more established profits give out dividends. During periods of rising interest rates, income investors must be mindful that high-yielding stocks tend to struggle. With that in mind, HIG presents a compelling investment opportunity; it's not only an attractive dividend play, but the stock also boasts a strong Zacks Rank of #2 (Buy).   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  The Hartford Financial Services Group, Inc. (HIG): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "All investors love getting big returns from their portfolio, whether it's through stocks, bonds, ETFs, or other types of securities. But for income investors, generating consistent cash flow from each of your liquid investments is your primary focus.",
    "While cash flow can come from bond interest or interest from other types of investments, income investors hone in on dividends. A dividend is the distribution of a company's earnings paid out to shareholders; it's often viewed by its dividend yield, a metric that measures a dividend as a percent of the current stock price. Many academic studies show tha t dividends  account for significant portions of long-term returns, with dividend contributions exceeding one-third of total returns in many cases.",
    " The Hartford in Focus ",
    "The Hartford (HIG) is headquartered in Hartford, and is in the Finance sector. The stock has seen a price change of 33.41% since the start of the year. The insurance and financial services company is currently shelling out a dividend of $0.3 per share, with a dividend yield of 2.02%. This compares to the Insurance - Multi line industry's yield of 2.15% and the S&P 500's yield of 1.9%.",
    "In terms of dividend growth, the company's current annualized dividend of $1.20 is up 9.1% from last year. In the past five-year period, The Hartford has increased its dividend 5 times on a year-over-year basis for an average annual increase of 12.15%. Looking ahead, future dividend growth will be dependent on earnings growth and payout ratio, which is the proportion of a company's annual earnings per share that it pays out as a dividend. The Hartford's current payout ratio is 26%, meaning it paid out 26% of its trailing 12-month EPS as dividend.",
    "Looking at this fiscal year, HIG expects solid earnings growth. The Zacks Consensus Estimate for 2019 is $5.24 per share, representing a year-over-year earnings growth rate of 21.02%.",
    " Bottom Line ",
    "Investors like dividends for many reasons; they greatly improve stock investing profits, decrease overall portfolio risk, and carry tax advantages, among others. But, not every company offers a quarterly payout.",
    "For instance, it's a rare occurrence when a tech start-up or big growth business offers their shareholders a dividend. It's more common to see larger companies with more established profits give out dividends. During periods of rising interest rates, income investors must be mindful that high-yielding stocks tend to struggle. With that in mind, HIG presents a compelling investment opportunity; it's not only an attractive dividend play, but the stock also boasts a strong Zacks Rank of #2 (Buy).",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:15:11"
}