{
  "url": "https://www.nasdaq.com/article/is-macao-heading-into-recession-again-cm1210071",
  "title": "Is Macao Heading Into Recession Again? - Nasdaq.com",
  "text": [
    " Macao casino revenue fell 8.6% in August, the second straight   month it was down. Gambling revenue has been down for five of the   eight months of 2019 so far. While no one expected the casinos to maintain the double-digit   growth rates they were enjoying after coming out of their deep,   two-year decline, the steady drumbeat of weak results and   disconcerting economic news in China could signal that the   gambling enclave is heading back into a recession.   Data source: Macao Gaming Inspection & Coordination     Bureau. Chart by author.makeArticleAd();  Profits are higher Certainly on the surface, it doesn't appear that way. While   Wynn Resorts    (NASDAQ: WYNN) has reported lower adjusted property   EBITDA    at its Macao casinos over the first six months of 2019,   Las Vegas Sands    (NYSE: LVS) ,   MGM Resorts    (NYSE: MGM) , and   Melco Resorts & Entertainment    (NASDAQ: MLCO) have all reported increases. Although the gains (and losses) weren't uniform across all   properties, particularly for the winners, the increases occurred   at their larger, more important resorts while the losses   typically occurred at smaller, less crucial properties.  Data source: Company SEC filings. Even so, resort operators with substantial exposure to Macao   should be concerned with how the market is progressing because   there are also macroeconomic factors that could hurt   casino stocks'    results. Global tensions will take a toll Arguably the biggest issue, for the immediate future anyway,   is the situation in Hong Kong as pro-democracy protesters show no   signs of letting up. Visits from Hong Kong to China, one of the   crucial entry points    to the peninsula, grew only 16% in July, the latest period   available, compared with 23% from January through June. Even the   rate of growth from the mainland to Macao slowed in July to 18%   from 22% over the first six months. Perhaps more problematic in the longer term is China's   economy, which is slowing down quickly. China's exports fell   unexpectedly in August as trade tensions with the U.S. grew. Exports were down 1% for the month, a dramatic change from the   2% gain analysts had expected, and the worst performance since   June, when they dropped 1.3% (exports had risen 3.3% in July).   Trade with the U.S. is also withering. Exports to the U.S.   dropped 16% in August following a 6.5% decline in July, and China   accepted 22% less imports from the U.S. last month than it did a   year ago.      Yet it's not just the U.S. that China is having a problem   with. Imports from Europe and other countries are also in   decline, falling for the fourth straight month last month and   indicating that Chinese consumers are having a more difficult   time.   The City of Dreams and the Venetian resort's canal in Macao.     Image source: Getty Images.  More clouds on the horizon That might not register right away in the casinos, but the   longer-running   weakness in the VIP market    , evidenced by Wynn's results, but which has largely been masked   at the other resorts by strong mass premium customers, or   tourists who don't make the VIP cut but still drop a lot of   money, may start to trickle down to them and the lower end mass   market. New U.S. tariffs on Chinese goods took effect on Sept. 1,   another round will go into effect on Oct. 1, and a third will hit   Dec. 15. Although trade negotiators are working to resolve the   issues, the continued impact will eventually fall on the casinos,   and will likely jeopardize the resorts' ability to bounce back in   the final months of the year. China's economy was already slowing before the trade war; the   tit-for-tat tariff situation has only exacerbated the problem.   Coupled with growing unrest in Hong Kong, it's possible August's   gaming revenue drop was a harbinger that Macao is slipping back   into recession.   10 stocks we like better than Wynn Resorts       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Wynn Resorts wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Rich Duprey      has no position in any of the stocks mentioned. The Motley Fool     recommends Las Vegas Sands. The Motley Fool has a     disclosure policy      .  ",
    "Macao casino revenue fell 8.6% in August, the second straight   month it was down. Gambling revenue has been down for five of the   eight months of 2019 so far.",
    "While no one expected the casinos to maintain the double-digit   growth rates they were enjoying after coming out of their deep,   two-year decline, the steady drumbeat of weak results and   disconcerting economic news in China could signal that the   gambling enclave is heading back into a recession.",
    "  Data source: Macao Gaming Inspection & Coordination     Bureau. Chart by author.makeArticleAd(); ",
    "Data source: Macao Gaming Inspection & Coordination     Bureau. Chart by author.",
    "Certainly on the surface, it doesn't appear that way. While   Wynn Resorts    (NASDAQ: WYNN) has reported lower adjusted property   EBITDA    at its Macao casinos over the first six months of 2019,   Las Vegas Sands    (NYSE: LVS) ,   MGM Resorts    (NYSE: MGM) , and   Melco Resorts & Entertainment    (NASDAQ: MLCO) have all reported increases.",
    "Although the gains (and losses) weren't uniform across all   properties, particularly for the winners, the increases occurred   at their larger, more important resorts while the losses   typically occurred at smaller, less crucial properties.",
    "Data source: Company SEC filings.",
    "Even so, resort operators with substantial exposure to Macao   should be concerned with how the market is progressing because   there are also macroeconomic factors that could hurt   casino stocks'    results.",
    "Arguably the biggest issue, for the immediate future anyway,   is the situation in Hong Kong as pro-democracy protesters show no   signs of letting up.",
    "Visits from Hong Kong to China, one of the   crucial entry points    to the peninsula, grew only 16% in July, the latest period   available, compared with 23% from January through June. Even the   rate of growth from the mainland to Macao slowed in July to 18%   from 22% over the first six months.",
    "Perhaps more problematic in the longer term is China's   economy, which is slowing down quickly. China's exports fell   unexpectedly in August as trade tensions with the U.S. grew.",
    "Exports were down 1% for the month, a dramatic change from the   2% gain analysts had expected, and the worst performance since   June, when they dropped 1.3% (exports had risen 3.3% in July).   Trade with the U.S. is also withering. Exports to the U.S.   dropped 16% in August following a 6.5% decline in July, and China   accepted 22% less imports from the U.S. last month than it did a   year ago.     ",
    "Yet it's not just the U.S. that China is having a problem   with. Imports from Europe and other countries are also in   decline, falling for the fourth straight month last month and   indicating that Chinese consumers are having a more difficult   time.",
    "  The City of Dreams and the Venetian resort's canal in Macao.     Image source: Getty Images. ",
    "The City of Dreams and the Venetian resort's canal in Macao.     Image source: Getty Images.",
    "That might not register right away in the casinos, but the   longer-running   weakness in the VIP market    , evidenced by Wynn's results, but which has largely been masked   at the other resorts by strong mass premium customers, or   tourists who don't make the VIP cut but still drop a lot of   money, may start to trickle down to them and the lower end mass   market.",
    "New U.S. tariffs on Chinese goods took effect on Sept. 1,   another round will go into effect on Oct. 1, and a third will hit   Dec. 15. Although trade negotiators are working to resolve the   issues, the continued impact will eventually fall on the casinos,   and will likely jeopardize the resorts' ability to bounce back in   the final months of the year.",
    "China's economy was already slowing before the trade war; the   tit-for-tat tariff situation has only exacerbated the problem.   Coupled with growing unrest in Hong Kong, it's possible August's   gaming revenue drop was a harbinger that Macao is slipping back   into recession.",
    "  10 stocks we like better than Wynn Resorts       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Wynn Resorts wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Wynn Resorts       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Wynn Resorts wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Rich Duprey      has no position in any of the stocks mentioned. The Motley Fool     recommends Las Vegas Sands. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:16:00"
}