{
  "url": "https://www.nasdaq.com/article/online-auto-retailer-lmp-automotive-increases-ipo-deal-size-to-18-million-cm1207167",
  "title": "Online auto retailer LMP Automotive increases IPO deal size to $18 million - Nasdaq.com",
  "text": [
    " LMP Automotive Holdings, which operates an e-commerce site where users can buy, sell, and rent cars, filed with the SEC to raise up to $18 million in an initial public offering. In its latest filing, the company increased its share offering by 39%.    The Plantation, FL-based company now plans to raise $18 million by offering 3.2 million shares at a price range of $5 to $6. It previously filed to offer 2.3 million shares at the same range. Founder, CEO, and Chairman Samer Tawfik intends to purchase $3 million worth of shares in the offering. At the midpoint of the proposed range, LMP Automotive Holdings would command a fully diluted market value of $51 million.    The company originally filed in June 2019 for a $7 million IPO, but until now LMP's proposed market cap had been below Renaissance Capital's $50 million requirement for tracking US IPOs.    LMP Automotive Holdings was founded in 2017 and booked $17 million in revenue for the 12 months ended June 30, 2019. It plans to list on the Nasdaq under the symbol LMPX. ThinkEquity is the sole bookrunner on the deal. The company has not set a pricing date yet.    The article Online auto retailer LMP Automotive increases IPO deal size to $18 million  originally appeared on IPO investment manager Renaissance Capital's web site renaissancecapital.com.   Investment Disclosure:  The information and opinions expressed herein were prepared by Renaissance Capital's research analysts and do not constitute an offer to buy or sell any security. Renaissance Capital's Renaissance IPO ETF (symbol: IPO)  , Renaissance International ETF (symbol: IPOS)  , or separately managed institutional accounts may have investments in securities of companies mentioned.",
    "LMP Automotive Holdings, which operates an e-commerce site where users can buy, sell, and rent cars, filed with the SEC to raise up to $18 million in an initial public offering. In its latest filing, the company increased its share offering by 39%.    The Plantation, FL-based company now plans to raise $18 million by offering 3.2 million shares at a price range of $5 to $6. It previously filed to offer 2.3 million shares at the same range. Founder, CEO, and Chairman Samer Tawfik intends to purchase $3 million worth of shares in the offering. At the midpoint of the proposed range, LMP Automotive Holdings would command a fully diluted market value of $51 million.    The company originally filed in June 2019 for a $7 million IPO, but until now LMP's proposed market cap had been below Renaissance Capital's $50 million requirement for tracking US IPOs.    LMP Automotive Holdings was founded in 2017 and booked $17 million in revenue for the 12 months ended June 30, 2019. It plans to list on the Nasdaq under the symbol LMPX. ThinkEquity is the sole bookrunner on the deal. The company has not set a pricing date yet.  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:33:00"
}