{
  "url": "https://www.nasdaq.com/article/disney-stock-looks-solid-for-the-next-5-years-cm1207458",
  "title": "Disney Stock Looks Solid for the Next 5 Years - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "For several years, media giant Disney (NYSE: DIS ) was a sleeper on Wall Street, as Disney stock went from about $100-$110 in early 2015, to around $110-$115 in early 2019. In other words, over a stretch of 48 months from early 2015 to early 2019, Disney stock went nowhere.",
    "Why? Cord-cutting. Disney's biggest and most important business is its Media Networks business. That business has been challenged by secular cord-cutting headwinds, which have resulted in sluggish sales and profit trends in the all-important Media Networks business. Those sluggish trends gave investors pause, and ultimately resulted in a sluggish DIS stock.",
    "But, a few months ago, Disney unveiled a robust plan to address those cord-cutting concerns. That robust plan centers around the launch of Disney+ in late 2019 - a new streaming service which is supposed to turn all those cord-cutting headwinds, into streaming subscription growth tailwinds. Investors fell in love with this new plan, and for the first time in basically five years, Disney stock has staged a meaningful move higher over the past several months.",
    "This move is not a head fake. It is the beginning of a multi-year breakout in Disney stock, propelled by consistent and significant out-performance of Disney's new streaming service, Disney+.",
    "All in all, now seems like a good time to be bullish on Disney stock. Over the next few years, this stock will trade almost exclusively on Disney+, and Disney+ has a very realistic chance to blow current estimates out of the water. That combination ultimately means that DIS stock looks good for the next few years.",
    "First, in order to understand the multi-year bull thesis on Disney stock, it is important to understand that Disney stock over the next several years will be all about Disney+.",
    "Consider this: From early 2015 to 2019, Disney stock went nowhere - despite the Parks business firing on all cylinders and the Studio business reporting record results. Then, in the aftermath of Disney announcing a detailed game-plan for Disney+ in early 2019, Disney stock has broken out of its multi-year sideways trading range.",
    "That is no coincidence.",
    "Disney's most important business is the Media Networks business. The Studio business is somewhat of an afterthought and accounts for less than 20% of revenues and profits. The Parks business is bigger (34% of revenues), but lower margin (less than 30% of operating profits). Meanwhile, the Media Networks business accounts for over 40% of both revenues and profits.",
    "Thus, it didn't really matter that over the past several years Disney's Park and Studio businesses were on fire. The Media Network business was not - weighed by cord-cutting headwinds - and so DIS stock struggled.",
    "Disney+ is Disney's proposal to \"fix\" its struggling Media Networks business - not by breathing life back into the media business, but rather by regaining lost media revenue through a new streaming business. As such, over the next several years, DIS stock will be all about Disney+. If Disney+ does well, Disney stock will shoot higher. If it doesn't do well, Disney stock will fall flat again.",
    "I'm bullish on DIS stock over the next several years because I think Disney+ has a very realistic opportunity to significantly out-perform current expectations.",
    "The current expectations on Disney+ are broadly based on management's initial outlook for the streaming platform. That outlook includes around 25 million U.S. subscribers by 2024, and 50 million international subscribers.",
    "Those numbers look very beatable. Simply consider that Netflix (NASDAQ: NFLX ) has over 60 million U.S. subs and over 90 million international subs today. Both of those numbers are growing at a healthy pace. The streaming TV market is projected to grow from 300 million households in 2018, to 450 million households by 2022 . The market will likely exceed 500 million households by 2024. That means the global streaming market is projected to grow by essentially 70% between 2018 and 2024.",
    "Assuming Netflix grows in line with the market, then by 2024, Netflix's global sub base will probably be over 250 million. That's about 50% penetration. Disney+, on the other hand, is expected at just 75 million subs by 2025, or a mere 15% penetration. In that light, Disney's 2024 target of 75 million subs for Disney+ seems very beatable.",
    "DIS is, after all, the world's most dominant media company, with a deep treasure trove of content that consumers globally are shuffling out money to see on the big screen. In the U.S. alone, Disney is selling over 300 million-plus box office tickets every year, on about 10 movies a year. That means for each movie Disney releases, 30 million people in the U.S. alone are willing to pay $10-plus to watch that movie just once.",
    "All that content will find its way onto the Disney+ platform - and it will be re-watchable, on-demand, and packaged with other original content. Presumably, at least 30 million Americans will sign up for that platform. Probably way more.",
    "Realistically, I think Disney+ will reach about 150 million subs by 2024. If so, that means Disney+ is set to significantly outperform expectations over the next few years. That operational out-performance should drive similar out-performance in Disney stock.",
    "Disney stock has been a snooze-fest for the past five years. It will be anything but for the next five years. Into 2025, Disney+ will consistently and significantly outperform expectations. As it does, DIS stock will similarly outperform in a big way.",
    "Consequently, over the next few years, Disney stock projects as a big winner.",
    "As of this writing, Luke Lango was long DIS and NFLX. ",
    "The post Disney Stock Looks Solid for the Next 5 Years appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:47:57"
}