{
  "url": "https://www.nasdaq.com/article/foreign-trophy-hunters-scent-bargains-in-britain-as-pound-weakens-20190912-00101",
  "title": "Foreign trophy hunters scent bargains in Britain as pound weakens - Nasdaq.com",
  "text": [
    "By Josephine Mason, Thyagaraju Adinarayan and Olga Cotaga",
    "LONDON, Sept 11 (Reuters) - From pubs to theme parks, sterling's near record lows against other major currencies has encouraged overseas buyers to snap up \"UK Plc\", with more bargain hunters expected.",
    "Private equity and foreign investors, including Hong Kong's richest man, have swooped on pub operators, brewers and some of Britain's most popular tourist attractions, as the pound  has slipped. .",
    "Last month, Hong Kong's richest man agreed to buy pubs operator Greene King ; private equity firm Blackstone  led a consortium to scoop up Madame Tussauds and Legoland owner Merlin ; Ei Group  was acquired by PE-backed Stonegate Pub Co in July and Japanese brewer Asahi Group  bought Fuller, Smith & Turner  in January.",
    "And in July, U.S. private equity firm Advent International agreed to pay 4 billion pounds ($5 billion) to buy Cobham , the British defence and aerospace group known for its pioneering air-to-air refuelling technology. ",
    "Sterling's fall has been driven by worries about the potential damage to the world's fifth largest economy if Britain leaves the European Union without a deal at the end of October.",
    "If Britain does indeed leave the EU without a deal, it may tarnish the country's longer-term business activity and corporate appeal.",
    "But some analysts reckon the pace of acquisition attempts could quicken ahead of the Oct. 31 Brexit deadline.",
    "\"We think there could now be a rush for other UK-listed companies in the coming weeks - old favourites like ITV and Imperial Brands are among those to watch,\" said Neil Wilson, chief market analyst at Markets.com.",
    "\"There are plenty more besides,\" he added.",
    "The pound has shed about 7.5% of its value against the U.S. dollar since the original Brexit deadline in March and plunged anew at the start of September close to levels not seen since 1985. It has recovered slightly over the past week as parliament acted to stymie a chaotic Halloween Brexit.  GBP/",
    "British government data shows foreign M&A activity in the UK has perked up in recent years, with 218 deals struck in the first half of 2019 worth a total of 23.4 billion pounds ($28.9 billion) showing the pace holding steady despite Brexit fears.",
    "Office of National Statistics (ONS) data shows there were 532 acquisitions of UK companies by foreign buyers in 2018 worth 62 billion pounds, 2-1/2 times the 2017 total and more than three times 2016 levels.",
    "The Hong Kong exchange's move on the LSE, which if completed would be the largest takeover of a UK company by a foreign firm so far this year, and recent dealmaking suggest investors may now be willing to take bets on a UK recovery even as the turmoil around Brexit deepens. ",
    "The recent weakness of sterling \"undoubtedly would be one of the reasons\" behind the Hong Kong exchange move, Jane Foley, senior currency strategist at Rabobank, said.",
    "($1 = 0.8109 pounds)"
  ],
  "published_datetime": "2019-09-12 03:49:00"
}