{
  "url": "https://www.nasdaq.com/article/wall-st-pushed-down-by-weak-data-trade-worries-20190903-01156",
  "title": "Wall St pushed down by weak data, trade worries - Nasdaq.com",
  "text": [
    "By Sinéad Carew",
    "NEW YORK, Sept 3 (Reuters) - U.S. stocks fell on Tuesday as investors worried about global growth prospects after data showed U.S. factory activity shrank in August for the first time since 2016 and the United States and China imposed new tariffs on each other over the weekend.",
    "Investors fled riskier assets as the latest round of tariffs and the lack of a date for a resumption of U.S.-China talks gnawed at any hopes for a resolution to the long-running trade war, which has rattled markets for months and weighed on world economies. ",
    "\"If anything the U.S. manufacturing data signals that the new tariffs couldn't come at a worse time. It's bad news on top of bad news. That's why investors are so focused on negotiations\" said Alec Young, managing director of global markets research at FTSE Russell based in New York.  ",
    "\"Not only have expectations been receding for a U.S.-China deal but they can't even agree on a date to meet,\" said Young. ",
    "He also cited growing uncertainty around Brexit as a concern for investors. British lawmakers on Tuesday triggered a vote that could allow them to stop Boris Johnson pursuing a \"no-deal\" Brexit, a challenge that the government warned would prompt the prime minister to seek an election on Oct. 14. ",
    "Earlier in the day data showed British construction companies last month suffered the sharpest drop in new orders since the financial crisis amid Brexit jitters. ",
    "The Dow Jones Industrial Average  fell 285.26 points, or 1.08%, to 26,118.02, the S&P 500  lost 20.19 points, or 0.69%, to 2,906.27 and the Nasdaq Composite  dropped 88.72 points, or 1.11%, to 7,874.16.",
    "Trade-sensitive industrials  fell 1.4%, making for the biggest percentage loser among the S&P 11 major sectors. Technology stocks  fell 1.3%, weighed down by chipmakers, which have a large revenue exposure to China. The Philadelphia Semiconductor index  dropped 1.8%.",
    "Boeing Co shares , tumbled 2.7% providing the biggest drag for the Dow, after the Federal Aviation Administration said on Friday a global panel of experts will need a few more weeks to finish its review of the company's 737 MAX certification. ",
    "U.S. casino operators felt the brunt of slowing economic growth in China as gambling hub Macau posted weak August casino revenue. Shares of Las Vegas Sands Corp , Wynn Resorts Ltd  and MGM Resorts International  fell between 2% and almost 4%. ",
    "The only sectors that gained ground were utilities , rising 1.8%, real estate , climbing 1.3% and consumer staples , which closed the session up 0.5%. ",
    "Declining issues outnumbered advancing ones on the NYSE by a 1.61-to-1 ratio; on Nasdaq, a 2.50-to-1 ratio favored decliners.",
    "The S&P 500 posted 43 new 52-week highs and 10 new lows; the Nasdaq Composite recorded 49 new highs and 134 new lows.  ",
    "On U.S. exchanges 6.72 billion shares changed hands compared with the 6.99 billion average for the last 20 sessions."
  ],
  "published_datetime": "2019-09-03 16:20:00"
}