{
  "url": "https://www.nasdaq.com/article/euro-dips-to-oneweek-low-before-ecb-meeting-20190911-00519",
  "title": "Euro dips to one-week low before ECB meeting - Nasdaq.com",
  "text": [
    "By Karen Brettell",
    "NEW YORK, Sept 11 (Reuters) - The euro fell to a one-week low against the greenback on Wednesday, a day before the European Central Bank is expected to add further stimulus in a bid to boost the region's economy.",
    "ECB policymakers are leaning toward a package that includes a rate cut, a beefed-up pledge to keep rates low for longer and compensation for banks over the side-effects of negative rates, five sources familiar with the discussion said last week.",
    "\"The mere thought of easing is probably keeping the euro on the defensive at the moment,\" said Shaun Osborne, chief currency strategist at Scotiabank in Toronto. However, \"we're not completely on side with expectations of an aggressive ease… we think there may be a rebound in the euro after the policy meeting tomorrow.\"",
    "The euro  fell 0.34% on the day to $1.1006.",
    "The yen was the weakest since Aug. 1 as optimism over U.S.-China trade talks boosted risk sentiment and reduced demand for safe havens.",
    "China announced its first batch of tariff exemptions for 16 types of U.S. products, days ahead of a planned meeting between the two countries to try and de-escalate their bruising tariff fight. ",
    "The dollar gained 0.22% to 107.77 yen .",
    "Sterling also dipped after a Scottish court ruled on Wednesday that Prime Minister Boris Johnson's suspension of the British Parliament was unlawful, prompting immediate calls for lawmakers to return to work as the government and Parliament battle over the future of Brexit. ",
    "The British pound  fell 0.19% to $1.2323.",
    "U.S. data on Wednesday showed that U.S. producer prices unexpectedly rose in August and underlying producer prices rebounded, but that data will not change financial market expectations that the Federal Reserve will cut interest rates again next week to support a slowing economy. ",
    "This week's major economic focus will be consumer price inflation data on Thursday and retail sales data on Friday.",
    "========================================================",
    "Currency bid prices at 3:00PM (1900 GMT)"
  ],
  "published_datetime": "2019-09-11 09:49:00"
}