{
  "url": "https://www.nasdaq.com/article/south-african-police-make-more-arrests-as-riots-spread-20190903-00917",
  "title": "South African police make more arrests as riots spread - Nasdaq.com",
  "text": [
    "By Onke Ngcuka",
    "JOHANNESBURG, Sept 3 (Reuters) - South African police arrested more than 80 people and confirmed five deaths as riots in Johannesburg and the capital Pretoria intensified on Tuesday, spreading to surrounding townships with roving groups attacking mainly foreign-owned shops.",
    "The streets of Alexandra township, at walking distance from the skyscrapers of Johannesburg's financial centre Sandton, were littered on Tuesday afternoon with broken bricks and glass from buildings torched in overnight fires and debris from police battles with local groups.",
    "\"Even now we are scared to come this side,\" he said. His store sells items like bread, milk and phone cards in the working class neighbourhood, which is regularly rattled by unrest and protests over poor living conditions and jobs.",
    "The latest wave of unrest in South Africa has raised fears of a recurrence of violence aimed at foreigners in 2015 in which at least seven people were killed. Before that, some 60 people were killed in a wave of unrest around the country in 2008.",
    "Nigerian President Muhammadu Buhari said on Tuesday he was  urgently sending a special envoy to meet with President Cyril Ramaphosa to secure the \"safety of (Nigerian citizens') lives and property\".",
    "Police have yet to pinpoint what triggered the violence, which began on Sunday when protesters armed with makeshift weapons roamed the streets of Pretoria's business district pelting shops with rocks and petrol bombs and running off with goods.",
    "High unemployment and widespread poverty have been cited as possible triggers for the recent disturbances and attacks on immigrants, but some officials say the riots may be the work of criminal syndicates.",
    "\"We can't rule out pure criminality, of criminals using a sensitive situation where there are real grievances on issues of unemployment and foreign nationals,\" police minister Bheki Cele told reporters.",
    "Cele confirmed five people had been killed in the three days of rioting, but did not give further details on the circumstances, or on arrests.",
    "He ruled out sending in the army, as the government did in Cape Town in July to quell a spate of gang-related killings.",
    "The premier of Gauteng province, David Makhura, said during an inspection of the damage in Alexandra that there was a \"xenophobic sentiment\" underlying the attacks. He said 86 people around the province, which includes the city of Johannesburg, had been arrested, seven of them in Alexandra.",
    "Ramaphosa condemned the violence, saying in a video posted on Twitter that \"attacking businesses run by foreign nationals is totally unacceptable\".",
    "Immigration to South Africa from across the continent and from parts of southeast Asia picked up in the early 1990s, spurred by the end of apartheid rule and the economic boom that followed.",
    "But in recent years immigration has become a sensitive issue, with anti-immigrant attacks, economic hardship and a government clampdown on immigrants and asylum seekers."
  ],
  "published_datetime": "2019-09-03 12:00:00"
}