{
  "url": "https://www.nasdaq.com/article/dave-busters-entertainment-inc-play-q2-2019-earnings-call-transcript-cm1210665",
  "title": "Dave & Buster's Entertainment Inc (PLAY) Q2 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   Dave & Buster's Entertainment Inc    (NASDAQ: PLAY)        Q2 2019 Earnings Call       Sep 10, 2019 ,   5:00 p.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Good afternoon, everyone. Welcome to the Dave & Buster's   Entertainment, Incorporated Second Quarter 2019 Earnings Results   Call. Today's call is being hosted by Brian Jenkins, Chief   Executive Officer. [Operator Instructions] Now, I would like to turn the conference over to Arvind   Bhatia, Senior Director of Investor Relations, for opening   remarks.  Arvind Bhatia    --   Senior Director of Investor Relations  Thank you, Lisa and thank you all for joining us. On the call   today are Brian Jenkins, Chief Executive Officer; and Scott   Bowman, Chief Financial Officer. After comments from Mr. Jenkins   and Mr. Bowman, we will be happy to take your questions. This   call is being recorded on behalf of Dave & Buster's   Entertainment Incorporated and is copyrighted. Before we begin our discussion of the Company's results, I   would like to call your attention to the fact that in our remarks   and our responses to your questions, certain items may be   discussed which are not based entirely on historical facts. Any   such item should be considered forward-looking statements and   relating to future events within the meaning of the Private   Securities Litigation Reform Act of 1995. All such   forward-looking statements are subject to risks and   uncertainties, which could cause actual results to differ from   those anticipated. Information on the various risk factors and   uncertainties has been published in our filings with the SEC,   which are available on our website at www.daveandbusters.com   under the Investor Relations section. In addition, our remarks today will include references to   EBITDA, adjusted EBITDA and store operating income before   depreciation and amortization, which are financial measures that   are not defined under generally accepted accounting principles.   Investors should review the reconciliation of these non-GAAP   measures to the comparable GAAP results contained in our earnings   announcement released this afternoon, which is also available on   our website. Now, I will turn the call over to Brian.  Brian A. Jenkins    --   Chief Executive Officer  Thank you, Arvind. Good afternoon, everyone and thank you for   joining our call today to discuss second quarter results and   outlook for the business. For the quarter, we reported record   results increasing revenue by 8%, EPS by 7% and EBITDA by 5%. We   have built a high margin business that generates strong free cash   flow, which when combined with our strong balance sheet, has   enabled us to return more than $200 million in share repurchases   and dividends, and reduced our float by almost 13% as at the end   of the second quarter. While we continue to profitably grow our business and return   significant capital to shareholders, our comp sales results came   in below expectations as last year's VR launched proved difficult   to match and our promotions were not as effective as we had   anticipated. We also face headwinds from adverse weather and the   continued impact of competitive intrusion and cannibalization.   Later, Scott will provide more details on these factors and   additional highlights on the quarter in his prepared remarks. But   first let me share with you what we're seeing in the market and   our approach to managing the business to maximize value for   shareholders. There is no question that we are in an attractive and growing   category as consumers continue to increase spending on   experiences. As a leading brand that delivers immersive   experiences, we are in a great position to capitalize on this   favorable secular trend. At the same time, this trend and our   success have attracted many more players in the space, and the   overall market today is quite fragmented and competitive. Over   the past 18 months, we've made important progress on several   fronts, including enhancements to our food and beverage offerings   and the introduction of more immersive games, including our   industry-leading VR platform. As part of our focus on operational excellence, we've also   improved our service as reflected in our consistently higher   guest satisfaction scores. While we've accomplished a lot, we see   great opportunities for continued improvement and recognize we   have a lot more to do. As I have mentioned on previous calls, we   see immense opportunity to drive traffic by increasing guests'   frequency and improving F&B attachment once guests are in the   door. With an annual frequency of less than two times and F&B   attach rate of approximately 50%, driving deeper guest engagement   to improve these metrics is our biggest opportunity to reignite   same-store sales growth. In the near term, our goal is to execute on five priorities   that we have identified to maximize shareholder value. First, the   revitalization of our existing stores which in the near term   includes reenergizing the dining area and many of our stores to   drive food and beverage attachment. It also includes continued   food, beverage and amusement innovation to augment our offering,   all of which is a part of introducing new wow experiences. Second, we are focused on building deeper guest engagement,   which includes the nationwide launch of our new mobile app in   October. It also includes increasing investment in digital media   to more effectively reach our guests. Third, we are fueling   growth investments by surgically reducing costs in other areas.   Through the realization of operational efficiencies both in our   stores and corporate office, we expect to fund our growth   initiatives organically by redirecting resources into our   P&L. Third -- fourth, we are enhancing rigor on capital and   resource allocation to invest in the highest returning   opportunities for the overall D&B system. This includes   optimizing store formats to match market sales potential and   managing the pace of new store growth to maximize returns and   sufficiently focus our development team and store level managers   on advancing our store of revitalization efforts. And fifth,   returning significant capital to shareholders in the form of   share repurchases and dividends. I went through those pretty   quickly. So let me spend some time on each of these five   priorities, particularly the first. Our number one priority is   store revitalization to reignite comparable store sales   growth. Our focus on this initiative begins this quarter with our Wow   Walls to reenergize our dining rooms. For those of you who have   been to our Dallas store, you know you've been testing this idea   since late last year, a cutting-edge digital display technology   using a nearly 50-foot LED screen that can be customized by   location. We are very pleased with the list we have seen in   Dallas, particularly in F&B and plan to roll out the WoW   Walls technology in 35 additional stores by the end of October as   the football season gets under way. Over time, we also plan to extend LED technology to our sports   lounges to cement our position as one of the best and most   innovative sports doing destinations in the country to drive   reach, frequency and F&B penetration. The WoW Walls and   expanding the use of LED technology are only some of the   improvements we are making to our stores. In addition, we've   reengaged Jackman reevents to take a comprehensive look at our   store portfolio and offerings to assist with our brand   revitalization and a strategic refresh. As the foremost customer   experience reinvention company and an organization that we have   worked with to great effect in the past, we believe this highly   successful partnership will continue to be instrumental in   enhancing our integrated experience across all customer trust   points. We are committed to our store revitalization efforts and are   excited about the opportunities in front of us. In addition, as   we look to keep our games and attractions refreshed, we are   excited to launch Terminator VR which will be the Company's fifth   proprietary title in our VR library. The launch will coincide   with the release of the new Terminator movie in November. We're   excited to continue to leverage our leadership in the industry to   be the go-to place for cutting-edge entertainment. Making sure we   have a strong pipeline of games and other initiatives to wow our   guests and drive comparable store sales will continue to be a top   focus for our team. With all of the projects under way and as new strategies   emerge from our engagement with Jackson, we will maintain new   store development flexibility and optionality not only for our   store revitalization efforts, but also to execute new   initiatives. Our second near-term priority, which goes   hand-in-hand with the first, is building deeper guest engagement.   We have already discussed the large and untapped opportunity to   unlock guest frequency and F&B penetration. Our new mobile   app rolling out nationally later this quarter is an important   tool that will help us exploit this opportunity. The app allows   guests to use their phones to quickly purchase and recharge   digital power cards, tap and play games and earn valuable loyalty   points. It will also allow us to connect directly with guests and   deliver targeted, personalized offers whether they're in store or   out of store. The new app allows us to capture powerful   actionable guest data and in a way that is highly differentiated   in our industry. The app we've promoted on TV and through digital   media and our 12,000 guests facing employees will also play a key   role in increasing awareness and use of the app. We look forward   to updating you on our progress in the future. Now I'll turn to our third priority, which is to surgically   reduce costs and redeploy those realized savings to fuel   investments in organic growth opportunities. As you know, we   enjoy industry-leading margins, a result of significant margin   expansion over the past decade. In fact, since 2006, we have   nearly doubled our EBITDA margins. We have achieved these results   by delivering revenue growth, while maintaining disciplined cost   management. This proven discipline continues to service us well   today. Our preliminary estimate before one-time cost and   reinvestment is that we can achieve approximately $15 million in   annualized cost savings from near-term initiatives, including   off-peak later [Phonetic] optimization, further centralizing our   special events team, some G&A streamlining and modest changes   to recipes and gaming mix. We've made these changes thoughtfully in order not to impact   the quality of the guest experience. We intend to reinvest most   of our realized savings back into new initiatives to fuel organic   growth. And speaking of new growth investments, we are investing   in building a dedicated team to support the increasing digital   presence and capabilities we anticipate. We have added resources   to our technology group and have engaged third parties to collect   anonymized privacy protected data on our guests at a macro level,   data that will complement what we are learning directly via the   app. We are still hiring in this area with a few positions   currently open to round out our consumer and data insights team.   As we build a more robust database and gain valuable consumer   insights, over time we will have actionable intelligence to make   our digital media, promotions and offers more relevant, targeted   and customized for our guests. We are optimistic about the   potential to drive better guest engagement by the investments we   are making in our team, our technology and digital presence and   look forward to reporting on our progress. To provide a little more context here, I want to emphasize our   balanced strategy. We're not simply cutting cost to temporarily   boost margins. Instead, we are reallocating resources to the   highest return opportunities mainly in the areas of deeper guest   engagement, digital marketing and consumer intelligence   capabilities. We are improving our operational efficiencies while   maintaining and building on the Company's strong market position   and competitive differentiators. Turning to our fourth priority, I mentioned earlier, we have a   rigorous approach to deploying our capital to the highest return   opportunities. In addition to some of the exciting organic   initiatives I've described, opening new stores in attractive   location also remains an important part of our growth strategy.   Backdrop is that during the past 18 months, competitive store   openings have accelerated presented a major headwind to the   entire industry. I know there are differing views among investors   regarding our unit expansion strategy. So I want to take a moment   to clarify our process for investing in these stores,   particularly as compared to other capital allocation   priorities. We know our stores deliver a strong value proposition. It is   reflected in what we believe our best-in-class AUV margins and   store level returns. We only pursue new unit growth when the   incremental unit delivers the compelling return on capital, both   on a stand-alone basis and when considering its impact on our   entire system. Since 2011, the 29 new stores that have been open   for at least three years have averaged annualized returns of 45%   over their first three years. Looking at more recent cohorts such   as our 2016 class, this group has also averaged annualized   returns of 45% in its first two years. Realizing less than   three-year payback on a stand-alone business represents a   compelling opportunity for opening new stores. In addition to strong return on capital, there are ancillary   long-term benefits in opening multiple stores in a market. The   additional stores deliver strong returns, increased store   density, provide leverage on G&A and marketing and talent   retention that help us fortress the market for the long term.   While we're pleased with our success in the past, we're also   excited to introduce more productive and higher return prototypes   as we increasingly enter smaller markets. Take for example our   17K format Corpus Christi store, which open in late 2018 and is   on track to generate year one sales of over $8 million, in line   with the targeted volume for our 30K box. The store is expected   to achieve approximately 35% store level margins and 50% cash on   cash return in its first year. While we are not suggesting all 17K format stores will   generate this level of performance, Corpus Christi demonstrates a   potential, efficiency and returns of a smaller 17K format store.   With sub-attractive opportunities are available, it makes   compelling financial sense to pursue them. As we continue to   identify high-value opportunities in revitalizing existing   stores, we believe it's prudent to balance the demands that store   openings place on our corporate infrastructure, development team   and in-store talent. As a part of our ongoing review process, we   are carefully considering the pace of new unit growth. Consistent   with our top priority of revitalizing our existing stores, we are   preserving our optionality on new store openings in the back half   of 2020 and in 2021. While it's too soon to announce any changes at this time, we   are evaluating our options and will pursue the path that we   believe will create the most value to shareholders. In the   meantime, continuing to open high returning stores is the right   strategy from a competitive perspective, but also in terms of   maximizing the return on investment. Our investment philosophy   will continue to be balanced and opening new store will continue   to be just one aspect of our overall capital spending plan. As   I've mentioned in the near term, reenergizing our existing stores   to drive frequency and improving comps will be our top   priority. And finally, our fifth near-term priority to create long-term   shareholder value is returning capital to our shareholders.   Beyond investing in our business, we have been using our strong   free cash flows and balance sheet flexibility to   opportunistically buyback our stock and pay healthy dividend to   shareholders. Reflecting confidence in our long-term potential   and the current valuation of our shares, the Board recently   increased our share repurchase authorization another $200 million   to $800 million. And as you heard me say at the beginning of the   call, we have been quite active on the capital return front. We   believe that capital return will continue to be an important   contributor to our story going forward. To wrap up, we expect that generating improved comps and   operational efficiencies, achieving high RIs from new stores and   returning capital to shareholders are not mutually exclusive and   will all be important contributors to value creation at Dave   & Buster's. We have the talent, resources and a long track   record of success that shows we can effectively and   simultaneously execute on our plans. Importantly, I would like to   stress that we will continue to maintain a strong pipeline of   additional high return ideas that we actively evaluate to   supplement the initiatives already under way. We are conducting a   thorough review of all aspects of our business and operations as   a part of our annual strategic planning process. We will adjust our strategic plan and response to our business   reviews, competitive dynamics, market conditions and other   factors. We are a nimble, experience team, taking decisive action   in the face of recent performance and acting with appropriate   urgency to extend Dave & Buster's long track record of   delivering our performance and superior returns. With that, I'll turn it over to Scott to discuss the quarter's   highlights, our financial performance and updated 2019   guidance.  Scott J. Bowman    --   Senior Vice President & Chief Financial Officer  Thank you, Brian and good afternoon everyone. I'll begin by   spending a few minutes discussing a highlight to the second   quarter, followed by our financial performance and then finish   with our full-year guidance. First, our key achievements in the   second quarter. In Amusements, we strengthened our VR library   with the launch of our fourth proprietary title Men in Black:   Galactic Getaway. In addition, during the summer, we launched   several exciting games including Centipede [Phonetic], 100   tickets, Ring Talk and Basketball Pro. These titles have all   tested well with their guests and initial read on the performance   has been positive. Within F&B, the summer we introduced a Hawaiian-themed   limited time offer we call iron vibe [Phonetic] that include   craveable entrees like smoky barbecue baked in Hawaiian ribs,   aloha ginger salmon and crispy Hawaiian chicken sliders. For   upcoming October menu, we will introduce new items, including a   grilled chicken avocado ranch sandwich and drunken New York strip   while removing a few slower moving items. We will continue to   enhance and innovate offerings in F&B as we know this will be   an important contributor to our go-forward success. In terms of our marketing campaigns, during Q2, we continue to   run our unlimited wings and unlimited video games promotion on   Thursdays as we did in Q1. In addition, we tested two promotions   highlighting food and game combos. Favorable combos which we ran   for four weeks followed by an unlimited play combo. Collectively,   these value-oriented campaigns did not resonate with our guests   as well as we had anticipated. Going forward, we will continue to   test new promotions to bring value to our guests and increasingly   leverage digital marketing to communicate our message. For Q3, we have also brought back a 99 unlimited range from   multiple game days during the football season. This promotion now   includes a $10 power card instead of unlimited gameplay, which we   believe will help improve per capita spend in Amusement. With   respect to new stores, we opened three new locations in the   quarter and have opened two additional stores since quarter end.   Year-to-date, we have opened 12 new stores, and we continue to   expect to open 15 to 16 new locations for the full year. These   store openings for the full year will skew toward large format   stores and new markets. Looking ahead, we still have a significant white space   opportunity. We have 132 locations currently and continue to   believe our long-term opportunity of 230 to 250 locations in the   US and Canada alone. We will continue to be prudent and   disciplined as we expand our footprint, ensuring we invest in the   highest return opportunities while returning excess capital in   the form o   f   dividends    and share repurchases. And now let me turn to our financial highlights. During the   second quarter, total revenues increased 8%, driven by strong   contribution from our 31 non-comparable stores, partially offset   by 1.8% decrease in our comparable stores. As Brian mentioned,   our comp sales results came in below expectations as last year's   VR launch proved difficult to match and our valued promotions   were not as effective as we had anticipated. In addition, weather   had an unfavorable impact of approximately 80 basis points on   comps, and competitive intrusion and cannibalization remains   headwinds during the quarter. Looking at overall sales by category, Amusement and Other grew   9.4% and F&B grew 5.9%. Amusement and Other represented 60%   of total revenues during the quarter, an increase of 80 basis   points in mix from the prior year period. Breaking down comp   sales, our walk-in sales were down 2%; our special events were up   slightly. In terms of category comp sales, Amusement and Other   was down 0.8% while F&B was down 3.2%. Within F&B, food   was down 3.8% and the bar business was down 1.6%. Total cost of   sales was $59.6 million in the quarter and improved 10 basis   points as a percent of sales. This was due to an improvement in   Amusement margin, higher mix in amusement resident revenue   partially offset by lower F&B margin. Food and beverage cost   as a percent of sales was 30 basis points unfavorable compared to   last year, primarily driven by the impact of our limited wings   promotion, higher avocado prices and costs related to our shift   to fresh juices within our bar offerings. This decline is   partially offset by the positive impact of 1.7% in food pricing   and 1.9% in beverage pricing. Cost of Amusement and Other as a   percent of sales was 40 basis points favorable compared to last   year. Amusement margins benefited from our pricing initiatives   and the continued shift toward virtual reality and other   simulation games, partially offset by higher costs associated   with the new RFID power card. Operating payroll and benefits expense was 23.5% of sales or   40 basis points higher year-over-year due to the unfavorable   impact of nearly 5% wage inflation, deleverage on comp store   sales and the impact of non-comp stores. This was partially   offset by the rollover of higher labor costs last year associated   with the VR launch. Other store operating expenses were up 60   basis points year-over-year, largely driven by occupancy   expenses, primarily at non-comp stores partially offset by   leverage on a marketing cost. G&A expenses of $16 million were up 8% from the prior   year, reflecting increases to support a growing store base and   higher technology and stock-based compensation expense. As a   percent of sales, G&A was flat. EBITDA increased 5.3% to $79   million and was 23.9% of sales reflecting a reduction of 60 basis   points versus the prior year. Adjusted EBITDA of $86 million was   up 4.4% and diluted EPS of $0.90 was at 7% versus the prior   year. Shifting to the balance sheet. We had approximately $568   million of outstanding debt at quarter-end resulting in leverage   of approximately 2 times EBITDA, up from 1.6 times at the end of   Q1 and 1.4 times at the end of last year. The increase was mainly   due to additional share repurchases during the quarter, and we   feel comfortable with our leverage ratio at these levels. As   Brian mentioned, we are driving value by returning excess capital   to shareholders and we have been quite active on that front.   During the second quarter, our Board increased the share   repurchase authorization by another $200 million to a total of   $800 million. We repurchased approximately 3.4 million shares in   the second quarter for $137 million and had approximately $270   million remaining under the existing authorization at the end of   the quarter. We also paid our fourth quarterly cash dividend of   $0.15 per share during the quarter. Turning now to guidance. Based on recent trends, we are   revising our fiscal year 2019 guidance as follows. Total revenues   are expected to be in the range of $1.338 billion to $1.359   billion versus prior guidance of $1.365 billion to $1.390 billion   reflecting growth of 6% to 7% versus the prior year. Based on   July and August comp trends which were down approximately 4.5%   and our outlook for the balance of the year, we expect full year   comp to be in the range of negative 3.5% to negative 2%. This   compares to previous guidance of negative 1.5% to positive   0.5%. We are projecting net income to be in the range of $91 million   to $100 million which is prior guidance of $103 million to $113   million. Values just based on our effective tax rate at 22% to   22.5% which is unchanged. Finally, EBITDA is expected to be in the range of $272 million   to $282 million. Excluding one-time charges, we expect EBITDA to   be in the range of $274 million to $284 million. This compares to   prior guidance of $283 million to $295 million. In terms of   quarterly phasing, Q3 includes an estimated $2 million in   one-time charges related to our cost-saving initiatives as well   as increased marketing to promote our Wow Walls and mobile app   initiatives. Also keep in mind that in Q3 last year, we   recognized $2.2 million in business interruption insurance   recoveries that had a favorable impact on EBITDA. Thank you for your interest in Dave & Buster's. Now I will   turn the call back over to Brian.  Brian A. Jenkins    --   Chief Executive Officer  Thank you, Scott. Our decision to reset guidance was not taken   lightly. And was taken in context of what we've seen in the   marketplace since our last       earnings call    and the recent comp trends Scott mentioned. We have many reasons   to be encouraged for the back half of the year. But at the same   time, we are cognizant of recent volatility and potential risk.   As such, the midpoint of our revised guidance assumes no   near-term improvement from current trends, and the upper end of   our guidance assumes modest impact of initiatives starting in   Q4. I'd like to close by thanking our team for their dedication   and hard work as we focus on our five near-term priorities,   namely revitalizing the existing stores, building deeper guest   engagement, managing cost to fuel organic growth, investing in   high return opportunities and returning capital to shareholders.   As always, we appreciate our shareholders for your continued   support and interest in Dave & Buster's. Now we'd be happy to answer your questions during Q&A.   Lisa, please open the lines. Questions and Answers:  Operator  Thank you. [Operator Instructions] We'll take our first   question from Andy Barish with Jefferies.  Andy Barish    --   Jefferies -- Analyst  Hey, guys. I'm just wondering if you could give us a little   bit more color on sort of the non-impacted stores and maybe an   update on the percentage of the system you think is impacted. The   question is; are you seeing deterioration kind of in the core   that hadn't been impacted by competition which is leading to some   of the other changes that you discuss today.  Brian A. Jenkins    --   Chief Executive Officer  Well, I'll answer that the first question about impacted   stores. The base of stores impacted by either competition or   cannibalization did grow in the quarter, Andy, from 40% in Q1 to   45% of our store-based comp base in Q2. So we did see an   acceleration of impact at stores. But that's not the only factor   here in the second quarter. We mentioned on the call the rollover   of VR was a significant factor for us, but lapping of that   platform launch last year with Jurassic World, we underestimated   the impact on traffic in our view and weather was not   particularly great for us in the quarter. We estimated about 80 bps of pressure in the quarter. And we   mentioned that a little bit actually on the Q1 call as we started   off in May. We had some difficult weather around Memorial Day   weekend and then we had some weeks in July. So there are a number   of factors, but definitely competitive landscape is something   that continues to accelerate in our view.  Operator  Thank you. Our next question comes from Sharon Zackfia with   William Blair.  Sharon Zackfia    --   William Blair -- Analyst  Hi, good afternoon. I guess I'd be interested in hearing more   about the Wow Walls and if you could quantify any kind of lifts   you saw there in Dallas, whether it related to traffic or food   and beverage attached. And maybe a compare contrast that   initiative versus prior remodeling initiatives you did around   D&B sports and so on.  Brian A. Jenkins    --   Chief Executive Officer  Well, we're very excited about the WoW Walls. We as you know   began that test in late 2018 in our Dallas store. A 50-foot LED   screen really reenergizes, brings a whole new energy to that   space. It's a very contemporary look. It's latest and greatest   technology LED panels, high resolution. So we're combining that   Wow Walls kind of technology with some improvements in furniture,   flooring and other elements to really revitalize the dining   experience. In our view is that is one of the great pass toward   further F&B penetration. Drive people into that space that is   today highly underutilized. Our dining rooms today, it brings a   whole new experience and we have seen outside performance. And I   really want to get into the specifics of Dallas here. But it is one of our top performing stores right in the top   couple of stores in terms of performance in our system and   F&B in particular is performing very well. So we like the   look and we like what it does to the energy of our brand. And we   like what we see with this investment.  Sharon Zackfia    --   William Blair -- Analyst  Can I just ask a follow-up? I mean is it fair to think that   those comps are positive in Dallas and then when you complete a   Wow Walls, I mean is there a big initial list or is it something   to build?  Brian A. Jenkins    --   Chief Executive Officer  Well, they are definitely positive. It's one of our top two   the three performing stores in the system. So it is a highly   positive store in our system. And we did this, we made this   improvement in I think was December of 2018. Initially, we really   didn't advertise that, it gets build over time, building   awareness. So it did take a little time to be noticed for what we   had invested there, but it's impressive and the difference here   is we are going to invest in our third quarter in digital media   to drive awareness of this offering. So we will be investing to   build that awareness. But I do think it does take time. As I mentioned, our   frequency is fairly low as a brand, less than 2 times. So I think   it does build over time, but we feel very confident and what this   is going to do and add to the brand experience.  Sharon Zackfia    --   William Blair -- Analyst  Thank you.  Operator  Our next question comes from Joshua Long with Piper   Jaffray.  Joshua Long    --   Piper Jaffray -- Analyst  Great, thanks for taking my question. Wanted to circle back to   the VR, you said you mentioned a couple times the difficulty in   lapping last year's rollout. So I am curious how you're thinking   about VR? And if it's a function of awareness or if it's content   or what you are learning about how the consumer is engaging with   that VR platform? And then also wanted to see if you might be   able to provide an update in terms of pricing. I know we had   talked about some optionality in terms of higher pricing into our   bundling offers with the VR. And in any sort of latest updates in   terms of what you learned there.  Brian A. Jenkins    --   Chief Executive Officer  Thanks for the question. Well, clearly, we learned a few   things as we lap that introduction of a platform in any way. We   introduced the roller coaster last year with both platform and a   very popular title in Jurassic World. And that proved to be   difficult to match enroll over. The trial that per capita lift   that we saw and with that launch was impressive and the rollover   was difficult. We'll begin to move away from some of that outside   performance as we get further away from the summer. But we still   have great aspirations for that platform. It is a platform that   allows us to introduce new content, proprietary content and   movies so to speak, new experiences and we're excited about the   launch of Terminator with an IP that we secured. It's going to launch in and around the time of the launch of   the movie in November. We really like what this game is going to   deliver. And as you asked the notion of bundling is something   that we expect to pivot into as we head into this launch of   Terminator. We have built at this point five really great   experiences and our media campaign as we launched Terminator is   going to not only launch and feature Terminator, but we are going   to tie in the breadth of experiences that we've built in this   library.  Operator  We'll take our next question from Jeff Farmer with Gordon   Haskett.  Jeff Farmer    --   Gordon Haskett. -- Analyst  Great, thank you. I appreciate the comments on lapping the VR   launch, but can you provide a little bit more color on that the   day part, week part trends? Any type of customer demographic   factors that might also be weighing on sales for you guys.  Brian A. Jenkins    --   Chief Executive Officer  It's similar, Jeff, to what we have seen over the last more   than four quarters. Our strongest state partners earlier in the   launch day part over the course of the quarter. And we continue   to have our toughest day part late night.  Jeff Farmer    --   Gordon Haskett. -- Analyst  Okay, and then in terms of the incremental costs associated   with the mobile app introduction. I'm just curious how much of   those costs are already flowing through the income statement or   if there are more to come?  Brian A. Jenkins    --   Chief Executive Officer  Well, they are flowing through our capital guide as well as   some incremental expense associated with our technology team. So   they are reflected our efforts as it relates to 20 and teen are   reflected. So you have anything, Scott.  Scott J. Bowman    --   Senior Vice President & Chief Financial Officer  Yes. One thing I'll add to that, yes, most of that is flowing   through I think what you'll see as I mentioned in Q3 that they   are from a marketing standpoint we will kind of over index on   marketing in Q3 to promote the rollout of the mobile app, as well   as continued rollout of this Wow Walls.  Jeff Farmer    --   Gordon Haskett. -- Analyst  All right. Just one final follow-up here. I think the   amusement same-store sales number came up, but did you guys share   the level of menu pricing and pricing that was captured within   that amusements same store sales number?  Scott J. Bowman    --   Senior Vice President & Chief Financial Officer  Yes. So amusement pricing was up about 3% for the   quarters.  Jeff Farmer    --   Gordon Haskett. -- Analyst  All right. Thank you.  Operator  Our next question comes from Jake Bartlett with SunTrust.  Jake Bartlett    --   SunTrust -- Analyst  Great. Thanks for taking the question. My first question was   about on the engagement with -- maybe I have written this down   wrong, but Jackman Entertainment or Jackman. And I think you   referred to it as a strategic refresh. So I'm just -- I'm trying   to understand what that might mean for just your mix of games or   just maybe a little detail on what that's going to entail?  Brian A. Jenkins    --   Chief Executive Officer  Well, we're very excited about working with the Jackman team   again. We are really taking a comprehensive look at our   portfolio. Our offering as we think about our brand and   revitalizing the brand, we had a very, very successful   partnership with Jackman and his team dating back two years of   really 2010 and 2014. And they were very instrumental in the   success that we had in revitalizing the brand and some of the   outperformance that you -- that we had in the years of 2014 and   beyond. So we're really excited about working with them again.   They're a very bright team. They're in my view better today than   they were a decade ago. And we're really optimistic about some of   the initiatives that are going to come out of that work. This is not a thing that happens overnight. We work with this   group for three to four years on and but it did result in new   offerings, new approaches to our business. And that's what this   process is about. And we are early on here, but really excited   about this project.  Jake Bartlett    --   SunTrust -- Analyst  Got it. And then you mentioned with the Terminator VR release   in November, I'm interested to hear what else is on the docket,   especially the kind of important holiday season. And whether we   should expect kind of similar cadence from last year with   Dragonfrost being launched before the holidays. And I also just   want to give larger question about content. And I'm wondering   whether because you potentially more exclusive focus on VR for   last year and half since Halo, is that an attachment of some of   the gains that you are -- your core consumer appreciates?  Brian A. Jenkins    --   Chief Executive Officer  That's a great question, Jake. We are focused on delivering a   balance of titles. Clearly, with the launch of the platform on   the VR platform does offer us a great opportunity to introduce   proprietary titles. And we have leaned in on that obviously over   since we introduced the platform mid of last year. So we're still   looking at the cadence of how many. We obviously did three this   year, but we're evaluating that cadence. But it is not at the   detriment of introducing other highly popular titles. We   introduced I think Scott in his remarks mentioned some of the   titles that we introduced over the course of this summer that are   very popular interests that resonate well with guests that bring   new experiences. So we're not solely focused on the arts a piece of the   introduction of games, but it does one that is able to command a   pretty good spot on our TV campaign and in our media message. So   but it's not -- we are abandoning all games here. We are working   to deliver multiple game.  Jake Bartlett    --   SunTrust -- Analyst  Got it. And then last question. The unlimited wings and then   now the $10 Power Card. It still different than last year with   the unlimited gameplay. Do you see much risk around that? Or was   that something we -- something you've done both before, but I   just want to gauge any level of risk around kind of making that   switch.  Brian A. Jenkins    --   Chief Executive Officer  Well, another great question. We do -- we continue to work on   our promotional tool kit. Really kind of test and learn approach   here. We did make the pivot here to a $10 card. That's the way   this offering started back when we initially introduced it. We   have optionality to think about it differently, but based on some   of the per cap impacts related to the unlimited video, we are   going to open the year with what we feel like is a very   compelling offer on the heels on unlimited wing offer combined   with a power card. And we're excited to start the year with it.   As you recall last year, we didn't have these wing promotion,   unlimited wing promotion running the first half of the football   season or so. So this year will be starting with that in combination with   this Wow Walls investment in a large nucleus of stores and we   think that's going to make for a powerful combination.  Jake Bartlett    --   SunTrust -- Analyst  Got it. I have actually had one other quick question. I   apologize for that, but it sounds like there's some variability   around development on the back half of 2020 into 2021. Your   comments about the store size though, should we expect beyond   just the success of 17K format stores, should we expect a greater   mix of smaller stores? Is that going to be a little more certain   than maybe how many you do in the year?  Brian A. Jenkins    --   Chief Executive Officer  Well, I'll take the first question or lap for other questions   first around store format size. We -- the 17K or the Corpus for   example is really, we are excited about what that store is able   to produce in terms of volumes margins and returns. So we have   discussed the fact that we are beginning to enter into smaller   DNA, smaller market sizes. So we have always been looking for a   flexible format and one that can deliver great returns. So we   like this format because as we think about some of these smaller   markets where we may have thought about putting a 30K box in and   you can look at our model, our target out there for our 30K,   putting in a 19K they can do $1 million, it's going to deliver   superior return. So we're excited about what that means as we get really more   into our 2021 class and beyond, not able to impact too much in   our 2020, we have been under it for quite some time. So we like   the format. We like what it shows and what it means for enhancing   our margins as we finish out our addressable market and continue   to march down that road. As it relates flexibility, we're heavily   focused on revitalizing these stores. We have about 130 plus   store chain right now. And we are highly focused on investing,   reinvesting in that starting with this Wow Walls. So we are trying to maintain some flexibility. And when I say   that I'm really talking about our late 2020 openings and into   2021 to give us flexibility in terms of the pace. As we look at   that revitalization effort and what that means in terms of   demands on the team.  Operator  [Operator Instructions] We'll take our next question from Jon   Tower with Wells Fargo.  Jon Tower    --   Wells Fargo -- Analyst  Awesome, thanks. And I appreciate all the color around the   near-term initiatives and particularly around the unit growth   side. But I was hoping to focus a little bit on the sales drivers   in the existing store base. Two things and they're kind of   related. First on the Wow Walls, can you discuss what you kind of   envision for these walls over time? I know it sounds like I'll be   trying to drive more traffic to the dining room area around   sporting events, but can it also be used for e-gaming events and   stores and other initiatives that you might be able to do. And then separately, but somewhat related a larger bar and   grill competitor that's focused on the sports viewing space   announced an initiative into sports betting during-- it was   actually on Friday. So I'm curious given the fact that you're pre   engaging with the Jackman team, are you considering that -- would   you even put that on the table as an option in the future if the   relationship or the consultancy with Jackman kind of point you in   that direction? Thank you.  Brian A. Jenkins    --   Chief Executive Officer  Thanks Jon. As it relates to first to WoW Walls and really the   sports betting question they kind of go in some ways a little   hand-in-hand. Our view is that our dining rooms based on the   square foot that we've allocated to spaces and the utilization   rate that we get today that it speaks to a need to revitalize the   area. So the WoW Walls is our answer to that. We are looking to   bring a whole new energy to the space. These are very, very large   screens. We have ability, capital allocation ability to scale   this. It's going to be combined with improving some of it, as I   mentioned some of the flooring and some of the furniture to   create a really a new experience. Bring energy to an area that   lacks that today. So we're excited about what that means and how we might as you   said leverage that and use that in other ways than just sports.   We have been working and testing a number of things around   eSports, did a few events in the month of May and June with   partner. So we think as we improve this offering it will bode   well for how we might be able to leverage that both in our   eSports leanings, as well as what it may mean in terms of our   position with partners and the sports betting arena. We're open   minded to that world. We are open minded at the partnerships,   we're aware of the wild announcement here. And we think that   could represent an attractive opportunity down the road. Right   now though we're focused on the five priorities I mentioned   today.  Operator  We will take our next question from Andrew Strelzik with BMO   Capital Markets.  Andrew Strelzik    --   BMO Capital Markets -- Analyst  Hey, good afternoon. My first question as you kind of reflect   on some of the missteps on the food side, some of the whether   it's promotional constructs or value that maybe haven't resonated   as much as you would have expected. What have you learn from   that? And how are you kind of changing your approach going   forward? And more broadly, what is your work, your kind of   consumer insights suggest drives the F&B decision for your   guest. I guess what I'm trying to get at is longer-term beyond   the Wow Walls kind of what structurally changes the performance   of the F&B business longer term?  Brian A. Jenkins    --   Chief Executive Officer  That's a great question. Right now I mentioned a statistic in   my prepared remarks that we are attaching our penetrating about   50% of our guests is buying a food and beverage item in our   store. So it does represent a great opportunity for us. We have a   lot of square-foot dedicated to this area. In my view, it could   be utilized better. We're committed to improving and the comps   here and that does mean to us continuing to create a fresh and   new menu. We've talked about our simplification efforts and so   we're going to continue to look at that further refine our   menu. We've introduced a number of LTOs to create a new experience   and our guests at scores have improved both from a food quality   perspective, as well as speed of service. The awareness challenge   still exists. So in our view one of our biggest near-term   opportunities right now is to drive guests in the door and drive   F&B penetration by having an area that is immersive and that   is why we are right now heavily focused on the wow, the physical   plant nature of our dining rooms by bringing in an experiential   element. We're really pleased with what we've seen in the Dallas   lift. This doesn't mean we're not going to continue to look at   our F&B offering over time. We certainly will, but we believe investing in the dining room   physical plant right now as we continue to work our menu is the   biggest near-term opportunity we have.  Operator  We'll take our next question from Stephen Anderson with Maxim   Group.  Stephen Anderson    --   Maxim Group -- Analyst  As you evaluate your recent results, it's certainly some of   the oppressed talking about the increased public consumers'   crossings a bit less confident. From a higher level, what do you   -- what's your read on the guest right now versus what your read   was maybe three or six months ago?  Scott J. Bowman    --   Senior Vice President & Chief Financial Officer  Breaking up, Steve, you was asking about the consumer, is that   the question?  Stephen Anderson    --   Maxim Group -- Analyst  Yes. Whether you sense that the consumer has maybe a little   bit less confidence in what you've seen maybe in the last three   to six months.  Brian A. Jenkins    --   Chief Executive Officer  Well, I think that consumer is overall still very healthy. I   know there's been some movement around with some of the tariffs,   the noise and some of that stuff, but we still feel like we have   a very healthy consumer, unemployment is still very low. And we   have a lot of confidence in our ability to reach more of them   through the things that we're doing and drive more frequency at   the same time.  Scott J. Bowman    --   Senior Vice President & Chief Financial Officer  So, yes, I'll just tackle under that. I think overall the   consumers in a pretty good shape from an economic standpoint. I   think some of these uncertainties can wait from time to time, but   I think the outlook is fairly good especially with the   unemployment picture and some wage growth. I think we're doing   pretty well. There are some headwinds on the expense side, but I   think the uncertainty and the environment will kind of ebb and   flow, but we feel like the economic health of the customer is   really good right now.  Stephen Anderson    --   Maxim Group -- Analyst  As well income.  Scott J. Bowman    --   Senior Vice President & Chief Financial Officer  Yes.  Operator  We'll take our next question from Joshua Long with Piper   Jaffray.  Joshua Long    --   Piper Jaffray -- Analyst  Right. Thanks. Wanted to follow up just as a clarification,   you mentioned couple times about I guess the optionality in your   real estate pipeline. And then I think later as a response to   someone's question you said that that doesn't in terms of say the   17,000 square foot stores. There's really not an opportunity to   layer more of those in earlier. That's really a kind of a 2020 or   2021 opportunity. Is that the right way to think about it,   Brian?  Brian A. Jenkins    --   Chief Executive Officer  We actually have a couple of units that were in our pipeline   in 2020 in the 19K format. So we have a couple in our -- in that   2020 class that were already planned. The pivoting that we see   potential for really is a 2021 there are a couple of those that   we are -- we evaluating right now in terms of what the proper   size is. And then obviously as we begin to underwrite into 2022,   this will be a key part of our decision-making as we again   optimize the size of the store to our market sales potential.   Because we just really like what we see in Corpus and its ability   to generate some really big numbers at various -- with a very   efficient box, much smaller back of the house. So it's kind of   where we stand on that.  Operator  We will take our next question from Brian Vaccaro with Raymond   James.  Brian Vaccaro    --   Raymond James & Associates Inc. -- Analyst  Thanks and good evening. I just wanted to circle back on the   recent comp trend. And I think you said July and August down   4.5%. And just trying to get a better understanding of what we   think might be driving that incremental weakness. Is there   anything as you look beneath the surface, anything to add   amusement versus F&B segment comps, days or week maybe   geographic or mall versus non mall that might help explain some   of the incremental softness?  Brian A. Jenkins    --   Chief Executive Officer  Well, Brian, July and August were -- both of them were down in   the mid 4% range. We -- that the comments that I made about   difficulties in Q2 which relates to VR rollover, continued into   August so that is definitely a part of it. And weather played a   part as well. We saw weakness up the Mid-Atlantic and Eastern   Seaboard and the competition continues to grow. I mentioned that   we are expecting right now 80 units this year on the names that   we're tracking. That's up from 60 or maybe I didn't mention this.   That's up from 60 last year, so lot of the headwind is continuing   to grow. I said we're optimistic about what we're doing in our pipeline   to work to offset that. And that's related to our efforts and   heavy focus on revitalizing our existing stores and working on   building better guest engagement, which is a big opportunity for   this brand right now.  Operator  And this does conclude the question-and-answer session. I   would like to turn the call back over to Brian Jenkins for any   additional or closing remarks.  Brian A. Jenkins    --   Chief Executive Officer  Well, thank you for your time this afternoon. We look forward   to reviewing our third quarter results with you in December.   Thank you.  Scott J. Bowman    --   Senior Vice President & Chief Financial Officer  Thank you.  Operator  [Operator Closing Remarks]  Duration: 60 minutes  Call participants:  Arvind Bhatia    --   Senior Director of Investor Relations   Brian A. Jenkins    --   Chief Executive Officer   Scott J. Bowman    --   Senior Vice President & Chief Financial Officer   Andy Barish    --   Jefferies -- Analyst   Sharon Zackfia    --   William Blair -- Analyst   Joshua Long    --   Piper Jaffray -- Analyst   Jeff Farmer    --   Gordon Haskett. -- Analyst   Jake Bartlett    --   SunTrust -- Analyst   Jon Tower    --   Wells Fargo -- Analyst   Andrew Strelzik    --   BMO Capital Markets -- Analyst   Stephen Anderson    --   Maxim Group -- Analyst   Brian Vaccaro    --   Raymond James & Associates Inc. -- Analyst   More PLAY analysis   All earnings call transcripts        10 stocks we like better than Dave & Buster's   Entertainment     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Dave & Buster's   Entertainment wasn't one of them! That's right --   they think these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     recommends Dave & Buster's Entertainment. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " Dave & Buster's Entertainment Inc    (NASDAQ: PLAY)        Q2 2019 Earnings Call       Sep 10, 2019 ,   5:00 p.m. ET ",
    " Operator ",
    "Good afternoon, everyone. Welcome to the Dave & Buster's   Entertainment, Incorporated Second Quarter 2019 Earnings Results   Call. Today's call is being hosted by Brian Jenkins, Chief   Executive Officer. [Operator Instructions]",
    "Now, I would like to turn the conference over to Arvind   Bhatia, Senior Director of Investor Relations, for opening   remarks.",
    " Arvind Bhatia    --   Senior Director of Investor Relations ",
    "Thank you, Lisa and thank you all for joining us. On the call   today are Brian Jenkins, Chief Executive Officer; and Scott   Bowman, Chief Financial Officer. After comments from Mr. Jenkins   and Mr. Bowman, we will be happy to take your questions. This   call is being recorded on behalf of Dave & Buster's   Entertainment Incorporated and is copyrighted.",
    "Before we begin our discussion of the Company's results, I   would like to call your attention to the fact that in our remarks   and our responses to your questions, certain items may be   discussed which are not based entirely on historical facts. Any   such item should be considered forward-looking statements and   relating to future events within the meaning of the Private   Securities Litigation Reform Act of 1995. All such   forward-looking statements are subject to risks and   uncertainties, which could cause actual results to differ from   those anticipated. Information on the various risk factors and   uncertainties has been published in our filings with the SEC,   which are available on our website at www.daveandbusters.com   under the Investor Relations section.",
    "In addition, our remarks today will include references to   EBITDA, adjusted EBITDA and store operating income before   depreciation and amortization, which are financial measures that   are not defined under generally accepted accounting principles.   Investors should review the reconciliation of these non-GAAP   measures to the comparable GAAP results contained in our earnings   announcement released this afternoon, which is also available on   our website.",
    "Now, I will turn the call over to Brian.",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "Thank you, Arvind. Good afternoon, everyone and thank you for   joining our call today to discuss second quarter results and   outlook for the business. For the quarter, we reported record   results increasing revenue by 8%, EPS by 7% and EBITDA by 5%. We   have built a high margin business that generates strong free cash   flow, which when combined with our strong balance sheet, has   enabled us to return more than $200 million in share repurchases   and dividends, and reduced our float by almost 13% as at the end   of the second quarter.",
    "While we continue to profitably grow our business and return   significant capital to shareholders, our comp sales results came   in below expectations as last year's VR launched proved difficult   to match and our promotions were not as effective as we had   anticipated. We also face headwinds from adverse weather and the   continued impact of competitive intrusion and cannibalization.   Later, Scott will provide more details on these factors and   additional highlights on the quarter in his prepared remarks. But   first let me share with you what we're seeing in the market and   our approach to managing the business to maximize value for   shareholders.",
    "There is no question that we are in an attractive and growing   category as consumers continue to increase spending on   experiences. As a leading brand that delivers immersive   experiences, we are in a great position to capitalize on this   favorable secular trend. At the same time, this trend and our   success have attracted many more players in the space, and the   overall market today is quite fragmented and competitive. Over   the past 18 months, we've made important progress on several   fronts, including enhancements to our food and beverage offerings   and the introduction of more immersive games, including our   industry-leading VR platform.",
    "As part of our focus on operational excellence, we've also   improved our service as reflected in our consistently higher   guest satisfaction scores. While we've accomplished a lot, we see   great opportunities for continued improvement and recognize we   have a lot more to do. As I have mentioned on previous calls, we   see immense opportunity to drive traffic by increasing guests'   frequency and improving F&B attachment once guests are in the   door. With an annual frequency of less than two times and F&B   attach rate of approximately 50%, driving deeper guest engagement   to improve these metrics is our biggest opportunity to reignite   same-store sales growth.",
    "In the near term, our goal is to execute on five priorities   that we have identified to maximize shareholder value. First, the   revitalization of our existing stores which in the near term   includes reenergizing the dining area and many of our stores to   drive food and beverage attachment. It also includes continued   food, beverage and amusement innovation to augment our offering,   all of which is a part of introducing new wow experiences.",
    "Second, we are focused on building deeper guest engagement,   which includes the nationwide launch of our new mobile app in   October. It also includes increasing investment in digital media   to more effectively reach our guests. Third, we are fueling   growth investments by surgically reducing costs in other areas.   Through the realization of operational efficiencies both in our   stores and corporate office, we expect to fund our growth   initiatives organically by redirecting resources into our   P&L.",
    "Third -- fourth, we are enhancing rigor on capital and   resource allocation to invest in the highest returning   opportunities for the overall D&B system. This includes   optimizing store formats to match market sales potential and   managing the pace of new store growth to maximize returns and   sufficiently focus our development team and store level managers   on advancing our store of revitalization efforts. And fifth,   returning significant capital to shareholders in the form of   share repurchases and dividends. I went through those pretty   quickly. So let me spend some time on each of these five   priorities, particularly the first. Our number one priority is   store revitalization to reignite comparable store sales   growth.",
    "Our focus on this initiative begins this quarter with our Wow   Walls to reenergize our dining rooms. For those of you who have   been to our Dallas store, you know you've been testing this idea   since late last year, a cutting-edge digital display technology   using a nearly 50-foot LED screen that can be customized by   location. We are very pleased with the list we have seen in   Dallas, particularly in F&B and plan to roll out the WoW   Walls technology in 35 additional stores by the end of October as   the football season gets under way.",
    "Over time, we also plan to extend LED technology to our sports   lounges to cement our position as one of the best and most   innovative sports doing destinations in the country to drive   reach, frequency and F&B penetration. The WoW Walls and   expanding the use of LED technology are only some of the   improvements we are making to our stores. In addition, we've   reengaged Jackman reevents to take a comprehensive look at our   store portfolio and offerings to assist with our brand   revitalization and a strategic refresh. As the foremost customer   experience reinvention company and an organization that we have   worked with to great effect in the past, we believe this highly   successful partnership will continue to be instrumental in   enhancing our integrated experience across all customer trust   points.",
    "We are committed to our store revitalization efforts and are   excited about the opportunities in front of us. In addition, as   we look to keep our games and attractions refreshed, we are   excited to launch Terminator VR which will be the Company's fifth   proprietary title in our VR library. The launch will coincide   with the release of the new Terminator movie in November. We're   excited to continue to leverage our leadership in the industry to   be the go-to place for cutting-edge entertainment. Making sure we   have a strong pipeline of games and other initiatives to wow our   guests and drive comparable store sales will continue to be a top   focus for our team.",
    "With all of the projects under way and as new strategies   emerge from our engagement with Jackson, we will maintain new   store development flexibility and optionality not only for our   store revitalization efforts, but also to execute new   initiatives. Our second near-term priority, which goes   hand-in-hand with the first, is building deeper guest engagement.   We have already discussed the large and untapped opportunity to   unlock guest frequency and F&B penetration. Our new mobile   app rolling out nationally later this quarter is an important   tool that will help us exploit this opportunity. The app allows   guests to use their phones to quickly purchase and recharge   digital power cards, tap and play games and earn valuable loyalty   points.",
    "It will also allow us to connect directly with guests and   deliver targeted, personalized offers whether they're in store or   out of store. The new app allows us to capture powerful   actionable guest data and in a way that is highly differentiated   in our industry. The app we've promoted on TV and through digital   media and our 12,000 guests facing employees will also play a key   role in increasing awareness and use of the app. We look forward   to updating you on our progress in the future.",
    "Now I'll turn to our third priority, which is to surgically   reduce costs and redeploy those realized savings to fuel   investments in organic growth opportunities. As you know, we   enjoy industry-leading margins, a result of significant margin   expansion over the past decade. In fact, since 2006, we have   nearly doubled our EBITDA margins. We have achieved these results   by delivering revenue growth, while maintaining disciplined cost   management. This proven discipline continues to service us well   today. Our preliminary estimate before one-time cost and   reinvestment is that we can achieve approximately $15 million in   annualized cost savings from near-term initiatives, including   off-peak later [Phonetic] optimization, further centralizing our   special events team, some G&A streamlining and modest changes   to recipes and gaming mix.",
    "We've made these changes thoughtfully in order not to impact   the quality of the guest experience. We intend to reinvest most   of our realized savings back into new initiatives to fuel organic   growth. And speaking of new growth investments, we are investing   in building a dedicated team to support the increasing digital   presence and capabilities we anticipate. We have added resources   to our technology group and have engaged third parties to collect   anonymized privacy protected data on our guests at a macro level,   data that will complement what we are learning directly via the   app.",
    "We are still hiring in this area with a few positions   currently open to round out our consumer and data insights team.   As we build a more robust database and gain valuable consumer   insights, over time we will have actionable intelligence to make   our digital media, promotions and offers more relevant, targeted   and customized for our guests. We are optimistic about the   potential to drive better guest engagement by the investments we   are making in our team, our technology and digital presence and   look forward to reporting on our progress.",
    "To provide a little more context here, I want to emphasize our   balanced strategy. We're not simply cutting cost to temporarily   boost margins. Instead, we are reallocating resources to the   highest return opportunities mainly in the areas of deeper guest   engagement, digital marketing and consumer intelligence   capabilities. We are improving our operational efficiencies while   maintaining and building on the Company's strong market position   and competitive differentiators.",
    "Turning to our fourth priority, I mentioned earlier, we have a   rigorous approach to deploying our capital to the highest return   opportunities. In addition to some of the exciting organic   initiatives I've described, opening new stores in attractive   location also remains an important part of our growth strategy.   Backdrop is that during the past 18 months, competitive store   openings have accelerated presented a major headwind to the   entire industry. I know there are differing views among investors   regarding our unit expansion strategy. So I want to take a moment   to clarify our process for investing in these stores,   particularly as compared to other capital allocation   priorities.",
    "We know our stores deliver a strong value proposition. It is   reflected in what we believe our best-in-class AUV margins and   store level returns. We only pursue new unit growth when the   incremental unit delivers the compelling return on capital, both   on a stand-alone basis and when considering its impact on our   entire system. Since 2011, the 29 new stores that have been open   for at least three years have averaged annualized returns of 45%   over their first three years. Looking at more recent cohorts such   as our 2016 class, this group has also averaged annualized   returns of 45% in its first two years. Realizing less than   three-year payback on a stand-alone business represents a   compelling opportunity for opening new stores.",
    "In addition to strong return on capital, there are ancillary   long-term benefits in opening multiple stores in a market. The   additional stores deliver strong returns, increased store   density, provide leverage on G&A and marketing and talent   retention that help us fortress the market for the long term.   While we're pleased with our success in the past, we're also   excited to introduce more productive and higher return prototypes   as we increasingly enter smaller markets. Take for example our   17K format Corpus Christi store, which open in late 2018 and is   on track to generate year one sales of over $8 million, in line   with the targeted volume for our 30K box. The store is expected   to achieve approximately 35% store level margins and 50% cash on   cash return in its first year.",
    "While we are not suggesting all 17K format stores will   generate this level of performance, Corpus Christi demonstrates a   potential, efficiency and returns of a smaller 17K format store.   With sub-attractive opportunities are available, it makes   compelling financial sense to pursue them. As we continue to   identify high-value opportunities in revitalizing existing   stores, we believe it's prudent to balance the demands that store   openings place on our corporate infrastructure, development team   and in-store talent. As a part of our ongoing review process, we   are carefully considering the pace of new unit growth. Consistent   with our top priority of revitalizing our existing stores, we are   preserving our optionality on new store openings in the back half   of 2020 and in 2021.",
    "While it's too soon to announce any changes at this time, we   are evaluating our options and will pursue the path that we   believe will create the most value to shareholders. In the   meantime, continuing to open high returning stores is the right   strategy from a competitive perspective, but also in terms of   maximizing the return on investment. Our investment philosophy   will continue to be balanced and opening new store will continue   to be just one aspect of our overall capital spending plan. As   I've mentioned in the near term, reenergizing our existing stores   to drive frequency and improving comps will be our top   priority.",
    "And finally, our fifth near-term priority to create long-term   shareholder value is returning capital to our shareholders.   Beyond investing in our business, we have been using our strong   free cash flows and balance sheet flexibility to   opportunistically buyback our stock and pay healthy dividend to   shareholders. Reflecting confidence in our long-term potential   and the current valuation of our shares, the Board recently   increased our share repurchase authorization another $200 million   to $800 million. And as you heard me say at the beginning of the   call, we have been quite active on the capital return front. We   believe that capital return will continue to be an important   contributor to our story going forward.",
    "To wrap up, we expect that generating improved comps and   operational efficiencies, achieving high RIs from new stores and   returning capital to shareholders are not mutually exclusive and   will all be important contributors to value creation at Dave   & Buster's. We have the talent, resources and a long track   record of success that shows we can effectively and   simultaneously execute on our plans. Importantly, I would like to   stress that we will continue to maintain a strong pipeline of   additional high return ideas that we actively evaluate to   supplement the initiatives already under way. We are conducting a   thorough review of all aspects of our business and operations as   a part of our annual strategic planning process.",
    "We will adjust our strategic plan and response to our business   reviews, competitive dynamics, market conditions and other   factors. We are a nimble, experience team, taking decisive action   in the face of recent performance and acting with appropriate   urgency to extend Dave & Buster's long track record of   delivering our performance and superior returns.",
    "With that, I'll turn it over to Scott to discuss the quarter's   highlights, our financial performance and updated 2019   guidance.",
    " Scott J. Bowman    --   Senior Vice President & Chief Financial Officer ",
    "Thank you, Brian and good afternoon everyone. I'll begin by   spending a few minutes discussing a highlight to the second   quarter, followed by our financial performance and then finish   with our full-year guidance. First, our key achievements in the   second quarter. In Amusements, we strengthened our VR library   with the launch of our fourth proprietary title Men in Black:   Galactic Getaway. In addition, during the summer, we launched   several exciting games including Centipede [Phonetic], 100   tickets, Ring Talk and Basketball Pro. These titles have all   tested well with their guests and initial read on the performance   has been positive.",
    "Within F&B, the summer we introduced a Hawaiian-themed   limited time offer we call iron vibe [Phonetic] that include   craveable entrees like smoky barbecue baked in Hawaiian ribs,   aloha ginger salmon and crispy Hawaiian chicken sliders. For   upcoming October menu, we will introduce new items, including a   grilled chicken avocado ranch sandwich and drunken New York strip   while removing a few slower moving items. We will continue to   enhance and innovate offerings in F&B as we know this will be   an important contributor to our go-forward success.",
    "In terms of our marketing campaigns, during Q2, we continue to   run our unlimited wings and unlimited video games promotion on   Thursdays as we did in Q1. In addition, we tested two promotions   highlighting food and game combos. Favorable combos which we ran   for four weeks followed by an unlimited play combo. Collectively,   these value-oriented campaigns did not resonate with our guests   as well as we had anticipated. Going forward, we will continue to   test new promotions to bring value to our guests and increasingly   leverage digital marketing to communicate our message.",
    "For Q3, we have also brought back a 99 unlimited range from   multiple game days during the football season. This promotion now   includes a $10 power card instead of unlimited gameplay, which we   believe will help improve per capita spend in Amusement. With   respect to new stores, we opened three new locations in the   quarter and have opened two additional stores since quarter end.   Year-to-date, we have opened 12 new stores, and we continue to   expect to open 15 to 16 new locations for the full year. These   store openings for the full year will skew toward large format   stores and new markets.",
    "Looking ahead, we still have a significant white space   opportunity. We have 132 locations currently and continue to   believe our long-term opportunity of 230 to 250 locations in the   US and Canada alone. We will continue to be prudent and   disciplined as we expand our footprint, ensuring we invest in the   highest return opportunities while returning excess capital in   the form o   f   dividends    and share repurchases.",
    "And now let me turn to our financial highlights. During the   second quarter, total revenues increased 8%, driven by strong   contribution from our 31 non-comparable stores, partially offset   by 1.8% decrease in our comparable stores. As Brian mentioned,   our comp sales results came in below expectations as last year's   VR launch proved difficult to match and our valued promotions   were not as effective as we had anticipated. In addition, weather   had an unfavorable impact of approximately 80 basis points on   comps, and competitive intrusion and cannibalization remains   headwinds during the quarter.",
    "Looking at overall sales by category, Amusement and Other grew   9.4% and F&B grew 5.9%. Amusement and Other represented 60%   of total revenues during the quarter, an increase of 80 basis   points in mix from the prior year period. Breaking down comp   sales, our walk-in sales were down 2%; our special events were up   slightly. In terms of category comp sales, Amusement and Other   was down 0.8% while F&B was down 3.2%. Within F&B, food   was down 3.8% and the bar business was down 1.6%. Total cost of   sales was $59.6 million in the quarter and improved 10 basis   points as a percent of sales. This was due to an improvement in   Amusement margin, higher mix in amusement resident revenue   partially offset by lower F&B margin. Food and beverage cost   as a percent of sales was 30 basis points unfavorable compared to   last year, primarily driven by the impact of our limited wings   promotion, higher avocado prices and costs related to our shift   to fresh juices within our bar offerings. This decline is   partially offset by the positive impact of 1.7% in food pricing   and 1.9% in beverage pricing. Cost of Amusement and Other as a   percent of sales was 40 basis points favorable compared to last   year. Amusement margins benefited from our pricing initiatives   and the continued shift toward virtual reality and other   simulation games, partially offset by higher costs associated   with the new RFID power card.",
    "Operating payroll and benefits expense was 23.5% of sales or   40 basis points higher year-over-year due to the unfavorable   impact of nearly 5% wage inflation, deleverage on comp store   sales and the impact of non-comp stores. This was partially   offset by the rollover of higher labor costs last year associated   with the VR launch. Other store operating expenses were up 60   basis points year-over-year, largely driven by occupancy   expenses, primarily at non-comp stores partially offset by   leverage on a marketing cost.",
    "G&A expenses of $16 million were up 8% from the prior   year, reflecting increases to support a growing store base and   higher technology and stock-based compensation expense. As a   percent of sales, G&A was flat. EBITDA increased 5.3% to $79   million and was 23.9% of sales reflecting a reduction of 60 basis   points versus the prior year. Adjusted EBITDA of $86 million was   up 4.4% and diluted EPS of $0.90 was at 7% versus the prior   year.",
    "Shifting to the balance sheet. We had approximately $568   million of outstanding debt at quarter-end resulting in leverage   of approximately 2 times EBITDA, up from 1.6 times at the end of   Q1 and 1.4 times at the end of last year. The increase was mainly   due to additional share repurchases during the quarter, and we   feel comfortable with our leverage ratio at these levels. As   Brian mentioned, we are driving value by returning excess capital   to shareholders and we have been quite active on that front.   During the second quarter, our Board increased the share   repurchase authorization by another $200 million to a total of   $800 million. We repurchased approximately 3.4 million shares in   the second quarter for $137 million and had approximately $270   million remaining under the existing authorization at the end of   the quarter. We also paid our fourth quarterly cash dividend of   $0.15 per share during the quarter.",
    "Turning now to guidance. Based on recent trends, we are   revising our fiscal year 2019 guidance as follows. Total revenues   are expected to be in the range of $1.338 billion to $1.359   billion versus prior guidance of $1.365 billion to $1.390 billion   reflecting growth of 6% to 7% versus the prior year. Based on   July and August comp trends which were down approximately 4.5%   and our outlook for the balance of the year, we expect full year   comp to be in the range of negative 3.5% to negative 2%. This   compares to previous guidance of negative 1.5% to positive   0.5%.",
    "We are projecting net income to be in the range of $91 million   to $100 million which is prior guidance of $103 million to $113   million. Values just based on our effective tax rate at 22% to   22.5% which is unchanged.",
    "Finally, EBITDA is expected to be in the range of $272 million   to $282 million. Excluding one-time charges, we expect EBITDA to   be in the range of $274 million to $284 million. This compares to   prior guidance of $283 million to $295 million. In terms of   quarterly phasing, Q3 includes an estimated $2 million in   one-time charges related to our cost-saving initiatives as well   as increased marketing to promote our Wow Walls and mobile app   initiatives. Also keep in mind that in Q3 last year, we   recognized $2.2 million in business interruption insurance   recoveries that had a favorable impact on EBITDA.",
    "Thank you for your interest in Dave & Buster's. Now I will   turn the call back over to Brian.",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "Thank you, Scott. Our decision to reset guidance was not taken   lightly. And was taken in context of what we've seen in the   marketplace since our last       earnings call    and the recent comp trends Scott mentioned. We have many reasons   to be encouraged for the back half of the year. But at the same   time, we are cognizant of recent volatility and potential risk.   As such, the midpoint of our revised guidance assumes no   near-term improvement from current trends, and the upper end of   our guidance assumes modest impact of initiatives starting in   Q4.",
    "I'd like to close by thanking our team for their dedication   and hard work as we focus on our five near-term priorities,   namely revitalizing the existing stores, building deeper guest   engagement, managing cost to fuel organic growth, investing in   high return opportunities and returning capital to shareholders.   As always, we appreciate our shareholders for your continued   support and interest in Dave & Buster's.",
    "Now we'd be happy to answer your questions during Q&A.   Lisa, please open the lines.",
    " Operator ",
    "Thank you. [Operator Instructions] We'll take our first   question from Andy Barish with Jefferies.",
    " Andy Barish    --   Jefferies -- Analyst ",
    "Hey, guys. I'm just wondering if you could give us a little   bit more color on sort of the non-impacted stores and maybe an   update on the percentage of the system you think is impacted. The   question is; are you seeing deterioration kind of in the core   that hadn't been impacted by competition which is leading to some   of the other changes that you discuss today.",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "Well, I'll answer that the first question about impacted   stores. The base of stores impacted by either competition or   cannibalization did grow in the quarter, Andy, from 40% in Q1 to   45% of our store-based comp base in Q2. So we did see an   acceleration of impact at stores. But that's not the only factor   here in the second quarter. We mentioned on the call the rollover   of VR was a significant factor for us, but lapping of that   platform launch last year with Jurassic World, we underestimated   the impact on traffic in our view and weather was not   particularly great for us in the quarter.",
    "We estimated about 80 bps of pressure in the quarter. And we   mentioned that a little bit actually on the Q1 call as we started   off in May. We had some difficult weather around Memorial Day   weekend and then we had some weeks in July. So there are a number   of factors, but definitely competitive landscape is something   that continues to accelerate in our view.",
    " Operator ",
    "Thank you. Our next question comes from Sharon Zackfia with   William Blair.",
    " Sharon Zackfia    --   William Blair -- Analyst ",
    "Hi, good afternoon. I guess I'd be interested in hearing more   about the Wow Walls and if you could quantify any kind of lifts   you saw there in Dallas, whether it related to traffic or food   and beverage attached. And maybe a compare contrast that   initiative versus prior remodeling initiatives you did around   D&B sports and so on.",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "Well, we're very excited about the WoW Walls. We as you know   began that test in late 2018 in our Dallas store. A 50-foot LED   screen really reenergizes, brings a whole new energy to that   space. It's a very contemporary look. It's latest and greatest   technology LED panels, high resolution. So we're combining that   Wow Walls kind of technology with some improvements in furniture,   flooring and other elements to really revitalize the dining   experience. In our view is that is one of the great pass toward   further F&B penetration. Drive people into that space that is   today highly underutilized. Our dining rooms today, it brings a   whole new experience and we have seen outside performance. And I   really want to get into the specifics of Dallas here.",
    "But it is one of our top performing stores right in the top   couple of stores in terms of performance in our system and   F&B in particular is performing very well. So we like the   look and we like what it does to the energy of our brand. And we   like what we see with this investment.",
    " Sharon Zackfia    --   William Blair -- Analyst ",
    "Can I just ask a follow-up? I mean is it fair to think that   those comps are positive in Dallas and then when you complete a   Wow Walls, I mean is there a big initial list or is it something   to build?",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "Well, they are definitely positive. It's one of our top two   the three performing stores in the system. So it is a highly   positive store in our system. And we did this, we made this   improvement in I think was December of 2018. Initially, we really   didn't advertise that, it gets build over time, building   awareness. So it did take a little time to be noticed for what we   had invested there, but it's impressive and the difference here   is we are going to invest in our third quarter in digital media   to drive awareness of this offering. So we will be investing to   build that awareness.",
    "But I do think it does take time. As I mentioned, our   frequency is fairly low as a brand, less than 2 times. So I think   it does build over time, but we feel very confident and what this   is going to do and add to the brand experience.",
    " Sharon Zackfia    --   William Blair -- Analyst ",
    "Thank you.",
    " Operator ",
    "Our next question comes from Joshua Long with Piper   Jaffray.",
    " Joshua Long    --   Piper Jaffray -- Analyst ",
    "Great, thanks for taking my question. Wanted to circle back to   the VR, you said you mentioned a couple times the difficulty in   lapping last year's rollout. So I am curious how you're thinking   about VR? And if it's a function of awareness or if it's content   or what you are learning about how the consumer is engaging with   that VR platform? And then also wanted to see if you might be   able to provide an update in terms of pricing. I know we had   talked about some optionality in terms of higher pricing into our   bundling offers with the VR. And in any sort of latest updates in   terms of what you learned there.",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "Thanks for the question. Well, clearly, we learned a few   things as we lap that introduction of a platform in any way. We   introduced the roller coaster last year with both platform and a   very popular title in Jurassic World. And that proved to be   difficult to match enroll over. The trial that per capita lift   that we saw and with that launch was impressive and the rollover   was difficult. We'll begin to move away from some of that outside   performance as we get further away from the summer. But we still   have great aspirations for that platform. It is a platform that   allows us to introduce new content, proprietary content and   movies so to speak, new experiences and we're excited about the   launch of Terminator with an IP that we secured.",
    "It's going to launch in and around the time of the launch of   the movie in November. We really like what this game is going to   deliver. And as you asked the notion of bundling is something   that we expect to pivot into as we head into this launch of   Terminator. We have built at this point five really great   experiences and our media campaign as we launched Terminator is   going to not only launch and feature Terminator, but we are going   to tie in the breadth of experiences that we've built in this   library.",
    " Operator ",
    "We'll take our next question from Jeff Farmer with Gordon   Haskett.",
    " Jeff Farmer    --   Gordon Haskett. -- Analyst ",
    "Great, thank you. I appreciate the comments on lapping the VR   launch, but can you provide a little bit more color on that the   day part, week part trends? Any type of customer demographic   factors that might also be weighing on sales for you guys.",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "It's similar, Jeff, to what we have seen over the last more   than four quarters. Our strongest state partners earlier in the   launch day part over the course of the quarter. And we continue   to have our toughest day part late night.",
    " Jeff Farmer    --   Gordon Haskett. -- Analyst ",
    "Okay, and then in terms of the incremental costs associated   with the mobile app introduction. I'm just curious how much of   those costs are already flowing through the income statement or   if there are more to come?",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "Well, they are flowing through our capital guide as well as   some incremental expense associated with our technology team. So   they are reflected our efforts as it relates to 20 and teen are   reflected. So you have anything, Scott.",
    " Scott J. Bowman    --   Senior Vice President & Chief Financial Officer ",
    "Yes. One thing I'll add to that, yes, most of that is flowing   through I think what you'll see as I mentioned in Q3 that they   are from a marketing standpoint we will kind of over index on   marketing in Q3 to promote the rollout of the mobile app, as well   as continued rollout of this Wow Walls.",
    " Jeff Farmer    --   Gordon Haskett. -- Analyst ",
    "All right. Just one final follow-up here. I think the   amusement same-store sales number came up, but did you guys share   the level of menu pricing and pricing that was captured within   that amusements same store sales number?",
    " Scott J. Bowman    --   Senior Vice President & Chief Financial Officer ",
    "Yes. So amusement pricing was up about 3% for the   quarters.",
    " Jeff Farmer    --   Gordon Haskett. -- Analyst ",
    "All right. Thank you.",
    " Operator ",
    "Our next question comes from Jake Bartlett with SunTrust.",
    " Jake Bartlett    --   SunTrust -- Analyst ",
    "Great. Thanks for taking the question. My first question was   about on the engagement with -- maybe I have written this down   wrong, but Jackman Entertainment or Jackman. And I think you   referred to it as a strategic refresh. So I'm just -- I'm trying   to understand what that might mean for just your mix of games or   just maybe a little detail on what that's going to entail?",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "Well, we're very excited about working with the Jackman team   again. We are really taking a comprehensive look at our   portfolio. Our offering as we think about our brand and   revitalizing the brand, we had a very, very successful   partnership with Jackman and his team dating back two years of   really 2010 and 2014. And they were very instrumental in the   success that we had in revitalizing the brand and some of the   outperformance that you -- that we had in the years of 2014 and   beyond. So we're really excited about working with them again.   They're a very bright team. They're in my view better today than   they were a decade ago. And we're really optimistic about some of   the initiatives that are going to come out of that work.",
    "This is not a thing that happens overnight. We work with this   group for three to four years on and but it did result in new   offerings, new approaches to our business. And that's what this   process is about. And we are early on here, but really excited   about this project.",
    " Jake Bartlett    --   SunTrust -- Analyst ",
    "Got it. And then you mentioned with the Terminator VR release   in November, I'm interested to hear what else is on the docket,   especially the kind of important holiday season. And whether we   should expect kind of similar cadence from last year with   Dragonfrost being launched before the holidays. And I also just   want to give larger question about content. And I'm wondering   whether because you potentially more exclusive focus on VR for   last year and half since Halo, is that an attachment of some of   the gains that you are -- your core consumer appreciates?",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "That's a great question, Jake. We are focused on delivering a   balance of titles. Clearly, with the launch of the platform on   the VR platform does offer us a great opportunity to introduce   proprietary titles. And we have leaned in on that obviously over   since we introduced the platform mid of last year. So we're still   looking at the cadence of how many. We obviously did three this   year, but we're evaluating that cadence. But it is not at the   detriment of introducing other highly popular titles. We   introduced I think Scott in his remarks mentioned some of the   titles that we introduced over the course of this summer that are   very popular interests that resonate well with guests that bring   new experiences.",
    "So we're not solely focused on the arts a piece of the   introduction of games, but it does one that is able to command a   pretty good spot on our TV campaign and in our media message. So   but it's not -- we are abandoning all games here. We are working   to deliver multiple game.",
    " Jake Bartlett    --   SunTrust -- Analyst ",
    "Got it. And then last question. The unlimited wings and then   now the $10 Power Card. It still different than last year with   the unlimited gameplay. Do you see much risk around that? Or was   that something we -- something you've done both before, but I   just want to gauge any level of risk around kind of making that   switch.",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "Well, another great question. We do -- we continue to work on   our promotional tool kit. Really kind of test and learn approach   here. We did make the pivot here to a $10 card. That's the way   this offering started back when we initially introduced it. We   have optionality to think about it differently, but based on some   of the per cap impacts related to the unlimited video, we are   going to open the year with what we feel like is a very   compelling offer on the heels on unlimited wing offer combined   with a power card. And we're excited to start the year with it.   As you recall last year, we didn't have these wing promotion,   unlimited wing promotion running the first half of the football   season or so.",
    "So this year will be starting with that in combination with   this Wow Walls investment in a large nucleus of stores and we   think that's going to make for a powerful combination.",
    " Jake Bartlett    --   SunTrust -- Analyst ",
    "Got it. I have actually had one other quick question. I   apologize for that, but it sounds like there's some variability   around development on the back half of 2020 into 2021. Your   comments about the store size though, should we expect beyond   just the success of 17K format stores, should we expect a greater   mix of smaller stores? Is that going to be a little more certain   than maybe how many you do in the year?",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "Well, I'll take the first question or lap for other questions   first around store format size. We -- the 17K or the Corpus for   example is really, we are excited about what that store is able   to produce in terms of volumes margins and returns. So we have   discussed the fact that we are beginning to enter into smaller   DNA, smaller market sizes. So we have always been looking for a   flexible format and one that can deliver great returns. So we   like this format because as we think about some of these smaller   markets where we may have thought about putting a 30K box in and   you can look at our model, our target out there for our 30K,   putting in a 19K they can do $1 million, it's going to deliver   superior return.",
    "So we're excited about what that means as we get really more   into our 2021 class and beyond, not able to impact too much in   our 2020, we have been under it for quite some time. So we like   the format. We like what it shows and what it means for enhancing   our margins as we finish out our addressable market and continue   to march down that road. As it relates flexibility, we're heavily   focused on revitalizing these stores. We have about 130 plus   store chain right now. And we are highly focused on investing,   reinvesting in that starting with this Wow Walls.",
    "So we are trying to maintain some flexibility. And when I say   that I'm really talking about our late 2020 openings and into   2021 to give us flexibility in terms of the pace. As we look at   that revitalization effort and what that means in terms of   demands on the team.",
    " Operator ",
    "[Operator Instructions] We'll take our next question from Jon   Tower with Wells Fargo.",
    " Jon Tower    --   Wells Fargo -- Analyst ",
    "Awesome, thanks. And I appreciate all the color around the   near-term initiatives and particularly around the unit growth   side. But I was hoping to focus a little bit on the sales drivers   in the existing store base. Two things and they're kind of   related. First on the Wow Walls, can you discuss what you kind of   envision for these walls over time? I know it sounds like I'll be   trying to drive more traffic to the dining room area around   sporting events, but can it also be used for e-gaming events and   stores and other initiatives that you might be able to do.",
    "And then separately, but somewhat related a larger bar and   grill competitor that's focused on the sports viewing space   announced an initiative into sports betting during-- it was   actually on Friday. So I'm curious given the fact that you're pre   engaging with the Jackman team, are you considering that -- would   you even put that on the table as an option in the future if the   relationship or the consultancy with Jackman kind of point you in   that direction? Thank you.",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "Thanks Jon. As it relates to first to WoW Walls and really the   sports betting question they kind of go in some ways a little   hand-in-hand. Our view is that our dining rooms based on the   square foot that we've allocated to spaces and the utilization   rate that we get today that it speaks to a need to revitalize the   area. So the WoW Walls is our answer to that. We are looking to   bring a whole new energy to the space. These are very, very large   screens. We have ability, capital allocation ability to scale   this. It's going to be combined with improving some of it, as I   mentioned some of the flooring and some of the furniture to   create a really a new experience. Bring energy to an area that   lacks that today.",
    "So we're excited about what that means and how we might as you   said leverage that and use that in other ways than just sports.   We have been working and testing a number of things around   eSports, did a few events in the month of May and June with   partner. So we think as we improve this offering it will bode   well for how we might be able to leverage that both in our   eSports leanings, as well as what it may mean in terms of our   position with partners and the sports betting arena. We're open   minded to that world. We are open minded at the partnerships,   we're aware of the wild announcement here. And we think that   could represent an attractive opportunity down the road. Right   now though we're focused on the five priorities I mentioned   today.",
    " Operator ",
    "We will take our next question from Andrew Strelzik with BMO   Capital Markets.",
    " Andrew Strelzik    --   BMO Capital Markets -- Analyst ",
    "Hey, good afternoon. My first question as you kind of reflect   on some of the missteps on the food side, some of the whether   it's promotional constructs or value that maybe haven't resonated   as much as you would have expected. What have you learn from   that? And how are you kind of changing your approach going   forward? And more broadly, what is your work, your kind of   consumer insights suggest drives the F&B decision for your   guest. I guess what I'm trying to get at is longer-term beyond   the Wow Walls kind of what structurally changes the performance   of the F&B business longer term?",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "That's a great question. Right now I mentioned a statistic in   my prepared remarks that we are attaching our penetrating about   50% of our guests is buying a food and beverage item in our   store. So it does represent a great opportunity for us. We have a   lot of square-foot dedicated to this area. In my view, it could   be utilized better. We're committed to improving and the comps   here and that does mean to us continuing to create a fresh and   new menu. We've talked about our simplification efforts and so   we're going to continue to look at that further refine our   menu.",
    "We've introduced a number of LTOs to create a new experience   and our guests at scores have improved both from a food quality   perspective, as well as speed of service. The awareness challenge   still exists. So in our view one of our biggest near-term   opportunities right now is to drive guests in the door and drive   F&B penetration by having an area that is immersive and that   is why we are right now heavily focused on the wow, the physical   plant nature of our dining rooms by bringing in an experiential   element. We're really pleased with what we've seen in the Dallas   lift. This doesn't mean we're not going to continue to look at   our F&B offering over time.",
    "We certainly will, but we believe investing in the dining room   physical plant right now as we continue to work our menu is the   biggest near-term opportunity we have.",
    " Operator ",
    "We'll take our next question from Stephen Anderson with Maxim   Group.",
    " Stephen Anderson    --   Maxim Group -- Analyst ",
    "As you evaluate your recent results, it's certainly some of   the oppressed talking about the increased public consumers'   crossings a bit less confident. From a higher level, what do you   -- what's your read on the guest right now versus what your read   was maybe three or six months ago?",
    " Scott J. Bowman    --   Senior Vice President & Chief Financial Officer ",
    "Breaking up, Steve, you was asking about the consumer, is that   the question?",
    " Stephen Anderson    --   Maxim Group -- Analyst ",
    "Yes. Whether you sense that the consumer has maybe a little   bit less confidence in what you've seen maybe in the last three   to six months.",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "Well, I think that consumer is overall still very healthy. I   know there's been some movement around with some of the tariffs,   the noise and some of that stuff, but we still feel like we have   a very healthy consumer, unemployment is still very low. And we   have a lot of confidence in our ability to reach more of them   through the things that we're doing and drive more frequency at   the same time.",
    " Scott J. Bowman    --   Senior Vice President & Chief Financial Officer ",
    "So, yes, I'll just tackle under that. I think overall the   consumers in a pretty good shape from an economic standpoint. I   think some of these uncertainties can wait from time to time, but   I think the outlook is fairly good especially with the   unemployment picture and some wage growth. I think we're doing   pretty well. There are some headwinds on the expense side, but I   think the uncertainty and the environment will kind of ebb and   flow, but we feel like the economic health of the customer is   really good right now.",
    " Stephen Anderson    --   Maxim Group -- Analyst ",
    "As well income.",
    " Scott J. Bowman    --   Senior Vice President & Chief Financial Officer ",
    "Yes.",
    " Operator ",
    "We'll take our next question from Joshua Long with Piper   Jaffray.",
    " Joshua Long    --   Piper Jaffray -- Analyst ",
    "Right. Thanks. Wanted to follow up just as a clarification,   you mentioned couple times about I guess the optionality in your   real estate pipeline. And then I think later as a response to   someone's question you said that that doesn't in terms of say the   17,000 square foot stores. There's really not an opportunity to   layer more of those in earlier. That's really a kind of a 2020 or   2021 opportunity. Is that the right way to think about it,   Brian?",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "We actually have a couple of units that were in our pipeline   in 2020 in the 19K format. So we have a couple in our -- in that   2020 class that were already planned. The pivoting that we see   potential for really is a 2021 there are a couple of those that   we are -- we evaluating right now in terms of what the proper   size is. And then obviously as we begin to underwrite into 2022,   this will be a key part of our decision-making as we again   optimize the size of the store to our market sales potential.   Because we just really like what we see in Corpus and its ability   to generate some really big numbers at various -- with a very   efficient box, much smaller back of the house. So it's kind of   where we stand on that.",
    " Operator ",
    "We will take our next question from Brian Vaccaro with Raymond   James.",
    " Brian Vaccaro    --   Raymond James & Associates Inc. -- Analyst ",
    "Thanks and good evening. I just wanted to circle back on the   recent comp trend. And I think you said July and August down   4.5%. And just trying to get a better understanding of what we   think might be driving that incremental weakness. Is there   anything as you look beneath the surface, anything to add   amusement versus F&B segment comps, days or week maybe   geographic or mall versus non mall that might help explain some   of the incremental softness?",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "Well, Brian, July and August were -- both of them were down in   the mid 4% range. We -- that the comments that I made about   difficulties in Q2 which relates to VR rollover, continued into   August so that is definitely a part of it. And weather played a   part as well. We saw weakness up the Mid-Atlantic and Eastern   Seaboard and the competition continues to grow. I mentioned that   we are expecting right now 80 units this year on the names that   we're tracking. That's up from 60 or maybe I didn't mention this.   That's up from 60 last year, so lot of the headwind is continuing   to grow.",
    "I said we're optimistic about what we're doing in our pipeline   to work to offset that. And that's related to our efforts and   heavy focus on revitalizing our existing stores and working on   building better guest engagement, which is a big opportunity for   this brand right now.",
    " Operator ",
    "And this does conclude the question-and-answer session. I   would like to turn the call back over to Brian Jenkins for any   additional or closing remarks.",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    "Well, thank you for your time this afternoon. We look forward   to reviewing our third quarter results with you in December.   Thank you.",
    " Scott J. Bowman    --   Senior Vice President & Chief Financial Officer ",
    "Thank you.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 60 minutes ",
    " Arvind Bhatia    --   Senior Director of Investor Relations ",
    " Brian A. Jenkins    --   Chief Executive Officer ",
    " Scott J. Bowman    --   Senior Vice President & Chief Financial Officer ",
    " Andy Barish    --   Jefferies -- Analyst ",
    " Sharon Zackfia    --   William Blair -- Analyst ",
    " Joshua Long    --   Piper Jaffray -- Analyst ",
    " Jeff Farmer    --   Gordon Haskett. -- Analyst ",
    " Jake Bartlett    --   SunTrust -- Analyst ",
    " Jon Tower    --   Wells Fargo -- Analyst ",
    " Andrew Strelzik    --   BMO Capital Markets -- Analyst ",
    " Stephen Anderson    --   Maxim Group -- Analyst ",
    " Brian Vaccaro    --   Raymond James & Associates Inc. -- Analyst ",
    " More PLAY analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than Dave & Buster's   Entertainment     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Dave & Buster's   Entertainment wasn't one of them! That's right --   they think these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     recommends Dave & Buster's Entertainment. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:23:31"
}