{
  "url": "https://www.nasdaq.com/article/trade-talk-plans-cheer-risk-currencies-hit-safehaven-yen-20190904-01251",
  "title": "Trade talk plans cheer risk currencies, hit safe-haven yen - Nasdaq.com",
  "text": [
    "By Tom Westbrook",
    "SINGAPORE, Sept 5 (Reuters) - Risk-sensitive currencies such as the Aussie and yuan rallied on Thursday as investors cheered the announcement of U.S.-China trade talks for next month and abandoned safe haven assets such as yen.",
    "The Australian and New Zealand dollars,  Chinese yuan  and South Korean won  all jumped against the dollar, while the yen  fell nearly 0.4% to 106.75 per dollar, its cheapest in more than three weeks.",
    "The news followed optimism that a no-deal Brexit could be avoided, which sent the pound  sharply higher, and a potential breakthrough for the Hong Kong political crisis.",
    "Those political developments, seen as positive for investment, also fueled a jump in Asian equities and bond yields. ",
    "\"We've seen markets hold up relatively well overnight, this (trade) news has injected a fair amount of optimism in markets,\" said Prashant Newnaha, senior rates strategist at TD Securities in Singapore.",
    "\"It does seem that the markets were positioning more bearishly, and now we've gotten this potential good news and the markets are running with it,\" he said, adding global economic indicators had also recently been showing some green shoots.",
    "The Australian dollar rose to a one-month high of $0.6825, seen as a technical resistance level while the New Zealand dollar hit a one-week peak of $0.6377. The trade-exposed won climbed the most of Asia's currencies to 1198.00 per dollar.",
    "Against a basket of currencies, the dollar  lifted a little from a one-week low to 98.492.",
    "The Canadian dollar  spiked sharply to C$1.3344 per dollar after the Bank of Canada left interest rates on hold and sounded less dovish than the market had expected.",
    "The pound sat around $1.2245 and euro  at $1.1030, holding overnight gains.",
    "They had climbed after British parliament voted on Wednesday to prevent Johnson from taking Britain out of the European Union without a deal on Oct. 31, but rejected his first bid to call a snap election two weeks before the scheduled exit. ",
    "That still leaves Brexit up in the air, with possible outcomes ranging from a no-deal exit to abandoning the whole endeavour, prompting some to sound a note of caution.",
    "\"It's important to keep in mind that the situation continues to look pretty bad,\" J.P. Morgan analysts reminded investors in a market note, pointing out that Johnson, a staunch Brexiteer, leads opinion polls.",
    "Nevertheless, the fact that a hard Brexit has, for now, been removed as an immediate risk gave markets some cheer, as did Hong Kong leader Carrie Lam's move to withdraw the bill that triggered months of violent protests in the city.",
    "\"While there is no 'all clear' on market concerns, investor sentiment pulled back from extremes...the deferral of a no-deal Brexit, soothed nerves,\" said Michael McCarthy, chief market strategist at brokerage CMC Markets in Sydney."
  ],
  "published_datetime": "2019-09-04 11:21:00"
}