{
  "url": "https://www.nasdaq.com/article/mongodb-inc-mdb-q2-2020-earnings-call-transcript-cm1207656",
  "title": "MongoDB, Inc. (MDB) Q2 2020 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   MongoDB, Inc.    (NASDAQ: MDB)        Q2 2020 Earnings Call       Sep 4, 2019 ,   5:00 p.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Good day, ladies and gentlemen, and welcome to today's MongoDB   Second Quarter Fiscal 2020 Earnings Call. I'd like to remind   everyone that this conference is being recorded. And at this time, I'll turn the floor over to Brian Denyeau,   ICR Investor Relations.  Brian Denyeau    --   ICR, Investor Relations  Thank you, Greg. Good afternoon and thank you for joining us   today to review MongoDB's second quarter fiscal 2020 financial   results, which we announced in our press release issued after the   close of market today. Joining me on the call today are Dev Ittycheria, President and   CEO of MongoDB; and Michael Gordon, MongoDB's COO and CFO. During this call, we may make statements related to our   business that are forward-looking under Federal Securities Laws.   These statements are made pursuant to the safe harbor provisions   of the Private Securities Litigation Reform Act of 1995,   including statements related to our financial guidance for the   third quarter and full year fiscal 2020, our market opportunity,   the opportunity created by and scalability of our go-to-market   and growth strategies. The potential advantages of our new   products, product enhancements and planned integrations,   including as a result of our recent acquisition of Realm. Timing   of the transition of mLab customers to Atlas and anticipated   revenue deterioration from mLab customers, the anticipated impact   of Atlas sales expansion on our gross margin, anticipated   investments in the business and their impact on future cash   flows. The words anticipate, continue, estimate, expect, intend, will   and similar expressions are intended to identify forward-looking   statements or similar indications of future expectations. These   statements reflect our views only as of today and should not be   considered as representing our views as of any subsequent date.   We do not have plans to update these statements, except as   required by law. These statements are subject to a variety of   risks and uncertainties that could cause actual results to differ   materially from expectations. For a discussion of the material risks and other important   factors that could affect our actual results, please refer to   those contained in our quarterly report on Form 10-Q with the SEC   on June 7th, 2019 and our other periodic filings with the SEC.   These documents are available in the Investor Relations section   of our website at www.mongodb.com. A replay of this call will   also be available there for a limited time. Additionally, non-GAAP financial measures will be discussed in   this conference call. Please refer to the tables in our earnings   release on the Investor Relations portion of our website for a   reconciliation of these measures to the most directly comparable   GAAP financial measure. And with that, I'd like to turn the call over to Dev.  Dev Ittycheria    --   President and Chief Executive Officer  Thanks, Brian. Thanks to everyone for joining us to review our   second quarter results. MongoDB continued to perform at a very   high level, driven by broad based strength in all geographies and   industries. Our results continue to demonstrate that MongoDB has   clearly established itself as the most popular modern database   platform of choice in the world. Our success is being driven by   our strong product market fit and the sophistication of our   go-to-market strategy. We're confident that we'll be able to   continue to capitalize on our long-term opportunity in the 64   billion global database software market. Looking quickly at our second quarter financial results. We   generated revenue of $99.4 million, a 67% year-over-year increase   and above the high end of our guidance. We grew subscription   revenue 71% year-over-year. Atlas revenue grew more than 240%   year-over-year and now represents 30% of revenue, and we had   another strong quarter of customer growth ending the quarter with   over 15,000 customers. Our strong results begin with our   best-in-class product offering. We made several significant   product announcements that represent notable progress on our   long-term product vision to make data stunningly easy to work   with. In June, we held our annual user conference MongoDB World in   New York and attendance set another record. During the   conference, we unveiled a number of exciting products and   features, including the MongoDB version 4.2 with key features   such as distributed asset transactions and client-side field   level encryption. We believe this latest release further cements   our positioning as the modern general purpose database of choice   and underscores our capability to support the most mission   critical applications. MongoDB Atlas Data Lake allows customers   to quickly query data on S3 in any format using the MongoDB Query   Language. We believe that other solutions in the analytics   markets have been plagued by high upfront investments, complex   implementations and a need for specialized skills. By contrast   with Atlas Data Lake, our customers can leverage their existing   MongoDB expertise and incur no upfront costs to quickly derive   value from their data. MongoDB Full-Text Search gives end users   the flexibility to filter, rank and sort their data to quickly   service the most relevant search results. Importantly, they can   implement this functionality without incurring the effort and   cost of pairing their database with an external search engine.   Developers can leverage the functionality to build sophisticated   search queries within applications, saving them significant   amount of time, effort and money. Finally, we announced our plan to integrate our newly acquired   mobile database Realm with our serverless platform Stitch.   Realm's Synchronization Protocol will connect with MongoDB's   Atlas Global Cloud Database on the back-end, making Realm Sync a   powerful way for developers to connect data to device -- to the   devices running their applications. As part of MongoDB, Realm is   positioned to become the default database for mobile developers   and the easiest way to build real time mobile applications. These   product announcements are formed by a long-term vision and ground   by feedback from our customers on the strategic value they can   achieve by leveraging MongoDB for a broader set of use cases   across their organization. Our second quarter results also demonstrates our investments   in expanding and extending our go-to-market capabilities that are   paying off. Given the size of the market in front of us, we have   built an increasingly sophisticated three-pronged go-to-market   strategy that allows us to pursue the entire database market. The   first component is our field sales organization, which drove   strong broad-based performance in all our major regions in the   second quarter. Our success with field sales is driven by our   ability to recruit and develop outstanding sales personnel and   strategically engage our customers from developers up to CXOs.   Second, our inside sales channel focuses on the mid-market, where   deals are smaller with shorter sales cycles. These customers, who   prefer a low touch sales model with a high degree of automation,   have less interest in managing their own infrastructure and   therefore see compelling value in Atlas. The third component of   our go-to-market strategy is our self-serve channel which has   grown significantly as a percentage of revenue over the past   year. Starting last year, we significantly increased our   investment in this channel to build a world class developer   focused product led growth marketing organization. This is a   multi-year journey, but we are encouraged by the progress we are   making. We also see increasingly a synergy across these go-to-market   motions. For example, we have observed developers and large   enterprises frequently start evaluating and using Atlas via our   self-serve channel, which can lead to large opportunities for our   direct sales force. We've also seen fast growing self service   customers who can grow even faster when they interact with our   customer facing teams. Moreover, we have observed highly   sophisticated mid-market customers, some of whom have built their   entire business on MongoDB, who need a level of engagement   typical of large enterprises. One of the key competitive   differentiators is the freedom to run anywhere and our cloud   partnerships enable customers that choose MongoDB Atlas to take   advantage of the benefits of each major cloud provider as they   see it fit. We're off to a strong start with our partnership with   GCP. We expanded our relation with Microsoft by launching the   availability of Atlas on Microsoft Azure Marketplace, which will   simplify billing for joint customers. Furthermore, we have joined   Microsoft Strategic Partner reported ACR co-sell program and this   was yet another record quarter for Atlas on AWS. I like to spend a few minutes reviewing some customer   vignettes. We're increasingly seeing a wide array of customers   choosing MongoDB to run mission critical applications. The   following is a small selection of customer wins and interesting   use cases from the second quarter. MongoDB is a valued partner to   Venmo. Venmo has experienced tremendous growth over the past few   years and has decided to partner with MongoDB because of our   ability to provide the scale they needed for their growing   platform. Venmo is leveraging MongoDB's enterprise advanced   offering to streamline operations and to drive automation.   Halliburton Energy Services, a leading oilfield services company,   is adopting MongoDB to modernize its high performance rig   technology. The Halliburton Edge platform connects digital   operations of the field, orchestrating multiple inbound and   outbound data streams and applications to optimize execution. The   ease of use and flexible scheme of MongoDB enabled the developers   to quickly iterate and drive innovation and modernization at the   rig site. An important example of MongoDB's international reach.   Technology leader Hitachi signed an agreement to embed MongoDB in   their new products. After evaluating several other database   platforms, they chose MongoDB for a consistent reputation for   reliability, scalability and performance. Dream:us [Ph], a   subsidiary of SK Telecom, the number one telco in Korea recently   replaced MySQL with MongoDB for their new mobile music service   flow. Dream:us made the decision to switch to MongoDB, because of   the limitations of its relational database to scale and MongoDB's   flexible scheme of data model as well as their future plans for a   managed cloud service. Conrad Electric, European retailer of   electronic products based in Germany and one of Europe's top 10   online shops, was self managing MongoDB community in the cloud,   but recently decided to move their MongoDB environment to Atlas.   They're not only saving on overall infrastructure cost, but can   also focus their developers time on high value tasks instead of   database management. The breadth and depth of MongoDB's   deployments around the world demonstrates our success as the   modern data platform of choice. To summarize MongoDB continues to perform at a very high   level. We believe the increasing sophistication of go-to-market   strategy and expanded product portfolio position us well to   continue delivering high revenue growth rates for the foreseeable   future. We're focused on executing against our strategic   priorities and ensuring we capitalize on our market   opportunity. With that, let me now turn the call over to Michael.  Michael Gordon    --   Chief Operating Officer and Chief Financial Officer  Thanks, Dave. As mentioned, we're very pleased with our second   quarter performance. I'll begin with a detailed review of our   second quarter results and then finish with our outlook for the   third quarter and full fiscal year 2020. First, I'll turn to our second quarter results. Total revenue   in the quarter was $99.4 million, up 67% year-over-year,   subscription revenue was $94.2 million, up 71% year-over-year and   professional services revenue was $5.2 million, up 15%   year-over-year. While we performed well above our expectations in   the quarter, we would like to note that our results also   benefited from a few meaningful Enterprise Advanced transactions   that we had expected to close in the third quarter. Under ASC   606, we were required to recognize the upfront term license   revenue from these contracts in Q2, when we have expected to   realize them originally in Q3. Our second quarter performance reflected positive   contributions from every region and strong adoption of both   Enterprise Advanced and Atlas. The combination of healthy new   logo additions and continued strength in up-sell activities   provides us with multiple vectors to sustain high levels of   growth. We continue to see rapid adoption of Atlas, which grew   over 240% in the quarter and now represents 37% of total revenue   compared to 18% in the second quarter of fiscal 2019 and 35% last   quarter. Atlas has now reached a nearly $150 million annualized   revenue run rate only three years since its launch, which   reflects the popularity of MongoDB and the growing interest that   customers of all sizes have in a fully managed cloud database   offering. As a reminder, our second quarter results include the   impact of mLab, which we acquired in November of 2018. At the   time of the mLab acquisition, we said that we expected the mLab   business to decline as we transition their customer base to the   Atlas platform. Revenue from mLab customers performed in line   with our expectations for a modest sequential decline, which we   expect will continue in the second half of fiscal 2020, as   planned. Excluding mLab, we were very pleased with the organic   growth of the business overall which drove the outperformance   relative to the guidance. During the second quarter, we grew our customer base by over   800 customers sequentially, bringing our total customer count to   over 15,000, which is up from over 7,400 in the year ago period.   Of our total customer count over 1,850 are direct sales   customers, which compares to over 1,600 in the year ago period.   The growth in our total customer count is being driven in large   part by Atlas, which had over 13,200 customers at the end of the   quarter compared to over 5,300 in the year ago period. The   sequential growth in total customers includes growth in our   Enterprise Advanced customers as well as new Atlas customers. It   is important to keep in mind that the growth in our Atlas   customer count reflects new customers to MongoDB in addition to   existing EA customers adding incremental Atlas workloads. We also   continue to see healthy expansion from existing customers, which   is a key component of our growth strategy. Our net ARR expansion   rate in the first quarter remained above 120% for the 18th   consecutive quarter. We ended the quarter with 622 customers,   with at least 100,000 in ARR and annualized MRR, which is up from   438 in the year ago period. Moving down the P&L, I'll be discussing our results on a   non-GAAP basis unless otherwise noted. Gross profit in the second   quarter was $71.1 million, representing a gross margin of 72%   compared to 74% in the year ago period. We are pleased with the   efficiencies we're generating in our organic Atlas business as it   scales. In addition, we're starting to see improvements in mLab,   as mLab benefits from Atlas's scale and as we're starting to   transition mLab customers onto the Atlas platform. However, we   continue to expect that we will see some modest reduction in   overall company gross margin, as Atlas continues to be a bigger   portion of our revenue. Our operating loss was $14.8 million or a   negative 15% operating margin for the second quarter compared to   a negative 30% margin in the year ago period. The more than 1,500   basis points improvement in operating margin is particularly   impressive ,given our growth profile and the investments we're   making in our business. Given our strong first half revenue and   profitability performance and the numerous growth opportunities   we are targeting, our intention is to make incremental   investments in sales and marketing and R&D in the second half   of fiscal 2020. Net loss in the second quarter was $14.7 million   or $0.26 per share based on 55.6 million weighted average shares   outstanding. This compares to a loss of $0.34 per share on 51.2   million shares outstanding in the year ago period. Turning to the balance sheet and cash flow. We ended the   quarter with $436.6 million in cash, cash equivalents, short term   investments and restricted cash. Operating cash flow in the   second quarter was negative $12.6 million. After taking into   account -- after taking into consideration approximately $1.2   million in capital expenditures, free cash flow is negative $13.8   million for the quarter. This compares to negative free cash flow   of $18 million in the second quarter of fiscal 2019. We are   pleased with our cash flow performance year-to-date, but expect   to burn cash in the third and fourth quarter of fiscal 2020, as   we continue to make significant investments in the business. Also   given this year's stronger than expected Q2 cash flow   performance, Q2 may not be our peak quarter for negative cash   flow, as is typically the case. As a reminder, the continuing growth of Atlas as a percent of   our overall business impacts our reported financials in several   ways. First, Atlas revenues recorded on a consumption basis,   whereas Enterprise Advanced includes a term license component   that has recognized upfront. Second, Atlas has a lower overall   gross margin Enterprise Advanced because of its infrastructure   component. That said, on an apples-to-apples functionality basis,   Atlas is accretive to dollars of gross profit. Finally,   self-service at Atlas customers and a growing portion of our   direct sales Atlas customers pay us monthly in arrears versus   annually upfront for Enterprise Advanced. In other words, a   growing percentage of Atlas, which is an increasing portion of   our overall business does not involve an upfront cash payment nor   does it impact our deferred revenue balances. We believe that   offering customers the ability to pay as they go is a key benefit   of the cloud model. More broadly, we believe that continuing to   find ways to facilitate the ease of consumption will ultimately   maximize long term revenues and cash flow. I'd now like to turn to our outlook for the third quarter and   full fiscal year 2020. For the third quarter, we expect revenue   to be in the range of $98 million to $100 million. We expect   non-GAAP loss from operations to be negative $16.5 million to   negative $15.5 million and a non-GAAP net loss per share to be in   the range of negative $0.29 to negative $0.27 per share based on   56.4 million weighted average shares outstanding. As we have   mentioned on previous calls, our third quarter outlook reflects a   notably large compare from the third quarter of fiscal 2019, when   we signed a higher than usual number of multi-year Enterprise   Advanced contracts. As a reminder, under ASC 606, we recognized   the entire term license portion of a multi-year contract at the   outset, resulting in no recognition of additional term license   revenue at the beginning of each new subscription year of the   contract. Also, as discussed earlier, our results in the second   quarter also benefited from a few meaningful Enterprise Advanced   transactions that moved from Q3 to Q2. For the full fiscal year 2020, we now expect revenue to be in   the range of $390 million to $395 million compared to our   previous guidance of $375 million to $381 million. Please recall   the fourth quarter will be the first quarter, where we'll have   mLab in the base period. And as we've described before, we expect   continued deterioration in the revenue from former mLab   customers, both sequentially as well as year-over-year. This is   all in line with our original investment thesis. For the full   fiscal year 2020, we expect non-GAAP loss from operations to be   negative $62 million to negative $59 million and non-GAAP net   loss per share to be in the range of negative $1.11 to negative   $1.06 per share based on 55.9 million weighted average shares   outstanding. As mentioned previously, we see our strong start to   fiscal '20 as another indication of the size the opportunity   ahead of us and we will invest incrementally across our business   in the second half to further pursue that opportunity. To summarize MongoDB delivered excellent second quarter   results. We're executing well on our product and go-to-market   strategies, which is generating impressive growth at scale. We   believe our clear leadership is the modern general purpose data   platform of choice will enable us to continue delivering strong   growth going forward. And with that, we'd like to open up to questions.   Operator? Questions and Answers:  Operator  Thank you, sir. [Operator Instructions] And first from   Barclays, we have Raimo Lenschow.  Raimo Lenschow    --   Barclays -- Analyst  Hey congrats from me. Two questions, if I may. First Dev can   you talk, it doesn't happen often in software that kind of deals   get kind of pulled in or large deals are getting pulled in early.   Can you just talk a little bit about momentum in the quarter and   linearity, I mean, given that everyone is nervous, this sounds   like the opposite of it. Just talk to that, please.  Dev Ittycheria    --   President and Chief Executive Officer  I would say that this quarter was much like most other   quarters. There wasn't any changes in linearity. We typically put   a lot of rigor in our forecasting process. And so we have a   pretty good sense of how the core is looking. And obviously the   close to the quarter we get to the more -- even more visibility   we have. And I would say, our sales organization is quite   effective at closing deals and giving customers reasons for why   they should engage with us now versus later. And we feel good --   really good about that execution.  Raimo Lenschow    --   Barclays -- Analyst  Yeah, well done. And then on Atlas, can you talk a little bit   about what you see on the different platforms like now that   you're kind of on the -- what does it mean that you're now on the   Microsoft Marketplace. You talked about it early good momentum   around Google. Like, just help us understand what's the   difference between like being on AWS versus being on the   marketplace, etc.?  Dev Ittycheria    --   President and Chief Executive Officer  Sure. And just for everyone's benefit. We started in 2016 on   AWS first and then a year later we added GCP and Azure. I would   say that -- obviously, I would say Atlas, the deployments of   Atlas in some ways mirrors the broader market share of the larger   cloud providers. That being said, I would say that we've been   really pleased with the traction we're getting with Google and   that's really starting to accelerate even though the partnership   we announced in May has not had a lot of time to gestate. But   activity level is very strong and we've closed a number of deals   with Google and the announcement we made with Microsoft basically   incentivizes their salespeople to basically get paid on Atlas   deals. Moreover, customers can get a unified bill when they buy   Atlas via the marketplace and they can apply their Azure   commitments toward Atlas, which means that they don't have to go   find other dollars to fund the workload on Atlas. So all know,   it's a win-win for the customer, win-win for Microsoft   salespeople and absolute win-win for us.  Raimo Lenschow    --   Barclays -- Analyst  Perfect. Congrats. Thank you.  Operator  And moving on, we will take Sanjit Singh with Morgan   Stanley.  Sanjit Singh    --   Morgan Stanley -- Analyst  Thanks for taking questions. And congrats Dev and Michael on   an excellent first half. I wanted to pick up from MongoDB World   debut. You elicited a very ambitious vision around MongoDB data   platform. Could you speak to what needs to happen in terms of   evangelizing that type of story in terms of like the sales motion   specifically, typically in the database market we've seen   customers go for point functionality for specific capabilities.   What would be -- what needs to happen to sort of funnel that   demand to more of a consolidated play when we think about some of   the things that you're going after around data visualization   search and those types of -- and more analytical workloads on the   MongoDB platform. What needs to happen to trigger those buying   pattern?  Dev Ittycheria    --   President and Chief Executive Officer  Yeah. So I would say that while there have been a lot of point   solutions build for particular use cases, we increasingly hear   from customers that they just can't use a net new technology for   every net new workload, it doesn't scale, it's hard to get   everyone to learn all these new technologies, support and   maintain all of them. And it just adds a lot more costs. So the   degree to which that they can consolidate their infrastructure   under not necessarily only one platform, but a small number of   platforms that becomes more compelling to the customer. So I   would say, for example, our Full-Text Search capability basically   obviates the need for a customer to buy a disparate search engine   to complement their functionality on the database to basically   provide search functionality on their application. Conversely,   for the Data Lake capabilities, rather than having to learn a new   technology, make some big upfront investment, hire a very   specialized group of people, you can leverage the experience and   expertise of people that have on MongoDB and basically use the   Data Lake functionality to query data on S3, which is where most   people are storing their data today. So it really allows people   to -- it gives reason for people to use MongoDB for a broader and   broader set of use cases. And remember, the database is the heart   of every application. So unlike search, where there's some   vendors in the search space who have contemplated becoming a   database, they quickly realize that that was not something that   was very easy to do. They've -- they're now trending more toward   the op space and going after the systems managing market, where I   think with the database being the center of gravity, it's much   more natural for us to expand from the database to broaden our   set of use cases. And that's why we think as MongoDB becomes an   obvious choice for modern applications, our ability to expand our   use cases will be -- get better over time. And you see these   investments in the products that we're making.  Sanjit Singh    --   Morgan Stanley -- Analyst  Great. That's very helpful. And Mike maybe one just quick   follow-up for you in terms of the pull forward impact of   Enterprise Advanced. Is there any way you can quantify what the   impact that was in terms of revenue or billings in the   quarter?  Michael Gordon    --   Chief Operating Officer and Chief Financial Officer  Yeah. Not specifically in terms of a number, but I think the   key point here is, this ties to what we've talked about -- ever   since we adopted 606, it sort of increased variability and   reduced comparability quarter-to-quarter. And so I think what we   wanted to do is just have people understand that we had a couple   that sort of fell on the earlier side of the ledger relative to   where we were forecasting, and that helps put sort of Q3 in   context.  Sanjit Singh    --   Morgan Stanley -- Analyst  Fair enough. Thank you for taking the question.  Operator  And moving on, we have Brad Reback with Stifel.  Brad Reback    --   Stifel -- Analyst  Great. Thank you very much. Dev, as you think about the   three-pronged go-to-market strategy you've laid out. How much   bigger do you think self-service can get than where it is   today?  Dev Ittycheria    --   President and Chief Executive Officer  We think we're just in the early innings of our self-serve   journey. If you remember, we really started this business with   the launch of Atlas and then we accumulated more expertise to the   mLab acquisition, because they built their business entirely   through self-serve. We finally feel that we have -- making   investments to really understand the levers that what drives   self-serve. We have -- now with lots of customers, over 13,000   customers at Atlas. We have a lot more understanding and   sophistication on product signals in terms of what customers may   be right for up-sell or cross-sell. But we still feel that we're   on the early innings of our journey there.  Brad Reback    --   Stifel -- Analyst  Great. And then just one quick follow-up also on the   go-to-market side. Last quarter, you talked about very aggressive   recruiting efforts on the sell side. Can you tell us how the   hiring process is going? Thanks.  Dev Ittycheria    --   President and Chief Executive Officer  We've been very pleased. We've been hiring like mad. We have a   high bar and we will continue to be hiring because as I think   I've mentioned on many calls, given the size of the market, we   are constrained by the reach that we have. And so -- and in many   markets, we have very limited coverage. And so but just hiring   salespeople is not enough, you have to hire and make sure you   have the sales management leadership in place and you need to   make sure you have your recruiting infrastructure in place and   that once you hire them, you can ramp them and get them   productive as fast as possible. That's a big priority for us. We   are very happy with the number of people we recruited in the last   quarter, but there's a big push to do a lot of recruiting in Q3   and Q4.  Brad Reback    --   Stifel -- Analyst  Great. Thanks very much.  Operator  Moving on, we have Heather Bellini with Goldman Sachs.  Daniel Church    --   Goldman Sachs -- Analyst  Hi, this is Dan Church on for Heather Bellini. Thanks for   taking my question. Last quarter, I think you mentioned roughly   about two-thirds of Atlas revenue is not reflected in deferred   revenue. I was just wondering how stable is that number been over   time? And do you expect that mix to change as you see increasing   enterprise adoption of Atlas?  Michael Gordon    --   Chief Operating Officer and Chief Financial Officer  Yes. So I think the key thing there is we're trying to give a   point in time estimate for folks as opposed to quarterly metric   that we'd read out on. But I think in general, the direction will   be more of as we -- as I kind of shared in the prepared remarks,   more and more of Atlas will be on a monthly in arrears basis both   because of the self-serve growth as well as trying to make sure   that we are reducing any possible barriers to consumption and   making consumption as easy as possible, including monthly   invoicing for arrears for some enterprise customers for whom   that's important. So I think in general you'll continue to see   that be a relevant consideration and therefore some of the   deferreds, in other ways, that you tend to look at some companies   being increasingly less relevant, as it relates to analyzing   us.  Daniel Church    --   Goldman Sachs -- Analyst  Thanks, helpful. Thank you. And as a quick follow-up, just I   believe last quarter you talked about some investments you are   making and expanding the channel ecosystem specifically with   system integrators. So any update or progress on traction there   and strategic investments or priorities for investment as we're   getting into the back half of the year?  Michael Gordon    --   Chief Operating Officer and Chief Financial Officer  No things are remain the course. We're doing a lot of business   with the ESIs. I think we have relations with a number of them.   In fact, I just did a video testimonial with Infosys that was   published on LinkedIn. And we have relations with Accenture, with   Cap Gemini, a bunch of boutique players and other large systems   integrators. And obviously each system integrator has certain   expertise either in a particular geography or an industry or they   have specific account control and so we work well with them. And   the synergy there is that, in many cases, as we all know lot of   customers are constrained on development capacity and so where   the systems really can add value as being the development arm,   leveraging MongoDB and a more modern stack to help customers   drive innovation faster in the organization. And so we're   spending a lot of time enabling these integrators both at the   corporate level and at the field level and building more, more   proof points. And in some cases, you also see integrators   themselves build their own specific products, embedding MongoDB   in their technology. And so it's a multipronged effort.  Daniel Church    --   Goldman Sachs -- Analyst  All right. Thank you.  Operator  Next from Citi, we have Tyler Radke.  Tyler Radke    --   Citi -- Analyst  Hey, thanks for taking my question. Could you talk about the   -- what you're seeing in terms of enterprise adoption of Atlas?   It sounds like you're not necessarily seeing enterprises come in   and to pay for a full year upfront necessarily, but maybe to some   comment on the use cases or traction that you're seeing in terms   of enterprise in Atlas? Thanks.  Dev Ittycheria    --   President and Chief Executive Officer  I would say that we're seeing actually strong demand for Atlas   in the enterprise. And in some cases, they'll actually commit   upfront for a certain amount of spend in a particular year over a   multi-year period and that's driven by either new workloads that   they're building and they want to just run in the cloud because   of a particular use case reasons or they're migrating, say, a   community workload on premise to the cloud because the cost   benefit of Atlas is that much more compelling. And so we're   seeing a lot of interest from very, very large organizations. I   think previously we talked about banks, insurance companies, tech   companies and so on so forth, all very, very interested in Atlas.   And we're really, really excited about the interest level. And   one of the other things that really surfaces in our discussions   with these large enterprises is our ability to run Atlas on   multiple clouds. So either they want to leverage specific   expertise or services capabilities with a particular cloud   provider or they want to make sure that they have a diversity of   workloads across different cloud providers. And so running that   on Atlas preserves their optionality because they can do that   very easily without having to rewrite the application.  Tyler Radke    --   Citi -- Analyst  Thank you. And maybe a follow up for Michael. I appreciate all   the color around the moving parts of Q3 guidance, including the   multiyear deal that closed here in Q2 instead of Q3. Maybe as we   just think about the rest of the year, it does obviously look   like you're guiding Q3 to have revenue decelerate quite a bit   from Q2, which makes sense given the tough comp, but as we think   about Q4, is there anything we should be thinking about in terms   of a tough compare for multiyear deals or just anything to call   out, because the guidance does look like the decel is kind of   continuing into Q4? Thank you.  Michael Gordon    --   Chief Operating Officer and Chief Financial Officer  Yeah, sure, yeah. So we had flagged this at the very beginning   of the year that the back half both Q3 and Q4 had tough compare.   So you're exactly correct. The Q3 compare was particularly driven   by some multiyear deals which we talked about, but the Q4 compare   was also very challenging Q4, fiscal '19 was an exceptionally   good quarter. So it's not appropriate to guide to replicating   that. We also called out at that time just to remind everyone   that there had been some customers on Atlas that were consuming   in excess of their run rate. We don't have enough data or enough   history on Atlas to know if that's kind of truly seasonal   behavior. And so we're not counting on that either. But I think   fundamentally, Q2 was very strong. We're obviously raising our   guidance more than the beat and it really reflects the underlying   health of the business. And then the last thing that we've talked   about consistently for the last couple of quarters. We just want   to underscore is, Q4 is the first time we hit the mLab   anniversary. And while that business is performing well relative   to our investment thesis, the underlying cohorts are declining.   And so that obviously creates sort of a year-over-year headwind   when you look at sort of the growth comparison.  Tyler Radke    --   Citi -- Analyst  Thank you.  Operator  [Operator Instructions] And next, we move on to Jason Ader   with William Blair.  Jason Ader    --   William Blair -- Analyst  Yeah, thank you. Hi, guys. Just wanted to address the   competitive landscape, if you would. Specifically relative to   Amazon and any feedback you're hearing from customers on document   DB? And then maybe any other comments on win rates against legacy   guys and what you're seeing just broadly speaking   competitively?  Dev Ittycheria    --   President and Chief Executive Officer  We feel really good about the business. I mean obviously,   Amazon has a large reach, but I think as we spent time on   previous calls, they've tried to emulate MongoDB using a very   different architecture. So that has severe consequences in terms   of both features as well as performance, and we've heard in many   situations where customers have tried to use document DB and it   has really been right for their use case. And so we don't see any   headwinds in terms of competition. It is a big market. There's   lots of people out there. But we feel really good about a   competitive differentiation, as evidenced by our growth rates, as   evidenced by some of the most sophisticated customers in the   world are choosing MongoDB, for some very, very mission critical   workloads. And they don't have lack of access to options. And   then -- and we feel really good about our positioning.  Jason Ader    --   William Blair -- Analyst  Okay, great. And then a quick follow-up for Michael, you just   talked about the Enterprise Advanced deals that you had in the   quarter. I'm assuming these were larger companies. Do you have   any metric that you track in terms of how much of your business   is, let's say, with Global 2000 customers or something to that   effect?  Michael Gordon    --   Chief Operating Officer and Chief Financial Officer  That's not something that we have that we sort of publicly   report on. I'm trying to figure if there was anything that we   have that would be useful that that we have disclosed. But I'll   try and keep it--  Jason Ader    --   William Blair -- Analyst  Do you have a rough idea of how much of your business is,   let's call it, enterprise versus more mid-market?  Michael Gordon    --   Chief Operating Officer and Chief Financial Officer  So certainly, if you separate the business into the self sold   side and self service side. Within the self sold side, the   majority is coming from larger enterprises. The mid-market team   is newer and we've been scaling that more recently. The product   market fit within Atlas is particularly strong on that team, and   that's actually the area that my comments earlier about sort of   ease of adoption and less comfortable making annual payments   advances, much more to mid-market that we see that. And so that's   been growing. But the majority is on the large enterprise side   within self sold.  Jason Ader    --   William Blair -- Analyst  Thank you.  Operator  Okay and moving on, we have Patrick Walravens from JMP   Securities.  Joey Marincek    --   JMP Securities -- Analyst  Hi, this is Joey on for Pat. Thank you for taking our   question. We are wondering about the difference between selling   more databases into an existing customer compared to selling apps   and how specifically does that manifest itself in a net dollar   expansion rate? Thank you.  Dev Ittycheria    --   President and Chief Executive Officer  Well, I'm not sure, I completely understood the details of   your question. But let me try and take a stab at answering it. So   unlike an app say like Workday or Salesforce, if you add more   employees and more salespeople, the cost of sale is quite low   because the customer will just say, hey, I need X number of new   seats or licenses for these additional people that I've hired.   Whereas for database software, while we have some applications   that grow very quickly organically, most of the growth in an   account is by adding new workflows or new apps. And so there may   be a different team, a different decision maker and so on and so   forth involved in those decisions. Obviously, as the more   momentum we have in account, the easier the next workload   becomes. But that tends to be a different buying cycle than just   someone adding seats or licenses for expanding an existing   application. And so the benefit is that we're never locked out of   account. So it's not like SAP versus Workday, where someone has   made a big commitment to SAP, the Workday salesperson says what   I'm not going to be able to sell anything to this customer for   the next three years. That's -- so this is not a winner take home   market. And in terms of our net expansion rates, our net   expansion rates are really strong, because once we get into an   account, I think we've talked at the IPO and in every quarter, we   have a land expand business. And so once we get into an account,   database software is very sticky and they see value in it. They   typically find other reasons to use our software for other use   cases. But as I said, the buying motion is a little   different.  Michael Gordon    --   Chief Operating Officer and Chief Financial Officer  I think the other thing just to sort of get to the last part   of the question is because the market is so large, the expand   portion sort of goes on longer. And so that's very additive to   the net ARR expansion rates. And so if you think about very   simplistically, we talked about this in the context of the IPO,   the Fortune 100, which obviously we're addressing a much larger   universe than that. But just illustratively it's helpful to   understand, we had just over half of the Fortune 100 customers.   So the best we could do in terms of raw customer count is sort of   not quite double within that universe of customers and   directionally we had less than 1% of their spend, right. So the   upside on the expand part was quite significant given what a   small wallet share we have relative to the very large TAM. So   that puts it somewhat in context.  Joey Marincek    --   JMP Securities -- Analyst  Yeah, that's really helpful. Thank you so much and congrats on   the quarter.  Dev Ittycheria    --   President and Chief Executive Officer  Thank you.  Operator  And next, we have Jack Andrews with Needham.  Unidentified Participant  Hi, gentlemen. It's [Indecipherable] for Jack this afternoon.   Thanks for taking my question. MongoDB World, you mentioned that   some customers could see an increase in customer size due to   Full-Text Search. Can you provide an update on the changes you're   seeing in customer size due to this feature? And what's the   potential TAM of existing customers that may end up using   Full-Text Search?  Dev Ittycheria    --   President and Chief Executive Officer  Yeah. I should remind you that we're still in a beta roll out.   So the product is not [Indecipherable] but we have a number of   customers who are now using or testing or trialing Full-Text   Search and the feedback has been quite positive. I think it's a   little early to start giving you some sense of like what the   incremental growth is of each customer. It really depends on the   application. And in terms of the applicability of Full-Text   Search in our market is very high. So if you think about it what   application today doesn't have some embedded search functionality   in it. So we think the cross-sell opportunities are quite   large.  Unidentified Participant  Thanks, that's helpful. And how should we think about today   like featuring the displacement opportunity for like a cloud   based HADOOP system and where are some of the benefits of using   your Atlas Data Lake versus other systems?  Dev Ittycheria    --   President and Chief Executive Officer  Right. So I would say the -- we think that the Atlas Data Lake   is awesome solution for people who are constantly using HADOOP   technologies, because as I mentioned in the prepared remarks,   there's not a huge upfront investment required. There's not a   need to hire some specialized skills. And the time to value is   not very long. In fact you can get up and running very, very   quickly because you can just very easily query and parse the data   that you've stored in S3. And so we think the opportunity there   is incredibly high. And I think the advantage also is that if you   already have existing MongoDB skills, there's not new technology   that you have to learn. So it becomes very easy for developers   and others to basically query data using a semantic language that   they're very comfortable in using. And so in terms of competitive   offerings, we feel like -- we think about the most common data   format today for modern data is JSON, who better to really query   and manage JSON data than MongoDB, which is -- architecture is   built around supporting JSON. And so we think we're very well   positioned to go after this market, given our expertise in   managing modern data.  Unidentified Participant  Great. Thank you.  Operator  Next, we have Brent Bracelin with KeyBanc Capital Markets.  Clarke Jeffries    --   KeyBanc Capital Markets -- Analyst  Hi, this is Clarke on for Brent. Just going to the comments   about the mid-market customers that are really building their   business around MongoDB. Is there any kind of description you   could kind of qualify what those customers look like? Are they   very digital first or are they conducting their business   primarily through an e-commerce channel. Just some sort of way to   understand what that kind of business and what those customers   look like today?  Dev Ittycheria    --   President and Chief Executive Officer  Yeah, sure. I mean, they're clearly digital first companies.   They're potentially a start-up that's grown into a kind of   mid-market state, but growing very, very quickly. They're very   technology savvy and the business is very technology intensive.   It could be e-commerce. It could be gaming. It could be new   business models. And they basically potentially in the machine   learning and the AI space. So those companies if their business   is really taking off, they can -- their needs in terms of support   and service tend to look much like a potentially a large   enterprise, just given the sophistication and complexity of their   environment. And so the advantage we have is that, we just   haven't built a mid-market channel. We've built also a high end   enterprise channel. And so depending on that customer's needs, we   can mix and match the right channel for the right customer. And   that gives us real flexibility in terms of how to service these   very sophisticated customers.  Clarke Jeffries    --   KeyBanc Capital Markets -- Analyst  Great. And are you seeing them or would you anticipate those   to be probably target customers for these add-on offerings for   parsing the JSON data because they might have more of their core   operations within MongoDB? Just trying to understand whether   you're seeing early signs of -- they're not going to another   vendor for analytical or operational understanding of their   business. They're keeping it all with an ecosystem. And that's it   from me. Thank you.  Dev Ittycheria    --   President and Chief Executive Officer  Yeah, they're definitely great candidates and some of them may   have already implemented some third-party solution, but they're   still great candidates for us to talk to. These customers always   tend to be evaluating different options. And so but it's again   quite early for our Data Lake product and our Full-Text Search   product data. But we're very, very pleased with the kind of   enthusiastic response that we're seeing.  Operator  Okay. And moving on to the next question, from Oppenheimer we   have Vinod Srinivasaraghavan.  Vinod Srinivasaraghavan    --   Oppenheimer -- Analyst  Hi, how are you guys? I have two questions. First, I want to   dig into the expansion rate dynamics a bit. Has your expansion   rate moved up or down materially, sequentially?  Michael Gordon    --   Chief Operating Officer and Chief Financial Officer  Yeah. So it's consistently been, I think it's now 18 quarters   that we've said, that it's over 120%. Quarter-to-quarter, there's   some quarters where you see more new logo activity relative to   expansion from existing customers and other quarters where you   see it slightly tip the other way. But I would say we've very   consistently had both strong new logo growth and expansion of   existing customers.  Vinod Srinivasaraghavan    --   Oppenheimer -- Analyst  Okay, and just one more. How many customers are above one   million in ARR now?  Michael Gordon    --   Chief Operating Officer and Chief Financial Officer  So we haven't given that number since the -- we give that   number typically annually. I think when we ended Q4 of last year,   that was at 39 million -- 39 customers over a million, excuse me,   39 customers over a million. But that's not a number we update   quarterly.  Vinod Srinivasaraghavan    --   Oppenheimer -- Analyst  Got it. All right. Congrats on the quarter.  Dev Ittycheria    --   President and Chief Executive Officer  Thank you.  Michael Gordon    --   Chief Operating Officer and Chief Financial Officer  Thanks.  Operator  All right, ladies and gentlemen, it does appear that that does   conclude our question-and-answer session of the call. I'd like to   turn the floor back to CEO, Dev Ittycheria, for additional or   closing remarks.  Dev Ittycheria    --   President and Chief Executive Officer  Thank you again for joining our second quarter       earnings call    . We really appreciate the interest and the support. And as I   mentioned upfront, we're really pleased about the quarter and we   feel like we have -- we're well positioned to go after a big   opportunity. Thank you.  Operator  [Operator Closing Remarks]  Duration: 49 minutes  Call participants:  Brian Denyeau    --   ICR, Investor Relations   Dev Ittycheria    --   President and Chief Executive Officer   Michael Gordon    --   Chief Operating Officer and Chief Financial Officer   Raimo Lenschow    --   Barclays -- Analyst   Sanjit Singh    --   Morgan Stanley -- Analyst   Brad Reback    --   Stifel -- Analyst   Daniel Church    --   Goldman Sachs -- Analyst   Tyler Radke    --   Citi -- Analyst   Jason Ader    --   William Blair -- Analyst   Joey Marincek    --   JMP Securities -- Analyst   Unidentified Participant   Clarke Jeffries    --   KeyBanc Capital Markets -- Analyst   Vinod Srinivasaraghavan    --   Oppenheimer -- Analyst     More MDB analysis   All earnings call transcripts        10 stocks we like better than MongoDB     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and MongoDB wasn't   one of them! That's right -- they think these 10 stocks   are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends MongoDB. The Motley Fool has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " MongoDB, Inc.    (NASDAQ: MDB)        Q2 2020 Earnings Call       Sep 4, 2019 ,   5:00 p.m. ET ",
    " Operator ",
    "Good day, ladies and gentlemen, and welcome to today's MongoDB   Second Quarter Fiscal 2020 Earnings Call. I'd like to remind   everyone that this conference is being recorded.",
    "And at this time, I'll turn the floor over to Brian Denyeau,   ICR Investor Relations.",
    " Brian Denyeau    --   ICR, Investor Relations ",
    "Thank you, Greg. Good afternoon and thank you for joining us   today to review MongoDB's second quarter fiscal 2020 financial   results, which we announced in our press release issued after the   close of market today.",
    "Joining me on the call today are Dev Ittycheria, President and   CEO of MongoDB; and Michael Gordon, MongoDB's COO and CFO.",
    "During this call, we may make statements related to our   business that are forward-looking under Federal Securities Laws.   These statements are made pursuant to the safe harbor provisions   of the Private Securities Litigation Reform Act of 1995,   including statements related to our financial guidance for the   third quarter and full year fiscal 2020, our market opportunity,   the opportunity created by and scalability of our go-to-market   and growth strategies. The potential advantages of our new   products, product enhancements and planned integrations,   including as a result of our recent acquisition of Realm. Timing   of the transition of mLab customers to Atlas and anticipated   revenue deterioration from mLab customers, the anticipated impact   of Atlas sales expansion on our gross margin, anticipated   investments in the business and their impact on future cash   flows.",
    "The words anticipate, continue, estimate, expect, intend, will   and similar expressions are intended to identify forward-looking   statements or similar indications of future expectations. These   statements reflect our views only as of today and should not be   considered as representing our views as of any subsequent date.   We do not have plans to update these statements, except as   required by law. These statements are subject to a variety of   risks and uncertainties that could cause actual results to differ   materially from expectations.",
    "For a discussion of the material risks and other important   factors that could affect our actual results, please refer to   those contained in our quarterly report on Form 10-Q with the SEC   on June 7th, 2019 and our other periodic filings with the SEC.   These documents are available in the Investor Relations section   of our website at www.mongodb.com. A replay of this call will   also be available there for a limited time.",
    "Additionally, non-GAAP financial measures will be discussed in   this conference call. Please refer to the tables in our earnings   release on the Investor Relations portion of our website for a   reconciliation of these measures to the most directly comparable   GAAP financial measure.",
    "And with that, I'd like to turn the call over to Dev.",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "Thanks, Brian. Thanks to everyone for joining us to review our   second quarter results. MongoDB continued to perform at a very   high level, driven by broad based strength in all geographies and   industries. Our results continue to demonstrate that MongoDB has   clearly established itself as the most popular modern database   platform of choice in the world. Our success is being driven by   our strong product market fit and the sophistication of our   go-to-market strategy. We're confident that we'll be able to   continue to capitalize on our long-term opportunity in the 64   billion global database software market.",
    "Looking quickly at our second quarter financial results. We   generated revenue of $99.4 million, a 67% year-over-year increase   and above the high end of our guidance. We grew subscription   revenue 71% year-over-year. Atlas revenue grew more than 240%   year-over-year and now represents 30% of revenue, and we had   another strong quarter of customer growth ending the quarter with   over 15,000 customers. Our strong results begin with our   best-in-class product offering. We made several significant   product announcements that represent notable progress on our   long-term product vision to make data stunningly easy to work   with.",
    "In June, we held our annual user conference MongoDB World in   New York and attendance set another record. During the   conference, we unveiled a number of exciting products and   features, including the MongoDB version 4.2 with key features   such as distributed asset transactions and client-side field   level encryption. We believe this latest release further cements   our positioning as the modern general purpose database of choice   and underscores our capability to support the most mission   critical applications. MongoDB Atlas Data Lake allows customers   to quickly query data on S3 in any format using the MongoDB Query   Language. We believe that other solutions in the analytics   markets have been plagued by high upfront investments, complex   implementations and a need for specialized skills. By contrast   with Atlas Data Lake, our customers can leverage their existing   MongoDB expertise and incur no upfront costs to quickly derive   value from their data. MongoDB Full-Text Search gives end users   the flexibility to filter, rank and sort their data to quickly   service the most relevant search results. Importantly, they can   implement this functionality without incurring the effort and   cost of pairing their database with an external search engine.   Developers can leverage the functionality to build sophisticated   search queries within applications, saving them significant   amount of time, effort and money.",
    "Finally, we announced our plan to integrate our newly acquired   mobile database Realm with our serverless platform Stitch.   Realm's Synchronization Protocol will connect with MongoDB's   Atlas Global Cloud Database on the back-end, making Realm Sync a   powerful way for developers to connect data to device -- to the   devices running their applications. As part of MongoDB, Realm is   positioned to become the default database for mobile developers   and the easiest way to build real time mobile applications. These   product announcements are formed by a long-term vision and ground   by feedback from our customers on the strategic value they can   achieve by leveraging MongoDB for a broader set of use cases   across their organization.",
    "Our second quarter results also demonstrates our investments   in expanding and extending our go-to-market capabilities that are   paying off. Given the size of the market in front of us, we have   built an increasingly sophisticated three-pronged go-to-market   strategy that allows us to pursue the entire database market. The   first component is our field sales organization, which drove   strong broad-based performance in all our major regions in the   second quarter. Our success with field sales is driven by our   ability to recruit and develop outstanding sales personnel and   strategically engage our customers from developers up to CXOs.   Second, our inside sales channel focuses on the mid-market, where   deals are smaller with shorter sales cycles. These customers, who   prefer a low touch sales model with a high degree of automation,   have less interest in managing their own infrastructure and   therefore see compelling value in Atlas. The third component of   our go-to-market strategy is our self-serve channel which has   grown significantly as a percentage of revenue over the past   year. Starting last year, we significantly increased our   investment in this channel to build a world class developer   focused product led growth marketing organization. This is a   multi-year journey, but we are encouraged by the progress we are   making.",
    "We also see increasingly a synergy across these go-to-market   motions. For example, we have observed developers and large   enterprises frequently start evaluating and using Atlas via our   self-serve channel, which can lead to large opportunities for our   direct sales force. We've also seen fast growing self service   customers who can grow even faster when they interact with our   customer facing teams. Moreover, we have observed highly   sophisticated mid-market customers, some of whom have built their   entire business on MongoDB, who need a level of engagement   typical of large enterprises. One of the key competitive   differentiators is the freedom to run anywhere and our cloud   partnerships enable customers that choose MongoDB Atlas to take   advantage of the benefits of each major cloud provider as they   see it fit. We're off to a strong start with our partnership with   GCP. We expanded our relation with Microsoft by launching the   availability of Atlas on Microsoft Azure Marketplace, which will   simplify billing for joint customers. Furthermore, we have joined   Microsoft Strategic Partner reported ACR co-sell program and this   was yet another record quarter for Atlas on AWS.",
    "I like to spend a few minutes reviewing some customer   vignettes. We're increasingly seeing a wide array of customers   choosing MongoDB to run mission critical applications. The   following is a small selection of customer wins and interesting   use cases from the second quarter. MongoDB is a valued partner to   Venmo. Venmo has experienced tremendous growth over the past few   years and has decided to partner with MongoDB because of our   ability to provide the scale they needed for their growing   platform. Venmo is leveraging MongoDB's enterprise advanced   offering to streamline operations and to drive automation.   Halliburton Energy Services, a leading oilfield services company,   is adopting MongoDB to modernize its high performance rig   technology. The Halliburton Edge platform connects digital   operations of the field, orchestrating multiple inbound and   outbound data streams and applications to optimize execution. The   ease of use and flexible scheme of MongoDB enabled the developers   to quickly iterate and drive innovation and modernization at the   rig site.",
    "An important example of MongoDB's international reach.   Technology leader Hitachi signed an agreement to embed MongoDB in   their new products. After evaluating several other database   platforms, they chose MongoDB for a consistent reputation for   reliability, scalability and performance. Dream:us [Ph], a   subsidiary of SK Telecom, the number one telco in Korea recently   replaced MySQL with MongoDB for their new mobile music service   flow. Dream:us made the decision to switch to MongoDB, because of   the limitations of its relational database to scale and MongoDB's   flexible scheme of data model as well as their future plans for a   managed cloud service. Conrad Electric, European retailer of   electronic products based in Germany and one of Europe's top 10   online shops, was self managing MongoDB community in the cloud,   but recently decided to move their MongoDB environment to Atlas.   They're not only saving on overall infrastructure cost, but can   also focus their developers time on high value tasks instead of   database management. The breadth and depth of MongoDB's   deployments around the world demonstrates our success as the   modern data platform of choice.",
    "To summarize MongoDB continues to perform at a very high   level. We believe the increasing sophistication of go-to-market   strategy and expanded product portfolio position us well to   continue delivering high revenue growth rates for the foreseeable   future. We're focused on executing against our strategic   priorities and ensuring we capitalize on our market   opportunity.",
    "With that, let me now turn the call over to Michael.",
    " Michael Gordon    --   Chief Operating Officer and Chief Financial Officer ",
    "Thanks, Dave. As mentioned, we're very pleased with our second   quarter performance. I'll begin with a detailed review of our   second quarter results and then finish with our outlook for the   third quarter and full fiscal year 2020.",
    "First, I'll turn to our second quarter results. Total revenue   in the quarter was $99.4 million, up 67% year-over-year,   subscription revenue was $94.2 million, up 71% year-over-year and   professional services revenue was $5.2 million, up 15%   year-over-year. While we performed well above our expectations in   the quarter, we would like to note that our results also   benefited from a few meaningful Enterprise Advanced transactions   that we had expected to close in the third quarter. Under ASC   606, we were required to recognize the upfront term license   revenue from these contracts in Q2, when we have expected to   realize them originally in Q3.",
    "Our second quarter performance reflected positive   contributions from every region and strong adoption of both   Enterprise Advanced and Atlas. The combination of healthy new   logo additions and continued strength in up-sell activities   provides us with multiple vectors to sustain high levels of   growth. We continue to see rapid adoption of Atlas, which grew   over 240% in the quarter and now represents 37% of total revenue   compared to 18% in the second quarter of fiscal 2019 and 35% last   quarter. Atlas has now reached a nearly $150 million annualized   revenue run rate only three years since its launch, which   reflects the popularity of MongoDB and the growing interest that   customers of all sizes have in a fully managed cloud database   offering. As a reminder, our second quarter results include the   impact of mLab, which we acquired in November of 2018. At the   time of the mLab acquisition, we said that we expected the mLab   business to decline as we transition their customer base to the   Atlas platform. Revenue from mLab customers performed in line   with our expectations for a modest sequential decline, which we   expect will continue in the second half of fiscal 2020, as   planned. Excluding mLab, we were very pleased with the organic   growth of the business overall which drove the outperformance   relative to the guidance.",
    "During the second quarter, we grew our customer base by over   800 customers sequentially, bringing our total customer count to   over 15,000, which is up from over 7,400 in the year ago period.   Of our total customer count over 1,850 are direct sales   customers, which compares to over 1,600 in the year ago period.   The growth in our total customer count is being driven in large   part by Atlas, which had over 13,200 customers at the end of the   quarter compared to over 5,300 in the year ago period. The   sequential growth in total customers includes growth in our   Enterprise Advanced customers as well as new Atlas customers. It   is important to keep in mind that the growth in our Atlas   customer count reflects new customers to MongoDB in addition to   existing EA customers adding incremental Atlas workloads. We also   continue to see healthy expansion from existing customers, which   is a key component of our growth strategy. Our net ARR expansion   rate in the first quarter remained above 120% for the 18th   consecutive quarter. We ended the quarter with 622 customers,   with at least 100,000 in ARR and annualized MRR, which is up from   438 in the year ago period.",
    "Moving down the P&L, I'll be discussing our results on a   non-GAAP basis unless otherwise noted. Gross profit in the second   quarter was $71.1 million, representing a gross margin of 72%   compared to 74% in the year ago period. We are pleased with the   efficiencies we're generating in our organic Atlas business as it   scales. In addition, we're starting to see improvements in mLab,   as mLab benefits from Atlas's scale and as we're starting to   transition mLab customers onto the Atlas platform. However, we   continue to expect that we will see some modest reduction in   overall company gross margin, as Atlas continues to be a bigger   portion of our revenue. Our operating loss was $14.8 million or a   negative 15% operating margin for the second quarter compared to   a negative 30% margin in the year ago period. The more than 1,500   basis points improvement in operating margin is particularly   impressive ,given our growth profile and the investments we're   making in our business. Given our strong first half revenue and   profitability performance and the numerous growth opportunities   we are targeting, our intention is to make incremental   investments in sales and marketing and R&D in the second half   of fiscal 2020. Net loss in the second quarter was $14.7 million   or $0.26 per share based on 55.6 million weighted average shares   outstanding. This compares to a loss of $0.34 per share on 51.2   million shares outstanding in the year ago period.",
    "Turning to the balance sheet and cash flow. We ended the   quarter with $436.6 million in cash, cash equivalents, short term   investments and restricted cash. Operating cash flow in the   second quarter was negative $12.6 million. After taking into   account -- after taking into consideration approximately $1.2   million in capital expenditures, free cash flow is negative $13.8   million for the quarter. This compares to negative free cash flow   of $18 million in the second quarter of fiscal 2019. We are   pleased with our cash flow performance year-to-date, but expect   to burn cash in the third and fourth quarter of fiscal 2020, as   we continue to make significant investments in the business. Also   given this year's stronger than expected Q2 cash flow   performance, Q2 may not be our peak quarter for negative cash   flow, as is typically the case.",
    "As a reminder, the continuing growth of Atlas as a percent of   our overall business impacts our reported financials in several   ways. First, Atlas revenues recorded on a consumption basis,   whereas Enterprise Advanced includes a term license component   that has recognized upfront. Second, Atlas has a lower overall   gross margin Enterprise Advanced because of its infrastructure   component. That said, on an apples-to-apples functionality basis,   Atlas is accretive to dollars of gross profit. Finally,   self-service at Atlas customers and a growing portion of our   direct sales Atlas customers pay us monthly in arrears versus   annually upfront for Enterprise Advanced. In other words, a   growing percentage of Atlas, which is an increasing portion of   our overall business does not involve an upfront cash payment nor   does it impact our deferred revenue balances. We believe that   offering customers the ability to pay as they go is a key benefit   of the cloud model. More broadly, we believe that continuing to   find ways to facilitate the ease of consumption will ultimately   maximize long term revenues and cash flow.",
    "I'd now like to turn to our outlook for the third quarter and   full fiscal year 2020. For the third quarter, we expect revenue   to be in the range of $98 million to $100 million. We expect   non-GAAP loss from operations to be negative $16.5 million to   negative $15.5 million and a non-GAAP net loss per share to be in   the range of negative $0.29 to negative $0.27 per share based on   56.4 million weighted average shares outstanding. As we have   mentioned on previous calls, our third quarter outlook reflects a   notably large compare from the third quarter of fiscal 2019, when   we signed a higher than usual number of multi-year Enterprise   Advanced contracts. As a reminder, under ASC 606, we recognized   the entire term license portion of a multi-year contract at the   outset, resulting in no recognition of additional term license   revenue at the beginning of each new subscription year of the   contract. Also, as discussed earlier, our results in the second   quarter also benefited from a few meaningful Enterprise Advanced   transactions that moved from Q3 to Q2.",
    "For the full fiscal year 2020, we now expect revenue to be in   the range of $390 million to $395 million compared to our   previous guidance of $375 million to $381 million. Please recall   the fourth quarter will be the first quarter, where we'll have   mLab in the base period. And as we've described before, we expect   continued deterioration in the revenue from former mLab   customers, both sequentially as well as year-over-year. This is   all in line with our original investment thesis. For the full   fiscal year 2020, we expect non-GAAP loss from operations to be   negative $62 million to negative $59 million and non-GAAP net   loss per share to be in the range of negative $1.11 to negative   $1.06 per share based on 55.9 million weighted average shares   outstanding. As mentioned previously, we see our strong start to   fiscal '20 as another indication of the size the opportunity   ahead of us and we will invest incrementally across our business   in the second half to further pursue that opportunity.",
    "To summarize MongoDB delivered excellent second quarter   results. We're executing well on our product and go-to-market   strategies, which is generating impressive growth at scale. We   believe our clear leadership is the modern general purpose data   platform of choice will enable us to continue delivering strong   growth going forward.",
    "And with that, we'd like to open up to questions.   Operator?",
    " Operator ",
    "Thank you, sir. [Operator Instructions] And first from   Barclays, we have Raimo Lenschow.",
    " Raimo Lenschow    --   Barclays -- Analyst ",
    "Hey congrats from me. Two questions, if I may. First Dev can   you talk, it doesn't happen often in software that kind of deals   get kind of pulled in or large deals are getting pulled in early.   Can you just talk a little bit about momentum in the quarter and   linearity, I mean, given that everyone is nervous, this sounds   like the opposite of it. Just talk to that, please.",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "I would say that this quarter was much like most other   quarters. There wasn't any changes in linearity. We typically put   a lot of rigor in our forecasting process. And so we have a   pretty good sense of how the core is looking. And obviously the   close to the quarter we get to the more -- even more visibility   we have. And I would say, our sales organization is quite   effective at closing deals and giving customers reasons for why   they should engage with us now versus later. And we feel good --   really good about that execution.",
    " Raimo Lenschow    --   Barclays -- Analyst ",
    "Yeah, well done. And then on Atlas, can you talk a little bit   about what you see on the different platforms like now that   you're kind of on the -- what does it mean that you're now on the   Microsoft Marketplace. You talked about it early good momentum   around Google. Like, just help us understand what's the   difference between like being on AWS versus being on the   marketplace, etc.?",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "Sure. And just for everyone's benefit. We started in 2016 on   AWS first and then a year later we added GCP and Azure. I would   say that -- obviously, I would say Atlas, the deployments of   Atlas in some ways mirrors the broader market share of the larger   cloud providers. That being said, I would say that we've been   really pleased with the traction we're getting with Google and   that's really starting to accelerate even though the partnership   we announced in May has not had a lot of time to gestate. But   activity level is very strong and we've closed a number of deals   with Google and the announcement we made with Microsoft basically   incentivizes their salespeople to basically get paid on Atlas   deals. Moreover, customers can get a unified bill when they buy   Atlas via the marketplace and they can apply their Azure   commitments toward Atlas, which means that they don't have to go   find other dollars to fund the workload on Atlas. So all know,   it's a win-win for the customer, win-win for Microsoft   salespeople and absolute win-win for us.",
    " Raimo Lenschow    --   Barclays -- Analyst ",
    "Perfect. Congrats. Thank you.",
    " Operator ",
    "And moving on, we will take Sanjit Singh with Morgan   Stanley.",
    " Sanjit Singh    --   Morgan Stanley -- Analyst ",
    "Thanks for taking questions. And congrats Dev and Michael on   an excellent first half. I wanted to pick up from MongoDB World   debut. You elicited a very ambitious vision around MongoDB data   platform. Could you speak to what needs to happen in terms of   evangelizing that type of story in terms of like the sales motion   specifically, typically in the database market we've seen   customers go for point functionality for specific capabilities.   What would be -- what needs to happen to sort of funnel that   demand to more of a consolidated play when we think about some of   the things that you're going after around data visualization   search and those types of -- and more analytical workloads on the   MongoDB platform. What needs to happen to trigger those buying   pattern?",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "Yeah. So I would say that while there have been a lot of point   solutions build for particular use cases, we increasingly hear   from customers that they just can't use a net new technology for   every net new workload, it doesn't scale, it's hard to get   everyone to learn all these new technologies, support and   maintain all of them. And it just adds a lot more costs. So the   degree to which that they can consolidate their infrastructure   under not necessarily only one platform, but a small number of   platforms that becomes more compelling to the customer. So I   would say, for example, our Full-Text Search capability basically   obviates the need for a customer to buy a disparate search engine   to complement their functionality on the database to basically   provide search functionality on their application. Conversely,   for the Data Lake capabilities, rather than having to learn a new   technology, make some big upfront investment, hire a very   specialized group of people, you can leverage the experience and   expertise of people that have on MongoDB and basically use the   Data Lake functionality to query data on S3, which is where most   people are storing their data today. So it really allows people   to -- it gives reason for people to use MongoDB for a broader and   broader set of use cases. And remember, the database is the heart   of every application. So unlike search, where there's some   vendors in the search space who have contemplated becoming a   database, they quickly realize that that was not something that   was very easy to do. They've -- they're now trending more toward   the op space and going after the systems managing market, where I   think with the database being the center of gravity, it's much   more natural for us to expand from the database to broaden our   set of use cases. And that's why we think as MongoDB becomes an   obvious choice for modern applications, our ability to expand our   use cases will be -- get better over time. And you see these   investments in the products that we're making.",
    " Sanjit Singh    --   Morgan Stanley -- Analyst ",
    "Great. That's very helpful. And Mike maybe one just quick   follow-up for you in terms of the pull forward impact of   Enterprise Advanced. Is there any way you can quantify what the   impact that was in terms of revenue or billings in the   quarter?",
    " Michael Gordon    --   Chief Operating Officer and Chief Financial Officer ",
    "Yeah. Not specifically in terms of a number, but I think the   key point here is, this ties to what we've talked about -- ever   since we adopted 606, it sort of increased variability and   reduced comparability quarter-to-quarter. And so I think what we   wanted to do is just have people understand that we had a couple   that sort of fell on the earlier side of the ledger relative to   where we were forecasting, and that helps put sort of Q3 in   context.",
    " Sanjit Singh    --   Morgan Stanley -- Analyst ",
    "Fair enough. Thank you for taking the question.",
    " Operator ",
    "And moving on, we have Brad Reback with Stifel.",
    " Brad Reback    --   Stifel -- Analyst ",
    "Great. Thank you very much. Dev, as you think about the   three-pronged go-to-market strategy you've laid out. How much   bigger do you think self-service can get than where it is   today?",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "We think we're just in the early innings of our self-serve   journey. If you remember, we really started this business with   the launch of Atlas and then we accumulated more expertise to the   mLab acquisition, because they built their business entirely   through self-serve. We finally feel that we have -- making   investments to really understand the levers that what drives   self-serve. We have -- now with lots of customers, over 13,000   customers at Atlas. We have a lot more understanding and   sophistication on product signals in terms of what customers may   be right for up-sell or cross-sell. But we still feel that we're   on the early innings of our journey there.",
    " Brad Reback    --   Stifel -- Analyst ",
    "Great. And then just one quick follow-up also on the   go-to-market side. Last quarter, you talked about very aggressive   recruiting efforts on the sell side. Can you tell us how the   hiring process is going? Thanks.",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "We've been very pleased. We've been hiring like mad. We have a   high bar and we will continue to be hiring because as I think   I've mentioned on many calls, given the size of the market, we   are constrained by the reach that we have. And so -- and in many   markets, we have very limited coverage. And so but just hiring   salespeople is not enough, you have to hire and make sure you   have the sales management leadership in place and you need to   make sure you have your recruiting infrastructure in place and   that once you hire them, you can ramp them and get them   productive as fast as possible. That's a big priority for us. We   are very happy with the number of people we recruited in the last   quarter, but there's a big push to do a lot of recruiting in Q3   and Q4.",
    " Brad Reback    --   Stifel -- Analyst ",
    "Great. Thanks very much.",
    " Operator ",
    "Moving on, we have Heather Bellini with Goldman Sachs.",
    " Daniel Church    --   Goldman Sachs -- Analyst ",
    "Hi, this is Dan Church on for Heather Bellini. Thanks for   taking my question. Last quarter, I think you mentioned roughly   about two-thirds of Atlas revenue is not reflected in deferred   revenue. I was just wondering how stable is that number been over   time? And do you expect that mix to change as you see increasing   enterprise adoption of Atlas?",
    " Michael Gordon    --   Chief Operating Officer and Chief Financial Officer ",
    "Yes. So I think the key thing there is we're trying to give a   point in time estimate for folks as opposed to quarterly metric   that we'd read out on. But I think in general, the direction will   be more of as we -- as I kind of shared in the prepared remarks,   more and more of Atlas will be on a monthly in arrears basis both   because of the self-serve growth as well as trying to make sure   that we are reducing any possible barriers to consumption and   making consumption as easy as possible, including monthly   invoicing for arrears for some enterprise customers for whom   that's important. So I think in general you'll continue to see   that be a relevant consideration and therefore some of the   deferreds, in other ways, that you tend to look at some companies   being increasingly less relevant, as it relates to analyzing   us.",
    " Daniel Church    --   Goldman Sachs -- Analyst ",
    "Thanks, helpful. Thank you. And as a quick follow-up, just I   believe last quarter you talked about some investments you are   making and expanding the channel ecosystem specifically with   system integrators. So any update or progress on traction there   and strategic investments or priorities for investment as we're   getting into the back half of the year?",
    " Michael Gordon    --   Chief Operating Officer and Chief Financial Officer ",
    "No things are remain the course. We're doing a lot of business   with the ESIs. I think we have relations with a number of them.   In fact, I just did a video testimonial with Infosys that was   published on LinkedIn. And we have relations with Accenture, with   Cap Gemini, a bunch of boutique players and other large systems   integrators. And obviously each system integrator has certain   expertise either in a particular geography or an industry or they   have specific account control and so we work well with them. And   the synergy there is that, in many cases, as we all know lot of   customers are constrained on development capacity and so where   the systems really can add value as being the development arm,   leveraging MongoDB and a more modern stack to help customers   drive innovation faster in the organization. And so we're   spending a lot of time enabling these integrators both at the   corporate level and at the field level and building more, more   proof points. And in some cases, you also see integrators   themselves build their own specific products, embedding MongoDB   in their technology. And so it's a multipronged effort.",
    " Daniel Church    --   Goldman Sachs -- Analyst ",
    "All right. Thank you.",
    " Operator ",
    "Next from Citi, we have Tyler Radke.",
    " Tyler Radke    --   Citi -- Analyst ",
    "Hey, thanks for taking my question. Could you talk about the   -- what you're seeing in terms of enterprise adoption of Atlas?   It sounds like you're not necessarily seeing enterprises come in   and to pay for a full year upfront necessarily, but maybe to some   comment on the use cases or traction that you're seeing in terms   of enterprise in Atlas? Thanks.",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "I would say that we're seeing actually strong demand for Atlas   in the enterprise. And in some cases, they'll actually commit   upfront for a certain amount of spend in a particular year over a   multi-year period and that's driven by either new workloads that   they're building and they want to just run in the cloud because   of a particular use case reasons or they're migrating, say, a   community workload on premise to the cloud because the cost   benefit of Atlas is that much more compelling. And so we're   seeing a lot of interest from very, very large organizations. I   think previously we talked about banks, insurance companies, tech   companies and so on so forth, all very, very interested in Atlas.   And we're really, really excited about the interest level. And   one of the other things that really surfaces in our discussions   with these large enterprises is our ability to run Atlas on   multiple clouds. So either they want to leverage specific   expertise or services capabilities with a particular cloud   provider or they want to make sure that they have a diversity of   workloads across different cloud providers. And so running that   on Atlas preserves their optionality because they can do that   very easily without having to rewrite the application.",
    " Tyler Radke    --   Citi -- Analyst ",
    "Thank you. And maybe a follow up for Michael. I appreciate all   the color around the moving parts of Q3 guidance, including the   multiyear deal that closed here in Q2 instead of Q3. Maybe as we   just think about the rest of the year, it does obviously look   like you're guiding Q3 to have revenue decelerate quite a bit   from Q2, which makes sense given the tough comp, but as we think   about Q4, is there anything we should be thinking about in terms   of a tough compare for multiyear deals or just anything to call   out, because the guidance does look like the decel is kind of   continuing into Q4? Thank you.",
    " Michael Gordon    --   Chief Operating Officer and Chief Financial Officer ",
    "Yeah, sure, yeah. So we had flagged this at the very beginning   of the year that the back half both Q3 and Q4 had tough compare.   So you're exactly correct. The Q3 compare was particularly driven   by some multiyear deals which we talked about, but the Q4 compare   was also very challenging Q4, fiscal '19 was an exceptionally   good quarter. So it's not appropriate to guide to replicating   that. We also called out at that time just to remind everyone   that there had been some customers on Atlas that were consuming   in excess of their run rate. We don't have enough data or enough   history on Atlas to know if that's kind of truly seasonal   behavior. And so we're not counting on that either. But I think   fundamentally, Q2 was very strong. We're obviously raising our   guidance more than the beat and it really reflects the underlying   health of the business. And then the last thing that we've talked   about consistently for the last couple of quarters. We just want   to underscore is, Q4 is the first time we hit the mLab   anniversary. And while that business is performing well relative   to our investment thesis, the underlying cohorts are declining.   And so that obviously creates sort of a year-over-year headwind   when you look at sort of the growth comparison.",
    " Tyler Radke    --   Citi -- Analyst ",
    "Thank you.",
    " Operator ",
    "[Operator Instructions] And next, we move on to Jason Ader   with William Blair.",
    " Jason Ader    --   William Blair -- Analyst ",
    "Yeah, thank you. Hi, guys. Just wanted to address the   competitive landscape, if you would. Specifically relative to   Amazon and any feedback you're hearing from customers on document   DB? And then maybe any other comments on win rates against legacy   guys and what you're seeing just broadly speaking   competitively?",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "We feel really good about the business. I mean obviously,   Amazon has a large reach, but I think as we spent time on   previous calls, they've tried to emulate MongoDB using a very   different architecture. So that has severe consequences in terms   of both features as well as performance, and we've heard in many   situations where customers have tried to use document DB and it   has really been right for their use case. And so we don't see any   headwinds in terms of competition. It is a big market. There's   lots of people out there. But we feel really good about a   competitive differentiation, as evidenced by our growth rates, as   evidenced by some of the most sophisticated customers in the   world are choosing MongoDB, for some very, very mission critical   workloads. And they don't have lack of access to options. And   then -- and we feel really good about our positioning.",
    " Jason Ader    --   William Blair -- Analyst ",
    "Okay, great. And then a quick follow-up for Michael, you just   talked about the Enterprise Advanced deals that you had in the   quarter. I'm assuming these were larger companies. Do you have   any metric that you track in terms of how much of your business   is, let's say, with Global 2000 customers or something to that   effect?",
    " Michael Gordon    --   Chief Operating Officer and Chief Financial Officer ",
    "That's not something that we have that we sort of publicly   report on. I'm trying to figure if there was anything that we   have that would be useful that that we have disclosed. But I'll   try and keep it--",
    " Jason Ader    --   William Blair -- Analyst ",
    "Do you have a rough idea of how much of your business is,   let's call it, enterprise versus more mid-market?",
    " Michael Gordon    --   Chief Operating Officer and Chief Financial Officer ",
    "So certainly, if you separate the business into the self sold   side and self service side. Within the self sold side, the   majority is coming from larger enterprises. The mid-market team   is newer and we've been scaling that more recently. The product   market fit within Atlas is particularly strong on that team, and   that's actually the area that my comments earlier about sort of   ease of adoption and less comfortable making annual payments   advances, much more to mid-market that we see that. And so that's   been growing. But the majority is on the large enterprise side   within self sold.",
    " Jason Ader    --   William Blair -- Analyst ",
    "Thank you.",
    " Operator ",
    "Okay and moving on, we have Patrick Walravens from JMP   Securities.",
    " Joey Marincek    --   JMP Securities -- Analyst ",
    "Hi, this is Joey on for Pat. Thank you for taking our   question. We are wondering about the difference between selling   more databases into an existing customer compared to selling apps   and how specifically does that manifest itself in a net dollar   expansion rate? Thank you.",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "Well, I'm not sure, I completely understood the details of   your question. But let me try and take a stab at answering it. So   unlike an app say like Workday or Salesforce, if you add more   employees and more salespeople, the cost of sale is quite low   because the customer will just say, hey, I need X number of new   seats or licenses for these additional people that I've hired.   Whereas for database software, while we have some applications   that grow very quickly organically, most of the growth in an   account is by adding new workflows or new apps. And so there may   be a different team, a different decision maker and so on and so   forth involved in those decisions. Obviously, as the more   momentum we have in account, the easier the next workload   becomes. But that tends to be a different buying cycle than just   someone adding seats or licenses for expanding an existing   application. And so the benefit is that we're never locked out of   account. So it's not like SAP versus Workday, where someone has   made a big commitment to SAP, the Workday salesperson says what   I'm not going to be able to sell anything to this customer for   the next three years. That's -- so this is not a winner take home   market. And in terms of our net expansion rates, our net   expansion rates are really strong, because once we get into an   account, I think we've talked at the IPO and in every quarter, we   have a land expand business. And so once we get into an account,   database software is very sticky and they see value in it. They   typically find other reasons to use our software for other use   cases. But as I said, the buying motion is a little   different.",
    " Michael Gordon    --   Chief Operating Officer and Chief Financial Officer ",
    "I think the other thing just to sort of get to the last part   of the question is because the market is so large, the expand   portion sort of goes on longer. And so that's very additive to   the net ARR expansion rates. And so if you think about very   simplistically, we talked about this in the context of the IPO,   the Fortune 100, which obviously we're addressing a much larger   universe than that. But just illustratively it's helpful to   understand, we had just over half of the Fortune 100 customers.   So the best we could do in terms of raw customer count is sort of   not quite double within that universe of customers and   directionally we had less than 1% of their spend, right. So the   upside on the expand part was quite significant given what a   small wallet share we have relative to the very large TAM. So   that puts it somewhat in context.",
    " Joey Marincek    --   JMP Securities -- Analyst ",
    "Yeah, that's really helpful. Thank you so much and congrats on   the quarter.",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "Thank you.",
    " Operator ",
    "And next, we have Jack Andrews with Needham.",
    " Unidentified Participant ",
    "Hi, gentlemen. It's [Indecipherable] for Jack this afternoon.   Thanks for taking my question. MongoDB World, you mentioned that   some customers could see an increase in customer size due to   Full-Text Search. Can you provide an update on the changes you're   seeing in customer size due to this feature? And what's the   potential TAM of existing customers that may end up using   Full-Text Search?",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "Yeah. I should remind you that we're still in a beta roll out.   So the product is not [Indecipherable] but we have a number of   customers who are now using or testing or trialing Full-Text   Search and the feedback has been quite positive. I think it's a   little early to start giving you some sense of like what the   incremental growth is of each customer. It really depends on the   application. And in terms of the applicability of Full-Text   Search in our market is very high. So if you think about it what   application today doesn't have some embedded search functionality   in it. So we think the cross-sell opportunities are quite   large.",
    " Unidentified Participant ",
    "Thanks, that's helpful. And how should we think about today   like featuring the displacement opportunity for like a cloud   based HADOOP system and where are some of the benefits of using   your Atlas Data Lake versus other systems?",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "Right. So I would say the -- we think that the Atlas Data Lake   is awesome solution for people who are constantly using HADOOP   technologies, because as I mentioned in the prepared remarks,   there's not a huge upfront investment required. There's not a   need to hire some specialized skills. And the time to value is   not very long. In fact you can get up and running very, very   quickly because you can just very easily query and parse the data   that you've stored in S3. And so we think the opportunity there   is incredibly high. And I think the advantage also is that if you   already have existing MongoDB skills, there's not new technology   that you have to learn. So it becomes very easy for developers   and others to basically query data using a semantic language that   they're very comfortable in using. And so in terms of competitive   offerings, we feel like -- we think about the most common data   format today for modern data is JSON, who better to really query   and manage JSON data than MongoDB, which is -- architecture is   built around supporting JSON. And so we think we're very well   positioned to go after this market, given our expertise in   managing modern data.",
    " Unidentified Participant ",
    "Great. Thank you.",
    " Operator ",
    "Next, we have Brent Bracelin with KeyBanc Capital Markets.",
    " Clarke Jeffries    --   KeyBanc Capital Markets -- Analyst ",
    "Hi, this is Clarke on for Brent. Just going to the comments   about the mid-market customers that are really building their   business around MongoDB. Is there any kind of description you   could kind of qualify what those customers look like? Are they   very digital first or are they conducting their business   primarily through an e-commerce channel. Just some sort of way to   understand what that kind of business and what those customers   look like today?",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "Yeah, sure. I mean, they're clearly digital first companies.   They're potentially a start-up that's grown into a kind of   mid-market state, but growing very, very quickly. They're very   technology savvy and the business is very technology intensive.   It could be e-commerce. It could be gaming. It could be new   business models. And they basically potentially in the machine   learning and the AI space. So those companies if their business   is really taking off, they can -- their needs in terms of support   and service tend to look much like a potentially a large   enterprise, just given the sophistication and complexity of their   environment. And so the advantage we have is that, we just   haven't built a mid-market channel. We've built also a high end   enterprise channel. And so depending on that customer's needs, we   can mix and match the right channel for the right customer. And   that gives us real flexibility in terms of how to service these   very sophisticated customers.",
    " Clarke Jeffries    --   KeyBanc Capital Markets -- Analyst ",
    "Great. And are you seeing them or would you anticipate those   to be probably target customers for these add-on offerings for   parsing the JSON data because they might have more of their core   operations within MongoDB? Just trying to understand whether   you're seeing early signs of -- they're not going to another   vendor for analytical or operational understanding of their   business. They're keeping it all with an ecosystem. And that's it   from me. Thank you.",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "Yeah, they're definitely great candidates and some of them may   have already implemented some third-party solution, but they're   still great candidates for us to talk to. These customers always   tend to be evaluating different options. And so but it's again   quite early for our Data Lake product and our Full-Text Search   product data. But we're very, very pleased with the kind of   enthusiastic response that we're seeing.",
    " Operator ",
    "Okay. And moving on to the next question, from Oppenheimer we   have Vinod Srinivasaraghavan.",
    " Vinod Srinivasaraghavan    --   Oppenheimer -- Analyst ",
    "Hi, how are you guys? I have two questions. First, I want to   dig into the expansion rate dynamics a bit. Has your expansion   rate moved up or down materially, sequentially?",
    " Michael Gordon    --   Chief Operating Officer and Chief Financial Officer ",
    "Yeah. So it's consistently been, I think it's now 18 quarters   that we've said, that it's over 120%. Quarter-to-quarter, there's   some quarters where you see more new logo activity relative to   expansion from existing customers and other quarters where you   see it slightly tip the other way. But I would say we've very   consistently had both strong new logo growth and expansion of   existing customers.",
    " Vinod Srinivasaraghavan    --   Oppenheimer -- Analyst ",
    "Okay, and just one more. How many customers are above one   million in ARR now?",
    " Michael Gordon    --   Chief Operating Officer and Chief Financial Officer ",
    "So we haven't given that number since the -- we give that   number typically annually. I think when we ended Q4 of last year,   that was at 39 million -- 39 customers over a million, excuse me,   39 customers over a million. But that's not a number we update   quarterly.",
    " Vinod Srinivasaraghavan    --   Oppenheimer -- Analyst ",
    "Got it. All right. Congrats on the quarter.",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "Thank you.",
    " Michael Gordon    --   Chief Operating Officer and Chief Financial Officer ",
    "Thanks.",
    " Operator ",
    "All right, ladies and gentlemen, it does appear that that does   conclude our question-and-answer session of the call. I'd like to   turn the floor back to CEO, Dev Ittycheria, for additional or   closing remarks.",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    "Thank you again for joining our second quarter       earnings call    . We really appreciate the interest and the support. And as I   mentioned upfront, we're really pleased about the quarter and we   feel like we have -- we're well positioned to go after a big   opportunity. Thank you.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 49 minutes ",
    " Brian Denyeau    --   ICR, Investor Relations ",
    " Dev Ittycheria    --   President and Chief Executive Officer ",
    " Michael Gordon    --   Chief Operating Officer and Chief Financial Officer ",
    " Raimo Lenschow    --   Barclays -- Analyst ",
    " Sanjit Singh    --   Morgan Stanley -- Analyst ",
    " Brad Reback    --   Stifel -- Analyst ",
    " Daniel Church    --   Goldman Sachs -- Analyst ",
    " Tyler Radke    --   Citi -- Analyst ",
    " Jason Ader    --   William Blair -- Analyst ",
    " Joey Marincek    --   JMP Securities -- Analyst ",
    " Unidentified Participant ",
    " Clarke Jeffries    --   KeyBanc Capital Markets -- Analyst ",
    " Vinod Srinivasaraghavan    --   Oppenheimer -- Analyst ",
    " More MDB analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than MongoDB     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and MongoDB wasn't   one of them! That's right -- they think these 10 stocks   are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends MongoDB. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:23:33"
}