{
  "url": "https://www.nasdaq.com/article/noteworthy-wednesday-option-activity-twlo-pep-zgnx-cm1207517",
  "title": "Noteworthy Wednesday Option Activity: TWLO, PEP, ZGNX - Nasdaq.com",
  "text": [
    "Looking at  options trading  activity among components of the Russell 3000 index, there is noteworthy activity today in Twilio Inc (Symbol: TWLO), where a total volume of 22,725 contracts has been traded thus far today, a contract volume which is representative of approximately 2.3 million underlying shares (given that every 1 contract represents 100 underlying shares). That number works out to 73.3% of TWLO's average daily trading volume over the past month, of 3.1 million shares. Particularly high volume was seen for the $115 strike put option expiring October 18, 2019  , with 1,244 contracts trading so far today, representing approximately 124,400 underlying shares of TWLO. Below is a chart showing TWLO's trailing twelve month trading history, with the $115 strike highlighted in orange:       makeArticleAd();    PepsiCo Inc (Symbol: PEP) saw options trading volume of 27,333 contracts, representing approximately 2.7 million underlying shares or approximately 68.2% of PEP's average daily trading volume over the past month, of 4.0 million shares. Especially high volume was seen for the $130 strike call option expiring September 20, 2019  , with 4,824 contracts trading so far today, representing approximately 482,400 underlying shares of PEP. Below is a chart showing PEP's trailing twelve month trading history, with the $130 strike highlighted in orange:       And Zogenix Inc. (Symbol: ZGNX) saw options trading volume of 3,986 contracts, representing approximately 398,600 underlying shares or approximately 63.2% of ZGNX's average daily trading volume over the past month, of 630,255 shares. Particularly high volume was seen for the $55 strike call option expiring April 17, 2020  , with 2,500 contracts trading so far today, representing approximately 250,000 underlying shares of ZGNX. Below is a chart showing ZGNX's trailing twelve month trading history, with the $55 strike highlighted in orange:         For the various different available expirations for TWLO options  , PEP options  , or ZGNX options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 03:25:14"
}