{
  "url": "https://www.nasdaq.com/article/zimbabwe-state-doctors-strike-over-pay-as-economy-struggles-20190903-00884",
  "title": "Zimbabwe state doctors strike over pay as economy struggles - Nasdaq.com",
  "text": [
    "By Alfonce and Mbizwo",
    "HARARE, Sept 3 (Reuters) - Zimbabwean public sector doctors went on strike on Tuesday for the second time in less than a year to demand a further salary increase amid soaring living costs, as President Emmerson Mnangagwa's government struggles with a deteriorating economy.",
    "Zimbabwe is mired in its worst economic crisis in a decade, with triple-digit inflation, rolling power cuts and shortages of U.S. dollars, basic goods, medicines and fuel that have revived memories of the hyperinflation that forced it to ditch its currency in 2009.",
    "The main unions representing doctors and teachers, who make up the bulk of public service workers, said they had rejected the government's salary offers, which would see the lowest paid worker earning 1,023 Zimbabwe dollars ($90.45) a month.",
    "The doctors accepted their 60% pay increase but said it was not sufficient to avert the strike action. The teachers are not currently on strike.",
    "The doctors are looking for another 401% pay hike that they want indexed to the U.S. dollar.",
    "\"We met with the government representatives yesterday and they promised to expedite other allowances for health personnel but so far it has just been empty promises,\" the head of the Zimbabwe Hospital Doctors Association (ZHDA), Peter Magombeyi, told Reuters.",
    "\"They have taken us for granted for too long, but we are ready to go back to work as soon as they offer us something tangible, which has not been forthcoming so far.\"",
    "\"ASSESSING THE SITUATION\"",
    "At the turn of the year, junior doctors held a 40-day strike for better pay and conditions that crippled public hospitals. It ended without a deal being reached and with doctors threatening further stoppages.",
    "Most junior doctors stayed away on Tuesday at the largest two public hospitals, Parirenyatwa and Harare Central, a Reuters witness said.",
    "A few junior doctors turned up to work, but said they would not report for work on Wednesday. Some senior doctors also said they would join the strike on Wednesday.",
    "\"Today we were assessing the situation but we are not coming in tomorrow. The strike will be in full swing,\" a junior doctor at Harare Central Hospital told Reuters.",
    "The Health Services Board (HSB), which represents the government, said in a statement late on Monday that it was surprised the doctors were taking strike action despite accepting the earlier pay offer.",
    "ZHDA wants wages, which were previously pegged to the U.S. dollar, to be paid at the prevailing inter-bank market rate and says its members can no longer afford to report for duty due to surging inflation and the deterioration in the economy.",
    "Their current salaries are worth less than 10% of what they were before the peg was scrapped due to high inflation.",
    "On Tuesday, the Zimbabwe dollar traded at 11.31 against the U.S. dollar in the interbank market and 13.10 in the black market. Both rates are used to buy goods.",
    "($1 = 11.31 Zimbabwe dollars)"
  ],
  "published_datetime": "2019-09-03 06:39:00"
}