{
  "url": "https://www.nasdaq.com/article/how-a-credit-card-loans-fast-and-easy-cash-can-cost-you-cm1206789",
  "title": "How a Credit Card Loan’s Fast and Easy Cash Can Cost You - Nasdaq.com",
  "text": [
    " Credit card companies want to turn your unused credit line   into cash that you can borrow for things like home improvements   or unexpected expenses. But accepting this loan offer may not be   the best choice for your wallet or your credit score. In recent months, two of the largest credit card issuers, Citi   and Chase, have announced they'll offer credit card loans to   eligible cardholders. Citi is offering its Citi Flex Loan, while   Chase plans to launch   My Chase Loan    in late 2019. The new products appear to be aimed at taking a share of the   ballooning market for personal loans, which hit a record $143   billion in the first quarter of 2019, according to credi   t report    ing agency TransUnion, an increase of 19.2% year over year.makeArticleAd(); Credit card loans are fast, convenient and cheaper than cash   advances. But personal finance experts say the loans are still   costly and can lower your credit scores, making it more difficult   to obtain credit with low interest rates in the future. Before you accept this seemingly simple way to get cash,   consider the risks and compare your alternatives. How a credit card loan works Citi and Chase customers don't have to request a loan - or   even apply. The companies are promoting their \"flexible financing   offering\" or new \"loan feature\" via email, direct mail or on   account log-in pages. \"It's very tempting because it's so fast and easy, with no   application,\" says David Rae, a certified financial planner based   in Los Angeles. \"If you're already in debt, it can cause that   debt to snowball and become a big problem.\" The amount you can borrow depends on how much credit line you   have available. Once you choose a loan amount and repayment term,   the issuer transfers the cash to your bank account within a   couple of days. Citi will alternatively mail a check. The loans have payback terms of one to five years, and monthly   repayments are added to your card's minimum payment due. Citi and   Chase say they report payments to the credit bureaus as credit   card payments, not as separate loan payments. Having different types of credit on your reports can   positively affect your scores. In this case, \"there's no added   benefit to your credit score, beyond just having a credit card   and making a payment,\" Rae says. You can continue using your credit card, but you'll want to   track your balance and stay under the credit limit to avoid   costly fees. You also won't get cash back, miles or points with   the Citi or Chase loan. The costs and risks Rae advises the loans should only be considered for emergency   expenses if you don't have savings, rather than discretionary   purchases. \"If you're trying to book a vacation or shopping for clothes,   I wouldn't recommend this product,\" he says. Credit card loans may cost less than cash advances, but they   aren't cheap. Citi Flex Loans carry annual percentage rates that range from   7.99% to 8.99%, while My Chase Loan offers vary from 16.99% to   22.24% APR for borrowers with excellent FICO credit scores (over   720). For example, a five-year, $5,000 Citi Flex Loan at 8.99% APR   would have monthly payments of $104 and total interest of   $1,226. Taking the loan also increases your   credit utilization rate    - how much of your credit limit is used. Most financial experts   recommend keeping your total utilization below 30%. This loan can push you above that threshold and lower your   credit score, says Bruce McClary, spokesperson for the National   Foundation for Credit Counseling. Compare alternatives Whenever you borrow, compare interest rates on multiple loan   options and consider features that build your credit or offer   flexible payment schedules.   Personal loans      may offer lower rates, especially if you have excellent credit,     and higher loan amounts. They also show up as separate accounts     on your credit reports, helping to diversify your accounts and     indicate you can handle different types of credit, ultimately     lifting your scores. If you qualify, a     0% APR credit card      is an interest-free loan, as long as you pay the balance before     the introductory offer period ends. Also, you may earn cash     back or travel rewards with this credit card.  \"If you're able to get a credit card with no interest, and you   pay it off within the time frame, you're going to be way better   off financially,\" Rae says.  This article was written by NerdWallet and was originally     published by The Associated Press.    More From NerdWallet    Fall in Love With Your Car Again Without         Breaking the Bank   How Student Loan Fees Work and What They         Cost   Will a Summer Job Burn Your Financial Aid         for College?      Steve Nicastro is a writer at NerdWallet. Email:       steven.n@nerdwallet.com. Twitter: @StevenNicastro.   The article How a Credit Card Loan's Fast and Easy Cash Can   Cost You originally appeared on NerdWallet. ",
    "Credit card companies want to turn your unused credit line   into cash that you can borrow for things like home improvements   or unexpected expenses. But accepting this loan offer may not be   the best choice for your wallet or your credit score.",
    "In recent months, two of the largest credit card issuers, Citi   and Chase, have announced they'll offer credit card loans to   eligible cardholders. Citi is offering its Citi Flex Loan, while   Chase plans to launch   My Chase Loan    in late 2019.",
    "The new products appear to be aimed at taking a share of the   ballooning market for personal loans, which hit a record $143   billion in the first quarter of 2019, according to credi   t report    ing agency TransUnion, an increase of 19.2% year over year.",
    "Credit card loans are fast, convenient and cheaper than cash   advances. But personal finance experts say the loans are still   costly and can lower your credit scores, making it more difficult   to obtain credit with low interest rates in the future.",
    "Before you accept this seemingly simple way to get cash,   consider the risks and compare your alternatives.",
    "Citi and Chase customers don't have to request a loan - or   even apply. The companies are promoting their \"flexible financing   offering\" or new \"loan feature\" via email, direct mail or on   account log-in pages.",
    "\"It's very tempting because it's so fast and easy, with no   application,\" says David Rae, a certified financial planner based   in Los Angeles. \"If you're already in debt, it can cause that   debt to snowball and become a big problem.\"",
    "The amount you can borrow depends on how much credit line you   have available. Once you choose a loan amount and repayment term,   the issuer transfers the cash to your bank account within a   couple of days. Citi will alternatively mail a check.",
    "The loans have payback terms of one to five years, and monthly   repayments are added to your card's minimum payment due. Citi and   Chase say they report payments to the credit bureaus as credit   card payments, not as separate loan payments.",
    "Having different types of credit on your reports can   positively affect your scores. In this case, \"there's no added   benefit to your credit score, beyond just having a credit card   and making a payment,\" Rae says.",
    "You can continue using your credit card, but you'll want to   track your balance and stay under the credit limit to avoid   costly fees. You also won't get cash back, miles or points with   the Citi or Chase loan.",
    "Rae advises the loans should only be considered for emergency   expenses if you don't have savings, rather than discretionary   purchases.",
    "\"If you're trying to book a vacation or shopping for clothes,   I wouldn't recommend this product,\" he says.",
    "Credit card loans may cost less than cash advances, but they   aren't cheap.",
    "Citi Flex Loans carry annual percentage rates that range from   7.99% to 8.99%, while My Chase Loan offers vary from 16.99% to   22.24% APR for borrowers with excellent FICO credit scores (over   720).",
    "For example, a five-year, $5,000 Citi Flex Loan at 8.99% APR   would have monthly payments of $104 and total interest of   $1,226.",
    "Taking the loan also increases your   credit utilization rate    - how much of your credit limit is used. Most financial experts   recommend keeping your total utilization below 30%.",
    "This loan can push you above that threshold and lower your   credit score, says Bruce McClary, spokesperson for the National   Foundation for Credit Counseling.",
    "Whenever you borrow, compare interest rates on multiple loan   options and consider features that build your credit or offer   flexible payment schedules.",
    "\"If you're able to get a credit card with no interest, and you   pay it off within the time frame, you're going to be way better   off financially,\" Rae says.",
    " This article was written by NerdWallet and was originally     published by The Associated Press. ",
    "  More From NerdWallet    Fall in Love With Your Car Again Without         Breaking the Bank   How Student Loan Fees Work and What They         Cost   Will a Summer Job Burn Your Financial Aid         for College?   ",
    " More From NerdWallet ",
    "  Steve Nicastro is a writer at NerdWallet. Email:       steven.n@nerdwallet.com. Twitter: @StevenNicastro.  ",
    " Steve Nicastro is a writer at NerdWallet. Email:       steven.n@nerdwallet.com. Twitter: @StevenNicastro. ",
    "Steve Nicastro is a writer at NerdWallet. Email:       steven.n@nerdwallet.com. Twitter: @StevenNicastro.",
    "The article How a Credit Card Loan's Fast and Easy Cash Can   Cost You originally appeared on NerdWallet.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:47:25"
}