{
  "url": "https://www.nasdaq.com/article/gold-silver-surge-after-weak-us-data-compounds-slowdown-fears-20190903-00912",
  "title": "Gold, silver surge after weak U.S. data compounds slowdown fears - Nasdaq.com",
  "text": [
    "By Asha Sistla",
    "Sept 3 (Reuters) - Gold rose more than 1% on Tuesday after weak manufacturing data from the United States reinforced fears of an economic downturn, while uncertainties over U.S.-China trade ties and Brexit further boosted bullion's safe-haven appeal.",
    "Meanwhile, silver  followed gold's rally and rose 3.7% while breaching the $19 mark for the first time since October 2016 at $19.14 per ounce.",
    "U.S. gold futures  settled up 1.7% to $1,555.90.",
    "Renewing fears of a sharp economic slowdown and weighing on risk sentiment, U.S. manufacturing activity contracted for the first time in three years in August. MKTS/GLOB",
    "Weak manufacturing data \"will further embolden the view that the U.S. Federal Reserve is going to need to be aggressive with rate cuts,\" said Ryan McKay, a commodity strategist at TD Securities.",
    "\"Equities are on the back foot, that's what's keeping gold higher. There's a lot of uncertainty on the Brexit front, politics in Italy, protests in Hong Kong as well - a lot of stuff that's positive for gold.\"",
    "Gold also shook off mild pressure from the dollar earlier in the session, with the U.S. unit holding gains versus other major currencies. USD/",
    "\"Dollar is also being seen as a safe-haven asset ... Even Treasuries are up, dollar is up, silver is up, gold is up - it's all the safe-haven assets up together,\" said Phillip Streible, senior commodities strategist at RJO Futures.",
    "Meanwhile, European currencies such as the euro and pound have dipped against the dollar as traders remain wary of developments surrounding Britain's potentially imminent exit from the European Union and Italy's political turmoil.",
    "In Britain, lawmakers began a bid to stop Prime Minister Boris Johnson from pursuing a no-deal Brexit. ",
    "On the trade front, China has lodged a complaint at the World Trade Organization over U.S. import duties, trashing the latest tariff actions as violating the consensus reached by leaders of both countries at a meeting in Osaka. ",
    "\"Gold has aggressively priced in Fed rate cuts. With little opportunity cost in holding gold and growing economic uncertainty tied to escalating U.S.-China trade tensions, investor appetite for the yellow metal has grown,\" BNP Paribas analysts wrote in a note, forecasting average gold prices to climb above $1,600 driven by the Fed's monetary easing cycle.",
    "Federal fund futures  implied traders saw a 91% chance of a 25 basis-point rate cut by the U.S. Federal Reserve this month.",
    "Meanwhile, platinum  rose 2.3% to $951.35 per ounce after reaching $956.99, its highest since March 2018. Palladium  was up 0.2% at $1,533.70 per ounce."
  ],
  "published_datetime": "2019-09-03 11:52:00"
}