{
  "url": "https://www.nasdaq.com/article/facebook-could-pay-roughly-6-billion-to-acquire-yelp-cm1207675",
  "title": "Facebook Could Pay Roughly $6 Billion To Acquire Yelp - Nasdaq.com",
  "text": [
    "Per Trefis estimates, Facebook ( FB  ) could potentially pay around $5.8 billion to acquire Yelp ( YELP  ) (a figure more than double its current market cap), and still be able to accrue billions of dollars in value for its own shareholders. We detail the rationale behind  Facebook potentially acquiring Yelp   in an interactive dashboard, along with our workings for the estimated acquisition price. Our estimate is based on the Yelp's intrinsic value and the value of revenue and cost synergies from an acquisition. Considering Yelp is much smaller than Facebook, most of the synergies are likely to arise from Yelp getting access to a larger user base at superior unit economics (EBITDA / user).",
    "You can modify any of the key drivers to visualize the impact of changes on the company's share price estimate. Additionally, you can see more Trefis technology company data here  .",
    " Why we think Facebook could acquire Yelp ",
    " A Quick Look at Key Operating Metrics For Yelp vs.   Facebook ",
    "As of 2018, the following is how Yelp's Key Metrics compared with Facebook:",
    " * Note : In its SEC filings, Yelp discloses that \"App users   generate a substantial majority of activity on Yelp,\" which is   why we use the number of disclosed App users to determine the   ARPU. While Yelp generates a small portion of its revenues from   unregistered users accessing its webpage through mobiles or   desktops, we believe that a combined figure for total users   (adjusted for duplication) is not representative of   revenue-driving active users , and will dilute the ARPU figure   considerably. ",
    " What Factors Will Unlock Value for Investors? ",
    "If Facebook acquires Yelp, we expect synergies to materialize from:",
    " How Much Value Can Potentially Be Unlocked? ",
    "What's behind Trefis? See How It's Powering New Collaboration and What-Ifs",
    "For CFOs and Finance Teams   | Product, R&D, and Marketing Teams ",
    " More Trefis Research    Like our charts? Explore example interactive dashboards   and create your own.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 01:20:27"
}