{
  "url": "https://www.nasdaq.com/article/a-foolish-take-investors-are-getting-scared-cm1206880",
  "title": "A Foolish Take: Investors Are Getting Scared - Nasdaq.com",
  "text": [
    "You'd think that by now, investors would be used to the ups and downs of the stock market . Yet even though the returns that most major indexes have produced over the past 10 years have been nothing short of amazing, sometimes all it takes is a single piece of concerning news to send investors into a near-panic.",
    "One way to gauge how ordinary investors are reacting to current events and market conditions is by looking at the American Association of Individual Investors and its weekly survey of market sentiment. Thousands of members have the opportunity every week to answer whether they believe that the stock market will be higher, lower, or roughly in the same place six months from now.",
    "As you can see below, the survey results over the past couple of months have seen a decided shift toward fear about the future direction of the market.",
    "Data source: American Association of Individual Investors. Chart by author. Note: Numbers don't add to 100% because chart omits neutral responses.",
    "Throughout much of 2019, the stock market has made its biggest moves in response to developments in trade negotiations between the U.S. and China. In early August, the Trump administration decided to impose new tariffs on another $300 billion in imported Chinese goods, killing hopes that the two nations would find a quicker solution to their dispute. That led to an abrupt shift in sentiment and raised fears of a possible recession.",
    "Many of the biggest drops in stock market history have happened in September and October, including the crashes in 1929 and 1987, as well as much of the drop associated with the financial crisis in 2008. It's therefore unsurprising to see investors ratchet down their expectations as the autumn months approach.",
    "Yet the good news for those watching the AAII numbers is that the sentiment indicators have largely become a contrarian sign. When bearish sentiment is at its highest, markets tend to react positively, and it's only when investors get the most optimistic that they find themselves vulnerable to downturns. Of course, anything can happen in the span of a month or two, but market participants already know about many of the dangers they face and can plan accordingly to protect themselves and their portfolios .",
    "Offer from The Motley Fool: The 10 best stocks to buy now Motley Fool co-founders Tom and David Gardner have spent more than a decade beating the market. In fact, the newsletter they run, Motley Fool Stock Advisor , has quadrupled the S&P 500!*",
    "Tom and David just revealed their ten top stock picks for investors to buy right now.",
    "Click here to get access to the full list!",
    "* Stock Advisor returns as of June 1, 2019.",
    "The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:03:00"
}