{
  "url": "https://www.nasdaq.com/article/gm-ceo-barra-set-to-hold-white-house-meetings-thursday-with-trump-20190904-01185",
  "title": "GM CEO Barra set to hold White House meetings Thursday with Trump - Nasdaq.com",
  "text": [
    "By David Shepardson",
    "WASHINGTON, Sept 4 (Reuters) - General Motors  Chief Executive Mary Barra will meet with U.S. President Donald Trump and White House officials on Thursday -- just days after GM came under attack from Trump, the White House confirmed late Wednesday.",
    "Reuters reported earlier that the pair would discuss issues including trade, ongoing contract talks and revising vehicle fuel efficiency standards, citing three people briefed on the matter. The White House confirmed Trump would meet with Barra at 1:45 p.m. EDT in the Oval Office.",
    "GM declined to comment Wednesday on the meetings, which come as the largest U.S. automaker has had contentious relations with Trump over the last year.",
    "Last week, Trump suggested GM should begin moving operations back to the United States from China. \"They moved major plants to China, BEFORE I CAME INTO OFFICE.... Now they should start moving back to America again?\" Trump said on Twitter.",
    "GM did not directly comment on Trump's tweet last week but said its China operations \"are not a threat to U.S. jobs.\"",
    "Trump's ire with GM comes as contract talks between the United Auto Workers union and Detroit Three automakers intensify ahead of a Sept. 14 contract expiration. This week, the UAW selected GM as its initial target to reach a deal.",
    "GM's decision to close four plants in the United States is a central issue in the contract talks.",
    "Trump has made boosting auto jobs a key priority and has often attacked automakers on Twitter for not doing enough to boost U.S. employment.",
    "Trump has previously attacked GM for building vehicles in Mexico and for ending production at plants in Michigan, Ohio and Maryland. He has threatened to cut GM subsidies in retaliation  and in June rejected a request to waive tariffs on Chinese-made Buick Envisions.",
    "But Trump praised GM for entering talks to sell an idled northeast Ohio plant to a cash-strapped electric truck-building company.",
    "Trump has also warned GM not to join Ford Motor Co  and three other automakers in backing a voluntary deal with California for stricter fuel economy standards than the Trump administration has proposed.",
    "GM has not backed the agreement, arguing that it does not properly credit the company's electric vehicles. Even so, Trump tweeted last month the founders of Ford and GM were \"'rolling over' at the weakness of current car company executives\" in the face of fuel efficiency rules."
  ],
  "published_datetime": "2019-09-04 06:56:00"
}