{
  "url": "https://www.nasdaq.com/article/tsx-falls-as-factory-activity-slows-energy-stocks-weigh-20190903-00813",
  "title": "TSX falls as factory activity slows; energy stocks weigh - Nasdaq.com",
  "text": [
    "Sept 3 (Reuters) - Canada's main stock index fell on Tuesday as domestic manufacturing activity slowed in August amid global trade worries, while a sharp slide in oil prices weighed on energy shares.",
    "* At 9:32 a.m. ET (13:32 GMT), the Toronto Stock Exchange'sS&P/TSX composite index  was down 50.89 points, or 0.31%, at 16,391.18.",
    "* IHS Markit data showed, a measure of new orders fell to the lowest since December 2015, while the output index was in contraction for the fifth straight month and a measure of business optimism dropped to a three-and-a-half year low. ",
    "* The energy sector  dropped 2.3%, as oil prices, one of Canada's major exports, dropped on rising OPEC and Russian oil output.",
    "* U.S. crude  prices were down 3.6% a barrel, while Brent crude  lost 2.3%. O/R",
    "* The financials sector  slipped 0.4%, while the industrials sector  fell 0.5%.",
    "* The materials sector , which includes precious and base metals miners and fertilizer companies, added 0.9% as gold futures  rose 0.9% to $1,533.1 an ounce. GOL/MET/L",
    "* On the TSX, 59 issues were higher, while 174 issues declined for a 2.95-to-1 ratio to the downside, with 7.39 million shares traded.",
    "* The largest percentage gainers on the TSX were First Majestic Silver Corp , which jumped 3.1% and Kirkland Lake Gold Ltd , which rose 3%.",
    "* Baytex Energy Corp  fell 5.2%, the most on the TSX. The second biggest decliner was CannTrust Holdings Inc , down 5.2%.",
    "* The most heavily traded shares by volume were Stornoway Diamond Corp , Crescent Point Energy Corp  and Sherritt International Corp .",
    "* The TSX posted five new 52-week highs and no new low.",
    "* Across all Canadian issues there were 30 new 52-week highs and nine new lows, with total volume of 16.74 million shares."
  ],
  "published_datetime": "2019-09-03 09:58:00"
}