{
  "url": "https://www.nasdaq.com/article/aurora-cannabis-inc-acb-stock-sinks-as-market-gains-what-you-should-know-cm1207631",
  "title": "Aurora Cannabis Inc. (ACB) Stock Sinks As Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Aurora Cannabis Inc. (ACB) closed at $5.59 in the latest trading session, marking a -1.41% move from the prior day. This change lagged the S&P 500's daily gain of 1.08%. Elsewhere, the Dow gained 0.91%, while the tech-heavy Nasdaq added 1.31%. Heading into today, shares of the company had lost 16.98% over the past month, lagging the Medical sector's loss of 1.27% and the S&P 500's loss of 0.68% in that time. ACB will be looking to display strength as it nears its nex t earnings  release, which is expected to be September 11, 2019. On that day, ACB is projected to report earnings of -$0.02 per share, which would represent a year-over-year decline of 115.38%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $79.02 million, up 432.49% from the year-ago period. Investors might also notice recent changes to analyst estimates for ACB. These recent revisions tend to reflect the evolving nature of short-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Based on our research, we believe these estimate revisions are directly related to near-team stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 23.17% higher. ACB is currently a Zacks Rank #4 (Sell). The Medical - Products industry is part of the Medical sector. This group has a Zacks Industry Rank of 61, putting it in the top 24% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. To follow ACB in the coming trading sessions, be sure to utilize Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Aurora Cannabis Inc. (ACB): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Aurora Cannabis Inc. (ACB) closed at $5.59 in the latest trading session, marking a -1.41% move from the prior day. This change lagged the S&P 500's daily gain of 1.08%. Elsewhere, the Dow gained 0.91%, while the tech-heavy Nasdaq added 1.31%.",
    "Heading into today, shares of the company had lost 16.98% over the past month, lagging the Medical sector's loss of 1.27% and the S&P 500's loss of 0.68% in that time.",
    "ACB will be looking to display strength as it nears its nex t earnings  release, which is expected to be September 11, 2019. On that day, ACB is projected to report earnings of -$0.02 per share, which would represent a year-over-year decline of 115.38%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $79.02 million, up 432.49% from the year-ago period.",
    "Investors might also notice recent changes to analyst estimates for ACB. These recent revisions tend to reflect the evolving nature of short-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Based on our research, we believe these estimate revisions are directly related to near-team stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 23.17% higher. ACB is currently a Zacks Rank #4 (Sell).",
    "The Medical - Products industry is part of the Medical sector. This group has a Zacks Industry Rank of 61, putting it in the top 24% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "To follow ACB in the coming trading sessions, be sure to utilize Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:45:18"
}