{
  "url": "https://www.nasdaq.com/article/yum-china-yumc-rides-on-unit-expansion-menu-innovation-cm1207294",
  "title": "Yum China (YUMC) Rides on Unit Expansion & Menu Innovation - Nasdaq.com",
  "text": [
    "  Yum China Holdings, Inc. YUMC  is gaining momentum on the back of accelerated store openings, robust performance at KFC, menu innovation and increased focus on technology. Evidently, the stock has gained 30.1% year to date compared with the industry  's 29.7% rally. However, factors like increasing costs and shrinking margins raise concerns. Let's delve deeper.  makeArticleAd(); Key Catalysts    In a bid to drive incremental sales, Yum China has been focusing on increasing store counts.  Last year, the company opened 819 restaurants, which exceeded the target of opening 600-650 restaurants. In second-quarter 2019, it opened 178 restaurants and remodeled 238. Over 80% of the company's current portfolio has been remodeled or built over the past five years.    For 2019, Yum China expects to continue driving unit growth, with 600-650 new restaurants. Moreover, it has ample potential to expand the restaurant base, given the consistent rise in the middle-class discretionary spending.    Furthermore, the company is banking on steady menu innovation to boost top-line growth. KFC's extraordinary performance is attributable to solid sales from menu offerings like crayfish burger, stuffed chicken wing and spicy chicken burger. Apart from such consumer-preferred food items, the company offers signature menus for the Chinese New Year.    Yum China is also serving coffee across its restaurants and enhancing the dessert category. In 2018, the company recorded double-digit growth, sold over 90 million cups of coffee and became one of the largest coffee retailers in China.    This Zacks Rank #3 (Hold) company is also shifting toward digital and content marketing to attract more customers. It has adopted a high-grade delivery strategy that includes collaborations with aggregators to drive traffic and fulfill orders by the company's KFC riders. This is expected to help the company drive volumes and leverage the extensive network to control quality.     Concerns    Yum China is facing the structural high cost of labor and rentals. Apart from wage inflation, the company is bearing additional costs on account of promotions, menu innovations and technological novelty.    In order to curb labor costs, the company is increasingly focusing on delivery channels, which is expected to dent margins in the near term. Also, costs related to transactions and franchises are expected to escalate in the near future.    Last year, total costs and expenses grew 6.9% year over year to $7,474 million. This increase can be attributed to a 10.5% rise in restaurant expenses, an 11.1% escalation in Payroll and employee benefits expenses, and a 14.4% hike in food and paper expenses. In the second quarter, total costs and expenses rose 2% year over year to $1,902 million owing to a 3% increase in restaurant expenses, a 6% rise in Payroll and employee benefits expenses, and a 6% hike in food and paper expenses.   Key Picks    Better-ranked stocks worth considering in the same space include Dave & Buster's Entertainment, Inc. PLAY  , The Wendy's Company WEN  and Shake Shack Inc. SHAK  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   . Dave & Buster's Entertainment, Wendy's and Shake Shack have an impressive long-term earnings growth rate of 14.8%, 14.3% and 22.5%, respectively.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Shake Shack, Inc. (SHAK): Free Stock Analysis Report   Yum China Holdings Inc. (YUMC): Free Stock Analysis Report   Dave & Buster's Entertainment, Inc. (PLAY): Free Stock Analysis Report   The Wendy's Company (WEN): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Yum China Holdings, Inc. YUMC  is gaining momentum on the back of accelerated store openings, robust performance at KFC, menu innovation and increased focus on technology. Evidently, the stock has gained 30.1% year to date compared with the industry  's 29.7% rally. However, factors like increasing costs and shrinking margins raise concerns. Let's delve deeper.  makeArticleAd(); Key Catalysts    In a bid to drive incremental sales, Yum China has been focusing on increasing store counts.  Last year, the company opened 819 restaurants, which exceeded the target of opening 600-650 restaurants. In second-quarter 2019, it opened 178 restaurants and remodeled 238. Over 80% of the company's current portfolio has been remodeled or built over the past five years.    For 2019, Yum China expects to continue driving unit growth, with 600-650 new restaurants. Moreover, it has ample potential to expand the restaurant base, given the consistent rise in the middle-class discretionary spending.    Furthermore, the company is banking on steady menu innovation to boost top-line growth. KFC's extraordinary performance is attributable to solid sales from menu offerings like crayfish burger, stuffed chicken wing and spicy chicken burger. Apart from such consumer-preferred food items, the company offers signature menus for the Chinese New Year.    Yum China is also serving coffee across its restaurants and enhancing the dessert category. In 2018, the company recorded double-digit growth, sold over 90 million cups of coffee and became one of the largest coffee retailers in China.    This Zacks Rank #3 (Hold) company is also shifting toward digital and content marketing to attract more customers. It has adopted a high-grade delivery strategy that includes collaborations with aggregators to drive traffic and fulfill orders by the company's KFC riders. This is expected to help the company drive volumes and leverage the extensive network to control quality.",
    "    Concerns    Yum China is facing the structural high cost of labor and rentals. Apart from wage inflation, the company is bearing additional costs on account of promotions, menu innovations and technological novelty.    In order to curb labor costs, the company is increasingly focusing on delivery channels, which is expected to dent margins in the near term. Also, costs related to transactions and franchises are expected to escalate in the near future.    Last year, total costs and expenses grew 6.9% year over year to $7,474 million. This increase can be attributed to a 10.5% rise in restaurant expenses, an 11.1% escalation in Payroll and employee benefits expenses, and a 14.4% hike in food and paper expenses. In the second quarter, total costs and expenses rose 2% year over year to $1,902 million owing to a 3% increase in restaurant expenses, a 6% rise in Payroll and employee benefits expenses, and a 6% hike in food and paper expenses.   Key Picks    Better-ranked stocks worth considering in the same space include Dave & Buster's Entertainment, Inc. PLAY  , The Wendy's Company WEN  and Shake Shack Inc. SHAK  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    "Dave & Buster's Entertainment, Wendy's and Shake Shack have an impressive long-term earnings growth rate of 14.8%, 14.3% and 22.5%, respectively.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:09:00"
}