{
  "url": "https://www.nasdaq.com/article/is-now-the-time-to-buy-micron-stock-cm1207435",
  "title": "Is Now the Time to Buy Micron Stock? - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Micron Technology, Inc (NASDAQ: MU ) is an American producer of computer memory and storage. It's a specialized, high-tech company that has been caught in the middle of two forces, causing volatility in MU stock.",
    "As a result, after topping $61 last June - its highest close in nearly two decades - MU dropped to half of that as 2018 came to an end. This year, Micron stock has seen plenty of volatility. But since the end of June, MU has been making a steady recovery. It's now up over 45% from the start of the year after hitting $45.27 at the end of August.",
    "The question is, does Micron stock have further upside, or has its performance in 2019 reached its zenith? Looking at the two factors that have had such an impact on MU since last year's rapid decline will help in making that call.",
    "Micron's primary business is the production of computer memory and storage: DRAM, NAND flash memory and USB drives that use flash memory. It's one of only a few companies that dominate the global market, along with two South Korean competitors: Samsung and SK Hynix .",
    "When times are good, this is a highly profitable business. However, the market for computer memory products is cyclical. This has had a profound effect on Micron stock over the past several years.",
    "In 2017, demand for memory products like DRAM was sky high. Apple (NASDAQ: AAPL ) and other smartphone manufacturers hadn't yet seen the era of declining sales. Moreover, Amazon (NASDAQ: AMZN ) and Alphabet's (NASDAQ: GOOG , NASDAQ: GOOGL ) Google were bulking up data centers. At the height of this cycle of robust demand, prices for DRAM, NAND flash memory and related products were up. And in June 2018, MU stock hit $61.39, its highest close since 2000 when it approached the $100 level.",
    "However, the demand for DRAM and NAND memory quickly turned into a glut. That left producers like Micron with excess inventory, cutting into prices. Between that high in June to the end of 2018, Micron stock dropped 48%.",
    "That has been the reality for memory producers through 2019. But a recent report published in Digitimes suggests that the worst of the glut may be over. Further, global memory prices are set to begin stabilizing . If that turns out to be true, MU stock at $45 has significant upside.",
    "The second big factor that has affected all tech stocks in 2019 is the U.S.-China trade war . Micron is particularly vulnerable to the ups and downs of the tariffs, threats of tariffs and the U.S. penalization of China's Huawei . In fact, Micron has said that Huawei alone accounted for 13% of its revenue for the first half of fiscal 2019.",
    "The escalation of the trade war with China through May and June battered MU stock. Besides the threat of a ban against selling products to Huawei, the prospect of consumer electronics like the iPhone facing rising costs because of tariffs - a move that would likely cut further into sales and slash demand for DRAM and NAND - made for a rough and volatile month of trading for MU.",
    "We've seen that trade war volatility in play once again over the past month, with ramped up tensions between the U.S. and China and additional tariffs.",
    "If predictions are correct that data center demand for DRAM is due to pick up, then MU stock should be positioned for further growth - it's still $15 off the levels it hit last June. The wild card is the trade war.",
    "It could still play spoiler if tariffs are increased. But the big hit to Micron's bottom line from the loss of Huawei's business is already baked into the valuation of MU stock. If that were to ease up, the upside would be considerable.",
    "At this point, of the 24 analysts surveyed by Nasdaq, half have Micron rated as a \"strong buy.\" That suggests there's confidence that MU does indeed have room to grow in 2019 and 2020.",
    "As of this writing, Brad Moon did not hold a position in any of the aforementioned securitie s.",
    "The post Is Now the Time to Buy Micron Stock? appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:27:28"
}