{
  "url": "https://www.nasdaq.com/article/dave-busters-sees-the-pain-continuing-cm1210766",
  "title": "Dave & Buster's Sees the Pain Continuing - Nasdaq.com",
  "text": [
    " At first, the idea behind   Dave & Buster's    (NASDAQ: PLAY) was novel. Offer one-of-a-kind games that the   whole family can enjoy while serving up food. In fact, while many   restaurants were losing traffic when the \"   restaurant slump    \" started years ago, Dave & Buster's was actually   bucking the trend    . The company's luck, however, started running out two years   ago. With the release of second-quarter earnings this week, it's   clear the loss of traffic at existing stores is continuing.   Image source: Getty ImagesmakeArticleAd();   Dave & Buster's earnings: The raw numbers  Before we get into the details of what happened during the   quarter, let's take a look at the company's headline numbers.  Data source: Dave & Buster's IR, SEC filings. On the surface, this doesn't look so bad -- revenue and   earnings increased at moderate levels. But all of the details   need to be considered: The number of stores the company operates   increased from 117 last year to 130 this year. The real test of a restaurant's health are comparable-store   sales -- or comps. By filtering out the effect of new store   locations, we can get a better idea for how popular existing   stores are.   Chart by author. Data source: SEC filings.  As you can see, while it looked for a short time like Dave   & Buster's might be righting the ship a few quarters back,   things have once again trended in the wrong direction. Specifically, walk-in sales were down 2% at comparable stores.   Food and beverage comps were down 3.2%, and high-margin Amusement   comps were also down 0.8%.  What else happened during the quarter?  Speaking on the   conference call    , CEO Brian Jenkins pointed out there were many culprits for the   shortfall:  Our comp sales results came in below expectations as last     year's VR launched proved difficult to match and our promotions     were not as effective as we had anticipated. We also face     headwinds from adverse weather and the continued impact of     competitive intrusion and cannibalization.  There were a number of other tidbits of note from the   company's release:  The company launched its fourth proprietary VR game:     Men in Black -- Galactic Getaway  The company still believes it will open 15 or 16 new     locations during the fiscal year. Management repurchased 3.4 million shares for a total of     $137 million.   Looking ahead  Management was forced to revise its guidance for the rest of   the fiscal year. Among those revisions:  Data source: Dave & Buster's. Midpoint guidance rounded to   nearest whole number for revenue and net income. Jenkins spent a good deal of the company's conference call   talking about the five steps Dave & Buster's will take to   right its ship:   Revitalizing existing stores      . Management spent a good deal of time talking about 50-foot     LED WoW walls to improve customer experience.  Deepen engagement with customers.       The company is pinning its hopes on a new mobile     app.  Reducing costs.      The company has identified $15 million in savings it can soon     realize.  Investment in highest-return new store locations.   Capital return to shareholders.      To go along with share repurchases, the company plans on     continuing its dividend.  If it can follow through on these priorities, that would be   enormously encouraging for shareholders.   10 stocks we like better than Dave & Buster's     Entertainment       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Dave & Buster's     Entertainment wasn't one of them! That's right -- they think     these 10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Brian Stoffel      has no position in any of the stocks mentioned. The Motley Fool     recommends Dave & Buster's Entertainment. The Motley Fool     has a     disclosure policy      .  ",
    "At first, the idea behind   Dave & Buster's    (NASDAQ: PLAY) was novel. Offer one-of-a-kind games that the   whole family can enjoy while serving up food. In fact, while many   restaurants were losing traffic when the \"   restaurant slump    \" started years ago, Dave & Buster's was actually   bucking the trend    .",
    "The company's luck, however, started running out two years   ago. With the release of second-quarter earnings this week, it's   clear the loss of traffic at existing stores is continuing.",
    "  Image source: Getty ImagesmakeArticleAd(); ",
    "Image source: Getty Images",
    "Before we get into the details of what happened during the   quarter, let's take a look at the company's headline numbers.",
    "Data source: Dave & Buster's IR, SEC filings.",
    "On the surface, this doesn't look so bad -- revenue and   earnings increased at moderate levels. But all of the details   need to be considered: The number of stores the company operates   increased from 117 last year to 130 this year.",
    "The real test of a restaurant's health are comparable-store   sales -- or comps. By filtering out the effect of new store   locations, we can get a better idea for how popular existing   stores are.",
    "  Chart by author. Data source: SEC filings. ",
    "Chart by author. Data source: SEC filings.",
    "As you can see, while it looked for a short time like Dave   & Buster's might be righting the ship a few quarters back,   things have once again trended in the wrong direction.",
    "Specifically, walk-in sales were down 2% at comparable stores.   Food and beverage comps were down 3.2%, and high-margin Amusement   comps were also down 0.8%.",
    "Speaking on the   conference call    , CEO Brian Jenkins pointed out there were many culprits for the   shortfall:",
    "Our comp sales results came in below expectations as last     year's VR launched proved difficult to match and our promotions     were not as effective as we had anticipated. We also face     headwinds from adverse weather and the continued impact of     competitive intrusion and cannibalization.",
    "There were a number of other tidbits of note from the   company's release:",
    "Management was forced to revise its guidance for the rest of   the fiscal year. Among those revisions:",
    "Data source: Dave & Buster's. Midpoint guidance rounded to   nearest whole number for revenue and net income.",
    "Jenkins spent a good deal of the company's conference call   talking about the five steps Dave & Buster's will take to   right its ship:",
    "If it can follow through on these priorities, that would be   enormously encouraging for shareholders.",
    "  10 stocks we like better than Dave & Buster's     Entertainment       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Dave & Buster's     Entertainment wasn't one of them! That's right -- they think     these 10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Dave & Buster's     Entertainment       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Dave & Buster's     Entertainment wasn't one of them! That's right -- they think     these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Brian Stoffel      has no position in any of the stocks mentioned. The Motley Fool     recommends Dave & Buster's Entertainment. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:54:00"
}