{
  "url": "https://www.nasdaq.com/article/4-top-renewable-energy-stocks-to-buy-now-cm1206883",
  "title": "4 Top Renewable Energy Stocks to Buy Now - Nasdaq.com",
  "text": [
    "Renewable energy stocks have teased investors with their promise for years. On the one hand, it's easy to dream on the sector's growth potential given the need to transition the global economy away from its current fossil fuel-based approach to a more sustainable one. According to one estimate, the world's developed economies need to invest a staggering $10 trillion in the coming years to make the switch. However, despite all the investments in the sector, most clean energy stocks have significantly underperformed the market over the years.",
    "Two factors have driven this underperformance: intense competition and weak financial profiles. With so many companies focused on doing the same thing, the industry has fought against itself for growth opportunities, which has hurt investment returns. Meanwhile, most clean energy companies focused on growing as fast as they could despite the lackluster returns. As a result, many stretched themselves too thin, putting pressure on their balance sheets and stock prices and burning investors in the process.",
    "A small group of renewable energy companies, however, have thrived despite the sector's issues. That's allowed them to consistently create value for their investors over the years.",
    "One of the defining characteristics of these outperformers is that they aim to grow the value of their company, not just its size. Thus, those who want to invest in renewable energy stocks should seek out companies focused on this pursuit.",
    "While many companies want to profit from the renewable energy sector's growth potential, far fewer have a visible plan aimed first at increasing shareholder value. That makes them stand out as the top investment options in the space.",
    "Image source: Getty Images.",
    "Given the outsize growth potential of the renewable energy sector, most companies focused on the industry should be able to increase their revenue in the coming years. Far fewer will be able to expand their profitability, especially on a per-share basis due to competition and financial concerns.",
    "The following four companies, however, have a plan to grow their earnings per share, which increases the probability that they'll produce market-beating returns for their investors:",
    "Data source: Company investor presentations.",
    "Here's a closer look at what makes them the top renewable stocks to buy for the long term.",
    "Brookfield Renewable Partners is one of the largest renewable energy companies in the world. It boasts a globally diversified, multitechnology renewable power platform that includes:",
    "As of August 2019, hydro made up 75% of the company's portfolio followed by wind at 21% and solar at 4%.",
    "Brookfield makes money by selling the bulk of the renewable energy it generates to customers like utilities under long-term, fixed-rate power purchase agreements (PPAs). These contracts provide the company with predictable cash flow while insulating it from volatile power prices. The company typically distributes the bulk of its cash flow (80% on average) back to investors via a high-yield dividend . It reinvests the rest into building or buying additional renewable energy-generating assets.",
    "The company has a high hurdle rate for new investments, targeting opportunities that will generate 12% to 15% total returns over the long-term. It's able to achieve this goal by investing on a value basis, leveraging its operational expertise, and remaining disciplined. Brookfield typically targets opportunities where it can buy underperforming assets and turn them around by improving their operations and cost structure.",
    "Brookfield's focus on improving is evident in its long-term outlook. The company aims to grow its cash flow per share at a 6% to 11% annual rate through at least 2022, which should allow it to increase its dividend at a 5% to 9% yearly pace. One factor powering that plan is the company's ability to improve the profitability of its existing assets. That factor alone should supply it with half of its cash flow growth over that time frame. The other half will come from building new renewable projects that meet the high bar it's set for investment return.",
    "The company's value-focused approach has paid big dividends over the years. In the two decades since its inception through mid-2019, Brookfield has generated a 16% annualized total return. For comparison's sake, the S&P 500 only delivered a 7% total annualized return over that time frame.",
    "If there's one concern with Brookfield Renewable, it's that some of its operations reside in economically sensitive countries like Brazil. The company takes steps to reduce its risks in those regions by using hedging contracts to lock in currency rates and power prices. However, a prolonged economic slump could negatively impact its earnings and weigh on its market value.",
    "While Brookfield Renewable Partners has battled its share of ups and downs over the years, it has proven that slow and steady can win the race. The company has consistently grown its cash flow by investing in opportunities that meet its strict criteria. That's enabled it to routinely increase its distribution to investors, allowing them to collect a growing income stream. That trend isn't showing any signs of stopping, which is why Brookfield Renewable is a great clean energy stock to buy for the long term.",
    "Image source: Getty Images.",
    "First Solar is a solar panel manufacturer. However, it differentiates itself from most competitors in two ways.",
    "First, the company develops and manufactures thin-film modules that use cadmium telluride as a semiconductor instead of the conventional crystalline silicon technology. While these panels aren't as efficient in converting the sun's rays into electricity, they have a lower cost per watt.",
    "First Solar offsets some of the efficiency loss by making larger panels compared to those produced by its competitors. On the one hand, this makes them less suitable for residential rooftops. However, they're ideal for utility-scale projects that connect to the grid since it doesn't have to install as many panels per project to produce the same amount of power. Consequently, First Solar has developed and operates many of the world's largest grid-connected solar power plants.",
    "Secondly, First Solar's history of innovation sets it apart from the competition. While many rivals focus on manufacturing low-cost silicon-based panels, First Solar invests industry-leading amounts of capital into developing more efficient thin-film solar panels. Its more-innovative products carry higher margins, which enables it to make more money. In 2018, it launched its latest innovative product, the Series 6 module, which is even more efficient than the Series 4 panel it's replacing. The company decided to completely skip the launch of the Series 5 module and accelerate the migration to the larger Series 6 because it was more cost-competitive with rival panels.",
    "The company invested more than $1 billion into Series 6, which included research and development (R&D) costs, as well as building out manufacturing capacity in the U.S. and Asia. That investment should start paying off in 2019. Its earnings are on track to surge more than 80% year over year at the midpoint of its forecast. That accelerated earnings-per-share growth should continue in the years that follow as it cashes in on its investment in the Series 6 module.",
    "Despite its massive investments in R&D, First Solar has managed to maintain one of the best balance sheets in the solar sector. The company expects to end 2019 with between $1.7 billion and $1.9 billion of net cash. That cash-rich balance sheet gives it an unmatched competitive advantage versus its financially weaker peers, most of which are weighed down by a mountain of expansion-fueled debt. First Solar, on the other hand, has the unparalleled financial flexibility to continue investing to increase its capacity as well as on its next innovation.",
    "While First Solar is a top-tier solar panel manufacturer, it operates in a highly competitive industry. Because of that, the company needs to continue pouring money into R&D so that it doesn't lose its competitive edge. If it fails to innovate, it might start falling behind. It also needs to battle against rising costs and falling panel prices by keeping its expenses at bay to protect its profit margins.",
    "In spite of those risks, First Solar appears well positioned to prosper thanks to its strong balance sheet, healthy earnings growth prospects, and a history of innovation. That combination should give it the power to generate market-beating returns in the coming years.",
    "NextEra Energy is a clean energy -focused company. It operates two distinct businesses:",
    "NextEra Energy's affiliates combine to generate more electricity from the wind and sun than any other company in the world. In addition, it's a leader in battery storage.",
    "The company's regulated utilities produce energy from a variety of sources (including natural gas, nuclear, coal, and solar) and distribute it as well as natural gas to customers. These businesses generate relatively predictable income since regulatory bodies set rates and demand tends to increase at a steady pace as Florida's population and economy expand.",
    "NextEra's energy resources segment owns an extensive portfolio of power-generating facilities including wind, solar, nuclear, natural gas, and oil. In addition to that, the company operates a meaningful natural gas pipeline business. The company sells the power it produces under long-term PPAs and leases capacity on its gas pipelines via long-term contracts. Those agreements enable NextEra to churn out predictable cash flow.",
    "NextEra has a long history of creating value for investors by consistently growing its earnings and dividend. From 2003 through 2018, the company increased its adjusted earnings per share at a 7.8% compounded annual rate while boosting the shareholder payout at a 9.1% yearly pace. That consistent growth has enabled the utility to generate market-crushing returns. In the decade from 2008 through 2018, it produced a 380% total return, which outpaced not only its utility peers (170% total return over that time frame) but also the S&P 500 (243%).",
    "The utility firmly believes it can continue to grow earnings at a healthy clip in the coming years. Powering NextEra's forecast is a massive backlog of expansion projects. The company expects to invest from $23 billion to $25 billion in Florida Power & Light from 2019 to 2022 and another $2.9 billion to $3.3 billion in Gulf Power on a variety of projects, including new solar capacity. It has lined up $25 billion to $28 billion of investments at energy resources, mainly on renewables. The company currently expects to build 11.7 GW of renewable projects over that time frame. That would boost its industry-leading portfolio, which consisted of 18 GW of wind and solar capacity in August 2019.",
    "While NextEra Energy has a strong balance sheet, it will be investing a significant amount of money in expanding its operations over the next several years. At the same time, it plans to continue increasing its above-average dividend. That will be a tough balancing act. The company will likely need to secure substantial amounts of outside funding to bridge the gap, including selling assets to its MLPNextEra Energy Partners . If it runs into trouble obtaining financing, then it might not grow its earnings at as fast as it expects.",
    "The company, however, does have a long history of being able to finance its growth while increasing the dividend. That's why it firmly believes it can deliver on its growth plan. That outlook would see earnings per share expand at a 6% to 8% compound annual rate through at least 2022 from 2018's base. The company also expects to receive an additional earnings boost in 2020 and 2021 from the integration of its acquisition of Gulf Power as its cost-saving initiatives start paying off. That would enable NextEra to continue to increase its dividend at a healthy rate during that period, which should give it the power to keep producing market-beating total returns.",
    "Image source: Getty Images.",
    "TerraForm Power focuses on owning and operating wind and solar power assets in North America and Western Europe. As of the middle of 2019, 64% of the company's portfolio consisted of wind assets, while the rest was solar.",
    "Like Brookfield Renewable, TerraForm Power makes money by selling the electricity it generates to end-users under long-term PPAs. Those contracts provide it with predictable cash flow, most of which (its payout ratio typically ranges between 80% to 85%) it returns to investors via a high-yield dividend. The company reinvests the remaining cash flow on high-return projects that expand its renewable power generating capacity. For example, it has three projects under way to upgrade some of its existing wind farms by installing newer, larger turbines that it hopes to complete by 2021. These investments would boost the power output at those locations by 25% to 30% at a 40% discount to the cost of building new wind farms. That enables TerraForm to boost its per-share earnings without making a substantial investment.",
    "Aside from a similar business model, another reason TerraForm Power has so much in common with Brookfield Renewable is that they have the same parent in Brookfield Asset Management (NYSE: BAM) . Brookfield Asset and Brookfield Renewable joined forces in 2017 to take control of TerraForm Power after its former parent went bankrupt. They've since helped TerraForm get its financials back on solid ground while improving its operational focus and reducing costs. These factors have helped boost the profitability of TerraForm's legacy assets while giving it the financial flexibility to acquire new ones.",
    "TerraForm made two major acquisitions in the first two years since Brookfield took control. Those transactions will provide the company with enough power to increase its dividend at a 5% to 8% annual rate through 2022. One of the main drivers of this growth is TerraForm's ability to improve the profitability of the assets it acquired by reducing costs.",
    "Like many renewable energy companies, TerraForm Power has struggled to create value for investors in the past. Before Brookfield took over, the company's total return was a negative 50%. Those value-destroying ways, however, have changed since it began implementing Brookfield's game plan. In the first 22 months after Brookfield took control, TerraForm generated a nearly 44% total return, which obliterated the S&P 500's 17% total return over that timeframe.",
    "While the Brookfield-led turnaround has been highly successful, TerraForm Power is still dealing with some of the lingering effects of its former parent. The biggest concern is its balance sheet, which remains loaded with debt. Because of that, the company's credit rating is below investment grade , which makes it harder and more expensive to borrow money. The company is working to address that issue by selling noncore assets and boosting its profitability.",
    "As TerraForm's financial profile improves, it will enhance the company's ability to grow cash flow per share. That will increase the probability of achieving its dividend growth plan. Its new focus on creating shareholder value should give it the power to continue to outperform.",
    "Regardless of its promise, the renewable energy sector has burned investors in the past due to intense competition and aggressive growth. Many companies have struggled to make money, with some having to declare bankruptcy.",
    "The sector, however, is beginning to learn from those growing pains as well as from the companies that succeeded where others failed. Because of that, the renewable energy industry appears to have brighter days ahead, especially as climate change concerns heat up. While many companies could prosper in the coming years, these four have a long-term growth strategy aimed at increasing their earnings per share. That improves the probability that they can create value for shareholders, which makes them the best stocks in the sector to buy in the renewable energy sector.",
    "10 stocks we like better than First Solar\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and First Solar wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Matthew DiLallo owns shares of Brookfield Asset Management, Brookfield Renewable Partners L.P., First Solar, NextEra Energy, and TerraForm Power. The Motley Fool owns shares of and recommends Brookfield Asset Management. The Motley Fool recommends First Solar and NextEra Energy. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:52:00"
}