{
  "url": "https://www.nasdaq.com/article/3-benefits-of-tracking-your-spending-cm1207489",
  "title": "3 Benefits of Tracking Your Spending - Nasdaq.com",
  "text": [
    "   Tracking your spending can have some significant advantages.   Here are three of them.  Do you know where your money goes every month? Unless you have tracked your spending, there's a good chance that you don't. While you may have a vague idea of what you do with your cash -- and know what your big monthly bills are -- it can be hard to get a clear understanding of exactly how your money is distributed on a daily basis until you keep track.makeArticleAd();      Image source: Getty Images  Tracking spending can be done manually by writing down every purchase you make. Or you can use apps such as Mint that you link to your credit cards and bank accounts to make the process easier. Whatever approach you choose, it may seem like a hassle -- but it's well worth it in the end. Not sure why you would want to go to all the trouble of tracking every purchase? Here are three major benefits of tracking your spending. 1. You'll spend more mindfully When you know you have to write down every purchase you make, you may think twice about some of your splurges. The simple act of recording the transaction is often enough to make you change your behavior and be more responsible with your spending, just as keeping a food journal and counting calories can help you eat better and lose weight. 2. You can identify problem areas As you track your spending over time, you'll get a better idea of what's happening with your cash. This makes it much easier to see where you are spending too much of it. Many of your daily expenses may seem really small when you are charging just a few dollars here and there on a credit card  . But once you add up everything you spend on dining out, coffee, lottery tickets, or whatever your indulgence is, you may be shocked to find out how much your habits actually cost. 3. You can make a better budget Many people try to make a budget without tracking their spending first, but this is just setting yourself up for failure. After all, if you are wildly unrealistic about the amount that you allocate to entertainment or dining out or other discretionary expenses, you're very unlikely to be able to actually stick to your budget  . If you've tracked your spending and have an idea where your money is going, you can make smart and sustainable cuts in desired areas. You'll be far more likely to keep on budget over the long term if it takes your current habits into account from the outset. Get started tracking your spending today As you can see, there are lots of big advantages to tracking your spending that make the process worth it. Get started today with tracking your purchases. You'll likely be surprised at some of your expenses. And hopefully with this new information you'll be able to find ways to reduce your outflow so you can use your hard-earned money more effectively towards accomplishing your financial goals. Savings account rates are skyrocketing -- Earn 23x your bank Many people are missing out on guaranteed returns as their money languishes in a big bank savings account earning next to no interest. Our picks of the best online savings accounts  can earn you more than 25x the national average savings account rate. Click here  to uncover the best-in-class picks that landed a spot on our shortlist of the best savings accounts for 2019.  The Motley Fool owns and recommends MasterCard and Visa, and recommends American Express. We're firm believers in the Golden Rule. If we wouldn't recommend an offer to a close family member, we wouldn't recommend it on The Ascent either. Our number one goal is helping people find the best offers to improve their finances. That is why editorial opinions are ours alone and have not been previously reviewed, approved, or endorsed by included advertisers. Editorial content from The Ascent is separate from The Motley Fool editorial content and is created by a different analyst team.",
    "  Tracking your spending can have some significant advantages.   Here are three of them. ",
    "Do you know where your money goes every month? Unless you have tracked your spending, there's a good chance that you don't.",
    "While you may have a vague idea of what you do with your cash -- and know what your big monthly bills are -- it can be hard to get a clear understanding of exactly how your money is distributed on a daily basis until you keep track.",
    "  Image source: Getty Images ",
    "Image source: Getty Images",
    "Tracking spending can be done manually by writing down every purchase you make. Or you can use apps such as Mint that you link to your credit cards and bank accounts to make the process easier. Whatever approach you choose, it may seem like a hassle -- but it's well worth it in the end.",
    "Not sure why you would want to go to all the trouble of tracking every purchase? Here are three major benefits of tracking your spending.",
    "When you know you have to write down every purchase you make, you may think twice about some of your splurges. The simple act of recording the transaction is often enough to make you change your behavior and be more responsible with your spending, just as keeping a food journal and counting calories can help you eat better and lose weight.",
    "As you track your spending over time, you'll get a better idea of what's happening with your cash. This makes it much easier to see where you are spending too much of it.",
    "Many of your daily expenses may seem really small when you are charging just a few dollars here and there on a credit card  . But once you add up everything you spend on dining out, coffee, lottery tickets, or whatever your indulgence is, you may be shocked to find out how much your habits actually cost.",
    "Many people try to make a budget without tracking their spending first, but this is just setting yourself up for failure. After all, if you are wildly unrealistic about the amount that you allocate to entertainment or dining out or other discretionary expenses, you're very unlikely to be able to actually stick to your budget  .",
    "If you've tracked your spending and have an idea where your money is going, you can make smart and sustainable cuts in desired areas. You'll be far more likely to keep on budget over the long term if it takes your current habits into account from the outset.",
    "As you can see, there are lots of big advantages to tracking your spending that make the process worth it. Get started today with tracking your purchases. You'll likely be surprised at some of your expenses. And hopefully with this new information you'll be able to find ways to reduce your outflow so you can use your hard-earned money more effectively towards accomplishing your financial goals.",
    "Many people are missing out on guaranteed returns as their money languishes in a big bank savings account earning next to no interest. Our picks of the best online savings accounts  can earn you more than 25x the national average savings account rate. Click here  to uncover the best-in-class picks that landed a spot on our shortlist of the best savings accounts for 2019.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:00:00"
}