{
  "url": "https://www.nasdaq.com/article/its-all-quiet-on-the-darden-front-and-that-may-not-be-a-bad-thing-cm1210696",
  "title": "It's All Quiet on the Darden Front, and That May Not Be a Bad Thing - Nasdaq.com",
  "text": [
    " Little news of note has been emanating from   Darden Restaurants    ' (NYSE: DRI) press office lately. Darden operates the popular   full-service restaurant chains Olive Garden, LongHorn Steakhouse,   Cheddar's Scratch Kitchen, Yard House, The Capital Grille,   Seasons 52, Bahama Breeze, and Eddie V's. For a company of   this size, having no announcements about major rebranding or   potential acquisitions creates a silence that is deafening.   What's going on? Long lines and strong sales It appears Darden is taking a well-earned moment. The   company's solid position is obvious from the long lines that face   customers at its core brand locations. At Olive Garden, it took   my family three tries over a period of three weeks to secure a   table there. A departure time of 4:30 p.m. from our home finally   met with success. Any later than that, and we instead rely on the   online menu.   Image source: Darden Restaurants.makeArticleAd();  Darden's   latest earnings announcement    revealed mostly encouraging signs. Reported adjusted earnings per   share of $1.76 showed an increase of almost 27% compared to   year-end 2018. Total sales for the company increased 4.5% to   $2.23 billion thanks to the opening of 39 new restaurants.   LongHorn Steakhouse and the Capital Grille are sure assets with   increases in sales of 2.4% and 3.3%, respectively. The latest   acquisitions, however, are faring less well. Cheddar's Scratch   Kitchen showed a decrease in sales of 3.2%, and Seasons 52 showed   a decrease in sales of 2.1%. With healthy income and nothing of note to deter optimism   where growth is concerned, Darden's executives are perhaps wisely   sitting back while the economy sorts itself out. The next year   promises to be volatile as we head into a 2020 election, face the   economic effects of the U.S.-China trade war, and hear news of   slowdowns in the European economy that could start affecting the   economy here. Darden's debt load not a concern Darden has few reasons to worry about its debt. As of May   2019, it was about $928 million. That figure had not risen   significantly from the year before. With cash reserves of $457   million, it makes for a net debt of $470 million. The balance sheet showed liabilities of $1.47 billion due   within a year of May 2019 and $2.03 billion due after that. With   cash of $457 million and receivables of $88 million due in 12   months, Darden's liabilities are almost $3 billion more than its   cash and near-term receivables. With a market cap of $15.2   billion, this balance sheet should be totally manageable.   Moreover, the company repurchased approximately $42 million of   its outstanding common stock, which implies that it considers its   stock undervalued. Darden is striding confidently into 2020 There may be media quietness, but the company has provided a   glimpse into 2020. Darden plans to open about 50 stores at a cost   of around $240 million to $265 million        . It also plans to spend between $210 million and $235 million on   restaurant remodels, maintenance, technology, and other capital   expenditures. None of this can be considered a major strategy change for a   company the size of Darden, and a further indicator of its   current conservative approach is that it expects no acquisitions   in the near future. While some might consider this a hindrance to   growth, it could be a good thing. The performance of Cheddar's   Scratch Kitchen, Yard House, Seasons 52, and Bahama Breeze, has   been somewhat underwhelming and all have recently seen same-store   sales decline. Once bitten, twice shy. It seems that Darden Group has learned   from its   poor performance    circa 2014. It is sensibly taming its desire for aggressive   growth and focusing on its core strengths. A divestment where its   weaker brands are concerned might be in the cards at some point.   But, all in all, Darden has earned this breathing room   considering its strong position in   a competitive but growing restaurant sector.    10 stocks we like better than Darden     Restaurants       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Darden Restaurants wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Caroline Banton      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Little news of note has been emanating from   Darden Restaurants    ' (NYSE: DRI) press office lately. Darden operates the popular   full-service restaurant chains Olive Garden, LongHorn Steakhouse,   Cheddar's Scratch Kitchen, Yard House, The Capital Grille,   Seasons 52, Bahama Breeze, and Eddie V's. For a company of   this size, having no announcements about major rebranding or   potential acquisitions creates a silence that is deafening.   What's going on?",
    "It appears Darden is taking a well-earned moment. The   company's solid position is obvious from the long lines that face   customers at its core brand locations. At Olive Garden, it took   my family three tries over a period of three weeks to secure a   table there. A departure time of 4:30 p.m. from our home finally   met with success. Any later than that, and we instead rely on the   online menu.",
    "  Image source: Darden Restaurants.makeArticleAd(); ",
    "Image source: Darden Restaurants.",
    "Darden's   latest earnings announcement    revealed mostly encouraging signs. Reported adjusted earnings per   share of $1.76 showed an increase of almost 27% compared to   year-end 2018. Total sales for the company increased 4.5% to   $2.23 billion thanks to the opening of 39 new restaurants.   LongHorn Steakhouse and the Capital Grille are sure assets with   increases in sales of 2.4% and 3.3%, respectively. The latest   acquisitions, however, are faring less well. Cheddar's Scratch   Kitchen showed a decrease in sales of 3.2%, and Seasons 52 showed   a decrease in sales of 2.1%.",
    "With healthy income and nothing of note to deter optimism   where growth is concerned, Darden's executives are perhaps wisely   sitting back while the economy sorts itself out. The next year   promises to be volatile as we head into a 2020 election, face the   economic effects of the U.S.-China trade war, and hear news of   slowdowns in the European economy that could start affecting the   economy here.",
    "Darden has few reasons to worry about its debt. As of May   2019, it was about $928 million. That figure had not risen   significantly from the year before. With cash reserves of $457   million, it makes for a net debt of $470 million.",
    "The balance sheet showed liabilities of $1.47 billion due   within a year of May 2019 and $2.03 billion due after that. With   cash of $457 million and receivables of $88 million due in 12   months, Darden's liabilities are almost $3 billion more than its   cash and near-term receivables. With a market cap of $15.2   billion, this balance sheet should be totally manageable.   Moreover, the company repurchased approximately $42 million of   its outstanding common stock, which implies that it considers its   stock undervalued.",
    "There may be media quietness, but the company has provided a   glimpse into 2020. Darden plans to open about 50 stores at a cost   of around $240 million to $265 million        . It also plans to spend between $210 million and $235 million on   restaurant remodels, maintenance, technology, and other capital   expenditures.",
    "None of this can be considered a major strategy change for a   company the size of Darden, and a further indicator of its   current conservative approach is that it expects no acquisitions   in the near future. While some might consider this a hindrance to   growth, it could be a good thing. The performance of Cheddar's   Scratch Kitchen, Yard House, Seasons 52, and Bahama Breeze, has   been somewhat underwhelming and all have recently seen same-store   sales decline.",
    "Once bitten, twice shy. It seems that Darden Group has learned   from its   poor performance    circa 2014. It is sensibly taming its desire for aggressive   growth and focusing on its core strengths. A divestment where its   weaker brands are concerned might be in the cards at some point.   But, all in all, Darden has earned this breathing room   considering its strong position in   a competitive but growing restaurant sector. ",
    "  10 stocks we like better than Darden     Restaurants       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Darden Restaurants wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Darden     Restaurants       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Darden Restaurants wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Caroline Banton      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:54:38"
}