{
  "url": "https://www.nasdaq.com/article/should-first-trust-capital-strength-etf-ftcs-be-on-your-investing-radar-cm1207722",
  "title": "Should First Trust Capital Strength ETF (FTCS) Be on Your Investing Radar? - Nasdaq.com",
  "text": [
    "The First Trust Capital Strength ETF (FTCS) was launched on 07/06/2006, and is a passively managed exchange traded fund designed to offer broad exposure to the Large Cap Blend segment of the US equity market.",
    "The fund is sponsored by First Trust Advisors. It has amassed assets over $2.72 B, making it one of the larger ETFs attempting to match the Large Cap Blend segment of the US equity market.",
    "Why Large Cap Blend",
    "Large cap companies typically have a market capitalization above $10 billion. They tend to be stable companies with predictable cash flows and are usually less volatile than mid and small cap companies.",
    "Blend ETFs usually hold a mix of growth and value stocks as well as stocks that exhibit both value and growth characteristics.",
    "Costs",
    "Cost is an important factor in selecting the right ETF, and cheaper funds can significantly outperform their more expensive counterparts if all other fundamentals are the same.",
    "Annual operating expenses for this ETF are 0.60%, putting it on par with most peer products in the space.",
    "It has a 12-month trailing dividend yield of 1.15%.",
    "Sector Exposure and Top Holdings",
    "ETFs offer a diversified exposure and thus minimize single stock risk but it is still important to delve into a fund's holdings before investing. Most ETFs are very transparent products and many disclose their holdings on a daily basis.",
    "This ETF has heaviest allocation to the Healthcare sector--about 22.70% of the portfolio. Financials and Information Technology round out the top three.",
    "Looking at individual holdings, Amgen Inc. (AMGN) accounts for about 2.35% of total assets, followed by American Tower Corporation (AMT) and Zoetis Inc. (ZTS).",
    "The top 10 holdings account for about 21.85% of total assets under management.",
    "Performance and Risk",
    "FTCS seeks to match the performance of the The Capital Strength Index before fees and expenses. The Capital Strength Index is an equal-dollar weighted index which provides exposure to well-capitalized companies with strong market positions based on strong balance sheets, high degree of liquidity, ability to generate earnings growth & record financial strength & profit growth.",
    "The ETF has added roughly 18.55% so far this year and is up about 5.27% in the last one year (as of 09/05/2019). In the past 52-week period, it has traded between $45.20 and $57.95.",
    "The ETF has a beta of 0.89 and standard deviation of 12.52% for the trailing three-year period, making it a medium risk choice in the space. With about 50 holdings, it has more concentrated exposure than peers.",
    "Alternatives",
    "First Trust Capital Strength ETF holds a Zacks ETF Rank of 2 (Buy), which is based on expected asset class return, expense ratio, and momentum, among other factors. Because of this, FTCS is an outstanding option for investors seeking exposure to the Style Box - Large Cap Blend segment of the market. There are other additional ETFs in the space that investors could consider as well.",
    "The iShares Core S&P 500 ETF (IVV) and the SPDR S&P 500 ETF (SPY) track a similar index. While iShares Core S&P 500 ETF has $182.88 B in assets, SPDR S&P 500 ETF has $263.32 B. IVV has an expense ratio of 0.04% and SPY charges 0.09%.",
    "Bottom-Line",
    "An increasingly popular option among retail and institutional investors, passively managed ETFs offer low costs, transparency, flexibility, and tax efficiency; they are also excellent vehicles for long term investors.",
    "To learn more about this product and other ETFs, screen for products that match your investment objectives and read articles on latest developments in the ETF investing universe, please visit Zacks ETF Center .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 06:50:00"
}