{
  "url": "https://www.nasdaq.com/article/sinous-trade-thaw-sparks-risk-rally-as-ecb-looms-20190912-00020",
  "title": "Sino-U.S. trade thaw sparks risk rally as ECB looms - Nasdaq.com",
  "text": [
    "By Tom Westbrook",
    "SINGAPORE, Sept 12 (Reuters) - The dollar rose to a six-week high against the safe-haven yen on Thursday after an exchange of olive branches between Washington and Beijing on trade stoked investors' appetite for risk.",
    "Export-driven Asian currencies from Taiwan to Australia rallied on the buoyant mood as the world's two largest economies each granted concessions in their heated tariff dispute.",
    "China on Wednesday exempted a basket of U.S. goods from its  tariffs, while U.S. President Donald Trump said in a tweet he would delay a scheduled tariff hike by two weeks in October.",
    "\"The nascent thaw in U.S. and China trade relations appears to be gathering momentum,\" said Jeffrey Halley, senior market analyst for Asia Pacific at brokerage OANDA in Singapore, who added a warning that it was unlikely to last.",
    "\"Just as the presidential tweet on tariffs this morning has injected more momentum...we are only one social media posting away from a thoroughly unpredictable President turning sentiment on its head,\" he said.",
    "The ebbing hostilities supported broader \"risk-on\" trading. Asian currencies climbed and stocks rose. Safety assets such as bonds and the yen were sold.",
    "The yen  dropped 0.5% against a rising Australian dollar  and hit 108.16 against the greenback, its weakest since Aug. 1. The Aussie hit a six-week high and the Chinese yuan  rose 0.4% to a three-week high of 7.0855 against the dollar.",
    "The Taiwan dollar had its best day in a month, rising 0.5% to 30.948 per U.S. dollar. The South Korean won  stood at 1183.08 per dollar, its strongest since the end of July.",
    "Outside of Asia, expectations for ECB easing this week have weighed on the euro. The single currency  has shed 3.5% since June and fell to a one-week low of $1.0983 overnight. It was steady at $1.1013 by mid-session in Asia.",
    "With growth slowing, the ECB has all but promised more support for the economy in one of the most closely watched meetings in years. ",
    "The ECB is almost certain to cut rates, promise to keep rates low for longer and provide banks relief from the side effects of negative rates. However, new asset purchases, priced in by markets, are not a done deal with some conservative policymakers opposing the move.",
    "\"Market reaction will likely hinge on the confirmation of a rate cut,\" said David de Garis, a director of economics and markets at National Australia Bank in London.",
    "\"The real kicker though will not be whether QE is re-started, but crucially, whether it leaves markets feeling the ECB is running out of room, or hamstrung by internal opposition,\" he said. \"What markets would not want to hear is during the press conference evidence of a disagreement.\"",
    "Sterling also dipped after a Scottish court ruled on Wednesday that Prime Minister Boris Johnson's suspension of the British Parliament was unlawful, prompting immediate calls for lawmakers to return to work as the government and Parliament battle over the future of Brexit. ",
    "The British pound  fell as much as 0.4% to $1.2313 overnight, and hovered around $1.2330 in Asian hours."
  ],
  "published_datetime": "2019-09-12 12:59:00"
}