{
  "url": "https://www.nasdaq.com/article/most-cee-currencies-seen-firming-as-global-markets-settle-20190905-00087",
  "title": "Most CEE currencies seen firming as global markets settle - Nasdaq.com",
  "text": [
    "By Alan Charlish and Miroslava Krufova",
    "WARSAW/PRAGUE, Sept 5 (Reuters) - Central Europe's main currencies will firm against the euro in the next 12 months, a Reuters poll found, but much depends on calmer conditions in global markets and delivery of expected monetary easing in the euro zone and the United States.",
    "The Czech crown , Polish zloty  and Hungarian forint  all softened in August, losing 0.9-2.0% of their value against the euro as fears of an escalating U.S.-China trade war and a disorderly withdrawal by the United Kingdom from the European Union dampened risk appetite.",
    "\"I believe some of the key risks will be solved or will settle at least during the next year,\" said Radomir Jac, chief economist at Generali Investments CEE, citing in particular global trade tensions and Brexit.",
    "\"Therefore, I believe the crown, zloty and forint have potential to strengthen over the next 12 months, certainly from the quite weak levels that were reached in late August and early September.\"",
    "The Czech crown is seen firming 2% against the euro over the coming year, while the Hungarian forint is expected to gain nearly 4% and the Polish zloty to strengthen 1.5%, according to the Aug. 29-Sept. 4 poll of 31 analysts.",
    "Adding to hopes of a decrease in global tensions is the outlook for stable rates in the region, which contrasts with expected cuts in major western economies.",
    "\"The strengthening in the case of all three currencies is connected with the expectations for easing of monetary policy both in the euro zone and in the U.S.,\" said Krystian Jaworski, senior economist at Credit Agricole CIB.",
    "On Tuesday, Reuters reported ECB policymakers are leaning towards a stimulus package that includes a rate cut and a beefed-up pledge to keep rates low for longer. ",
    "While Fed policymakers are split on whether a rate cut is required in the world's largest economy, markets expect a quarter-point decrease in the cost of borrowing in September. ",
    "In contrast, rate-setters in central Europe are adopting a wait-and-see approach, with the Fed and ECB's dovish stance taking the pressure off them to tighten monetary conditions in the face of inflationary pressures.",
    "The Romanian leu  is seen weakening 1.6% in a year as the country continues to grapple with its twin budget and current account deficits.",
    "\"For Romania we don't see any clues that the twin deficit story will improve, on the contrary the risks are on the other side to see further widening in the budget deficit and for sure the current account deficit,\" said Ciprian Dascalu, chief economist, Romania at ING.",
    "The Serbian dinar  is seen falling 0.3% in a year, according to the poll.",
    "\"It (the Serbian dinar)is heavily managed by the central bank, with intervention in a very tight range on both sides,\" Dascalu said.",
    "\"When we look at short-term inflows this has the potential to strengthen the dinar further but we suspect that the central bank will not allow it.\""
  ],
  "published_datetime": "2019-09-05 03:05:00"
}