{
  "url": "https://www.nasdaq.com/article/brazil-judge-orders-bayer-to-deposit-69-mln-in-soy-patent-dispute-20190904-01177",
  "title": "Brazil judge orders Bayer to deposit $69 mln in soy patent dispute - Nasdaq.com",
  "text": [
    "By Ana Mano",
    "SAO PAULO, Sept 4 (Reuters) - A Brazilian judge has ordered Germany's Bayer  to deposit an additional 286 million reais ($69.4 million) in an escrow account due to a patent dispute with local soybean farmers, according to a court decision seen by Reuters.",
    "Federal Judge Vanessa Gasques in the state of Mato Grosso issued the ruling late on Tuesday, ordering the company to make the deposit within 48 hours.",
    "The decision marks another setback in the case for Bayer after completing its takeover of U.S.-based Monsanto, which originally developed Intacta.",
    "In a statement on Wednesday, Bayer said it had not been notified of the ruling but added it would comply with all court decisions related to the case.",
    "Bayer said it \"remains confident\" of the validity of its patents and other rights related to the so-called \"Intacta RR2 PRO\" soy seed technology, noting it would continue to defend its patent rights.",
    "In July, Brazilian farmers in 10 states outside of Mato Grosso, where the patent dispute originated, were allowed to join the case as plaintiffs.",
    "The patent lawsuit, initiated in late 2017, centers around farmers' claim that the Intacta soy seed patent should be canceled due to a lack of meaningful technological innovation.",
    "Royalties from Intacta sales in Mato Grosso are estimated around 800 million reais per harvest, according to producers in the state.",
    "When royalties from farmers in the other 10 states are accounted for, the amount to be deposited in a judicial account could rise to as much as 2.7 billion reais, the lawyer representing farmers told Reuters in July. ",
    "Intacta's patent protection extends through October 2022.",
    "The Intacta RR2 PRO soybean seed offers protection against caterpillars and tolerance to the widely used glyphosate",
    "herbicide.",
    "($1 = 4.1196 reais)"
  ],
  "published_datetime": "2019-09-04 05:41:00"
}