{
  "url": "https://www.nasdaq.com/article/stock-market-news-today-september-11-2019-cm1210699",
  "title": "Stock Market News Today: September 11, 2019 - Nasdaq.com",
  "text": [
    "The stock market steadily gained ground on Wednesday, with meaningful gains by early afternoon for all the major indices.",
    "Data source: Yahoo! Finance.",
    "Those broad stock market gains were no match for the bad news that wreaked havoc on shares of GameStop (NYSE: GME) and Dave & Buster's (NASDAQ: PLAY) . Both stocks plunged after reporting disappointing results and slashing full-year guidance.",
    "Weak sales from video game retailer GameStop are to be expected, given that the next-generation of video game consoles are likely to be launched next year. But a lot more is going wrong for the company than the timing of the product cycle. GameStop stock was down 12.1% at 1:30 p.m. EDT Wednesday following a weak report and a guidance cut.",
    "GameStop's second-quarter sales plunged 14.3%, driven by an 11.6% decline in comparable store sales. Adjusted loss per share more than tripled to $0.32, missing analyst estimates by $0.10, and the company posted a massive $415 million GAAP loss thanks to a non-cash write-off.",
    "The biggest problem for GameStop is its lucrative used games business. Sales of pre-owned and value video game products crashed 17.5% in the quarter, and that segment is now about one-third smaller than it was in the lead-up to the previous console generation launch. Used games carry gross margins in excess of 40%, far higher than new games and hardware.",
    "With a weak second quarter in the books, GameStop lowered its full-year guidance. The company now expects comparable store sales to decline by a low-teens percentage, down from previous guidance calling for a 5% to 10% decline.",
    "New game consoles will eventually provide GameStop with a temporary sales boost, but it's hard to see a future for a brick-and-mortar seller of physical game discs.",
    "Shares of Dave & Buster's were down 5.8% at 1:30 p.m. EDT Wednesday after getting hit by two analyst downgrades following its second-quarter report. While revenue rose thanks to new locations, comparable store sales declined.",
    "Image source: Dave and Buster's.",
    "Total revenue was up 8% to $344.6 million, but this was driven by an 11.1% increase in the number of stores. Comparable store sales were down 1.8%, with an 0.8% decline in amusements and other, and a 3.2% decline in food and beverage .",
    "The bottom line beat expectations, but it wasn't enough to overshadow the weak sales performance. Earnings per share came in at $0.90, ahead of analyst estimates by $0.06.",
    "Analysts at Raymond James and William Blair reduced their ratings to \"market perform\" following the earnings report. Raymond James is concerned about deteriorating comparable sales trends, enough to warrant a downgrade despite a depressed valuation.",
    "Given the weak results, Dave & Buster's lowered its guidance for the full year. The company now expects comparable store sales to decline by 2% to 3.5%, down from a previous range of negative 1.5% to positive 0.5%.",
    "Building new stores will continue to grow revenue, but the market isn't happy about the problems at existing stores.",
    "10 stocks we like better than GameStop\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and GameStop wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Timothy Green has no position in any of the stocks mentioned. The Motley Fool owns shares of GameStop. The Motley Fool recommends Dave & Buster's Entertainment. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:50:00"
}