{
  "url": "https://www.nasdaq.com/article/small-drug-stock-outlook-innovation-holds-the-key-to-growth-cm1210618",
  "title": "Small Drug Stock Outlook: Innovation Holds the Key to Growth - Nasdaq.com",
  "text": [
    "The Zacks Medical-Drugs industry comprises small drug companies, including some foreign ones, which make medicines for both human and veterinary use. We have a separate industry outlook discussion for some of the biggest drugmakers of the world. (Read more: Large-Cap Pharmaceuticals Industry Near-Term Outlook Bright )",
    "Most of the small drugmakers have a limited portfolio of marketed drugs or in some cases no commercial-stage drugs at all. Some of these clinical stage drugmakers are dependent on just one marketed drug or pipeline candidate. For most of these companies, upfront or milestone payments from collaboration partners - in most cases their larger counterparts - are their main source of revenues. These companies therefore need ample free cash flow to fund their research and development activity.",
    "Here are the industry's three major themes:",
    "Successful innovation resulting in new drug approvals, important advances in clinical studies, strategic collaborations with strong partners and frequent M&A activity have kept these companies afloat in a competitive market. However, failure of key pipeline candidates in pivotal studies and regulatory and pipeline delays pose concerns.",
    "Zacks Industry Rank Indicates Bright Prospects",
    "The group's Zacks Industry Rank is basically the average of the Zacks Rank of all the member stocks.",
    "The Zacks Medical-Drugs industry currently carries a Zacks Industry Rank #75, which places it in the top 29% of more than 250 Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperforms the bottom 50% by a factor of more than 2 to 1.",
    "Before we present a few small drug stocks that are well positioned to outperform the market based on a strong earnings outlook, let's take a look at the industry's stock market performance and current valuation.",
    "Industry Underperforms S&P 500, Outperforms Sector",
    "The Zacks Medical-Drugs industry is a huge 172-stock group within the broader Medical sector. The industry has underperformed the S&P 500 but outperformed the Zacks Medical sector on a year-to-date basis.",
    "While the stocks in this industry have collectively risen 5.2% year to date, the Zacks S&P 500 composite has risen 17.5% while the Zacks Medical sector has been flat.",
    "Year-to-Date Price Performance",
    "Industry's Current Valuation",
    "On the basis of forward twelve months price-to-sales ratio (P/S F12M), which is a commonly used multiple for valuing these small drugmakers that hardly make profits, the industry is currently trading at 2.64 compared with the S&P 500's 3.13 and the Zacks Medical sector's 2.54.",
    "Over the last five years, the industry has traded as high as 3.64X, as low as 2.26X, and at the median of 2.79X, as the chart below shows.",
    "Price-to-Sales Forward Twelve Months (F12M) Ratio",
    "Bottom Line",
    "Currently, investment in small- and mid-cap drugmakers may make more sense as sales at larger pharma companies are being hurt by slowing product growth, generic and branded competition and increasing price pressure. However, the smaller companies also have their share of risk in the form of unstable cash flow. Also, negative clinical outcome or regulatory obstacles can be huge setbacks for these smaller companies and significantly hurt their share price.",
    "In the Medical-Drugs universe, five stocks currently sport a Zacks Rank #1 (Strong Buy), while several others have a Zacks Rank #2 (Buy). Here we discuss four stocks, which have a Zacks Rank #1 or 2 and have witnessed positive earnings estimate revisions in the past 60 days and stock price increases this year.",
    "You can see  the complete list of today's Zacks #1 Rank stocks here .",
    "Zoetis (ZTS): The Zacks Consensus Estimate for this Parsippany, NJ based animal health drugmaker's 2019 EPS has risen 2.6% over the past 60 days. Zoetis' stock has jumped 43.8% so far this year.",
    "Price and Consensus: ZTS",
    "Lannett Company (LCI): The Zacks Consensus Estimate for this Philadelphia, PA based generic drugmakers' 2019 EPS has risen 19.2% over the past 60 days. Lannett's stock has jumped 151% so far this year.",
    "Price and Consensus: LCI",
    "Verrica Pharmaceuticals (VRCA): The stock of this West Chester based clinical-stage medical dermatology company has risen 44.9% year to date. The consensus estimate for 2019 has narrowed from loss of $1.25 to $1.20 per share over the past 60 days.",
    "Price and Consensus: VRCA",
    "Galectin Therapeutics (GALT): The stock of this Norcross, GA based clinical stage biotech has risen 4.7% so far this year. The consensus estimate for 2019 has narrowed from loss of 51 cents to 37 cents over the past 60 days.",
    "Price and Consensus: GALT",
    "Looking for Stocks with Skyrocketing Upside?\r\n Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.\r\n Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.See the pot trades we're targeting>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:13:00"
}