{
  "url": "https://www.nasdaq.com/article/solomon-islands-to-sever-ties-with-taiwan-shift-alliance-to-beijing-20190905-00086",
  "title": "Solomon Islands to sever ties with Taiwan, shift alliance to Beijing - Nasdaq.com",
  "text": [
    "By Jonathan Barrett",
    "SYDNEY, Sept 5 (Reuters) - The Solomon Islands intends to sever diplomatic ties with Taiwan and align itself with Beijing, the leader of a high-level government team representing the South Pacific archipelago has said.",
    "The switch, which still needs to be formalised, would be a prize for China in its bid to peel away allies from what it considers a wayward province with no right to state-to-state ties. Only 17 countries now recognise Taiwan.",
    "\"We cannot sit for the next 40 years with our friends Taiwan. It is time that we make new friends - it's time that we should move on with our life,\" Agovaka said on Wednesday, according to a recording of the meeting in the capital Honiara.",
    "\"Our new relationship will deal with a One China policy; a One China policy that recognises only Beijing as the official government administration,\" he said in the recording, a copy of which was obtained by Reuters.",
    "The meeting was open to the public, but the recording has not been broadcast.",
    "Agovaka is a senior minister and leader of a government team convened recently to speak directly with Beijing. ",
    "The government is waiting for a task force report on the issue before it formally decides on a switch to Beijing.",
    "The task force is dominated by lawmakers who support a diplomatic change, two political sources with direct knowledge of the issue told Reuters.",
    "China and Taiwan have fought a tug-of-war for diplomatic recognition in the South Pacific for decades, with some island nations switching allegiances for financial gain.",
    "The South Pacific has been a diplomatic stronghold for Taiwan, where formal ties with six of the 16 island nations make up more than a third of its total alliances.",
    "Commenting during a regular daily news conference in Beijing, China'sForeign Ministry spokesman Geng Shuang would only say that China was willing to have relations with all countries on the basis of the \"one China\" principle. That refers to China's stance that Taiwan and it both belong to one China.",
    "Taiwan said it is watching developments in the Solomons.",
    "\"Relationship with Solomon Islands currently is stable, but we are closely monitoring the situation and development,\" said Joanne Ou, spokeswoman for Taiwan's foreign ministry.",
    "Solomon Islands has been assessing its Taiwan alliance since new Prime Minister Manasseh Sogavare took control after a general election in April and started looking for ways to improve the country's economic prospects. ",
    "The former British protectorate, an archipelago of just over 600,000 people, relies on timber exports to generate income.",
    "The Solomons have recognised Taiwan since 1983. It is the largest of the Taiwan-aligned Pacific countries, with access to the airfields and deepwater ports dating back to World War Two. ",
    "TAIWAN SUPPORT",
    "A diplomatic shift threatens to divide the island nation.",
    "Sixteen MPs have cited potential \"compromised freedoms\" as a reason against the switch in an open letter last month, while the country's university student population is largely backing Taiwan. ",
    "An observer at the committee hearings told Reuters there would be push-back against a switch, though it was not clear if there were options to block the government's desire for change.",
    "\"The government is trying to make a relationship with China now, but to formalise it we need to wait for the report,\" the observer said.",
    "Anti-graft agency Transparency Solomon Islands has urged caution in changing ties over concerns that the Solomons will not be able to hold firm against Beijing's interests.",
    "China is offering to bankroll a development fund for the Solomons to help with a transition away from Taiwan, which currently provides an annual $8.5 million contribution to the island nation.",
    "John Moffat Fugui, a Solomons' parliamentarian and head of the task force evaluating diplomatic ties, said on Wednesday that Beijing would pay into a fund even though it usually preferred \"grants, concessionary loans and sometimes gifts\".",
    "\"But for you, we will give you a [Rural Constituency Development Fund] for a certain period,\" Fugui said, referring to recent negotiations with Beijing officials.",
    "The Lowy Institute said in a report last month that Canberra and Washington are concerned about the Solomons switching recognition to Beijing.",
    "\"A switch by any one (of the states that recognise Taiwan) may stimulate others\" to abandon Taipei, the Australia-based think-tank said.",
    "The number of nations recognising Taiwan has been dwindling, with El Salvador in Central America, Burkina Faso in West Africa and the Dominican Republic in the Caribbean, all switching to China last year."
  ],
  "published_datetime": "2019-09-05 03:03:00"
}