{
  "url": "https://www.nasdaq.com/article/health-care-sector-update-for-09042019-rdypoddopgnhqy-cm1207499",
  "title": "Health Care Sector Update for 09/04/2019: RDY,PODD,OPGN,HQY - Nasdaq.com",
  "text": [
    "Top Health Care Stocks",
    "JNJ -0.1%",
    "PFE -0.9%",
    "ABT -0.09%",
    "MRK -1.09%",
    "AMGN +0.3%",
    "Health care stocks underperformed on Wednesday, with the NYSE Health Care Index (^NYP) slipping nearly 0.2% in late trade while the shares of health care companies in the S&P 500 also were down almost 0.2% as a group. The Nasdaq Biotechnology index (^NBI) was just higher, up 0.02%, this afternoon.",
    "Among health care stocks moving on news:",
    "(+) Dr. Reddy's Laboratories ( RDY  ) has stretched its advance to 5.3% late in Wednesday trading after Credit Suisse earlier raised its stock rating for the generics drugmaker to outperform from underperform previously.",
    "In other sector news:",
    "(+) OpGen ( OPGN  ) was trading more than 30% higher on Wednesday after the precision medicine company said it was acquiring Dutch molecular microbiology company Curetis NV. Under terms of the proposed transaction, OpGen will issue more than 2.66 million of its shares in exchange for 100% of Curetis' common stock. The deal is expected to close early in 2020, subject to shareholder and regulatory approvals.",
    "(-) HealthEquity ( HQY  ) fell nearly 3.5% on Wednesday after the health care benefits manager projected non-GAAP FY20 earnings lagging analyst estimates by a wide margin. Excluding one-time items, the company is expecting net income in a range of $1.10 to $1.16 per share for the 12 months ending Jan. 31 while analysts, on average, are looking for a $1.17 per share adjusted profit this year.",
    "(-) Insulet Corp ( PODD  ) fell more than 6% after the medical device company Wednesday priced an upsized $700 million private placement of its 0.375% convertible senior notes maturing in September 2026. The notes have an initial conversion price of about $226.73 per share - representing a 35% premium over Insulet's closing price on Tuesday - and are only convertible under certain circumstances until three months before their due date. The offering was increased by $40 million over the company's original plan shortly before pricing.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-04 03:34:43"
}