{
  "url": "https://www.nasdaq.com/article/top-buys-by-directors-hartys-4202k-bet-on-mdp-cm1210691",
  "title": "Top Buys by Directors: Harty's $420.2K Bet on MDP - Nasdaq.com",
  "text": [
    "The directors of a company tend to have a unique inside view into the business, so when directors make major buys, investors are wise to take notice. Presumably the only reason a director of a company would choose to take their hard-earned cash and use it to buy stock in the open market, is that they expect to make money - maybe they find the stock very undervalued, or maybe they see exciting progress within the company, or maybe both. So in this series we look at the largest insider buys by company directors over the trailing six month period, one of which was a total of $420.2K by Thomas H. Harty, CEO at Meredith Corp (Symbol: MDP).     Harty's average cost works out to $35.02/share. Shares of Meredith Corp were changing hands at $37.96 at last check, trading up about 7.7% on Wednesday. The chart below shows the one year performance of MDP shares, versus its 200 day moving average:     makeArticleAd();  Looking at the chart above, MDP's low point in its 52 week range is $31.43 per share, with $62.40 as the 52 week high point - that compares with a last trade of $37.96.    The current annualized dividend paid by Meredith Corp is $2.3/share, currently paid in quarterly installments, and its most recent dividend ex-date was on 08/29/2019. Below is a long-term dividend history chart for MDP, which can be of good help in judging whether the most recent dividend with approx. 6.5% annualized yield is likely to continue.      Click here to find out which other top insider   buys by company directors you need to know about »  ",
    "  Click here to find out which other top insider   buys by company directors you need to know about » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:09:11"
}