{
  "url": "https://www.nasdaq.com/article/purdue-pharma-reaches-tentative-opioid-settlement-with-some-20190911-00831",
  "title": "Purdue Pharma reaches tentative opioid settlement with some - Nasdaq.com",
  "text": [
    "By Mike Spector and Jessica DiNapoli",
    "NEW YORK, Sept 11 (Reuters) - OxyContin maker Purdue Pharma LP reached a tentative agreement with some plaintiffs to resolve litigation over its alleged role in fueling the U.S. opioid crisis and plans to tussle with states opposing the settlement offer in bankruptcy proceedings as soon as next week, people familiar with the matter said.",
    "On Wednesday, lead lawyers representing more than 2,000 cities, counties and other plaintiffs suing Purdue, along with 23 states and three U.S. territories, were on board with an offer from the company and its controlling Sackler family to settle lawsuits in a deal valued at up to $12 billion, the people said.",
    "States on Wednesday updated a federal judge on the settlement offer's support, which could evolve as the day progresses, the people said.",
    "Purdue's board is scheduled to be briefed on settlement progress on Thursday, one of the people said. There remained a chance negotiations could fall apart and the company's plans, including timing of a bankruptcy filing, could change, the person said.",
    "Reuters earlier on Wednesday reported that Purdue was nearing a settlement with cities and many states. ",
    "The Sacklers, well-known wealthy philanthropists, have declined to revise their proposed settlement contribution of $3 billion over seven years and another $1.5 billion or more through eventual sale of another business they own called Mundipharma, several people familiar with the matter said.",
    "New York, Massachusetts and Connecticut, where privately-held Purdue is based, are among states opposed to the current offer and have pushed the family to guarantee $4.5 billion, the people said.",
    "Last weekend, the Sacklers \"refused to budge\" after attorneys general in North Carolina and Tennessee presented them with counterproposals they said had widespread support from other states, according to correspondence reviewed by Reuters.",
    "The lawsuits, some of which target the Sacklers as well as Purdue, claim the family and company contributed to a public health crisis that has claimed the lives of nearly 400,000 people between 1999 and 2017, according to the latest U.S. data.",
    "The suits allege Purdue aggressively marketed prescription painkillers while misleading doctors and patients about their addiction and overdose risks. Purdue and the Sacklers have denied the allegations.",
    "FAMILY CONTRIBUTION A STICKING POINT",
    "With negotiations over the family's contribution to a settlement at loggerheads, Purdue is preparing to file for bankruptcy protection as soon as this weekend or next with the outlines of a settlement in hand, the people said.",
    "Purdue would then ask a U.S. bankruptcy judge to halt litigation while settlement discussions continue, a move some states said they are likely. A bankruptcy judge could force holdouts to accept a settlement as part of Purdue's reorganization plan if enough other plaintiffs agree (graphic).",
    "\"Purdue Pharma continues to work with all plaintiffs on reaching a comprehensive resolution to its opioid litigation that will deliver billions of dollars and vital opioid overdose rescue medicines to communities across the country impacted by the opioid crisis,\" the company said in a statement.",
    "Members of the Sackler family targeted in lawsuits said in a statement that they support \"working toward a global resolution that directs resources to the patients, families and communities across the country who are suffering and need assistance\" as opposed to engaging in what they described as \"endless litigation.\"",
    "With Purdue facing more than 2,000 opioid-related lawsuits, Reuters reported in March that the company and the Sacklers began exploring bankruptcy options to halt litigation and attempt to come to a far-reaching settlement. ",
    "One reason Purdue is eyeing a bankruptcy filing soon is to avoid an Oct. 21 trial, the people said. That trial, stemming from widespread lawsuits consolidated in an Ohio federal court, risks a verdict with outsize damages Purdue could not withstand, one of the people said.",
    "Lead lawyers for the cities and counties suing Purdue in the Ohio proceedings said they recommended the plaintiffs continue negotiating a final settlement based on parameters of the current proposal. ",
    "The Tennessee attorney's general's office said it had agreed to the offer's framework, calling it \"the most significant step to date in a multi-year investigation and negotiation to obtain meaningful relief to address the opioid addiction crisis.\" ",
    "Purdue's current proposal would use bankruptcy proceedings to transform into a public trust with a board selected by court-appointed trustees, the people said. The trust would donate drugs the company developed to combat opioid abuse to U.S. communities, which Purdue values at $4.45 billion over 10 years.",
    "The Sacklers, who amassed a multibillion-dollar fortune from OxyContin sales, would cede control of Purdue, they said.",
    "A Chapter 11 filing with a deal many states oppose risks triggering more litigation and longer, more expensive bankruptcy proceedings that could reduce payouts to plaintiffs unless a broader deal is reached.",
    "\"I remain steadfast in my view that the Sacklers have to give back the money they took from selling opioids so that we can put it toward solving the problem they created,\"  Connecticut Attorney General William Tong said in a statement. \"The current proposal does not do that.\"",
    "The Sacklers have rebuffed requests from some plaintiffs for more details on the family's finances, some of the people said.",
    "North Carolina Attorney General Josh Stein said he was preparing to follow other state officials and sue the Sacklers.",
    "\"A large number of states are committed to the notion that the Sacklers need to guarantee more money,\" he said. "
  ],
  "published_datetime": "2019-09-11 03:25:00"
}