{
  "url": "https://www.nasdaq.com/article/why-box-stock-surged-today-cm1207461",
  "title": "Why Box Stock Surged Today - Nasdaq.com",
  "text": [
    " What happened Shares of   Box    (NYSE: BOX) have surged today, up by 12% as of 11:50 a.m. EDT,   after activist investor Starboard Value disclosed a new stake in   the cloud storage provider. In a regulatory filing, the   hedge fund said it had acquired 11 million shares, good for a   7.5% stake. So what In the filing, Starboard states that it purchased the shares   believing that they were \"undervalued and represented an   attractive investment opportunity\" at the time of the   transaction. The fund \"may endeavor to increase or decrease their   position\" in Box based on overall market conditions.   Image source: Box.makeAd('4','300x250','mktsnews','vanguard','','');  The newly acquired stake makes Starboard Box's third-largest   shareholder behind Vanguard and   BlackRock    . Box has underperformed the broader market by a significant   margin since going public in 2015. Now what \"While we do not comment on interactions with our investors,   Box is committed to maintaining an active and engaged dialogue   with stockholders,\" Box responded in a statement. \"The Board   of Directors and management team are focused on delivering growth   and profitability to drive long-term stockholder value as we   continue to pioneer the Cloud Content Management market.\" Starboard has not yet come up with any detailed plan or   proposals regarding changes it wants to see but intends to engage   with Box's management team and board of directors. Those talks   could potentially include a sale of the company or other efforts   to maximize shareholder value, such as \"changes to the   capitalization.\" Like many   tech companies    , Box has a dual-class structure that gives insiders outsize   voting power.   10 stocks we like better than Box       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Box wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Evan Niu, CFA      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Box. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   Box    (NYSE: BOX) have surged today, up by 12% as of 11:50 a.m. EDT,   after activist investor Starboard Value disclosed a new stake in   the cloud storage provider. In a regulatory filing, the   hedge fund said it had acquired 11 million shares, good for a   7.5% stake.",
    "In the filing, Starboard states that it purchased the shares   believing that they were \"undervalued and represented an   attractive investment opportunity\" at the time of the   transaction. The fund \"may endeavor to increase or decrease their   position\" in Box based on overall market conditions.",
    "  Image source: Box.makeAd('4','300x250','mktsnews','vanguard','',''); ",
    "Image source: Box.",
    "The newly acquired stake makes Starboard Box's third-largest   shareholder behind Vanguard and   BlackRock    . Box has underperformed the broader market by a significant   margin since going public in 2015.",
    "\"While we do not comment on interactions with our investors,   Box is committed to maintaining an active and engaged dialogue   with stockholders,\" Box responded in a statement. \"The Board   of Directors and management team are focused on delivering growth   and profitability to drive long-term stockholder value as we   continue to pioneer the Cloud Content Management market.\"",
    "Starboard has not yet come up with any detailed plan or   proposals regarding changes it wants to see but intends to engage   with Box's management team and board of directors. Those talks   could potentially include a sale of the company or other efforts   to maximize shareholder value, such as \"changes to the   capitalization.\" Like many   tech companies    , Box has a dual-class structure that gives insiders outsize   voting power.",
    "  10 stocks we like better than Box       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Box wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Box       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Box wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Evan Niu, CFA      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Box. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 12:40:38"
}