{
  "url": "https://www.nasdaq.com/article/should-you-invest-in-the-fidelity-msci-energy-index-etf-feny-cm1207319",
  "title": "Should You Invest in the Fidelity MSCI Energy Index ETF (FENY)? - Nasdaq.com",
  "text": [
    " Looking for broad exposure to the Energy - Broad segment of the equity market? You should consider the Fidelity MSCI Energy Index ETF (FENY), a passively managed exchange traded fund launched on 10/21/2013. While an excellent vehicle for long term investors, passively managed ETFs are a popular choice among institutional and retail investors due to their low costs, transparency, flexibility, and tax efficiency. Sector ETFs also provide investors access to a broad group of companies in particular sectors that offer low risk and diversified exposure. Energy - Broad is one of the 16 broad Zacks sectors within the Zacks Industry classification. It is currently ranked 14, placing it in bottom 13%.  Index Details  The fund is sponsored by Fidelity. It has amassed assets over $404.59 M, making it one of the larger ETFs attempting to match the performance of the Energy - Broad segment of the equity market. FENY seeks to match the performance of the MSCI USA IMI Energy Index before fees and expenses. MSCI USA IMI Energy Index represents the performance of the energy sector in the U.S. equity market.  Costs  Investors should also pay attention to an ETF's expense ratio. Lower cost products will produce better results than those with a higher cost, assuming all other metrics remain the same. Annual operating expenses for this ETF are 0.08%, making it the least expensive product in the space. It has a 12-month trailing dividend yield of 3.63%.  Sector Exposure and Top Holdings  Even though ETFs offer diversified exposure that minimizes single stock risk, investors should also look at the actual holdings inside the fund. Luckily, most ETFs are very transparent products that disclose their holdings on a daily basis. This ETF has heaviest allocation in the Energy sector--about 99.70% of the portfolio. Looking at individual holdings, Exxon Mobil Corp (XOM) accounts for about 23.93% of total assets, followed by Chevron Corp (CVX) and Conocophillips (COP). The top 10 holdings account for about 70.48% of total assets under management.  Performance and Risk  Year-to-date, the Fidelity MSCI Energy Index ETF has lost about -0.76% so far, and is down about -24.48% over the last 12 months (as of 09/04/2019). FENY has traded between $14.63 and $21.82 in this past 52-week period. The ETF has a beta of 1.20 and standard deviation of 19.69% for the trailing three-year period, making it a high risk choice in the space. With about 135 holdings, it effectively diversifies company-specific risk.  Alternatives  Fidelity MSCI Energy Index ETF carries a Zacks ETF Rank of 3 (Hold), which is based on expected asset class return, expense ratio, and momentum, among other factors. Thus, FENY is a good option for those seeking exposure to the Energy ETFs area of the market. Investors might also want to consider some other ETF options in the space. Vanguard Energy ETF (VDE) tracks MSCI US Investable Market Energy 25/50 Index and the Energy Select Sector SPDR Fund (XLE) tracks Energy Select Sector Index. Vanguard Energy ETF has $3.05 B in assets, Energy Select Sector SPDR Fund has $10.01 B. VDE has an expense ratio of 0.10% and XLE charges 0.13%.  Bottom Line  To learn more about this product and other ETFs, screen for products that match your investment objectives and read articles on latest developments in the ETF investing universe, please visit Zacks ETF Center  .   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeAd('4','300x250','mktsnews','vanguard','','');  Fidelity MSCI Energy Index ETF (FENY): ETF Research Reports   Energy Select Sector SPDR Fund (XLE): ETF Research Reports   Vanguard Energy ETF (VDE): ETF Research Reports   Exxon Mobil Corporation (XOM): Free Stock Analysis Report   Chevron Corporation (CVX): Free Stock Analysis Report   ConocoPhillips (COP): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Looking for broad exposure to the Energy - Broad segment of the equity market? You should consider the Fidelity MSCI Energy Index ETF (FENY), a passively managed exchange traded fund launched on 10/21/2013.",
    "While an excellent vehicle for long term investors, passively managed ETFs are a popular choice among institutional and retail investors due to their low costs, transparency, flexibility, and tax efficiency.",
    "Sector ETFs also provide investors access to a broad group of companies in particular sectors that offer low risk and diversified exposure. Energy - Broad is one of the 16 broad Zacks sectors within the Zacks Industry classification. It is currently ranked 14, placing it in bottom 13%.",
    " Index Details ",
    "The fund is sponsored by Fidelity. It has amassed assets over $404.59 M, making it one of the larger ETFs attempting to match the performance of the Energy - Broad segment of the equity market. FENY seeks to match the performance of the MSCI USA IMI Energy Index before fees and expenses.",
    "MSCI USA IMI Energy Index represents the performance of the energy sector in the U.S. equity market.",
    " Costs ",
    "Investors should also pay attention to an ETF's expense ratio. Lower cost products will produce better results than those with a higher cost, assuming all other metrics remain the same.",
    "Annual operating expenses for this ETF are 0.08%, making it the least expensive product in the space.",
    "It has a 12-month trailing dividend yield of 3.63%.",
    " Sector Exposure and Top Holdings ",
    "Even though ETFs offer diversified exposure that minimizes single stock risk, investors should also look at the actual holdings inside the fund. Luckily, most ETFs are very transparent products that disclose their holdings on a daily basis.",
    "This ETF has heaviest allocation in the Energy sector--about 99.70% of the portfolio.",
    "Looking at individual holdings, Exxon Mobil Corp (XOM) accounts for about 23.93% of total assets, followed by Chevron Corp (CVX) and Conocophillips (COP).",
    "The top 10 holdings account for about 70.48% of total assets under management.",
    " Performance and Risk ",
    "Year-to-date, the Fidelity MSCI Energy Index ETF has lost about -0.76% so far, and is down about -24.48% over the last 12 months (as of 09/04/2019). FENY has traded between $14.63 and $21.82 in this past 52-week period.",
    "The ETF has a beta of 1.20 and standard deviation of 19.69% for the trailing three-year period, making it a high risk choice in the space. With about 135 holdings, it effectively diversifies company-specific risk.",
    " Alternatives ",
    "Fidelity MSCI Energy Index ETF carries a Zacks ETF Rank of 3 (Hold), which is based on expected asset class return, expense ratio, and momentum, among other factors. Thus, FENY is a good option for those seeking exposure to the Energy ETFs area of the market. Investors might also want to consider some other ETF options in the space.",
    "Vanguard Energy ETF (VDE) tracks MSCI US Investable Market Energy 25/50 Index and the Energy Select Sector SPDR Fund (XLE) tracks Energy Select Sector Index. Vanguard Energy ETF has $3.05 B in assets, Energy Select Sector SPDR Fund has $10.01 B. VDE has an expense ratio of 0.10% and XLE charges 0.13%.",
    " Bottom Line ",
    "To learn more about this product and other ETFs, screen for products that match your investment objectives and read articles on latest developments in the ETF investing universe, please visit Zacks ETF Center  .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:48:00"
}