{
  "url": "https://www.nasdaq.com/article/how-to-pay-student-loans-while-living-abroad-cm1206860",
  "title": "How to Pay Student Loans While Living Abroad - Nasdaq.com",
  "text": [
    "  Moving overseas doesn't get you out of paying your student   loans.  Student loans shouldn't hold you back from pursuing your dreams, even if that dream is to live abroad. Moving overseas while carrying student loan debt can be scary and cause hesitation. But with proper planning and some financial strategy, it can actually be advantageous and help to pay off your student loans faster  . Here's what you need to do to prepare your student loans  before moving abroad.   Image source: Getty ImagesmakeArticleAd();  Figure out if you'll need an international bank account Depending on your current bank and employer, you may want to open an international bank account in order to access your funds while abroad. Major banks like Chase and CitiBank have branches all over the world, increasing your chances that they will have a local branch close to where you'll be living. But if your bank is limited to the U.S. and you plan on living abroad long-term, you'll probably want to open a local bank account. Indeed, if you are employed by a local company in another country, they may need you to open an international bank account so that you can get paid. However, if you're still working for an American company, you can probably keep your U.S. account and continue making student loan payments like you always have. Once you've worked out whether you need an international bank account, it is important to find out whether your provider will accept student loan payments from it. Student loan payment options for people living abroad There are several options for making your student loan payments while living abroad. You should get your bank accounts in order and determine the best payment method before moving overseas. This will help you maximize your funds by avoiding potential fees and provide you with an organized plan so you never miss a payment. Paying student loans with a U.S. bank account if you're working for a U.S. company If you're living abroad but working for a U.S. company that can deposit your paycheck into your U.S. bank account, the solution is easy -- pay your student loans directly from your U.S. bank account. This is the best-case scenario for seamlessly managing your student loan repayment while living abroad. Paying student loans with a U.S. bank account if you're working for an international company If you're working for a company abroad that deposits your paychecks into an international bank account, you probably won't be able to pay your student loans directly from that account. In this case, you'll need to set up regular transfers from your international bank account to your U.S. one so that you can pay your student loans from there. Not only will you be responsible for managing the additional step of making the transfers, it's likely you'll incur transfer fees as well. Always make sure you have enough money in your U.S. bank account to pay your loans on time:  Start by putting extra funds in your account to act as a   safety net while you figure out the transfer process and   timeline. Set up automatic transfers to your U.S. account so that you   always have enough money there. Transfers can take a few days to process, so make sure you   set them up to arrive well before your student loan payment   date. Talk with your bank to figure out the best way to deposit   money from an international account and plan for what the fees   will be.  Paying student loans with a credit card You'll need to make sure your student loan provider accepts credit card payments, (federal student loan providers do not), and find out whether there are any associated fees for using a credit card. This isn't the best option because of associated fees, but it can work in a pinch. You'll need to use a U.S. credit card to make your student loan payment, and then you'll also need to use a U.S. bank account to pay off your credit card bill without incurring additional fees. Make sure you pay your bill immediately to avoid interest charges. The benefit of this method is that you get a short grace period between when you make your student loan payment and when you have to pay off your credit card. If you're in a bind -- for example, if your money didn't transfer to your U.S. bank account in time to pay your student loans -- this option can work in your favor. What to discuss with your student loan provider before moving abroad Before packing up your life and moving to another country, talk with your student loan provider so everyone is on the same page. This can help you avoid any payment mishaps or confusion, so your student loans don't hold you back while abroad.   Give them your international address and phone   number:    Ensure your loan provider has your most up-to-date information in   case they need to contact you. Provide them with your new local   address or the address of someone who is reliable and close to   you, like a parent. Update your phone number and email so you   don't miss any important information or documents that may be   sent to you.  Create a document with your lender's contact information,   due dates, and monthly payment information:    Keep track of your payments all in one place while you're abroad.   Create a simple spreadsheet that's stored in the cloud and can be   accessed from any device in case your device is lost or stolen.   The more organized you are up-front, the less likely you will be   to forget about your student loans while figuring out your new   life.  Ask about any fees involved with paying by your method of   choice:    Credit card processing fees, bank transfer fees, and foreign   transaction fees can add up quickly, especially when they aren't   planned for. Make sure you understand what fees may be incurred   and explore other payment options to avoid unnecessary fees.  Consider setting up autopay:    This is crucial to make sure you stay on top of your payments   while living abroad. Ask your loan provider if they offer any   discounts for setting up autopay -- some providers offer a 0.25%   reduction just for setting one up. You'll save money and avoid   missing any payments. The key here is to always make sure you   have enough money in your bank account to make the monthly   payment.        Decide whether your current repayment plan will still work for you once you move abroad Since you're moving abroad and likely changing jobs, it's important you make sure your repayment plan is still the best option for you given your new salary and cost of living. Private lenders don't always offer flexible repayment plans, but your federal loans come with a number of flexible repayment options  . You can consider refinancing your student loans  if you have good credit. This can lower your monthly payments and save you money by reducing your interest rate. However, it can also extend your repayment period and cause you to lose out on other benefits. Be sure to compare rates and benefits before signing up for a new loan.  Student loan consolidation  is also worth considering. It can simplify your payments so you don't have to worry about multiple due dates and payments while abroad. The downside is that consolidation may also extend your repayment period and leave you paying more over the life of your loan. At the same time, if you have less disposable income overseas, it could make your monthly payments more manageable. You should weigh the pros and cons for your given situation before jumping into loan consolidation. Pay off your student loans early if you can Living abroad can actually benefit you when it comes to paying off your student loans. If you're able to maintain your current salary while moving to an area with a lower cost of living, or if you're able to secure a job that includes housing, you'll immediately have more disposable income. Those extra funds can be put toward your student loans to save you money in interest and pay down your balance faster. However, this takes commitment, as you may be tempted to use that additional cash flow to explore your new surroundings. Moving to a new country doesn't make your student loans disappear. Set yourself up for success by organizing your finances ahead of time and keeping in touch with your student loan provider. It's easy to get caught up in the adventure and newness of living abroad, but you must stay on top of managing your student debt in order to prevent your loans from going into default and wreaking havoc on your finances. Save thousands on student loan interest Many people are missing out on lower student loan interest rates because they don't take the time to research their refinancing options. Our picks of the best student loan providers  can help you save thousands of dollars in interest over time. Click here  to uncover the best-in-class student loans providers we could find in 2019.  The Motley Fool owns and recommends MasterCard and Visa, and recommends American Express. We're firm believers in the Golden Rule. If we wouldn't recommend an offer to a close family member, we wouldn't recommend it on The Ascent either. Our number one goal is helping people find the best offers to improve their finances. That is why editorial opinions are ours alone and have not been previously reviewed, approved, or endorsed by included advertisers. Editorial content from The Ascent is separate from The Motley Fool editorial content and is created by a different analyst team.",
    " Moving overseas doesn't get you out of paying your student   loans. ",
    "Student loans shouldn't hold you back from pursuing your dreams, even if that dream is to live abroad. Moving overseas while carrying student loan debt can be scary and cause hesitation. But with proper planning and some financial strategy, it can actually be advantageous and help to pay off your student loans faster  . Here's what you need to do to prepare your student loans  before moving abroad.",
    "  Image source: Getty ImagesmakeArticleAd(); ",
    "Image source: Getty Images",
    "Depending on your current bank and employer, you may want to open an international bank account in order to access your funds while abroad.",
    "Major banks like Chase and CitiBank have branches all over the world, increasing your chances that they will have a local branch close to where you'll be living. But if your bank is limited to the U.S. and you plan on living abroad long-term, you'll probably want to open a local bank account.",
    "Indeed, if you are employed by a local company in another country, they may need you to open an international bank account so that you can get paid. However, if you're still working for an American company, you can probably keep your U.S. account and continue making student loan payments like you always have.",
    "Once you've worked out whether you need an international bank account, it is important to find out whether your provider will accept student loan payments from it.",
    "There are several options for making your student loan payments while living abroad. You should get your bank accounts in order and determine the best payment method before moving overseas. This will help you maximize your funds by avoiding potential fees and provide you with an organized plan so you never miss a payment.",
    "If you're living abroad but working for a U.S. company that can deposit your paycheck into your U.S. bank account, the solution is easy -- pay your student loans directly from your U.S. bank account. This is the best-case scenario for seamlessly managing your student loan repayment while living abroad.",
    "If you're working for a company abroad that deposits your paychecks into an international bank account, you probably won't be able to pay your student loans directly from that account. In this case, you'll need to set up regular transfers from your international bank account to your U.S. one so that you can pay your student loans from there. Not only will you be responsible for managing the additional step of making the transfers, it's likely you'll incur transfer fees as well.",
    "Always make sure you have enough money in your U.S. bank account to pay your loans on time:",
    "You'll need to make sure your student loan provider accepts credit card payments, (federal student loan providers do not), and find out whether there are any associated fees for using a credit card. This isn't the best option because of associated fees, but it can work in a pinch. You'll need to use a U.S. credit card to make your student loan payment, and then you'll also need to use a U.S. bank account to pay off your credit card bill without incurring additional fees. Make sure you pay your bill immediately to avoid interest charges.",
    "The benefit of this method is that you get a short grace period between when you make your student loan payment and when you have to pay off your credit card. If you're in a bind -- for example, if your money didn't transfer to your U.S. bank account in time to pay your student loans -- this option can work in your favor.",
    "Before packing up your life and moving to another country, talk with your student loan provider so everyone is on the same page. This can help you avoid any payment mishaps or confusion, so your student loans don't hold you back while abroad.",
    "Since you're moving abroad and likely changing jobs, it's important you make sure your repayment plan is still the best option for you given your new salary and cost of living. Private lenders don't always offer flexible repayment plans, but your federal loans come with a number of flexible repayment options  .",
    "You can consider refinancing your student loans  if you have good credit. This can lower your monthly payments and save you money by reducing your interest rate. However, it can also extend your repayment period and cause you to lose out on other benefits. Be sure to compare rates and benefits before signing up for a new loan.",
    " Student loan consolidation  is also worth considering. It can simplify your payments so you don't have to worry about multiple due dates and payments while abroad. The downside is that consolidation may also extend your repayment period and leave you paying more over the life of your loan. At the same time, if you have less disposable income overseas, it could make your monthly payments more manageable. You should weigh the pros and cons for your given situation before jumping into loan consolidation.",
    "Living abroad can actually benefit you when it comes to paying off your student loans. If you're able to maintain your current salary while moving to an area with a lower cost of living, or if you're able to secure a job that includes housing, you'll immediately have more disposable income. Those extra funds can be put toward your student loans to save you money in interest and pay down your balance faster. However, this takes commitment, as you may be tempted to use that additional cash flow to explore your new surroundings.",
    "Moving to a new country doesn't make your student loans disappear. Set yourself up for success by organizing your finances ahead of time and keeping in touch with your student loan provider. It's easy to get caught up in the adventure and newness of living abroad, but you must stay on top of managing your student debt in order to prevent your loans from going into default and wreaking havoc on your finances.",
    "Many people are missing out on lower student loan interest rates because they don't take the time to research their refinancing options. Our picks of the best student loan providers  can help you save thousands of dollars in interest over time. Click here  to uncover the best-in-class student loans providers we could find in 2019.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:00:00"
}