{
  "url": "https://www.nasdaq.com/article/jeff-clarks-market-minute-this-chart-will-signal-the-next-decline-cm1210660",
  "title": "Jeff Clark’s Market Minute: This Chart Will Signal the Next Decline - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "The stock market broke out to the upside last Thursday. Then it stalled.",
    "We were only about 10 minutes into the trading day Thursday morning when the S&P 500 tagged the 2975 level. It has been stuck there ever since.",
    "Oh sure, the index has been a few points higher and a few points lower. For the most part, though, it has been four straight days of \"go nowhere\" action.",
    "Usually, following the type of big move we saw on Thursday morning, the stock market might consolidate for a day or two, work off any overbought conditions, and build energy for another move higher. But, the longer it takes for that next move to get started, the less likely it is for the rally to continue.",
    "So, as the stock market traded lower yesterday morning, lots of talking heads were on the financial television networks suggesting that Thursday's breakout move was over and stocks would soon start heading lower.",
    "I disagree. There's still more upside left to this breakout move. Not a lot, but enough to justify waiting a bit before loading your portfolio with short positions.",
    "Let me explain…",
    "The action in high-yield bonds (a.k.a. junk bonds) tends to lead the action in the stock market by anywhere from two days to two weeks. And, the action in junk bonds so far this month has been undeniably bullish.",
    "Look at this chart of the iShares iBoxx High Yield Corporate Bond Fund (NYSE: HYG )…",
    "HYG closed at a new all-time high yesterday. It's quite unlikely that the broad stock market will fall sharply while investors are still willing to put money into risky assets like junk bonds at all-time-high prices. It's also trading above both the 50-day  moving average  and 9-day  exponential moving average  - another bullish sign.",
    "So, as long as this chart of HYG continues to hold up, there's more upside ahead for stocks.",
    "Last Thursday's breakout to the upside for the S&P 500 was for real. I continue to think the index will rally up to the 3,000-3,020 level before this rally phase is over.",
    "But, traders should keep a close eye on this chart of HYG. It will provide an early signal for when the stock market is ready to decline again.",
    "Best regards and good trading,",
    "Jeff Clark",
    "America's Top Options Expert",
    "For the past 36 years, millionaire trader Jeff Clark's options strategies have helped everyday people have the chance to retire wealthy.",
    "Which is why Jeff's now offering his complete Blueprint, and a year of his guidance, for just $19.",
    "That's right… for a limited time it's all yours for less than 20 bucks.",
    "Because Jeff knows that every $1 you use on his strategies could turn into a windfall in a short amount of time.",
    "Get started here.",
    "The post Jeff Clark's Market Minute: This Chart Will Signal the Next Decline appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:15:03"
}