{
  "url": "https://www.nasdaq.com/article/analyst-endorses-arcelormittal-what-you-need-to-know-cm1206913",
  "title": "Analyst Endorses ArcelorMittal: What You Need to Know - Nasdaq.com",
  "text": [
    "  Every day, Wall Street analysts upgrade some stocks,     downgrade others, and \"initiate coverage\" on a few more. But do     these analysts even know what they're talking about? Today,     we're taking one high-profile Wall Street pick and putting it     under the microscope...  Steel stocks got walloped last month. Shares of steel minimill operator   Nucor    (NYSE: NUE) fell 13% from the end of July to the end of August,   while   U.S. Steel    (NYSE: X) plummeted 30%, culminating in price target cuts on both   companies at the end of the month, when investment banker   Citigroup lowered its targets for Nucor and U.S. Steel to $55 and   $12, respectively.makeArticleAd(); The reason? In part, it's the ongoing   trade war    between the U.S. and China, which has weighed on the global   economy and caused steel consumers to cut back on their orders.   In part, it's...   still    the trade war, which heated up even more last month after China   restarted a threatened 25% tariff on imports of American cars and   trucks, promising to hurt automobile production in the U.S., as   well as demand for steel to produce such vehicles.   Image source: Getty Images.  But hope springs eternal for steel investors, and this   morning, the industry is getting a bit of a lift from a note out   at Credit Suisse. In a positive initiation jus   t report    ed by   SteetInsider.com    , we learn that the Swiss megabanker thinks steel prices are due   for a turnaround -- perhaps as early as Q1 of next year.   Surveying the industry, the analyst picks European steelmaker   ArcelorMittal    (NYSE: MT) as perhaps the first steel specialist to benefit from   an improving global economy. Here's what you need to know. Reversing course on steel sentiment Just four months ago, Credit Suisse   was feeling bearish    , warning that the Trump administration's cease-fire on steel   tariffs against Canada and Mexico would admit a wave of cheap   steel into the U.S., depressing prices for U.S. steelmakers. The   threat of cheap Canadian steel from Stelco in particular prompted   the analyst to downgrade American companies   Steel Dynamics    (NASDAQ: STLD) and   AK Steel    (NYSE: AKS) . Today, however, Credit Suisse is looking to foreign shores for   a revival in steel demand, initiating coverage of European steel   giant ArcelorMittal with an outperform rating and a $29 price   target. Steel prices continued rising for about a month after Credit   Suisse's downgrades, you see, topping out around $920 a ton for   U.S. Midwest domestic hot-rolled coil, for example. But they then   fell as low as $525 a ton by early July. That month, however,   global steelmakers began slowing production of their product, and   partly as a result of that, steel prices inched back upwards in   August, reaching $584 per ton. Credit Suisse expects this trend of reviving steel prices to   continue, and predicts a clear turnaround in the steel market   within the next six months, which would imply better prices   toward the end of Q1 2020. Who will benefit? Credit Suisse predicts that ArcelorMittal could be a   top stock to buy    on strong steel prices, and \"a major cash generator following two   years of investing in growth,\" as StreetInsider reports. And   indeed, the company is already showing some strength in this   regard. True, profitability as calculated according to generally   accepted accounting principles (   GAAP    ) is down lately, but over the past 12 months, free cash flow at   ArcelorMittal has jumped to $1.8 billion, trending up sharply   from the $891 million in positive cash profits produced last   year. And ArcelorMittal isn't the only one. Nucor's free cash flow is also climbing, hitting $1.4 billion   over the past 12 months, according to      S&P Global Market Intelligence    data, despite a slide in GAAP profitability. And at Nucor's   archrival, Steel Dynamics -- one of the companies Credit Suisse   downgraded in May -- free cash flow of $1.2 billion is at least   holding steady for the time being. Not all steel companies are doing as well. At AK Steel, for   example (the other company Credit Suisse downgraded last spring),   cash generation is slipping and capital spending is rising,   resulting in a one-third decline in trailing free cash flow   versus 2018 levels. U.S. Steel, where free cash flow turned   negative last year, is seeing the cash drain worsen in 2019 --   even as the company reports $1 billion in GAAP profits,   indicating poor quality o   f earnings    . But as a general rule, what's good for one steelmaker (i.e.,   greater steel demand and higher steel prices) should tend to   benefit even these weaker players. Caveats and provisos One concern that doesn't get much mention in Credit Suisse's   note, I think, that   does    deserve highlighting, is debt. Too-high debt loads can weigh on   any stock, even in a bull market for steel, and would be   especially problematic if Credit Suisse's forecast proves to be   off the mark and steel prices don't rebound as quickly as   predicted. In that regard, I have to say that Nucor and Steel Dynamics,   with debt loads just a small fraction of their market   capitalizations, look much better-positioned to ride a bull   market (or ride out a bear) than their rivals do. Using a common   industry metric, both companies also carry total debt-to-   EBITDA    ratios of less than 1.5, versus 1.8 for ArcelorMittal, 2.1 for   U.S. Steel, and 3.3 for AK Steel. If I were looking to invest in steel stocks on the basis of   Credit Suisse's upgrade today, I'd be considering shares of these   companies in basically that order of attractiveness.   10 stocks we like better than Nucor       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Nucor wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Rich Smith      has no position in any of the stocks mentioned. The Motley Fool     recommends Nucor. The Motley Fool has a     disclosure policy      .  ",
    " Every day, Wall Street analysts upgrade some stocks,     downgrade others, and \"initiate coverage\" on a few more. But do     these analysts even know what they're talking about? Today,     we're taking one high-profile Wall Street pick and putting it     under the microscope... ",
    "Steel stocks got walloped last month.",
    "Shares of steel minimill operator   Nucor    (NYSE: NUE) fell 13% from the end of July to the end of August,   while   U.S. Steel    (NYSE: X) plummeted 30%, culminating in price target cuts on both   companies at the end of the month, when investment banker   Citigroup lowered its targets for Nucor and U.S. Steel to $55 and   $12, respectively.",
    "The reason? In part, it's the ongoing   trade war    between the U.S. and China, which has weighed on the global   economy and caused steel consumers to cut back on their orders.   In part, it's...   still    the trade war, which heated up even more last month after China   restarted a threatened 25% tariff on imports of American cars and   trucks, promising to hurt automobile production in the U.S., as   well as demand for steel to produce such vehicles.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "But hope springs eternal for steel investors, and this   morning, the industry is getting a bit of a lift from a note out   at Credit Suisse. In a positive initiation jus   t report    ed by   SteetInsider.com    , we learn that the Swiss megabanker thinks steel prices are due   for a turnaround -- perhaps as early as Q1 of next year.   Surveying the industry, the analyst picks European steelmaker   ArcelorMittal    (NYSE: MT) as perhaps the first steel specialist to benefit from   an improving global economy.",
    "Here's what you need to know.",
    "Just four months ago, Credit Suisse   was feeling bearish    , warning that the Trump administration's cease-fire on steel   tariffs against Canada and Mexico would admit a wave of cheap   steel into the U.S., depressing prices for U.S. steelmakers. The   threat of cheap Canadian steel from Stelco in particular prompted   the analyst to downgrade American companies   Steel Dynamics    (NASDAQ: STLD) and   AK Steel    (NYSE: AKS) .",
    "Today, however, Credit Suisse is looking to foreign shores for   a revival in steel demand, initiating coverage of European steel   giant ArcelorMittal with an outperform rating and a $29 price   target.",
    "Steel prices continued rising for about a month after Credit   Suisse's downgrades, you see, topping out around $920 a ton for   U.S. Midwest domestic hot-rolled coil, for example. But they then   fell as low as $525 a ton by early July. That month, however,   global steelmakers began slowing production of their product, and   partly as a result of that, steel prices inched back upwards in   August, reaching $584 per ton.",
    "Credit Suisse expects this trend of reviving steel prices to   continue, and predicts a clear turnaround in the steel market   within the next six months, which would imply better prices   toward the end of Q1 2020.",
    "Credit Suisse predicts that ArcelorMittal could be a   top stock to buy    on strong steel prices, and \"a major cash generator following two   years of investing in growth,\" as StreetInsider reports. And   indeed, the company is already showing some strength in this   regard.",
    "True, profitability as calculated according to generally   accepted accounting principles (   GAAP    ) is down lately, but over the past 12 months, free cash flow at   ArcelorMittal has jumped to $1.8 billion, trending up sharply   from the $891 million in positive cash profits produced last   year. And ArcelorMittal isn't the only one.",
    "Nucor's free cash flow is also climbing, hitting $1.4 billion   over the past 12 months, according to      S&P Global Market Intelligence    data, despite a slide in GAAP profitability. And at Nucor's   archrival, Steel Dynamics -- one of the companies Credit Suisse   downgraded in May -- free cash flow of $1.2 billion is at least   holding steady for the time being.",
    "Not all steel companies are doing as well. At AK Steel, for   example (the other company Credit Suisse downgraded last spring),   cash generation is slipping and capital spending is rising,   resulting in a one-third decline in trailing free cash flow   versus 2018 levels. U.S. Steel, where free cash flow turned   negative last year, is seeing the cash drain worsen in 2019 --   even as the company reports $1 billion in GAAP profits,   indicating poor quality o   f earnings    .",
    "But as a general rule, what's good for one steelmaker (i.e.,   greater steel demand and higher steel prices) should tend to   benefit even these weaker players.",
    "One concern that doesn't get much mention in Credit Suisse's   note, I think, that   does    deserve highlighting, is debt. Too-high debt loads can weigh on   any stock, even in a bull market for steel, and would be   especially problematic if Credit Suisse's forecast proves to be   off the mark and steel prices don't rebound as quickly as   predicted.",
    "In that regard, I have to say that Nucor and Steel Dynamics,   with debt loads just a small fraction of their market   capitalizations, look much better-positioned to ride a bull   market (or ride out a bear) than their rivals do. Using a common   industry metric, both companies also carry total debt-to-   EBITDA    ratios of less than 1.5, versus 1.8 for ArcelorMittal, 2.1 for   U.S. Steel, and 3.3 for AK Steel.",
    "If I were looking to invest in steel stocks on the basis of   Credit Suisse's upgrade today, I'd be considering shares of these   companies in basically that order of attractiveness.",
    "  10 stocks we like better than Nucor       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Nucor wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Nucor       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Nucor wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Rich Smith      has no position in any of the stocks mentioned. The Motley Fool     recommends Nucor. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 15:05:00"
}