{
  "url": "https://www.nasdaq.com/article/tuesday-sector-leaders-utilities-financial-cm1206854",
  "title": "Tuesday Sector Leaders: Utilities, Financial - Nasdaq.com",
  "text": [
    "Looking at the sectors faring best as of midday Tuesday, shares of Utilities companies are outperforming other sectors, higher by 1.0%. Within that group, NextEra Energy Inc (Symbol: NEE) and Southern Company (Symbol: SO) are two large stocks leading the way, showing a gain of 2.4% and 2.1%, respectively. Among utilities ETFs  , one ETF following the sector is the Utilities Select Sector SPDR ETF (Symbol: XLU), which is up 1.2% on the day, and up 21.42% year-to-date. NextEra Energy Inc, meanwhile, is up 31.26% year-to-date, and Southern Company is up 39.57% year-to-date. Combined, NEE and SO make up approximately 19.6% of the underlying holdings of XLU. The next best performing sector is the Financial sector, losing just 0.8%. Among large Financial stocks, Everest Re Group Ltd (Symbol: RE) and HCP Inc (Symbol: HCP) are the most notable, showing a gain of 3.6% and 2.5%, respectively. One ETF closely tracking Financial stocks is the Financial Select Sector SPDR ETF ( XLF  ), which is down 1.3% in midday trading, and up 12.70% on a year-to-date basis. Everest Re Group Ltd, meanwhile, is up 12.18% year-to-date, and HCP Inc is up 31.33% year-to-date. RE makes up approximately 0.3% of the underlying holdings of XLF.    Comparing these stocks and ETFs on a trailing twelve month basis, below is a relative stock price performance chart, with each of the symbols shown in a different color as labeled in the legend at the bottom:  makeArticleAd();       Here's a snapshot of how the S&P 500 components within the various sectors are faring in afternoon trading on Tuesday. As you can see, one sector is up on the day, while eight sectors are down.      10 ETFs With Stocks That Insiders Are Buying   »  ",
    "The next best performing sector is the Financial sector, losing just 0.8%. Among large Financial stocks, Everest Re Group Ltd (Symbol: RE) and HCP Inc (Symbol: HCP) are the most notable, showing a gain of 3.6% and 2.5%, respectively. One ETF closely tracking Financial stocks is the Financial Select Sector SPDR ETF ( XLF  ), which is down 1.3% in midday trading, and up 12.70% on a year-to-date basis. Everest Re Group Ltd, meanwhile, is up 12.18% year-to-date, and HCP Inc is up 31.33% year-to-date. RE makes up approximately 0.3% of the underlying holdings of XLF.",
    "  10 ETFs With Stocks That Insiders Are Buying   » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:54:38"
}