{
  "url": "https://www.nasdaq.com/article/trade-war-thaw-and-ecb-stimulus-hopes-buoys-stocks-20190912-00265",
  "title": "Trade war thaw and ECB stimulus hopes buoys stocks - Nasdaq.com",
  "text": [
    "By Tom Wilson",
    "LONDON, Sept 12 (Reuters) - World stocks climbed to their highest in six weeks on Thursday as the European Central Bank prepared to offer new stimulus measures and the United States and China made mutual concessions in their trade dispute, improving demand for riskier bets.",
    "U.S. President Donald Trump delayed an increase in tariffs on Chinese goods by two weeks, after China exempted some U.S. drugs and other goods from tariffs. The two moves buoyed stock markets from Asia to Europe and put pressure on safe assets like the Japanese yen. ",
    "Europe's Euro STOXX 600 climbed to its highest in nearly seven weeks, then gave up the gains. Paris  and London  markets also relinquished early gains, though Frankfurt  held onto a 0.2% advance. Wall Street futures gauges were up 0.1%.",
    "Some analysts said investors were getting too eager for good news on the U.S.-China trade war. The prospects of a quick resolution were still remote, they warned.",
    "\"I don't think we're heading for a deal soon,\" said Neil Wilson, chief market analyst at Markets.com. \"The market is just buying on any kind of positive news - it seems hungry for anything. It's setting itself up for a bit of disappointment.\"",
    "The ECB's move, due at 1145 GMT, also carries a risk of overly optimistic market expectations, investors said.",
    "Major central banks worldwide are loosening monetary policy, inflation expectations are sliding and the powerhouse German economy is at risk of recession. Consequently, ECB President Mario Draghi has all but promised more support. ",
    "But the central bank's exact moves are far from certain, and any decision that underwhelms markets could push up borrowing costs.",
    "Among the likely measures are a cut in the ECB's record-low minus 0.4% deposit rate, a multi-tier deposit rate, and new guidance on rates that would tie any move to certain inflation conditions.",
    "A new round of bond buying, the bank's most potent weapon, is also an option - but policymakers from Germany to France are sceptical about that move.",
    "\"We could see some disappointment here. The challenge is more about forward guidance and reassurance for the future,\" said Christophe Barraud, chief economist at Market Securities in Paris.",
    "\"It would be surprising if the ECB launches a big stimulus right now ahead of uncertainties such as hard Brexit and the trade war.\"",
    "After the ECB decision, the U.S. Federal Reserve is expected to cut rates next Wednesday and the Bank of Japan and Swiss National Bank next Thursday also may ease.",
    "BONDS CALM, YUAN RISES",
    "Euro zone government bonds were steady in early trade, after rising from record lows reached a week ago on doubts that the ECB would resume asset purchases. ",
    "\"Whether the ECB cuts rates by 10 or 20 bps is neither here or there,\" said Chris Scicluna, head of economic research at Daiwa Capital Markets. \"The big question is whether they restart QE, and if they don't, we will see a further sell-off in bonds, especially longer-dated ones.\"",
    "The optimism over trade and the looming ECB decision were felt in currency markets, too.",
    "The euro  fell to a one-week low of $1.0983 overnight on expectations of ECB easing before steadying in morning trade. It has shed 3.5% since June.",
    "With risk-hungry investors emboldened, the Chinese yuan  gained 0.4% against the dollar, touching a three-week high of 7.0855.",
    "Stephen Gallo, European head of FX strategy at BMO Capital Markets, said he was surprised by the rebound, particularly in the yuan pushing beyond 7.10 to the dollar. ",
    "\"The bigger picture is one of a very tense geopolitical environment that is unlikely to be rectified quickly,\" he said.",
    "The Japanese yen, a safe haven for nervous investors, fell to a six-week low against the dollar, and was last down 0.1% at 107.88.",
    "Brent crude futures fell as a meeting of the OPEC+ alliance yielded no discussion about increasing supply cuts. They focused instead on bringing Nigerian and Iraqi output down to their agreed quotas.",
    "     Brent crude futures  fell 69 cents, or 1.1%, to $60.12 a barrel by 1055 GMT, heading for a third session of losses."
  ],
  "published_datetime": "2019-09-12 07:06:00"
}