{
  "url": "https://www.nasdaq.com/article/bull-of-the-day-netease-ntes-cm1210340",
  "title": "Bull of the Day: NetEase (NTES) - Nasdaq.com",
  "text": [
    "   When I look for a Bull of the Day, it's important for me to find stocks with strong earnings trends. One way to do that is to lean on the time-tested power of the Zacks Rank. Stocks that are Zacks Rank #1 (Strong Buy) and Zacks Rank #2 (Buy) are a good place to start. That way, you know the stock you are looking at has a strong earnings profile, with analysts continually revising their earnings estimates to the upside. In addition to the strong Zacks Rank on the individual stock, I like to find stocks within strong industries. The strongest industries often have tailwinds which are helping the stocks make more money. The industry this stock is in, is currently in the Top 22% of our Zacks Industry Rank. The last part of this equation has to be growth. Growth is the greatest mover of stock prices. Two major things move when growth increases. Earnings go up directly as a result of growth and, often times, the earnings multiple increases when growth increases. My stock to double here has all of these components, giving it a real shot at doubling its size, despite being as large as it already is. My pick is Zacks Rank #2 (Buy) NetEase (NTES)  . NetEase is a Chinese internet technology company providing online PC and mobile games. The company develops their own games like Fantasy Westward Journey and Heroes of Tang Dynasty Zero, as well as partners with other developers to adapt games to their local markets. For example, they have teamed up with Blizzard Entertainment to operate local versions of World of Warcraft and Overwatch. They've also been working on a huge VR multiplayer online game with an open world setting they call Nostos. Earnings estimates have been moving in the right direction here for NetEase. Negative revisions plagued the stock from late 2017 until early 2019. It was then when earnings troughed and started moving back in the right direction. What should be even more encouraging for the bulls is the fact tha t earnings  growth is beginning to be baked in here. In fact, NetEase has future year-over-year projected growth of over 30% for the next five years.  NetEase, Inc. Price and Consensus     NetEase, Inc. price-consensus-chart    |   NetEase, Inc. Quote   Current valuations have NetEase trading at 25x forward 12-month earnings. At the surface, that sounds a bit rich considering that the broad market trades at about 17x. However, there are two mitigating factors which make this number much more palatable. While the broad market trades at 17x, the Computer Software - Services industry trades at 27.87x. The other factor I pointed out earlier, huge sales growth numbers for NTES. The company is on the cusp of a huge growth opportunity. That is bringing the PEG ratio under 1. That means that for its projected amount of growth, the stock is undervalued. The PEG ratio is 0.82. That's what gives NTES the roadmap to potentially double over the next several quarters. Coming back into growth could lead to a surge in the stock price. That growth could come from the explosion in gaming. This fiscal year, mobile gaming revenue for the company is projected to grow at 16% year-over-year. Overall, that industry has been growing exponentially. Gaming is the fastest-growing form of entertainment in the world. Revenues have been increasing globally at a clip of 9.7% per year. Last year, video game revenues totaled $139 billion. By 2022, the global video game market is estimated to be nearly $200 billion.  More Stock News: This Is Bigger than the iPhone!  makeArticleAd();  It could become the mother of all technological revolutions. Apple sold a mere 1 billion iPhones in 10 years but a new breakthrough is expected to generate more than 27 billion devices in just 3 years, creating a $1.7 trillion market.    Zacks has just released a Special Report that spotlights this fast-emerging phenomenon and 6 tickers for taking advantage of it. If you don't buy now, you may kick yourself in 2020.    Click here for the 6 trades >>      Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   NetEase, Inc. (NTES): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "When I look for a Bull of the Day, it's important for me to find stocks with strong earnings trends. One way to do that is to lean on the time-tested power of the Zacks Rank. Stocks that are Zacks Rank #1 (Strong Buy) and Zacks Rank #2 (Buy) are a good place to start. That way, you know the stock you are looking at has a strong earnings profile, with analysts continually revising their earnings estimates to the upside.",
    "In addition to the strong Zacks Rank on the individual stock, I like to find stocks within strong industries. The strongest industries often have tailwinds which are helping the stocks make more money. The industry this stock is in, is currently in the Top 22% of our Zacks Industry Rank.",
    "The last part of this equation has to be growth. Growth is the greatest mover of stock prices. Two major things move when growth increases. Earnings go up directly as a result of growth and, often times, the earnings multiple increases when growth increases. My stock to double here has all of these components, giving it a real shot at doubling its size, despite being as large as it already is.",
    "My pick is Zacks Rank #2 (Buy) NetEase (NTES)  . NetEase is a Chinese internet technology company providing online PC and mobile games. The company develops their own games like Fantasy Westward Journey and Heroes of Tang Dynasty Zero, as well as partners with other developers to adapt games to their local markets. For example, they have teamed up with Blizzard Entertainment to operate local versions of World of Warcraft and Overwatch. They've also been working on a huge VR multiplayer online game with an open world setting they call Nostos.",
    "Earnings estimates have been moving in the right direction here for NetEase. Negative revisions plagued the stock from late 2017 until early 2019. It was then when earnings troughed and started moving back in the right direction. What should be even more encouraging for the bulls is the fact tha t earnings  growth is beginning to be baked in here. In fact, NetEase has future year-over-year projected growth of over 30% for the next five years.",
    " NetEase, Inc. Price and Consensus     NetEase, Inc. price-consensus-chart    |   NetEase, Inc. Quote  ",
    " NetEase, Inc. price-consensus-chart    |   NetEase, Inc. Quote ",
    "Current valuations have NetEase trading at 25x forward 12-month earnings. At the surface, that sounds a bit rich considering that the broad market trades at about 17x. However, there are two mitigating factors which make this number much more palatable. While the broad market trades at 17x, the Computer Software - Services industry trades at 27.87x. The other factor I pointed out earlier, huge sales growth numbers for NTES. The company is on the cusp of a huge growth opportunity. That is bringing the PEG ratio under 1. That means that for its projected amount of growth, the stock is undervalued. The PEG ratio is 0.82. That's what gives NTES the roadmap to potentially double over the next several quarters. Coming back into growth could lead to a surge in the stock price.",
    "That growth could come from the explosion in gaming. This fiscal year, mobile gaming revenue for the company is projected to grow at 16% year-over-year. Overall, that industry has been growing exponentially. Gaming is the fastest-growing form of entertainment in the world. Revenues have been increasing globally at a clip of 9.7% per year. Last year, video game revenues totaled $139 billion. By 2022, the global video game market is estimated to be nearly $200 billion.",
    " More Stock News: This Is Bigger than the iPhone!  makeArticleAd();  It could become the mother of all technological revolutions. Apple sold a mere 1 billion iPhones in 10 years but a new breakthrough is expected to generate more than 27 billion devices in just 3 years, creating a $1.7 trillion market.    Zacks has just released a Special Report that spotlights this fast-emerging phenomenon and 6 tickers for taking advantage of it. If you don't buy now, you may kick yourself in 2020.    Click here for the 6 trades >>   ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:00:00"
}