{
  "url": "https://www.nasdaq.com/article/5-top-stocks-of-the-top-etf-of-august-cm1206730",
  "title": "5 Top Stocks of the Top ETF of August - Nasdaq.com",
  "text": [
    "  Global X Silver Miners ETF SIL   topped the list of best-performing ETFs in August, gaining 11.7%. Being a leveraged play, metal miners tend to experience more gains than their bullion cousins in a rising metal market.  makeArticleAd();  The stock markets, which are ruffled by escalation in trade war, collapse in bond yields, global recession fears, and geopolitical tensions, has driven demand for silver as a store of wealth, leading to rise in the metal price (read: Trade War Gets Uglier: Here Are the ETF Winners & Losers  ).    Additionally, industrial demand for silver is also strong, thanks to ongoing growth in the global solar PV industry, rebound in global computer shipments, as well as new sources of demand for sensors used in IoT and OLED lighting. Notably, silver is used in a wide range of industrial applications. About 50% of the metal's total demand comes from industrial applications, while 30% comes from jewelry/silverware/coins and medal manufacturers.    Further, rising hopes of loose monetary policies across the globe added to the metal's strength. Lower rates will continue to weigh on the dollar against a basket of currencies, raising the precious metal's attractiveness as it does not pay interest like fixed-income assets.    Let's take a closer look at the fundamentals of SIL.   SIL in Focus    This product provides investors access to a broad range of silver mining companies by tracking the Solactive Global Silver Miners Total Return Index. It holds 24 stocks in its basket with double-digit concentration on the top three firms. Canadian firms take the largest share at 48.1%, while Russia and South Korea take the remainder. The fund has managed assets worth $537.3 million and trades in a good volume of about 283,000 shares a day. It charges 65 bps in annual fees (see: all the Materials ETFs here  ).    Though most of the stocks in the fund's portfolio delivered strong returns, a few were up in double digits last month. Below we have highlighted the five best-performing stocks in the ETF with their respective positions in the fund's basket:   Best Performing Stocks of SIL   Alexco Resource Corp AXU  :  This company is engaged in mineral exploration, and mine development and operational activities primarily in Yukon Territory, Canada. It jumped about 44.2% in August. Alexco Resource currently has a Zacks Rank #3 (Hold) and VGM Score of F. The stock makes up for 0.9% share. You can see  the complete list of today's Zacks #1 (Strong Buy) Rank   stocks here   .   Silvercorp Metals SVM  :  This company is engaged in the acquisition, exploration, development, and mining of silver and related mineral properties in China. The stock occupies the thirteenth position in the basket with 4.3% share in the SIL portfolio and gained 34.1% last month. Silvercorp Metals carries a Zacks Rank #3 and has a VGM Score of C.   Fresnillo PLC FNLPF  :  This company mines, develops, and produces non-ferrous minerals in Mexico. It primarily explores for silver, gold, lead, and zinc concentrates. The stock also delivered incredible returns of 21.5% last month. The stock has a Zacks Rank #3 and VGM Score of F. Fresnillo occupies the eleventh position and makes up 3.4% of SIL.   Americas Silver Corporation USAS  :  This company is engaged in the acquisition, evaluation, exploration, development, and operation of mineral properties. It explores for silver, lead, zinc and copper. The stock rose about 19.3% last month. It currently carries a Zacks Rank #3 and has a VGM Score of F. Americas Silver accounts for 0.5% allocation (read: What's Behind the Rally in Silver ETFs?  ).   Pan American Silver Corp. PAAS  :  This company is engaged in the exploration, development, extraction, processing, refining, and reclamation of silver mines. It owns and operates mines located in Mexico, Peru, Canada, Argentina, and Bolivia. The stock rallied 14.8% in August and takes the top spot in SIL portfolio with 13.8% allocation. Pan American Silver has a Zacks Rank #2 (Buy) and VGM Score of D.   Want key ETF info delivered straight to your inbox?    Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week. Get it free >>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Global X Silver Miners ETF (SIL): ETF Research Reports   Silvercorp Metals Inc. (SVM): Free Stock Analysis Report   Fresnillo PLC (FNLPF): Free Stock Analysis Report   Pan American Silver Corp. (PAAS): Free Stock Analysis Report   Alexco Resource Corp (AXU): Free Stock Analysis Report   Americas Silver Corporation (USAS): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    " Global X Silver Miners ETF SIL   topped the list of best-performing ETFs in August, gaining 11.7%. Being a leveraged play, metal miners tend to experience more gains than their bullion cousins in a rising metal market.  makeArticleAd();  The stock markets, which are ruffled by escalation in trade war, collapse in bond yields, global recession fears, and geopolitical tensions, has driven demand for silver as a store of wealth, leading to rise in the metal price (read: Trade War Gets Uglier: Here Are the ETF Winners & Losers  ).    Additionally, industrial demand for silver is also strong, thanks to ongoing growth in the global solar PV industry, rebound in global computer shipments, as well as new sources of demand for sensors used in IoT and OLED lighting. Notably, silver is used in a wide range of industrial applications. About 50% of the metal's total demand comes from industrial applications, while 30% comes from jewelry/silverware/coins and medal manufacturers.    Further, rising hopes of loose monetary policies across the globe added to the metal's strength. Lower rates will continue to weigh on the dollar against a basket of currencies, raising the precious metal's attractiveness as it does not pay interest like fixed-income assets.    Let's take a closer look at the fundamentals of SIL.   SIL in Focus    This product provides investors access to a broad range of silver mining companies by tracking the Solactive Global Silver Miners Total Return Index. It holds 24 stocks in its basket with double-digit concentration on the top three firms. Canadian firms take the largest share at 48.1%, while Russia and South Korea take the remainder. The fund has managed assets worth $537.3 million and trades in a good volume of about 283,000 shares a day. It charges 65 bps in annual fees (see: all the Materials ETFs here  ).    Though most of the stocks in the fund's portfolio delivered strong returns, a few were up in double digits last month. Below we have highlighted the five best-performing stocks in the ETF with their respective positions in the fund's basket:   Best Performing Stocks of SIL   Alexco Resource Corp AXU  :  This company is engaged in mineral exploration, and mine development and operational activities primarily in Yukon Territory, Canada. It jumped about 44.2% in August. Alexco Resource currently has a Zacks Rank #3 (Hold) and VGM Score of F. The stock makes up for 0.9% share. You can see  the complete list of today's Zacks #1 (Strong Buy) Rank   stocks here   .   Silvercorp Metals SVM  :  This company is engaged in the acquisition, exploration, development, and mining of silver and related mineral properties in China. The stock occupies the thirteenth position in the basket with 4.3% share in the SIL portfolio and gained 34.1% last month. Silvercorp Metals carries a Zacks Rank #3 and has a VGM Score of C.   Fresnillo PLC FNLPF  :  This company mines, develops, and produces non-ferrous minerals in Mexico. It primarily explores for silver, gold, lead, and zinc concentrates. The stock also delivered incredible returns of 21.5% last month. The stock has a Zacks Rank #3 and VGM Score of F. Fresnillo occupies the eleventh position and makes up 3.4% of SIL.   Americas Silver Corporation USAS  :  This company is engaged in the acquisition, evaluation, exploration, development, and operation of mineral properties. It explores for silver, lead, zinc and copper. The stock rose about 19.3% last month. It currently carries a Zacks Rank #3 and has a VGM Score of F. Americas Silver accounts for 0.5% allocation (read: What's Behind the Rally in Silver ETFs?  ).   Pan American Silver Corp. PAAS  :  This company is engaged in the exploration, development, extraction, processing, refining, and reclamation of silver mines. It owns and operates mines located in Mexico, Peru, Canada, Argentina, and Bolivia. The stock rallied 14.8% in August and takes the top spot in SIL portfolio with 13.8% allocation. Pan American Silver has a Zacks Rank #2 (Buy) and VGM Score of D.   Want key ETF info delivered straight to your inbox?    Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week. Get it free >> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:05:00"
}