{
  "url": "https://www.nasdaq.com/article/australias-amp-begins-cull-of-financial-adviser-network-20190904-01220",
  "title": "Australia's AMP begins cull of financial adviser network - Nasdaq.com",
  "text": [
    "By Paulina Duran",
    "SYDNEY, Sept 5 (Reuters) - Australia'sAMP Ltd  has started telling some of its more than 1,500 aligned financial advisers that it is cancelling their licences, taking a tough stance in the wake of last year's inquiry into misconduct in the country's financial sector.",
    "Alex Wade, AMP's head of wealth management, said in an internal email that it had become clear that some advisers were not going to meet new regulations imposed by the government to abolish commissions and increase compliance.",
    "\"We have started communicating to those that will no longer be licensed by AMP in the future,\" he added. \"This is a big change, but a necessary one.\"",
    "The email did not specify the number of advisers who had received cancellation notices and the spokeswoman declined to comment further.",
    "AMP built and has relied on Australia's largest network of advisers - a total of around 2,400 both employed and aligned to the wealth manager - to sell its products and services.",
    "But its business model has been threatened and its reputation damaged by the Royal Commission inquiry that found AMP for years wrongfully charged fees to thousands of clients and then attempted to mislead the regulator about it. ",
    "Over the last 18 months, AMP's market value has fallen by more than two-thirds and it has lost billions of dollars in fund outflows, leading to the unveiling of an aggressive restructuring plan last month. ",
    "That plan included lowering the agreed guarantee to its aligned advisers to buy back their client registers to a maximum 2.5 times revenue from 4 times previously.",
    "Neil Macdonald, chief executive of the association representing AMP's aligned advisers, said advisers now faced defaults on loans that had been based on the original more generous buyback terms.",
    "\"We've got people who borrowed maybe a million dollars to buy a register that AMP told them was a good idea to do, and now that million dollar loan is still outstanding but the asset backing is worth $500,000,\" he said, adding that some were considering class action against the wealth manager.",
    "Brett Le Mesurier, a senior analyst at Shaw and Partners said, AMP \"seems to be taking a confrontational approach with that same distribution force which is so critical to its survival.\"",
    "AMP last month told investors it expected to spend A$550 million on \"adviser retention and support\" as well as client \"register acquisitions\" over the next 18 to 24 months."
  ],
  "published_datetime": "2019-09-04 09:26:00"
}