{
  "url": "https://www.nasdaq.com/article/how-does-disney-stack-up-to-netflix-and-amazons-prime-video-cm1206939",
  "title": "How Does Disney+ Stack Up to Netflix and Amazon's Prime Video? - Nasdaq.com",
  "text": [
    " We finally have the details on   Disney    's (NYSE: DIS) streaming offering, Disney+, and it seems pretty   clear the House of Mouse is looking to shake up the streaming   video. Set to launch in mid-November, the service will feature tons   of recent and classic Disney films, as well as series   specifically built for the platform. If Disney's rich   intellectual property library wasn't enough of a boost to the new   service, Disney+ is debuting at $6.99 per month in the United   States. -- making it far cheaper than comparable streaming   services from the likes of   Netflix    (NASDAQ: NFLX) and   Amazon    (NASDAQ: AMZN) . In this video   from our YouTube channel    , we break down the major players in streaming video and talk   about how their services play into each companies' overall   strategy.makeArticleAd();  A full transcript follows the video.      {%sfr%}  Narrator:    Hi, and welcome to The Motley Fool's Bottom Line series. In this   video, we're going to take a look at Disney's new video streaming   service, called Disney+, and how it stacks up against the   established competitors. Ever since Walt Disney's announcement of Disney+, fans and   investors alike have been eagerly awaiting the latest entrant   into the streaming wars. Disney+ is scheduled to launch on Nov. 12, and the company   expects to have more than 100 recent films and over 400 older   movies available within the first year. It's also developing 25 new series and movies that will be   exclusive to the platform. The Disney+ programming will come from across the company's   Marvel, Pixar, Lucasfilm, and Disney brands, as well as   contributions from Fox and National Geographic. While creating an entirely new video streaming service is   certainly a big move for Disney, how exactly does Disney+ stack   up to its rivals? One of the most important differentiating factors between   Disney+ and its competitors is its price. Disney+ costs just   $6.99 per month in the U.S., and if you pay annually, it's only a   $69.99 per year. The price includes four simultaneous streams, 4K video, ultra   high definition (UHD), and high dynamic range (HDR) picture   quality when available, all at no extra cost. And users also get   unlimited video downloads. To put this into context, Netflix's premium plan, which offers   some similar features, costs $15.99 a month, far more than   Disney+. And Disney+ is cheaper than Amazon Prime Video -- the   second-largest streaming service in the U.S. -- which costs $8.99   per month. In addition to its low cost, Disney will also offer a bundle   of Disney+, ESPN+, and the ad-supported version of Hulu for just   $12.99 in the U.S. Which will give viewers access to sports   programming, the library of content from Disney, as well as   original programming and broadcast shows from Hulu. But just because Disney will have the best video streaming   deal doesn't mean it'll easily topple Netflix and Amazon's   dominance. Netflix has 60 million paying subscribers in the U.S. and 91   million international subscribers. Meanwhile, Amazon's has more   than 100 million Prime members in the U.S. that have access to   the company's video streaming service. Subscribers aside, both Amazon and Netflix have spent years --   and billions of dollars -- creating their own original video   content. For Netflix, spending huge sums of money to produce and   license content -- including $15 billion in 2019 -- is a matter   of survival. Netflix's entire business is built on video streaming, and it   has to be the best at what it does in order to grow its top and   bottom lines. For Amazon, video streaming is more of a side business that   provides value to its Prime members and keeps its customers   engaged with the company. While Disney has its theme parks, and its vast movie and TV   empire, the company is betting that Disney+ will play an   important role in controlling its own content, as well as forging   direct relationships with its customers. Disney's CEO Bob Iger recently said that \"Disney+ marks a bold   step forward in an exciting new era for our company....\" The bottom line is that Disney+ will likely be one of the most   competitive video streaming services on the market. And even   Netflix and Amazon will have a hard time matching Disney's   stockpile of beloved characters and stories. No other company has been as successful at turning   storytelling into such a lucrative business as Disney -- which is   why Disney+ competitors should be worried.  John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. The Motley Fool owns shares of and recommends     Amazon, Netflix, and Walt Disney. The Motley Fool has the     following options: long January 2021 $60 calls on Walt Disney     and short October 2019 $125 calls on Walt Disney. The Motley     Fool has a     disclosure policy      .  ",
    "We finally have the details on   Disney    's (NYSE: DIS) streaming offering, Disney+, and it seems pretty   clear the House of Mouse is looking to shake up the streaming   video.",
    "Set to launch in mid-November, the service will feature tons   of recent and classic Disney films, as well as series   specifically built for the platform. If Disney's rich   intellectual property library wasn't enough of a boost to the new   service, Disney+ is debuting at $6.99 per month in the United   States. -- making it far cheaper than comparable streaming   services from the likes of   Netflix    (NASDAQ: NFLX) and   Amazon    (NASDAQ: AMZN) .",
    "In this video   from our YouTube channel    , we break down the major players in streaming video and talk   about how their services play into each companies' overall   strategy.",
    " A full transcript follows the video. ",
    "{%sfr%}",
    " Narrator:    Hi, and welcome to The Motley Fool's Bottom Line series. In this   video, we're going to take a look at Disney's new video streaming   service, called Disney+, and how it stacks up against the   established competitors.",
    "Ever since Walt Disney's announcement of Disney+, fans and   investors alike have been eagerly awaiting the latest entrant   into the streaming wars.",
    "Disney+ is scheduled to launch on Nov. 12, and the company   expects to have more than 100 recent films and over 400 older   movies available within the first year.",
    "It's also developing 25 new series and movies that will be   exclusive to the platform.",
    "The Disney+ programming will come from across the company's   Marvel, Pixar, Lucasfilm, and Disney brands, as well as   contributions from Fox and National Geographic.",
    "While creating an entirely new video streaming service is   certainly a big move for Disney, how exactly does Disney+ stack   up to its rivals?",
    "One of the most important differentiating factors between   Disney+ and its competitors is its price. Disney+ costs just   $6.99 per month in the U.S., and if you pay annually, it's only a   $69.99 per year.",
    "The price includes four simultaneous streams, 4K video, ultra   high definition (UHD), and high dynamic range (HDR) picture   quality when available, all at no extra cost. And users also get   unlimited video downloads.",
    "To put this into context, Netflix's premium plan, which offers   some similar features, costs $15.99 a month, far more than   Disney+. And Disney+ is cheaper than Amazon Prime Video -- the   second-largest streaming service in the U.S. -- which costs $8.99   per month.",
    "In addition to its low cost, Disney will also offer a bundle   of Disney+, ESPN+, and the ad-supported version of Hulu for just   $12.99 in the U.S. Which will give viewers access to sports   programming, the library of content from Disney, as well as   original programming and broadcast shows from Hulu.",
    "But just because Disney will have the best video streaming   deal doesn't mean it'll easily topple Netflix and Amazon's   dominance.",
    "Netflix has 60 million paying subscribers in the U.S. and 91   million international subscribers. Meanwhile, Amazon's has more   than 100 million Prime members in the U.S. that have access to   the company's video streaming service.",
    "Subscribers aside, both Amazon and Netflix have spent years --   and billions of dollars -- creating their own original video   content. For Netflix, spending huge sums of money to produce and   license content -- including $15 billion in 2019 -- is a matter   of survival.",
    "Netflix's entire business is built on video streaming, and it   has to be the best at what it does in order to grow its top and   bottom lines.",
    "For Amazon, video streaming is more of a side business that   provides value to its Prime members and keeps its customers   engaged with the company.",
    "While Disney has its theme parks, and its vast movie and TV   empire, the company is betting that Disney+ will play an   important role in controlling its own content, as well as forging   direct relationships with its customers.",
    "Disney's CEO Bob Iger recently said that \"Disney+ marks a bold   step forward in an exciting new era for our company....\"",
    "The bottom line is that Disney+ will likely be one of the most   competitive video streaming services on the market. And even   Netflix and Amazon will have a hard time matching Disney's   stockpile of beloved characters and stories.",
    "No other company has been as successful at turning   storytelling into such a lucrative business as Disney -- which is   why Disney+ competitors should be worried.",
    " John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. The Motley Fool owns shares of and recommends     Amazon, Netflix, and Walt Disney. The Motley Fool has the     following options: long January 2021 $60 calls on Walt Disney     and short October 2019 $125 calls on Walt Disney. The Motley     Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:14:00"
}