{
  "url": "https://www.nasdaq.com/article/top-ranked-value-stocks-to-buy-for-september-11th-cm1210617",
  "title": "Top Ranked Value Stocks to Buy for September 11th - Nasdaq.com",
  "text": [
    "Here are four stocks with buy rank and strong value characteristics for investors to consider today, September 11th:",
    "Danaos Corporation (DAC): This shipping company has a Zacks Rank #1 (Strong Buy), and seen the Zacks Consensus Estimate for its current year earnings rising 7.9% over the last 60 days.",
    "Danaos Corporation Price and Consensus",
    "Danaos Corporation price-consensus-chart | Danaos Corporation Quote",
    "Danaos Corporation has a price-to-earnings ratio (P/E) of 0.78, compared with 7.00 for the industry. The company possesses a Value Score of A.",
    "Danaos Corporation PE Ratio (TTM)",
    "Danaos Corporation pe-ratio-ttm | Danaos Corporation Quote",
    "Mr. Cooper Group Inc. (COOP): This financial services company has a Zacks Rank #1, and seen the Zacks Consensus Estimate for its current year earnings rising 41.9% over the last 60 days.",
    "MR. COOPER GROUP INC Price and Consensus",
    "MR. COOPER GROUP INC price-consensus-chart | MR. COOPER GROUP INC Quote",
    "Mr. Cooper Group has a price-to-earnings ratio (P/E) of 4.18, compared with 8.40 for the industry. The company possesses a Value Score of A.",
    "MR. COOPER GROUP INC PE Ratio (TTM)",
    "MR. COOPER GROUP INC pe-ratio-ttm | MR. COOPER GROUP INC Quote",
    "Office Properties Income Trust (OPI): This Real estate investment trust company has a Zacks Rank #1, and seen the Zacks Consensus Estimate for its current year earnings rising 11.6% over the last 60 days.",
    "Office Properties Income Trust price-consensus-chart | Office Properties Income Trust Quote",
    "Office Properties Income Trust has a price-to-earnings ratio (P/E) of 4.97, compared with 22.00 for the industry. The company possesses a Value Score of B.",
    "Office Properties Income Trust pe-ratio-ttm | Office Properties Income Trust Quote",
    "Smart Sand, Inc. (SND): This integrated frac sand supply and services company has a Zacks Rank #2 (Buy), and seen the Zacks Consensus Estimate for its current year earnings rising 84% over the last 60 days.",
    "SMART SAND INC Price and Consensus",
    "SMART SAND INC price-consensus-chart | SMART SAND INC Quote",
    "Smart Sand has a price-to-earnings ratio (P/E) of 2.68 compared with 16.10 for the industry. The company possesses a Value Score of A.",
    "SMART SAND INC PE Ratio (TTM)",
    "SMART SAND INC pe-ratio-ttm | SMART SAND INC Quote",
    "See the full list of top ranked stocks here.",
    "Learn more about the Value score and how it is calculated here.",
    "Looking for Stocks with Skyrocketing Upside?",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "See the pot trades we're targeting>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:33:00"
}