{
  "url": "https://www.nasdaq.com/article/futures-gain-as-washington-delays-china-tariffs-20190912-00290",
  "title": "Futures gain as Washington delays China tariffs - Nasdaq.com",
  "text": [
    "By Uday Sampath Kumar",
    "Sept 12 (Reuters) - U.S. stock index futures rose on Thursday after President Donald Trump said the United States would delay scheduled tariff hikes on billions worth of Chinese imports, cooling tensions that have battered financial markets over the last year.",
    "The decision, which Trump called \"a gesture of good will\", came after China moved to exempt some U.S. anti-cancer drugs and other goods from additional tariffs ahead of planned trade negotiations between the world's two largest economies. ",
    "However, lingering concerns of slowing global growth pushed gold prices higher and lifted shares of miners such as Barrick Gold Corp , AngloGold Ashanti Ltd  and Gold Fields Ltd  between 1.7% and 4.1%. GOL/",
    "Later on Thursday, the European Central Bank (ECB) is expected to offer new stimulus measures to help boost the euro zone's flagging economies.",
    "Analysts said while the U.S. economy is largely insulated from the troubles of Europe, investors might sell out in case the ECB delivered a more hawkish policy decision than expected.",
    "Data on August U.S. consumer prices is expected at 8:30 a.m. ET, ahead of the Federal Reserve's policy decision on interest rate cuts next week.",
    "The Labor department is expected to report a 0.1% increase in the Consumer Price Index for August, following a 0.3% gain in July.",
    "At 7:14 a.m. ET, Dow e-minis  were up 51 points, or 0.19%. S&P 500 e-minis  were up 4 points, or 0.13% and Nasdaq 100 e-minis  were up 27.75 points, or 0.35%.",
    "Among other stocks, Caterpillar Inc  and Deere & Co  fell after Wells Fargo downgraded both stocks to \"market perform\".",
    "Baker Hughes  was down 1.8% after General Electric Co  began divestment of its stake in the oilfield services provider, aiming to raise $2.7 billion. ",
    "Activision Blizzard Inc  rose 2% after two brokerages raised their price targets on the stock."
  ],
  "published_datetime": "2019-09-12 07:37:00"
}