{
  "url": "https://www.nasdaq.com/article/why-shares-of-conns-jumped-today-cm1206884",
  "title": "Why Shares of Conn's Jumped Today - Nasdaq.com",
  "text": [
    "Shares of Conn's (NASDAQ: CONN) rose on Tuesday after the retailer reported second-quarter results that beat expectations. Sales growth from furniture, mattresses, and appliances offset weakness elsewhere, driving total revenue higher. The stock was up about 15% at 10:45 a.m. EDT.",
    "Conn's reported second-quarter revenue of $401.1 million, up 4.3% year over year and nearly $3 million higher than the average analyst estimate. Retail sales rose 3.3% to $306.1 million, driven entirely by new stores. Same-store sales declined by 2.3%, with stores in areas hit by Hurricane Harvey in 2017 seeing a steeper 9.3% decline. The company believes rebuilding efforts in these markets during the second quarter of 2018 made for a difficult comparison this year.",
    "Image source: Getty Images.",
    "Furniture and mattress sales grew 2.5% to $99.5 million, while home appliance sales rose 8.6% to $99.4 million. Sales of both consumer electronics and home office products were down, with both suffering double-digit declines on a same-store basis. Credit revenue was up 7.5% year over year to $94.8 million.",
    "Earnings per share came in at $0.62, up from $0.53 in the prior-year period and $0.11 better than analysts were expecting. Higher sales and a slight reduction in bad debt provision pushed up the bottom line.",
    "\"During the second half of this fiscal year, we expect to lap the benefits Hurricane Harvey rebuilding efforts had on same store sales, which has impacted the year-over-year sales comparison over the past four quarters,\" said Conn's CEO Norm Miller in prepared remarks included in the earnings release.",
    "For the third quarter, Conn's expects a change in same-store sales of between negative 3% and positive 1%, and retail sales growth of between 4% and 8%.",
    "10 stocks we like better than Conn's\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Conn's wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Timothy Green has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:51:00"
}