{
  "url": "https://www.nasdaq.com/article/be-careful-with-kinross-gold-stock-cm1210773",
  "title": "Be Careful With Kinross Gold Stock - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "It's been a nice run for Kinross Gold (NYSE: KGC ) stock of late. Kinross Gold stock has gained 60% in a little over four months. And, it touched a three-year high earlier this month.",
    "It's certainly possible the run could continue. Gold prices, too, have hit multi-year highs. Those higher prices can help near-term profits - and the rally in yellow metal could continue amid worldwide recession fears.",
    "Kinross has several projects in development, which will boost production and revenue going forward. And valuation is reasonable, at roughly 7x 2019 earnings before interest, taxes, debt and amortization and 17x 2020 earnings per share estimates.",
    "That said, there are risks. And one of the biggest is that we've been here before.",
    "The core reason why KGC stock has rallied of late is that higher gold prices have boosted the entire sector. In fact, other gold stocks have moved even higher. Eldorado Gold (NYSE: EGO ) has been the biggest winner, more than tripling from late May to early September.",
    "But gold prices aside, there is a decent case for KGC stock. First-half results keep the company right on pace to meet 2019 guidance. Production should increase going forward, thanks to development efforts in Alaska, Russia and Nevada.",
    "And the higher gold prices could lead a restart of operations in Chile. Kinross idled its mine in La Coipa in 2013, and is undertaking feasibility studies at its Lobo-Marte operation. With gold above $1,450 an ounce, both properties are almost certain to be profitable: The company estimated a 20% internal rate of return from La Coipa earlier this year.",
    "Those developments, along with ongoing operational improvements, should help Kinross lower its all-in sustaining costs. According to a recent investor presentation , Kinross' all-in sustaining costs are solid. But at nearly $1,000 an ounce, it's hardly spectacular on a peer basis.",
    "That figure can, and should, come down. And the increased gap between realized prices and all-in costs suggests higher profitability going forward - and potentially an increased KGC stock price.",
    "That said, Kinross Gold stock has faded of late, dropping 9% in the last four sessions. The culprit is the same gold price that helped spark the recent rally.",
    "With gold just off a six-year high, the most obvious risk to KGC stock is that gold prices recede. The rally seems to have been driven by fears about rising geopolitical and economic risks.",
    "But the rally also has come in the face of two trends that are generally negative for gold: low inflation and a strong dollar. While the correlation of gold to inflation isn't as tight as conventional wisdom might suggest , that conventional wisdom alone often boosts prices.",
    "And so there's a risk that the big move in gold - which has gained 16% in just four months - could reverse. Should that happen, Kinross Gold stock is almost certain to fall.",
    "But there's another worry. This year, gold stocks like KGC stock have outperformed the big move in gold - which is how miners should trade in theory.",
    "After all, miners are leveraged bets on gold prices. The roughly $200 move in gold over the past four months is a 16% increase. But it nearly doubles Kinross Gold's potential profitability.",
    "That leaves two obvious near-term risks. The first is that the converse is true: If gold does fall, KGC stock should fall even further, at least in theory.",
    "The second is that miners like Kinross Gold historically have done a terrible job of realizing that theoretical upside. Barrick Gold (NYSE: GOLD ) has been one of the worst offenders , as I wrote last year. But it's far from the only one.",
    "Even KGC stock has badly underperformed gold over the past decade. Gold prices, as measured the SPDR Gold Trust (NYSEARCA: GLD ), have risen 31%. Kinross Gold stock has declined 74%. That's worse than other miners, who haven't done well either. The VanEck Vectors Gold Miners ETF (NYSEARCA: GDX ) is down 41%, and the VanEck Vectors Junior Gold Miners ETF (NYSEARCA: GDXJ ) 63%.",
    "Perhaps this time is different. Investors certainly believe so, as KGC has significantly outperformed gold over the past year. The big rally of late has allowed the stock to do so on a three- and five-year basis as well.",
    "But we've been here before. When gold spikes, gold mining stocks tend to rise sharply. The history of the sector over the past decade, however, is that miners eventually give back those gains, and then some. Kinross Gold stock, which hit a 14-year low in 2016, hasn't been immune.",
    "Finally, there's the question of whether Kinross Gold stock necessarily is the best play. Again, the case is intriguing, thanks to ongoing efficiency improvements and development opportunities.",
    "But for investors willing to bet on gold prices and gold miners, there are strong cases elsewhere, too. The merger of Randgold Resources and Barrick created a behemoth with massive scale, a better CEO , and industry-leading cash costs. Gold bulls also can look to juniors, who might be acquisition targets as industry optimism grows.",
    "Seabridge Gold (NYSE: SA ), for instance, has limited geopolitical risk (its mines all are in North America) and a $869 million market cap that would be an easy, but still material, acquisition for gold majors. Streaming plays like Sandstorm Gold (NYSE: SAND ) and Royal Gold (NASDAQ: RGLD ) offer leverage to gold prices without execution risk.",
    "And, of course, investors can just buy gold, whether physically or through the GLD ETF. Given the industry's history - which too often has shown a focus on rewarding executives, not shareholders - investors looking for safety are better off going the direct route.",
    "Again, this time may be different for Kinross Gold. If gold prices hold up, and if Kinross executes, there's plenty of potential upside ahead for KGC stock. The problem, as history shows, is that those are both big \"ifs.\"",
    "As of this writing, Vince Martin has no positions in any securities mentioned.",
    "The post Be Careful With Kinross Gold Stock appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:24:42"
}