{
  "url": "https://www.nasdaq.com/article/barclays-julius-baer-bolster-wealth-business-with-excredit-suisse-bankers-20190903-00554",
  "title": "Barclays, Julius Baer bolster wealth business with ex-Credit Suisse bankers - Nasdaq.com",
  "text": [
    "By Brenna Hughes Neghaiwi and Oliver Hirt",
    "ZURICH, Sept 3 (Reuters) - Britain'sBarclays  and Switzerland'sJulius Baer  have targeted Credit Suisse's  International Wealth Management business, which in July saw the departure of its head Iqbal Khan, to hire a total of 14 bankers.",
    "Barclays, which has set its sights on hiring and expanding its private banking business in Switzerland, announced six new Zurich hires on Tuesday, three of whom will help launch a new Israel desk out of the Swiss financial hub. ",
    "\"We've been looking for the best talent in order to support our growth ambition in Switzerland and capture the opportunities provided by a financial centre such as Zurich,\" Barclays Swiss head, Gerald Mathieu, said.",
    "Julius Baer, meanwhile, said in a statement it had employed 10 former Credit Suisse wealth managers to develop its Portuguese business out of Madrid, with José Maria do Cazal-Ribeiro becoming market head for the country.",
    "\"The hire of this comprehensive senior team demonstrates our long-term commitment to growing market Portugal,\" Baer's head of western Europe, Carlos Recoder, said in a statement, adding the bank considered Portugal a strategic market to be further developed and was committed to investing in its growth.",
    "Credit Suisse said its new Portugal team was in place and  unchanged in size, reflecting its commitment to the market where it has grown steadily since launching a Lisbon branch in 2013.",
    "Switzerland's second-largest bank said its Israeli market area had also seen strong growth. \"Credit Suisse is fully committed to Israel and our Israeli clients and will continue to grow and invest in this key market,\" a spokesperson said.",
    "Credit Suisse confirmed the departures, which it said dated from well before the summer."
  ],
  "published_datetime": "2019-09-03 08:30:00"
}