{
  "url": "https://www.nasdaq.com/article/italian-german-bond-yields-tumble-to-fresh-record-lows-20190903-00219",
  "title": "Italian, German bond yields tumble to fresh record lows - Nasdaq.com",
  "text": [
    "By Yoruk  Bahceli",
    "LONDON, Sept 3 (Reuters) - Italy's 10-year bond yield hit new record lows on Tuesday on hopes that 5-Star members would approve a coalition deal with the Democratic Party, while safe-haven German Bund yields fell to fresh lows on renewed political uncertainty in Britain.",
    "Members of 5-Star are holding a ballot on the party's internet platform from 0700 to 1600 GMT to decide whether the group should join forces with the PD, its traditional foe.",
    "Italy's 10-year bond yield fell slid 10 basis points to 0.865% for the first time .",
    "\"It looks like the market is betting on a yes in the online ballot of 5-Star members,\" said Luca Cazzulani, rates strategist at UniCredit.  \"We are a bit more cautious and if there is a no vote the market will be caught off guard.\"",
    "Italian yields extended falls after a Reuters report that European Central Bank policymakers are leaning towards a stimulus package that includes a rate cut, a beefed-up pledge to keep rates low for longer and compensation for banks over the side-effects of negative rates. .",
    "That pushed the gap over safer German Bund yields to around 157 bps , its tightest since May 2018.",
    "The Italian bond market was further supported when 5-Star and the PD unveiled a shared policy programme on Tuesday to serve as the basis of a new coalition, putting an expansionary 2020 budget at the top of their agenda, but promising that it would not endanger public finances. ",
    "Even heightened Brexit uncertainty and weak stock markets failed to dent demand for Italian bonds, which tend to move with other risk assets, thanks to reduced political uncertainty in Italy and heightened expectations for rate cuts and stimulus at next week's ECB meeting.",
    "Britain's lawmakers will decide on Tuesday whether to move one step closer to an early election when they vote on the first stage of their plan to block Prime Minister Boris Johnson from pursuing a no-deal Brexit. ",
    "UK 10-year gilt yields fell to a record low of 0.34% , helping push Germany's benchmark 10-year bond yield  to a fresh record low at -0.74%.",
    "\"Bund yields are being pulled lower by UK yields this week… as the UK is inching towards possible snap elections and [on uncertainty of] when such a possible election would be,\" said KBC strategist Mathias van der Jeugt.",
    "An industry report showing the U.S. manufacturing sector contracted in August for the first time since 2016 also pushed yields lower, with U.S. Treasury yields down sharply .",
    "Meanwhile, Austria's 10-year bond yield fell to a record low of -0.48%  after the country sold 1 billion euros of five and 10-year bonds. .",
    "Both bonds received orders of about 1.8-times the amounts sold, despite offering average yields of -0.798% and -0.494% respectively."
  ],
  "published_datetime": "2019-09-03 06:40:00"
}