{
  "url": "https://www.nasdaq.com/article/relief-for-european-stocks-as-political-tensions-ease-20190904-00874",
  "title": "Relief for European stocks as political tensions ease - Nasdaq.com",
  "text": [
    "    * Italian shares rally as PM unveils cabinet ",
    "* Opponents of 'no-deal' Brexit defeat PM Johnson",
    "* FTSE 100 under-performs as pound halts slide",
    "By Sruthi Shankar",
    "Sept 4 (Reuters) - A rally in Italian shares driven by theformation of a new government lifted European stocks onWednesday, with investors also taking heart from an easing ofpolitical tensions in Britain and Hong Kong.",
    "The pan-European STOXX 600 index .STOXX rose 0.89% at theclose, with Milan-listed shares soundly outpacing their Europeanpeers after Italian Prime Minister Giuseppe Conte unveiled hisnew cabinet. urn:newsml:reuters.com:*:nL5N25V42V",
    "Investors cheered an unlikely coalition uniting rivalpolitical parties the 5-Star Movement and the Democratic Party,heading off the risk of an early election and prolongedpolitical instability.",
    "\"This is a very clear interpretation by the market that thenew government is seen as positive, at least when it comes toapproach to the budget policies and interaction with theEuropean Commission,\" said Marco Valli, Unicredit's head ofmacro research.",
    "\"You have a government that is expected to stick to apro-European stance, which is important because that is neededfor financial stability even if we have a deterioration in theglobal environment.\"",
    "Italy's FTSE MIB index .FTMIB rallied about 1.6%, touchinga more than one-month high, while the banking index .FTIT8300 jumped 1.75%.",
    "On the other side of the English Channel, British lawmakersdefeated Boris Johnson in parliament on Tuesday in a bid toprevent him from taking Britain out of the EU without a divorceagreement, prompting the prime minister to demand a snapelection. urn:newsml:reuters.com:*:nL5N25V2FD",
    "Britain's exporter-heavy FTSE 100 .FTSE underperformedwith a 0.59% rise, weighed down by a steadying of the pound onTuesday's events at Westminster.",
    "Adding to the upbeat mood was data that showed activity inChina's services sector expanded at the fastest pace in threemonths in August as new orders rose. urn:newsml:reuters.com:*:nL3N25U2EK",
    "Surveys showed euro zone business growth was a touch fasterthan expected last month but remained in the doldrums as thebloc's dominant service industry only partially offset aslowdown in manufacturing. urn:newsml:reuters.com:*:nL5N25U2CV",
    "Investors will now look ahead to a European Central Bankmeeting next week that is widely expected to lower interestrates as policymakers seek to head off a slowdown caused by theprotracted U.S.-China trade war.",
    "Trade-sensitive sectors such as miners, automakers and oiland gas companies led the charge on the main STOXX 600 index.   ",
    "Asia-exposed UK banks HSBCHSBA.L and Prudential PRU.L boosted the main index and helped drive a 1.24% rise in thebanking sector .SX7P , after Hong Kong leader Carrie Lamwithdrew an extradition bill that triggered months of oftenviolent protests so the Chinese-ruled city. urn:newsml:reuters.com:*:nL3N25V0NC",
    "The news also helped luxury stocks - LVMH Moet HennessyLouis Vuitton SE LVMH.PA , Swiss Jewelry company CompagnieFinanciere Richemont SACFR.S and Gucci owner Kering SAPRTP.PA - rise between 2.4% and 3.6%. (Reporting by Sruthi Shankar in Bengaluru) ((sruthi.shankar@thomsonreuters.com; within U.S. +1 646 2238780; outside U.S. +91 80 6749 6328))"
  ],
  "published_datetime": "2019-09-04 12:40:00"
}