{
  "url": "https://www.nasdaq.com/article/tivos-upcoming-edge-dvr-detailed-in-new-leak-cm1206829",
  "title": "TiVo’s Upcoming Edge DVR Detailed in New Leak - Nasdaq.com",
  "text": [
    "   TiVo    's next-generation DVR, dubbed the   TiVo    Edge, is not so secret anymore: Some box art   unearthed by Zatznotfunny.com    this past weekend reveals both the design as well as most key   features of the device. The TiVO Edge, which    Variety    first reported on in June    , looks a bit like a PlayStation 4, complete with a groove that   separates top and bottom of the device. The configuration found   by Zatznotfunny comes with 6 tuners, which would make it possible   to watch one show and record 5 others at the same time, as well   as a 2 TB hard drive. A TiVo spokesperson didn't immediately respond to a request   for comment.makeArticleAd(); Other features detailed in the leak include native voice   control, likely via the DVR's remote, as well as Alexa control   via external Echo speakers. The device will also support Dolby   Atmos, Dolby Vision HDR, and 4K video. The TiVo Edge will support cable TV recording, but the company   is apparently also working on a model for cord cutters that's all   about recording over-the-air broadcast TV. TiVo has been supporting a small retail business with devices   like the Edge for years, but most of the company's business has   been about working with operators. Earlier this year, TiVo   appointed former Weather Channel CEO   Dave Shull as its new CEO    . In addition to leading the cable network, Shull has also been a   key executive at Dish and its sister company Echostar.   More from Variety    Vevo Partners With Vewd to Bring Music         Videos to TiVos, Smart TVs   Tivo Preps Series 7 'Tivo Edge' DVR Made by         Arris   TiVo Names Dave Shull, Former Weather         Channel and Dish Exec, Its New CEO     ",
    " TiVo    's next-generation DVR, dubbed the   TiVo    Edge, is not so secret anymore: Some box art   unearthed by Zatznotfunny.com    this past weekend reveals both the design as well as most key   features of the device.",
    "The TiVO Edge, which    Variety    first reported on in June    , looks a bit like a PlayStation 4, complete with a groove that   separates top and bottom of the device. The configuration found   by Zatznotfunny comes with 6 tuners, which would make it possible   to watch one show and record 5 others at the same time, as well   as a 2 TB hard drive.",
    "A TiVo spokesperson didn't immediately respond to a request   for comment.",
    "Other features detailed in the leak include native voice   control, likely via the DVR's remote, as well as Alexa control   via external Echo speakers. The device will also support Dolby   Atmos, Dolby Vision HDR, and 4K video.",
    "The TiVo Edge will support cable TV recording, but the company   is apparently also working on a model for cord cutters that's all   about recording over-the-air broadcast TV.",
    "TiVo has been supporting a small retail business with devices   like the Edge for years, but most of the company's business has   been about working with operators. Earlier this year, TiVo   appointed former Weather Channel CEO   Dave Shull as its new CEO    . In addition to leading the cable network, Shull has also been a   key executive at Dish and its sister company Echostar.",
    "  More from Variety    Vevo Partners With Vewd to Bring Music         Videos to TiVos, Smart TVs   Tivo Preps Series 7 'Tivo Edge' DVR Made by         Arris   TiVo Names Dave Shull, Former Weather         Channel and Dish Exec, Its New CEO   ",
    " More from Variety ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:55:21"
}