{
  "url": "https://www.nasdaq.com/article/should-you-buy-or-sell-kraft-heinz-right-now-cm1206863",
  "title": "Should You Buy or Sell Kraft Heinz Right Now? - Nasdaq.com",
  "text": [
    " Going into 2019, few investors would have guessed that   Kraft Heinz    (NASDAQ: KHC) would see such a drastic decline. Shares of the   packaged-foods giant   fell by 27%    on February 22 when it announced a $15.4 billion impairment   charge that wiped out an otherwise profitable quarter. At the   same time, the company also announced that the   SEC had begun an investigation into its   accounting practices    , specifically calling into question Kraft Heinz's previous   procurement practices. Soon after, the SEC filed an additional   subpoena to investigate Kraft Heinz's goodwill assessments and   asset impairments. While not necessarily related to the $15.4   billion writedown, the news that the SEC is investigating a   company is rarely a good sign in the eyes of   investors. Since then, shares have continued to plummet and   are down 47% from its 2019 high. Over the past few months, investors have continually wondered   whether now is the right time to buy into the stock. While the   fact that Warren Buffet is still holding onto his investment in   Kraft Heinz has helped prevent a massive sell-off, it doesn't   change the fact that investors holding onto its stock have   continued losing money. Certain bulls on Wall Street recommended   Kraft Heinz as a good deal after its stock price plunged. This   hasn't turned out to be the case as in the past month   alone prices have fallen by another 20.7%. Investors now have to ask themselves whether the stock is   getting close to bottoming out or if shares will continue to   fall even more.makeArticleAd();   IMAGE SOURCE: GETTY IMAGES  Recent financial figures In early August, Kraft Heinz released its   financial results    for the first half of 2019. Operating income fell by 54.6%, while   adjusted EBITDA and adjusted earnings per share both dropped by   19.3% and 23.8% respectively compared to the same period last   year. While these figures surpassed analyst expectations, the   main metric where Kraft disappointed shareholders was in sales,   which came in at $12.36 billion. This was a $629 million decline   from the same period last year and was less than the $12.68   billion consensus estimate from Wall Street.   DATA SOURCE: KRAFT HEINZ FINANCIAL REPORT  \"The level of decline we experienced in the first half of this   year is nothing we should find acceptable moving forward,\" said   Kraft Heinz CEO Miguel Patricio in a   press release    in August. \"We have significant work ahead of us to set our   strategic priorities and change the trajectory of our   business.\" Potential recovery signs While Kraft Heinz reduced its year-end guidance in light of   these results, there are some early signs of improvement on the   balance sheet. The main silver lining comes from its organic   sales -- sales that are adjusted for currency, divestitures, and   acquisitions - which have begun to stabilize. In comparison to Q1   2019, the decline in organic net sales stabilized in Q2, coming   in at only at loss of 0.3% whereas the full six-month period came   in at a loss of 1.5%. Management also said in their conference call with analysts   the company's sales declined because of trade negotiations in   Europe alongside lower inventory levels in retail locations in   North America. Specifically, Kraft mentioned that 80% of the   decline in organic net sales mentioned above is attributable to   retail inventory reductions in the U.S. and Canada. What this means is that without the decline in retail   inventories and the trade negotiations with Europe, sales might   have even been showing signs of growth. While it's true that   management pulled its guidance, it's also true that there's so   much uncertainty in the markets right now that it makes sense for   Kraft Heinz to cut back on its estimates for the future. Assuming   that inventory stabilizes in the future, Kraft Heinz could see a   surprising increase in sales over the next six to 12 months much   to the surprise of skeptics.   As for the SEC investigation, Kraft Heinz announced in June   that it will restate financial reports for the past three years   to help fix errors due to mistakes by some of its employees.   However, the company said that any misstatements were not   \"quantitatively material,\" and were mostly related to   technicalities surrounding their supplier contracts. So far, an   internal review from the company found   $208 million    worth of adjustments. What should investors do right now? Kraft Heinz is trading at a 7.55 P/E ratio, remarkably cheaper   than competitors like   General Mills    , (NYSE: GIS) which is trading at 18.55 P/E. However, the stock   is cheap for a good reason and even if someone's looking for a   strong dividend stock, there are better alternatives to consider   such as   Nestle    (OTC: NSRGY) or   Kellogg    (NYSE: K) , both companies that have been doing very well so far   in 2019. It's true that there is some potential upside with Kraft   Heinz, but it's not enough to justify a buy right now. Whether   you're looking for a growth stock or a dividend/value investment,   there are better companies out there to consider.   10 stocks we like better than Kraft Heinz       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Kraft Heinz wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Mark Prvulovic      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Going into 2019, few investors would have guessed that   Kraft Heinz    (NASDAQ: KHC) would see such a drastic decline. Shares of the   packaged-foods giant   fell by 27%    on February 22 when it announced a $15.4 billion impairment   charge that wiped out an otherwise profitable quarter. At the   same time, the company also announced that the   SEC had begun an investigation into its   accounting practices    , specifically calling into question Kraft Heinz's previous   procurement practices. Soon after, the SEC filed an additional   subpoena to investigate Kraft Heinz's goodwill assessments and   asset impairments. While not necessarily related to the $15.4   billion writedown, the news that the SEC is investigating a   company is rarely a good sign in the eyes of   investors. Since then, shares have continued to plummet and   are down 47% from its 2019 high.",
    "Over the past few months, investors have continually wondered   whether now is the right time to buy into the stock. While the   fact that Warren Buffet is still holding onto his investment in   Kraft Heinz has helped prevent a massive sell-off, it doesn't   change the fact that investors holding onto its stock have   continued losing money. Certain bulls on Wall Street recommended   Kraft Heinz as a good deal after its stock price plunged. This   hasn't turned out to be the case as in the past month   alone prices have fallen by another 20.7%.",
    "Investors now have to ask themselves whether the stock is   getting close to bottoming out or if shares will continue to   fall even more.",
    "  IMAGE SOURCE: GETTY IMAGES ",
    "IMAGE SOURCE: GETTY IMAGES",
    "In early August, Kraft Heinz released its   financial results    for the first half of 2019. Operating income fell by 54.6%, while   adjusted EBITDA and adjusted earnings per share both dropped by   19.3% and 23.8% respectively compared to the same period last   year. While these figures surpassed analyst expectations, the   main metric where Kraft disappointed shareholders was in sales,   which came in at $12.36 billion. This was a $629 million decline   from the same period last year and was less than the $12.68   billion consensus estimate from Wall Street.",
    "  DATA SOURCE: KRAFT HEINZ FINANCIAL REPORT ",
    "DATA SOURCE: KRAFT HEINZ FINANCIAL REPORT",
    "\"The level of decline we experienced in the first half of this   year is nothing we should find acceptable moving forward,\" said   Kraft Heinz CEO Miguel Patricio in a   press release    in August. \"We have significant work ahead of us to set our   strategic priorities and change the trajectory of our   business.\"",
    "While Kraft Heinz reduced its year-end guidance in light of   these results, there are some early signs of improvement on the   balance sheet. The main silver lining comes from its organic   sales -- sales that are adjusted for currency, divestitures, and   acquisitions - which have begun to stabilize. In comparison to Q1   2019, the decline in organic net sales stabilized in Q2, coming   in at only at loss of 0.3% whereas the full six-month period came   in at a loss of 1.5%.",
    "Management also said in their conference call with analysts   the company's sales declined because of trade negotiations in   Europe alongside lower inventory levels in retail locations in   North America. Specifically, Kraft mentioned that 80% of the   decline in organic net sales mentioned above is attributable to   retail inventory reductions in the U.S. and Canada.",
    "What this means is that without the decline in retail   inventories and the trade negotiations with Europe, sales might   have even been showing signs of growth. While it's true that   management pulled its guidance, it's also true that there's so   much uncertainty in the markets right now that it makes sense for   Kraft Heinz to cut back on its estimates for the future. Assuming   that inventory stabilizes in the future, Kraft Heinz could see a   surprising increase in sales over the next six to 12 months much   to the surprise of skeptics.",
    "As for the SEC investigation, Kraft Heinz announced in June   that it will restate financial reports for the past three years   to help fix errors due to mistakes by some of its employees.   However, the company said that any misstatements were not   \"quantitatively material,\" and were mostly related to   technicalities surrounding their supplier contracts. So far, an   internal review from the company found   $208 million    worth of adjustments.",
    "Kraft Heinz is trading at a 7.55 P/E ratio, remarkably cheaper   than competitors like   General Mills    , (NYSE: GIS) which is trading at 18.55 P/E. However, the stock   is cheap for a good reason and even if someone's looking for a   strong dividend stock, there are better alternatives to consider   such as   Nestle    (OTC: NSRGY) or   Kellogg    (NYSE: K) , both companies that have been doing very well so far   in 2019.",
    "It's true that there is some potential upside with Kraft   Heinz, but it's not enough to justify a buy right now. Whether   you're looking for a growth stock or a dividend/value investment,   there are better companies out there to consider.",
    "  10 stocks we like better than Kraft Heinz       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Kraft Heinz wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Kraft Heinz       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Kraft Heinz wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Mark Prvulovic      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:47:13"
}