{
  "url": "https://www.nasdaq.com/article/dupont-to-sell-silicon-carbide-wafer-business-to-sk-siltron-cm1210072",
  "title": "DuPont to Sell Silicon Carbide Wafer Business to SK Siltron - Nasdaq.com",
  "text": [
    "  DuPont de Nemours, Inc.  's DD  Electronics & Imaging (E&I) unit has agreed to divest its Compound Semiconductor Solutions (\"CSS\") business to South Korea-based leading silicon wafer supplier, SK Siltron.  makeArticleAd();  Per DuPont, the CSS business has state-of-the-art technologies for the production of SiC (silicon carbide) wafer to cater the power electronics market. However, it is not a strategic priority for the E&I unit, the company noted.    The deal, which is subject to customary regulatory clearances, is expected to close by the end of this year.    The divestment is in sync with DuPont's strategy of active portfolio management. It is also in consistent with the company's disciplined capital allocation to further align its portfolio with high return opportunities. DuPont believes that the CSS business will prosper under the ownership of SK Siltron.    DuPont, which was formerly known as DowDuPont Inc., started trading as a stand-alone company on Jun 3, 2019 following the separation of its Agriculture division through the spin-off of Corteva, Inc.    DuPont's shares are down around 6.2% since it started trading on the NYSE, compared with the roughly 1.5% decline recorded by the industry  .       DuPont, last month, raised its adjusted earnings per share guidance to the range of $3.75-$3.85 for 2019. It, however, sees organic sales for the year to be modestly down from last year. The company expects weak demand in its short-cycle businesses to continue in the second half.    The company benefited from its cost and pricing actions in the second quarter and noted that it is driving additional cost actions in the second half.   Zacks Rank & Key Picks    DuPont currently carries a Zacks Rank #3 (Hold).    Better-ranked stocks worth considering in the basic materials space include Kinross Gold Corporation KGC  , Arconic Inc. ARNC  and NewMarket Corporation NEU  , each sporting a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .    Kinross has projected earnings growth rate of 160% for the current year. The company's shares have surged around 70% in a year's time. Arconic has an estimated earnings growth rate of 50% for the current year. Its shares have gained roughly 18% in the past year.    NewMarket has an expected earnings growth rate of 16.2% for the current year. Its shares have gained around 15% in the past year.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.          Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.       See the pot trades we're targeting>>      Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   DuPont de Nemours, Inc. (DD): Free Stock Analysis Report   NewMarket Corporation (NEU): Free Stock Analysis Report   Kinross Gold Corporation (KGC): Free Stock Analysis Report   Arconic Inc. (ARNC): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " DuPont de Nemours, Inc.  's DD  Electronics & Imaging (E&I) unit has agreed to divest its Compound Semiconductor Solutions (\"CSS\") business to South Korea-based leading silicon wafer supplier, SK Siltron.  makeArticleAd();  Per DuPont, the CSS business has state-of-the-art technologies for the production of SiC (silicon carbide) wafer to cater the power electronics market. However, it is not a strategic priority for the E&I unit, the company noted.    The deal, which is subject to customary regulatory clearances, is expected to close by the end of this year.    The divestment is in sync with DuPont's strategy of active portfolio management. It is also in consistent with the company's disciplined capital allocation to further align its portfolio with high return opportunities. DuPont believes that the CSS business will prosper under the ownership of SK Siltron.    DuPont, which was formerly known as DowDuPont Inc., started trading as a stand-alone company on Jun 3, 2019 following the separation of its Agriculture division through the spin-off of Corteva, Inc.    DuPont's shares are down around 6.2% since it started trading on the NYSE, compared with the roughly 1.5% decline recorded by the industry  .",
    "DuPont, last month, raised its adjusted earnings per share guidance to the range of $3.75-$3.85 for 2019. It, however, sees organic sales for the year to be modestly down from last year. The company expects weak demand in its short-cycle businesses to continue in the second half.    The company benefited from its cost and pricing actions in the second quarter and noted that it is driving additional cost actions in the second half.   Zacks Rank & Key Picks    DuPont currently carries a Zacks Rank #3 (Hold).    Better-ranked stocks worth considering in the basic materials space include Kinross Gold Corporation KGC  , Arconic Inc. ARNC  and NewMarket Corporation NEU  , each sporting a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .    Kinross has projected earnings growth rate of 160% for the current year. The company's shares have surged around 70% in a year's time.",
    "Arconic has an estimated earnings growth rate of 50% for the current year. Its shares have gained roughly 18% in the past year.    NewMarket has an expected earnings growth rate of 16.2% for the current year. Its shares have gained around 15% in the past year.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.          Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.       See the pot trades we're targeting>>   ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:07:00"
}