{
  "url": "https://www.nasdaq.com/article/the-michaels-companies-inc-mik-q2-2019-earnings-call-transcript-cm1207481",
  "title": "The Michaels Companies Inc (MIK) Q2 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   The Michaels Companies Inc    (NASDAQ: MIK)        Q2 2019 Earnings Call       Sep 4, 2019 ,   9:00 a.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Good morning. My name is Carey, and I will be your conference   operator today. At this time, we'd like to welcome everyone to   The Michaels Companies [Phonetic] Second Quarter Earnings   Conference call. [Operator Instructions] Thank you. And now I'd like to turn the call over to your host, Elaine   Locke, Vice president of Investor Relations and Treasurer. Ms.   Locke, you may begin the conference.  Elaine Locke    --   Vice President, Investor Relations and Treasurer  Thank you, Carey. Good morning, and thank you for joining us   today. Earlier this morning, we released our financial results   for the second quarter of fiscal 2019. A copy of the press   release and a few related slides are available in the Investor   Relations section of our website at www.michaels.com. Before we begin our discussion, let me remind you that today's   press release and the presentations made by our executives on   this call may constitute forward-looking statements and are made   pursuant to and within the meaning of the safe harbor provisions   of the Private Securities Litigation Reform Act of 1995 as   amended. While these statements address plans or events, which we   expect will or may occur in the future, a number of factors, as   set forth in our SEC filings and press releases, could cause   actual results to differ materially from our expectations. We   refer you to and specifically incorporate the cautionary and risk   statements contained in today's press release and in our SEC   filings. You are cautioned not to place undue reliance on these   forward-looking statements, which speak only as of today,   September 4th, 2019. We have no obligation to update or revise   our forward-looking statements, except as required by law, and   you should not expect us to do so. On today's call, we will reference non-GAAP financial   measures, including adjusted operating income, adjusted net   income and adjusted diluted earnings per share, all adjusted for   restructuring charges, primarily related to the Aaron Brothers   and Pat Catan store closures, severance charges related to the   departure of our former CEO, a write-off of an investment in a   liquidated business, losses on early extinguishment of debt and   refinancing costs, interest paid on our 2020 senior subordinated   notes during a period between the issuance of our 2027 senior   notes and the redemption of our 2020 senior subordinated notes   and tax adjustments related to the 2017 Tax Act as applicable. A   reconciliation of these measures to the corresponding GAAP   measures are detailed in today's earnings release. We'll begin   this morning with prepared remarks from Mark Cosby, Interim CEO;   and Denise Paulonis, CFO. Following our prepared remarks, we will   open the call for questions. Now I'd like to introduce Mark Cosby for some initial   comments. Mark?  Mark Cosby    --   Interim Chief Executive Officer and Director  Thank you, Elaine, and good morning, everyone. This morning we   reported results for the second quarter that were above the   guidance range we provided on our last       earnings call    . Comp store sales were positive 0.3%, adjusted operating income   was $75 million and adjusted diluted earnings per share was   $0.19. In the last call, I said our number one goal is to improve   our sales performance and we are pleased to see movement in that   direction. In this call, I will talk about the actions we   implemented to drive improvement in the second quarter and then   provide a look at our new long-term strategy. You will see that   the priorities for 2019 that are embedded in our strategy has   started to have an impact on our results and will play a bigger   role in our expected second half performance. Let's start with the review of our Q2 results and progress.   The foundation for all of the actions we took to improve our   second quarter results is based on our shift to become much more   customer centric. We listened to our customer and implemented an   action plan to improve our results. The actions included   promotion calendar process improvements, value perception   enhancements, the expansion of our growth category initiative and   enhancing our e-comm growth capabilities. The enhancement in our   promotion planning process focused on ensuring that our weekly   promotions across all media work together to deliver our sales   plans. We put comprehensive plans together for every week,   particularly focused on our big events. An example was a very   successful June lowest price of the season event, which featured   a cohesive plan, including addressable TV, email, digital,   social, store presentations and store signage. Another example was our first semi-annual clearance event in   early July, that included a comprehensive media program and a   powerful store presentation that was a big success with our   customers. As mentioned on the last call, we identified an   opportunity to improve our value perception based on our customer   research. We took a number of steps to address this value   perception issue. We eliminated the EDV program in all US stores   and we reduced the number of products excluded from coupons to   make it easier and less frustrating for customers. We also   launched a new tool to help us manage the distribution of digital   coupons, while maximizing the benefits of serialization and   limiting coupon abuse. And we adjusted our drive aisle and endcap   presentations to present a stronger value impression. These   actions led to a reduction in customer complaints, improved our   value perception rating and contributed to our improved sales   trend. We've recognized that we have more work to do on the value   perception front. We are heading in the right direction. Our first major project reset of the year came in April with   tools and technology. In response to growing customer interest,   we added 25-feet to this high growth category. This effectively   doubled the space to support an expansion of widely recognized   brands like Cricut, Caesar and Oracle. With the additional space,   we can display more machine samples and we created a power wall   of vinyl accessories. These changes allowed us to expand our   leadership in this important DIY category, and we now offer the   largest assortment of Cricut product of any retail store. This   category help to drive sales and the roll-out help to create some   excitement in the arts and crafts community. We have booked a   strong partnership with the team at Cricut that included our   exclusive launch of the Infusible Ink product. The Cricut CEO   also hosted many events at our stores that drew big crowds and   created many large social media events. The last big contributor to our sales improvement in Q2 was   the success of our e-comm business. We have continued to focus on   building our e-comm capabilities to drive sales, while   implementing initiatives to improve our profitability. The shift   earlier this year to bring our performance in-house has helped us   improve our fulfillment costs, lower our shipping costs and   leverage our fixed cost base. In a rising Buy Online Pick-up In   Store, or BOPIS penetration has also been a big win for our   e-comm profitability. We believe that the actions we took to   improve our results in Q2, will continue to help us as we move   into the second half of the year. Now looking forward to the balance of 2019 and the future, I'm   pleased to provide some insight into our updated long-term growth   strategy. Late in Q4, the Board and our leadership team launched   a comprehensive effort to define our growth strategy for 2020 and   beyond. We engaged external partners combined with internal   resources to help us identify and prioritize customer segments   and customer solutions to drive long-term growth. In June, the   Group, the Board approved our growth strategy and we are now   using it as a road map for planning future growth. As mentioned in the last call, we have defined our target   customer as the core maker. This is someone that is interested in   DIY, crafting, creating fine arts, or is just injecting more   creativity into their life. This target customer definition was   the result of significant customer research looking at attitudes,   behaviors and needs of our customers. We divided them into   different customer segments identifying key characteristics and   spend, then we conduct another set of research to learn how the   core makers shop with traditional quantitative surveys, immersive   interviews with individual customers and focus groups. This   research has led us to believe that we can better focus on this   core maker and increase our overall market share. These core   makers represent two-thirds of our arts and crafts spend and   importantly indicate a strong desire to spend more on DIY   projects. Historically, we have seen stronger growth over time   with these enthusiast customers than we have seen with our novice   customers. We believe that focusing on these maker segments will   drive growth. Our new purpose is we're here for the makers. This purpose   will guide our path to growth and help us ensure that we have our   customers in mind along with financial results when we make   decisions. We have defined three big building blocks that will   drive our maker strategy; build the business better, leverage   digital and data, and reposition the business. We have   initiatives in place with project teams to drive these building   blocks. The initiatives in support of building the business   better and leveraging digital and data are many of the 2019   priorities that we discussed on our last call. We think of these   initiatives as quick hits that we started well in advance of the   finalization of our strategic planning process and will deliver   results in the second half of this year. There are four big initiatives under the build the business   better building block; build the stores' selling culture, create   a customer-centric assortment, optimized pricing and promotions   and maximize marketing productivity. I will provide you with a   brief summary of each of these initiatives starting with build a   solid [Phonetic] culture. This initiative is designed to shift   the store culture from task-minded activities to a focus on the   customer and selling. The stores will have scorecards with   metrics to reinforce priorities that show how they rank compared   to other stores creating some friendly competition. They will   define action plans to improve their scorecard results based on   the best practices of our top performing stores and there will be   consistent coaching and recognition programs in place to motivate   and inspire progress. This comprehensive program was rolled out   to every store leader by the end of August and we are expecting   the program to improve our customer conversion in our basket size   in advance of the holiday season. We have also launched our customer-centric assortment   initiative with the goal of adding space to core maker categories   with high growth potential. We launched the program in three   phases, starting with the previously discussed technology launch   in May, and the expansion of craft storage and fine art in July   and August. The technology expansion continues to perform well   and should be a sales driver for us in Q3 as well. In July, we   increased the selling space in craft storage to accommodate and   expanded assortment with a more prominent display for the   customer, including a craft card wall. The response has been very   positive and our customers are sharing online how they use these   new cards to create solutions for their storage needs. When we   marketed the new cards, we leaned into the teachers with   back-to-school ideas for keeping the classroom organized. In   August, we completed the reset of art supplies, expanding our   assortment of drawing and painting categories by adding over   20-feet to display, including 1,000 new items in drawing and   paint, expanding several name brands such as Tombow, Sharpie and   Micron. The third build the business better initiative is to optimize   our pricing and promotions. This initiative supports improving   both our customer value perception and our profitability. This   pricing optimization work will also support the price element of   our tariff mitigation effort. In addition to the steps we have   already taken to streamline and enhance our coupon strategy, we   are taking a fresh look at our mix of promotions, coupons and   regular priced to determine how we can simplify the customer   experience. We are creating new tools to help us evaluate the   effectiveness of a discounting campaign and make sure we are   getting the return on investment. A good example is a category   assessment that informed us that we would improve our sales and   margin by moving from buy one get one free promotion to a buy one   get one 50% offer. Our goal is to take action on larger scale as   the year progresses to improve our value perception, eliminate   unproductive discounting and improve sales. The final initiative under build the business better is to   maximize our marketing productivity. This initiative is focused   on optimizing our existing marketing spend to more effectively   reach our core maker customer and to drive higher sales. We   implemented a new tool that we will use to assess the   productivity of all of our marketing vehicles and enable us to   shift our spending to the highest productivity options. This will   mean shifting funds from less productive mass media options such   as newspaper to more productive options such as digital and   addressable TV. We are also working to optimize within each type   of marketing spend, such as improving the productivity of our   digital spending options and improving the efficiency of our   organic search results. The second building block of our maker strategy is to leverage   digital and data. This building block is comprised of two   initiatives; enhanced CRM and profitable e-comm growth. The   enhanced CRM initiative is focused on increasing our customer   engagement through personalization of all customer messaging. The   goal is to create category and inspiration-focused content,   supporting more personalized and relevant communication across   channels beginning with email, followed by web and digital   marketing. We have an extensive collection of customer data, including 75   million customer records, 31 million active email addresses and   38 million customers in our rewards program. Today, we can link   more than 82% of our sales to a specific customer. We have   continued to test proprietary models built to help us predict   customer purchases based on interactions with our michaels.com,   the Michaels app, email and in-store purchase behavior. We   started leveraging this data in May to personalize emails to   customers based on their spending history. Our earlier results   have been very encouraging with open and click rates almost three   times the rate of our typical mass email. Today, around 1% of our emails are personalized and our goal   is to move toward personalizing 15% of our emails by the end of   this year and much higher as we move into 2020. We will then move   toward personalizing all of our customer messaging channels,   including the website and digital messaging. The benefit will be   improving the engagement with our customers and driving higher   sales results. As an extension of the CRM initiative, we will be   enhancing our rewards program in 2020 to create a more meaningful   loyalty program. We will test components of this loyalty program   later this year, so we are ready to launch the new program by the   middle of next year. The second leverage digital and data initiative is to create   more profitable e-commerce growth. The goal is to maintain a   rapid sales growth momentum, while enhancing the profitability of   our omni-channel options. We have a number of initiatives in   place to continue our growth momentum, including optimizing our   digital spending, enhancing our website capabilities and   personalizing the website for our customers. Today, our site is   the same for every customer that visits. Later this year, the   site will be customized to each site visitor based on their   spending history. We also continue to see strong customer enthusiasm for Buy   Online Pick-up In Store, or BOPIS. From a cost perspective, BOPIS   is very attractive way to fulfill an e-commerce order as it does   not include shipping costs. In Q2, BOPIS accounted for 44% of   online sales and nearly two-thirds of online orders. We continue   to use technology to build facilitate BOPIS orders and this   quarter we rolled out near real-time inventory tracking to   improve BOPIS fulfillment percentages. In addition to our focus on driving omni-channel sales, we are   also focused on improving the profitability of this important   growth channel. We have initiatives in place to improve the gross   margin, fulfillment and shipping costs for all the ways that we   distribute products to our customers. We believe expanding our   omni-channel presence is a critical piece of our long-term growth   opportunity. We are actively working on plans that will improve   our cost structure, while enhancing the customer experience to   drive longer term profitable growth. The third and final building blocks of our maker strategy is   to reposition the business. This building block is focused on   initiatives that will not help us in 2019, but will set us up for   growth in 2020 and beyond. This building block today is comprised   of three initiatives that are in development; a Michael's   community, a maker-centered store experience and maker-centered   categories. Let's take a quick look at these three growth   initiatives. Our extensive research over the last few months has shown us   how important community is to our maker customers. These   customers want to share and learn with our maker customers. We   saw this come to life with the roll-out of our tools and   technology product we said in early May, when our customers were   sharing in social media, attending events and coming to our   stores to take classes. We are focusing on ways to build a   community with our customers in-stores and online. This will   include work to take our existing successful community classroom   to the next level and work to create an online community for   maker customers. We have also started work to create a maker-centered store   experience. This initiative will include the development of a   store designed specifically to meet the needs of our maker   customer. The store design will feature an easier shopping   experience, a curated assortment and enhanced service experience,   full omni-channel capabilities, and it will bring the community   experience to life. We will build this new concept in a lab   environment this year and then open up new stores next year. The   goal will be to learn from these stores and expand the best   practices in a low cost way across the system. The third component of repositioning the business is our   maker-centered category initiative. This initiative is focused on   innovating our assortment and presentation targeting our maker   customers. The work will lead to the development of the   assortment for our new maker-centered store. The work will also   form the basis for a new category management process that will   leverage customer feedback to optimize our key product categories   for our maker customer across all of our stores. This focus on   the maker will translate into making shifts in some core   assortments. Categories such as art, tools and technology and   jewelry will become more important to us. We will also modify categories to meet the needs of our   makers, an example can be found in jewelry. When we were focused   on bringing the novice into the store, we carried more finished   jewelry and fashion watches in the assortment. With the DIY   jewelry maker in mind, we will now be more focused on giving her   the best assortment of jewelry pieces, so she can assemble what   she wants. We will not be abandoning categories just making sure   the mix within the category is right. Seasonal products come to   mind as a question, but this category is very important to the   core maker, if they like to decorate for events. This   maker-centered category initiative will be a big component of our   future growth plans. In closing, we are laser-focused on driving sales and   improving profitability. We are pleased with the actions we have   implemented have led to improve results in Q2. Our 2019   priorities comprised of our build the business better and our   leverage digital and data initiatives are showing positive   results and should set us up for continued improvement in the   second half of this year. We also believe that our we're here for   the maker purpose and strong focus on the customer will position   Michaels for stronger growth in 2020 and beyond. Now I'd like to turn the call over to Denise. Denise?  Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer  Thank you, Mark. As Mark said at the beginning of his   comments, we're pleased with our Q2 results. We returned to   positive comparable store sales, posting a 0.3% comp, grew   adjusted operating income 5.8% versus last year and grew adjusted   EPS 26.7% versus last year. Second quarter net sales were $1.03   billion compared to $1.05 billion last year. The decrease in net   sales for the quarter was primarily due to the closure of our Pat   Catan stores in the fourth quarter of fiscal 2018, and was   partially offset by our 0.3% increase in comparable store sales   and sales from the operation of 11 net new Michael stores during   the quarter. In Q2, the company opened four new Michaels stores,   closed two Michaels stores and relocated one of Michaels store.   The 0.3% increase in comparable store sales was driven by an   increase in average ticket, partially offset by decrease in   customer transactions. Sales from michaels.com were strong again this quarter, driven   by increased traffic and higher conversion rate with 44% of   e-commerce sales and 62% of e-commerce orders fulfilled through   our Buy Online Pick-up In Store or BOPIS initiative. From a   category perspective, tools and technology, craft storage and our   supplies were our strongest categories this quarter, while   traditional paper crafting supplies and kids crafts were more   challenged. Gross profit dollars for the quarter were $367   million, compared to $373 million last year. As a percentage of   sales, our gross profit rate for the quarter was 35.5% versus   35.4% last year, an increase of about 10 basis points. While the   increase in gross margin was small, there were several factors   that mostly offset each other, including benefits from our   ongoing pricing and sourcing initiative and improved occupancy   cost leverage. The increase from these factors was offset by the   impact of tariffs on inventory repurchase from China and increase   in promotional activity and a change in sales mix. Of note, the   elimination of our EDV program and return to a high low strategy   for certain items in our store, as well as our first ever   semi-annual clearance event contributed to the increase in   promotional activity. Total store rent expense for the quarter was $98 million   versus $101 million last year. The decrease in store rent expense   was due to the Pat Catan's store closures, partially offset by   the impact of a net 11 additional Michaels stores. For the   quarter, SG&A expense, including store pre-opening costs and   restructure charges was $296 million, or 28.6% of sales compared   with $299 million, or 28.4% of sales last year. The decrease in   SG&A expense was primarily due to a $6 million decrease in   expenses related to the closure of the Pat Catan's stores, a   timing shift in our performance-based compensation and a timing   shift of marketing expenses till later in the year. Additionally, in the second quarter of 2019, we reported a   restructure charge of $3.9 million related to the closure of all   of our Pat Catan's stores during the fourth quarter of fiscal   2018. As a reminder, in the second quarter of fiscal 2018, we   recorded a $3.2 million gain related to the settlement of lease   obligations associated with the closure of substantially all of   our Aaron Brothers stores during the first quarter of fiscal   2018. GAAP operating income was $71 million, compared to $74 million   in the second quarter of fiscal 2018. Excluding the restructure   charges, adjusted operating income for Q2 of fiscal 2019 was $75   million, compared to adjusted operating income of $71 million in   the prior year, an increase of 5.8%. For the quarter, interest expense was $40 million, about $3   million higher than the second quarter last year. This increase   was primarily due to higher LIBOR rates associated with our   variable rate term loan. The higher interest rate on our 2027   Senior Notes, doubled interest when both the 2027 Senior Notes   and 2020 Senior Subordinated Notes were outstanding for 21 days.   The increase was partially offset with lower settlement payments   associated with our interest rate swaps. In July 2019, we redeemed our $510 million Senior Subordinated   Notes due in 2020 with cash on hand and proceeds from the   issuance of $500 million in senior unsecured notes that mature in   2027 and bear an interest rate of 8%. Also, I'm pleased to   announce that we've also just completed an amend and extend on   our asset-backed revolver to move the maturity from May 2021 to   August of 2024. Our nearest-term maturity is now in 2023 for our   term loan. The effective tax rate was 18.9%, compared to 24% in the   second quarter of last year. The effective tax rate in Q2 of this   year includes a tax benefit associated with a state income tax   settlement, partially offset by the vesting of restricted shares   and the expiration of certain vested stock options. On a GAAP   basis, net income was $25 million, or $0.16 per diluted share   compared to $27 million, or $0.15 per diluted share in the second   quarter of fiscal 2018. Excluding the restructure charge   associate with the closing of the Pat Catan stores and the   refinancing costs of our debt, including double interest while   both our old senior subordinated notes and the new senior notes   were outstanding for 21 days, adjusted net income was $30   million, or $0.19 per diluted share compared to $26 million, or   $0.15 per diluted share in Q2 of fiscal 2018, an increase of   26.7%. During the quarter, we purchased 3 million shares in the open   market for $25 million as part of our previously announced share   repurchase program. As of today, our total authorization   remaining for future repurchases is approximately $373 million.   As a reminder, our share repurchase program does not have an   expiration date, and the timing and number of repurchase   transactions under the program will depend on market conditions,   corporate consideration, debt agreement and regulatory   requirements. In light of the current trading price of our common stock and   our available capital resources and requirements, we currently   view additional share repurchases as an attractive use of cash.   We intend to continue to monitor our repurchase program and   execute share repurchases opportunistically subject to   considerations referenced above. Any such repurchases would   without additional activity with respect to our stock, increase   the ownership percentages of our remaining shareholders,   including our sponsors Bain Capital and Blackstone. As a result,   future repurchases may result in the sponsors holding in the   aggregate more than 50% of our outstanding common stock. Total merchandise inventory at the end of the quarter   decreased 1.8% to $1.26 billion compared to $1.28 billion last   year. The decrease in inventory was primarily due to the Pat   Catan's store closures, partially offset by additional inventory   associated with the operation of 11 net additional Michaels   stores. Average inventory per Michaels store, including inventory   for e-commerce, inventory and distribution centers and inventory   in-transit was 2.5% higher than the end of Q2 last year,   inclusive an approximate 170 basis point drag from duties   associated with List 3 tariffs as well as increased inventory   in-transit this year as we pulled some items forward for   delivering to avoid incremental tariffs. We ended Q2 with more than $800 million in liquidity,   including $131 million in cash on our balance sheet and $686   million available under our revolver. Total debt at the end of   the quarter was $2.7 billion. Our total debt to adjusted EBITDA   on a trailing 12-month basis was 3.3 times and our trailing   12-month interest coverage was 4.1 times. Capital expenditures   for the quarter were $32 million, reflecting investments in   technology projects, including investments to support e-commerce   and our digital platforms and investments in new and relocated   stores. For the full year, we continue to expect to invest   approximately $135 million in capital expenditures. With that as context, let me walk you through our guidance for   the third quarter and the full year. As a reminder, our guidance   excludes the impact of any remaining restructure costs associated   with the closing of our Pat Catan's stores and the additional   costs associated with the departure of our former CEO, the   one-time right off of our Darby Smart investment and any one-time   costs associated with debt refinancing. For fiscal 2019, we now   expect total sales will be between $5.16 billion and $5.19   billion. This reflects our expectation that full year comp sales   will be approximately flat and our plans to relocate 13 Michaels   stores and open 16 net new Michaels stores inclusive of up to 12   Pat Catan's stores, we are rebranding as Michaels stores. While we're pleased with our comp sales performance in the   second quarter, we are cautious regarding the consumer   environment in the second half of the year and the potential   negative impact of six fewer shopping days between Thanksgiving   and Christmas. Additionally, the timing of the openings for three   new stores has shifted out of 2019 and into 2020 and we added one   more store closure for 2019. Adjusted operating income for the   year is expected to be between $625 million and $645 million.   This guidance now reflects the impact of lower estimated sales in   the second half of the year, mostly offset by our second quarter   performance and incremental cost savings that we have identified   since the first quarter of the year. Let me take a moment to comment more broadly on List 4   tariffs. Clearly, the situation remains fluid and if List 4 China   tariffs are fully implemented, we estimate the applicable direct   import product costs subject to these duties are between $400   million and $500 million. Given the pace we turn our inventory,   any material impact from the List 4 tariffs would not be   recognized until 2020. We're continuing to aggressively work our tariff mitigation   plan. Our focus on broad based cost controls, our annual sourcing   savings efforts that has generated approximately $40 million of   benefit in 2019, early success shifting sourcing out of China,   currency moves, progress with vendor negotiations and price   increases taken so far bode well for mitigate -- ability to   mitigate List 4 tariffs. With all this work under way, it is too   early to quantify exactly what portion we would expect to   mitigate in 2020. We expect gross margin to be slightly down versus GAAP gross   margin in 2018. As discussed on the last call, we do expect to   see continued benefits from our ongoing pricing and sourcing   initiatives and better management of promotions offset by   pressure from transportation headwinds, tariffs, the deleverage   of occupancy costs given our comp guidance and continued strong   e-commerce growth. We continue expect to leverage SG&A expense versus GAAP   SG&A expense in 2018, driven primarily by the favorable   impact of anniversarying the restructure charges in 2018, $16   million of investment spending in 2018, and incremental cost   savings identified over the last quarter, partially offset by   modest pressure from higher IT expense reflecting our investments   and a move to more hosting arrangements. We expect interest   expense will be approximately $153 million, reflecting the   expectation of no additional rate increases this year. Our earnings outlook assumes an effective tax rate of between   23% and 24% for the full year. These assumptions translate to an   adjusted diluted EPS range of $2.31 to $2.42 for fiscal 2019, on   approximately 156 million diluted weighted average shares for the   full year. Our fiscal 2019 capital expenditure plan is to invest   approximately $135 million to support longer term growth,   including technology investments, new stores and relocations. Turning to Q3, we expect comp store sales will be flat to up   1%. We plan to open 13 new stores, close one store and relocate   five stores in the quarter. The 13 new stores are two Michaels   stores and 11 Pat Catan locations that will be rebranded as   Michaels stores. 11 of these have already opened and the last one   will open at the very end of the quarter for a total of 12 Pat   Catan stores converting to the Michaels brand. For comparison   purposes in the third quarter last year, we opened five net new   stores and relocated four stores. Of note, for comparison and to your stack purposes, our comp   in the third quarter of 2018 was positively impacted by 270 bps   by the shift of a high volume week, the week of our Christmas   Tree event into the third quarter through the 53rd week in 2017.   That high volume week, the last week of the quarter remains in   the third quarter in 2019. We expect adjusted operating income   for the third quarter will be between $133 million and $142   million. This guidance includes expectation that gross margin   rate and SG&A rate will be flattish versus GAAP rates in Q3   2018. Our Q3 guidance for adjusted diluted earnings per share is   $0.46 to $0.51, assuming a diluted weighted average share count   of $155 million. In closing, we made significant progress on our sales and   profit performance in Q2, as our customer responded positively to   the changes we made coming into the quarter, including value   enhancement and the expansion of key categories. While we're   early in the journey, we are excited and optimistic about the   potential of our 2019 initiative and our longer term strategic   priorities to continue to drive profitable growth. Now I'd like to open the call to take your questions.   Operator? Questions and Answers:  Operator  We will now begin the question-and-answer session. [Operator   Instructions] The first question will come from Steve Forbes with   Guggenheim Securities.  Steven Forbes    --   Guggenheim Securities -- Analyst  Good morning. I wanted to...  Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer  Hi, Steve.  Steven Forbes    --   Guggenheim Securities -- Analyst  Hey... I wanted to focus on the customer segmentation   initiatives, right. I think you said in the prepared remarks that   the core maker as you defined it represents one-third of industry   sales. But can you discuss where your penetration rate is today   with that customer base and maybe expand on what those customers,   right are telling you about the current value proposition   inclusive of the rewards program?  Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer  Hey Steve, it's one point of clarification. The segmentation   and the focus actually represents two-thirds of the arts and   crafts industry spent. So just for that, before I think, Mark   will go into a little bit more detail on the color on the   segmentation.  Mark Cosby    --   Interim Chief Executive Officer and Director  So we did an extensive survey touching 13,000 different   customers ranging from surveys to in-depth interviews and came   from that with the perspective that you heard on the call today,   that the focus on this core maker customer is our biggest   opportunity. And our opportunity comes around the ability to   leverage our expertise against this maker customer and   differentiate over time. So I kind of walk you through all the   different leverage points that we have with the customer, is   that, as Denise just said, that customers in our stores today, a   lot, and we also believe that we have an opportunity to gain more   share from them over time. And there are customers that are in   that segmentation that are not in our stores as often as we'd   like, and we believe we have an opportunity to gain more share   from that perspective as well, leveraging all the tools that I   mentioned on the call.  Steven Forbes    --   Guggenheim Securities -- Analyst  Yeah. I think that was the point -- that I was trying to ask,   if you think about your sort of active members today or your   active customers, how many would fall into that bucket and what   percentage of sales would they represent?  Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer  So, Steve, I think we talked historically when we're using the   old definition of kind of the core versus the enthusiast -- the   enthusiast customer versus the novice customer. At the time, we   talked about that enthusiast customer, you're being the larger   base of spend in terms of who shopped and in our business today   versus our casual customer. Much of that enthusiast customer   remains what we would now consider the core maker customer.  Operator  The next question will come from Christopher Horvers of JP   Morgan.  Christopher Horvers    --   JP Morgan -- Analyst  Thanks. Good morning, everybody. So a couple of questions. The   focus on the novice really started in '13, and one of the key   parts of that was the expansion of seasonal and then everyday   value program. So that expansion this season was one reason why   you tend to do better in the fourth quarter versus other parts of   the year, such as 2Q. So in terms of thinking about, the   long-term comp potential business, what do you think the market   growth rate is for that core maker customer, Michaels has   averaged a 1% comp for the past 19 years. And then the second   related question is, how do you expect to navigate the fourth   quarter? I know that you mentioned that, the makers engaged in   seasonal as well, but you are implying a comp acceleration. So   are you shifting marketing the 4Q? Are you expanding the   assortment around seasonal? How do you make sure that novice   customer is not only engaged, but growing as well?  Mark Cosby    --   Interim Chief Executive Officer and Director  I can speak to the overall perspective and then Denise can add   anything she wants to and color around the numeric side. But as I   mentioned in the comment, that the -- the research that we've   done on the core maker indicates that they're very interested in   seasonal product. So we don't really see a change. We set up this   FMA program several years ago that continues to be very   successful for us in terms of how we position our seasonal   product, that will continue to be a big focus in everything that   we do. You mentioned mix of advertising, we have shifted some of   our marketing support into the fourth quarter, just to continue   to support the seasonal product, but also because we think that   the spending in the fourth quarter will be more productive than   what we had it in the front half of the year. So I wouldn't infer   big changes, when we talk about the focus on this core customer   versus this novice customer, I wouldn't expect big category   shifts. It's more about taking the existing categories and fine   tuning them, so that we have the right product within the   category as opposed to thinking about big shifts in terms of how   we have sorted the store, category wise.  Christopher Horvers    --   JP Morgan -- Analyst  Okay.  Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer  And the only thing I'd add -- the only thing that I would add   is, when you think about the things that we've been working on   early in the year, they will ramp and produce more benefit for us   in the third and the fourth quarter. So Mark commented on our CRM   progress and what we hope to be doing by the end of the year,   which should be a good contributor. We'll also have full quarter   benefit of the assortment resets that we did and tools and   technology and fine arts and in craft storage. When you combine   that with a healthy seasonal business, it supports what we've   effectively said for the second half of the year is a flat to   plus one comp.  Christopher Horvers    --   JP Morgan -- Analyst  Got it. Then in terms of the guidance, it seems like at least   relative to the street, the fourth quarter is coming down and   then at the same time you actually expanded operating income in   2Q for the first time, since 4Q '17. So -- but you're implying   operating income I think down for the third quarter and fourth   quarter. So just trying to understand -- what was unique 2Q,   where you could expand operating income and not do so in the back   half and what was the shift in -- is there any shift in terms of   how you're thinking about the fourth quarter?  Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer  No. I think, if I step back one, we really think about the   second half as an entire period of time that we're managing. I   think it's important to note that just simply because of this   shift of this high volume week with our Christmas Tree sales that   happened, moving that into the third quarter last year, it stays   in the third quarter this year. So we, in terms of the top line   performance, always expected, I think a bit more robust 3Q   performance and a little wider 4Q performance simply because of   the loss of the shopping days between Thanksgiving and Christmas.   So that was always our in-going perspective. In general, when you   think about what happened on the operating income side, on the   operating income side, in the third quarter, we delivered   slightly positive gross margin, that starts to show the impact of   all the goodness of our sourcing and pricing work that we're   doing. We also got a little extra benefit from posting a better   comp and having less occupancy deleverage that would happen in   the quarter. But we did see negatives from sales mix, and of   course, tariff. When you think about the third and fourth   quarters of the year, we expect that, that sales mix impact will   continue. We also expect that tariff impact will continue, along   with all the positives that I mentioned as well. So there's   nothing out-sized that shifts between the second quarter and the   back half of the year, in terms of our view of margins. And it's   just puts and takes on the margin for the items within that, but   still expect $40 million in sourcing goodness from the year from   all the work that we do every year around our sourcing program   and still expect goodness from our CRM initiatives and what we're   able to -- be able to do with discount management.  Operator  The next question will come from Simeon Gutman of Morgan   Stanley.  Simeon Gutman    --   Morgan Stanley -- Analyst  Thanks. Good morning. I don't know, if I missed this, but can   you tell us in Q2, how much, some of the clearance and   promotions? I guess, I think it was clearance specifically drove   the second quarter comp. And then related to it, if we assume   that the business should comp positively over time, let's just   say one-ish or 1% to 2%. Can you give us a sense of what we could   expect from the gross margin line? You mentioned goodness from   pricing and sourcing realized there's a return to high low, but   what's the level of gross margin? Is it flat? Is it up slightly   that we could expect, if the business does generate that   consistent comp growth?  Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer  Yeah. So, on the first topic. The clearance event that we ran   in the second quarter contributed about 15 basis points to comp.   So while it was a big marketing event for us that got a lot of   folks into the store. The actual impact of that in terms of   clearance sales was very small. It was much more of a marketing   handle that really had a reason for people to shop, when that's a   very common theme from other retailers of getting people into the   store. More broadly speaking on the question of gross margin, we   talked about for the full year, we expect it to be slightly down   versus GAAP gross margin last year. For all of those reasons that   I described on the call kind of playing out on the ups and downs   regarding that. We expect it to be generally flattish in the   third quarter. We were posted slightly positive in the second   quarter. So that's how we're kind of netting out right now. Too   early to tell with 2020, I think we've got a lot of great plans   in place to continue our sourcing benefit, continue our discount   management work and all of those will kind to bring to bear to   continue to drive the gross margin number.  Simeon Gutman    --   Morgan Stanley -- Analyst  And then my follow up, it's not related to 2020, it would be   more the next 12 months to 18 months to 24 months. You talked a   lot about, or Mark talked a lot about initiatives to reposition   the business. Does the business have enough cost to take out that   can be self-funded, or do you have to go through -- excuse me, an   investment phase, in order to make these investments happen?  Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer  Overall, we don't see the need for any out-sized incremental   investment to go after what we're talking about. We've said on   the capital side, we expect to be 2% to 3% of sales. We've   generally been in the middle of that range. We still expect to be   within the range of 2% to 3%. And then on the expense side, we're   really looking at the places where we de-prioritize some other   things we've been doing in the business to fund the work that we   want to do to drive the initiative. So nothing out-sized that we   can see on the near-term horizon.  Mark Cosby    --   Interim Chief Executive Officer and Director  It's really more a matter of prioritization and deep   prioritizing things that maybe have less of an impact. So the   three that we talked about, community, the store experience,   these maker centered categories. All of them will be tested.   We'll learn from them what kind of sales driving power they have   and have any investments that we do into those things be   warranted based on the returns that they deliver. And if we have   to spend money against them, or hopefully we do spend money   against them, that means we're taking money largely from other   places and also believing that they will return in a solid way   for us.  Operator  The next question will come from Seth Sigman of Credit   Suisse.  Seth Sigman    --   Credit Suisse -- Analyst  Hey, guys. Good morning. Thanks for taking the question. If   you step back and look at what's weighed on comps over the last   couple of years, I think it's been mostly transactions growth.   Can you help us better understand, if that's actual traffic, if   there's a traffic issue, or is it more about conversion and under   serving that customer that's coming in. And as you look at the   progress here, obviously comps improve this quarter through a lot   of the changes that you're making. Where are you seeing that   improvement? Is that better conversion, better traffic? And if   you could also help us understand, if that improvement is coming   through store comps or online or both, that would be helpful as   well. Thank you.  Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer  Yeah. So I'll start off with that [Phonetic] and Mark can jump   in with some additional color. So we are not able today to   account traffic in our stores, we can only count transactions.   And we're hoping to be able to do more on the traffic side as we   implement electronic article surveillance in our stores next   year, but at this point, it's really transaction. From everything   that we know, we have an opportunity in conversion, in the store,   in those transactions. So every customer that comes in from the   survey data we have from the customer doesn't mean they leave   with a purchase. And so we do see that as an opportunity. When   you think about the improvement from the first quarter to the   second quarter in the business, most of that improvement was   driven by an improvement in transactions kind of on a sequential   basis. So back to some of the things we changed in the first   quarter and ramped into the second quarter, we were able to be   converting more of those sales with the customer in the store.   And so I think that, that's a big benefit. Both stores and   e-commerce are contributors to our performance. And so we think   about them a bit omni-channel, simply because so much of our   e-commerce sales are actually focused sales that come through the   store. And -- but over time, when you think about where the   opportunity is, the opportunity continues to be including   conversion and transactions in the store.  Seth Sigman    --   Credit Suisse -- Analyst  Okay...  Mark Cosby    --   Interim Chief Executive Officer and Director  Just a little color on that. I mean, as I described on the   call, we are rolling out a significant selling program actually   rolled out this past week to all of our stores. And one of the   big components within that will be the ability to measure   conversion and sent our team to deliver against conversion based   on this new scorecard that's put in place. Historically, we   haven't differentiated that number. We haven't been able to   measure that number, but we're putting tools in place that will   enable us to do that this year and then we're putting even better   tools in place next year that will enable us to measure that. But   importantly, we're putting a program behind really driving   conversion within our stores by teaching our associates and   incenting them, motivating them to convert itself within our   stores.  Seth Sigman    --   Credit Suisse -- Analyst  Okay. Thank you for that. Just two clarifications on the   model. So SG&A, can you guys size up the marketing and   performance based comp that shifted out of this quarter and what   goes into the back half of the year? And then just for the full   year guidance to clarify on tariffs, I just want to make sure I   have this right. There's no incremental impact embedded from List   4. Is that the right way to think about it?  Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer  Yeah. So in reverse order, anything that's tied to tariffs is   embedded in our forecast. So whether that is List 3 or List 4,   all the 2019 is in the forecast as we would know it today. On   your question about the timing shifts for performance based comp   and for marketing, as Mark indicated a bit earlier, we did plan   for this year to shift more marketing dollars into the fourth   quarter and take those out of the second quarter. So you're going   to see those come back in the fourth quarter where we think we   really do have an opportunity, particularly with the shorter   selling cycle between Thanksgiving and Christmas to leverage   those marketing dollars. The performance based comp shift will   hit both Q3 and Q4. I would comment that in both of these cases,   these are not out-sized numbers. You can think about both of   these being a couple of million dollars, not bigger shifts than   that.  Operator  The next question will come from Laura Champine of Loop   Capital.  Laura Champine    --   Loop Capital -- Analyst  Thanks for taking my question. It's really a follow on. So I   believe last quarter that your guide included a $0.05 hit from   tariffs, rescue me if I'm wrong there. Has that increased and if   so, by how much and then I totally understand that most of the   impacts of List 4 would impact 2020. Could you tell us, just give   us a perspective sense of how much of an impact that could have   given all you know about your mitigation efforts as well as your   sourcing cost increases of $400 million to $500 million, which   you laid out earlier in this call?  Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer  Yeah. So first, the 2019 guide, just to reiterate, we've not   changed the impact of tariffs in our guidance from the last call   to this call. So our impact from the List 3, we believe is   consistent with what we had before. And just because of the   timing and our inventory terms, while List 4 is new, since the   last call, it will not impact us with any materiality and in   2019. When you look to 2020, you look to what's going on with the   List 4 tariffs. I mentioned it was $400 million to $500 million   of potential PO cost exposure from what we buy from China, that   would be on List 4. When we think about and I will lead in by   saying -- we don't have an exact estimate of the puts and takes   of what we'll be able to do for mitigation versus the cost of   those duties coming through. But I think the key message I want   folks to takeaway is the list of options we have and what we're   aggressively working to do to mitigate those costs coming   through. So I mentioned it in a bit of my script, but kind of   happy to walk through them again. So annually we've been able to   be generating sourcing savings in our business, so upwards of $40   million. We do have an anticipation that will continue into 2020   as well, so one key starting block in things that we can do to   mitigate. Off of our List 3 tariffs, which we originally said we   had about $400 million of exposure. We have already been able to   shift about $75 million of that PO cost outside of China, and   it's really early in the process of working through that. It   takes factories time to ramp up. It takes time to actually work   through the sourcing process. So we're quite pleased with being   able to have made that shift. And then you look at all the other levers, the core cost   savings work that we're doing that really allowed us, that while   we were lowering comps a bit in the back half of the year to hold   our operating income this year. Something we want to continue on   as we look to the new year. The broader set of sourcing   alternatives where we can leverage our negotiation power, manage   against currency fluctuations as well and then reengineer product   are all additional levers beyond just moving product out of China   today. And then while we do this with a very cautious approach,   implementing price increases where we believe they make sense and   where given that we have a low average ticket would have a   minimal impact to the customer out there in play for us as well.   So a really long list of things that we can do to go up against   the headwind that the tariff could provide. Assuming that tariff   stays in effect as we continue through the months of the year   here.  Laura Champine    --   Loop Capital -- Analyst  Got it. Thank you.  Operator  And our last question today will come from Elizabeth Suzuki of   Bank of America.  Elizabeth Suzuki    --   Bank of America Merrill Lynch -- Analyst  Great. Thank you for squeezing me in. I was just hoping if you   could quantify the positives and negatives to gross margin in the   quarter? I know sourcing initiatives were positive, occupancy   cost on the higher comp was positive and then that was kind of   offset by tariffs and mix and promotional activity. Could you   quantify each of those buckets?  Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer  Yeah. So we don't typically quantify the details of the puts   and takes. And what I would just tell you is, is the things that   were on the positive, as you already mentioned was the sourcing   benefit, pricing benefit, some benefit from occupancy leverage.   Offsetting that would be the flow through of some duties coming   through sales mix and then a bit more of a promotional impact,   which had a little impact from our clearance event, but also had   some impact as we moved away from EDV coming out of the first   quarter. They were all kind of material impact, hence why we call   them out. But I think important note to me is that the net out to   pretty much a flat gross margin, slightly positive gross margin   versus last year.  Elizabeth Suzuki    --   Bank of America Merrill Lynch -- Analyst  Okay. And then you talked about how one of the options you   have for mitigating tariffs is to increase some of your pricing   on those low ticket items. Have you tested out the elasticity of   demand for some of those products that you're importing just to   determine, if there is any pushback from the consumer when you   raised price there?  Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer  Yeah. We take pricing on some items every year. So history   tells us a bit about where there's more or less elasticity and we   certainly take that into account when we think about the pricing   opportunity we have. To date on any pricing increases we've taken   this year, there's been no surprises about that elasticity. We're   really focused on managing to a more positive gross margin dollar   outcome against the opportunity that we have when we take the   price and we've generally seen the results that we expected to   see. Clearly low ticket private brand items provide us with a bit   more opportunity than more visibly priced higher ticket   items.  Mark Cosby    --   Interim Chief Executive Officer and Director  The good thing is we put in more science around our ability to   measure the impact of our pricing changes. We build the team to   enable us to do that. And I think also importantly we've enhanced   our ability to monitor our competitive pricing scenarios, so that   we know where we stand from a price perspective versus our   competition better than we would have a few months back. So we   are in a position to be able to make smart choices around   pricing.  Operator  This concludes our question-and answer-session. I would like   to turn the conference back over to Mark Crosby, Interim Chief   Executive Officer for any closing remarks.  Mark Cosby    --   Interim Chief Executive Officer and Director  Well, thank you for joining us this morning. We are pleased   with our trend improvement in Q2, and we believe that we have the   right priorities in place to continue the improvement in the back   half of this year. We are also confident that our focus on the   customer via our new maker strategy will set us up to deliver   growth in 2020 and beyond. Thank you again.  Operator  [Operator Closing Remarks]  Duration: 60 minutes  Call participants:  Elaine Locke    --   Vice President, Investor Relations and Treasurer   Mark Cosby    --   Interim Chief Executive Officer and Director   Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer   Steven Forbes    --   Guggenheim Securities -- Analyst   Christopher Horvers    --   JP Morgan -- Analyst   Simeon Gutman    --   Morgan Stanley -- Analyst   Seth Sigman    --   Credit Suisse -- Analyst   Laura Champine    --   Loop Capital -- Analyst   Elizabeth Suzuki    --   Bank of America Merrill Lynch -- Analyst   More MIK analysis   All earnings call transcripts        10 stocks we like better than The Michaels   Companies     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and The Michaels   Companies wasn't one of them! That's right --   they think these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     recommends The Michaels Companies. The Motley Fool has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " The Michaels Companies Inc    (NASDAQ: MIK)        Q2 2019 Earnings Call       Sep 4, 2019 ,   9:00 a.m. ET ",
    " Operator ",
    "Good morning. My name is Carey, and I will be your conference   operator today. At this time, we'd like to welcome everyone to   The Michaels Companies [Phonetic] Second Quarter Earnings   Conference call. [Operator Instructions] Thank you.",
    "And now I'd like to turn the call over to your host, Elaine   Locke, Vice president of Investor Relations and Treasurer. Ms.   Locke, you may begin the conference.",
    " Elaine Locke    --   Vice President, Investor Relations and Treasurer ",
    "Thank you, Carey. Good morning, and thank you for joining us   today. Earlier this morning, we released our financial results   for the second quarter of fiscal 2019. A copy of the press   release and a few related slides are available in the Investor   Relations section of our website at www.michaels.com.",
    "Before we begin our discussion, let me remind you that today's   press release and the presentations made by our executives on   this call may constitute forward-looking statements and are made   pursuant to and within the meaning of the safe harbor provisions   of the Private Securities Litigation Reform Act of 1995 as   amended. While these statements address plans or events, which we   expect will or may occur in the future, a number of factors, as   set forth in our SEC filings and press releases, could cause   actual results to differ materially from our expectations. We   refer you to and specifically incorporate the cautionary and risk   statements contained in today's press release and in our SEC   filings. You are cautioned not to place undue reliance on these   forward-looking statements, which speak only as of today,   September 4th, 2019. We have no obligation to update or revise   our forward-looking statements, except as required by law, and   you should not expect us to do so.",
    "On today's call, we will reference non-GAAP financial   measures, including adjusted operating income, adjusted net   income and adjusted diluted earnings per share, all adjusted for   restructuring charges, primarily related to the Aaron Brothers   and Pat Catan store closures, severance charges related to the   departure of our former CEO, a write-off of an investment in a   liquidated business, losses on early extinguishment of debt and   refinancing costs, interest paid on our 2020 senior subordinated   notes during a period between the issuance of our 2027 senior   notes and the redemption of our 2020 senior subordinated notes   and tax adjustments related to the 2017 Tax Act as applicable. A   reconciliation of these measures to the corresponding GAAP   measures are detailed in today's earnings release. We'll begin   this morning with prepared remarks from Mark Cosby, Interim CEO;   and Denise Paulonis, CFO. Following our prepared remarks, we will   open the call for questions.",
    "Now I'd like to introduce Mark Cosby for some initial   comments. Mark?",
    " Mark Cosby    --   Interim Chief Executive Officer and Director ",
    "Thank you, Elaine, and good morning, everyone. This morning we   reported results for the second quarter that were above the   guidance range we provided on our last       earnings call    . Comp store sales were positive 0.3%, adjusted operating income   was $75 million and adjusted diluted earnings per share was   $0.19. In the last call, I said our number one goal is to improve   our sales performance and we are pleased to see movement in that   direction. In this call, I will talk about the actions we   implemented to drive improvement in the second quarter and then   provide a look at our new long-term strategy. You will see that   the priorities for 2019 that are embedded in our strategy has   started to have an impact on our results and will play a bigger   role in our expected second half performance.",
    "Let's start with the review of our Q2 results and progress.   The foundation for all of the actions we took to improve our   second quarter results is based on our shift to become much more   customer centric. We listened to our customer and implemented an   action plan to improve our results. The actions included   promotion calendar process improvements, value perception   enhancements, the expansion of our growth category initiative and   enhancing our e-comm growth capabilities. The enhancement in our   promotion planning process focused on ensuring that our weekly   promotions across all media work together to deliver our sales   plans. We put comprehensive plans together for every week,   particularly focused on our big events. An example was a very   successful June lowest price of the season event, which featured   a cohesive plan, including addressable TV, email, digital,   social, store presentations and store signage.",
    "Another example was our first semi-annual clearance event in   early July, that included a comprehensive media program and a   powerful store presentation that was a big success with our   customers. As mentioned on the last call, we identified an   opportunity to improve our value perception based on our customer   research. We took a number of steps to address this value   perception issue. We eliminated the EDV program in all US stores   and we reduced the number of products excluded from coupons to   make it easier and less frustrating for customers. We also   launched a new tool to help us manage the distribution of digital   coupons, while maximizing the benefits of serialization and   limiting coupon abuse. And we adjusted our drive aisle and endcap   presentations to present a stronger value impression. These   actions led to a reduction in customer complaints, improved our   value perception rating and contributed to our improved sales   trend. We've recognized that we have more work to do on the value   perception front. We are heading in the right direction.",
    "Our first major project reset of the year came in April with   tools and technology. In response to growing customer interest,   we added 25-feet to this high growth category. This effectively   doubled the space to support an expansion of widely recognized   brands like Cricut, Caesar and Oracle. With the additional space,   we can display more machine samples and we created a power wall   of vinyl accessories. These changes allowed us to expand our   leadership in this important DIY category, and we now offer the   largest assortment of Cricut product of any retail store. This   category help to drive sales and the roll-out help to create some   excitement in the arts and crafts community. We have booked a   strong partnership with the team at Cricut that included our   exclusive launch of the Infusible Ink product. The Cricut CEO   also hosted many events at our stores that drew big crowds and   created many large social media events.",
    "The last big contributor to our sales improvement in Q2 was   the success of our e-comm business. We have continued to focus on   building our e-comm capabilities to drive sales, while   implementing initiatives to improve our profitability. The shift   earlier this year to bring our performance in-house has helped us   improve our fulfillment costs, lower our shipping costs and   leverage our fixed cost base. In a rising Buy Online Pick-up In   Store, or BOPIS penetration has also been a big win for our   e-comm profitability. We believe that the actions we took to   improve our results in Q2, will continue to help us as we move   into the second half of the year.",
    "Now looking forward to the balance of 2019 and the future, I'm   pleased to provide some insight into our updated long-term growth   strategy. Late in Q4, the Board and our leadership team launched   a comprehensive effort to define our growth strategy for 2020 and   beyond. We engaged external partners combined with internal   resources to help us identify and prioritize customer segments   and customer solutions to drive long-term growth. In June, the   Group, the Board approved our growth strategy and we are now   using it as a road map for planning future growth.",
    "As mentioned in the last call, we have defined our target   customer as the core maker. This is someone that is interested in   DIY, crafting, creating fine arts, or is just injecting more   creativity into their life. This target customer definition was   the result of significant customer research looking at attitudes,   behaviors and needs of our customers. We divided them into   different customer segments identifying key characteristics and   spend, then we conduct another set of research to learn how the   core makers shop with traditional quantitative surveys, immersive   interviews with individual customers and focus groups. This   research has led us to believe that we can better focus on this   core maker and increase our overall market share. These core   makers represent two-thirds of our arts and crafts spend and   importantly indicate a strong desire to spend more on DIY   projects. Historically, we have seen stronger growth over time   with these enthusiast customers than we have seen with our novice   customers. We believe that focusing on these maker segments will   drive growth.",
    "Our new purpose is we're here for the makers. This purpose   will guide our path to growth and help us ensure that we have our   customers in mind along with financial results when we make   decisions. We have defined three big building blocks that will   drive our maker strategy; build the business better, leverage   digital and data, and reposition the business. We have   initiatives in place with project teams to drive these building   blocks. The initiatives in support of building the business   better and leveraging digital and data are many of the 2019   priorities that we discussed on our last call. We think of these   initiatives as quick hits that we started well in advance of the   finalization of our strategic planning process and will deliver   results in the second half of this year.",
    "There are four big initiatives under the build the business   better building block; build the stores' selling culture, create   a customer-centric assortment, optimized pricing and promotions   and maximize marketing productivity. I will provide you with a   brief summary of each of these initiatives starting with build a   solid [Phonetic] culture. This initiative is designed to shift   the store culture from task-minded activities to a focus on the   customer and selling. The stores will have scorecards with   metrics to reinforce priorities that show how they rank compared   to other stores creating some friendly competition. They will   define action plans to improve their scorecard results based on   the best practices of our top performing stores and there will be   consistent coaching and recognition programs in place to motivate   and inspire progress. This comprehensive program was rolled out   to every store leader by the end of August and we are expecting   the program to improve our customer conversion in our basket size   in advance of the holiday season.",
    "We have also launched our customer-centric assortment   initiative with the goal of adding space to core maker categories   with high growth potential. We launched the program in three   phases, starting with the previously discussed technology launch   in May, and the expansion of craft storage and fine art in July   and August. The technology expansion continues to perform well   and should be a sales driver for us in Q3 as well. In July, we   increased the selling space in craft storage to accommodate and   expanded assortment with a more prominent display for the   customer, including a craft card wall. The response has been very   positive and our customers are sharing online how they use these   new cards to create solutions for their storage needs. When we   marketed the new cards, we leaned into the teachers with   back-to-school ideas for keeping the classroom organized. In   August, we completed the reset of art supplies, expanding our   assortment of drawing and painting categories by adding over   20-feet to display, including 1,000 new items in drawing and   paint, expanding several name brands such as Tombow, Sharpie and   Micron.",
    "The third build the business better initiative is to optimize   our pricing and promotions. This initiative supports improving   both our customer value perception and our profitability. This   pricing optimization work will also support the price element of   our tariff mitigation effort. In addition to the steps we have   already taken to streamline and enhance our coupon strategy, we   are taking a fresh look at our mix of promotions, coupons and   regular priced to determine how we can simplify the customer   experience. We are creating new tools to help us evaluate the   effectiveness of a discounting campaign and make sure we are   getting the return on investment. A good example is a category   assessment that informed us that we would improve our sales and   margin by moving from buy one get one free promotion to a buy one   get one 50% offer. Our goal is to take action on larger scale as   the year progresses to improve our value perception, eliminate   unproductive discounting and improve sales.",
    "The final initiative under build the business better is to   maximize our marketing productivity. This initiative is focused   on optimizing our existing marketing spend to more effectively   reach our core maker customer and to drive higher sales. We   implemented a new tool that we will use to assess the   productivity of all of our marketing vehicles and enable us to   shift our spending to the highest productivity options. This will   mean shifting funds from less productive mass media options such   as newspaper to more productive options such as digital and   addressable TV. We are also working to optimize within each type   of marketing spend, such as improving the productivity of our   digital spending options and improving the efficiency of our   organic search results.",
    "The second building block of our maker strategy is to leverage   digital and data. This building block is comprised of two   initiatives; enhanced CRM and profitable e-comm growth. The   enhanced CRM initiative is focused on increasing our customer   engagement through personalization of all customer messaging. The   goal is to create category and inspiration-focused content,   supporting more personalized and relevant communication across   channels beginning with email, followed by web and digital   marketing.",
    "We have an extensive collection of customer data, including 75   million customer records, 31 million active email addresses and   38 million customers in our rewards program. Today, we can link   more than 82% of our sales to a specific customer. We have   continued to test proprietary models built to help us predict   customer purchases based on interactions with our michaels.com,   the Michaels app, email and in-store purchase behavior. We   started leveraging this data in May to personalize emails to   customers based on their spending history. Our earlier results   have been very encouraging with open and click rates almost three   times the rate of our typical mass email.",
    "Today, around 1% of our emails are personalized and our goal   is to move toward personalizing 15% of our emails by the end of   this year and much higher as we move into 2020. We will then move   toward personalizing all of our customer messaging channels,   including the website and digital messaging. The benefit will be   improving the engagement with our customers and driving higher   sales results. As an extension of the CRM initiative, we will be   enhancing our rewards program in 2020 to create a more meaningful   loyalty program. We will test components of this loyalty program   later this year, so we are ready to launch the new program by the   middle of next year.",
    "The second leverage digital and data initiative is to create   more profitable e-commerce growth. The goal is to maintain a   rapid sales growth momentum, while enhancing the profitability of   our omni-channel options. We have a number of initiatives in   place to continue our growth momentum, including optimizing our   digital spending, enhancing our website capabilities and   personalizing the website for our customers. Today, our site is   the same for every customer that visits. Later this year, the   site will be customized to each site visitor based on their   spending history.",
    "We also continue to see strong customer enthusiasm for Buy   Online Pick-up In Store, or BOPIS. From a cost perspective, BOPIS   is very attractive way to fulfill an e-commerce order as it does   not include shipping costs. In Q2, BOPIS accounted for 44% of   online sales and nearly two-thirds of online orders. We continue   to use technology to build facilitate BOPIS orders and this   quarter we rolled out near real-time inventory tracking to   improve BOPIS fulfillment percentages.",
    "In addition to our focus on driving omni-channel sales, we are   also focused on improving the profitability of this important   growth channel. We have initiatives in place to improve the gross   margin, fulfillment and shipping costs for all the ways that we   distribute products to our customers. We believe expanding our   omni-channel presence is a critical piece of our long-term growth   opportunity. We are actively working on plans that will improve   our cost structure, while enhancing the customer experience to   drive longer term profitable growth.",
    "The third and final building blocks of our maker strategy is   to reposition the business. This building block is focused on   initiatives that will not help us in 2019, but will set us up for   growth in 2020 and beyond. This building block today is comprised   of three initiatives that are in development; a Michael's   community, a maker-centered store experience and maker-centered   categories. Let's take a quick look at these three growth   initiatives.",
    "Our extensive research over the last few months has shown us   how important community is to our maker customers. These   customers want to share and learn with our maker customers. We   saw this come to life with the roll-out of our tools and   technology product we said in early May, when our customers were   sharing in social media, attending events and coming to our   stores to take classes. We are focusing on ways to build a   community with our customers in-stores and online. This will   include work to take our existing successful community classroom   to the next level and work to create an online community for   maker customers.",
    "We have also started work to create a maker-centered store   experience. This initiative will include the development of a   store designed specifically to meet the needs of our maker   customer. The store design will feature an easier shopping   experience, a curated assortment and enhanced service experience,   full omni-channel capabilities, and it will bring the community   experience to life. We will build this new concept in a lab   environment this year and then open up new stores next year. The   goal will be to learn from these stores and expand the best   practices in a low cost way across the system.",
    "The third component of repositioning the business is our   maker-centered category initiative. This initiative is focused on   innovating our assortment and presentation targeting our maker   customers. The work will lead to the development of the   assortment for our new maker-centered store. The work will also   form the basis for a new category management process that will   leverage customer feedback to optimize our key product categories   for our maker customer across all of our stores. This focus on   the maker will translate into making shifts in some core   assortments. Categories such as art, tools and technology and   jewelry will become more important to us.",
    "We will also modify categories to meet the needs of our   makers, an example can be found in jewelry. When we were focused   on bringing the novice into the store, we carried more finished   jewelry and fashion watches in the assortment. With the DIY   jewelry maker in mind, we will now be more focused on giving her   the best assortment of jewelry pieces, so she can assemble what   she wants. We will not be abandoning categories just making sure   the mix within the category is right. Seasonal products come to   mind as a question, but this category is very important to the   core maker, if they like to decorate for events. This   maker-centered category initiative will be a big component of our   future growth plans.",
    "In closing, we are laser-focused on driving sales and   improving profitability. We are pleased with the actions we have   implemented have led to improve results in Q2. Our 2019   priorities comprised of our build the business better and our   leverage digital and data initiatives are showing positive   results and should set us up for continued improvement in the   second half of this year. We also believe that our we're here for   the maker purpose and strong focus on the customer will position   Michaels for stronger growth in 2020 and beyond.",
    "Now I'd like to turn the call over to Denise. Denise?",
    " Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer ",
    "Thank you, Mark. As Mark said at the beginning of his   comments, we're pleased with our Q2 results. We returned to   positive comparable store sales, posting a 0.3% comp, grew   adjusted operating income 5.8% versus last year and grew adjusted   EPS 26.7% versus last year. Second quarter net sales were $1.03   billion compared to $1.05 billion last year. The decrease in net   sales for the quarter was primarily due to the closure of our Pat   Catan stores in the fourth quarter of fiscal 2018, and was   partially offset by our 0.3% increase in comparable store sales   and sales from the operation of 11 net new Michael stores during   the quarter. In Q2, the company opened four new Michaels stores,   closed two Michaels stores and relocated one of Michaels store.   The 0.3% increase in comparable store sales was driven by an   increase in average ticket, partially offset by decrease in   customer transactions.",
    "Sales from michaels.com were strong again this quarter, driven   by increased traffic and higher conversion rate with 44% of   e-commerce sales and 62% of e-commerce orders fulfilled through   our Buy Online Pick-up In Store or BOPIS initiative. From a   category perspective, tools and technology, craft storage and our   supplies were our strongest categories this quarter, while   traditional paper crafting supplies and kids crafts were more   challenged. Gross profit dollars for the quarter were $367   million, compared to $373 million last year. As a percentage of   sales, our gross profit rate for the quarter was 35.5% versus   35.4% last year, an increase of about 10 basis points. While the   increase in gross margin was small, there were several factors   that mostly offset each other, including benefits from our   ongoing pricing and sourcing initiative and improved occupancy   cost leverage. The increase from these factors was offset by the   impact of tariffs on inventory repurchase from China and increase   in promotional activity and a change in sales mix. Of note, the   elimination of our EDV program and return to a high low strategy   for certain items in our store, as well as our first ever   semi-annual clearance event contributed to the increase in   promotional activity.",
    "Total store rent expense for the quarter was $98 million   versus $101 million last year. The decrease in store rent expense   was due to the Pat Catan's store closures, partially offset by   the impact of a net 11 additional Michaels stores. For the   quarter, SG&A expense, including store pre-opening costs and   restructure charges was $296 million, or 28.6% of sales compared   with $299 million, or 28.4% of sales last year. The decrease in   SG&A expense was primarily due to a $6 million decrease in   expenses related to the closure of the Pat Catan's stores, a   timing shift in our performance-based compensation and a timing   shift of marketing expenses till later in the year.",
    "Additionally, in the second quarter of 2019, we reported a   restructure charge of $3.9 million related to the closure of all   of our Pat Catan's stores during the fourth quarter of fiscal   2018. As a reminder, in the second quarter of fiscal 2018, we   recorded a $3.2 million gain related to the settlement of lease   obligations associated with the closure of substantially all of   our Aaron Brothers stores during the first quarter of fiscal   2018.",
    "GAAP operating income was $71 million, compared to $74 million   in the second quarter of fiscal 2018. Excluding the restructure   charges, adjusted operating income for Q2 of fiscal 2019 was $75   million, compared to adjusted operating income of $71 million in   the prior year, an increase of 5.8%.",
    "For the quarter, interest expense was $40 million, about $3   million higher than the second quarter last year. This increase   was primarily due to higher LIBOR rates associated with our   variable rate term loan. The higher interest rate on our 2027   Senior Notes, doubled interest when both the 2027 Senior Notes   and 2020 Senior Subordinated Notes were outstanding for 21 days.   The increase was partially offset with lower settlement payments   associated with our interest rate swaps.",
    "In July 2019, we redeemed our $510 million Senior Subordinated   Notes due in 2020 with cash on hand and proceeds from the   issuance of $500 million in senior unsecured notes that mature in   2027 and bear an interest rate of 8%. Also, I'm pleased to   announce that we've also just completed an amend and extend on   our asset-backed revolver to move the maturity from May 2021 to   August of 2024. Our nearest-term maturity is now in 2023 for our   term loan.",
    "The effective tax rate was 18.9%, compared to 24% in the   second quarter of last year. The effective tax rate in Q2 of this   year includes a tax benefit associated with a state income tax   settlement, partially offset by the vesting of restricted shares   and the expiration of certain vested stock options. On a GAAP   basis, net income was $25 million, or $0.16 per diluted share   compared to $27 million, or $0.15 per diluted share in the second   quarter of fiscal 2018. Excluding the restructure charge   associate with the closing of the Pat Catan stores and the   refinancing costs of our debt, including double interest while   both our old senior subordinated notes and the new senior notes   were outstanding for 21 days, adjusted net income was $30   million, or $0.19 per diluted share compared to $26 million, or   $0.15 per diluted share in Q2 of fiscal 2018, an increase of   26.7%.",
    "During the quarter, we purchased 3 million shares in the open   market for $25 million as part of our previously announced share   repurchase program. As of today, our total authorization   remaining for future repurchases is approximately $373 million.   As a reminder, our share repurchase program does not have an   expiration date, and the timing and number of repurchase   transactions under the program will depend on market conditions,   corporate consideration, debt agreement and regulatory   requirements.",
    "In light of the current trading price of our common stock and   our available capital resources and requirements, we currently   view additional share repurchases as an attractive use of cash.   We intend to continue to monitor our repurchase program and   execute share repurchases opportunistically subject to   considerations referenced above. Any such repurchases would   without additional activity with respect to our stock, increase   the ownership percentages of our remaining shareholders,   including our sponsors Bain Capital and Blackstone. As a result,   future repurchases may result in the sponsors holding in the   aggregate more than 50% of our outstanding common stock.",
    "Total merchandise inventory at the end of the quarter   decreased 1.8% to $1.26 billion compared to $1.28 billion last   year. The decrease in inventory was primarily due to the Pat   Catan's store closures, partially offset by additional inventory   associated with the operation of 11 net additional Michaels   stores. Average inventory per Michaels store, including inventory   for e-commerce, inventory and distribution centers and inventory   in-transit was 2.5% higher than the end of Q2 last year,   inclusive an approximate 170 basis point drag from duties   associated with List 3 tariffs as well as increased inventory   in-transit this year as we pulled some items forward for   delivering to avoid incremental tariffs.",
    "We ended Q2 with more than $800 million in liquidity,   including $131 million in cash on our balance sheet and $686   million available under our revolver. Total debt at the end of   the quarter was $2.7 billion. Our total debt to adjusted EBITDA   on a trailing 12-month basis was 3.3 times and our trailing   12-month interest coverage was 4.1 times. Capital expenditures   for the quarter were $32 million, reflecting investments in   technology projects, including investments to support e-commerce   and our digital platforms and investments in new and relocated   stores. For the full year, we continue to expect to invest   approximately $135 million in capital expenditures.",
    "With that as context, let me walk you through our guidance for   the third quarter and the full year. As a reminder, our guidance   excludes the impact of any remaining restructure costs associated   with the closing of our Pat Catan's stores and the additional   costs associated with the departure of our former CEO, the   one-time right off of our Darby Smart investment and any one-time   costs associated with debt refinancing. For fiscal 2019, we now   expect total sales will be between $5.16 billion and $5.19   billion. This reflects our expectation that full year comp sales   will be approximately flat and our plans to relocate 13 Michaels   stores and open 16 net new Michaels stores inclusive of up to 12   Pat Catan's stores, we are rebranding as Michaels stores.",
    "While we're pleased with our comp sales performance in the   second quarter, we are cautious regarding the consumer   environment in the second half of the year and the potential   negative impact of six fewer shopping days between Thanksgiving   and Christmas. Additionally, the timing of the openings for three   new stores has shifted out of 2019 and into 2020 and we added one   more store closure for 2019. Adjusted operating income for the   year is expected to be between $625 million and $645 million.   This guidance now reflects the impact of lower estimated sales in   the second half of the year, mostly offset by our second quarter   performance and incremental cost savings that we have identified   since the first quarter of the year.",
    "Let me take a moment to comment more broadly on List 4   tariffs. Clearly, the situation remains fluid and if List 4 China   tariffs are fully implemented, we estimate the applicable direct   import product costs subject to these duties are between $400   million and $500 million. Given the pace we turn our inventory,   any material impact from the List 4 tariffs would not be   recognized until 2020.",
    "We're continuing to aggressively work our tariff mitigation   plan. Our focus on broad based cost controls, our annual sourcing   savings efforts that has generated approximately $40 million of   benefit in 2019, early success shifting sourcing out of China,   currency moves, progress with vendor negotiations and price   increases taken so far bode well for mitigate -- ability to   mitigate List 4 tariffs. With all this work under way, it is too   early to quantify exactly what portion we would expect to   mitigate in 2020.",
    "We expect gross margin to be slightly down versus GAAP gross   margin in 2018. As discussed on the last call, we do expect to   see continued benefits from our ongoing pricing and sourcing   initiatives and better management of promotions offset by   pressure from transportation headwinds, tariffs, the deleverage   of occupancy costs given our comp guidance and continued strong   e-commerce growth.",
    "We continue expect to leverage SG&A expense versus GAAP   SG&A expense in 2018, driven primarily by the favorable   impact of anniversarying the restructure charges in 2018, $16   million of investment spending in 2018, and incremental cost   savings identified over the last quarter, partially offset by   modest pressure from higher IT expense reflecting our investments   and a move to more hosting arrangements. We expect interest   expense will be approximately $153 million, reflecting the   expectation of no additional rate increases this year.",
    "Our earnings outlook assumes an effective tax rate of between   23% and 24% for the full year. These assumptions translate to an   adjusted diluted EPS range of $2.31 to $2.42 for fiscal 2019, on   approximately 156 million diluted weighted average shares for the   full year. Our fiscal 2019 capital expenditure plan is to invest   approximately $135 million to support longer term growth,   including technology investments, new stores and relocations.",
    "Turning to Q3, we expect comp store sales will be flat to up   1%. We plan to open 13 new stores, close one store and relocate   five stores in the quarter. The 13 new stores are two Michaels   stores and 11 Pat Catan locations that will be rebranded as   Michaels stores. 11 of these have already opened and the last one   will open at the very end of the quarter for a total of 12 Pat   Catan stores converting to the Michaels brand. For comparison   purposes in the third quarter last year, we opened five net new   stores and relocated four stores.",
    "Of note, for comparison and to your stack purposes, our comp   in the third quarter of 2018 was positively impacted by 270 bps   by the shift of a high volume week, the week of our Christmas   Tree event into the third quarter through the 53rd week in 2017.   That high volume week, the last week of the quarter remains in   the third quarter in 2019. We expect adjusted operating income   for the third quarter will be between $133 million and $142   million. This guidance includes expectation that gross margin   rate and SG&A rate will be flattish versus GAAP rates in Q3   2018. Our Q3 guidance for adjusted diluted earnings per share is   $0.46 to $0.51, assuming a diluted weighted average share count   of $155 million.",
    "In closing, we made significant progress on our sales and   profit performance in Q2, as our customer responded positively to   the changes we made coming into the quarter, including value   enhancement and the expansion of key categories. While we're   early in the journey, we are excited and optimistic about the   potential of our 2019 initiative and our longer term strategic   priorities to continue to drive profitable growth.",
    "Now I'd like to open the call to take your questions.   Operator?",
    " Operator ",
    "We will now begin the question-and-answer session. [Operator   Instructions] The first question will come from Steve Forbes with   Guggenheim Securities.",
    " Steven Forbes    --   Guggenheim Securities -- Analyst ",
    "Good morning. I wanted to...",
    " Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer ",
    "Hi, Steve.",
    " Steven Forbes    --   Guggenheim Securities -- Analyst ",
    "Hey... I wanted to focus on the customer segmentation   initiatives, right. I think you said in the prepared remarks that   the core maker as you defined it represents one-third of industry   sales. But can you discuss where your penetration rate is today   with that customer base and maybe expand on what those customers,   right are telling you about the current value proposition   inclusive of the rewards program?",
    " Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer ",
    "Hey Steve, it's one point of clarification. The segmentation   and the focus actually represents two-thirds of the arts and   crafts industry spent. So just for that, before I think, Mark   will go into a little bit more detail on the color on the   segmentation.",
    " Mark Cosby    --   Interim Chief Executive Officer and Director ",
    "So we did an extensive survey touching 13,000 different   customers ranging from surveys to in-depth interviews and came   from that with the perspective that you heard on the call today,   that the focus on this core maker customer is our biggest   opportunity. And our opportunity comes around the ability to   leverage our expertise against this maker customer and   differentiate over time. So I kind of walk you through all the   different leverage points that we have with the customer, is   that, as Denise just said, that customers in our stores today, a   lot, and we also believe that we have an opportunity to gain more   share from them over time. And there are customers that are in   that segmentation that are not in our stores as often as we'd   like, and we believe we have an opportunity to gain more share   from that perspective as well, leveraging all the tools that I   mentioned on the call.",
    " Steven Forbes    --   Guggenheim Securities -- Analyst ",
    "Yeah. I think that was the point -- that I was trying to ask,   if you think about your sort of active members today or your   active customers, how many would fall into that bucket and what   percentage of sales would they represent?",
    " Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer ",
    "So, Steve, I think we talked historically when we're using the   old definition of kind of the core versus the enthusiast -- the   enthusiast customer versus the novice customer. At the time, we   talked about that enthusiast customer, you're being the larger   base of spend in terms of who shopped and in our business today   versus our casual customer. Much of that enthusiast customer   remains what we would now consider the core maker customer.",
    " Operator ",
    "The next question will come from Christopher Horvers of JP   Morgan.",
    " Christopher Horvers    --   JP Morgan -- Analyst ",
    "Thanks. Good morning, everybody. So a couple of questions. The   focus on the novice really started in '13, and one of the key   parts of that was the expansion of seasonal and then everyday   value program. So that expansion this season was one reason why   you tend to do better in the fourth quarter versus other parts of   the year, such as 2Q. So in terms of thinking about, the   long-term comp potential business, what do you think the market   growth rate is for that core maker customer, Michaels has   averaged a 1% comp for the past 19 years. And then the second   related question is, how do you expect to navigate the fourth   quarter? I know that you mentioned that, the makers engaged in   seasonal as well, but you are implying a comp acceleration. So   are you shifting marketing the 4Q? Are you expanding the   assortment around seasonal? How do you make sure that novice   customer is not only engaged, but growing as well?",
    " Mark Cosby    --   Interim Chief Executive Officer and Director ",
    "I can speak to the overall perspective and then Denise can add   anything she wants to and color around the numeric side. But as I   mentioned in the comment, that the -- the research that we've   done on the core maker indicates that they're very interested in   seasonal product. So we don't really see a change. We set up this   FMA program several years ago that continues to be very   successful for us in terms of how we position our seasonal   product, that will continue to be a big focus in everything that   we do. You mentioned mix of advertising, we have shifted some of   our marketing support into the fourth quarter, just to continue   to support the seasonal product, but also because we think that   the spending in the fourth quarter will be more productive than   what we had it in the front half of the year. So I wouldn't infer   big changes, when we talk about the focus on this core customer   versus this novice customer, I wouldn't expect big category   shifts. It's more about taking the existing categories and fine   tuning them, so that we have the right product within the   category as opposed to thinking about big shifts in terms of how   we have sorted the store, category wise.",
    " Christopher Horvers    --   JP Morgan -- Analyst ",
    "Okay.",
    " Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer ",
    "And the only thing I'd add -- the only thing that I would add   is, when you think about the things that we've been working on   early in the year, they will ramp and produce more benefit for us   in the third and the fourth quarter. So Mark commented on our CRM   progress and what we hope to be doing by the end of the year,   which should be a good contributor. We'll also have full quarter   benefit of the assortment resets that we did and tools and   technology and fine arts and in craft storage. When you combine   that with a healthy seasonal business, it supports what we've   effectively said for the second half of the year is a flat to   plus one comp.",
    " Christopher Horvers    --   JP Morgan -- Analyst ",
    "Got it. Then in terms of the guidance, it seems like at least   relative to the street, the fourth quarter is coming down and   then at the same time you actually expanded operating income in   2Q for the first time, since 4Q '17. So -- but you're implying   operating income I think down for the third quarter and fourth   quarter. So just trying to understand -- what was unique 2Q,   where you could expand operating income and not do so in the back   half and what was the shift in -- is there any shift in terms of   how you're thinking about the fourth quarter?",
    " Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer ",
    "No. I think, if I step back one, we really think about the   second half as an entire period of time that we're managing. I   think it's important to note that just simply because of this   shift of this high volume week with our Christmas Tree sales that   happened, moving that into the third quarter last year, it stays   in the third quarter this year. So we, in terms of the top line   performance, always expected, I think a bit more robust 3Q   performance and a little wider 4Q performance simply because of   the loss of the shopping days between Thanksgiving and Christmas.   So that was always our in-going perspective. In general, when you   think about what happened on the operating income side, on the   operating income side, in the third quarter, we delivered   slightly positive gross margin, that starts to show the impact of   all the goodness of our sourcing and pricing work that we're   doing. We also got a little extra benefit from posting a better   comp and having less occupancy deleverage that would happen in   the quarter. But we did see negatives from sales mix, and of   course, tariff. When you think about the third and fourth   quarters of the year, we expect that, that sales mix impact will   continue. We also expect that tariff impact will continue, along   with all the positives that I mentioned as well. So there's   nothing out-sized that shifts between the second quarter and the   back half of the year, in terms of our view of margins. And it's   just puts and takes on the margin for the items within that, but   still expect $40 million in sourcing goodness from the year from   all the work that we do every year around our sourcing program   and still expect goodness from our CRM initiatives and what we're   able to -- be able to do with discount management.",
    " Operator ",
    "The next question will come from Simeon Gutman of Morgan   Stanley.",
    " Simeon Gutman    --   Morgan Stanley -- Analyst ",
    "Thanks. Good morning. I don't know, if I missed this, but can   you tell us in Q2, how much, some of the clearance and   promotions? I guess, I think it was clearance specifically drove   the second quarter comp. And then related to it, if we assume   that the business should comp positively over time, let's just   say one-ish or 1% to 2%. Can you give us a sense of what we could   expect from the gross margin line? You mentioned goodness from   pricing and sourcing realized there's a return to high low, but   what's the level of gross margin? Is it flat? Is it up slightly   that we could expect, if the business does generate that   consistent comp growth?",
    " Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer ",
    "Yeah. So, on the first topic. The clearance event that we ran   in the second quarter contributed about 15 basis points to comp.   So while it was a big marketing event for us that got a lot of   folks into the store. The actual impact of that in terms of   clearance sales was very small. It was much more of a marketing   handle that really had a reason for people to shop, when that's a   very common theme from other retailers of getting people into the   store. More broadly speaking on the question of gross margin, we   talked about for the full year, we expect it to be slightly down   versus GAAP gross margin last year. For all of those reasons that   I described on the call kind of playing out on the ups and downs   regarding that. We expect it to be generally flattish in the   third quarter. We were posted slightly positive in the second   quarter. So that's how we're kind of netting out right now. Too   early to tell with 2020, I think we've got a lot of great plans   in place to continue our sourcing benefit, continue our discount   management work and all of those will kind to bring to bear to   continue to drive the gross margin number.",
    " Simeon Gutman    --   Morgan Stanley -- Analyst ",
    "And then my follow up, it's not related to 2020, it would be   more the next 12 months to 18 months to 24 months. You talked a   lot about, or Mark talked a lot about initiatives to reposition   the business. Does the business have enough cost to take out that   can be self-funded, or do you have to go through -- excuse me, an   investment phase, in order to make these investments happen?",
    " Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer ",
    "Overall, we don't see the need for any out-sized incremental   investment to go after what we're talking about. We've said on   the capital side, we expect to be 2% to 3% of sales. We've   generally been in the middle of that range. We still expect to be   within the range of 2% to 3%. And then on the expense side, we're   really looking at the places where we de-prioritize some other   things we've been doing in the business to fund the work that we   want to do to drive the initiative. So nothing out-sized that we   can see on the near-term horizon.",
    " Mark Cosby    --   Interim Chief Executive Officer and Director ",
    "It's really more a matter of prioritization and deep   prioritizing things that maybe have less of an impact. So the   three that we talked about, community, the store experience,   these maker centered categories. All of them will be tested.   We'll learn from them what kind of sales driving power they have   and have any investments that we do into those things be   warranted based on the returns that they deliver. And if we have   to spend money against them, or hopefully we do spend money   against them, that means we're taking money largely from other   places and also believing that they will return in a solid way   for us.",
    " Operator ",
    "The next question will come from Seth Sigman of Credit   Suisse.",
    " Seth Sigman    --   Credit Suisse -- Analyst ",
    "Hey, guys. Good morning. Thanks for taking the question. If   you step back and look at what's weighed on comps over the last   couple of years, I think it's been mostly transactions growth.   Can you help us better understand, if that's actual traffic, if   there's a traffic issue, or is it more about conversion and under   serving that customer that's coming in. And as you look at the   progress here, obviously comps improve this quarter through a lot   of the changes that you're making. Where are you seeing that   improvement? Is that better conversion, better traffic? And if   you could also help us understand, if that improvement is coming   through store comps or online or both, that would be helpful as   well. Thank you.",
    " Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer ",
    "Yeah. So I'll start off with that [Phonetic] and Mark can jump   in with some additional color. So we are not able today to   account traffic in our stores, we can only count transactions.   And we're hoping to be able to do more on the traffic side as we   implement electronic article surveillance in our stores next   year, but at this point, it's really transaction. From everything   that we know, we have an opportunity in conversion, in the store,   in those transactions. So every customer that comes in from the   survey data we have from the customer doesn't mean they leave   with a purchase. And so we do see that as an opportunity. When   you think about the improvement from the first quarter to the   second quarter in the business, most of that improvement was   driven by an improvement in transactions kind of on a sequential   basis. So back to some of the things we changed in the first   quarter and ramped into the second quarter, we were able to be   converting more of those sales with the customer in the store.   And so I think that, that's a big benefit. Both stores and   e-commerce are contributors to our performance. And so we think   about them a bit omni-channel, simply because so much of our   e-commerce sales are actually focused sales that come through the   store. And -- but over time, when you think about where the   opportunity is, the opportunity continues to be including   conversion and transactions in the store.",
    " Seth Sigman    --   Credit Suisse -- Analyst ",
    "Okay...",
    " Mark Cosby    --   Interim Chief Executive Officer and Director ",
    "Just a little color on that. I mean, as I described on the   call, we are rolling out a significant selling program actually   rolled out this past week to all of our stores. And one of the   big components within that will be the ability to measure   conversion and sent our team to deliver against conversion based   on this new scorecard that's put in place. Historically, we   haven't differentiated that number. We haven't been able to   measure that number, but we're putting tools in place that will   enable us to do that this year and then we're putting even better   tools in place next year that will enable us to measure that. But   importantly, we're putting a program behind really driving   conversion within our stores by teaching our associates and   incenting them, motivating them to convert itself within our   stores.",
    " Seth Sigman    --   Credit Suisse -- Analyst ",
    "Okay. Thank you for that. Just two clarifications on the   model. So SG&A, can you guys size up the marketing and   performance based comp that shifted out of this quarter and what   goes into the back half of the year? And then just for the full   year guidance to clarify on tariffs, I just want to make sure I   have this right. There's no incremental impact embedded from List   4. Is that the right way to think about it?",
    " Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer ",
    "Yeah. So in reverse order, anything that's tied to tariffs is   embedded in our forecast. So whether that is List 3 or List 4,   all the 2019 is in the forecast as we would know it today. On   your question about the timing shifts for performance based comp   and for marketing, as Mark indicated a bit earlier, we did plan   for this year to shift more marketing dollars into the fourth   quarter and take those out of the second quarter. So you're going   to see those come back in the fourth quarter where we think we   really do have an opportunity, particularly with the shorter   selling cycle between Thanksgiving and Christmas to leverage   those marketing dollars. The performance based comp shift will   hit both Q3 and Q4. I would comment that in both of these cases,   these are not out-sized numbers. You can think about both of   these being a couple of million dollars, not bigger shifts than   that.",
    " Operator ",
    "The next question will come from Laura Champine of Loop   Capital.",
    " Laura Champine    --   Loop Capital -- Analyst ",
    "Thanks for taking my question. It's really a follow on. So I   believe last quarter that your guide included a $0.05 hit from   tariffs, rescue me if I'm wrong there. Has that increased and if   so, by how much and then I totally understand that most of the   impacts of List 4 would impact 2020. Could you tell us, just give   us a perspective sense of how much of an impact that could have   given all you know about your mitigation efforts as well as your   sourcing cost increases of $400 million to $500 million, which   you laid out earlier in this call?",
    " Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer ",
    "Yeah. So first, the 2019 guide, just to reiterate, we've not   changed the impact of tariffs in our guidance from the last call   to this call. So our impact from the List 3, we believe is   consistent with what we had before. And just because of the   timing and our inventory terms, while List 4 is new, since the   last call, it will not impact us with any materiality and in   2019. When you look to 2020, you look to what's going on with the   List 4 tariffs. I mentioned it was $400 million to $500 million   of potential PO cost exposure from what we buy from China, that   would be on List 4. When we think about and I will lead in by   saying -- we don't have an exact estimate of the puts and takes   of what we'll be able to do for mitigation versus the cost of   those duties coming through. But I think the key message I want   folks to takeaway is the list of options we have and what we're   aggressively working to do to mitigate those costs coming   through. So I mentioned it in a bit of my script, but kind of   happy to walk through them again. So annually we've been able to   be generating sourcing savings in our business, so upwards of $40   million. We do have an anticipation that will continue into 2020   as well, so one key starting block in things that we can do to   mitigate. Off of our List 3 tariffs, which we originally said we   had about $400 million of exposure. We have already been able to   shift about $75 million of that PO cost outside of China, and   it's really early in the process of working through that. It   takes factories time to ramp up. It takes time to actually work   through the sourcing process. So we're quite pleased with being   able to have made that shift.",
    "And then you look at all the other levers, the core cost   savings work that we're doing that really allowed us, that while   we were lowering comps a bit in the back half of the year to hold   our operating income this year. Something we want to continue on   as we look to the new year. The broader set of sourcing   alternatives where we can leverage our negotiation power, manage   against currency fluctuations as well and then reengineer product   are all additional levers beyond just moving product out of China   today. And then while we do this with a very cautious approach,   implementing price increases where we believe they make sense and   where given that we have a low average ticket would have a   minimal impact to the customer out there in play for us as well.   So a really long list of things that we can do to go up against   the headwind that the tariff could provide. Assuming that tariff   stays in effect as we continue through the months of the year   here.",
    " Laura Champine    --   Loop Capital -- Analyst ",
    "Got it. Thank you.",
    " Operator ",
    "And our last question today will come from Elizabeth Suzuki of   Bank of America.",
    " Elizabeth Suzuki    --   Bank of America Merrill Lynch -- Analyst ",
    "Great. Thank you for squeezing me in. I was just hoping if you   could quantify the positives and negatives to gross margin in the   quarter? I know sourcing initiatives were positive, occupancy   cost on the higher comp was positive and then that was kind of   offset by tariffs and mix and promotional activity. Could you   quantify each of those buckets?",
    " Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer ",
    "Yeah. So we don't typically quantify the details of the puts   and takes. And what I would just tell you is, is the things that   were on the positive, as you already mentioned was the sourcing   benefit, pricing benefit, some benefit from occupancy leverage.   Offsetting that would be the flow through of some duties coming   through sales mix and then a bit more of a promotional impact,   which had a little impact from our clearance event, but also had   some impact as we moved away from EDV coming out of the first   quarter. They were all kind of material impact, hence why we call   them out. But I think important note to me is that the net out to   pretty much a flat gross margin, slightly positive gross margin   versus last year.",
    " Elizabeth Suzuki    --   Bank of America Merrill Lynch -- Analyst ",
    "Okay. And then you talked about how one of the options you   have for mitigating tariffs is to increase some of your pricing   on those low ticket items. Have you tested out the elasticity of   demand for some of those products that you're importing just to   determine, if there is any pushback from the consumer when you   raised price there?",
    " Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer ",
    "Yeah. We take pricing on some items every year. So history   tells us a bit about where there's more or less elasticity and we   certainly take that into account when we think about the pricing   opportunity we have. To date on any pricing increases we've taken   this year, there's been no surprises about that elasticity. We're   really focused on managing to a more positive gross margin dollar   outcome against the opportunity that we have when we take the   price and we've generally seen the results that we expected to   see. Clearly low ticket private brand items provide us with a bit   more opportunity than more visibly priced higher ticket   items.",
    " Mark Cosby    --   Interim Chief Executive Officer and Director ",
    "The good thing is we put in more science around our ability to   measure the impact of our pricing changes. We build the team to   enable us to do that. And I think also importantly we've enhanced   our ability to monitor our competitive pricing scenarios, so that   we know where we stand from a price perspective versus our   competition better than we would have a few months back. So we   are in a position to be able to make smart choices around   pricing.",
    " Operator ",
    "This concludes our question-and answer-session. I would like   to turn the conference back over to Mark Crosby, Interim Chief   Executive Officer for any closing remarks.",
    " Mark Cosby    --   Interim Chief Executive Officer and Director ",
    "Well, thank you for joining us this morning. We are pleased   with our trend improvement in Q2, and we believe that we have the   right priorities in place to continue the improvement in the back   half of this year. We are also confident that our focus on the   customer via our new maker strategy will set us up to deliver   growth in 2020 and beyond. Thank you again.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 60 minutes ",
    " Elaine Locke    --   Vice President, Investor Relations and Treasurer ",
    " Mark Cosby    --   Interim Chief Executive Officer and Director ",
    " Denise A. Paulonis    --   Executive Vice President and Chief Financial Officer ",
    " Steven Forbes    --   Guggenheim Securities -- Analyst ",
    " Christopher Horvers    --   JP Morgan -- Analyst ",
    " Simeon Gutman    --   Morgan Stanley -- Analyst ",
    " Seth Sigman    --   Credit Suisse -- Analyst ",
    " Laura Champine    --   Loop Capital -- Analyst ",
    " Elizabeth Suzuki    --   Bank of America Merrill Lynch -- Analyst ",
    " More MIK analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than The Michaels   Companies     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and The Michaels   Companies wasn't one of them! That's right --   they think these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     recommends The Michaels Companies. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:23:25"
}