{
  "url": "https://www.nasdaq.com/article/forexpound-at-weekhigh-dollar-sinks-as-riskon-mood-cautiously-holds-20190904-01217",
  "title": "FOREX-Pound at week-high, dollar sinks as risk-on mood cautiously holds - Nasdaq.com",
  "text": [
    "    * Pound holds gains as no-deal Brexit fears ebb",
    "* Dollar, yen sold as risk-on mood returns",
    "* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh",
    "SINGAPORE, Sept 5 (Reuters) - The British pound hoveredaround a one-week high on Thursday as another parliamentarydefeat for Prime Minister Boris Johnson made investorsoptimistic that a no-deal Brexit could be avoided, while abroader risk-on mood held back the dollar.",
    "The dollar fell against most major currencies, though gainedon the safe-haven yen, as the UK parliamentary vote, positiveeconomic data in the United States and China and hopes for ade-escalation in Hong Kong's political crisis lured investors toriskier assets. ",
    "The pound GBP=D3 was at $1.2242, after its best dayagainst the dollar in more than five months, and the euro EUR=EBS also climbed 0.6% to $1.1033. Against a basket ofcurrencies .DXY the dollar hit a one-week low of 98.390.",
    "The British parliament voted on Wednesday to prevent Johnsonfrom taking Britain out of the European Union without a deal onOct. 31, but rejected his first bid to call a snap election twoweeks before the scheduled exit. urn:newsml:reuters.com:*:nL5N25V2FD",
    "\"While there is no 'all clear' on market concerns, investorsentiment pulled back from extremes,\" said Michael McCarthy,chief market strategist at brokerage CMC Markets in Sydney.",
    "\"Currency markets illustrated the shift...the U.S. dollarplayed a passive role as markets wait for the next trade tweetsto drop.\"",
    "The Canadian dollar CAD= spiked sharply to C$1.3344 perdollar after the Bank of Canada left interest rates on hold andsounded less dovish than the market had expected.",
    "The more upbeat mood cautiously held in morning trade inAsia, though few expected it to last long.",
    "Brexit is still up in the air, with possible outcomesranging from a no-deal exit from the EU to abandoning the wholeendeavour.",
    " \"It's important to keep in mind that the situationcontinues to look pretty bad,\" J.P. Morgan analysts remindedinvestors in a market note, pointing out that Johnson is pushingfor a snap election and a so-called \"hard Brexit\" remains anoption.    ",
    "The weak global trade outlook is also still a key worry,with U.S. President Donald Trump warning on Tuesday he would be\"tougher\" on Beijing in a second term if talks dragged on.",
    "And it was not clear whether Hong Kong would return to calmafter leader Carrie Lam withdraw an extradition bill thattriggered months of often violent protests. urn:newsml:reuters.com:*:nL3N25V0NC",
    "That caution kept the yen's JPY=EBS losses reasonablymuted, though it did drift a little further lower to 106.42per-dollar, its cheapest since Friday.",
    "The yuan CNH= held on to Wednesday's gains at around7.1487 per dollar in offshore trade.",
    "China will implement both broad and targeted cuts in thereserve requirement ratio (RRR) for banks \"in a timely manner,\"China's cabinet said in a meeting on Wednesday, an indicationthat a cut in the key ratio aimed at boosting lending could beimminent. urn:newsml:reuters.com:*:nL3N25V2UC",
    "\"A drop in geopolitical risk premium comes as a welcomerelief,\" said Stephen Innes, Asia Pacific market strategist atAxiTrader.",
    "\"But with the omnipresent trade war clouds looming ominouslyover the market threatening to come thundering down at any time,the air remains thick with caution.\" (Reporting by Tom Westbrook; Editing by Kim Coghill) ((tom.westbrook@tr.com; +61466355340;))"
  ],
  "published_datetime": "2019-09-04 09:16:00"
}