{
  "url": "https://www.nasdaq.com/article/merck-mrk-outpaces-stock-market-gains-what-you-should-know-cm1210802",
  "title": "Merck (MRK) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " In the latest trading session, Merck (MRK) closed at $82.92, marking a +1.51% move from the previous day. The stock outpaced the S&P 500's daily gain of 0.72%. Elsewhere, the Dow gained 0.85%, while the tech-heavy Nasdaq added 1.06%. Heading into today, shares of the pharmaceutical company had lost 5.1% over the past month, lagging the Medical sector's loss of 1.41% and the S&P 500's gain of 2.25% in that time. Wall Street will be looking for positivity from MRK as it approaches its nex t earnings  report date. On that day, MRK is projected to report earnings of $1.26 per share, which would represent year-over-year growth of 5.88%. Meanwhile, our latest consensus estimate is calling for revenue of $11.73 billion, up 8.64% from the prior-year quarter. For the full year, our Zacks Consensus Estimates are projecting earnings of $4.89 per share and revenue of $46.09 billion, which would represent changes of +12.67% and +8.97%, respectively, from the prior year. It is also important to note the recent changes to analyst estimates for MRK. These revisions help to show the ever-changing nature of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system. Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. The Zacks Consensus EPS estimate has moved 0.11% higher within the past month. MRK is currently sporting a Zacks Rank of #2 (Buy). Digging into valuation, MRK currently has a Forward P/E ratio of 16.71. This represents a premium compared to its industry's average Forward P/E of 13.8. Also, we should mention that MRK has a PEG ratio of 1.67. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Large Cap Pharmaceuticals was holding an average PEG ratio of 2 at yesterday's closing price. The Large Cap Pharmaceuticals industry is part of the Medical sector. This industry currently has a Zacks Industry Rank of 43, which puts it in the top 17% of all 250+ industries. The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Be sure to follow all of these stock-moving metrics, and many more, on Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Merck & Co., Inc. (MRK): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "In the latest trading session, Merck (MRK) closed at $82.92, marking a +1.51% move from the previous day. The stock outpaced the S&P 500's daily gain of 0.72%. Elsewhere, the Dow gained 0.85%, while the tech-heavy Nasdaq added 1.06%.",
    "Heading into today, shares of the pharmaceutical company had lost 5.1% over the past month, lagging the Medical sector's loss of 1.41% and the S&P 500's gain of 2.25% in that time.",
    "Wall Street will be looking for positivity from MRK as it approaches its nex t earnings  report date. On that day, MRK is projected to report earnings of $1.26 per share, which would represent year-over-year growth of 5.88%. Meanwhile, our latest consensus estimate is calling for revenue of $11.73 billion, up 8.64% from the prior-year quarter.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of $4.89 per share and revenue of $46.09 billion, which would represent changes of +12.67% and +8.97%, respectively, from the prior year.",
    "It is also important to note the recent changes to analyst estimates for MRK. These revisions help to show the ever-changing nature of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.",
    "Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. The Zacks Consensus EPS estimate has moved 0.11% higher within the past month. MRK is currently sporting a Zacks Rank of #2 (Buy).",
    "Digging into valuation, MRK currently has a Forward P/E ratio of 16.71. This represents a premium compared to its industry's average Forward P/E of 13.8.",
    "Also, we should mention that MRK has a PEG ratio of 1.67. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Large Cap Pharmaceuticals was holding an average PEG ratio of 2 at yesterday's closing price.",
    "The Large Cap Pharmaceuticals industry is part of the Medical sector. This industry currently has a Zacks Industry Rank of 43, which puts it in the top 17% of all 250+ industries.",
    "The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Be sure to follow all of these stock-moving metrics, and many more, on Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:45:20"
}