{
  "url": "https://www.nasdaq.com/article/are-investors-undervaluing-dish-network-dish-right-now-cm1210352",
  "title": "Are Investors Undervaluing Dish Network (DISH) Right Now? - Nasdaq.com",
  "text": [
    " While the proven Zacks Rank places an emphasis on earnings estimates and estimate revisions to find strong stocks, we also know that investors tend to develop their own individual strategies. With this in mind, we are always looking at value, growth, and momentum trends to discover great companies. Of these, value investing is easily one of the most popular ways to find great stocks in any market environment. Value investors use a variety of methods, including tried-and-true valuation metrics, to find these stocks. On top of the Zacks Rank, investors can also look at our innovative Style Scores system to find stocks with specific traits. For example, value investors will want to focus on the \"Value\" category. Stocks with high Zacks Ranks and \"A\" grades for Value will be some of the highest-quality value stocks on the market today. One company value investors might notice is Dish Network (DISH). DISH is currently sporting a Zacks Rank of #2 (Buy), as well as a Value grade of A. The stock holds a P/E ratio of 18, while its industry has an average P/E of 18.64. DISH's Forward P/E has been as high as 21.68 and as low as 8.35, with a median of 14.29, all within the past year. Investors should also recognize that DISH has a P/B ratio of 1.83. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. This stock's P/B looks attractive against its industry's average P/B of 3.17. Within the past 52 weeks, DISH's P/B has been as high as 2.22 and as low as 1.36, with a median of 1.79. Value investors also frequently use the P/S ratio. This metric is found by dividing a stock's price with the company's revenue. This is a popular metric because sales are harder to manipulate on an income statement, so they are often considered a better performance indicator. DISH has a P/S ratio of 1.33. This compares to its industry's average P/S of 2.26. Finally, investors should note that DISH has a P/CF ratio of 9.24. This metric focuses on a firm's operating cash flow and is often used to find stocks that are undervalued based on the strength of their cash outlook. This stock's P/CF looks attractive against its industry's average P/CF of 9.99. Within the past 12 months, DISH's P/CF has been as high as 11.01 and as low as 3.76, with a median of 6.54. These figures are just a handful of the metrics value investors tend to look at, but they help show that Dish Network is likely being undervalued right now. Considering this, as well as the strength of its earnings outlook, DISH feels like a great value stock at the moment.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  DISH Network Corporation (DISH): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "While the proven Zacks Rank places an emphasis on earnings estimates and estimate revisions to find strong stocks, we also know that investors tend to develop their own individual strategies. With this in mind, we are always looking at value, growth, and momentum trends to discover great companies.",
    "Of these, value investing is easily one of the most popular ways to find great stocks in any market environment. Value investors use a variety of methods, including tried-and-true valuation metrics, to find these stocks.",
    "On top of the Zacks Rank, investors can also look at our innovative Style Scores system to find stocks with specific traits. For example, value investors will want to focus on the \"Value\" category. Stocks with high Zacks Ranks and \"A\" grades for Value will be some of the highest-quality value stocks on the market today.",
    "One company value investors might notice is Dish Network (DISH). DISH is currently sporting a Zacks Rank of #2 (Buy), as well as a Value grade of A. The stock holds a P/E ratio of 18, while its industry has an average P/E of 18.64. DISH's Forward P/E has been as high as 21.68 and as low as 8.35, with a median of 14.29, all within the past year.",
    "Investors should also recognize that DISH has a P/B ratio of 1.83. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. This stock's P/B looks attractive against its industry's average P/B of 3.17. Within the past 52 weeks, DISH's P/B has been as high as 2.22 and as low as 1.36, with a median of 1.79.",
    "Value investors also frequently use the P/S ratio. This metric is found by dividing a stock's price with the company's revenue. This is a popular metric because sales are harder to manipulate on an income statement, so they are often considered a better performance indicator. DISH has a P/S ratio of 1.33. This compares to its industry's average P/S of 2.26.",
    "Finally, investors should note that DISH has a P/CF ratio of 9.24. This metric focuses on a firm's operating cash flow and is often used to find stocks that are undervalued based on the strength of their cash outlook. This stock's P/CF looks attractive against its industry's average P/CF of 9.99. Within the past 12 months, DISH's P/CF has been as high as 11.01 and as low as 3.76, with a median of 6.54.",
    "These figures are just a handful of the metrics value investors tend to look at, but they help show that Dish Network is likely being undervalued right now. Considering this, as well as the strength of its earnings outlook, DISH feels like a great value stock at the moment.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:10:11"
}