{
  "url": "https://www.nasdaq.com/article/old-navy-is-worth-30-more-than-what-the-market-currently-values-gap-at-cm1206635",
  "title": "Old Navy Is Worth 30% More Than What The Market Currently Values Gap At - Nasdaq.com",
  "text": [
    "Earlier this year, Gap  ( GPS  ) announced its plan to split into two independent publicly traded companies - an independent Old Navy, and a yet-to-be christened new company (\"New Entity\") that would include a portfolio of niche brands in denim (Gap), upper middle-class fashion (Banana Republic), female athleisure (Athleta), and men's performance lifestyle (Hill City). Trefis answers the question:  How Much Could Old Navy Be Worth As A Separate   Company?   in an interactive dashboard by first detailing the reasons behind Gap's decision to split into two companies, and then estimating the value of Old Navy as a standalone company. You can also understand how Gap is likely to look after the Old Navy spin-off  in an older interactive dashboard. Additionally, you can find more Trefis Textiles, Apparel and Luxury Good Industry Data here.",
    " Why Is Gap Splitting Into Two Companies? ",
    " How has the Old Navy brand performed over recent   years? ",
    " Old Navy Is Responsible For A Majority of Gap's   Revenues ",
    " Old Navy's Comparable Sales Figure Has Also Seen Strong   Growth Over Recent Years ",
    " Comparable sales is a key metric that is used to determine   the performance of a company in the apparel industry. ",
    " Moreover, Old Navy Enjoys Higher Revenue Per Store   Compared To The Gap Brand ",
    " How has Old Navy's revenue trended over the recent   years? ",
    " Estimating Old Navy's value as a separate   company ",
    "Since the spin-off is expected to be completed by the end of FY2019, we have valued the company based on FY2020 forecasts",
    " How does our valuation of Old Navy compare with Gap's   current market cap and our estimate for Gap's Valuation? ",
    " Conclusion: Old Navy could be worth $7.8 billion as a   separate company ",
    "What's behind Trefis? See How it's Powering New Collaboration and What-Ifs",
    "For CFOs and Finance Teams   | Product, R&D, and Marketing Teams ",
    " All Trefis Data ",
    "Like our charts? Explore example interactive dashboards   and create your own.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:47:28"
}