{
  "url": "https://www.nasdaq.com/article/us-judge-approves-cvs-purchase-of-insurer-aetna-20190904-01109",
  "title": "U.S. judge approves CVS purchase of insurer Aetna - Nasdaq.com",
  "text": [
    "By Diane Bartz",
    "WASHINGTON, Sept 4 (Reuters) - A federal judge reviewing a Justice Department decision to allow U.S. pharmacy chain and benefits manager CVS Health Corp  to merge with health insurer Aetna said on Wednesday that the agreement was in fact legal under antitrust law.",
    "Judge Richard Leon of U.S. District Court for the District of Columbia had been examining a government plan announced in October to allow the merger on condition that Aetna sell its Medicare prescription drug plan business to WellCare Health Plans Inc . Both deals have already closed.",
    "\"If the Tunney Act is to mean anything,\" Leon wrote, \"it surely must mean that no court should rubberstamp a consent decree approving the merger of 'one of the largest companies in the United States' and 'the nation's third largest health-insurance company,' ... simply because the Government requests it!\"",
    "In December, Leon said he was \"less convinced\" than the government that the asset sale to WellCare would resolve antitrust concerns. Since then, Centene Corp  agreed to acquire WellCare for $15.27 billion.",
    "CVS said the judge's decision reinforced that CVS and Aetna have already merged.",
    "\"CVS Health and Aetna have been one company since November 2018, and today's action by the District Court makes that 100 percent clear. We remain focused on transforming the consumer health care experience in America,\" CVS spokesman T.J. Crawford said in an emailed statement.",
    "The Justice Department did not immediately respond to a request for comment.",
    "Critics of the CVS-Aetna deal included the American Medical Association and the AIDS Healthcare Foundation.",
    "Pending Leon's approval, CVS agreed to temporarily allow Aetna to independently make critical product, pricing and personnel decisions. ",
    "CVS has been in the process of converting itself into a health-care company, and said in June that it would offer expanded health services such as nutrition counseling and blood pressure screenings in 1,500 stores by the end of 2021. ",
    "Most consent agreements that the antitrust agencies strike with companies to resolve competitive concerns are approved by federal courts with little fuss under the 1974 Tunney Act, which requires courts to ensure the agreements are in the public interest.",
    "Companies generally do not wait for final court approval before closing their transactions."
  ],
  "published_datetime": "2019-09-04 16:50:00"
}