{
  "url": "https://www.nasdaq.com/article/noteworthy-tuesday-option-activity-hes-ual-amt-cm1206807",
  "title": "Noteworthy Tuesday Option Activity: HES, UAL, AMT - Nasdaq.com",
  "text": [
    "Among the underlying components of the S&P 500 index, we saw noteworthy  options trading  volume today in Hess Corp (Symbol: HES), where a total of 18,224 contracts have traded so far, representing approximately 1.8 million underlying shares. That amounts to about 66.3% of HES's average daily trading volume over the past month of 2.8 million shares. Especially high volume was seen for the $57.50 strike put option expiring October 18, 2019  , with 8,033 contracts trading so far today, representing approximately 803,300 underlying shares of HES. Below is a chart showing HES's trailing twelve month trading history, with the $57.50 strike highlighted in orange:       makeArticleAd();    United Airlines Holdings Inc (Symbol: UAL) saw options trading volume of 15,635 contracts, representing approximately 1.6 million underlying shares or approximately 64.7% of UAL's average daily trading volume over the past month, of 2.4 million shares. Especially high volume was seen for the $77.50 strike put option expiring March 20, 2020  , with 2,500 contracts trading so far today, representing approximately 250,000 underlying shares of UAL. Below is a chart showing UAL's trailing twelve month trading history, with the $77.50 strike highlighted in orange:       And American Tower Corp (Symbol: AMT) options are showing a volume of 7,810 contracts thus far today. That number of contracts represents approximately 781,000 underlying shares, working out to a sizeable 51% of AMT's average daily trading volume over the past month, of 1.5 million shares. Particularly high volume was seen for the $240 strike call option expiring October 18, 2019  , with 1,147 contracts trading so far today, representing approximately 114,700 underlying shares of AMT. Below is a chart showing AMT's trailing twelve month trading history, with the $240 strike highlighted in orange:         For the various different available expirations for HES options  , UAL options  , or AMT options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:43:16"
}