{
  "url": "https://www.nasdaq.com/article/haemonetics-hae-down-04-since-last-earnings-report-can-it-rebound-cm1208045",
  "title": "Haemonetics (HAE) Down 0.4% Since Last Earnings Report: Can It Rebound? - Nasdaq.com",
  "text": [
    " It has been about a month since the las t earnings  report for Haemonetics (HAE). Shares have lost about 0.4% in that time frame, underperforming the S&P 500. Will the recent negative trend continue leading up to its next earnings release, or is Haemonetics due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important catalysts.  Haemonetics (HAE) Beats on Q1 Earnings  Haemonetics Corporation delivered adjusted earnings per share (EPS) of 81 cents in the first quarter of fiscal 2020, reflecting a 37.3% year-over-year surge from 59 cents. The bottom line also surpassed the Zacks Consensus Estimate by 28.6%. On a reported basis, net loss came in at 17 cents per share, wider than the year-ago loss of 5 cents.  Total Revenues  Revenues rose 4% (up 8% on an organic basis) to $238.5 million from the first quarter of fiscal 2019. The top line remained marginally in line with the Zacks Consensus Estimate.  Revenues by Product Categories  At Plasma,revenues of $110.4 million (accounting for 46.3% of total revenues) increased 11.1%year over year (up 16.1% on an organic basis) in the reported quarter. Plasma revenue growth in North America was 17.4% including 13.9% growth in disposables. Revenues at BloodCenter (31.8%) declined 3.8% (2.3% on an organic basis) to $75.8 million. Hospital revenues (20%) were up 1.5% (8.3% on an organic basis) to $47.7 million. Under the Hospital section, organic revenue growth in the Hemostasis Management product line was 15.7% in the first quarter of fiscal 2020.  Margins  Adjusted gross margin was 51.2%, up 400 basis points (bps) year over year due to change in pricing structure, product mix and productivity. Adjusted operating income was $51.4 million in the quarter under discussion, up 26.3% from $40.7 million in the year-ago quarter. Meanwhile, adjusted operating margin expanded 360 bps year over year to 21.4%. The company continued to rollout the NexSys PCS device and NexLynk DMS donor management software.  Financial Position  Haemonetics exited the first quarter of fiscal 2020 with cash and cash equivalents of $190.2 million compared with $169.4 million at the end of fiscal 2019. Long-term debt at the end of the first quarter was $318.1 million, showing a reduction of 1.3% from $322.5 million at the end of fiscal 2019. The company generated operating cash flow of $2.6 million in the first quarter, compared with $23.1 million a year ago (down 88.7%). The company also reported free cash flow (before restructuring and turnaround costs) of $5.3 million during the period which was down 12.2% from $6 million a year-ago.  Fiscal 2020 Guidance  Haemonetics has updated its fiscal 2020 financial guidance. The company reiterated full-year organic revenue growth at the band of 6-8%. Coming to segmental revenues, on an organic basis, Plasma revenue view has been raised to a new range of 13-15% (from the earlier 11-13%). Hospital revenue growth projection is maintained at the band of 11-13%. Blood Center revenues are likely to decline 4-6% from the year-earlier number (earlier band was a decline of 6-8%). The Zacks Consensus Estimate for fiscal 2020 revenues is pegged at $1.01 billion. The company forecasts 2020 adjusted EPS in the range of $2.95-$3.15 (up from the previously issued guidance of $2.80-$3). The consensus estimate of $2.93 is below the guided range.   How Have Estimates Been Moving Since Then?  In the past month, investors have witnessed an upward trend in estimates revision.  VGM Scores  At this time, Haemonetics has an average Growth Score of C, however its Momentum Score is doing a lot better with an A. However, the stock was allocated a grade of D on the value side, putting it in the bottom 40% for this investment strategy. Overall, the stock has an aggregate VGM Score of C. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending upward for the stock, and the magnitude of these revisions looks promising. It comes with little surprise Haemonetics has a Zacks Rank #2 (Buy). We expect an above average return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Haemonetics Corporation (HAE): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "It has been about a month since the las t earnings  report for Haemonetics (HAE). Shares have lost about 0.4% in that time frame, underperforming the S&P 500.",
    "Will the recent negative trend continue leading up to its next earnings release, or is Haemonetics due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important catalysts.  Haemonetics (HAE) Beats on Q1 Earnings  Haemonetics Corporation delivered adjusted earnings per share (EPS) of 81 cents in the first quarter of fiscal 2020, reflecting a 37.3% year-over-year surge from 59 cents. The bottom line also surpassed the Zacks Consensus Estimate by 28.6%. On a reported basis, net loss came in at 17 cents per share, wider than the year-ago loss of 5 cents.  Total Revenues  Revenues rose 4% (up 8% on an organic basis) to $238.5 million from the first quarter of fiscal 2019. The top line remained marginally in line with the Zacks Consensus Estimate.  Revenues by Product Categories  At Plasma,revenues of $110.4 million (accounting for 46.3% of total revenues) increased 11.1%year over year (up 16.1% on an organic basis) in the reported quarter. Plasma revenue growth in North America was 17.4% including 13.9% growth in disposables. Revenues at BloodCenter (31.8%) declined 3.8% (2.3% on an organic basis) to $75.8 million. Hospital revenues (20%) were up 1.5% (8.3% on an organic basis) to $47.7 million. Under the Hospital section, organic revenue growth in the Hemostasis Management product line was 15.7% in the first quarter of fiscal 2020.  Margins  Adjusted gross margin was 51.2%, up 400 basis points (bps) year over year due to change in pricing structure, product mix and productivity. Adjusted operating income was $51.4 million in the quarter under discussion, up 26.3% from $40.7 million in the year-ago quarter. Meanwhile, adjusted operating margin expanded 360 bps year over year to 21.4%. The company continued to rollout the NexSys PCS device and NexLynk DMS donor management software.  Financial Position  Haemonetics exited the first quarter of fiscal 2020 with cash and cash equivalents of $190.2 million compared with $169.4 million at the end of fiscal 2019. Long-term debt at the end of the first quarter was $318.1 million, showing a reduction of 1.3% from $322.5 million at the end of fiscal 2019. The company generated operating cash flow of $2.6 million in the first quarter, compared with $23.1 million a year ago (down 88.7%). The company also reported free cash flow (before restructuring and turnaround costs) of $5.3 million during the period which was down 12.2% from $6 million a year-ago.  Fiscal 2020 Guidance  Haemonetics has updated its fiscal 2020 financial guidance. The company reiterated full-year organic revenue growth at the band of 6-8%. Coming to segmental revenues, on an organic basis, Plasma revenue view has been raised to a new range of 13-15% (from the earlier 11-13%). Hospital revenue growth projection is maintained at the band of 11-13%. Blood Center revenues are likely to decline 4-6% from the year-earlier number (earlier band was a decline of 6-8%). The Zacks Consensus Estimate for fiscal 2020 revenues is pegged at $1.01 billion. The company forecasts 2020 adjusted EPS in the range of $2.95-$3.15 (up from the previously issued guidance of $2.80-$3). The consensus estimate of $2.93 is below the guided range. ",
    " Haemonetics (HAE) Beats on Q1 Earnings ",
    "Haemonetics Corporation delivered adjusted earnings per share (EPS) of 81 cents in the first quarter of fiscal 2020, reflecting a 37.3% year-over-year surge from 59 cents. The bottom line also surpassed the Zacks Consensus Estimate by 28.6%.",
    "On a reported basis, net loss came in at 17 cents per share, wider than the year-ago loss of 5 cents.",
    " Total Revenues ",
    "Revenues rose 4% (up 8% on an organic basis) to $238.5 million from the first quarter of fiscal 2019. The top line remained marginally in line with the Zacks Consensus Estimate.",
    " Revenues by Product Categories ",
    "At Plasma,revenues of $110.4 million (accounting for 46.3% of total revenues) increased 11.1%year over year (up 16.1% on an organic basis) in the reported quarter. Plasma revenue growth in North America was 17.4% including 13.9% growth in disposables.",
    "Revenues at BloodCenter (31.8%) declined 3.8% (2.3% on an organic basis) to $75.8 million.",
    "Hospital revenues (20%) were up 1.5% (8.3% on an organic basis) to $47.7 million. Under the Hospital section, organic revenue growth in the Hemostasis Management product line was 15.7% in the first quarter of fiscal 2020.",
    " Margins ",
    "Adjusted gross margin was 51.2%, up 400 basis points (bps) year over year due to change in pricing structure, product mix and productivity.",
    "Adjusted operating income was $51.4 million in the quarter under discussion, up 26.3% from $40.7 million in the year-ago quarter. Meanwhile, adjusted operating margin expanded 360 bps year over year to 21.4%.",
    "The company continued to rollout the NexSys PCS device and NexLynk DMS donor management software.",
    " Financial Position ",
    "Haemonetics exited the first quarter of fiscal 2020 with cash and cash equivalents of $190.2 million compared with $169.4 million at the end of fiscal 2019. Long-term debt at the end of the first quarter was $318.1 million, showing a reduction of 1.3% from $322.5 million at the end of fiscal 2019.",
    "The company generated operating cash flow of $2.6 million in the first quarter, compared with $23.1 million a year ago (down 88.7%). The company also reported free cash flow (before restructuring and turnaround costs) of $5.3 million during the period which was down 12.2% from $6 million a year-ago.",
    " Fiscal 2020 Guidance ",
    "Haemonetics has updated its fiscal 2020 financial guidance. The company reiterated full-year organic revenue growth at the band of 6-8%. Coming to segmental revenues, on an organic basis, Plasma revenue view has been raised to a new range of 13-15% (from the earlier 11-13%). Hospital revenue growth projection is maintained at the band of 11-13%. Blood Center revenues are likely to decline 4-6% from the year-earlier number (earlier band was a decline of 6-8%). The Zacks Consensus Estimate for fiscal 2020 revenues is pegged at $1.01 billion.",
    "The company forecasts 2020 adjusted EPS in the range of $2.95-$3.15 (up from the previously issued guidance of $2.80-$3). The consensus estimate of $2.93 is below the guided range.",
    " How Have Estimates Been Moving Since Then? ",
    "In the past month, investors have witnessed an upward trend in estimates revision.",
    " VGM Scores ",
    "At this time, Haemonetics has an average Growth Score of C, however its Momentum Score is doing a lot better with an A. However, the stock was allocated a grade of D on the value side, putting it in the bottom 40% for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of C. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending upward for the stock, and the magnitude of these revisions looks promising. It comes with little surprise Haemonetics has a Zacks Rank #2 (Buy). We expect an above average return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:31:26"
}