{
  "url": "https://www.nasdaq.com/article/allergan-agn-outpaces-stock-market-gains-what-you-should-know-cm1207611",
  "title": "Allergan (AGN) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " In the latest trading session, Allergan (AGN) closed at $161.69, marking a +1.18% move from the previous day. The stock outpaced the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%. Prior to today's trading, shares of the Botox maker had gained 0.19% over the past month. This has outpaced the Medical sector's loss of 1.27% and the S&P 500's loss of 0.68% in that time. AGN will be looking to display strength as it nears its nex t earnings  release. The company is expected to report EPS of $4.21, down 0.94% from the prior-year quarter. Meanwhile, our latest consensus estimate is calling for revenue of $3.85 billion, down 1.51% from the prior-year quarter. Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $16.69 per share and revenue of $15.45 billion. These totals would mark changes of 0% and -2.14%, respectively, from last year. Any recent changes to analyst estimates for AGN should also be noted by investors. These recent revisions tend to reflect the evolving nature of short-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Our research shows that these estimate changes are directly correlated with near-term stock prices. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.49% lower within the past month. AGN is currently sporting a Zacks Rank of #3 (Hold). Digging into valuation, AGN currently has a Forward P/E ratio of 9.58. This represents a premium compared to its industry's average Forward P/E of 7.33. We can also see that AGN currently has a PEG ratio of 1.65. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. Medical - Generic Drugs stocks are, on average, holding a PEG ratio of 0.8 based on yesterday's closing prices. The Medical - Generic Drugs industry is part of the Medical sector. This industry currently has a Zacks Industry Rank of 63, which puts it in the top 25% of all 250+ industries. The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Allergan plc (AGN): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "In the latest trading session, Allergan (AGN) closed at $161.69, marking a +1.18% move from the previous day. The stock outpaced the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%.",
    "Prior to today's trading, shares of the Botox maker had gained 0.19% over the past month. This has outpaced the Medical sector's loss of 1.27% and the S&P 500's loss of 0.68% in that time.",
    "AGN will be looking to display strength as it nears its nex t earnings  release. The company is expected to report EPS of $4.21, down 0.94% from the prior-year quarter. Meanwhile, our latest consensus estimate is calling for revenue of $3.85 billion, down 1.51% from the prior-year quarter.",
    "Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $16.69 per share and revenue of $15.45 billion. These totals would mark changes of 0% and -2.14%, respectively, from last year.",
    "Any recent changes to analyst estimates for AGN should also be noted by investors. These recent revisions tend to reflect the evolving nature of short-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.",
    "Our research shows that these estimate changes are directly correlated with near-term stock prices. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.",
    "The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.49% lower within the past month. AGN is currently sporting a Zacks Rank of #3 (Hold).",
    "Digging into valuation, AGN currently has a Forward P/E ratio of 9.58. This represents a premium compared to its industry's average Forward P/E of 7.33.",
    "We can also see that AGN currently has a PEG ratio of 1.65. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. Medical - Generic Drugs stocks are, on average, holding a PEG ratio of 0.8 based on yesterday's closing prices.",
    "The Medical - Generic Drugs industry is part of the Medical sector. This industry currently has a Zacks Industry Rank of 63, which puts it in the top 25% of all 250+ industries.",
    "The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:50:10"
}