{
  "url": "https://www.nasdaq.com/article/magellan-midstream-partners-named-top-dividend-stock-with-insider-buying-and-620-yield-mmp-cm1210708",
  "title": "Magellan Midstream Partners Named Top Dividend Stock With Insider Buying and 6.20% Yield (MMP) - Nasdaq.com",
  "text": [
    "In this series, we look through the most recent Dividend Channel ''DividendRank''  report, and then we cherry pick only those companies that have experienced insider buying within the past six months. The officers and directors of a company tend to have a unique insider's view of the business, and presumably the only reason an insider would choose to take their hard-earned cash and use it to buy stock in the open market, is that they expect to make money - maybe they find the stock very undervalued, or maybe they see exciting progress within the company, or maybe both. So when stocks turn up that see insider buying, and are also top ranked, investors are wise to take notice. One such company is Magellan Midstream Partners LP (Symbol: MMP), which saw buying by Director Chansoo Joung.      Back on August 20, Joung invested $336,414.00 into 5,000 shares of MMP, for a cost per share of $67.28. In trading on Wednesday, bargain hunters could buy shares of Magellan Midstream Partners LP (Symbol: MMP) and achieve a cost basis 3.1% cheaper than Joung, with shares changing hands as low as $65.16 per share. Magellan Midstream Partners LP shares are currently trading +0.38% on the day. The chart below shows the one year performance of MMP shares, versus its 200 day moving average:  makeArticleAd();     Looking at the chart above, MMP's low point in its 52 week range is $54.25 per share, with $69.44 as the 52 week high point - that compares with a last trade of $65.58. By comparison, below is a table showing the prices at which insider buying was recorded over the last six months:       The DividendRank report noted that among the coverage universe, MMP shares displayed both attractive valuation metrics and strong profitability metrics. The report also cited the strong quarterly dividend history at Magellan Midstream Partners LP, and favorable long-term multi-year growth rates in key fundamental data points.    The report stated, '' Dividend investors approaching investing from a value standpoint are generally most interested in researching the strongest most profitable companies, that also happen to be trading at an attractive valuation. That's what we aim to find using our proprietary DividendRank formula, which ranks the coverage universe based upon our various criteria for both profitability and valuation, to generate a list of the top most 'interesting' stocks, meant for investors as a source of ideas that merit further research.  ''    The annualized dividend paid by Magellan Midstream Partners LP is $4.05/share, currently paid in quarterly installments, and its most recent dividend ex-date was on 08/06/2019. Below is a long-term dividend history chart for MMP, which the report stressed as being of key importance. Indeed, studying a company's past  dividend history  can be of good help in judging whether the most recent dividend is likely to continue.      The Top DividendRank'ed Stocks With Insider   Buying »  ",
    "  The Top DividendRank'ed Stocks With Insider   Buying » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 04:11:44"
}