{
  "url": "https://www.nasdaq.com/article/heirs-can-use-nua-tax-break-for-inherited-401ks-cm1206574",
  "title": "Heirs Can Use NUA Tax Break for Inherited 401(k)s - Nasdaq.com",
  "text": [
    "Workers who have a stash of employer stock in their 401(k)s can make use of a tax-saving move known as net unrealized appreciation, or NUA. But this tax-saving move is also available to heirs who inherit 401(k)s that hold employer stock, IRA expert Ed Slott recently noted at his IRA workshop in National Harbor, Md.",
    "Here's how the NUA strategy works: Say a deceased worker had employer stock in his 401(k) with an original cost basis of $100,000 and a current value of $500,000. If the heir rolls assets from the 401(k) to an inherited IRA, she can split off the appreciated employer stock and roll that into a taxable brokerage account.",
    "The heir will owe ordinary income tax on the original cost basis. When she later sells the appreciated stock from the taxable account, the NUA--the difference between the cost basis and the current market value of the employer stock--will be taxed at long-term capital-gains tax rates. Note that the heir doesn't get a step-up in basis on the appreciated employer stock.",
    "If instead she rolls the appreciated employer stock into the inherited IRA along with the rest of the 401(k) assets, she'll owe ordinary income tax on all the withdrawals, including the employer stock. And that would be a costly move tax-wise.",
    "Her total tax bill at today's top rates using the NUA strategy would be $117,000--$37,000 on the original cost basis at a 37% top ordinary income rate and $80,000 on the $400,000 of NUA at the top capital-gains rate of 20%. If she doesn't use the NUA strategy, at a 37% top ordinary rate, she'd owe tax of $185,000--or $68,000 more.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-01 22:38:29"
}