{
  "url": "https://www.nasdaq.com/article/innovation-aids-genomic-health-merger-procedure-on-track-cm1207377",
  "title": "Innovation Aids Genomic Health, Merger Procedure on Track - Nasdaq.com",
  "text": [
    " On Sep 3, we issued an updated research report on Genomic Health Inc GHDX  . This Zacks Rank #2 (Buy) company continues to make significant progress with its Oncotype DX breast cancer test. However, higher cost of production persists to weigh heavily on its bottom line. Over the past year, shares of Genomic Health have outperformed its industry  . The stock has rallied 18.6% against the industry's 27.5% fall. Genomic Health exited the second quarter on a solid note with better-than-expected earnings results. The company demonstrated strength across its entire business, driven by impressive performances in the United States and internationally. Also, within the prostate cancer space, the company is witnessing a robust improvement in volume as Oncotype DX GPS test results consistently lead the market in low- and intermediate-risk prostate cancer test adoption.   Genomic Health, Inc. Price      Genomic Health, Inc. price    |   Genomic Health, Inc. Quote   Further, the company is seeing buoyant global demand for Oncotype DX Breast Recurrence Score test usage. Moreover, it has progressed in terms of reimbursement update on Oncotype DX Breast Recurrence Score test in Germany. As a major milestone, recently, the Oncotype DX Breast Recurrence Score test has been recommended to guide chemotherapy treatment use for patients with hormone-receptor positive, HER-2 negative early-stage breast cancer with or without lymph node involvement (up to three positive nodes). Genomic Health is currently working on its impending merger with cancer diagnostics major Exact Sciences, which will combine two of the strongest brands in cancer diagnostics, Cologuard and OncotypeDX, thereby providing a platform for growth. However, the company's sole reliance on the Breast Oncotype DX test is a concern. Moreover, the company relentlessly faces fierce competition for Oncotype DX tests. Meanwhile, Genomic Health has adopted several strategies to improve its revenue performance. These include portfolio expansion and penetration in the international arena. This, in turn, has significantly escalated costs and operating expenses for the company so far.  Other Key Picks  Some other top-ranked stocks in the broader medical space are Valeritas Holdings, Inc. VLRX  , Myomo, Inc. MYO  and National Vision Holdings, Inc. EYE  . You cansee   the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here  .  Valeritas Holdings currently carries a Zacks Rank #2. Its third-quarter earnings growth rate is projected at 43.8%. Myomo's long-term expected earnings growth rate is 25%. The stock currently carries a Zacks Rank of 2. National Vision's long-term expected earnings growth rate is 17.2%. The stock is a Zacks #2 Ranked player.  Biggest Tech Breakthrough in a Generation  makeArticleAd();  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Genomic Health, Inc. (GHDX): Free Stock Analysis Report   Myomo, Inc. (MYO): Free Stock Analysis Report   Valeritas Holdings, Inc. (VLRX): Free Stock Analysis Report   National Vision Holdings, Inc. (EYE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "On Sep 3, we issued an updated research report on Genomic Health Inc GHDX  . This Zacks Rank #2 (Buy) company continues to make significant progress with its Oncotype DX breast cancer test. However, higher cost of production persists to weigh heavily on its bottom line.",
    "Over the past year, shares of Genomic Health have outperformed its industry  . The stock has rallied 18.6% against the industry's 27.5% fall.",
    "Genomic Health exited the second quarter on a solid note with better-than-expected earnings results. The company demonstrated strength across its entire business, driven by impressive performances in the United States and internationally. Also, within the prostate cancer space, the company is witnessing a robust improvement in volume as Oncotype DX GPS test results consistently lead the market in low- and intermediate-risk prostate cancer test adoption.",
    "  Genomic Health, Inc. Price      Genomic Health, Inc. price    |   Genomic Health, Inc. Quote  ",
    " Genomic Health, Inc. Price ",
    " Genomic Health, Inc. price    |   Genomic Health, Inc. Quote ",
    "Further, the company is seeing buoyant global demand for Oncotype DX Breast Recurrence Score test usage. Moreover, it has progressed in terms of reimbursement update on Oncotype DX Breast Recurrence Score test in Germany. As a major milestone, recently, the Oncotype DX Breast Recurrence Score test has been recommended to guide chemotherapy treatment use for patients with hormone-receptor positive, HER-2 negative early-stage breast cancer with or without lymph node involvement (up to three positive nodes).",
    "Genomic Health is currently working on its impending merger with cancer diagnostics major Exact Sciences, which will combine two of the strongest brands in cancer diagnostics, Cologuard and OncotypeDX, thereby providing a platform for growth.",
    "However, the company's sole reliance on the Breast Oncotype DX test is a concern. Moreover, the company relentlessly faces fierce competition for Oncotype DX tests. Meanwhile, Genomic Health has adopted several strategies to improve its revenue performance. These include portfolio expansion and penetration in the international arena. This, in turn, has significantly escalated costs and operating expenses for the company so far.",
    " Other Key Picks ",
    "Some other top-ranked stocks in the broader medical space are Valeritas Holdings, Inc. VLRX  , Myomo, Inc. MYO  and National Vision Holdings, Inc. EYE  . You cansee   the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here  . ",
    "Valeritas Holdings currently carries a Zacks Rank #2. Its third-quarter earnings growth rate is projected at 43.8%.",
    "Myomo's long-term expected earnings growth rate is 25%. The stock currently carries a Zacks Rank of 2.",
    "National Vision's long-term expected earnings growth rate is 17.2%. The stock is a Zacks #2 Ranked player.",
    " Biggest Tech Breakthrough in a Generation  makeArticleAd();  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:27:00"
}