{
  "url": "https://www.nasdaq.com/article/ride-square-stock-to-the-top-as-the-world-goes-cashless-cm1210369",
  "title": "Ride Square Stock to the Top as the World Goes Cashless - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "If you just look at charts and don't pay any attention to monetary trends in the world, you might think that Square (NYSE: SQ ) is going nowhere fast and that Square stock is destined to stay below $70 forever.",
    "This is a textbook example of why I encourage investors to look beyond the charts and educate themselves about the macro environment.",
    "As I see it, the Square stock price will be driven not by technical indicators on the chart but by a bigger cultural movement away from cash and towards more convenient and easily accessible forms of payment. Square is a company at the forefront of this movement, and soon enough, SQ stock will reflect the true value of this forward-thinking point-of-sale solutions provider.",
    "The trend is unmistakable: consumers want convenience, not cash, in their payment modalities. As proof of this, consider the fact that for transactions totaling less than $20, consumers back in 2015 paid with cash 46% of the time. That's already less than half, but check this out: so far in 2019, that figure has fallen to 37%, marking a precipitous drop in cash-based spending .",
    "This is a global phenomenon, with 47% of China's consumers using mobile wallets as their primary means of making payments. While PayPal (NASDAQ: PYPL ) and Amazon (NASDAQ: AMZN ) remain strong contenders in the global point-of-sale payments space, Square's user base is growing at a record clip: 15 million active accounts by the end of last year, more than double the 7 million at the end of 2017.",
    "What differentiates Square from the other competitors is the simplicity of the company's app, along with ease with which users can receive paychecks through Square Cash. Plus, shoppers enjoy the app's wide range of instant discounts , some of which are exclusive to Square Cash.",
    "I also like the move that Square made recently to unload its food delivery service, known as Caviar. This is a highly competitive market, and let's face it: food delivery isn't Square's forte. Therefore, when Square announced that it was selling off Caviar to Doordash for $410 million after having paid just $44.3 million for it five years ago, I found this to be a savvy move and a sign that Square is prepared to focus on its payments app.",
    "I try not to put too much stock (no pun intended) into analysts' expectations, but I just can't ignore the love that SQ stock has been getting lately. As an example, one analyst who foresees plenty of upside for SQ stock is KeyBanc's Josh Beck .",
    "Beck not only reaffirmed an overweight rating for the shares but even gave it a price target of $100 - pretty ambitious considering the all-time high for Square stock is $101.15.",
    "\"We outline a potential scenario where adj. revenue could come in at $562.5M, which could be driven by a subscription/services number closer to ~$250M,\" he said.",
    "Somewhat less ambitious but still optimistic are Andrew Jeffrey of SunTrust Robinson Humphrey, who gave SQ stock an upgrade from hold to buy along with a price objective of $80; as well as Argus Research analyst Stephen Biggar , who also granted Square stock a buy rating but furthermore assigned a very bullish price objective of $94 for SQ shares.",
    "I'm not overly concerned about the day-to-day movements of the Square stock price, as I view SQ as a long-term investment in a world that's abandoning cash and moving towards payment methods that are simple and convenient - and Square is proving itself as a strong, focused, and fast-growing competitor in the point-of-sale payments domain.",
    "As of this writing, David Moadel did not hold a position in any of the aforementioned securities.",
    "The post Ride Square Stock to the Top as the World Goes Cashless appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 06:40:56"
}