{
  "url": "https://www.nasdaq.com/article/will-coparts-cprt-expansion-drive-bolster-q4-earnings-cm1206692",
  "title": "Will Copart's (CPRT) Expansion Drive Bolster Q4 Earnings? - Nasdaq.com",
  "text": [
    "  Copart, Inc. CPRT  is scheduled to release fourth-quarter fiscal 2019 results after the closing bell on Sep 4. The current Zacks Consensus Estimate for the quarter to be reported is earnings per share of 56 cents on revenues of 507 million. In the las t report  ed quarter, the Texas-based company  beat   the consensus mark by 8.20%, primarily on the back of higher service revenues. As far as earnings surprises are concerned, the online vehicle auctioning company has a good record, having outpaced the Zacks Consensus Estimate thrice in the last four quarters. This is depicted in the graph below:   Copart, Inc. Price and EPS Surprise        Copart, Inc. price-eps-surprise    |   Copart, Inc. Quote   While investors are keeping their fingers crossed and anticipating that Copart - whose peersinclude Ritchie Bros. Auctioneers Incorporated RBA  , Byd Co., Ltd. BYDDY  and Sotheby's BID  - will surpass earnings estimates this time around, our model does not predict the same.  Which Way are Top and Bottom-Line Estimates   Headed?  The Zacks Consensus Estimate for revenues is pegged at $507 million, indicating an improvement from $449 million recorded in the prior-year quarter. The Zacks Consensus Estimate for fiscal fourth-quarter earnings of 56 cents per share also suggests growth from 49 cents recorded in the corresponding quarter of the prior year. However, earnings estimates for the to-be-reported quarter have remained unchanged over the past month. Let's delve deeper into factors that are likely to influence Copart's fiscal fourth-quarter earnings.  Factors Setting the Tone  Copart's active presence across U.S. and international markets is likely to aid worldwide sales volumes. High activity levels in the United States and expansion efforts in European markets - primarily in the United Kingdom and Germany - will boost the firm's revenues in the to-be-reported quarter. Evidently, the Zacks Consensus Estimates for service revenues and vehicle sales is pegged at $441 million and $68 million, marking y/y growth of 12.5% and 17.2%, respectively. In addition to opening hubs and expanding its network of facilities, the company's strategic acquisitions are also likely to drive revenues. In March 2019, Copart acquired Kentucky-based online auctioning platform, Vincent Auto Solutions, which will strengthen its footprint in western Kentucky and boost sales in the quarter to be reported. However, increased investments to support growth initiatives, including domestic and international expansion of business, may dent the firm's margins. As it is, the company is bearing the brunt of high operating expenses over the last several quarters. The trend is likely to continue, which may lower its profit levels to some extent.  What Our Model Says  Our proven model does not conclusively predict that Copart will beat the Zacks Consensus Estimate in the to-be-reported quarter. This is because it doesn't have the right combination of the two key ingredients - a positive  Earnings ESP   and a Zacks Rank #3 (Hold) or higher - for increasing the odds of an earnings beat. You can uncover the best stocks to buy or sell before they're reported with our  Earnings ESP Filter  .  Earnings ESP:   Earnings ESP, which represents the difference between the Most Accurate Estimate and the Zacks Consensus Estimate, is 0.00%. This is because both the Zacks Consensus Estimate and the Most Accurate Estimate are pegged at 56 cents a share.  Zacks Rank:   Copart currently has a Zacks Rank #3, which increases the predictive power of ESP. However, we also need to have a positive ESP to be sure of an earnings beat. You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   . Note that we caution against stocks with a Zacks Rank #4 or 5 (Sell rated) going into an earnings announcement, especially when the company is seeing a negative estimate revision.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Sotheby's (BID): Free Stock Analysis Report   Copart, Inc. (CPRT): Free Stock Analysis Report   Ritchie Bros. Auctioneers Incorporated (RBA): Free Stock Analysis Report   Byd Co., Ltd. (BYDDY): Get Free Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Copart, Inc. CPRT  is scheduled to release fourth-quarter fiscal 2019 results after the closing bell on Sep 4. The current Zacks Consensus Estimate for the quarter to be reported is earnings per share of 56 cents on revenues of 507 million.",
    "In the las t report  ed quarter, the Texas-based company  beat   the consensus mark by 8.20%, primarily on the back of higher service revenues. As far as earnings surprises are concerned, the online vehicle auctioning company has a good record, having outpaced the Zacks Consensus Estimate thrice in the last four quarters. This is depicted in the graph below:",
    "  Copart, Inc. Price and EPS Surprise        Copart, Inc. price-eps-surprise    |   Copart, Inc. Quote  ",
    " Copart, Inc. Price and EPS Surprise ",
    " Copart, Inc. price-eps-surprise    |   Copart, Inc. Quote ",
    "While investors are keeping their fingers crossed and anticipating that Copart - whose peersinclude Ritchie Bros. Auctioneers Incorporated RBA  , Byd Co., Ltd. BYDDY  and Sotheby's BID  - will surpass earnings estimates this time around, our model does not predict the same.",
    " Which Way are Top and Bottom-Line Estimates   Headed? ",
    "The Zacks Consensus Estimate for revenues is pegged at $507 million, indicating an improvement from $449 million recorded in the prior-year quarter. The Zacks Consensus Estimate for fiscal fourth-quarter earnings of 56 cents per share also suggests growth from 49 cents recorded in the corresponding quarter of the prior year. However, earnings estimates for the to-be-reported quarter have remained unchanged over the past month.",
    "Let's delve deeper into factors that are likely to influence Copart's fiscal fourth-quarter earnings.",
    " Factors Setting the Tone ",
    "Copart's active presence across U.S. and international markets is likely to aid worldwide sales volumes. High activity levels in the United States and expansion efforts in European markets - primarily in the United Kingdom and Germany - will boost the firm's revenues in the to-be-reported quarter. Evidently, the Zacks Consensus Estimates for service revenues and vehicle sales is pegged at $441 million and $68 million, marking y/y growth of 12.5% and 17.2%, respectively.",
    "In addition to opening hubs and expanding its network of facilities, the company's strategic acquisitions are also likely to drive revenues. In March 2019, Copart acquired Kentucky-based online auctioning platform, Vincent Auto Solutions, which will strengthen its footprint in western Kentucky and boost sales in the quarter to be reported.",
    "However, increased investments to support growth initiatives, including domestic and international expansion of business, may dent the firm's margins. As it is, the company is bearing the brunt of high operating expenses over the last several quarters. The trend is likely to continue, which may lower its profit levels to some extent.",
    " What Our Model Says ",
    "Our proven model does not conclusively predict that Copart will beat the Zacks Consensus Estimate in the to-be-reported quarter. This is because it doesn't have the right combination of the two key ingredients - a positive  Earnings ESP   and a Zacks Rank #3 (Hold) or higher - for increasing the odds of an earnings beat.",
    "You can uncover the best stocks to buy or sell before they're reported with our  Earnings ESP Filter  .",
    " Earnings ESP:   Earnings ESP, which represents the difference between the Most Accurate Estimate and the Zacks Consensus Estimate, is 0.00%. This is because both the Zacks Consensus Estimate and the Most Accurate Estimate are pegged at 56 cents a share.",
    " Zacks Rank:   Copart currently has a Zacks Rank #3, which increases the predictive power of ESP. However, we also need to have a positive ESP to be sure of an earnings beat. You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "Note that we caution against stocks with a Zacks Rank #4 or 5 (Sell rated) going into an earnings announcement, especially when the company is seeing a negative estimate revision.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:17:00"
}