{
  "url": "https://www.nasdaq.com/article/3-high-yielding-closed-ended-funds-to-boost-your-income-cm1210770",
  "title": "3 High-Yielding Closed-Ended Funds to Boost Your Income - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "That was fun while it lasted. With the Federal Reserve cutting interest rates and investors rushing into bonds for safety, yields have dropped like a stone. Many traditional income products - such as CDs, money market funds and bond ETFs like the iShares Barclays Aggregate Bond Fund (NYSEArca: AGG ) - just aren't cutting it once again. Welcome back to the \"new normal.\" For investors seeking income, this is a big deal.",
    "But isn't have to be. Luckily, there are ways to boost your income even during this period of falling interest rates and yields.",
    "That comes from a hefty dose of close-ended funds (CEFs).",
    "Closed-ended funds are an often-ignored fund type, but they do offer plenty of benefits for those investors seeking dividend funds. Like ETFs, CEFs trade throughout the day on exchanges. However, closed-end funds issue a set number of shares when launched. This allows them to trade at discounts to their actual values. This plus the ability to use some leverage allows them to boost yields. For investors looking for high-income, CEFs offer some of the best potential among dividend funds.",
    "With that, here are three closed-ended funds that you should put on your list.",
    "Distribution Yield: 7.31%",
    "Discount To Net Asset Value (NAV): 1.98%",
    "With yields on bonds and cash now dropping again, stocks can pick up the slack. Dividends remain a great way to scoop up some extra yield . So, when combining the power of stock dividends with the advantages of closed-ended funds, investors can really win. A top choice could be the Nuveen Tax-Advantaged Dividend Growth Fund (NYSE: JTD ).",
    "JTD seeks to provide a high yield and some capital appreciation by investing in a basket of mid- and large-cap stocks. The kicker is that the closed-ended fund looks to mitigate the effects of federal taxes. It accomplishes this goal in two-stages. One, JTD will hold those stocks that pay so-called qualified dividends. That is dividends that are taxed at just a 15% rate. Top holdings include JPMorgan (NYSE: JPM ) and Microsoft (NASDAQ: MSFT ). Secondly, the CEF's management tends to hold onto those stocks for a while to defer/reduce capital gains. The result is a more tax-efficient dividend fund that can be held in a regular brokerage account.",
    "And when you add in some leverage, JTD pays a juicy 7.31% yield. Perhaps the best part is the fund can currently be had for a 1.68% discount to its real worth when looking at its NAV.",
    "As for returns, the short run has been a bit bumpy for JTD. But over the longer haul, the combination of dividend income and capital gains has helped the CEF score a 13.84% average annual return over the last decade.",
    "Distribution Yield: 4.24%",
    "Discount To NAV: 8.65%",
    "If there is one area where closed-ended funds are vastly superior to ETFs and active mutual funds, it has to be municipal bonds.  Municipal bonds can be a haven for tax-sensitive and high-earning investors. Free from federal - and in some cases, state & local - taxes, munis are a great way to boost your income without having to pay Uncle Sam. Thanks to the ability of a CEF to use leverage, those tax-free distributions are even greater.",
    "For example, the BlackRock MuniYield Quality (NYSE: MQY ) is currently yielding 4.54%. The key is that yield is tax-free for most investors. For someone in the highest tax bracket, you'd need to have a yield of 7.18% to get the same amount of income.",
    "What's particularly impressive about MQY and that yield is the kind of muni bonds it holds. Just like we all have different credit scores, various states and local governments' finances are different as well. This leads to variety of different credit ratings. MQY invests only in those muni bonds that are in the three highest quality rating categories. A or better. Currently, top muni bonds like this are paying about half that yield. It's the use of leverage that boosts the income potential.",
    "Even better is that investors can now buy that top-quality muni portfolio for nearly 9% discount to MQY's underlying value.",
    "So, for investors looking for a high-tax-free yield, MQY as well as its same strategy sister CEFs - the MuniYield Quality Fund III (NYSE: MYI ) and MuniYield Quality Fund II (NYSE: MQT ) - -make ideal choices.",
    "Distribution Yield: 8.73%",
    "Discount To NAV: 9.18%",
    "With the flight to quality bonds and Fed dropping rates, flexibility is key within the fixed income sectors. It takes a deft hand to get a bit more yield from bonds. And that is why the MFS Multi-Market Income Trust (NYSE: MMT ) could be a great closed-ended fund to own.",
    "MMT is considered a \"go anywhere\" bond fund. The fund's management has discretion on what to buy and when, providing the CEF the ability to shift around its portfolio as needed. As a result, its portfolio is invested in a wide range of different bonds varieties - from high-yield and emerging-market debt to investment-grade corporate debt and treasury bonds. Given the current rocky environment, that has MMT loading up on safe treasury bonds and high-grade corporates.",
    "But there is enough \"spice\" to provide it with a higher yield than just a bread-n-butter intermediate bond fund. Currently, that yield is a high 8.73%. As with the other closed-ended funds on this list, leverage does much of the work.",
    "With a long operating history- dating back to the 1980s- and big 9% discount to its NAV, MMT may just be what your portfolio needs to boost its fixed income sleeve. the ability to shift around will suit investors during good times and in bad.",
    "Disclosure: At the time of writing, Aaron Levitt did not hold a position in any stock mentioned.",
    "The post 3 High-Yielding Closed-Ended Funds to Boost Your Income appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:32:47"
}