{
  "url": "https://www.nasdaq.com/article/accenture-acn-completes-acquisition-of-pragsis-bidoop-cm1210325",
  "title": "Accenture (ACN) Completes Acquisition of Pragsis Bidoop - Nasdaq.com",
  "text": [
    "  Accenture ACN  yesterday announced that it has acquired Pragsis Bidoop - a provider of big data and AI solutions, machine learning and advanced predictive models. The financial terms of the deal have been kept under wraps. Founded in 2004, Pragsis Bidoop has a diversified client base of Ibex-35 companies in Spain and multinational corporations with a presence in Mexico, Brazil and other Latin America. It serves a number of industries, which include banking and insurance, retail, energy, railway, public sector and pharma. The company is headquartered in Madrid and has additional offices in Barcelona and the U.K. So far this year, we observe that shares of Accenture have gained 34.5% compared with 31.2% rise of the industry  it belongs to and 17.4% increase of the Zacks S&P 500 composite.       Deal Details & Benefits  The acquisition marks the combination of Pragsis Bidoop's more than 200 employees with deep machine learning, artificial intelligence and big data engineering experience, and its portfolio of end-to-end solutions, to Accenture's Applied Intelligence business. This should amplify Accenture Applied Intelligence's capabilities in aiding enterprise clients scale their deployments of AI, analytics and automation, especially in the European and Latin American markets and further cater to the upcoming stages of the data driven transformation journey. Athina Kanioura, chief analytics officer and global lead for Applied Intelligence at Accenture stated, \"As we continue to grow the business, the Pragsis Bidoop team will play a critical role in the European market and beyond.\" Juan Pedro Moreno, country managing director for Spain, Portugal and Israel at Accenture stated, \"With the addition of Pragsis Bidoop, we will multiply our specialized talent in big data, data engineering and Artificial Intelligence skills.\" The deal comes on the heels of Accenture's latest acquisition of Analytics8 - a privately held Australian big data and analytics consultancy, on Aug 30, 2019 - to strengthen its potential related to AI-powered data and advanced analytics services to clients across Australia and New Zealand. Analytics8's Melbourne and Sydney-based team of 70 professionals also joined Accenture's Applied Intelligence.  Zacks Rank & Stocks to Consider  Accenture currently carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   . Some better-ranked stocks in the broader Zacks  Business Services   sector are Huron Consulting HURN  , Charles River Associates CRAI  and Fiserv FISV  . While Fiserv sports a Zacks Rank #1, Huron Consulting and Charles River Associates carry a Zacks Rank #2 (Buy). Long-term expected earnings (three to five years) growth rate for Huron Consulting, Charles River Associates and Fiserv is 13.5%, 13% and 12%, respectively.  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.  makeArticleAd();  Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Accenture PLC (ACN): Free Stock Analysis Report   Huron Consulting Group Inc. (HURN): Free Stock Analysis Report   Charles River Associates (CRAI): Free Stock Analysis Report   Fiserv, Inc. (FISV): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Accenture ACN  yesterday announced that it has acquired Pragsis Bidoop - a provider of big data and AI solutions, machine learning and advanced predictive models. The financial terms of the deal have been kept under wraps.",
    "Founded in 2004, Pragsis Bidoop has a diversified client base of Ibex-35 companies in Spain and multinational corporations with a presence in Mexico, Brazil and other Latin America. It serves a number of industries, which include banking and insurance, retail, energy, railway, public sector and pharma. The company is headquartered in Madrid and has additional offices in Barcelona and the U.K.",
    "So far this year, we observe that shares of Accenture have gained 34.5% compared with 31.2% rise of the industry  it belongs to and 17.4% increase of the Zacks S&P 500 composite.",
    " Deal Details & Benefits ",
    "The acquisition marks the combination of Pragsis Bidoop's more than 200 employees with deep machine learning, artificial intelligence and big data engineering experience, and its portfolio of end-to-end solutions, to Accenture's Applied Intelligence business.",
    "This should amplify Accenture Applied Intelligence's capabilities in aiding enterprise clients scale their deployments of AI, analytics and automation, especially in the European and Latin American markets and further cater to the upcoming stages of the data driven transformation journey.",
    "Athina Kanioura, chief analytics officer and global lead for Applied Intelligence at Accenture stated, \"As we continue to grow the business, the Pragsis Bidoop team will play a critical role in the European market and beyond.\"",
    "Juan Pedro Moreno, country managing director for Spain, Portugal and Israel at Accenture stated, \"With the addition of Pragsis Bidoop, we will multiply our specialized talent in big data, data engineering and Artificial Intelligence skills.\"",
    "The deal comes on the heels of Accenture's latest acquisition of Analytics8 - a privately held Australian big data and analytics consultancy, on Aug 30, 2019 - to strengthen its potential related to AI-powered data and advanced analytics services to clients across Australia and New Zealand. Analytics8's Melbourne and Sydney-based team of 70 professionals also joined Accenture's Applied Intelligence.",
    " Zacks Rank & Stocks to Consider ",
    "Accenture currently carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "Some better-ranked stocks in the broader Zacks  Business Services   sector are Huron Consulting HURN  , Charles River Associates CRAI  and Fiserv FISV  . While Fiserv sports a Zacks Rank #1, Huron Consulting and Charles River Associates carry a Zacks Rank #2 (Buy).",
    "Long-term expected earnings (three to five years) growth rate for Huron Consulting, Charles River Associates and Fiserv is 13.5%, 13% and 12%, respectively.",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.  makeArticleAd();  Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:50:00"
}