{
  "url": "https://www.nasdaq.com/article/top-3-dividend-yielding-companies-of-the-hang-seng-index-cm1210820",
  "title": "Top 3 Dividend-Yielding Companies of the Hang Seng Index - Nasdaq.com",
  "text": [
    " Hong Kong's Hang Seng Index (HSI) has many companies   paying mouth-watering dividends with high yields that would   attract anyone who is looking to generate dividend income. Here, I'll look at the top three companies of the HSI that   have the highes   t   dividend yield    s. The yields are also much higher than the avera   ge   dividend yield    of around 4% of the HSI constituents.   Image Source: Getty Images.makeArticleAd();   #1: Sinopec   China Petroleum & Chemical Corp    (SEHK: 386) , or Sinopec, is the top dividend-yielding company on   Hong Kong's benchmark index. Sinopec is a large China-based   petroleum and petrochemicals group established in July 1998 and   it trades as an H-share on the Hong Stock stock exchange. At Sinopec's share price of HK$4.69 at the time of writing, it   sports an attractive trailing dividend yield of 8.1%. Over the past three years, Sinopec's dividend per share (DPS)   has grown from RMB 0.249 in 2016 to RMB 0.42 in 2018. However,   its 2018 dividend actually fell 16% from RMB 0.50 per share in   2017. The dividend cut continued into the 2019 second-quarter as   the latest dividend dropped 25% to RMB 0.12 from RMB 0.16 one   year back. The quick lesson here is that even though a company's dividend   yield may be high, we should investigate further to find out if   the high dividend yield is sustainable. Since the dividend yield   is a function of the share price, a falling share price due to   poor business performance (which could then translate to falling   dividend) could give rise to high yield.  #2: HSBC Holdings plc   HSBC Holdings plc    (NYSE: HSBC) , which was founded in Hong Kong in 1865, is one of   the world's largest banks. From 2016 to 2018, the bank has been   paying a flat DPS of US$0.51. At HSBC's current share of   HK$58.20, it has a dividend yield of 6.9%. HSBC's dividend yield looks high. However, if investors want   to invest in a bank with growing dividends, they can consider   Singapore-listed bank   DBS Group Holdings Ltd    (SGX: D05) , which has a regional presence in Asia. In the last three years, DBS's dividend per share has   ballooned 100% from S$0.60 in 2016 to S$1.20 in 2018. And there's   potential for dividends to grow further (you can find out why   here    ). At DBS's share price of S$24.75, it has a dividend yield of   4.8%.  #3: Bank of China Ltd   Bank of China Ltd    (OTC: BACHY) is another bank that gives dividend investors plenty   to cheer about with a high yield of 6.8% at its share   price of HK$3.09. Just like Sinopec, Bank of China also trades as   an H-share in Hong Kong and is one of the biggest state-owned   banks in China. Bank of China has a better track record than HSBC when it   comes to dividend growth, though. In 2016, the bank paid out RMB   0.168 per share as a dividend, and that climbed around 10% in all   to RMB 0.184 per share in 2018. Furthermore, Bank of China has the most conservative dividend   payout ratio among the three companies at 30%. This shows that   even i   f earnings    were to drop significantly in the coming years, Bank of China   would be able to maintain its dividend of RMB 0.184 per share. In   comparison, Sinopec's and HSBC's dividend payout ratios in 2018   were slightly above 80%.  A version of this article originally appeared on our Fool     Asia site. For more coverage like this head over to      Fool.hk.en.    10 stocks we like better than HSBC Holdings       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and HSBC Holdings wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       The Motley Fool recommends DBS Group Holdings Ltd. The     Motley Fool has a     disclosure policy      .  ",
    "Hong Kong's Hang Seng Index (HSI) has many companies   paying mouth-watering dividends with high yields that would   attract anyone who is looking to generate dividend income.",
    "Here, I'll look at the top three companies of the HSI that   have the highes   t   dividend yield    s. The yields are also much higher than the avera   ge   dividend yield    of around 4% of the HSI constituents.",
    "  Image Source: Getty Images.makeArticleAd(); ",
    "Image Source: Getty Images.",
    " China Petroleum & Chemical Corp    (SEHK: 386) , or Sinopec, is the top dividend-yielding company on   Hong Kong's benchmark index. Sinopec is a large China-based   petroleum and petrochemicals group established in July 1998 and   it trades as an H-share on the Hong Stock stock exchange.",
    "At Sinopec's share price of HK$4.69 at the time of writing, it   sports an attractive trailing dividend yield of 8.1%.",
    "Over the past three years, Sinopec's dividend per share (DPS)   has grown from RMB 0.249 in 2016 to RMB 0.42 in 2018. However,   its 2018 dividend actually fell 16% from RMB 0.50 per share in   2017. The dividend cut continued into the 2019 second-quarter as   the latest dividend dropped 25% to RMB 0.12 from RMB 0.16 one   year back.",
    "The quick lesson here is that even though a company's dividend   yield may be high, we should investigate further to find out if   the high dividend yield is sustainable. Since the dividend yield   is a function of the share price, a falling share price due to   poor business performance (which could then translate to falling   dividend) could give rise to high yield.",
    " HSBC Holdings plc    (NYSE: HSBC) , which was founded in Hong Kong in 1865, is one of   the world's largest banks. From 2016 to 2018, the bank has been   paying a flat DPS of US$0.51. At HSBC's current share of   HK$58.20, it has a dividend yield of 6.9%.",
    "HSBC's dividend yield looks high. However, if investors want   to invest in a bank with growing dividends, they can consider   Singapore-listed bank   DBS Group Holdings Ltd    (SGX: D05) , which has a regional presence in Asia.",
    "In the last three years, DBS's dividend per share has   ballooned 100% from S$0.60 in 2016 to S$1.20 in 2018. And there's   potential for dividends to grow further (you can find out why   here    ). At DBS's share price of S$24.75, it has a dividend yield of   4.8%.",
    " Bank of China Ltd    (OTC: BACHY) is another bank that gives dividend investors plenty   to cheer about with a high yield of 6.8% at its share   price of HK$3.09. Just like Sinopec, Bank of China also trades as   an H-share in Hong Kong and is one of the biggest state-owned   banks in China.",
    "Bank of China has a better track record than HSBC when it   comes to dividend growth, though. In 2016, the bank paid out RMB   0.168 per share as a dividend, and that climbed around 10% in all   to RMB 0.184 per share in 2018.",
    "Furthermore, Bank of China has the most conservative dividend   payout ratio among the three companies at 30%. This shows that   even i   f earnings    were to drop significantly in the coming years, Bank of China   would be able to maintain its dividend of RMB 0.184 per share. In   comparison, Sinopec's and HSBC's dividend payout ratios in 2018   were slightly above 80%.",
    " A version of this article originally appeared on our Fool     Asia site. For more coverage like this head over to      Fool.hk.en. ",
    "  10 stocks we like better than HSBC Holdings       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and HSBC Holdings wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than HSBC Holdings       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and HSBC Holdings wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " The Motley Fool recommends DBS Group Holdings Ltd. The     Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:31:00"
}