{
  "url": "https://www.nasdaq.com/article/wheres-the-fake-beef-not-at-kraft-heinz-investors-worry-20190912-00174",
  "title": "Where's the fake beef? Not at Kraft Heinz, investors worry - Nasdaq.com",
  "text": [
    "By Richa Naidu and Siddharth Cavale",
    "CHICAGO, Sept 12 (Reuters) - Investors are chewing out Kraft Heinz Co  for failing to lay out a full strategy for how it plans to compete in the roughly $3 billion-a-year plant-based protein market.",
    "At the Kraft Heinz annual meeting to be held in Pittsburgh on Thursday, shareholders will vote on a proposal asking the company to reveal its long-term strategy for imitation meat and alternative proteins.",
    "\"It's a fast-growing market and they've been really silent with investors on how they plan to tackle that,\" said Kyle Kempf, a spokesman for Green Century Funds, which proposed the proxy vote and owns a more than $460,000 stake in Kraft Heinz.",
    "Kraft Heinz has been ranked one of the least proactive major food makers in the plant-based protein market, according to FAIRR, a major investor coalition that includes several Kraft Heinz shareholders. The company's main meat-alternative brand, 40-year-old BOCA Burger, has lost market share since 2013.",
    "\"Any company ranking at the bottom clearly has some catching up to do,\" said Peter van der Werf, head of responsible investment management at Robeco, which owns an $9.6 million stake in Kraft Heinz.",
    "Robeco and another Kraft Heinz investor, NN Investment Partners, told Reuters they were inclined to support the investor demand that Kraft Heinz cough up more specifics about its alternative-protein strategy. Neither company would disclose whether they will vote for the proposal, which Kraft Heinz's board of directors has recommended rejecting.",
    "Kraft Heinz, which took a $15.4 billion writedown this year on its Kraft and Oscar Mayer brands , has been criticized for spending too little on innovation and marketing after years of cost cuts under managers from 3G Capital, Kraft Heinz's No. 2 shareholder. Since the writedown, the company's shares have fallen about 40%.",
    "BOCA LOSES SIZZLE",
    "BOCA Burger, credited by some as the original U.S. veggie burger for the masses, was bought by the then-Kraft Foods in 2000. One problem for the aging BOCA Burger, however, is that the current alternative-meat craze is actually being driven not by vegetarians, but by so-called flexitarians - meat-eaters who occasionally buy alternative-protein products. To appeal to these shoppers, Beyond Meat and other upstarts are convincing grocers to stock their products next to fresh-looking animal burgers in chilled-meat cases. ",
    "BOCA Burgers, by contrast, are frozen and sit in refrigerators with vegetarian and vegan products, where meat-eaters may not think to look.",
    "Kroger Co , one of the first grocers to sell Beyond Meat patties in meat cases, said on Tuesday it was testing a plant-based protein section in the meat departments of 60 stores to gauge shopper behavior.",
    "BOCA Burger's share of the U.S. plant-based burger market shrank to 3.8% last year, compared with 7.3% in 2013, according to Euromonitor.",
    "Kraft Heinz declined to provide details on its plans for plant-based proteins or comment on the forthcoming shareholder vote. In a filing ahead of the meeting, Kraft Heinz said several named executives had forfeited their bonuses for 2018 due to the company's performance. Chief Executive Officer Miguel Patricio, who took the helm in July, said last month that the company needed to better understand consumers and was \"far behind the plant-based market.\"",
    "Spokeswoman Lynne Galia said Kraft Heinz had increased BOCA sales over the past year, driven by changes to the taste, texture and packaging of its products. \"We are committed to ensuring our BOCA products maintain meaningful competitive claims versus meat products, as well as competitive claims in the category as it evolves,\" Galia said.",
    "But BOCA's new boxes lack the \"plant-based\" buzzword, and tout an \"All American Veggie Burger\" at a time when rivals lure meat-eaters by avoiding terms like \"vegan\" or \"vegetarian.\"",
    "Faryda Lindeman, a senior responsible investment specialist at NN Investment Partners, said big companies including Kraft Heinz that had fallen behind in the plant-based market were likely set in their ways and did not want to invest in new risks. NN Investment holds a $9.4 million stake in Kraft Heinz.",
    "\"The only thing they can do is to buy other companies of course, they have a lot of cash,\" Lindeman said. 3G Capital is known for scoring big M&A deals to drive growth, but new Kraft Heinz CEO Patricio said when his appointment was announced in April that his focus, for now, would be on expanding existing brands. "
  ],
  "published_datetime": "2019-09-12 06:00:00"
}