{
  "url": "https://www.nasdaq.com/article/earnings-preview-park-city-group-pcyg-q4-earnings-expected-to-decline-cm1207944",
  "title": "Earnings Preview: Park City Group (PCYG) Q4 Earnings Expected to Decline - Nasdaq.com",
  "text": [
    " Wall Street expects a year-over-year decline in earnings on lower revenues when Park City Group (PCYG) reports results for the quarter ended June 2019. While this widely-known consensus outlook is important in gauging the company's earnings picture, a powerful factor that could impact its near-term stock price is how the actual results compare to these estimates. The earnings report, which is expected to be released on September 12, 2019, might help the stock move higher if these key numbers are better than expectations. On the other hand, if they miss, the stock may move lower. While management's discussion of business conditions on the   earnings call  will mostly determine the sustainability of the immediate price change and future earnings expectations, it's worth having a handicapping insight into the odds of a positive EPS surprise.  Zacks Consensus Estimate  This software-as-a-service provider is expected to pos t quarterly earnings  of $0.04 per share in its upcoming report, which represents a year-over-year change of -42.9%. Revenues are expected to be $5.06 million, down 19.9% from the year-ago quarter.  Estimate Revisions Trend  The consensus EPS estimate for the quarter has remained unchanged over the last 30 days. This is essentially a reflection of how the covering analysts have collectively reassessed their initial estimates over this period. Investors should keep in mind that the direction of estimate revisions by each of the covering analysts may not always get reflected in the aggregate change.  Price, Consensus and EPS Surprise      Earnings Whisper  Estimate revisions ahead of a company's earnings release offer clues to the business conditions for the period whose results are coming out. This insight is at the core of our proprietary surprise prediction model -- the Zacks Earnings ESP  (Expected Surprise Prediction). The Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a more recent version of the Zacks Consensus EPS estimate. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier. Thus, a positive or negative Earnings ESP reading theoretically indicates the likely deviation of the actual earnings from the consensus estimate. However, the model's predictive power is significant for positive ESP readings only. A positive Earnings ESP is a strong predictor of an earnings beat, particularly when combined with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold). Our research shows that stocks with this combination produce a positive surprise nearly 70% of the time  , and a solid Zacks Rank actually increases the predictive power of Earnings ESP. Please note that a negative Earnings ESP reading is not indicative of an earnings miss. Our research shows that it is difficult to predict an earnings beat with any degree of confidence for stocks with negative Earnings ESP readings and/or Zacks Rank of 4 (Sell) or 5 (Strong Sell).  How Have the Numbers Shaped Up for Park City   Group?  For Park City Group, the Most Accurate Estimate is the same as the Zacks Consensus Estimate, suggesting that there are no recent analyst views which differ from what have been considered to derive the consensus estimate. This has resulted in an Earnings ESP of 0%. On the other hand, the stock currently carries a Zacks Rank of #3. So, this combination makes it difficult to conclusively predict that Park City Group will beat the consensus EPS estimate.  Does Earnings Surprise History Hold Any Clue?  Analysts often consider to what extent a company has been able to match consensus estimates in the past while calculating their estimates for its future earnings. So, it's worth taking a look at the surprise history for gauging its influence on the upcoming number. For the las t report  ed quarter, it was expected that Park City Group would pos t earnings  of $0.06 per share when it actually produced earnings of $0.05, delivering a surprise of -16.67%. Over the last four quarters, the company has beaten consensus EPS estimates three times.  Bottom Line  An earnings beat or miss may not be the sole basis for a stock moving higher or lower. Many stocks end up losing ground despite an earnings beat due to other factors that disappoint investors. Similarly, unforeseen catalysts help a number of stocks gain despite an earnings miss. That said, betting on stocks that are expected to beat earnings expectations does increase the odds of success. This is why it's worth checking a company's Earnings ESP and Zacks Rank ahead of its quarterly release. Make sure to utilize our Earnings ESP Filter  to uncover the best stocks to buy or sell before they've reported. Park City Group doesn't appear a compelling earnings-beat candidate. However, investors should pay attention to other factors too for betting on this stock or staying away from it ahead of its earnings release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Park City Group, Inc. (PCYG): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Wall Street expects a year-over-year decline in earnings on lower revenues when Park City Group (PCYG) reports results for the quarter ended June 2019. While this widely-known consensus outlook is important in gauging the company's earnings picture, a powerful factor that could impact its near-term stock price is how the actual results compare to these estimates.",
    "The earnings report, which is expected to be released on September 12, 2019, might help the stock move higher if these key numbers are better than expectations. On the other hand, if they miss, the stock may move lower.",
    "While management's discussion of business conditions on the   earnings call  will mostly determine the sustainability of the immediate price change and future earnings expectations, it's worth having a handicapping insight into the odds of a positive EPS surprise.",
    " Zacks Consensus Estimate ",
    "This software-as-a-service provider is expected to pos t quarterly earnings  of $0.04 per share in its upcoming report, which represents a year-over-year change of -42.9%.",
    "Revenues are expected to be $5.06 million, down 19.9% from the year-ago quarter.",
    " Estimate Revisions Trend ",
    "The consensus EPS estimate for the quarter has remained unchanged over the last 30 days. This is essentially a reflection of how the covering analysts have collectively reassessed their initial estimates over this period.",
    "Investors should keep in mind that the direction of estimate revisions by each of the covering analysts may not always get reflected in the aggregate change.",
    " Price, Consensus and EPS Surprise ",
    " Earnings Whisper ",
    "Estimate revisions ahead of a company's earnings release offer clues to the business conditions for the period whose results are coming out. This insight is at the core of our proprietary surprise prediction model -- the Zacks Earnings ESP  (Expected Surprise Prediction).",
    "The Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a more recent version of the Zacks Consensus EPS estimate. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.",
    "Thus, a positive or negative Earnings ESP reading theoretically indicates the likely deviation of the actual earnings from the consensus estimate. However, the model's predictive power is significant for positive ESP readings only.",
    "A positive Earnings ESP is a strong predictor of an earnings beat, particularly when combined with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold). Our research shows that stocks with this combination produce a positive surprise nearly 70% of the time  , and a solid Zacks Rank actually increases the predictive power of Earnings ESP.",
    "Please note that a negative Earnings ESP reading is not indicative of an earnings miss. Our research shows that it is difficult to predict an earnings beat with any degree of confidence for stocks with negative Earnings ESP readings and/or Zacks Rank of 4 (Sell) or 5 (Strong Sell).",
    " How Have the Numbers Shaped Up for Park City   Group? ",
    "For Park City Group, the Most Accurate Estimate is the same as the Zacks Consensus Estimate, suggesting that there are no recent analyst views which differ from what have been considered to derive the consensus estimate. This has resulted in an Earnings ESP of 0%.",
    "On the other hand, the stock currently carries a Zacks Rank of #3.",
    "So, this combination makes it difficult to conclusively predict that Park City Group will beat the consensus EPS estimate.",
    " Does Earnings Surprise History Hold Any Clue? ",
    "Analysts often consider to what extent a company has been able to match consensus estimates in the past while calculating their estimates for its future earnings. So, it's worth taking a look at the surprise history for gauging its influence on the upcoming number.",
    "For the las t report  ed quarter, it was expected that Park City Group would pos t earnings  of $0.06 per share when it actually produced earnings of $0.05, delivering a surprise of -16.67%.",
    "Over the last four quarters, the company has beaten consensus EPS estimates three times.",
    " Bottom Line ",
    "An earnings beat or miss may not be the sole basis for a stock moving higher or lower. Many stocks end up losing ground despite an earnings beat due to other factors that disappoint investors. Similarly, unforeseen catalysts help a number of stocks gain despite an earnings miss.",
    "That said, betting on stocks that are expected to beat earnings expectations does increase the odds of success. This is why it's worth checking a company's Earnings ESP and Zacks Rank ahead of its quarterly release. Make sure to utilize our Earnings ESP Filter  to uncover the best stocks to buy or sell before they've reported.",
    "Park City Group doesn't appear a compelling earnings-beat candidate. However, investors should pay attention to other factors too for betting on this stock or staying away from it ahead of its earnings release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:30:10"
}