{
  "url": "https://www.nasdaq.com/article/apple-might-launch-new-affordable-iphone-next-year-cm1207652",
  "title": "Apple Might Launch New Affordable iPhone Next Year - Nasdaq.com",
  "text": [
    "  Apple    's (NASDAQ: AAPL) unit volumes have been suffering in recent   years as upgrade cycles continue getting longer and longer while   prices climb higher and higher. The company stopped reporting   units for all of its major products within the past year,   presumably as part of a broader effort to get investors to focus   on the growing services business. Apple   discontinued the iPhone SE    about a year ago, which at $350 was the tech titan's most   affordable handset. A new affordable model may be coming next year.   The rumored model is expected to have a display similar to     the iPhone 8. Image source: Apple.makeArticleAd();  A successor to the SE The    Nikkei Asian Review     reports that Apple is planning a low-cost iPhone model for early   next year. The company is not expected to use the same chassis as   the iPhone SE, which had been recycled from the iPhone 5 while   including newer specs like a faster processor. It's not clear   what Apple might call the rumored device or how it will be   priced, but the smartphone is considered a spiritual successor to   the iPhone SE, according to the report. The affordable model is expected to have a 4.7-inch display   like the one found on the iPhone 8, and will include many of the   same components that will be inside the 2019 flagships. In order   to cut costs, the display will use traditional LCDs instead of   OLEDs, which are more expensive. Putting newer components into   older models helps Apple get even more mileage out of its   industrial designs, particularly as much of that manufacturing   infrastructure remains in place at partner facilities. Apple will likely target emerging markets with the new   entry-level iPhone, as the company continues to struggle in huge   markets like India. The Cupertino   tech giant    recently discontinued some of its most affordable iPhones in that   country, effectively raising the entry-level price in a   bizarre move    . Apple has also been trying to absorb foreign exchange   fluctuations in order to maintain stable local pricing in   emerging markets, which has helped support demand. \"We're seeing positive customer response to recent pricing   actions in certain emerging markets, as well as enhancements to   our trade-in and financing programs and our year-over-year   performance improved relative to our December quarter results in   Greater China, in the Americas, and in Japan,\" CFO Luca Maestri   said in April. Midrange pricing worked for Google  Alphabet    (NASDAQ: GOOG) (NASDAQ: GOOGL) subsidiary Google launched its   midrange Pixel 3a earlier this year with much fanfare. That $400   device (the same price where the iPhone SE had launched in 2016   before falling to $350) was heralded as offering the   best camera in that pricing segment. As a result, Google's   smartphone shipments more than doubled in the second quarter. \"By taking advantage of our leading software capabilities, we   can offer users a premium phone experience at a much lower price   point,\" CEO Sundar Pichai said in July. \"With the launch of Pixel   3a in May, overall Pixel unit sales in Q2 grew more than 2x   year-over-year.\" An affordable iPhone could help Apple's unit volumes similarly   bounce back.   10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       Suzanne Frey, an executive at Alphabet, is a member of The     Motley Fool's board of directors.     Evan Niu, CFA      owns shares of Apple. The Motley Fool owns shares of and     recommends Alphabet (A shares), Alphabet (C shares), and Apple.     The Motley Fool has the following options: long January 2020     $150 calls on Apple and short January 2020 $155 calls on Apple.     The Motley Fool has a     disclosure policy      .  ",
    " Apple    's (NASDAQ: AAPL) unit volumes have been suffering in recent   years as upgrade cycles continue getting longer and longer while   prices climb higher and higher. The company stopped reporting   units for all of its major products within the past year,   presumably as part of a broader effort to get investors to focus   on the growing services business. Apple   discontinued the iPhone SE    about a year ago, which at $350 was the tech titan's most   affordable handset.",
    "A new affordable model may be coming next year.",
    "  The rumored model is expected to have a display similar to     the iPhone 8. Image source: Apple.makeArticleAd(); ",
    "The rumored model is expected to have a display similar to     the iPhone 8. Image source: Apple.",
    "The    Nikkei Asian Review     reports that Apple is planning a low-cost iPhone model for early   next year. The company is not expected to use the same chassis as   the iPhone SE, which had been recycled from the iPhone 5 while   including newer specs like a faster processor. It's not clear   what Apple might call the rumored device or how it will be   priced, but the smartphone is considered a spiritual successor to   the iPhone SE, according to the report.",
    "The affordable model is expected to have a 4.7-inch display   like the one found on the iPhone 8, and will include many of the   same components that will be inside the 2019 flagships. In order   to cut costs, the display will use traditional LCDs instead of   OLEDs, which are more expensive. Putting newer components into   older models helps Apple get even more mileage out of its   industrial designs, particularly as much of that manufacturing   infrastructure remains in place at partner facilities.",
    "Apple will likely target emerging markets with the new   entry-level iPhone, as the company continues to struggle in huge   markets like India. The Cupertino   tech giant    recently discontinued some of its most affordable iPhones in that   country, effectively raising the entry-level price in a   bizarre move    . Apple has also been trying to absorb foreign exchange   fluctuations in order to maintain stable local pricing in   emerging markets, which has helped support demand.",
    "\"We're seeing positive customer response to recent pricing   actions in certain emerging markets, as well as enhancements to   our trade-in and financing programs and our year-over-year   performance improved relative to our December quarter results in   Greater China, in the Americas, and in Japan,\" CFO Luca Maestri   said in April.",
    " Alphabet    (NASDAQ: GOOG) (NASDAQ: GOOGL) subsidiary Google launched its   midrange Pixel 3a earlier this year with much fanfare. That $400   device (the same price where the iPhone SE had launched in 2016   before falling to $350) was heralded as offering the   best camera in that pricing segment. As a result, Google's   smartphone shipments more than doubled in the second quarter.",
    "\"By taking advantage of our leading software capabilities, we   can offer users a premium phone experience at a much lower price   point,\" CEO Sundar Pichai said in July. \"With the launch of Pixel   3a in May, overall Pixel unit sales in Q2 grew more than 2x   year-over-year.\"",
    "An affordable iPhone could help Apple's unit volumes similarly   bounce back.",
    "  10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " Suzanne Frey, an executive at Alphabet, is a member of The     Motley Fool's board of directors.     Evan Niu, CFA      owns shares of Apple. The Motley Fool owns shares of and     recommends Alphabet (A shares), Alphabet (C shares), and Apple.     The Motley Fool has the following options: long January 2020     $150 calls on Apple and short January 2020 $155 calls on Apple.     The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:08:00"
}