{
  "url": "https://www.nasdaq.com/article/boeing-news-ba-stock-dives-on-latest-737-max-delay-cm1206991",
  "title": "Boeing News: BA Stock Dives on Latest 737 Max Delay - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Boeing news for Tuesday about another possible delay to the 737 Max coming back has BA stock down.",
    "According to recent reports, Boeing (NYSE: BA ) may not be able to get the 737 Max line back in the sky for the holidays. That would be a major hit to the company as it would cause disruptions throughout one of the most busy times of the year.",
    "So what's the reason behind this Boeing news. It looks like regulators with the Federal Aviation Administration (FAA) aren't happy with Boeing. Reports claim that the company hasn't been working well with the FAA when it comes to getting approval for the return of the 737 Max.",
    "The FAA does note that there isn't a timeline in place for when the 737 Max will come back. Instead, it is just focusing on making sure Boeing makes the appropriate changes to the aircraft. Some airlines believe the issues could keep the 737 Max on the ground until 2020, reports CNBC .",
    "The Boeing 737 Max was grounded following two fatal crashes involving the aircraft. That includes one that took place in March. Ethiopian Airline was using the plane that crashed then and it happened shortly after the plane took off. This saw all of the 157 people on board the plane die as a result.",
    "BA stock was down 3% as of Tuesday afternoon. However, the stock is still up 12% since the start of the year.",
    "As of this writing, William White did not hold a position in any of the aforementioned securities.",
    "The post Boeing News: BA Stock Dives on Latest 737 Max Delay appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:15:45"
}