{
  "url": "https://www.nasdaq.com/article/zackscom-featured-highlights-include-acm-k12-vapotherm-equity-commonwealth-and-columbus-mckinnon-cm1208136",
  "title": "Zacks.com featured highlights include: ACM, K12, Vapotherm, Equity Commonwealth and Columbus McKinnon - Nasdaq.com",
  "text": [
    "For Immediate Release",
    "Chicago, IL - September 5, 2019 - Stocks in this week's article are ACM Research, Inc.ACMR , K12 Inc.LRN , Vapotherm, Inc.VAPO , Equity CommonwealthEQC and Columbus McKinnon Corp.CMCO .",
    "New Analyst Coverage Puts the Spotlight on These 5 Stocks",
    "Coverage initiation on a stock by analyst(s) helps in interpreting information pertaining to capital markets, creating value for investors. Lack of information creates inefficiencies that might trigger misinterpretation of stocks (over- or under-valued).",
    "In fact, coverage initiation usually depicts increased investor inclination. Investors, on their part, often assume that there is something in the stock that has attracted analyst attention. In other words, they believe that the company coming under the microscope definitely has some value.\r\n Obviously, stocks are not arbitrarily chosen to cover. New coverage on a stock usually reflects an encouraging future envisioned by the analyst(s). At times, increased investor focus on a stock motivates analysts to take a closer look at it.",
    "Notably, the average change in broker recommendation is preferred over a single recommendation change.",
    "How Does Analyst Coverage Influence Stock Price?",
    "The price movement of a stock is generally a function of the recommendations on it from new analysts. Stocks typically see an upward price movement with a new analyst coverage compared to what they witness with a rating upgrade under an existing coverage. Positive recommendations - Buy and Strong Buy - generally lead to a significantly more positive price reaction than Hold recommendations. On the contrary, analysts hardly initiate coverage with a Strong Sell or Sell recommendation.",
    "Now, if an analyst gives a new recommendation on a company that has very few or no existing coverage, investors start paying more attention to it. Also, any new information attracts portfolio managers to build a position in the stock.",
    "So, it's a good strategy to bet on stocks that have seen increased analyst coverage over the last few weeks.",
    "For the rest of this Screen of the Week article please visit Zacks.com at:https://www.zacks.com/stock/news/501338/new-analyst-coverage-puts-spotlight-on-these-5-stocks",
    "Disclosure: Officers, directors and/or employees of Zacks Investment Research may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material. An affiliated investment advisory firm may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material.",
    "About Screen of the Week",
    "Zacks.com created the first and best screening system on the web earning the distinction as the \"#1 site for screening stocks\" by Money Magazine.  But powerful screening tools is just the start. That is why Zacks created the Screen of the Week to highlight profitable stock picking strategies that investors can actively use.",
    "Strong Stocks that Should Be in the News",
    "Many are little publicized and fly under the Wall Street radar. They're virtually unknown to the general public. Yet today's 220 Zacks Rank #1 \"Strong Buys\" were generated by the stock-picking system that has more than doubled the market from 1988 through 2016. Its average gain has been a stellar +25% per year. See these high-potential stocks free >>.",
    "Follow us on Twitter:  http://twitter.com/zacksresearch",
    "Join us on Facebook:  http://www.facebook.com/ZacksInvestmentResearch",
    "Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.",
    "Contact: Jim Giaquinto",
    "Company: Zacks.com",
    "Phone: 312-265-9268",
    "Email: pr@zacks.com",
    "Visit: www.Zacks.com",
    "Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer .",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit http://www.zacks.com/performance  for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:44:00"
}