{
  "url": "https://www.nasdaq.com/article/why-globalstar-stock-zoomed-25-today-cm1210811",
  "title": "Why Globalstar Stock Zoomed 25% Today - Nasdaq.com",
  "text": [
    "  What happened  Shares of   small-cap    satellite communications company   Globalstar    (NYSEMKT: GSAT) closed 24.8% higher on Wednesday on no   discernible news -- and that's not really surprising. Fact is, Globalstar's stock price tends to hop around quite a   lot,   up one day    ,   down the next    , whether or not there's an obvious reason for moves.   Image source: Getty Images.makeArticleAd();   So what  Despite its respectable market capitalization of $700 million   and change, Globalstar is what we call a \"penny stock,\" with a   price well below $1 a share. As such, changes of just a few   pennies in its price can drive huge percentage gains and losses   in the stock. This fact makes the stock ripe for manipulation by momentum   investors, and also attracts more momentum investors to it when   they sense that the stock has begun moving one way or the other.   Even a 25% change in share price such as the one we saw today,   therefore, doesn't necessarily indicate that there's anything   real happening that could justify the move.  So what  Of course, it doesn't mean there is   no    explanation, either. For example, both Tuesday and Wednesday,   shares of   Maxar Technologies    made big moves in response to   a new buy rating from JPMorgan    . Given that both Maxar and Globalstar operate in the field of   space exploration and business, and that both stocks carry hefty   debt loads (albeit Maxar's is much heavier than Globalstar's), it   is possible investors were thinking, \"If Maxar can win an   upgrade, maybe Globalstar can too.\" So, perhaps some are positioning themselves to benefit if some   analyst comes along and   does    upgrade Globalstar stock. I suppose that could happen. Unlike   those momentum investors, though, I think I'll wait until I see a   compelling case for Globalstar before buying it hand over   fist. Patience is a virtue, and the early bird sometimes gets stuck   with a worm.   10 stocks we like better than Globalstar       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Globalstar wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Rich Smith      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   small-cap    satellite communications company   Globalstar    (NYSEMKT: GSAT) closed 24.8% higher on Wednesday on no   discernible news -- and that's not really surprising.",
    "Fact is, Globalstar's stock price tends to hop around quite a   lot,   up one day    ,   down the next    , whether or not there's an obvious reason for moves.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Despite its respectable market capitalization of $700 million   and change, Globalstar is what we call a \"penny stock,\" with a   price well below $1 a share. As such, changes of just a few   pennies in its price can drive huge percentage gains and losses   in the stock.",
    "This fact makes the stock ripe for manipulation by momentum   investors, and also attracts more momentum investors to it when   they sense that the stock has begun moving one way or the other.   Even a 25% change in share price such as the one we saw today,   therefore, doesn't necessarily indicate that there's anything   real happening that could justify the move.",
    "Of course, it doesn't mean there is   no    explanation, either. For example, both Tuesday and Wednesday,   shares of   Maxar Technologies    made big moves in response to   a new buy rating from JPMorgan    . Given that both Maxar and Globalstar operate in the field of   space exploration and business, and that both stocks carry hefty   debt loads (albeit Maxar's is much heavier than Globalstar's), it   is possible investors were thinking, \"If Maxar can win an   upgrade, maybe Globalstar can too.\"",
    "So, perhaps some are positioning themselves to benefit if some   analyst comes along and   does    upgrade Globalstar stock. I suppose that could happen. Unlike   those momentum investors, though, I think I'll wait until I see a   compelling case for Globalstar before buying it hand over   fist.",
    "Patience is a virtue, and the early bird sometimes gets stuck   with a worm.",
    "  10 stocks we like better than Globalstar       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Globalstar wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Globalstar       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Globalstar wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Rich Smith      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:59:00"
}