{
  "url": "https://www.nasdaq.com/article/australian-dollar-near-6week-highs-on-trade-hopes-nz-inches-up-20190911-00956",
  "title": "Australian dollar near 6-week highs on trade hopes, NZ$ inches up - Nasdaq.com",
  "text": [
    "By Swati Pandey",
    "SYDNEY, Sept 12 (Reuters) - The Australian dollar hovered near six-week highs on Thursday as risk assets got a fillip after U.S. President Donald Trump agreed to make a small concession in his trade war with China, while the kiwi edged up.",
    "The Australian dollar , a liquid proxy for risk, was last up 0.2% at $0.6875, not far from Wednesday's $0.6885 peak, the highest level since July 31.",
    "Thursday's gains came after Trump said he would delay a scheduled tariff hike on Chinese goods by two-weeks in October, ahead of their planned talks. ",
    "The news added to already upbeat mood after China on Wednesday exempted a basket of U.S. goods from its own tariffs.",
    "The thaw in hostilities sent the Chinese yuan  jumping 0.2% to 7.0861 in offshore trade, its highest in three weeks. The trade-exposed Korean won  hit a six-week peak of 1,185.67 per dollar. FRX/",
    "However, analysts warned against pricing in too much optimism.",
    "\"Despite the recent positive news flow, the two sides still appear to be far apart on some key points - above all, on intellectual property, where the Chinese are unlikely to make large concessions,\" Francesco Pesole, forex strategist at ING, said in a note.",
    "\"What's more, President Trump seems to be in no rush to reduce pressure on China just yet and he may not make a decisive move towards a trade deal before an economic slowdown becomes apparent.\"",
    "On Thursday, the Aussie jumped to a seven-week peak against the euro  and was on track for an eighth straight gain ahead of a highly anticipated rate decision by the European Central Bank (ECB) later in the day.",
    "The ECB is widely expected to lower its main deposit rate while all eyes will be on whether policymakers open the door to a new quantitative easing programme.",
    "Last week, by contrast, the Reserve Bank of Australia (RBA) left its key rate at 1% after back-to-back cuts in June and July. Financial markets are pricing in another cut later this year. 0#YIB:",
    "The New Zealand dollar  was up 0.1% at $0.6423 at 0140 GMT. The kiwi hit a one-month top of $0.6444 this week and has since flirted with that level, staying in tight ranges.",
    "New Zealand government bonds 0#NZTSY= slipped in line with Treasuries, sending yields about 2-3 basis points higher across the curve.",
    "Australian government bond futures eased, with the three-year bond contract  down 1.5 ticks at 99.11. The 10-year contract  fell 1.75 ticks to 98.84."
  ],
  "published_datetime": "2019-09-11 10:11:00"
}