{
  "url": "https://www.nasdaq.com/article/notable-wednesday-option-activity-kmb-wmt-out-cm1207507",
  "title": "Notable Wednesday Option Activity: KMB, WMT, OUT - Nasdaq.com",
  "text": [
    "Looking at  options trading  activity among components of the Russell 3000 index, there is noteworthy activity today in Kimberly-Clark Corp. (Symbol: KMB), where a total volume of 7,675 contracts has been traded thus far today, a contract volume which is representative of approximately 767,500 underlying shares (given that every 1 contract represents 100 underlying shares). That number works out to 54.5% of KMB's average daily trading volume over the past month, of 1.4 million shares. Especially high volume was seen for the $125 strike call option expiring October 18, 2019  , with 1,472 contracts trading so far today, representing approximately 147,200 underlying shares of KMB. Below is a chart showing KMB's trailing twelve month trading history, with the $125 strike highlighted in orange:       makeArticleAd();    Walmart Inc (Symbol: WMT) saw options trading volume of 38,779 contracts, representing approximately 3.9 million underlying shares or approximately 54.4% of WMT's average daily trading volume over the past month, of 7.1 million shares. Especially high volume was seen for the $120 strike call option expiring November 15, 2019  , with 8,858 contracts trading so far today, representing approximately 885,800 underlying shares of WMT. Below is a chart showing WMT's trailing twelve month trading history, with the $120 strike highlighted in orange:       And OUTFRONT Media Inc (Symbol: OUT) saw options trading volume of 5,031 contracts, representing approximately 503,100 underlying shares or approximately 54.4% of OUT's average daily trading volume over the past month, of 925,230 shares. Especially high volume was seen for the $25 strike call option expiring September 20, 2019  , with 2,501 contracts trading so far today, representing approximately 250,100 underlying shares of OUT. Below is a chart showing OUT's trailing twelve month trading history, with the $25 strike highlighted in orange:         For the various different available expirations for KMB options  , WMT options  , or OUT options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 03:25:45"
}