{
  "url": "https://www.nasdaq.com/article/is-teslas-new-insurance-a-game-changer-for-tsla-stock-cm1207487",
  "title": "Is Tesla’s New Insurance a Game Changer for TSLA Stock? - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "The decision by Tesla (NASDAQ: TSLA ) to offer insurance on its own vehicles, starting in California, has created more buzz than may be warranted.",
    "While Tesla's cars are a curiosity in most of the country, they're common in California. Electric vehicles represent almost 8% of the market , and Tesla accounts for more than half that figure. Its Model 3 is the third best-selling car in the whole state, behind only Honda's (NYSE: HMC ) Civic and Toyota's (NYSE: TM ) Camry.",
    "By the end of 2018, Tesla had sold 532,000 cars and almost half were less than a year old. The average Model 3 owner is 46 - although average ages of Model X and Model S owners are 52 and 54, respectively. The company says Tesla cars registered accidents once every 1.76 million miles, 2.87 million with the autopilot engaged. That's against an industry average of one accident per 436,000 miles.",
    "Sounds like good odds to me.",
    "Drivers on one Tesla forum say their insurance costs differ.ValuePenguin estimates the cost of insuring a Tesla at about $2,450 per year , or $200 per month. Tesla claims its rates will be about 20% below those of competitors .",
    "This means if Tesla can get half its California owners to buy its insurance, it could bring in $500 million in cash over a year. The resulting business would still be tiny measured against the whole company. Tesla's batteries and solar panels currently bring in about $1.4 billion per year, according to the latest quarterly report .",
    "The question then becomes whether Tesla can make a profit on its insurance. The company has an enormous amount of data on its drivers , but that's not unusual. Many insurance companies offer to collect data on drivers in the name of low rates. Since Tesla is only offering policies in a state where it has significant market share, it can deliver parts and expertise easily to customers. It already has 28 service centers in California .",
    "Tesla could be a competitive player then, at least in California. Grabbing a bigger chunk of its loyal customers' business would be a small boost to the top line and, over time, to the bottom line as well.",
    "Warren Buffett is the CEO of Berkshire Hathaway (NYSE: BRK.A , NYSE: BRK.B ), which owns Geico . He was skeptical when Tesla CEO Elon Musk first discussed insurance in April . He compared car companies selling insurance to insurance companies selling cars.",
    "Geico has 13% of the U.S. auto insurance market, writing $29.6 billion worth of policies per year on about 24 million vehicles. It's geared up to handle that business. Tesla isn't a threat to Geico, or any of the other large insurers. Even if every Tesla owner in California switched to Tesla's insurance, the company's share of the U.S. car insurance market would be less than 0.5%.",
    "So why has the move drawn so much commentary , especially skeptical commentary? The answer to that question is simple: it's Tesla. If Elon Musk announces a new cup holder, it draws headlines.",
    "The bottom line on this announcement is that there's not much bottom line.",
    "Insurance isn't going to be a huge business for Tesla, and Tesla is not going to be a big factor in the insurance business.",
    "Tesla next reports earnings on Oct. 23. Analysts expect a loss of $1.40 per share, on revenue of $6.6 billion. That's about 10% more revenue than last quarter, and less than a year ago.",
    "That's what analysts are looking at and that's why the shares, while down 32% so far in 2019, still look overpriced. If Tesla wants to make shareholders happy, it needs to make more cars.",
    "Dana Blankenhornis a financial and technology journalist. He is the author of the mystery thriller, The Reluctant Detective Finds Her Family, available at the Amazon Kindle store. Write him at danablankenhorn@gmail.comor follow him on Twitter at @danablankenhorn . As of this writing he owned no shares in companies mentioned in this article.",
    "The post Is Tesla's New Insurance a Game Changer for TSLA Stock? appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:34:58"
}