{
  "url": "https://www.nasdaq.com/article/ex-dividend-reminder-vfc-mgm-resorts-international-and-cbs-cm1207799",
  "title": "Ex-Dividend Reminder: VFC, MGM Resorts International and CBS - Nasdaq.com",
  "text": [
    "Looking at the universe of stocks we cover at Dividend Channel  , on 9/9/19, VF Corp. (Symbol: VFC), MGM Resorts International (Symbol: MGM), and CBS Corp (Symbol: CBS) will all trade ex-dividend for their respective upcoming dividends. VF Corp. will pay its quarterly dividend of $0.43 on 9/20/19, MGM Resorts International will pay its quarterly dividend of $0.13 on 9/16/19, and CBS Corp will pay its quarterly dividend of $0.18 on 10/1/19. As a percentage of VFC's recent stock price of $84.90, this dividend works out to approximately 0.51%, so look for shares of VF Corp. to trade 0.51% lower - all else being equal - when VFC shares open for trading on 9/9/19. Similarly, investors should look for MGM to open 0.47% lower in price and for CBS to open 0.43% lower, all else being equal.    Below are dividend history charts for VFC, MGM, and CBS, showing historical dividends prior to the most recent ones declared.   VF Corp. (Symbol: VFC)  :   makeArticleAd();    MGM Resorts International (Symbol: MGM)  :        CBS Corp (Symbol: CBS)  :         In general, dividends are not always predictable, following the ups and downs of company profits over time. Therefore, a good first due diligence step in forming an expectation of annual yield going forward, is looking at the history above, for a sense of stability over time. This can help in judging whether the most recen t dividends  from these companies are likely to continue. If they do continue, the current estimated yields on annualized basis would be 2.03% for VF Corp., 1.87% for MGM Resorts International, and 1.72% for CBS Corp.    In Thursday trading, VF Corp. shares are currently up about 3.4%, MGM Resorts International shares are up about 1.3%, and CBS Corp shares are up about 0.6% on the day.   Click here to learn which 25 S.A.F.E. dividend   stocks should be on your radar screen »  ",
    "  Click here to learn which 25 S.A.F.E. dividend   stocks should be on your radar screen » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:02:44"
}