{
  "url": "https://www.nasdaq.com/article/longdated-euro-zone-bonds-sell-off-as-risk-appetite-bounces-back-20190905-00706",
  "title": "Long-dated euro zone bonds sell off as risk appetite bounces back - Nasdaq.com",
  "text": [
    "By Tommy Wilkes and Yoruk  Bahceli",
    "LONDON, Sept 5 (Reuters) - A selloff gripped euro zone bond markets on Thursday, led by longer-dated bonds, on signs of progress in resolving the U.S.-China trade war and doubts about whether an ECB stimulus package next week can match expectations.",
    "After a strong price rally in August, bonds have stumbled in recent days, pushing yields sharply higher across the board.",
    "On Thursday, China's commerce ministry said Beijing and the United States agreed to hold high-level trade talks in early October in Washington, easing fears that the escalating trade war will trigger a global recession. ",
    "\"The bid for safe havens had flattened (yield) curves, and now this is being modestly retraced, although these are big moves on the day,\" said Richard McGuire, head of rates strategy at Rabobank.",
    "Longer-dated 30-year bonds, which lead the debt market rally last month, were left nursing heavy losses.",
    "Thirty-year euro zone bond yields were 13-14 bps higher on the day , , with Germany's 30-year yield  soaring to -0.03% and set for its biggest daily jump since 2015.",
    "Germany's 10-year bond yield, up 9 bps at -0.59% , was set for its biggest one-day jump in over a year.",
    "Strong U.S. data, more than 14 billion euros of new debt supply from France and Spain, and comments this week from ECB officials playing down the need for aggressive stimulus at next Thursday's policy meeting all weighed on the market, analysts said. ",
    "\"Investors are a little bit concerned that the ECB won't act as expansionary as expected,\" said Daniel Lenz, a rates strategist at DZ Bank.",
    "Lenz noted that this week's ECB comments fit into a pattern of policymakers raising expectations, before dampening them in the weeks preceding a meeting to give themselves room not to disappoint on the day.",
    "Italian bond yields also rose after falling all week as investors welcomed the formation of a government that could prove to be more fiscally responsible than the last.",
    "The 10-year Italian yield rose 10 bps to 0.92% , off Wednesday's record low of 0.803%. Italy's 50-year yield  echoed other longer-dated bonds, up 20 bps at 2.31%.",
    "DZ Bank targets the Italian/German 10-year bond yield spread at 120 bps - 30 bps lower than current levels .",
    "However, the picture for Italian government bonds (BTPs) could quickly turn if the ECB's stimulus package underwhelms on Sept. 12, as Italy is expected to see the biggest impact from a large stimulus package.",
    "\"What makes BTPs vulnerable to me is that some ECB members are unwilling to re-open quantitative easing. As we broke below 150 bps (on the spread) yesterday, it makes sense to have some profit-taking,\" said Natixis fixed income strategist Cyril Regnat."
  ],
  "published_datetime": "2019-09-05 09:58:00"
}