{
  "url": "https://www.nasdaq.com/article/jinkosolar-holding-co-ltd-jks-q2-2019-earnings-call-transcript-cm1206876",
  "title": "JinkoSolar Holding Co., Ltd (JKS) Q2 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "Image source: The Motley Fool.",
    "JinkoSolar Holding Co., Ltd (NYSE: JKS)\r\n Q2 2019 Earnings Call\r\n Aug. 30, 2019 , 8:00 a.m. ET",
    "Operator",
    "Ladies and gentlemen, welcome to the Quarter Two of 2019 JinkoSolar Earnings Conference Call. At this time, all participants are in a listen-only mode. [Operator Instructions]",
    "I would now like to have the conference over to your speaker today, Ms. Ripple Zhang. Thank you. Please go ahead.",
    "Ripple Zhang -- Investor Relations",
    "Thank you, operator. Thanks everyone for joining us today for JinkoSolar second quarter 2019 earnings conference call . The Company's results were released earlier today and available on the Company's IR website at www.jinkosolar.com as well as on Newswire services. We have also provided a supplemental presentation for today's earnings call , which can also be found on the IR website.",
    "On the call today from JinkoSolar are Mr. Chen Kangping, Chief Executive Officer; Mr. Charlie Cao, Chief Financial Officer; and Mr. Gener Miao, Chief Marketing Officer. Mr. Chen will discuss JinkoSolar's business operations and Company highlights, followed by Mr. Miao, who will talk about the sales and marketing; and then Mr. Cao, who will go through the financials. They will all be available to answer your questions during the Q&A session that follows.",
    "Please note that today's discussion will contain forward-looking statements made under the safe harbor provisions of the US Private Securities Litigation Reform Act of 1995. Forward-looking statements involve inherent risks and uncertainties. As such, our future results may be materially different from the views expressed today. Further information regarding these and other risks is included in JinkoSolar's public filings with the Securities and Exchange Commission. JinkoSolar does not assume any obligation to update any forward-looking statements, except as required under the applicable law.",
    "It's now my pleasure to introduce Mr. Chen Kangping, CEO of JinkoSolar. Mr. Chen will speak in Mandarin, and I will translate his comments into English. Please go ahead, Mr. Chen.",
    "Kangping Chen -- Chief Executive Officer and Director",
    "[Foreign Speech] Thank you, Ripple. Good morning, and good evening to everyone, and thank you for joining us today. [Foreign Speech] We continued our strong start to the year with a robust quarter growth. Module shipments during the second quarter were 3,386 megawatt, an increase of 12% sequentially and 21% year-over-year. As with last quarter, overseas shipments accounted for over 90% of total shipments. Total revenues came in $1 billion, an increase of 19% sequentially and 14% year-over-year. While gross margins roughly flat sequentially at 16.5% and up substantially from 12% during the same quarter last year. Non-GAAP net income surged to $29.6 million, a significant increase from $5 million last quarter and $16.1 million during the same period last year. With our mono wafer production capacity growing and optimization of cost structure, we are confident in the overall profitability of the second half of the year.",
    "[Foreign Speech] Demand for overseas markets were strong during the first half of 2019 where total export volumes and the value of modules from China jumped significantly year-over-year. China is expected to drive global demand following the July announcement of the National Development and Reform Commission and the National Energy Administration of a list of approved solar projects that secured government subsidies for 2019. This was a follow-up to their May announcement of the first batch of wind power and the PV grid parity project. China is expected to install 40 gigawatt this year. Bids for UHV supported PV projects have already begun as the domestic market regains growth momentum.",
    "We are rapidly approaching grid parity with the better results for projects such as Dalat [Phonetic] Top Runner project in Neihuang province, coming in on power with local traditional energy. Based on this, we expected China's demand will continue to grow steadily in 2020.",
    "[Foreign Speech] 2019 is a milestone for the global solar industry as grid parity rapidly approaches. A number of emerging overseas markets are quickly reaching gigawatt levels as the market increasingly diversifies away from traditional mature markets. The costs of PV power continues to decline, resulting in lower bidding prices, which are increasingly becoming more competitive with thermal power generation, driven by technological innovation. We expected a proportion of PV grid parity project to increase over the next few years. We are optimistic that global demand will remain strong and is sustainable over the long term.",
    "[Foreign Speech] I will let Gener give you more color on the market later. [Foreign Speech] We significantly increased our investment in expanding our high efficiency mono production capacity during this quarter. This is mainly being driven by our production facility in Leshan, which begun phase 1 production at the end of June and is expected to reach full capacity in the fourth quarter and will expand our total mono wafer capacity to 11.5 gigawatt. Preparations for the 5 gigawatt phase 2 capacity expansion in Leshan were currently under way. The rapid growing of mono wafer production capacity can significantly increase the proportion of overall in-house integrated capacity and improve gross margin.",
    "[Foreign Speech] Our in-house high efficiency annual silicon wafer solar cell and solar module production capacity has reached 10.5 gigawatt, 7.4 gigawatt, and 12.6 gigawatt, respectively by the end of the second quarter of 2019, which include 6.5 gigawatt of mono wafer capacity and 5.8 gigawatt of PERC cell capacity. By the end of 2019, we expect our in-house annual silicon wafer, solar cell and solar module production capacity to reach 15 gigawatt, 10.5 gigawatt, and 16 gigawatt respectively, which includes 11.5 gigawatt of mono capacity, 9.7 gigawatt of PERC cell capacity and 500 megawatt of N-type cell capacity.",
    "[Foreign Speech] We believe that the only way forward is to continue investing in the technical development and optimization -- optimizing the cost structure. Our expanded capacity provides us with a significant competitive advantage when it comes to the performance of our equipment, automation, levels and extendable thermal fields which perform well in product qualified rate and oxygen content index in the industry, while the latest sale improvements has been on the highly efficient N-type cells with 800 megawatt capacity and Hydride Oxide Thin Film technology. For modules, our latest innovative product in the Swan bifacial module with a DuPont Tedlar-based backsheet. The new lightweight bifacial technology has huge potential to go mainstream, because it was not -- not only alleviate installation problems and lowest cost per kilowatt of electricity generated. But also improve the efficiency of the modules and overall power generation, especially for PV power plants.",
    "[Foreign Speech] To conclude, I'm very pleased with the significant progress we have made during the quarter in strengthening our competitive advantages, improving the efficiency of our products and driving costs lower through innovation, especially at a time when the industry is racing toward great parity as one of the largest and the most innovative solar module manufacturers in the world. We are committed to serving our clients with the highest quality products on the market. We will continue to listen to the needs of our clients and grow our market share in the domestic and overseas markets. With our global distribution network and the support teams working closely together, we will continue to drive growth in the area of grid parity.",
    "[Foreign Speech] Before turning the call over to Gener, I will quickly go over our guidance. Based on current estimates, for the third quarter of 2019, the Company estimates total solar module shipments to be in the range of 3.2 gigawatt to 3.5 gigawatt. Total revenue for the third quarter is expected to be in the range of $980 million to $1,070 million. Gross margin for the third quarter is expected to be between 19% to 20%. For the full year of 2019, the Company estimates total solar module shipments to be in the range of 14 gigawatt to 15 gigawatt.",
    "[Foreign Speech] Thank you, Ripple. With that, I would turn it over to Gener.",
    "Gener Miao -- Chief Marketing Officer",
    "Thank you, Mr. Chen. Total shipments in the second quarter were 3,386 megawatt, an increase of 21.2% from the same period last year and exceeding our previous guidance. The increase was driven non-China demand, which remained strong during the quarter. In particular, mono PERC products as a percentage of total shipments continue to grow steadily, and I expect it to reach 70% for the full year of 2019.",
    "In terms of geographic mix, overseas shipments accounted for over 90% of our order book this quarter. With China's latest subsidy policy announcement in July, the Chinese market is expected to regain considerable installation demand starting in late third quarter. The Chinese government's July release -- July release of a list of approved solar projects that secured government subsidy for 2019 has helped to kick-start bids for a number of projects that are expected to simultaneously drive domestic demand and grow in our shipments in China, starting in September.",
    "China is expected to install around 40 gigawatts this year. We also expect that the Chinese market to retain its robust performance well into 2022 due as a number of cross-year projects and the competitiveness of photovoltaic power generation price. The US market remains very strong. Prices have risen in the past quarter, which has resulted in our modules almost selling out.",
    "In addition, our order book for 2020 is rapidly filling up. We have already received the massive inquiries for 2020 and 2021 deliveries from US market. Furthermore, Section 201 tariff exemptions on bifacial solar modules has created a lot of discussions in the market. Based on the current policy, we expect that demand in the US market will start to shift toward bifacial modules steadily where utility sector will be penetrated first.",
    "Turning to Asia Pacific market. In reaction to the cost of the curve [Phonetic], large installations across Japan's largest -- large scale power plants are expected to continue until late 2020. In Vietnam, although some projects in Ninh Thuan province have been postponed, we expect the Ministry of Industry and Trade of Vietnam to release a new distributed subsidy policy version. After such announcements, industrial and commercial distribution will rapidly increase in the Vietnamese market.",
    "In Australia, residential subsidies of Victoria state are being kept in place, which helped to revive the market, driving further growth in the next two years for all residential, commercial and industrial projects. Over in India, the recent PV targets came in larger than expected. The government has indicated that it will provide assistance for larger scale PV grid connected projects, while utility companies are also issuing tenders for all global developers and its investors.",
    "With the cancellation of MIP across European markets PV power generation costs will continue to decline. With the percentage of a grid parity projects continuing to grow, European PV capacity is increasing and expected to drive demand in the market such as France, Germany, Spain and Greece during the second half of this year.",
    "Portugal's [Phonetic] recent PV bids have seen the lowest pricing in Europe, and in order to achieve its renewable energy targets and keep pace with EU energy conservation and the emission targets, PV bidding will continue for the rest of this year. With more and more traditional power stations being decommissioned each year, the importance of solar energy is expected to rise in Europe with the benefits of long-term cost advantages. We are very optimistic about the future growth potential of European markets.",
    "For key emerging markets. The private PPA and the commercial projects are driving the growth, especially in Mexico and Chile. Brazil is expected to continue promoting solar tenders, always medium and the long term. Argentina recently released a new subsidy policy, which is expected to drive medium term installation demand in Latin America. In Middle East, PV biddings have been in full swing this year, with all of our hard demand growing strongly. Saudi Arabian market will soon be upgraded to gigawatt level, while Oman has released the next four large scale PV biddings planned for 2020.",
    "We are the market leader in terms of market share in number of these countries. And we'll continue to invest the resources to explore more long-term growth and the cooperation opportunities. In general, as grid parity becomes a reality. Demand will increasingly become sustainable globally and will be less susceptible to fluctuations caused by policy changes. Therefore, we expect the total global installation demand to continue growing in the future.",
    "ASPs overall increased slightly compared to the last quarter. We also expect average annual prices to remain healthy. We will continue to drive technology innovation to meet market demand with reliable high quality products. Our products were sold over 100 countries globally and we remain the largest solar module supplier in the world. Over the years, we continue to be rejuvenated for our leading technology and reliable high quality products by respected third-party [Phonetic] institutions and industry groups.",
    "After an extensive analysis on the global solar PV market, we were awarded the Frost & Sullivan 2019 Global Solar PV Technology Leadership Award. Our dedicated efforts to improve our high quality products were also recognized by PV tech and the solar media who selected include JinkoSolar as a leading supplier to achieve a AA bankability rating. JinkoSolar is the only PV module supplier to have AA ratings for the past five consecutive quarters. This year JinkoSolar continue to move up the rankings as we hit new milestones, ranking 150th among the top 500 Chinese private enterprises in 2019 up from 279 last year.",
    "As a key opinion leader in the industry, we were much wondered to be the only privately owned corporate thought leader from the renewable energy sector invited to participate in the 2019 Summer Davos Forum on energy panel titled China's Energy Outlook. During the second quarter we attended 12 trade shows and participated in 40 street conferences worldwide. We also hosted 16 customer events and 54 co-marketing activities with key partners across the globe. Our marketing efforts continue to enhance JinkoSolar's brand awareness and reputation in the global PV industry.",
    "With that, I will pass over to Charlie.",
    "Charlie Cao -- Chief Financial Officer",
    "Thank you, Gener. Q2 overall results meet our expectations. We have achieved better-than-expected shipments on gross margin. Our improved profitability resulted from lower production costs, slightly higher ASPs and the net foreign exchange gain. Total solar module shipments hit 3.4 gigawatts, up 12% sequentially, and total revenue was $1 billion, up 19% sequentially. The solar market continued its strong momentum and we are on the track to achieve our full year shipment guidance.",
    "Total gross margin was stable at 16.5%, compared to 16.6% in Q1. Our investment on the mono based high-efficient capacity is expected to generate higher gross margins in the second half year. Starting from this quarter, we began to provide additional guidance including quarterly revenue and the gross margin range. With our view on future performance, we believe this will provide a more transparent and comprehensive picture of our operations and future growth expectations.",
    "For the third quarter, we estimate total revenue to be in the range of $980 million to $1.07 billion, and gross margin in the range of 18% to 20%. Total operating expenses accounted for 12.8% of total revenue compared to 12.5% in Q1. The percentage is relatively higher given our high shipping costs -- relatively higher shipping costs from oversea markets. We benefited from RMB depreciating against the US dollar in the second quarter. Net foreign exchange gain was $7 million compared to our net foreign exchange loss of $9 million in Q1. EBITDA was $66 million compared to $49 million in Q1. Non-GAAP net income was $29.6 million. This translates into non-GAAP diluted earnings per ADS of $0.72 -- $0.71.",
    "Moving to the balance sheet. At the end of Q2, we increased our balance of cash, cash equivalents to $543 million compared to $486 million at the end of Q1. The restricted cash balance was $158 million at the end of Q2, compared to $164 million at the end of Q1. We continue to improve our operating efficiency, accounts receivable was $809 million, down from $872 million at the end of Q1.",
    "AR turnover days improved to 76 days in Q2, compared to 94 days in Q1. Inventory balance was flat at $966 million quarter-over-quarter. Inventory turnover days reduced to 104 days in the second quarter compared to 120 days in Q1. Total debt was $1.9 billion to $1.8 billion at the end of Q1, in which $310 million was related to international solar project. Net debt was $1.2 billion compared to $1.1 billion at the end of Q1. The increase was due to the issuance of convertible senior notes in the second quarter.",
    "This concludes our prepared remarks. We are now happy to take your questions. Operator? Operator, we would like to take questions.",
    "Operator",
    "Thank you. Ladies and gentlemen, we will now begin the question-and-answer session. [Operator Instructions] Your first question is from Philip Shen from Roth Capital Partners. Please go ahead.",
    "Irwin Teg -- Roth Capital Partners -- Analyst",
    "Hi, this is Irwin Teg [Phonetic]. I'm on for Philip today. Hope you guys are doing well. My first question is from Q1, you thought that 60% of your Q1 shipments were for non-subsidized project and as much as 50% of 2019 shipments could be for non-subsidized demand. How much of your Q2 shipments do you believe serve on subsidized markets? And what's your latest view for second half 2019 and possibly 2020?",
    "Charlie Cao -- Chief Financial Officer",
    "I think you are talking about, you know, the market without subsidy, right, grid parity. And the...",
    "Irwin Teg -- Roth Capital Partners -- Analyst",
    "Quite exactly.",
    "Charlie Cao -- Chief Financial Officer",
    "I think the trend is there, you know, the story is becoming more and more competitive and the most other regions are reaching to the grid parity markets. And back to your specific question. If you take China and Japan as subsidy supported market this year and we think our shipment quarter-by-quarter, the shipments ratings without subsidy increased step by step. And the second quarter, roughly 70% to 80%. And then looking to next year, China will be the biggest region to reaching grid parities. And this year we estimate China roughly 10% is projects without subsidy. And next year and with the government policy supported and the lower system costs. And we believe it's -- will be a huge lift next year in China for the projects without subsidy.",
    "Irwin Teg -- Roth Capital Partners -- Analyst",
    "Okay. Thank you. My next question is, what is your latest view of China demand in Q1 and Q2 for 2020? Have you heard when the government may release its next subsidy regime? And what do you think it looks like?",
    "Charlie Cao -- Chief Financial Officer",
    "Yes. For China market, as we said just now, China market will continue to be strong, not only in the second half 2019, but also in the 2020. So one part is there will be a lot of projects naturally and they'll continue to construct and try to get a grid connection in the first half of 2020. Meanwhile, there will -- there are a lot of -- let's say, projects in the plan, which is grid parity projects, and should be expected to be constructed by the year 2020. Regarding the rumors of the new schemes, we have heard of several versions of it, but I think we should wait for the official announcement.",
    "Irwin Teg -- Roth Capital Partners -- Analyst",
    "Okay, fair enough. And then my last question, and I'll pass it on. Last quarter you mentioned capex throughout the year was going to be about $450 million. We calculate about $212 million for the back half of 2019. Can you give me some more color on the capex for Q3 and Q4? Thank you.",
    "Charlie Cao -- Chief Financial Officer",
    "I think the total capex this year. You're right, roughly $450 million. And we have spended, I think roughly 50% of the total capex. And no, the remaining part, 50% will be spread over third quarter and fourth quarter. And our capacity actually, for both mono wafer capacity and PERC capacity are in the ramping up stage, and during the third quarter and expect to generate for -- reach to full operational output in fourth quarter.",
    "Irwin Teg -- Roth Capital Partners -- Analyst",
    "Okay, great. Thank you.",
    "Charlie Cao -- Chief Financial Officer",
    "Thank you.",
    "Operator",
    "Thank you. Your next question is from Brian Lee from Goldman Sachs. Please go ahead.",
    "Brian Lee -- Goldman Sachs -- Analyst",
    "Hey, guys. Thanks for taking the questions. Maybe, maybe just another capex one on the back of that last one. So, the $450 million of capex for '19, it seems like that's in fact, can you give us some sense of -- in the prepared remarks you mentioned the 5 gigawatt Leshan facility going up to 16.5. What's the incremental capex for that? What's the expected timeline? Is that a first half 2020 capital expenditure plan? And then how much of the capital funding is being subsidized versus is coming off of your balance sheet?",
    "Charlie Cao -- Chief Financial Officer",
    "So, Brian, you are talking about the second phase 5 gigawatts, our new capacity, right? And we are doing that kickoff, the progression stage. It's another 5 gigwatts, and mono wafer capacity and they're making us to reach 16.5 gigawatts mono wafer capacities in the first half year of next year. And which will help us to support our growth next year. And back to the capex for this part, I think it's roughly $150 million. And the funding is from the China-based renewable equity fund, and we are working on?",
    "Brian Lee -- Goldman Sachs -- Analyst",
    "Okay. But what percent, is that fully being funded by that fund that you mentioned or that $150 million portion? I guess maybe just to clarify, the $150 million is the gross capex and it's being fully covered by this third-party or maybe you could give us a split?",
    "Charlie Cao -- Chief Financial Officer",
    "Okay. It's roughly 70%, 80% covered by the equity part and the remaining part 20%, 30%, from the -- from third-party alone.",
    "Brian Lee -- Goldman Sachs -- Analyst",
    "Okay, fair enough. I'll take the rest offline. Maybe shifting years, couple of housekeeping questions for you, Charlie. Was there any radio AD or CVD or other benefits in the second quarter reported gross margin or the 18% to 20% guided gross margin for 3Q?",
    "Charlie Cao -- Chief Financial Officer",
    "Okay. That's actually currently under -- compared to our peers, in solar, in second quarter, they recorded some AD, CVD, there was also subsidy. And we didn't have it in the second quarter and we estimated, we are going to have some number in the third quarter for the AD, CVD. But when we give the guidance, the 18%, 20% we've given consider this part.",
    "Brian Lee -- Goldman Sachs -- Analyst",
    "Okay, so that's ex any benefit. Okay. And then any -- were there any project sales in the second quarter reported results or any embedded in the third quarter guidance, revenue guidance?",
    "Charlie Cao -- Chief Financial Officer",
    "So far, no. And for international projects, you're right, we are working very hard and we will -- we are in the process to monetize the international project. As we disclosed in my remarks, the total debt included roughly $310 million, the total debt for the four part projects which have -- we have connected. And we plan to sell two of the four projects in the fourth quarter. And after the completion of the sale of the two projects in the fourth quarter, roughly $170 million debt will be, get out on the balance sheet, for the remaining two projects we plan to sell down next year.",
    "Brian Lee -- Goldman Sachs -- Analyst",
    "What's the two projects for this year? What's the capacity, and expect, if you can -- expecting to close [Phonetic]?",
    "Charlie Cao -- Chief Financial Officer",
    "The two projects, roughly the capacity is 150 megawatts. The two projects been, you know, Mexico.",
    "Brian Lee -- Goldman Sachs -- Analyst",
    "Okay. Right. And then maybe just last one for me and I'll pass it on. Just the -- yeah, I was surprised, the operating income increased you know, like 8% versus Q1 sequentially despite the much higher shipments in revenue. So, I know you had a big increase in EPS this quarter, but it seems a lot had to do with the forex gain and the income tax benefit and other below the line items. Is that fair? And then what should the income tax be going forward?",
    "Charlie Cao -- Chief Financial Officer",
    "You mean the tax benefit, right?",
    "Brian Lee -- Goldman Sachs -- Analyst",
    "Yeah, the tax benefit. I know you can, forex gain and the tax?",
    "Charlie Cao -- Chief Financial Officer",
    "Yeah. And you know, for second quarter I think this it's, you know, good and beating our estimates. And if you look at some, you know, one-off items, we also get hit from the international projects, interest rate swap. It's kind of accounting -- accounting matters, because we didn't use the hedge accounting. So, you know, for the interest rate swap, and for the tax benefit, it's one-off item, it's in -- related to the last year 2018, the R&D additional income tax deductions for our Company as a whole. And so we didn't expect, you know the continued tax benefit in the second half year.",
    "Brian Lee -- Goldman Sachs -- Analyst",
    "Okay, fair enough. Last one, and I promise to pass it on. The pricing in China I know you've been saying all year long like a lot of your peers have, that China is going to be back half weighted and it clearly looks like it's going way out that way. You know, we noticed that your pricing in China was something in the low $0.20 per watt for mono PERC volume. In one of the recent China auctions, I think it was SBIC. So it seems pretty low, you're not representing the pricing stability or strength into year end in China, which I think was your original view, you had talked about maybe even having the ability to raise prices. A module is moving through the back half. Can you talk to why you bid so aggressively and what that might mean for future years in 3Q and 4Q pricing wise in China?",
    "Charlie Cao -- Chief Financial Officer",
    "Okay. Firstly China is -- the developers were lucky, and because after the third quarter, because of the some kind of -- more capacity for the PERC sale, the PERC sale price has done a lot quarter-over-quarter. But, you know, in the first half year, the price is too high. The PERC producers that -- it generates huge gross profitability. And this build a foundation for a little bit lower the module price in the China market. And second one is, if you talk about the specific one project, the price and if you look out of the SOE, they're doing the bidding prices, some prices [Phonetic] they're planning for the next year. So this price is not purely, you know, the --",
    "Gener Miao -- Chief Marketing Officer",
    "Let me take that one. This is Gener, Brian. So for the pricing in China in general, we believe that Q4 will become stronger than Q3. Q3, I think will be the low point for the whole year in the second half for the market price, that's above the market price. And of course SBIC or other, you know, spot market place. I have to say, you know, every player has its unique understanding and a tactic about different customer approach and they have different understanding about the project pipeline, construction timelines, together with other project size and details. I think that -- I think that kind of commercial confidential, so we cannot disclose too much. But for us, we do not see such prices only for 2019. And that it will continue as a very big fundamental pipeline for 2020 as well.",
    "Brian Lee -- Goldman Sachs -- Analyst",
    "Okay. I appreciate the additional color. Thanks, guys.",
    "Gener Miao -- Chief Marketing Officer",
    "Thank you.",
    "Operator",
    "Thank you. [Operator Instruction] Your next question is from Maheep from Credit Suisse. Please go ahead.",
    "Maheep Mandloi -- Credit Suisse -- Analyst",
    "Hey, thanks for taking the questions. Just on the polysilicon cost structure, could you just talk over like what was the polysilicon cost in the quarter and about expectations for Q3 and Q4? And then just trying to triangulate, like seeing latest news in China that the polysilicon cost might go up. So trying to see like, what are you seeing at your end for that cost structure?",
    "Charlie Cao -- Chief Financial Officer",
    "I think the polysilicon spot price reached to the lowest level in second quarter and covered a little bit. And now we believe, it is roughly for the mono based polysilicon, the price is $9.5 per kilogram. And we expect, the price will be stable throughout the year. And the thing is, a lot of producers, they have new capacities coming out in the second quarter, but they need to -- they need more time to produce high quality mono based polysilicon. And so far we think that their production process is on the track. And so in general, we don't believe a big risk, for the polysilicon, the price going down dramatically.",
    "Maheep Mandloi -- Credit Suisse -- Analyst",
    "Got it. And just on guidance. It's definitely a Q4-weighted shipment guidance. Then a lot of it is probably because of China demand. But, are you seeing any higher demand from any other regions apart from China in Q4, like demand pull in US due to the tax credits are in Europe or other markets?",
    "Charlie Cao -- Chief Financial Officer",
    "Yeah. So, I think Maheep, definitely the Q4 demand will be stronger than Q3. Not only China demand is kicking in, but also, like you mentioned the US demand definitely is there. But is a problem, short of supply. And also, as you know, other markets such as Japan, India, the markets demand is still there.",
    "Maheep Mandloi -- Credit Suisse -- Analyst",
    "Got it. And, just, how do you see the demand shaping up in through the first half of 2020 or '20, the full year of next year. Just trying to understand your visibility for demand into the next year, especially given your wafer capacity expansion plans.",
    "Gener Miao -- Chief Marketing Officer",
    "For the market demand side, we believe that the year of 2020 will continue to grow compared with 2019 and is still a healthy global demand. If we look into the -- let's say the key market such as China, US, Europe, even India and Japan. The market demand is, all of the market demand in 2020 will be higher than 2019. So I think that's a fundamental growth for the whole industry and a very important reason why we are so confident about our expansion plan. Meanwhile, the customer end side, we continue to be sold out for several months to now. So we believe, we have a very good market demand for the future.",
    "Maheep Mandloi -- Credit Suisse -- Analyst",
    "Got it. And then just on the -- all the new technologies, which I had spoke about on the call on -- the thin films, one bifacial, larger amount of wafer sizes. So apart from the wafer capacity expansion, can you talk about which of these technologies would you be replicating across your capacity, across the supply. And just trying to understand like, how should we think about the capex for, say, going to bifacial or other technologies in 2020?",
    "Gener Miao -- Chief Marketing Officer",
    "So I think from the market demand point of view, we are -- like, marketing strategy point, we will continue to promote and launch our next generation of the products, which should be very attractive and very competitive in the market. We will -- I think we are planning to launch this soon. Meanwhile, overall -- all the products from Jinko side, even for the whole industry, we believe, the efficiency will continue to increase. The cost structure side will decrease, even diluted by the higher efficiency of the products. I think that's a roadmap followed by the whole industry. We will continue to contribute to the grid parity with more and more competitive also in cost all over the world.",
    "Maheep Mandloi -- Credit Suisse -- Analyst",
    "All right. Those are the most questions from me. Thanks for taking the questions.",
    "Charlie Cao -- Chief Financial Officer",
    "Thank you.",
    "Gener Miao -- Chief Marketing Officer",
    "Thank you.",
    "Operator",
    "Thank you. [Operator Instructions]",
    "[Operator Closing Remarks]",
    "Duration: 49 minutes",
    "Ripple Zhang -- Investor Relations",
    "Kangping Chen -- Chief Executive Officer and Director",
    "Gener Miao -- Chief Marketing Officer",
    "Charlie Cao -- Chief Financial Officer",
    "Irwin Teg -- Roth Capital Partners -- Analyst",
    "Brian Lee -- Goldman Sachs -- Analyst",
    "Maheep Mandloi -- Credit Suisse -- Analyst",
    "More JKS analysis",
    "Transcript powered by AlphaStreet",
    "This article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.",
    "10 stocks we like better than JinkoSolar Holding Company\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and JinkoSolar Holding Company wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Motley Fool Transcribers has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:43:56"
}