{
  "url": "https://www.nasdaq.com/article/bruker-brkr-releases-jpk-nanowizard-4-xp-bio-afm-system-cm1206595",
  "title": "Bruker (BRKR) Releases JPK NanoWizard 4 XP Bio-AFM System - Nasdaq.com",
  "text": [
    "  Bruker Corporation BRKR  recently introduced the NanoWizard 4 XP extreme performance Bio-AFM system. The new system is the result of the integration of Bruker's exclusive PeakForce Tapping, which ensures both superior force control and unique AFM ease of use, and the pioneering QI mode for high-resolution nanomechanics on soft samples. With the launch of this new system, the company has established a performance yardstick for atomic force microscopy in the field of life science research. This system will expand Bruker's JPK BioAFM business' portfolio under its NANO segment. Bruker acquired JPK in July 2018 to incorporate the latter's expertise in live-cell imaging, cellular mechanics and biological stimulus-response classification into the former's global infrastructure.     More About the JPK NanoWizard 4 XP   Using JPK's groundbreaking role in fusing AFM with state-of-the-art optical techniques, the NanoWizard 4 XP system provides the most superior  level of correlative microscopy and effortless integration with phase, DIC, confocal or spinning disc microscopies, single-molecule methods (FRET, FCS, TIRF, FLIM, FRAP), super-resolution techniques (STED, PALM/STORM, SIM), Raman, and multiphoton microscopy. The PeakForce Tapping is an efficient way of attaining high-resolution AFM on a variety of biological samples. In addition to PeakForce Tapping and QI mode, the NanoWizard 4 XP builds on JPK's next-generation  Vortis 2   high-speed, high-performance control electronics. The system also uses a path-breaking, new, workflow-based software, GUI, which comprises features like guidance, auto-setup and workspace organization to enhance productivity and deliver swift results. Equipped with the widest array of accessories, the NanoWizard 4 XP is the most versatile Bio-AFM system in the market, as it offers remarkable flexibility for novel applications and experiments.  Recent Product Launches  Lately, Bruker has been focused on expanding its product portfolio. In June 2019, the company launched the MALDI Biotyper sirius system for all previously FDA-approved and research-use-only (RUO) MALDI Biotyper (MBT) reference libraries, which are used for swift and cost-efficient microbial identification from cultures in microbiology.   In May, Bruker launched the timsTOF fleX mass spectrometer, which constitutes of a software-switchable MALDI source, adapted to the ESI timsTOF Pro platform.   Price Performance  Shares of the company have rallied 22.6% in the past year against the industry  's 2.9%. rise.  Zacks Rank and Stocks Worth a Look  Bruker currently has a Zacks Rank #3 (Hold). A few better-ranked stocks in the broader medical space are Medtronic MDT  , Baxter BAX  and NuVasive NUVA  , each carrying a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   . Medtronic's long-term earnings growth rate is expected to be 7.13%. Baxter's long-term earnings growth rate is projected at 12.8%. NuVasive's long-term earnings growth rate is expected to be 12.75%.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Bruker Corporation (BRKR): Free Stock Analysis Report   Medtronic PLC (MDT): Free Stock Analysis Report   NuVasive, Inc. (NUVA): Free Stock Analysis Report   Baxter International Inc. (BAX): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Bruker Corporation BRKR  recently introduced the NanoWizard 4 XP extreme performance Bio-AFM system. The new system is the result of the integration of Bruker's exclusive PeakForce Tapping, which ensures both superior force control and unique AFM ease of use, and the pioneering QI mode for high-resolution nanomechanics on soft samples.",
    "With the launch of this new system, the company has established a performance yardstick for atomic force microscopy in the field of life science research. This system will expand Bruker's JPK BioAFM business' portfolio under its NANO segment.",
    "Bruker acquired JPK in July 2018 to incorporate the latter's expertise in live-cell imaging, cellular mechanics and biological stimulus-response classification into the former's global infrastructure.",
    " More About the JPK NanoWizard 4 XP  ",
    "Using JPK's groundbreaking role in fusing AFM with state-of-the-art optical techniques, the NanoWizard 4 XP system provides the most superior  level of correlative microscopy and effortless integration with phase, DIC, confocal or spinning disc microscopies, single-molecule methods (FRET, FCS, TIRF, FLIM, FRAP), super-resolution techniques (STED, PALM/STORM, SIM), Raman, and multiphoton microscopy.",
    "The PeakForce Tapping is an efficient way of attaining high-resolution AFM on a variety of biological samples. In addition to PeakForce Tapping and QI mode, the NanoWizard 4 XP builds on JPK's next-generation  Vortis 2   high-speed, high-performance control electronics. The system also uses a path-breaking, new, workflow-based software, GUI, which comprises features like guidance, auto-setup and workspace organization to enhance productivity and deliver swift results.",
    "Equipped with the widest array of accessories, the NanoWizard 4 XP is the most versatile Bio-AFM system in the market, as it offers remarkable flexibility for novel applications and experiments.",
    " Recent Product Launches ",
    "Lately, Bruker has been focused on expanding its product portfolio.",
    "In June 2019, the company launched the MALDI Biotyper sirius system for all previously FDA-approved and research-use-only (RUO) MALDI Biotyper (MBT) reference libraries, which are used for swift and cost-efficient microbial identification from cultures in microbiology.  ",
    "In May, Bruker launched the timsTOF fleX mass spectrometer, which constitutes of a software-switchable MALDI source, adapted to the ESI timsTOF Pro platform. ",
    " Price Performance ",
    "Shares of the company have rallied 22.6% in the past year against the industry  's 2.9%. rise.",
    " Zacks Rank and Stocks Worth a Look ",
    "Bruker currently has a Zacks Rank #3 (Hold).",
    "A few better-ranked stocks in the broader medical space are Medtronic MDT  , Baxter BAX  and NuVasive NUVA  , each carrying a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "Medtronic's long-term earnings growth rate is expected to be 7.13%.",
    "Baxter's long-term earnings growth rate is projected at 12.8%.",
    "NuVasive's long-term earnings growth rate is expected to be 12.75%.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:19:00"
}