{
  "url": "https://www.nasdaq.com/article/top-research-reports-for-apple-chevron-vmware-cm1207522",
  "title": "Top Research Reports for Apple, Chevron & VMware - Nasdaq.com",
  "text": [
    "Wednesday, September 4, 2019",
    "The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features updated research reports on 16 major stocks, including Apple (AAPL), Chevron (CVX) and VMware (VMW). These research reports have been hand-picked from roughly 70 reports published by our analyst team today.",
    "You can see  all of today's research reports here >>>",
    "Apple 's shares have outperformed the broader S&P 500 index on a year-to-date basis (+30.4% vs. +14.5%). The Zacks analyst thinks the company's continued focus on strengthening the Services business and a strong slate of upcoming app releases, including its streaming service Apple TV+, are key catalysts. It is also expected to benefit from the refreshed Macbook and iPad product lines.",
    "Apple is likely to unveil latest iPhones in an event scheduled on Sep 10. However, the ongoing U.S.-China trade war does not bode well for the company. Further, legal woes have increased due to a lawsuit from customers related to App Store charges.",
    "The company has also been accused of unfair practices by Spotify. These are significant headwinds for investors, at least for the near term.",
    "(You can  read the full research report on Apple here >>> ).",
    "Shares of Chevron have outperformed the Zacks Integrated Oil industry year to date (+6.9% vs. -5.1%). The Zacks analyst thinks Chevron's existing project pipeline is among the best in the industry. The company is targeting volume growth of around 4-7% in 2019 thanks to planned expansion in the Permian Basin.",
    "Chevron pumped 55% more out of the West Texas shale play in the most recent quarter compared with the year-ago period, with output set to soar in coming years. Moreover, the growing free cash flow should enable Chevron to deliver safe and growing dividend for the foreseeable future.",
    "However, there are worries over drop in its refining earnings that once again cut into gains from rising E&P income. The massive capex might also play a spoilsport. Hence, investors are advised to wait for a better entry point.",
    "(You can  read the full research report on Chevron here >>> ).",
    "VMware 's shares have gained +3.8% year to date, underperforming the Zacks Software industry which is up +27.9% over the same period. The Zacks analyst thinks VMware delivered impressive second-quarter fiscal 2020 results.",
    "Both earnings and revenues increased on a year-over-year basis. The top line was primarily driven by robust performance from NSX, VeloCloud and vSAN product lines. VMware's dominance in SDDC and expanding customer base in cloud driven by partnerships with the likes of IBM and AWS are positives.",
    "The Pivotal and Carbon Black acquisitions are expected to drive recurring hybrid cloud subscription and SaaS revenues in the long haul. However, unfavorable revenue mix is expected to hurt license revenues in the third quarter. VMware's margins are anticipated to remain under pressure due to heavy spending. Intensifying competition is a concern as well.",
    "(You can  read the full research report on VMware here >>> ).",
    "Other noteworthy reports we are featuring today include Workday (WDAY), Capital One (COF) and Cooper Companies (COO).",
    "Legalizing THIS Could Be Even Bigger than Marijuana",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "See these 5 \"sin stocks\" now >>",
    "Note: Our Director of Research Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trendsand Earnings Previewreports. If you want an email notification each time Sheraz publishes a new article, please click here>>>",
    "Apple (AAPL) Banks on Services to Counter Weak iPhone Demand",
    "Chevron (CVX) to Gain from Stellar Permian Operation",
    "VMware (VMW) Drives on Hybrid Cloud & SaaS, License Bookings",
    "Workday (WDAY) Rides on HCM Capabilities & Cloud Platforms",
    "Per the Zacks analyst, Workday's revenue growth continues to be driven by high demand for its HCM and financial management solutions. Also, its diversified product portfolio is a positive.",
    "Credit Card Business Aid Capital One (COF), High Costs a Woe",
    "Per the Zacks analyst, Capital One's solid card and online banking business, along with restructuring efforts will aid revenues.",
    "Core CVI Arm Aids Cooper (COO), Soft Fertility Segment Ails",
    "Cooper has been gaining persistently from solid prospects of its core CVI segment. The Zacks analyst is apprehensive about decline in Fertility revenues in the fiscal third quarter.",
    "New Mines, Low Debt & High Gold Prices Aid Royal Gold (RGLD)",
    "Per the Zacks analyst, Royal Gold will benefit from the rally in gold prices , ramping up of new mines, focus on acquisitions as well as efforts to cut down debt levels.",
    "High Export Sales Aid Sanderson Farms (SAFM) Amid Cost Woes",
    "Per the Zacks analyst, Sanderson Farms is benefitting from healthy export demand and solid poultry sales.",
    "Robust Product Pipeline Aids Glaukos (GKOS), High Costs Ail",
    "Per the Zacks analyst, Glaukos' solid pipeline of products like iStent Infinite and iDose Travoprost continues to boost the company's performance.",
    "Callon Petroleum (CPE) Banks on Oil-Rich Permian, LOE Hurts",
    "While the Zacks analyst is optimistic about Callon Petroleum's strong presence in the oil-rich acres of Permian, rising lease operating expenses (LOE) continues to hurt its bottom line.",
    "Acquisition Spree and Loan Growth Aids First Horizon (FHN)",
    "The Zacks analyst remains optimistic about First Horizon's various acquisitions to expand core franchise that are likely to support top line growth. Further, loan growth remains a favorable factor.",
    "Solid Mortgage Insurance Business Aids Genworth (GNW)",
    "Per the Zacks analyst, Genworth is poised for growth banking on strong mortgage insurance business benefiting from low unemployment, interest rate levels and stable housing trends in most markets.",
    "Sturdy Comps Run to Fuel Rent-A-Center's (RCII) Top Line",
    "Rent-A-Center has been witnessing decent same-store sales run since the past 10 quarters. Per the Zacks analyst, improving traffic trends, targeted value proposition and cost containment bode well.",
    "Semtech (SMTC) Grapples with Competition, Pricing Pressure",
    "Per the Zacks analyst, competition in the semiconductor space and resultant pricing pressure will continue to weigh on margins and profitability. Also, slowing demand in China could impact results.",
    "Tariffs & Soft Retail Unit to Hit G-III Apparel (GIII) Sales",
    "Per the Zacks analyst, tariffs levied on goods manufactured in China are likely to hurt G-III Apparel's business. Also, softness in the retail segment due to weakness in underlying brands is a worry.",
    "Declining Sales In Animal Health Segment Hurts Phibro (PAHC)",
    "The Zacks analyst is worried about Phibro Animal Health witnessing reduced sales of MFAs and net vaccines.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 01:25:00"
}