{
  "url": "https://www.nasdaq.com/article/7-ways-to-save-money-on-college-cm1210311",
  "title": "7 Ways to Save Money on College - Nasdaq.com",
  "text": [
    "       Here's how to keep your college costs as low as possible.  As the cost of college climbs, many students have no choice but to rack up piles of debt  in an effort to pay for their degrees. But the lower you manage to keep your college costs, the easier it'll be to keep your student loans  to a minimum. Here are a few tactics for saving money on college -- and avoiding an unhealthy level of debt in the process.   Image source: Getty ImagesmakeArticleAd();  1. Attend community college for as long as you can If you're looking to gain a four-year degree, community college won't do it. But that doesn't mean you can't spend a few semesters at community college, knock out some core requirements, and then finish your studies at a four-year school. And if you go that route, you're likely to save some serious money. Here's what tuition and fees looked like  for various college types during the 2018-2019 academic year:       Swapping a year of public, in-state college with community college could shave $6,570 off of your tuition costs, and the savings only go up from there if you're attending an out-of-state public college or private university. 2. Stick to a public in-state school Choosing a public in-state school allows you to complete a four-year degree while avoiding the expense that comes with attending an out-of-state or private college. Based on the table above, going to a public, in-state college instead of a public, out-of-state college will save you $64,240 in tuition and fees at the current rates, over the course of four years. Chances are, the rates will change, but this still gives you a good idea of the savings involved. Meanwhile, if you opt for an in-state public college over a private one, you'll save a whopping $102,400 on tuition and fees over four years. 3. Skip the dorm Living in a dorm might seem like a key part of the college experience, but it can get very expensive. For the 2018-2019 academic year  , the average cost of room and board  at community college was $8,660. At public, four-year colleges both in-state and out, it was $11,140. And at private universities, it was $12,680. That's a lot of money to pay every year for a shared room the size of a closet, and mediocre dining hall slop. If you attend a college that's close enough for you to live at home and commute, you'll save a lot of money by skipping the dorm and residing under your parents' roof during your studies. And if that's not an option -- perhaps the college you're attending is too far away to drive back and forth every day -- see what rental homes look like in town, and aim to snag a cheap off-campus apartment or house that's less expensive than what you'll pay to live on campus. Remember, when you pay for room and board, you're getting the convenience of prepared meals and other amenities. Renting your own space and cooking your own meals won't be free, but it could end up being less expensive than dorming, especially if you're able to find a number of housemates to split that expense with. Just read up on your college's policy before going this route, as some universities might prohibit students from living off-campus during their first year or two of studies unless they're living at home. 4. Don't pay a premium for textbooks and course materials The average college student spends more than $1,200  on textbooks and course materials per year, according to the College Board. A good way to keep your costs down is to rent or borrow course materials rather than buy them brand new. There are numerous websites that allow you to search for the books and materials you need for your classes and buy or rent them at discounted rates. Furthermore, if you're in the market for used textbooks, your own campus bookstore might stock them. But don't pay the bookstore price until you've done your research to ensure that you're getting the best deal. Finally, don't forget that magical place called the library, where you can access books for free. You may not find every book you need for college there, but if you're able to borrow some books rather than pay for them, you'll eke out a bit of savings. 5. Choose a major early on Many students struggle to land on a major, and by the time they do, they're halfway through college. But if you wait too long to choose a major, you'll risk running out of time to complete your mandatory requirements, at which point you may be forced to extend your college stay beyond four years. A better bet? Pick a major as early on as you can. The sooner you do, the sooner you'll get to start tackling the requirements associated with it. Remember, certain advanced-level classes that are required for majors come with prerequisites you need to fulfill first. If you wait until your junior year to decide your major, you may not finish college on time. 6. Accelerate your studies Once you're enrolled as a full-time student, you're typically allowed to cram in as many credits as you can manage. Therefore, if you're a strong student who's good with time management, it pays to load up on extra courses along the way. If you're able to accelerate your studies and graduate a semester or two early, you'll save yourself money on tuition. That said, don't take on more classes at once than you can reasonably manage. If you fail those courses, you won't be doing yourself any favors. 7. Pursue scholarship opportunities Some people confuse student loans  and scholarships, but they're two different beasts. When you take out loans, you're borrowing money for college, and you need to repay that money once you graduate, either to the U.S. government  or to a private lender. When you get a scholarship, however, that's money that's granted or gifted to you that you don't have to pay back. And if you manage to land a scholarship, it could bring down your college costs tremendously. Of course, landing a scholarship is easier said than done, but if you have a specific talent, whether it's athletic, musical, or otherwise, it pays to seek out opportunities that capitalize on your skills. Similarly, if you've spent time volunteering for an organization that gives out scholarships, ask what it takes to apply. And if you're not sure how to identify scholarship opportunities, a simple online search is your first step and best bet. It also pays to see if your parents or relatives work for companies that provide college scholarships. Similarly, if you attended a private high school, it might give out money for college as well. Finally, the university you attend might offer its own scholarships, so do some digging to see if that option is on the table. Keep in mind that in many cases, you'll need to maintain a certain GPA in order to keep your scholarship. But that's usually a small price to pay for free money. The less money you spend on college, the less likely you are to wind up with an unmanageable level of student debt. It pays to explore your options for lowering your college costs, even if it means making a few adjustments or sacrifices along the way. Save thousands on student loan interest Many people are missing out on lower student loan interest rates because they don't take the time to research their refinancing options. Our picks of the best student loan providers  can help you save thousands of dollars in interest over time. Click here  to uncover the best-in-class student loans providers we could find in 2019.  The Motley Fool owns and recommends MasterCard and Visa, and recommends American Express. We're firm believers in the Golden Rule. If we wouldn't recommend an offer to a close family member, we wouldn't recommend it on The Ascent either. Our number one goal is helping people find the best offers to improve their finances. That is why editorial opinions are ours alone and have not been previously reviewed, approved, or endorsed by included advertisers. Editorial content from The Ascent is separate from The Motley Fool editorial content and is created by a different analyst team.",
    "      Here's how to keep your college costs as low as possible. ",
    "As the cost of college climbs, many students have no choice but to rack up piles of debt  in an effort to pay for their degrees. But the lower you manage to keep your college costs, the easier it'll be to keep your student loans  to a minimum. Here are a few tactics for saving money on college -- and avoiding an unhealthy level of debt in the process.",
    "  Image source: Getty ImagesmakeArticleAd(); ",
    "Image source: Getty Images",
    "If you're looking to gain a four-year degree, community college won't do it. But that doesn't mean you can't spend a few semesters at community college, knock out some core requirements, and then finish your studies at a four-year school. And if you go that route, you're likely to save some serious money.",
    "Here's what tuition and fees looked like  for various college types during the 2018-2019 academic year:",
    "   Swapping a year of public, in-state college with community college could shave $6,570 off of your tuition costs, and the savings only go up from there if you're attending an out-of-state public college or private university.",
    "Choosing a public in-state school allows you to complete a four-year degree while avoiding the expense that comes with attending an out-of-state or private college. Based on the table above, going to a public, in-state college instead of a public, out-of-state college will save you $64,240 in tuition and fees at the current rates, over the course of four years. Chances are, the rates will change, but this still gives you a good idea of the savings involved. Meanwhile, if you opt for an in-state public college over a private one, you'll save a whopping $102,400 on tuition and fees over four years.",
    "Living in a dorm might seem like a key part of the college experience, but it can get very expensive. For the 2018-2019 academic year  , the average cost of room and board  at community college was $8,660. At public, four-year colleges both in-state and out, it was $11,140. And at private universities, it was $12,680. That's a lot of money to pay every year for a shared room the size of a closet, and mediocre dining hall slop.",
    "If you attend a college that's close enough for you to live at home and commute, you'll save a lot of money by skipping the dorm and residing under your parents' roof during your studies. And if that's not an option -- perhaps the college you're attending is too far away to drive back and forth every day -- see what rental homes look like in town, and aim to snag a cheap off-campus apartment or house that's less expensive than what you'll pay to live on campus.",
    "Remember, when you pay for room and board, you're getting the convenience of prepared meals and other amenities. Renting your own space and cooking your own meals won't be free, but it could end up being less expensive than dorming, especially if you're able to find a number of housemates to split that expense with. Just read up on your college's policy before going this route, as some universities might prohibit students from living off-campus during their first year or two of studies unless they're living at home.",
    "The average college student spends more than $1,200  on textbooks and course materials per year, according to the College Board. A good way to keep your costs down is to rent or borrow course materials rather than buy them brand new. There are numerous websites that allow you to search for the books and materials you need for your classes and buy or rent them at discounted rates.",
    "Furthermore, if you're in the market for used textbooks, your own campus bookstore might stock them. But don't pay the bookstore price until you've done your research to ensure that you're getting the best deal.",
    "Finally, don't forget that magical place called the library, where you can access books for free. You may not find every book you need for college there, but if you're able to borrow some books rather than pay for them, you'll eke out a bit of savings.",
    "Many students struggle to land on a major, and by the time they do, they're halfway through college. But if you wait too long to choose a major, you'll risk running out of time to complete your mandatory requirements, at which point you may be forced to extend your college stay beyond four years.",
    "A better bet? Pick a major as early on as you can. The sooner you do, the sooner you'll get to start tackling the requirements associated with it. Remember, certain advanced-level classes that are required for majors come with prerequisites you need to fulfill first. If you wait until your junior year to decide your major, you may not finish college on time.",
    "Once you're enrolled as a full-time student, you're typically allowed to cram in as many credits as you can manage. Therefore, if you're a strong student who's good with time management, it pays to load up on extra courses along the way. If you're able to accelerate your studies and graduate a semester or two early, you'll save yourself money on tuition.",
    "That said, don't take on more classes at once than you can reasonably manage. If you fail those courses, you won't be doing yourself any favors.",
    "Some people confuse student loans  and scholarships, but they're two different beasts. When you take out loans, you're borrowing money for college, and you need to repay that money once you graduate, either to the U.S. government  or to a private lender. When you get a scholarship, however, that's money that's granted or gifted to you that you don't have to pay back. And if you manage to land a scholarship, it could bring down your college costs tremendously.",
    "Of course, landing a scholarship is easier said than done, but if you have a specific talent, whether it's athletic, musical, or otherwise, it pays to seek out opportunities that capitalize on your skills. Similarly, if you've spent time volunteering for an organization that gives out scholarships, ask what it takes to apply. And if you're not sure how to identify scholarship opportunities, a simple online search is your first step and best bet.",
    "It also pays to see if your parents or relatives work for companies that provide college scholarships. Similarly, if you attended a private high school, it might give out money for college as well.",
    "Finally, the university you attend might offer its own scholarships, so do some digging to see if that option is on the table. Keep in mind that in many cases, you'll need to maintain a certain GPA in order to keep your scholarship. But that's usually a small price to pay for free money.",
    "The less money you spend on college, the less likely you are to wind up with an unmanageable level of student debt. It pays to explore your options for lowering your college costs, even if it means making a few adjustments or sacrifices along the way.",
    "Many people are missing out on lower student loan interest rates because they don't take the time to research their refinancing options. Our picks of the best student loan providers  can help you save thousands of dollars in interest over time. Click here  to uncover the best-in-class student loans providers we could find in 2019.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:00:00"
}