{
  "url": "https://www.nasdaq.com/article/jacobs-to-revamp-wetlandelectro-coagulation-treatment-facility-cm1208147",
  "title": "Jacobs to Revamp Wetland/Electro-Coagulation Treatment Facility - Nasdaq.com",
  "text": [
    "Jacobs Engineering Group Inc.JEC has received a contract from Kaiser Mead Custodial Work Trust to design, build, operate and optimize a Wetland/Electro-Coagulation Treatment Facility. This move will help the facility  to clean groundwater cyanide, fluoride and nitrate pollution at the Kaiser Aluminum (Mead Works) Superfund site in Mead, WA.\r\n The company's Buildings, Infrastructure and Advanced Facilities (\"BIAF\") business will utilize its local operations and maintenance resources located at the Spokane Regional Water Reclamation Facility, in order to provide low-cost, safe and responsive operation within the facility.Solid Project Execution Bodes Well\r\n Efficient project execution has been driving Jacobs' performance over the last few quarters. This is evident from the company's fiscal third-quarter backlog. At the end of fiscal third quarter, the company reported total backlog of $22.5 billion, reflecting a 8% year-over-year increase.\r\n Its higher-margin Aerospace, Technology and Nuclear (ATN), and BIAF line of businesses continue to see a robust pipeline of government and infrastructure spending programs. Particularly, backlog in the BIAF segment (which accounted for 63.5% of revenues in the las t report ed quarter) grew 10.4% year over year.\r\n Notably, management has outlined new margin targets for the next three years (through 2021). The company expects 125-175 basis points (bps) expansion in adjusted operating margins, 100-150 bps increase in ATN margins and 110-140 bps growth in BIAF margin. Moreover, it projects 3-5% net organic revenue growth, with BIAF leading the way with 4-6% top-line compound annual growth rate (CAGR) and ATN with 2-3% CAGR. The upside is primarily supported by recurring revenues that roughly occupy two-thirds of Jacobs' total revenues, in turn reducing overall risks of market volatility.\r\n Notably, the company's shares have broadly outperformed its industry year to date. The stock has gained 55.4% compared with 11.9% growth of its industry in the said period. Jacobs' price performance is backed by an impressive earnings surprise history. The company surpassed the Zacks Consensus Estimate in six of the trailing seven quarters. Earnings estimates for the current year have moved 1.5% upward over the past 30 days, suggesting that it is well positioned to capitalize on bottom-line prospects.Zacks Rank\r\n Jacobs - which share space with AECOM ACM , KBR, Inc. KBR and Quanta Services, Inc. PWR in the same industry - currently carries a Zacks Rank #3 (Hold). You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here .It's Illegal in 42 States, But Investors Will Make Billions Legally\r\n In addition to the companies you read about above, today you get details on the newly-legalized\r\n industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.\r\n That's twice as much as they spend on marijuana, legally or otherwise.\r\n Zacks special report revealing how investors can profit from this new opportunity. As more states\r\n legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:33:00"
}