{
  "url": "https://www.nasdaq.com/article/lmes-gold-silver-contracts-in-doubt-as-societe-generale-pulls-out-20190905-00044",
  "title": "LME's gold, silver contracts in doubt as Societe Generale pulls out - Nasdaq.com",
  "text": [
    "By Peter Hobson and Pratima Desai",
    "LONDON, Sept 4 (Reuters) - The London Metal Exchange's gold and silver futures are being thrown into doubt, with the imminent resignation of Societe Generale  as a market maker threatening to deepen a decline in trading activity, three sources said.",
    "SocGen, one of five lenders that partnered with the LME to launch the contracts in 2017, is expected to resign shortly as a market maker, taking the number of banks committed to offering tradeable prices to two -- Goldman Sachs  and Morgan Stanley , the sources said.",
    "\"There's still commitment,\" said one of the sources. But if volumes remain low, they added, \"we'll have to sit down and decide what is the next stage -- exit, restructuring, or something else.\"",
    "The LME bet that the contracts would benefit from tightening regulation pushing some of London's$10 trillion-a-year gold market from over-the-counter (OTC) deals between banks and brokers to centrally cleared exchanges.",
    "To drive activity, it took the unusual step of cutting a deal with partners to share revenue in return for commitments to trade.",
    "But even as a surge in gold prices  this year pushes trading on CME Group's  New York COMEX market and the Shanghai Gold Exchange to record levels, turnover on the LME's contracts, known as LMEprecious, has dropped.",
    "SocGen declined to comment. The French bank earlier this year announced it would exit over-the-counter (OTC) commodities trading as part of a push to improve profitability, but did not say it would close on-exchange business. ",
    "The LME said in a statement: \"We are committed - with the support of our existing participants - to overcoming current challenges in order to achieve our original ambition.\"",
    "\"We already have a new market participant programme for clients, along with a number of initiatives in the pipeline to support broader participation in the LMEprecious contracts,\" it added.",
    "The other banks partnered with the LME -- Goldman, Morgan Stanley, Natixis  and ICBC Standard , ,  -- either declined to comment or did not respond to a request for comment.",
    "The World Gold Council, another backer of the LME's contracts, said it \"supports all efforts which promote a transparent gold market that meets the needs of market participants.\"",
    "Proprietary trader OSTC, also a partner, said it remained fully committed to the LMEprecious project.",
    "Fewer than 18,000 LME gold contracts changed hands in August - the lowest monthly total on record and an eighth of the number traded in its heyday of September 2017. ",
    "Volumes on COMEX, by contrast, hit a monthly record of 9 million contracts, up from around 6.7 million in September 2017. Turnover of the most traded contract on the Shanghai gold exchange and in the London OTC market has also leaped. , ",
    "The number of open contracts in LME gold has meanwhile slumped to below 14,000 from a peak above 30,000 in 2017. In silver it is 2,098, a fraction of the near-7,000 achieved two years ago.",
    "London is the world's biggest OTC gold trading hub, managing buy and sell orders from all over the world. But the biggest players, including JPMorgan  and HSBC , have not joined LMEprecious.",
    "At least one large newcomer is preparing to join, two sources said. They declined to say who this was, but said it should lift volumes.",
    "Previous additions such as Commerzbank , ED&F Man and Marex Financial have however failed to provide significant boosts. Neither have incentives such as fee rebates and subscription fee waivers.",
    "The LME says traders can reduce their costs by using its contracts to put positions on the exchange.",
    "Its partners may have saved by doing this, but the company they set up to invest in the LME's contracts, EOS Precious Metals, has only lost money - almost $800,000 as of the end-2018, documents on Britain's Companies House database show.",
    "\"Not enough is happening,\" said a source at one of the banks backing LMEprecious. \"If things go on as they are, at some point we'll have to stop.\"",
    "The LME is owned by Hong Kong Exchanges and Clearing Ltd."
  ],
  "published_datetime": "2019-09-05 02:00:00"
}