{
  "url": "https://www.nasdaq.com/article/bud-vs-dvdcy-which-stock-should-value-investors-buy-now-cm1210434",
  "title": "BUD vs. DVDCY: Which Stock Should Value Investors Buy Now? - Nasdaq.com",
  "text": [
    " Investors with an interest in Beverages - Alcohol stocks have likely encountered both Anheuser-Busch Inbev (BUD) and Campari Group (DVDCY). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look. There are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits. Right now, Anheuser-Busch Inbev is sporting a Zacks Rank of #2 (Buy), while Campari Group has a Zacks Rank of #3 (Hold). Investors should feel comfortable knowing that BUD likely has seen a stronger improvement to its earnings outlook than DVDCY has recently. But this is only part of the picture for value investors. Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels. Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years. BUD currently has a forward P/E ratio of 18.62, while DVDCY has a forward P/E of 34.52. We also note that BUD has a PEG ratio of 2.04. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. DVDCY currently has a PEG ratio of 4.60. Another notable valuation metric for BUD is its P/B ratio of 2.04. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, DVDCY has a P/B of 4.20. Based on these metrics and many more, BUD holds a Value grade of B, while DVDCY has a Value grade of F. BUD has seen stronger estimate revision activity and sports more attractive valuation metrics than DVDCY, so it seems like value investors will conclude that BUD is the superior option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Anheuser-Busch InBev SA/NV (BUD): Free Stock Analysis Report   Campari Group (DVDCY): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors with an interest in Beverages - Alcohol stocks have likely encountered both Anheuser-Busch Inbev (BUD) and Campari Group (DVDCY). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look.",
    "There are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits.",
    "Right now, Anheuser-Busch Inbev is sporting a Zacks Rank of #2 (Buy), while Campari Group has a Zacks Rank of #3 (Hold). Investors should feel comfortable knowing that BUD likely has seen a stronger improvement to its earnings outlook than DVDCY has recently. But this is only part of the picture for value investors.",
    "Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels.",
    "Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years.",
    "BUD currently has a forward P/E ratio of 18.62, while DVDCY has a forward P/E of 34.52. We also note that BUD has a PEG ratio of 2.04. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. DVDCY currently has a PEG ratio of 4.60.",
    "Another notable valuation metric for BUD is its P/B ratio of 2.04. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, DVDCY has a P/B of 4.20.",
    "Based on these metrics and many more, BUD holds a Value grade of B, while DVDCY has a Value grade of F.",
    "BUD has seen stronger estimate revision activity and sports more attractive valuation metrics than DVDCY, so it seems like value investors will conclude that BUD is the superior option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:40:11"
}