{
  "url": "https://www.nasdaq.com/article/fang-holdings-sfun-reports-q2-loss-marketing-services-growth-cm1206707",
  "title": "Fang Holdings (SFUN) Reports Q2 Loss, Marketing Services Growth - Nasdaq.com",
  "text": [
    "  Fang Holdings Limited SFUN  reported second-quarter 2019 non-GAAP net loss of 2 cents per share. Total revenues came in at $67.6 million.  Revenues in Detail   Marketing services  revenues of $32.5 million increased 19.3% from the year-ago quarter on the back of Fang's efforts in customer development.  Listing services  revenues of $19.2 million decreased 26% due to lower number of paying members. Revenues from leads generation services   came in at $10.8 million compared with $2.8 million in the prior-year quarter on the back of increased effectiveness of service and customer development. Revenues from value-added services  came in at $1.7 million, up 19.9% from the prior-year quarter.  Financial services  revenues of $2.6 million declined 3.2% from the year-ago quarter. Revenues from e-commerce services  decreased 75.7% year over year to $0.8 million.   Profitability Performance  Gross profit decreased 8% from the year-ago quarter to $59.3 million. Operating income from continuing operations came in at $29.0 million in the reported quarter against operating loss of $9.6 million in the prior-year quarter, owing to a decline in operating expenses. Operating expenses of $30.3 million decreased 53% year over year due to lower bad debt and staff costs. Selling expenses of $16.1 million increased 12.5% year over year. General and administrative expenses decreased to $15.7 million from $50.7 million in the year-ago quarter due to a decline in bad debt and staff cost.   Fang Holdings Limited Price, Consensus and EPS     Surprise          Fang Holdings Limited   price-consensus-eps-surprise-chart    |   Fang Holdings Limited Quote    Balance Sheet  Fang Holdings exited second-quarter 2019 with cash and cash equivalents, restricted cash (current and non-current) and short-term investments of $500.6 million compared with $477.1 million at the end of the prior quarter. Long-term loan was $119.5 million compared with $122.47 million at the end of the prior quarter.    Zacks Rank & Stocks to Consider  Currently, Fang Holdings carries a Zacks Rank #3 (Hold). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  .  Some better-ranked stocks in the broader Zacks Business Services  sector are Huron Consulting HURN  , Accenture ACN  and Fiserv FISV  , each carrying a Zacks Rank #2 (Buy). Long-term expected EPS (three to five years) growth rate for Huron Consulting, Accenture and Fiserv is 13.5%, 10.3% and 12%, respectively.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.  makeArticleAd();  See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Fang Holdings Limited (SFUN): Free Stock Analysis Report   Huron Consulting Group Inc. (HURN): Free Stock Analysis Report   Accenture PLC (ACN): Free Stock Analysis Report   Fiserv, Inc. (FISV): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Fang Holdings Limited SFUN  reported second-quarter 2019 non-GAAP net loss of 2 cents per share. Total revenues came in at $67.6 million.",
    " Revenues in Detail ",
    " Marketing services  revenues of $32.5 million increased 19.3% from the year-ago quarter on the back of Fang's efforts in customer development.",
    " Listing services  revenues of $19.2 million decreased 26% due to lower number of paying members.",
    "Revenues from leads generation services   came in at $10.8 million compared with $2.8 million in the prior-year quarter on the back of increased effectiveness of service and customer development.",
    "Revenues from value-added services  came in at $1.7 million, up 19.9% from the prior-year quarter.",
    " Financial services  revenues of $2.6 million declined 3.2% from the year-ago quarter.",
    "Revenues from e-commerce services  decreased 75.7% year over year to $0.8 million. ",
    " Profitability Performance ",
    "Gross profit decreased 8% from the year-ago quarter to $59.3 million. Operating income from continuing operations came in at $29.0 million in the reported quarter against operating loss of $9.6 million in the prior-year quarter, owing to a decline in operating expenses.",
    "Operating expenses of $30.3 million decreased 53% year over year due to lower bad debt and staff costs. Selling expenses of $16.1 million increased 12.5% year over year. General and administrative expenses decreased to $15.7 million from $50.7 million in the year-ago quarter due to a decline in bad debt and staff cost.",
    "  Fang Holdings Limited Price, Consensus and EPS     Surprise          Fang Holdings Limited   price-consensus-eps-surprise-chart    |   Fang Holdings Limited Quote  ",
    " Fang Holdings Limited Price, Consensus and EPS     Surprise ",
    " Fang Holdings Limited   price-consensus-eps-surprise-chart    |   Fang Holdings Limited Quote ",
    " Balance Sheet ",
    "Fang Holdings exited second-quarter 2019 with cash and cash equivalents, restricted cash (current and non-current) and short-term investments of $500.6 million compared with $477.1 million at the end of the prior quarter. Long-term loan was $119.5 million compared with $122.47 million at the end of the prior quarter.  ",
    " Zacks Rank & Stocks to Consider ",
    "Currently, Fang Holdings carries a Zacks Rank #3 (Hold). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  . ",
    "Some better-ranked stocks in the broader Zacks Business Services  sector are Huron Consulting HURN  , Accenture ACN  and Fiserv FISV  , each carrying a Zacks Rank #2 (Buy). Long-term expected EPS (three to five years) growth rate for Huron Consulting, Accenture and Fiserv is 13.5%, 10.3% and 12%, respectively.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.  makeArticleAd();  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:07:00"
}