{
  "url": "https://www.nasdaq.com/article/wednesday-apple-rumors-new-iphone-se-may-come-out-next-year-cm1207594",
  "title": "Wednesday Apple Rumors: New iPhone SE May Come Out Next Year - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Leading the Apple  (NASDAQ: AAPL ) rumor mill today is news of a second iPhone SE. Today, we'll look at that and other Apple Rumors for Wednesday.",
    "iPhone SE 2 : A new rumor claims that Apple is working on the next iPhone SE , reports 9to5Mac . According to this rumor, the tech company is going to release the iPhone Se 2 in spring 2020. The rumor says that this will be a 4.7-inch smartphone with an LCD display. These rumors also claim that the device will be incredibly similar to the iPhone 8. This likely means it will retain Touch ID instead of switching to Face ID.",
    "New TV : A recent rumor says that the next Apple TV may be coming soon , MacRumors notes. The rumor comes from a leaked code name for the device, which is \"J305AP.\" The exact reveal date of the device is unknown, but it's completely possible that the tech company will announce it during its upcoming September event. If so, it might not be long before it hits store shelves.",
    "New Betas : There are new betas of iOS 13.1, iPadOS 13.1 and tvOS 13 available to download , reports AppleInsider . These new betas are currently only for developers. However, public releases will likely come in the next couple of days. The second iOS 13.1 and iPadOS 13.1 betas come out roughly one week after the first betas were sent out to developers. The betas for iOS 13.1 and iPadOS 13.1 are out before the iOS 13 launch, which is a first for the company.",
    "The post Wednesday Apple Rumors: New iPhone SE May Come Out Next Year appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:40:22"
}