{
  "url": "https://www.nasdaq.com/article/michaels-sets-a-new-course-on-stormy-seas-cm1207654",
  "title": "Michaels Sets a New Course on Stormy Seas - Nasdaq.com",
  "text": [
    " Arts and crafts retailer   The Michaels Companies    (NASDAQ: MIK) reported its second-quarter results early Wednesday   morning. The company is revamping key parts of its operations   under interim leadership, and Chinese tariffs might become a   problem in 2020. Here's a closer look at its latest business update. Michaels second-quarter results: The raw numbers  Data source: Michaels.   GAAP    = generally accepted accounting principles. What happened with Michaels this quarter?  The company bought back shares worth $25 million during the     second quarter. Together with a larger buyback in the third     quarter of 2018, the company has retired 12% of its shares over     the last four quarters. That explains how Michaels was able to     grow its earnings per share while net income posted a decline.     The share repurchase policy now has $373 million remaining,     with no set time limit. Based on current market conditions,     management says that it sees buybacks as \"an attractive use of     cash\" at the moment. It is in the process of tweaking many of its business     processes in order to boost     customer activity in its stores      . An inefficient discount program has been canceled and     replaced by a new coupon system. Popular brands now get more     shelf space in each store, especially in highly visible areas     such as near the checkout counters and on aisle endcaps. These     decisions come with support from business data analytics. Chinese trade tariffs have not yet had much impact on     results, but that may change next year. The cost increases     would fall under fiscal year 2020, and the company is working     on a few mitigation ideas, such as sourcing goods from other     countries and negotiating lower prices from Chinese vendors.     Even so,     higher tariffs could trigger some real pain for     Michaels      . If the Trump administration implements the so-called List 4     of tariff expansions on Dec. 15, Michaels could see its cost of     goods rise by as much as $500 million next year. That would be     a 16% increase over the current annual run-rate for cost of     goods sold. Michaels' total net income over the last four     quarters stopped at $327 million.    Michaels wants to cater to highly engaged crafts     enthusiasts, or \"makers.\" Image source: Getty Images.  What management had to say In the       earnings call    , interim CEO Mark Cosby provided an overview of Michaels'   revamped long-term strategy: We have defined our target customer as the core   maker. This is someone that is interested in DIY, crafting,   creating fine arts, or just injecting more creativity into their   life. This target customer definition was the result of   significant customer research looking at attitudes, behaviors,   and needs of our customers.   We divided them into different customer segments, identifying   key characteristics and spend. Then we conduct another set of   research to learn how the core maker shops with traditional   quantitative surveys, immersive interviews of individual   customers, and focus groups. This research has led us to believe   that we can better focus on this core maker and increase our   overall market share. These core makers represent two-thirds of   all arts and crafts spend, and importantly indicate a strong   desire to spend more on DIY projects.  The existence of these core customers isn't exactly breaking   news, but Michaels is shifting its focus to a more tightly   defined \"maker\" market in a big way. Management believes that the   best path toward sustainable growth involves supporting the   makers at the cost of losing the less-committed arts and crafts   hobbyists. \"Our new purpose is: We're here for the makers,\" Cosby said.   \"We will not be abandoning categories, just making sure the mix   within a category is right. Seasonal products come to mind as a   question, but this category is very important to the core maker,   as they like to decorate for events.\" Looking ahead Michaels provided the following guidance:  In the third quarter, comparable-store sales should come in     flat to up by 1%. That metric landed at +0.3% in the second     quarter after a 2.9% dip in the first quarter. Adjusted third-quarter earnings should land near $0.49 per     diluted share. For comparison, adjusted earnings came in at     $0.19 per share in the second quarter and $0.48 per share in     the third quarter of 2018. Full-year net sales are expected to land near $5.18     billion. This target stood at $5.22 billion three months     ago. Adjusted earnings for the full fiscal year are now seen in     the neighborhood of $2.37 per share. That's a slight boost from     the $2.35 expected in the first-quarter report's guidance.    10 stocks we like better than The Michaels     Companies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and The Michaels Companies     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Anders Bylund      has no position in any of the stocks mentioned. The Motley Fool     recommends The Michaels Companies. The Motley Fool has a     disclosure policy      .  ",
    "Arts and crafts retailer   The Michaels Companies    (NASDAQ: MIK) reported its second-quarter results early Wednesday   morning. The company is revamping key parts of its operations   under interim leadership, and Chinese tariffs might become a   problem in 2020.",
    "Here's a closer look at its latest business update.",
    "Data source: Michaels.   GAAP    = generally accepted accounting principles.",
    "  Michaels wants to cater to highly engaged crafts     enthusiasts, or \"makers.\" Image source: Getty Images. ",
    "Michaels wants to cater to highly engaged crafts     enthusiasts, or \"makers.\" Image source: Getty Images.",
    "In the       earnings call    , interim CEO Mark Cosby provided an overview of Michaels'   revamped long-term strategy:",
    "We divided them into different customer segments, identifying   key characteristics and spend. Then we conduct another set of   research to learn how the core maker shops with traditional   quantitative surveys, immersive interviews of individual   customers, and focus groups. This research has led us to believe   that we can better focus on this core maker and increase our   overall market share. These core makers represent two-thirds of   all arts and crafts spend, and importantly indicate a strong   desire to spend more on DIY projects.",
    "The existence of these core customers isn't exactly breaking   news, but Michaels is shifting its focus to a more tightly   defined \"maker\" market in a big way. Management believes that the   best path toward sustainable growth involves supporting the   makers at the cost of losing the less-committed arts and crafts   hobbyists.",
    "\"Our new purpose is: We're here for the makers,\" Cosby said.   \"We will not be abandoning categories, just making sure the mix   within a category is right. Seasonal products come to mind as a   question, but this category is very important to the core maker,   as they like to decorate for events.\"",
    "Michaels provided the following guidance:",
    "  10 stocks we like better than The Michaels     Companies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and The Michaels Companies     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than The Michaels     Companies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and The Michaels Companies     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Anders Bylund      has no position in any of the stocks mentioned. The Motley Fool     recommends The Michaels Companies. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 07:47:00"
}