{
  "url": "https://www.nasdaq.com/article/as-trade-talks-loom-chinese-firms-look-into-buying-us-farm-goods-20190912-00256",
  "title": "As trade talks loom, Chinese firms look into buying U.S. farm goods - Nasdaq.com",
  "text": [
    "By Stella Qiu and Dominique Patton",
    "BEIJING, Sept 12 (Reuters) - Chinese companies have started to inquire about prices for U.S. agricultural goods purchases, Beijing said on Thursday, in a further sign of potential de-escalation in the bitter and protracted trade war between the world's two largest economies.",
    "The move comes before a planned meeting in early October between top U.S. and Chinese trade negotiators in Washington aimed at easing a trade conflict that has disrupted global supply chains and rattled financial markets.",
    "Speaking at a weekly news briefing in Beijing on Thursday, Chinese Commerce Ministry spokesman Gao Feng said China welcomed the U.S. move.",
    "\"According to my understanding, Chinese firms have started to inquire about prices for U.S. agricultural goods. (China) hopes both sides would continue to meet each other half way and adopt concrete actions to create favourable conditions for negotiations,\" Gao said.",
    "Possible purchases of U.S. farm goods included pork and soybeans, Gao said, both of which are still subject to hefty Chinese duties.",
    "Despite tariffs of 62% in place since last year, U.S. exports of pork to China jumped 51% in the first seven months of 2019 over last year to 240,000 tonnes, according to the U.S. Meat Export Federation.",
    "In July alone, the United States exported about 3,000 containers, or almost 61,000 tonnes of pork, as buyers stepped up purchases amid a huge shortfall in China due to a massive outbreak of African swine fever that has driven prices to record levels.",
    "China reduced purchases of U.S. farm products in August, after U.S. President Donald Trump vowed to impose new tariffs on around $300 billion of Chinese goods, blaming Beijing for not having fulfilled a promise to buy large volumes of U.S. farm products and abruptly dimming prospects of a trade deal. ",
    "Gao said working-level teams from both countries would meet soon to prepare for the next round of top-level talks between Chinese Vice Premier Liu He, and U.S. Trade Representative Robert Lighthizer and Treasury Secretary Steven Mnuchin.",
    "On Wednesday, the United States agreed to delay increasing tariffs on $250 billion worth of Chinese imports from Oct. 1 to Oct. 15 \"as a gesture of goodwill.\" The tariffs on those goods were set to increase to 30% from 25%.",
    "Earlier on Wednesday, China announced it was exempting 16 types of U.S. products from tariffs, including some anti-cancer drugs and lubricants, as well as animal feed ingredients whey and fish meal."
  ],
  "published_datetime": "2019-09-12 04:12:00"
}