{
  "url": "https://www.nasdaq.com/article/twilio-inc-twlo-stock-sinks-as-market-gains-what-you-should-know-cm1210803",
  "title": "Twilio Inc. (TWLO) Stock Sinks As Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Twilio Inc. (TWLO) closed at $109.72 in the latest trading session, marking a -0.26% move from the prior day. This change lagged the S&P 500's 0.72% gain on the day. At the same time, the Dow added 0.85%, and the tech-heavy Nasdaq gained 1.06%. Prior to today's trading, shares of the company had lost 16.69% over the past month. This has lagged the Computer and Technology sector's gain of 2.17% and the S&P 500's gain of 2.25% in that time. TWLO will be looking to display strength as it nears its nex t earnings  release. The company is expected to report EPS of $0.01, down 85.71% from the prior-year quarter. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $287.69 million, up 70.33% from the year-ago period. Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $0.17 per share and revenue of $1.12 billion. These totals would mark changes of +54.55% and +71.7%, respectively, from last year. Investors might also notice recent changes to analyst estimates for TWLO. These revisions help to show the ever-changing nature of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Based on our research, we believe these estimate revisions are directly related to near-team stock moves. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. TWLO is currently a Zacks Rank #3 (Hold). Looking at its valuation, TWLO is holding a Forward P/E ratio of 659.05. This valuation marks a premium compared to its industry's average Forward P/E of 55.35. Meanwhile, TWLO's PEG ratio is currently 39.96. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Internet - Software was holding an average PEG ratio of 2.79 at yesterday's closing price. The Internet - Software industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 79, which puts it in the top 31% of all 250+ industries. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Be sure to follow all of these stock-moving metrics, and many more, on Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Twilio Inc. (TWLO): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Twilio Inc. (TWLO) closed at $109.72 in the latest trading session, marking a -0.26% move from the prior day. This change lagged the S&P 500's 0.72% gain on the day. At the same time, the Dow added 0.85%, and the tech-heavy Nasdaq gained 1.06%.",
    "Prior to today's trading, shares of the company had lost 16.69% over the past month. This has lagged the Computer and Technology sector's gain of 2.17% and the S&P 500's gain of 2.25% in that time.",
    "TWLO will be looking to display strength as it nears its nex t earnings  release. The company is expected to report EPS of $0.01, down 85.71% from the prior-year quarter. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $287.69 million, up 70.33% from the year-ago period.",
    "Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $0.17 per share and revenue of $1.12 billion. These totals would mark changes of +54.55% and +71.7%, respectively, from last year.",
    "Investors might also notice recent changes to analyst estimates for TWLO. These revisions help to show the ever-changing nature of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Based on our research, we believe these estimate revisions are directly related to near-team stock moves. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. TWLO is currently a Zacks Rank #3 (Hold).",
    "Looking at its valuation, TWLO is holding a Forward P/E ratio of 659.05. This valuation marks a premium compared to its industry's average Forward P/E of 55.35.",
    "Meanwhile, TWLO's PEG ratio is currently 39.96. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Internet - Software was holding an average PEG ratio of 2.79 at yesterday's closing price.",
    "The Internet - Software industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 79, which puts it in the top 31% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Be sure to follow all of these stock-moving metrics, and many more, on Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:45:20"
}