{
  "url": "https://www.nasdaq.com/article/mcdonalds-strategic-efforts-bode-well-should-you-hold-cm1206753",
  "title": "McDonald's Strategic Efforts Bode Well: Should You Hold? - Nasdaq.com",
  "text": [
    " Robust delivery channel, accelerated deployment of EOTF restaurants, sales-building initiatives and growth in international markets bode well for McDonald's Corporation MCD  . As a result, the stock has gained 20.8% in the past six months compared with the industry  's 20.8% rally. However, high labor costs and currency headwinds remain concerns. Let's delve deeper.  Growth Drivers  To provide augmented convenience to customers, McDonald's is increasingly focusing on delivery. The company recently stated that it is expanding the McDelivery service with DoorDash. The recent deal will enable McDonald's to expand from 9,000 to more than 10,000 restaurants via these two partners in all 50 states. McDonald's and DoorDash deal will also give customers premier access to their favorite McDonald's menu items whenever and wherever they want via mobile order and pay or McDelivery.  makeArticleAd();  Moreover, this Zacks Rank #3 (Hold) company's sales-building efforts are driving global comps. The metric grew 6.5%, when the company reported second-quarter 2019 results, marking its 16th straight quarter of positive comps. Also, U.S comps increased 5.7% in the same period. In order to drive comps in the United States, McDonald's aims at improving its focus on growing guest traffic. In this regard, the company's emphasis on operational excellence, product innovation, offering a value menu and rolling out more limited-time offerings is worth mentioning. The United Kingdom reported 53rd straight quarter of like-for-like sales growth. Meanwhile, Australia, Canada, France, Germany and Italy are all witnessing robust sales growth.    Growing guest counts remains the company's top priority and it intends to regain customers by focusing on food quality, convenience and value. Moreover, McDonald's expects its velocity accelerators of Experience of the Future, digital and delivery to drive growth over the long term.     Obstacles to Overcome  Of late, McDonald's margins have been under pressure due to worldwide wage increases and EOTF related depreciation in the United States. Meanwhile, apart from minimum wage increases, additional health care costs related to 'Obamacare' in the United States are escalating labor costs.    Furthermore, costs associated with brand positioning in all the key markets as well as ongoing investments in initiatives would continue to weigh on margins, at least in the near term. Increased commodity costs may further weigh on margins. In the second quarter, consolidated margins contracted 100 bps, following a 20 bps decline in the preceding quarter.   Key Picks    Better-ranked stocks worth considering in the same space include Brinker International, Inc. EAT  , Dunkin' Brands Group, Inc. DNKN  and Shake Shack Inc. SHAK  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   . Brinker International, Dunkin' Brands Group and Shake Shack have an impressive long-term earnings growth rate of 7.3%, 10.9% and 22.5%, respectively.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   McDonald's Corporation (MCD): Free Stock Analysis Report   Shake Shack, Inc. (SHAK): Free Stock Analysis Report   Brinker International, Inc. (EAT): Free Stock Analysis Report   Dunkin' Brands Group, Inc. (DNKN): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Robust delivery channel, accelerated deployment of EOTF restaurants, sales-building initiatives and growth in international markets bode well for McDonald's Corporation MCD  . As a result, the stock has gained 20.8% in the past six months compared with the industry  's 20.8% rally. However, high labor costs and currency headwinds remain concerns. Let's delve deeper.",
    " Growth Drivers ",
    "To provide augmented convenience to customers, McDonald's is increasingly focusing on delivery. The company recently stated that it is expanding the McDelivery service with DoorDash. The recent deal will enable McDonald's to expand from 9,000 to more than 10,000 restaurants via these two partners in all 50 states. McDonald's and DoorDash deal will also give customers premier access to their favorite McDonald's menu items whenever and wherever they want via mobile order and pay or McDelivery.  makeArticleAd();  Moreover, this Zacks Rank #3 (Hold) company's sales-building efforts are driving global comps. The metric grew 6.5%, when the company reported second-quarter 2019 results, marking its 16th straight quarter of positive comps. Also, U.S comps increased 5.7% in the same period. In order to drive comps in the United States, McDonald's aims at improving its focus on growing guest traffic. In this regard, the company's emphasis on operational excellence, product innovation, offering a value menu and rolling out more limited-time offerings is worth mentioning. The United Kingdom reported 53rd straight quarter of like-for-like sales growth. Meanwhile, Australia, Canada, France, Germany and Italy are all witnessing robust sales growth.    Growing guest counts remains the company's top priority and it intends to regain customers by focusing on food quality, convenience and value. Moreover, McDonald's expects its velocity accelerators of Experience of the Future, digital and delivery to drive growth over the long term.",
    "    Obstacles to Overcome ",
    "Of late, McDonald's margins have been under pressure due to worldwide wage increases and EOTF related depreciation in the United States. Meanwhile, apart from minimum wage increases, additional health care costs related to 'Obamacare' in the United States are escalating labor costs.    Furthermore, costs associated with brand positioning in all the key markets as well as ongoing investments in initiatives would continue to weigh on margins, at least in the near term. Increased commodity costs may further weigh on margins. In the second quarter, consolidated margins contracted 100 bps, following a 20 bps decline in the preceding quarter.   Key Picks    Better-ranked stocks worth considering in the same space include Brinker International, Inc. EAT  , Dunkin' Brands Group, Inc. DNKN  and Shake Shack Inc. SHAK  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    "Brinker International, Dunkin' Brands Group and Shake Shack have an impressive long-term earnings growth rate of 7.3%, 10.9% and 22.5%, respectively.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:52:00"
}