{
  "url": "https://www.nasdaq.com/article/acorda-acor-down-more-than-60-in-3-months-heres-why-cm1206739",
  "title": "Acorda (ACOR) Down More Than 60% in 3 Months: Here's Why - Nasdaq.com",
  "text": [
    " Shares of Acorda Therapeutics, Inc. ACOR  have declined sharply in the past three months. The stock has plunged 65.1%, significantly wider than the industry's  decrease of 3.5%.    Acorda's lead multiple sclerosis (MS) drug Ampyra is facing generic competition in the United States. Notably, during the first half of 2019, sales of Ampyra tanked significantly year over year due to generic launches. Last September, Ampyra lost its exclusivity as generics entered the market including Mylan's MYL  authorized generic version. However, Ampyra's sales were higher than the company's internal projections in the second quarter because sales erosion due to generic launches was less severe. Meanwhile, the company still believes that Ampyra sales will see a sharp fall moving ahead. Acorda is heavily dependent on Ampyra to draw major part of its revenues and losing out on the same in the upcoming quarters will thus be a major blow to the company's top line. Meanwhile, Acorda's Parkinson disease (PD) drug Inbrija, launched in February this year, generated sales of $3 million in the second quarter, reflecting a significant sequential increase. The company believes that Inbrija sales will pick up in the future quarters, having received an encouraging feedback from doctors as well as patients since its launch. Notably, last December, the FDA approved Inbrija. Following this nod, the product became the first and the only approved inhaled levodopa for treating OFF periods in patients suffering Parkinson's and receiving a carbidopa / levodopa regimen. In July 2019, the European Medicines Agency's (EMA) Committee for Medicinal Products for Human Use (CHMP) rendered a positive opinion recommending the approval of Inbrija in Europe. A final decision is expected by this year end. We would like to remind investors that the successful commercialization of Inbrija is imperative to Acorda's long-term growth, especially as generic competition looms large on Ampyra. Although Inbrija is off to a promising start, it still remains to be seen if the product can deliver the desired results and be a worthy replacement for Ampyra in the long run. Notably, more than 3,50,000 people in the United States are suffering OFF periods related to Parkinson's disease. Acorda estimates Inbrija's market opportunity to be more than $800 million in the United States. Although Inbrija is pretty new to the market, the drug's successful commercialization along with its sales uptick should help the stock recover in the days ahead.  Acorda Therapeutics, Inc. Price         Acorda Therapeutics, Inc. price    |   Acorda Therapeutics, Inc. Quote    Zacks Rank & Other Stocks to Consider  Acorda currently sports a Zacks Rank #1 (Strong Buy). Other top-ranked stocks in the healthcare sector include Emmaus Life Sciences, Inc. EMMA  and NuCana PLC NCNA  , both sporting the same solid Zacks Rank as Acorda. You can see   the complete list of today's Zacks #1 Rank stocks   here  .  Emmaus Life's loss per share estimates have been narrowed 17.8% for 2019 and 26.4% for 2020 over the past 60 days. NuCana's loss per share estimates have been narrowed 17.5% for 2019 and 16% for 2020 over the past 60 days.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they   spend on marijuana. makeArticleAd();   Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has   identified 5 stocks that could soar in response to the powerful demand. One industry insider described   the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Acorda Therapeutics, Inc. (ACOR): Free Stock Analysis Report   Mylan N.V. (MYL): Free Stock Analysis Report   NuCana PLC Sponsored ADR (NCNA): Free Stock Analysis Report   Emmaus Life Sciences, Inc. (EMMA): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Shares of Acorda Therapeutics, Inc. ACOR  have declined sharply in the past three months. The stock has plunged 65.1%, significantly wider than the industry's  decrease of 3.5%.",
    "Acorda's lead multiple sclerosis (MS) drug Ampyra is facing generic competition in the United States. Notably, during the first half of 2019, sales of Ampyra tanked significantly year over year due to generic launches. Last September, Ampyra lost its exclusivity as generics entered the market including Mylan's MYL  authorized generic version.",
    "However, Ampyra's sales were higher than the company's internal projections in the second quarter because sales erosion due to generic launches was less severe. Meanwhile, the company still believes that Ampyra sales will see a sharp fall moving ahead.",
    "Acorda is heavily dependent on Ampyra to draw major part of its revenues and losing out on the same in the upcoming quarters will thus be a major blow to the company's top line.",
    "Meanwhile, Acorda's Parkinson disease (PD) drug Inbrija, launched in February this year, generated sales of $3 million in the second quarter, reflecting a significant sequential increase. The company believes that Inbrija sales will pick up in the future quarters, having received an encouraging feedback from doctors as well as patients since its launch.",
    "Notably, last December, the FDA approved Inbrija. Following this nod, the product became the first and the only approved inhaled levodopa for treating OFF periods in patients suffering Parkinson's and receiving a carbidopa / levodopa regimen.",
    "In July 2019, the European Medicines Agency's (EMA) Committee for Medicinal Products for Human Use (CHMP) rendered a positive opinion recommending the approval of Inbrija in Europe. A final decision is expected by this year end.",
    "We would like to remind investors that the successful commercialization of Inbrija is imperative to Acorda's long-term growth, especially as generic competition looms large on Ampyra. Although Inbrija is off to a promising start, it still remains to be seen if the product can deliver the desired results and be a worthy replacement for Ampyra in the long run.",
    "Notably, more than 3,50,000 people in the United States are suffering OFF periods related to Parkinson's disease. Acorda estimates Inbrija's market opportunity to be more than $800 million in the United States.",
    "Although Inbrija is pretty new to the market, the drug's successful commercialization along with its sales uptick should help the stock recover in the days ahead.",
    " Acorda Therapeutics, Inc. Price ",
    "       Acorda Therapeutics, Inc. price    |   Acorda Therapeutics, Inc. Quote  ",
    " Acorda Therapeutics, Inc. price    |   Acorda Therapeutics, Inc. Quote ",
    " Zacks Rank & Other Stocks to Consider ",
    "Acorda currently sports a Zacks Rank #1 (Strong Buy). Other top-ranked stocks in the healthcare sector include Emmaus Life Sciences, Inc. EMMA  and NuCana PLC NCNA  , both sporting the same solid Zacks Rank as Acorda. You can see   the complete list of today's Zacks #1 Rank stocks   here  . ",
    "Emmaus Life's loss per share estimates have been narrowed 17.8% for 2019 and 26.4% for 2020 over the past 60 days.",
    "NuCana's loss per share estimates have been narrowed 17.5% for 2019 and 16% for 2020 over the past 60 days.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they   spend on marijuana. makeArticleAd();   Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has   identified 5 stocks that could soar in response to the powerful demand. One industry insider described   the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:00:00"
}