{
  "url": "https://www.nasdaq.com/article/johnson-johnson-jnj-gains-but-lags-market-what-you-should-know-cm1207623",
  "title": "Johnson & Johnson (JNJ) Gains But Lags Market: What You Should Know - Nasdaq.com",
  "text": [
    " Johnson & Johnson (JNJ) closed the most recent trading day at $128.86, moving +0.09% from the previous trading session. The stock lagged the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%. Coming into today, shares of the world's biggest maker of health care products had lost 1.55% in the past month. In that same time, the Medical sector lost 1.27%, while the S&P 500 lost 0.68%. Investors will be hoping for strength from JNJ as it approaches its nex t earnings  release. On that day, JNJ is projected to report earnings of $2 per share, which would represent a year-over-year decline of 2.44%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $20.09 billion, down 1.25% from the year-ago period. For the full year, our Zacks Consensus Estimates are projecting earnings of $8.60 per share and revenue of $81.51 billion, which would represent changes of +5.13% and -0.09%, respectively, from the prior year. It is also important to note the recent changes to analyst estimates for JNJ. These revisions help to show the ever-changing nature of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. JNJ is currently sporting a Zacks Rank of #3 (Hold). Valuation is also important, so investors should note that JNJ has a Forward P/E ratio of 14.97 right now. Its industry sports an average Forward P/E of 14.06, so we one might conclude that JNJ is trading at a premium comparatively. It is also worth noting that JNJ currently has a PEG ratio of 2.18. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. JNJ's industry had an average PEG ratio of 2.03 as of yesterday's close. The Large Cap Pharmaceuticals industry is part of the Medical sector. This group has a Zacks Industry Rank of 30, putting it in the top 12% of all 250+ industries. The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Johnson & Johnson (JNJ): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Johnson & Johnson (JNJ) closed the most recent trading day at $128.86, moving +0.09% from the previous trading session. The stock lagged the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%.",
    "Coming into today, shares of the world's biggest maker of health care products had lost 1.55% in the past month. In that same time, the Medical sector lost 1.27%, while the S&P 500 lost 0.68%.",
    "Investors will be hoping for strength from JNJ as it approaches its nex t earnings  release. On that day, JNJ is projected to report earnings of $2 per share, which would represent a year-over-year decline of 2.44%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $20.09 billion, down 1.25% from the year-ago period.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of $8.60 per share and revenue of $81.51 billion, which would represent changes of +5.13% and -0.09%, respectively, from the prior year.",
    "It is also important to note the recent changes to analyst estimates for JNJ. These revisions help to show the ever-changing nature of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. JNJ is currently sporting a Zacks Rank of #3 (Hold).",
    "Valuation is also important, so investors should note that JNJ has a Forward P/E ratio of 14.97 right now. Its industry sports an average Forward P/E of 14.06, so we one might conclude that JNJ is trading at a premium comparatively.",
    "It is also worth noting that JNJ currently has a PEG ratio of 2.18. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. JNJ's industry had an average PEG ratio of 2.03 as of yesterday's close.",
    "The Large Cap Pharmaceuticals industry is part of the Medical sector. This group has a Zacks Industry Rank of 30, putting it in the top 12% of all 250+ industries.",
    "The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:45:24"
}