{
  "url": "https://www.nasdaq.com/article/validea-kenneth-fisher-strategy-daily-upgrade-report-952019-cm1207698",
  "title": "Validea Kenneth Fisher Strategy Daily Upgrade Report - 9/5/2019 - Nasdaq.com",
  "text": [
    "The following are today's upgrades for Validea's Price/Sales Investor model based on the published strategy of Kenneth Fisher . This value strategy rewards stocks with low P/S ratios, long-term profit growth, strong free cash flow and consistent profit margins.",
    "CIM COMMERCIAL TRUST CORP ( CMCT ) is a small-cap value stock in the Real Estate Operations industry. The rating according to our strategy based on Kenneth Fisher changed from 40% to 70% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: CIM Commercial Trust Corporation, together with its subsidiaries, primarily invests in, owns, and operates Class A and office investments in urban communities throughout the United States. These communities are located in areas that include traditional downtown areas and suburban main streets. The Company's segments are office, hotel, multifamily and lending. The products for its office segment primarily include rental of office space and other tenant services, including tenant reimbursements, parking, and storage space rental. The products for its multifamily segment include rental of apartments and other tenant services. The products for its hotel segment include revenues generated from the operations of hotel properties and rental income generated from a garage located directly across the street from one of the hotels. The Company is managed by affiliates of CIM Group, L.P. ( CIM ), a vertically integrated, full-service investment manager.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "Since its inception, Validea's strategy based on Kenneth Fisher has returned 322.67% vs. 195.52% for the S&P 500. For more details on this strategy, click here",
    "About Kenneth Fisher : The son of Philip Fisher, who is considered the \"Father of Growth Investing\", Kenneth Fisher is a money manager, bestselling author, and longtime Forbes columnist. The younger Fisher wowed Wall Street in the mid-1980s when his book Super Stocks first popularized the idea of using the price/sales ratio ( PSR ) as a means of identifying attractive stocks. According to his alma mater, Humboldt State University, Fisher is also one of the world's foremost experts on 19th century logging. Appropriately, Fisher's firm, Fisher Investments, is located in a lush forest preserve in Woodside, California, where the contrarian-minded Fisher says he and his employees can get away from Wall Street groupthink.",
    "About Validea : Validea is an investment research service that follows the published strategies of investment legends. Validea offers both stock analysis and model portfolios based on gurus who have outperformed the market over the long-term, including Warren Buffett, Benjamin Graham, Peter Lynch and Martin Zweig. For more information about Validea, click here",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 08:04:06"
}