{
  "url": "https://www.nasdaq.com/article/purdue-pharma-nears-partial-opioid-settlement-bankruptcy-filing-20190911-00609",
  "title": "Purdue Pharma nears partial opioid settlement, bankruptcy filing - Nasdaq.com",
  "text": [
    "By Mike Spector and Jessica DiNapoli",
    "NEW YORK, Sept 11 (Reuters) - OxyContin maker Purdue Pharma LP is nearing a partial agreement to resolve widespread litigation over its alleged role in fueling the U.S. opioid crisis and plans to tussle with states opposing its settlement offer in bankruptcy proceedings starting as soon as next week, people familiar with the matter said.",
    "Late on Tuesday, lead lawyers representing more than 2,000 cities, counties and other plaintiffs suing Purdue, along with more than two dozen states and U.S. territories, were close to agreeing on an offer from the company and its controlling Sackler family to settle lawsuits in a deal valued at up to $12 billion, the people said.",
    "Purdue's board is scheduled to be briefed on settlement progress on Thursday, one of the people said. There remained a chance negotiations could fall apart and the company's plans, including the timing of a bankruptcy filing, could change, the person said.",
    "The Sacklers, well-known wealthy philanthropists, have declined to revise their proposed settlement contribution of $3 billion over seven years and another $1.5 billion or more through the eventual sale of another business they own called Mundipharma, several people familiar with the matter said.",
    "New York, Massachusetts and Connecticut, where privately-held Purdue is based, are among the states opposed to the current offer and have pushed the family to guarantee $4.5 billion, the people said.",
    "Last weekend, the Sacklers \"refused to budge\" after attorneys general in North Carolina and Tennessee presented the family with counterproposals they said had widespread support from other states, according to correspondence reviewed by Reuters.",
    "The lawsuits, which have in some cases targeted the Sacklers as well as Purdue, claim the family and company contributed to a public health crisis that claimed the lives of nearly 400,000 people between 1999 and 2017, according to the latest data from the U.S. Centers for Disease Control and Prevention.",
    "The suits allege Purdue aggressively marketed prescription painkillers while misleading doctors and patients about their addiction and overdose risks. Purdue and the Sacklers have denied the allegations.",
    "FAMILY CONTRIBUTION A STICKING POINT",
    "With negotiations over the family's contribution to a settlement at loggerheads, Purdue is preparing to file for bankruptcy protection as soon as this weekend or next with the outlines of a settlement in hand, albeit one lacking support from many states, the people said.",
    "Purdue would then ask a U.S. bankruptcy judge to halt litigation while settlement discussions continue, a move some states are likely, they said. A bankruptcy judge could force holdouts to accept a settlement as part of Purdue's reorganization plan if enough other plaintiffs agree (graphic).",
    "\"The family supports working toward a global resolution that directs resources to the patients, families and communities across the country who are suffering and need assistance,\" members of the Sackler family, including some who previously served on Purdue's board, said in a statement.",
    "\"This is the most effective way to address the urgency of the current public health crisis, and to fund real solutions, not endless litigation,\" the statement added.",
    "Company representatives had no immediate comment.",
    "With Purdue facing more than 2,000 opioid-related lawsuits, Reuters reported in March that the company and the Sacklers began exploring bankruptcy options to halt litigation and attempt to reach a far-reaching settlement rather than fight every case individually. ",
    "One reason Purdue is eyeing a bankruptcy filing soon is to avoid an Oct. 21 trial, the people said. That trial, stemming from widespread lawsuits largely brought by local governments that have been consolidated in an Ohio federal court, risks a verdict with outsize damages Purdue could not withstand, one of the people said.",
    "Purdue's current proposal envisions it using bankruptcy proceedings to transform into a public trust with a board selected by court-appointed trustees, the people said. The trust would donate drugs the company developed to combat overdoses and addiction to U.S. communities, which Purdue values at $4.45 billion over 10 years.",
    "The Sacklers, who amassed a multibillion-dollar fortune from OxyContin sales, would cede control of Purdue, they said.",
    "A Chapter 11 filing with a deal many states oppose risks triggering even more litigation and longer, more expensive bankruptcy proceedings that could reduce payouts to plaintiffs unless a broader deal is reached.",
    "\"I remain steadfast in my view that the Sacklers have to give back the money they took from selling opioids so that we can put it toward solving the problem they created,\" said Connecticut Attorney General William Tong in a statement provided to Reuters. \"The current proposal does not do that. This is not the end—there is a long road to go and we are ready for this fight and ready go to the distance.\"",
    "The Sacklers have rebuffed requests from some plaintiffs for more details on the family's finances to address concerns more settlement money could be available, some of the people said."
  ],
  "published_datetime": "2019-09-11 12:25:00"
}