{
  "url": "https://www.nasdaq.com/article/why-american-eagle-outfitters-stock-was-slammed-wednesday-cm1207432",
  "title": "Why American Eagle Outfitters Stock Was Slammed Wednesday - Nasdaq.com",
  "text": [
    "  What happened  Shares of apparel retailer   American Eagle    (NYSE: AEO) took a hit on Wednesday, falling about 14% as of   11:30 a.m. EDT. The stock's decline follows the company's fiscal   second-quarter results, which were released before market open on   Wednesday. Investors were likely disappointed by American   Eagle's comparable sales growth rate, as the key metric came in   below what analysts were looking for.   Image source: Getty Images.makeArticleAd();   So what  American Eagle reported total revenue of $1.04 billion, up 8%   year over year. Non-   GAAP    (adjusted) earnings per share for the   specialty retailer    were $0.39. Both of these metrics were higher than consensus   analyst estimates for revenue and non-GAAP EPS of $1 billion and   $0.32, respectively. Comparable sales growth of 2%, however, was below analysts'   expectations and marked a significant deceleration from   comparable sales growth of 6% in the company's fiscal first   quarter. \"We faced challenges largely stemming from underperformance in   certain seasonal categories and a delayed start to   back-to-school,\" said American Eagle CEO Jay Schottenstein in the   company's second-quarter earnings release. But the CEO noted that   it saw strong momentum in AE jeans, Aerie, and its digital   channel during the quarter. Now what Schottenstein provided an upbeat take on the current quarter,   saying, \"The AE team has taken quick action to strengthen the   business and we are pleased to see an improvement in third   quarter-to-date sales.\" He added, \"Our brands remain strong and   we are well-positioned to continue to grow and gain market   share.\" For its fiscal third quarter, management expects comparable   sales to rise in the low- to mid-single digits.   10 stocks we like better than American Eagle     Outfitters       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and American Eagle Outfitters     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Daniel Sparks      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of apparel retailer   American Eagle    (NYSE: AEO) took a hit on Wednesday, falling about 14% as of   11:30 a.m. EDT.",
    "The stock's decline follows the company's fiscal   second-quarter results, which were released before market open on   Wednesday. Investors were likely disappointed by American   Eagle's comparable sales growth rate, as the key metric came in   below what analysts were looking for.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "American Eagle reported total revenue of $1.04 billion, up 8%   year over year. Non-   GAAP    (adjusted) earnings per share for the   specialty retailer    were $0.39. Both of these metrics were higher than consensus   analyst estimates for revenue and non-GAAP EPS of $1 billion and   $0.32, respectively.",
    "Comparable sales growth of 2%, however, was below analysts'   expectations and marked a significant deceleration from   comparable sales growth of 6% in the company's fiscal first   quarter.",
    "\"We faced challenges largely stemming from underperformance in   certain seasonal categories and a delayed start to   back-to-school,\" said American Eagle CEO Jay Schottenstein in the   company's second-quarter earnings release. But the CEO noted that   it saw strong momentum in AE jeans, Aerie, and its digital   channel during the quarter.",
    "Schottenstein provided an upbeat take on the current quarter,   saying, \"The AE team has taken quick action to strengthen the   business and we are pleased to see an improvement in third   quarter-to-date sales.\" He added, \"Our brands remain strong and   we are well-positioned to continue to grow and gain market   share.\"",
    "For its fiscal third quarter, management expects comparable   sales to rise in the low- to mid-single digits.",
    "  10 stocks we like better than American Eagle     Outfitters       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and American Eagle Outfitters     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than American Eagle     Outfitters       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and American Eagle Outfitters     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Daniel Sparks      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 12:16:00"
}