{
  "url": "https://www.nasdaq.com/article/donaldson-sees-uneven-demand-in-fiscal-2020-cm1208164",
  "title": "Donaldson Sees Uneven Demand in Fiscal 2020 - Nasdaq.com",
  "text": [
    " Filtration systems and replacement parts conglomerate   Donaldson Company    (NYSE: DCI) released fiscal fourth-quarter 2019 earnings before   markets opened for trading on Thursday. The global industrial   concern, which manufactures its products at 43 plants worldwide,   coupled a flattish top line in the fourth quarter with operating   income that trailed the prior-year period by a few percentage   points. A large swing in income tax expense dented ne   t earnings    , however. Let's walk through essential details from the last   three months, and discuss management's rather cautious outlook on   the coming fiscal year. Note that all comparative numbers in this article are   presented against those of the prior-year quarter. The raw numbers  Data source: Donaldson Company. EPS = earnings per share.makeArticleAd(); What happened with Donaldson this quarter?  The organization realized roughly 1 percentage point of     pricing power this quarter and added another 1.3% to its top     line through its December 2018 acquisition of fume extraction     systems manufacturer BOFA International. These positive sales     factors were offset by 2 percentage points of foreign currency     translation, resulting in the meager revenue advance over the     fourth quarter of 2018. Net revenue in Donaldson's engine product segment dipped by     1.1%, as aftermarket sales (the company's largest business     line) improved by just 0.3%, to $335.3 million. Off-road sales     decreased by 10.1% to $75.1 million due to weaker domestic     results, partially mitigated by strong international sales.     On-road product sales rose by 1.5% to $44.2 million. The     aerospace and defense business achieved a 4% increase in sales,     to $32.1 million. The company's industrial products segment exhibited a bit     more momentum, as total net revenue improved by 3.3% to $240.2     million. Industrial filtration solutions sales notched a 6.2%     gain to $172.5 million, while gas turbine systems sales rose     nearly 7% to $25.8 million. Special applications dragged on the     segment's top line, however, as computer disk drive filtration     product sales slipped roughly 9% to $41.9 million. Unfavorable product mix, higher supply chain costs, and     rising raw materials costs pushed     gross margin       lower by 140     basis points      to 33.5%. Operating income declined by 3.5% to $104.4 million. The     large disparity in net earnings between periods, however, as     seen in the table above, is due primarily to income tax expense     adjustments related to final clarification of regulations from     the 2017 Tax Cut and Jobs Act. Donaldson recorded $40.7 million     in income tax expense this quarter, against just $1.1 million     in the fourth quarter of fiscal 2018. The company pointed out that share repurchases of $24.7     million during the quarter brought its full-year share buyback     tally to $129.2 million, equaling 2% of outstanding shares     repurchased this year.    Image source: Getty Images.  Management's perspective Having a finger on the pulse of global macroeconomic   conditions is vital for manufacturers with international supply   chains, as well as   those seeking to invest in quality stocks of   multinational companies over a moderate-to-long time frame    . In Donaldson's earnings press release, CEO Tod Carpenter   communicated the company's wary outlook on product demand in the   next 12-month period. Carpenter did also note that Donaldson   still expects to repeat its achievement of record bottom-line   results in fiscal 2020:  Our fiscal 2020 plan reflects focused portfolio management     in an uneven demand environment. It is likely that uncertainty     related to global trade and the political environment will keep     our customers cautious, and some of our engine-related end     markets are nearing the peak of their economic cycle. As these     factors affect demand, our innovative products with recurring     revenue, combined with disciplined expense planning, give us     greater stability and flexibility as we remain focused on the     future. We are making incremental investments to drive our     strategic priorities in 2020, and we are aggressively pursuing     gross margin improvement opportunities. Our company is aligned     on our strategic and operational objectives, and we are excited     about our path to delivering another year of record profit.  Looking forward Donaldson issued full-year fiscal 2020 guidance alongside   earnings on Thursday. For the coming year, the organization   projects sales growth of between -2% and 4%.   Operating margin    is expected to land between 13.9% and 14.5%, an improvement   against the 13.6% mark recorded in fiscal 2019. Management   anticipates diluted earnings per share of $2.21 to $2.37, which   will represent a 12% advance in profit over the prior year at the   midpoint of the range. Shareholders seemed amenable to the   financial projections despite management's caution around next   year's sales demand: Shares rose roughly 4% in early trading   Thursday morning.   10 stocks we like better than Donaldson       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Donaldson wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Asit Sharma      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Filtration systems and replacement parts conglomerate   Donaldson Company    (NYSE: DCI) released fiscal fourth-quarter 2019 earnings before   markets opened for trading on Thursday. The global industrial   concern, which manufactures its products at 43 plants worldwide,   coupled a flattish top line in the fourth quarter with operating   income that trailed the prior-year period by a few percentage   points. A large swing in income tax expense dented ne   t earnings    , however. Let's walk through essential details from the last   three months, and discuss management's rather cautious outlook on   the coming fiscal year.",
    "Note that all comparative numbers in this article are   presented against those of the prior-year quarter.",
    "Data source: Donaldson Company. EPS = earnings per share.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Having a finger on the pulse of global macroeconomic   conditions is vital for manufacturers with international supply   chains, as well as   those seeking to invest in quality stocks of   multinational companies over a moderate-to-long time frame    . In Donaldson's earnings press release, CEO Tod Carpenter   communicated the company's wary outlook on product demand in the   next 12-month period. Carpenter did also note that Donaldson   still expects to repeat its achievement of record bottom-line   results in fiscal 2020:",
    "Our fiscal 2020 plan reflects focused portfolio management     in an uneven demand environment. It is likely that uncertainty     related to global trade and the political environment will keep     our customers cautious, and some of our engine-related end     markets are nearing the peak of their economic cycle. As these     factors affect demand, our innovative products with recurring     revenue, combined with disciplined expense planning, give us     greater stability and flexibility as we remain focused on the     future. We are making incremental investments to drive our     strategic priorities in 2020, and we are aggressively pursuing     gross margin improvement opportunities. Our company is aligned     on our strategic and operational objectives, and we are excited     about our path to delivering another year of record profit.",
    "Donaldson issued full-year fiscal 2020 guidance alongside   earnings on Thursday. For the coming year, the organization   projects sales growth of between -2% and 4%.   Operating margin    is expected to land between 13.9% and 14.5%, an improvement   against the 13.6% mark recorded in fiscal 2019. Management   anticipates diluted earnings per share of $2.21 to $2.37, which   will represent a 12% advance in profit over the prior year at the   midpoint of the range. Shareholders seemed amenable to the   financial projections despite management's caution around next   year's sales demand: Shares rose roughly 4% in early trading   Thursday morning.",
    "  10 stocks we like better than Donaldson       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Donaldson wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Donaldson       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Donaldson wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Asit Sharma      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:56:00"
}