{
  "url": "https://www.nasdaq.com/article/binance-launches-dollar-backed-crypto-stablecoin-with-nydfs-blessing-cm1207929",
  "title": "Binance Launches Dollar-Backed Crypto Stablecoin With NYDFS Blessing - Nasdaq.com",
  "text": [
    "Crypto exchange Binance is launching a dollar-backed   stablecoin in the U.S.",
    "Moreover, the new Binance USD (BUSD) has received the blessing   of the New York Department of Financial Services (NYDFS). The   exchange announced Thursday that NYDFS   had approved   the new offering    , which Binance is launching in partnership with the Paxos Trust   Company.",
    "The Binance stablecoin will be backed by U.S. dollars on a 1:1   ratio, according to a press release. The offering joins the   Paxos Standard and the   Gemini Dollar    as an NYDFS-approved stablecoin.",
    " Related: Paxos Launches Gold-Backed Cryptocurrency ",
    "At launch, verified Paxos customers will be able to directly   purchase BUSD tokens through the company's wallet using either   U.S. dollars or PAX, its own stablecoin. Binance users will   likewise be able to trade BUSD for bitcoin, binance coin or   XRP.",
    "The exchange   previously announced    its intention to issue stablecoins worldwide as part of its Venus   project. Binance has already issued stablecoins pegged to bitcoin   (BTCB) and the British pound (BGBP).",
    "In a statement, Binance CEO Changpeng Zhao (\"CZ\") said:",
    "\"We hope to unlock more financial services for the greater     blockchain ecosystem through the issuance of BUSD, including     more use cases and utility through the power of stable digital     assets.\"",
    " Related: Binance Acquires Crypto Exchange JEX to Boost     Derivatives Offerings ",
    "Binance USD is only the latest stablecoin whose reserves are   being held by Paxos. The company, which was the first crypto firm   to receive a trust charter from NYDFS in 2015 (as the   itBit Trust Company    ), now custodies the dollar reserves for its own   Paxos Standard stablecoin    and   Huobi's HUSD token    .",
    "According to the company, Paxos will act as both the custodian   and the issuer for BUSD, and will regularly audit the dollar   holdings.",
    "Paxos co-founder Rich Teo said in a statement that BUSD would   be \"a vital step towards long term stability in global   crypto markets.\" He added that Paxos' \"stablecoin as a service\"   offering allowed Binance to customize the new product for its   users.",
    "\"Paxos is leading the digital trusts space and we are excited   to work with them in developing our native stablecoin,\" CZ   said.",
    " Changpeng Zhao via CoinDesk archives ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:00:30"
}