{
  "url": "https://www.nasdaq.com/article/stock-market-news-signet-sparkles-will-lululemon-get-a-lift-cm1208171",
  "title": "Stock Market News: Signet Sparkles; Will lululemon Get a Lift? - Nasdaq.com",
  "text": [
    " Thursday morning gave investors an impressive opening on Wall   Street. Stock market indexes soared on reports that Chinese   leaders would still meet with U.S. trade officials despite the   increased tensions between the two nations in recent weeks.   Investors took the news as a sign that the worst-case scenarios   on trade are unlikely to play out. As of 11 a.m. EDT, the   Dow Jones Industrial Average    (DJINDICES: ^DJI) was up 446 points to 26,802. The   S&P 500    (SNPINDEX: ^GSPC) rose 41 points to 2,979, and the   Nasdaq Composite    (NASDAQINDEX: ^IXIC) picked up 139 points to 8,116. Earnings season is almost over, but there are still a few   noteworthy companies that are reporting their results. Jewelry   retailer   Signet Jewelers    (NYSE: SIG) wowed its shareholders with sparkling results during   the second quarter, and those who follow yoga apparel specialist   lululemon athletica    (NASDAQ: LULU) hope that its numbers will look equally   healthy.   Image source: Lululemon Athletica.makeArticleAd();  A diamond in the rough Shares of Signet Jewelers jumped 21% following the jewelry   retailer's report of its second-quarter financial results. Even   though some of the numbers might not appear all that impressive   on their face, investors were pleased to see signs of improvement   for the company. Revenue during the quarter was down almost 4% from year-ago   levels, driven largely by a 1.5% drop in same-store sales for the   period. Adjusted earnings per share also fell year over year.   However, Signet's bottom line doubled what most investors had   expected from the jeweler. Signet was also upbeat about its future, raising some of its   guidance. The company still expects same-store sales to fall   between 1.5% and 2.5% on the year, but it boosted its adjusted   earnings projections by $0.03 to $0.06 to a new range of $2.91 to   $3.23 per share.  Some investors have criticized Signet    for failing to achieve the higher margins that some of its luxury   retail rivals have achieved. However, shareholders have high   hopes that the company's turnaround efforts are finally starting   to pay off and will show continued improvement in the months to   come. Strike a pose Shares of Lululemon Athletica were higher Thursday morning,   climbing 3% as investors anticipated the   yoga apparel retailer's second-quarter financial   report    after the market closes    this afternoon. Lululemon has been on a roll this year, with its   stock having soared by more than half since the beginning of   2019, and shareholders are hoping for more. Lululemon does face some near-term challenges that could weigh   on its immediate performance. Rising tariff rates have had an   impact on the retailer, and that's prompted the company to take   measures to try to control increasing costs. However, over the long run, a lot is going right for   Lululemon. Quality control issues seem to be behind it, and   expansion into international markets beyond North America holds a   lot of promise for the yoga retailer. Competition in athletic   apparel more broadly has been fierce, but Lululemon hasn't   hesitated to push into other areas like outerwear in its efforts   to dominate the category. Investors want to see Lululemon remain the   growth stock success story     that it's been for a long time. Many retailers have   reported good results recently, but we'll have to wait until this   afternoon before we'll know whether Lululemon's in the same   position.   10 stocks we like better than Lululemon     Athletica       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Lululemon Athletica     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Dan Caplinger      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Lululemon Athletica. The Motley     Fool has a     disclosure policy      .  ",
    "Thursday morning gave investors an impressive opening on Wall   Street. Stock market indexes soared on reports that Chinese   leaders would still meet with U.S. trade officials despite the   increased tensions between the two nations in recent weeks.   Investors took the news as a sign that the worst-case scenarios   on trade are unlikely to play out. As of 11 a.m. EDT, the   Dow Jones Industrial Average    (DJINDICES: ^DJI) was up 446 points to 26,802. The   S&P 500    (SNPINDEX: ^GSPC) rose 41 points to 2,979, and the   Nasdaq Composite    (NASDAQINDEX: ^IXIC) picked up 139 points to 8,116.",
    "Earnings season is almost over, but there are still a few   noteworthy companies that are reporting their results. Jewelry   retailer   Signet Jewelers    (NYSE: SIG) wowed its shareholders with sparkling results during   the second quarter, and those who follow yoga apparel specialist   lululemon athletica    (NASDAQ: LULU) hope that its numbers will look equally   healthy.",
    "  Image source: Lululemon Athletica.makeArticleAd(); ",
    "Image source: Lululemon Athletica.",
    "Shares of Signet Jewelers jumped 21% following the jewelry   retailer's report of its second-quarter financial results. Even   though some of the numbers might not appear all that impressive   on their face, investors were pleased to see signs of improvement   for the company.",
    "Revenue during the quarter was down almost 4% from year-ago   levels, driven largely by a 1.5% drop in same-store sales for the   period. Adjusted earnings per share also fell year over year.   However, Signet's bottom line doubled what most investors had   expected from the jeweler.",
    "Signet was also upbeat about its future, raising some of its   guidance. The company still expects same-store sales to fall   between 1.5% and 2.5% on the year, but it boosted its adjusted   earnings projections by $0.03 to $0.06 to a new range of $2.91 to   $3.23 per share.",
    " Some investors have criticized Signet    for failing to achieve the higher margins that some of its luxury   retail rivals have achieved. However, shareholders have high   hopes that the company's turnaround efforts are finally starting   to pay off and will show continued improvement in the months to   come.",
    "Shares of Lululemon Athletica were higher Thursday morning,   climbing 3% as investors anticipated the   yoga apparel retailer's second-quarter financial   report    after the market closes    this afternoon. Lululemon has been on a roll this year, with its   stock having soared by more than half since the beginning of   2019, and shareholders are hoping for more.",
    "Lululemon does face some near-term challenges that could weigh   on its immediate performance. Rising tariff rates have had an   impact on the retailer, and that's prompted the company to take   measures to try to control increasing costs.",
    "However, over the long run, a lot is going right for   Lululemon. Quality control issues seem to be behind it, and   expansion into international markets beyond North America holds a   lot of promise for the yoga retailer. Competition in athletic   apparel more broadly has been fierce, but Lululemon hasn't   hesitated to push into other areas like outerwear in its efforts   to dominate the category.",
    "Investors want to see Lululemon remain the   growth stock success story     that it's been for a long time. Many retailers have   reported good results recently, but we'll have to wait until this   afternoon before we'll know whether Lululemon's in the same   position.",
    "  10 stocks we like better than Lululemon     Athletica       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Lululemon Athletica     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Lululemon     Athletica       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Lululemon Athletica     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Dan Caplinger      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Lululemon Athletica. The Motley     Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:16:30"
}