{
  "url": "https://www.nasdaq.com/article/interesting-grpn-call-options-for-october-11th-cm1206754",
  "title": "Interesting GRPN Call Options For October 11th - Nasdaq.com",
  "text": [
    "Investors in Groupon Inc (Symbol: GRPN) saw new options begin trading today, for the October 11th expiration. At Stock Options Channel  , our YieldBoost formula has looked up and down the GRPN options chain for the new October 11th contracts and identified the following call contract of particular interest.    The call contract at the $2.50 strike price has a current bid of 9 cents. If an investor was to purchase shares of GRPN stock at the current price level of $2.41/share, and then sell-to-open that call contract as a \"covered call,\" they are committing to sell the stock at $2.50. Considering the call seller will also collect the premium, that would drive a total return (excluding dividends, if any) of 7.47% if the stock gets called away at the October 11th expiration (before broker commissions). Of course, a lot of upside could potentially be left on the table if GRPN shares really soar, which is why looking at the trailing twelve month trading history for Groupon Inc, as well as studying the business fundamentals becomes important. Below is a chart showing GRPN's trailing twelve month trading history, with the $2.50 strike highlighted in red:    Considering the fact that the $2.50 strike represents an approximate 4% premium to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the covered call contract would expire worthless, in which case the investor would keep both their shares of stock and the premium collected. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 57%. On our website under the contract detail page for this contract  , Stock Options Channel will track those odds over time to see how they change and publish a chart of those numbers (the trading history of the option contract will also be charted). Should the covered call contract expire worthless, the premium would represent a 3.73% boost of extra return to the investor, or 35.87% annualized, which we refer to as the YieldBoost  .makeArticleAd();    The implied volatility in the call contract example above is 70%.    Meanwhile, we calculate the actual trailing twelve month volatility (considering the last 250 trading day closing values as well as today's price of $2.41) to be 43%. For more put and call options contract ideas worth looking at, visit StockOptionsChannel.com.   Top YieldBoost Calls of the S&P 500 »  ",
    "Considering the fact that the $2.50 strike represents an approximate 4% premium to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the covered call contract would expire worthless, in which case the investor would keep both their shares of stock and the premium collected. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 57%. On our website under the contract detail page for this contract  , Stock Options Channel will track those odds over time to see how they change and publish a chart of those numbers (the trading history of the option contract will also be charted). Should the covered call contract expire worthless, the premium would represent a 3.73% boost of extra return to the investor, or 35.87% annualized, which we refer to as the YieldBoost  .",
    "  Top YieldBoost Calls of the S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:40:44"
}