{
  "url": "https://www.nasdaq.com/article/walgreens-changes-firearm-policy-joining-kroger-and-walmart-20190905-00893",
  "title": "Walgreens changes firearm policy, joining Kroger and Walmart - Nasdaq.com",
  "text": [
    "By Melissa Fares",
    "Sept 5 (Reuters) - Walgreens Boots Alliance Inc  said on Thursday it would start asking customers to not carry firearms in its stores, joining Walmart Inc  and Kroger Co , in a change of gun policy following several deadly mass shootings in the United States.",
    "\"We are joining other retailers in asking our customers to no longer openly carry firearms into our stores other than authorized law enforcement officials,\" the Deerfield, Illinois-based pharmacy chain said in an emailed statement.",
    "The three retailers are among a growing number of U.S. companies, such as Delta Air Lines  and Bank of America , that are responding to calls for action to help curtail the rash of gun violence that has plagued the nation, risking backlash from powerful gun owners' groups as politicians  consider options.",
    "Shannon Watts, founder of gun control advocacy group Moms Demand Action, said she has put pressure on Walgreens to stop allowing open carry since 2015 and applauded the retailer's announcement on Thursday.",
    "\"We hope Senate leaders are watching this sea change,\" Watts said. \"We'll take this momentum to Washington when Congress is back from recess on Monday.\"",
    "The Democrat-controlled House of Representatives passed a bill intended to close loopholes around background checks for gun purchases and other measures in February, but it has not been taken up by the Republican-led Senate.",
    "Watts said she is also calling on CVS Health Corp  and supermarket chain Wegmans Holdings  to ask customers not to bring guns into their stores as well.",
    "\"CVS Pharmacy stores do not sell firearms or ammunition and we respect the efforts of Moms Demand Action and other groups that are working to prevent gun violence,\" the company said in an emailed statement.",
    "\"We prohibit employees from carrying weapons at work and support efforts to prevent weapons where we work and shop,\" it added. ",
    "A Wegmans' spokeswoman declined to comment."
  ],
  "published_datetime": "2019-09-05 01:43:00"
}