{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-boeing-starbucks-3m-deere-and-dollar-general-cm1206614",
  "title": "The Zacks Analyst Blog Highlights: Boeing, Starbucks, 3M, Deere and Dollar General - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 3, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Boeing BA  , Starbucks SBUX  , 3M MMM  , Deere DE  and Dollar General DG  .  Here are highlights from Friday's Analyst Blog:    Top Research Reports for Boeing, Starbucks and 3M   The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features updated research reports on 16 major stocks, including Boeing, Starbucks and 3M. These research reports have been hand-picked from roughly 70 reports published by our analyst team today. You can see    all of    today's research reports here     >>>     Boeing  's shares have gained +12.5% year to date, underperforming the Zacks Aerospace & Defense industry, which has increased +26.6% during the same time period. The Zacks analyst stresses that Boeing remains the largest aircraft manufacturer globally in terms of revenues, orders and deliveries, and one of the major aerospace and defense contractors. Boeing expects the commercial fleet to be fueled by sustained annual growth in commercial passenger traffic along with a big wave of retiring, old planes. Its proposed joint venture with Embraer is expected to strengthen Boeing's commercial business significantly. However, the commercial business suffered a major setback lately due to lower 737 deliveries, following the 737 Max product line's grounding and subsequent costs associated with it. Consequently, its revenues, earnings and cash flow position were affected significantly. (You can    read the full research report on Boeing here     >>>    ). Shares of Starbucks  are up +37.9% over the past six months, outperforming the Zacks Food & Restaurants industry, which is up +21% over the same period. The Zacks analyst thinks the momentum is likely to continue as the company reported solid third-quarter fiscal 2019 earnings and also raised its full-year view. Notably, earnings surpassed the estimates in each of the trailing five quarters. Robust Americas and CAP comps too bode well. The company now anticipates global comps growth of nearly 4%. Non-GAAP EPS is expected to be $2.80-$2.82, up from $2.75-$2.79 guided previously. Meanwhile, Starbucks' business is rapidly growing in China, courtesy of innovative store designs and the success of the MSR program. Also, operating fundamentals such as solid global footprint, successful innovations, best-in-class loyalty program and digital offerings are encouraging. However, operating margin contraction over the past few quarters has been a concern. (You can    read the full research report on Starbucks here     >>>    ).  3M  's shares have lost -22.7% in the past six months, underperforming the Zacks Diversified Operations industry, which has declined -4.6% over the same period. The Zacks analyst thinks 3M stands to gain from efforts to innovate products, solid demand, restructuring actions and shareholder-friendly policies over the long run. Its acquisition of the technology business of M*Modal is benefiting the Health Information Systems business. Also, divestments of advanced ballistic-protection business (not yet complete), and the gas and flame detection business (closed in August 2019) will help the company concentrate on more profitable businesses. Also, it faces risks from forex woes (likely to impact sales by 1%), high tax rates, rising costs and restructuring charges. For 2019, the company predicts earnings to be $9.25-$9.75 per share, down from $10.46 recorded in 2018. (You can    read the full research report on 3M here     >>>    ). Other noteworthy reports we are featuring today include Deere and Dollar General.  Today's Best Stocks from Zacks  Would you like to see the updated picks from our best market-beating strategies? From 2017 through 2018, while the S&P 500 gained +15.8%, five of our screens returned +38.0%, +61.3%, +61.6%, +68.1% and +98.3%. This outperformance has not just been a recent phenomenon. From 2000 - 2018, while the S&P averaged +4.8% per year, our top strategies averaged up to +56.2% per year.    See their latest picks free >>    Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  The Boeing Company (BA): Free Stock Analysis Report   3M Company (MMM): Free Stock Analysis Report   Deere & Company (DE): Free Stock Analysis Report   Dollar General Corporation (DG): Free Stock Analysis Report   Starbucks Corporation (SBUX): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 3, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Boeing BA  , Starbucks SBUX  , 3M MMM  , Deere DE  and Dollar General DG  .",
    " Here are highlights from Friday's Analyst Blog: ",
    "  Top Research Reports for Boeing, Starbucks and 3M  ",
    "The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features updated research reports on 16 major stocks, including Boeing, Starbucks and 3M. These research reports have been hand-picked from roughly 70 reports published by our analyst team today.",
    "You can see    all of    today's research reports here     >>>   ",
    " Boeing  's shares have gained +12.5% year to date, underperforming the Zacks Aerospace & Defense industry, which has increased +26.6% during the same time period. The Zacks analyst stresses that Boeing remains the largest aircraft manufacturer globally in terms of revenues, orders and deliveries, and one of the major aerospace and defense contractors.",
    "Boeing expects the commercial fleet to be fueled by sustained annual growth in commercial passenger traffic along with a big wave of retiring, old planes. Its proposed joint venture with Embraer is expected to strengthen Boeing's commercial business significantly.",
    "However, the commercial business suffered a major setback lately due to lower 737 deliveries, following the 737 Max product line's grounding and subsequent costs associated with it. Consequently, its revenues, earnings and cash flow position were affected significantly.",
    "(You can    read the full research report on Boeing here     >>>    ).",
    "Shares of Starbucks  are up +37.9% over the past six months, outperforming the Zacks Food & Restaurants industry, which is up +21% over the same period. The Zacks analyst thinks the momentum is likely to continue as the company reported solid third-quarter fiscal 2019 earnings and also raised its full-year view.",
    "Notably, earnings surpassed the estimates in each of the trailing five quarters. Robust Americas and CAP comps too bode well. The company now anticipates global comps growth of nearly 4%. Non-GAAP EPS is expected to be $2.80-$2.82, up from $2.75-$2.79 guided previously.",
    "Meanwhile, Starbucks' business is rapidly growing in China, courtesy of innovative store designs and the success of the MSR program. Also, operating fundamentals such as solid global footprint, successful innovations, best-in-class loyalty program and digital offerings are encouraging. However, operating margin contraction over the past few quarters has been a concern.",
    "(You can    read the full research report on Starbucks here     >>>    ).",
    " 3M  's shares have lost -22.7% in the past six months, underperforming the Zacks Diversified Operations industry, which has declined -4.6% over the same period. The Zacks analyst thinks 3M stands to gain from efforts to innovate products, solid demand, restructuring actions and shareholder-friendly policies over the long run.",
    "Its acquisition of the technology business of M*Modal is benefiting the Health Information Systems business. Also, divestments of advanced ballistic-protection business (not yet complete), and the gas and flame detection business (closed in August 2019) will help the company concentrate on more profitable businesses.",
    "Also, it faces risks from forex woes (likely to impact sales by 1%), high tax rates, rising costs and restructuring charges. For 2019, the company predicts earnings to be $9.25-$9.75 per share, down from $10.46 recorded in 2018.",
    "(You can    read the full research report on 3M here     >>>    ).",
    "Other noteworthy reports we are featuring today include Deere and Dollar General.",
    " Today's Best Stocks from Zacks ",
    "Would you like to see the updated picks from our best market-beating strategies? From 2017 through 2018, while the S&P 500 gained +15.8%, five of our screens returned +38.0%, +61.3%, +61.6%, +68.1% and +98.3%.",
    "This outperformance has not just been a recent phenomenon. From 2000 - 2018, while the S&P averaged +4.8% per year, our top strategies averaged up to +56.2% per year.",
    "   See their latest picks free >>   ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:02:00"
}