{
  "url": "https://www.nasdaq.com/article/top-ranked-momentum-stocks-to-buy-for-september-11th-cm1210697",
  "title": "Top Ranked Momentum Stocks to Buy for September 11th - Nasdaq.com",
  "text": [
    "Here are three stocks with buy rank and strong momentum characteristics for investors to consider today, September 11th:",
    "Asbury Automotive Group, Inc. (ABG): This automotive retail and service company has a Zacks Rank #1 (Strong Buy) and witnessed the Zacks Consensus Estimate for its current year earnings increasing 3.2% over the last 60 days.",
    "Asbury Automotive Group, Inc. Price and Consensus",
    "Asbury Automotive Group, Inc. price-consensus-chart | Asbury Automotive Group, Inc. Quote",
    "Asbury Automotive's shares gained 12.9% over the last one month compared to S&P 500's rise of 3.8%. The company possesses a Momentum Score  of B.",
    "Asbury Automotive Group, Inc. Price",
    "Asbury Automotive Group, Inc. price | Asbury Automotive Group, Inc. Quote",
    "Applied Therapeutics, Inc. (APLT): This clinical-stage biopharmaceutical company has a Zacks Rank #2 (Buy) and witnessed the Zacks Consensus Estimate for its current year earnings increasing 9% over the last 60 days.",
    "Applied Therapeutics Inc. Price and Consensus",
    "Applied Therapeutics Inc. price-consensus-chart | Applied Therapeutics Inc. Quote",
    "Applied Therapeutics' shares gained 7.7% over the last one month. The company possesses a Momentum Score of A.",
    "Applied Therapeutics Inc. Price",
    "Applied Therapeutics Inc. price | Applied Therapeutics Inc. Quote",
    "Air Industries Group (AIRI): This manufacturer of precision equipment assemblies and components for aerospace and defense contractors has a Zacks Rank #2 (Buy) and witnessed the Zacks Consensus Estimate for its current year earnings increasing 8.3% over the last 60 days.",
    "Air Industries Group Price and Consensus",
    "Air Industries Group price-consensus-chart | Air Industries Group Quote",
    "Air Industries' shares gained 32.4% over the last one month. The company possesses a Momentum Score of B.",
    "Air Industries Group Price",
    "Air Industries Group price | Air Industries Group Quote",
    "See the full list of top ranked stocks here",
    "Learn more about the Momentum score and how it is calculated here.",
    "Looking for Stocks with Skyrocketing Upside?",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.\r\n Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "See the pot trades we're targeting>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 12:42:00"
}