{
  "url": "https://www.nasdaq.com/article/twilio-gains-traction-from-partnership-wins-global-growth-cm1207382",
  "title": "Twilio Gains Traction From Partnership Wins, Global Growth - Nasdaq.com",
  "text": [
    "  Twilio's TWLO  efforts toward expanding its global footprint are commendable. The company is making strategic alliances as well as employing more employees outside the U.S. office to enhance international operations. Notably, the company recently announced new partnerships with seven local consulting firms in Japan to widen its presence in the country. The new consulting partners in the region include NTT Communications, NTT Data Smart Sourcing, Pound4Technology, Serverworks, TerraSky and UL Systems. Moreover, to strengthen its expansion efforts in the country, the company hired former Amazon and Workday executive Yoshihiro Konno as head of Japan. Talking about its expansive efforts in Japan, management stated that its partnership with Japan-based KDDI Web Communications (KWC) in 2013 has helped it witness phenomenal growth in the region over the last six years.  Focus on Fortifying International Footprint: A Key   Driver  Twilio is benefiting from the growing uptake of its platform in the international market. Increasing digital transformation among organizations is leading to higher demand for Twilio's communication platform, which is fuelling growth for the company. The company is continuously making investments in catering to the needs of a broader range of global developers and enterprises. Its focus on broadening its operations outside the United States by collaborating with global strategic partners is a tailwind. The company serves more than 180 countries currently. Notably, revenues from international customers accounted for 25% in 2018 compared with 23% in 2017. International revenues soared 83% year over year to $165.3 million last year. Growth in the company's products usage, particularly Programmable Messaging products and Programmable Voice products by the existing international Active Customer Accounts is driving revenues. Moreover, relationships with consulting partners are helping the company offer enterprises with limited software development expertise consulting and development services to incorporate build Twilio platform in their software applications. Stretching partnership deals with consulting partners to develop the ecosystem for its solutions will aid the company to boost awareness and adoption of its products, which in turn, will drive the company's growth.   Twilio Inc. Revenue (TTM)      Twilio Inc. revenue-ttm    |   Twilio Inc. Quote    Zacks Rank & Stocks to Consider  Twilio currently has a Zacks Rank #3 (Hold). A few better-ranked stocks in the broader technology sector are Anixter International AXE  , LogMeIn LOGM  and Perficient PRFT  , each flaunting a Zacks Rank #1 (Strong Buy). You can see   the complete list of today's Zacks #1 Rank stocks   here .   Long-term earnings growth rate for Anixter, LogMeIn and Perficient is currently projected to be 8%, 5% and 10.8%, respectively.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Twilio Inc. (TWLO): Free Stock Analysis Report   LogMein, Inc. (LOGM): Free Stock Analysis Report   Perficient, Inc. (PRFT): Free Stock Analysis Report   Anixter International Inc. (AXE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Twilio's TWLO  efforts toward expanding its global footprint are commendable. The company is making strategic alliances as well as employing more employees outside the U.S. office to enhance international operations.",
    "Notably, the company recently announced new partnerships with seven local consulting firms in Japan to widen its presence in the country.",
    "The new consulting partners in the region include NTT Communications, NTT Data Smart Sourcing, Pound4Technology, Serverworks, TerraSky and UL Systems.",
    "Moreover, to strengthen its expansion efforts in the country, the company hired former Amazon and Workday executive Yoshihiro Konno as head of Japan.",
    "Talking about its expansive efforts in Japan, management stated that its partnership with Japan-based KDDI Web Communications (KWC) in 2013 has helped it witness phenomenal growth in the region over the last six years.",
    " Focus on Fortifying International Footprint: A Key   Driver ",
    "Twilio is benefiting from the growing uptake of its platform in the international market. Increasing digital transformation among organizations is leading to higher demand for Twilio's communication platform, which is fuelling growth for the company.",
    "The company is continuously making investments in catering to the needs of a broader range of global developers and enterprises. Its focus on broadening its operations outside the United States by collaborating with global strategic partners is a tailwind.",
    "The company serves more than 180 countries currently. Notably, revenues from international customers accounted for 25% in 2018 compared with 23% in 2017. International revenues soared 83% year over year to $165.3 million last year.",
    "Growth in the company's products usage, particularly Programmable Messaging products and Programmable Voice products by the existing international Active Customer Accounts is driving revenues.",
    "Moreover, relationships with consulting partners are helping the company offer enterprises with limited software development expertise consulting and development services to incorporate build Twilio platform in their software applications.",
    "Stretching partnership deals with consulting partners to develop the ecosystem for its solutions will aid the company to boost awareness and adoption of its products, which in turn, will drive the company's growth.",
    "  Twilio Inc. Revenue (TTM)      Twilio Inc. revenue-ttm    |   Twilio Inc. Quote  ",
    " Twilio Inc. Revenue (TTM) ",
    " Twilio Inc. revenue-ttm    |   Twilio Inc. Quote ",
    " Zacks Rank & Stocks to Consider ",
    "Twilio currently has a Zacks Rank #3 (Hold). A few better-ranked stocks in the broader technology sector are Anixter International AXE  , LogMeIn LOGM  and Perficient PRFT  , each flaunting a Zacks Rank #1 (Strong Buy). You can see   the complete list of today's Zacks #1 Rank stocks   here .  ",
    "Long-term earnings growth rate for Anixter, LogMeIn and Perficient is currently projected to be 8%, 5% and 10.8%, respectively.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:18:00"
}