{
  "url": "https://www.nasdaq.com/article/mallinckrodt-to-divest-contract-manufacturing-unit-stock-up-cm1210638",
  "title": "Mallinckrodt to Divest Contract Manufacturing Unit, Stock Up - Nasdaq.com",
  "text": [
    " Shares of the beleaguered generic maker, Mallinckrodt plc MNK  , gained 84.7% on Sep 10, after it announced plans to sell its contract manufacturing unit. Investors cheered the move as the company will have some free cash to deal with liabilities from the ongoing lawsuits related to the misuse of opioid-based drugs. Mallinckrodt's shares have plunged so far this year due to pricing pressure in the generic segment and the rising menace of penalties regarding litigations.   Mallinckrodt public limited company Price        Mallinckrodt public limited company price    |   Mallinckrodt public limited company Quote   Mallinckrodt inked a definitive agreement to sell its wholly-owned subsidiary, BioVectra Inc., to an affiliate of H.I.G. Capital for approximately $250 million. BioVectra is a contract development and manufacturing organization (CDMO), which provides global pharmaceutical and biotech companies with full-service cGMP outsourcing solutions for intermediates and active pharmaceutical ingredients (APIs). The total payment includes a fixed consideration of $175 million, comprising an upfront payment of $135 million and a long-term note of $40 million, and contingent payments of up to $75 million. The transaction is expected to close in the fourth quarter of 2019. The decision to sell the CDMO comes at a crucial time for Mallinckrodt, which is striving hard to come out of various litigations related to opioid drugs. The company recently reached a settlement in principle with Cuyahoga and Summit Counties in Ohio concerning lawsuits pending in multidistrict opioid litigation (MDL). The settlement will fully resolve the Track 1 cases against Mallinckrodt and subsidiaries that are scheduled to go on trial in October 2019 in the MDL. Per the terms, the company will pay $24 million in cash and donate $6 million to generic products, including addiction treatment products. Last week, shares of Mallinckrodt plummeted after a Bloomberg report suggested that the company may file for bankruptcy to limit its liabilities related to the pending opioid litigations. Per the report, Mallinckrodt hired restructuring advisers to explore options that could help avoid the multi-district litigation scheduled in October. Moreover, its high-debt levels will make matters worse if a settlement is reached or a penalty is imposed by the court. The company may also divest its generic business, which includes opioid drugs. Apart from Mallinckrodt, many pharma companies like Endo International ENDP  and Teva Pharma TEVA  are embroiled in multiple opioid litigations filed by several states, counties and other political subdivisions in the United States regarding the abuse of opioid-based drugs. The industry players are accused of faulty marketing practices, which downplayed addiction risks from these drugs and spurred their consumption instead. Earlier, Johnson & Johnson JNJ  received an unfavorable ruling in the court case filed by the state authorities of Oklahoma pertaining to the abuse of its opioid-based drugs and was levied a fine of $572 million. Mallinckrodt currently carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana. Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Johnson & Johnson (JNJ): Free Stock Analysis Report   Endo International plc (ENDP): Free Stock Analysis Report   Teva Pharmaceutical Industries Ltd. (TEVA): Free Stock Analysis Report   Mallinckrodt public limited company (MNK): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Shares of the beleaguered generic maker, Mallinckrodt plc MNK  , gained 84.7% on Sep 10, after it announced plans to sell its contract manufacturing unit.",
    "Investors cheered the move as the company will have some free cash to deal with liabilities from the ongoing lawsuits related to the misuse of opioid-based drugs.",
    "Mallinckrodt's shares have plunged so far this year due to pricing pressure in the generic segment and the rising menace of penalties regarding litigations.",
    "  Mallinckrodt public limited company Price        Mallinckrodt public limited company price    |   Mallinckrodt public limited company Quote  ",
    " Mallinckrodt public limited company Price ",
    " Mallinckrodt public limited company price    |   Mallinckrodt public limited company Quote ",
    "Mallinckrodt inked a definitive agreement to sell its wholly-owned subsidiary, BioVectra Inc., to an affiliate of H.I.G. Capital for approximately $250 million.",
    "BioVectra is a contract development and manufacturing organization (CDMO), which provides global pharmaceutical and biotech companies with full-service cGMP outsourcing solutions for intermediates and active pharmaceutical ingredients (APIs).",
    "The total payment includes a fixed consideration of $175 million, comprising an upfront payment of $135 million and a long-term note of $40 million, and contingent payments of up to $75 million.",
    "The transaction is expected to close in the fourth quarter of 2019.",
    "The decision to sell the CDMO comes at a crucial time for Mallinckrodt, which is striving hard to come out of various litigations related to opioid drugs.",
    "The company recently reached a settlement in principle with Cuyahoga and Summit Counties in Ohio concerning lawsuits pending in multidistrict opioid litigation (MDL). The settlement will fully resolve the Track 1 cases against Mallinckrodt and subsidiaries that are scheduled to go on trial in October 2019 in the MDL. Per the terms, the company will pay $24 million in cash and donate $6 million to generic products, including addiction treatment products.",
    "Last week, shares of Mallinckrodt plummeted after a Bloomberg report suggested that the company may file for bankruptcy to limit its liabilities related to the pending opioid litigations.",
    "Per the report, Mallinckrodt hired restructuring advisers to explore options that could help avoid the multi-district litigation scheduled in October. Moreover, its high-debt levels will make matters worse if a settlement is reached or a penalty is imposed by the court. The company may also divest its generic business, which includes opioid drugs.",
    "Apart from Mallinckrodt, many pharma companies like Endo International ENDP  and Teva Pharma TEVA  are embroiled in multiple opioid litigations filed by several states, counties and other political subdivisions in the United States regarding the abuse of opioid-based drugs. The industry players are accused of faulty marketing practices, which downplayed addiction risks from these drugs and spurred their consumption instead.",
    "Earlier, Johnson & Johnson JNJ  received an unfavorable ruling in the court case filed by the state authorities of Oklahoma pertaining to the abuse of its opioid-based drugs and was levied a fine of $572 million.",
    "Mallinckrodt currently carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 12:13:00"
}