{
  "url": "https://www.nasdaq.com/article/4-stocks-poised-to-gain-despite-dull-us-factory-activity-cm1207318",
  "title": "4 Stocks Poised to Gain Despite Dull U.S. Factory Activity - Nasdaq.com",
  "text": [
    " The Institute for Supply Management's Manufacturing PMI (Purchasing Managers' Indexes) reading in the United States fell to 49.1 in August 2019 from 51.2 a month ago, thus missing market expectations of 51.1. The latest reading pointed to the first month of contraction in the manufacturing sector since January 2016 as new orders and employment declined, mainly due to the fallout of the US-China trade dispute.  Soft Readings  The New Order Index dipped 3.6 points to 47.2 from the month-earlier level while the employment index dropped 4.3 points to 47.4. In addition, the production index slid 1.3 points to 49.5 while the supplier deliveries index decreased 1.9 points to 51.4. The latest data reflects a notable setback in business confidence as businesses grow anxious about the degree to which the trade tariffs might impact demand for their products. Notably, demand has been shrinking as shown by the recent contraction on the New Orders Index. The Consumption (measured by the Production and Employment Indexes) contracted at higher levels, contributing the strongest negative numbers (a combined 5.6% decrease) to the PMI, induced by dearth of demand.   Manufacturing activity which was gaining from the effect of tax cuts and other stimulating measures has seen a blip as tariffs imposition has raised the cost of doing business and shrunk margins. The seven industries reporting contraction in August in the following order are: Apparel, Leather & Allied Products; Fabricated Metal Products; Transportation Equipment; Primary Metals; Plastics & Rubber Products; Paper Products; and Electrical Equipment, Appliances & Components.  No Relief From Trade War in Sight  Over the weekend, Washington imposed a new 15% tariff,  hitting consumer goods ranging from footwear and apparel to home textiles and certain technology products like the Apple Watch. The list doesn't stop here though. A separate batch of about $160 billion worth of Chinese goods including laptops and mobile phones will be levied with 15% tariffs come Dec 15. The repercussions of this trade war have spread across the globe with major economies, such as the U.K., Japan, China, Germany reporting weak factory activity in August. makeArticleAd();   The International Monetary Fund in July further reduced its world growth outlook for 2019 and expects 3.2% expansion, which is the lowest level since the financial crisis amid the uncertainty emanating from the trade conflict.  Plunging Bond Yields and Negative Interest Rates  As investors flock to bonds, which appear to be safer in times of economic uncertainty, bond yields have declined. . Recently, on several occasions, the U.S yield curve, which shows a plot of yield for different bond maturities, was inverted implying that the long-term yield is lower than the short term. This inversion has historically been a leading indicator of recession. A number of central banks across the world have adopted an easy money policy by cutting rates to combat an economic slowdown, which resulted in negative interest rates in countries, namely Germany, France, Netherlands, Switzerland, Japan. Meanwhile, nearly 25 countries have rates near zero.   The recent weak reading from the manufacturing sectors compounds this recessionary fear. This may prompt the Fed to slash the interest rate to boost economy.  Stocks Poised to Gain  Lower interest rates should bode well for sectors like utilities and the real estate, which carry high levels of debt and should benefit from a decline in interest expense. Stocks in these sectors with a top Zacks Rank #1(Strong Buy) and 2 (Buy) should gain the most.  NRG Energy, Inc. NRG  implements sustainable solutions for producing and managing energy to serve residential and commercial customers throughout the country.  The stock currently has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has moved 5% north in the past 30 days. The company's expected earnings growth rate for the current year is 67.63% compared with the Utility - Electric Power  industry's projected 3% growth rate.  Unitil Corporation UTL  , a public utility holding company, engages in the distribution of electricity and natural gas in the United States. The stock currently has a Zacks Rank of 2. The Zacks Consensus Estimate for current-year earnings has been raised 0.8% in the past 60 days. The company's expected earnings growth rate for the current year is 4% compared with the Utility - Electric Power industry's estimated rise of 3.2%.  Independence Realty Trust, Inc. IRT  is focused on acquiring and owning well-located garden-style and mid-rise apartment properties. The stock currently is Zacks #2 Ranked. The Zacks Consensus Estimate for current-year earnings has been revised 2.7% upward in the past 30 days. The company's expected earnings growth rate for the current year is 2.7% versus the REIT and Equity Trust-Residential  industry's expected decline of 0.3%.   Essex Property Trust, Inc. ESS  acquires, develops, redevelops and manages multifamily residential properties in selected West Coast markets. The stock currently has a Zacks Rank #2. The Zacks Consensus Estimate for current-year earnings has been inched 0.4% up in the past 30 days. The company's expected earnings growth rate for 2019 is 6% against the REIT and Equity Trust-Residential industry's expected dip of 0.3%.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>         Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   NRG Energy, Inc. (NRG): Free Stock Analysis Report   Unitil Corporation (UTL): Free Stock Analysis Report   Essex Property Trust, Inc. (ESS): Free Stock Analysis Report   Independence Realty Trust, Inc. (IRT): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "The Institute for Supply Management's Manufacturing PMI (Purchasing Managers' Indexes) reading in the United States fell to 49.1 in August 2019 from 51.2 a month ago, thus missing market expectations of 51.1. The latest reading pointed to the first month of contraction in the manufacturing sector since January 2016 as new orders and employment declined, mainly due to the fallout of the US-China trade dispute.",
    " Soft Readings ",
    "The New Order Index dipped 3.6 points to 47.2 from the month-earlier level while the employment index dropped 4.3 points to 47.4. In addition, the production index slid 1.3 points to 49.5 while the supplier deliveries index decreased 1.9 points to 51.4.",
    "The latest data reflects a notable setback in business confidence as businesses grow anxious about the degree to which the trade tariffs might impact demand for their products. Notably, demand has been shrinking as shown by the recent contraction on the New Orders Index.",
    "The Consumption (measured by the Production and Employment Indexes) contracted at higher levels, contributing the strongest negative numbers (a combined 5.6% decrease) to the PMI, induced by dearth of demand.   Manufacturing activity which was gaining from the effect of tax cuts and other stimulating measures has seen a blip as tariffs imposition has raised the cost of doing business and shrunk margins.",
    "The seven industries reporting contraction in August in the following order are: Apparel, Leather & Allied Products; Fabricated Metal Products; Transportation Equipment; Primary Metals; Plastics & Rubber Products; Paper Products; and Electrical Equipment, Appliances & Components.",
    " No Relief From Trade War in Sight ",
    "Over the weekend, Washington imposed a new 15% tariff,  hitting consumer goods ranging from footwear and apparel to home textiles and certain technology products like the Apple Watch. The list doesn't stop here though. A separate batch of about $160 billion worth of Chinese goods including laptops and mobile phones will be levied with 15% tariffs come Dec 15.",
    "The repercussions of this trade war have spread across the globe with major economies, such as the U.K., Japan, China, Germany reporting weak factory activity in August. makeArticleAd();   The International Monetary Fund in July further reduced its world growth outlook for 2019 and expects 3.2% expansion, which is the lowest level since the financial crisis amid the uncertainty emanating from the trade conflict.",
    " Plunging Bond Yields and Negative Interest Rates ",
    "As investors flock to bonds, which appear to be safer in times of economic uncertainty, bond yields have declined. . Recently, on several occasions, the U.S yield curve, which shows a plot of yield for different bond maturities, was inverted implying that the long-term yield is lower than the short term. This inversion has historically been a leading indicator of recession.",
    "A number of central banks across the world have adopted an easy money policy by cutting rates to combat an economic slowdown, which resulted in negative interest rates in countries, namely Germany, France, Netherlands, Switzerland, Japan. Meanwhile, nearly 25 countries have rates near zero.   The recent weak reading from the manufacturing sectors compounds this recessionary fear. This may prompt the Fed to slash the interest rate to boost economy.",
    " Stocks Poised to Gain ",
    "Lower interest rates should bode well for sectors like utilities and the real estate, which carry high levels of debt and should benefit from a decline in interest expense.",
    "Stocks in these sectors with a top Zacks Rank #1(Strong Buy) and 2 (Buy) should gain the most.",
    " NRG Energy, Inc. NRG  implements sustainable solutions for producing and managing energy to serve residential and commercial customers throughout the country.  The stock currently has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has moved 5% north in the past 30 days. The company's expected earnings growth rate for the current year is 67.63% compared with the Utility - Electric Power  industry's projected 3% growth rate.",
    " Unitil Corporation UTL  , a public utility holding company, engages in the distribution of electricity and natural gas in the United States. The stock currently has a Zacks Rank of 2. The Zacks Consensus Estimate for current-year earnings has been raised 0.8% in the past 60 days. The company's expected earnings growth rate for the current year is 4% compared with the Utility - Electric Power industry's estimated rise of 3.2%.",
    " Independence Realty Trust, Inc. IRT  is focused on acquiring and owning well-located garden-style and mid-rise apartment properties. The stock currently is Zacks #2 Ranked. The Zacks Consensus Estimate for current-year earnings has been revised 2.7% upward in the past 30 days. The company's expected earnings growth rate for the current year is 2.7% versus the REIT and Equity Trust-Residential  industry's expected decline of 0.3%.   Essex Property Trust, Inc. ESS  acquires, develops, redevelops and manages multifamily residential properties in selected West Coast markets. The stock currently has a Zacks Rank #2. The Zacks Consensus Estimate for current-year earnings has been inched 0.4% up in the past 30 days. The company's expected earnings growth rate for 2019 is 6% against the REIT and Equity Trust-Residential industry's expected dip of 0.3%.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>   ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:49:00"
}