{
  "url": "https://www.nasdaq.com/article/is-cb-financial-services-cbfv-a-great-value-stock-right-now-cm1207214",
  "title": "Is CB Financial Services (CBFV) a Great Value Stock Right Now? - Nasdaq.com",
  "text": [
    " While the proven Zacks Rank places an emphasis on earnings estimates and estimate revisions to find strong stocks, we also know that investors tend to develop their own individual strategies. With this in mind, we are always looking at value, growth, and momentum trends to discover great companies. Considering these trends, value investing is clearly one of the most preferred ways to find strong stocks in any type of market. Value investors rely on traditional forms of analysis on key valuation metrics to find stocks that they believe are undervalued, leaving room for profits. Zacks has developed the innovative Style Scores system to highlight stocks with specific traits. For example, value investors will be interested in stocks with great grades in the \"Value\" category. When paired with a high Zacks Rank, \"A\" grades in the Value category are among the strongest value stocks on the market today. One company to watch right now is CB Financial Services (CBFV). CBFV is currently sporting a Zacks Rank of #2 (Buy), as well as a Value grade of A. We also note that CBFV holds a PEG ratio of 1.11. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. CBFV's PEG compares to its industry's average PEG of 1.14. Over the past 52 weeks, CBFV's PEG has been as high as 1.62 and as low as 1.03, with a median of 1.13. Another valuation metric that we should highlight is CBFV's P/B ratio of 0.93. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. This stock's P/B looks attractive against its industry's average P/B of 1.34. Over the past 12 months, CBFV's P/B has been as high as 1.30 and as low as 0.87, with a median of 0.96. Value investors also use the P/S ratio. The P/S ratio is is calculated as price divided by sales. This is a popular metric because sales are harder to manipulate on an income statement, so they are often considered a better performance indicator. CBFV has a P/S ratio of 2.33. This compares to its industry's average P/S of 2.6. Finally, investors will want to recognize that CBFV has a P/CF ratio of 9.58. This metric takes into account a company's operating cash flow and can be used to find stocks that are undervalued based on their solid cash outlook. This stock's P/CF looks attractive against its industry's average P/CF of 11.63. CBFV's P/CF has been as high as 18.89 and as low as 9.27, with a median of 13.10, all within the past year. These are only a few of the key metrics included in CB Financial Services's strong Value grade, but they help show that the stock is likely undervalued right now. When factoring in the strength of its earnings outlook, CBFV looks like an impressive value stock at the moment.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  CB Financial Services, Inc. (CBFV): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "While the proven Zacks Rank places an emphasis on earnings estimates and estimate revisions to find strong stocks, we also know that investors tend to develop their own individual strategies. With this in mind, we are always looking at value, growth, and momentum trends to discover great companies.",
    "Considering these trends, value investing is clearly one of the most preferred ways to find strong stocks in any type of market. Value investors rely on traditional forms of analysis on key valuation metrics to find stocks that they believe are undervalued, leaving room for profits.",
    "Zacks has developed the innovative Style Scores system to highlight stocks with specific traits. For example, value investors will be interested in stocks with great grades in the \"Value\" category. When paired with a high Zacks Rank, \"A\" grades in the Value category are among the strongest value stocks on the market today.",
    "One company to watch right now is CB Financial Services (CBFV). CBFV is currently sporting a Zacks Rank of #2 (Buy), as well as a Value grade of A.",
    "We also note that CBFV holds a PEG ratio of 1.11. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. CBFV's PEG compares to its industry's average PEG of 1.14. Over the past 52 weeks, CBFV's PEG has been as high as 1.62 and as low as 1.03, with a median of 1.13.",
    "Another valuation metric that we should highlight is CBFV's P/B ratio of 0.93. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. This stock's P/B looks attractive against its industry's average P/B of 1.34. Over the past 12 months, CBFV's P/B has been as high as 1.30 and as low as 0.87, with a median of 0.96.",
    "Value investors also use the P/S ratio. The P/S ratio is is calculated as price divided by sales. This is a popular metric because sales are harder to manipulate on an income statement, so they are often considered a better performance indicator. CBFV has a P/S ratio of 2.33. This compares to its industry's average P/S of 2.6.",
    "Finally, investors will want to recognize that CBFV has a P/CF ratio of 9.58. This metric takes into account a company's operating cash flow and can be used to find stocks that are undervalued based on their solid cash outlook. This stock's P/CF looks attractive against its industry's average P/CF of 11.63. CBFV's P/CF has been as high as 18.89 and as low as 9.27, with a median of 13.10, all within the past year.",
    "These are only a few of the key metrics included in CB Financial Services's strong Value grade, but they help show that the stock is likely undervalued right now. When factoring in the strength of its earnings outlook, CBFV looks like an impressive value stock at the moment.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:10:11"
}