{
  "url": "https://www.nasdaq.com/article/wall-st-rises-on-strong-chinese-data-hong-kong-and-brexit-news-20190904-00948",
  "title": "Wall St rises on strong Chinese data, Hong Kong and Brexit news - Nasdaq.com",
  "text": [
    "By Sinéad Carew",
    "New YorkSept 4 (Reuters) - Wall Street's main indexes rebounded on Wednesday, after robust economic data from China, easing tensions in Hong Kong and British lawmakers' approval of a law to delay Brexit provided relief to investors worried about global growth.",
    "Lawmakers in Britain's lower house of Parliament voted late in the day to approve legislation designed to prevent Prime Minister Boris Johnson's government from taking the country out of the European Union without a deal. ",
    "Also, Hong Kong leader Carrie Lam withdrew an extradition bill that had triggered months of often violent protests in the Chinese-ruled city. ",
    "\"There's relief the tensions in Hong Kong have subsided,\" said Brian Battle, director of trading at Performance Trust Capital Partners in Chicago. \"That follow-through, in the absence of other bad news, is letting the market drift higher.\" ",
    "Investors fled equities on Tuesday after data showing a contraction in U.S. factory activity in August and after a new round of tariffs from Washington and Beijing went into effect over the weekend. ",
    "\"Some of the pessimism we started the month off with has eased slightly,\" said Chris Zaccarelli, chief investment officer at Independent Advisor Alliance, in Charlotte, North Carolina, citing the combination of factors including the China data, Brexit progress and the Hong Kong news.",
    "\"Anything that happens that could possibly derail a hard Brexit is a positive for stocks,\" he added.",
    "The president of the New York Federal Reserve Bank, John Williams, said the U.S. economy appeared to be in a good place while saying that he is ready to \"act as appropriate\" to help avoid a downturn. ",
    "The Federal Reserve's Beige Book released on Wednesday showed that the U.S. economy grew at a modest pace in recent weeks, with manufacturing buffeted by a global slowdown while consumer purchases gave mixed signals. The report is a compendium of anecdotes from companies. ",
    "The benchmark U.S. Treasury 10-year yield  rose on the day with the yield curve at its steepest in more than two weeks. US/",
    "The Dow Jones Industrial Average  rose 237.45 points, or 0.91%, to 26,355.47, the S&P 500  gained 31.51 points, or 1.08%, to 2,937.78, and the Nasdaq Composite  added 102.72 points, or 1.3%, to 7,976.88.",
    "Technology stocks  provided the biggest boost of  the S&P's 11 major sectors with a 1.7% gain. Healthcare  was the weakest sector with a 0.01% gain for the day.",
    "Tyson Foods Inc  shares fell 7.8% after the biggest U.S. meat processor cut its 2019 earnings forecast. ",
    "Advancing issues outnumbered declining ones on the NYSE by a 4.13-to-1 ratio; on Nasdaq, a 2.09-to-1 ratio favored advancers.",
    "The S&P 500 posted 64 new 52-week highs and three new lows; the Nasdaq Composite recorded 58 new highs and 81 new lows.",
    "On U.S. exchanges 6.16 billion shares changed hands compared with a 6.91 billion average for the last 20 sessions.      "
  ],
  "published_datetime": "2019-09-04 03:31:00"
}