{
  "url": "https://www.nasdaq.com/article/vietnam-plans-to-nationalise-civilian-airports-operator-20190905-00053",
  "title": "Vietnam plans to nationalise civilian airports operator - Nasdaq.com",
  "text": [
    "HANOI, Sept 5 (Reuters) - Vietnam is considering nationalising Airports Corporation of Vietnam , a move that economists say may hurt investor sentiment and hamper the Southeast Asian country's privatisation drive.",
    "The Ministry of Transport has sent a proposal to Prime Minister Nguyen Xuan Phuc to buy shares in the company, which operates the country's civilian airports, from private investors, Deputy Minister of Transport Nguyen Ngoc Dong said late on Wednesday.",
    "The move is aimed at \"ensuring the highest security and defence conditions\", Dong said without elaborating further in a statement posted on the government website.",
    "The government said last month it would sell stakes in 93 state-owned enterprises, including the country's largest bank by assets - Agribank, by the end of 2020. ",
    "The government sold tiny stakes in Airports Corporation of Vietnam to private investors in 2016 as part of that privatisation process.",
    "The government currently owns 95.4% of the company while several foreign investment funds, such as Dragon Capital, Korea Investment Management and RBC Global Asset Management, hold the remainder, according to Refinitiv Eikon data.",
    "The company has a market capitalisation of 173.74 trillion dong ($7.49 billion) as of Thursday, potentially valuing the stakes of private investors at $344.54 million.",
    "\"We would work out plans to raise funds for purchasing the stake if the proposal is approved,\" Dong said.",
    "Dong and the Airports Corporation of Vietnam didn't immediately reply to Reuters' emails seeking comment.",
    "Hanoi-based economist Pham Chi Lan, a former government economic adviser, said the move would have an adverse impact on investor sentiment.",
    "\"It would cause concerns among foreign and domestic investors, who have already invested and have plans to invest in Vietnam,\" Lan told Reuters on phone.",
    "\"Instead, the government should sell bigger stakes in state-owned enterprises to private investors to make the firms more competitive and efficient.\"",
    "($1 = 23,198 dong)"
  ],
  "published_datetime": "2019-09-05 02:10:00"
}