{
  "url": "https://www.nasdaq.com/article/should-value-investors-buy-artisan-partners-asset-management-apam-stock-cm1210353",
  "title": "Should Value Investors Buy Artisan Partners Asset Management (APAM) Stock? - Nasdaq.com",
  "text": [
    " While the proven Zacks Rank places an emphasis on earnings estimates and estimate revisions to find strong stocks, we also know that investors tend to develop their own individual strategies. With this in mind, we are always looking at value, growth, and momentum trends to discover great companies. Considering these trends, value investing is clearly one of the most preferred ways to find strong stocks in any type of market. Value investors rely on traditional forms of analysis on key valuation metrics to find stocks that they believe are undervalued, leaving room for profits. Luckily, Zacks has developed its own Style Scores system in an effort to find stocks with specific traits. Value investors will be interested in the system's \"Value\" category. Stocks with both \"A\" grades in the Value category and high Zacks Ranks are among the strongest value stocks on the market right now. One company value investors might notice is Artisan Partners Asset Management (APAM). APAM is currently holding a Zacks Rank of #2 (Buy) and a Value grade of A. The stock holds a P/E ratio of 9.98, while its industry has an average P/E of 11.66. APAM's Forward P/E has been as high as 11.57 and as low as 7.22, with a median of 9.86, all within the past year. Finally, investors will want to recognize that APAM has a P/CF ratio of 10.46. This figure highlights a company's operating cash flow and can be used to find firms that are undervalued when considering their impressive cash outlook. APAM's current P/CF looks attractive when compared to its industry's average P/CF of 15.18. APAM's P/CF has been as high as 19.62 and as low as 7.18, with a median of 10.99, all within the past year. These figures are just a handful of the metrics value investors tend to look at, but they help show that Artisan Partners Asset Management is likely being undervalued right now. Considering this, as well as the strength of its earnings outlook, APAM feels like a great value stock at the moment.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Artisan Partners Asset Management Inc. (APAM): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "While the proven Zacks Rank places an emphasis on earnings estimates and estimate revisions to find strong stocks, we also know that investors tend to develop their own individual strategies. With this in mind, we are always looking at value, growth, and momentum trends to discover great companies.",
    "Considering these trends, value investing is clearly one of the most preferred ways to find strong stocks in any type of market. Value investors rely on traditional forms of analysis on key valuation metrics to find stocks that they believe are undervalued, leaving room for profits.",
    "Luckily, Zacks has developed its own Style Scores system in an effort to find stocks with specific traits. Value investors will be interested in the system's \"Value\" category. Stocks with both \"A\" grades in the Value category and high Zacks Ranks are among the strongest value stocks on the market right now.",
    "One company value investors might notice is Artisan Partners Asset Management (APAM). APAM is currently holding a Zacks Rank of #2 (Buy) and a Value grade of A. The stock holds a P/E ratio of 9.98, while its industry has an average P/E of 11.66. APAM's Forward P/E has been as high as 11.57 and as low as 7.22, with a median of 9.86, all within the past year.",
    "Finally, investors will want to recognize that APAM has a P/CF ratio of 10.46. This figure highlights a company's operating cash flow and can be used to find firms that are undervalued when considering their impressive cash outlook. APAM's current P/CF looks attractive when compared to its industry's average P/CF of 15.18. APAM's P/CF has been as high as 19.62 and as low as 7.18, with a median of 10.99, all within the past year.",
    "These figures are just a handful of the metrics value investors tend to look at, but they help show that Artisan Partners Asset Management is likely being undervalued right now. Considering this, as well as the strength of its earnings outlook, APAM feels like a great value stock at the moment.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:10:11"
}