{
  "url": "https://www.nasdaq.com/article/political-risks-of-hong-kong-exchanges-39-bln-lse-approach-takes-toll-on-shares-20190912-00128",
  "title": "Political risks of Hong Kong exchange's $39 bln LSE approach takes toll on shares - Nasdaq.com",
  "text": [
    "By Jennifer Hughes, Sumeet Chatterjee and Sinead Cruise",
    "HONG KONG/LONDONSept 12 (Reuters) - The London Stock Exchange's  board will meet in coming days to make a decision on the Hong Kong bourse's surprise $39 billion takeover proposal, a source close to the British company said on Thursday, as the market poured cold water on the deal.",
    "The unsolicited takeover offer is not expected to succeed given a preference among LSE investors for the exchange to complete its $27 billion proposed acquisition of data and analytics group Refinitiv, the source close to the LSE said.",
    "But a person close to the Hong Kong exchange said a rejection of an initial approach was common in takeovers and HKEX was already considering its next step.",
    "Informal discussions between HKEX and LSE shareholders have begun, the person added.",
    "An LSE spokeswoman declined to comment.",
    "The proposed deal, announced on Wednesday, aims to create an exchange powerhouse spanning Asia and Europe which would be better able to compete with U.S. rivals such as Intercontinental Exchange Inc  and CME Group inc .",
    "However shares in HKEX fell more than 3% on Thursday as investors raised concerns about the political and regulatory risks involved in its move to take over one of Britain's marquee financial institutions.",
    "The indicative offer also got a cool response in London, where LSE shares finished up 5.9% on Wednesday, far short of the proposed takeover's implied premium.",
    "Daunting political and technical challenges to the deal have already surfaced.",
    "One major sticking point is the requirement for the LSE to abandon its acquisition of financial information provider Refinitiv from U.S. private equity firm Blackstone  and Thomson Reuters , the parent of Reuters News. ",
    "That deal, which went public in late July, caused LSE's shares to leap 15% on hopes Refinitiv's business would boost its long-term profitability. LSE said in a statement on Wednesday that it remained committed to the Refinitiv deal.",
    "HKEX has 28 days to make a firm bid for the LSE, whose shares were up 0.3% at 7,226 pence at 1046 GMT on Thursday, or walk away for six months.",
    "The source close to the LSE said that while the Hong Kong deal offered a gateway into China's economy, the LSE had already just established its own entry point with a recently launched stock market link with Shanghai.",
    "A separate source close to the LSE said HKEX executives met with LSE Chief Executive David Schwimmer in London on Monday, just two days before they made the proposal public.",
    "PROTESTS AND POLITICAL RISK",
    "Analysts said a perception that Beijing is exerting growing influence over Hong Kong could become another key sticking point for an LSE takeover, given the Hong Kong government's close links with the HKEX.",
    "Fitch Ratings said that \"increasing control by Chinese authorities over Hong Kong\" could raise regulatory concerns in Britain and the United States about data and information security.",
    "Hong Kong is entering a fourth month of sometimes violent protests sparked by legislation that would have drawn the former British colony closer to the Chinese legal system.",
    "The government's handling of the protests has been criticised internationally, as has the political pressure applied by Beijing to Kong companies not to support the pro-democracy movement. ",
    "Cathay Pacific Airways  was ordered to suspend staff who were involved in or supported the demonstrations.",
    "The Hong Kong government is the biggest shareholder in HKEX, with a 6% stake. It approves six of the 13 board members and can also stop any other shareholding rising above 5%.",
    "\"The transaction will require various regulatory approvals, which will stress-test the world's understanding of Hong Kong's 'one country, two systems' constitution,\" said David Blennerhassett, an independent analyst writing on the SmartKarma research platform.",
    "\"It will be politically tough now and in the near-term to get this through various regulatory channels.\"",
    "HKEX DOWNGRADE",
    "Analysts said HKEX's share price fall reflected scepticism the approach would succeed and investor concern about the dilutive impact of the cash-and-shares offer.",
    "\"If the market thought the deal was going to go ahead, I would have expected the shares to have fallen by more than 3%, typically that's what we'd expect for an acquirer in a deal like this,\" said Michael Wu, analyst at Morningstar.",
    "Under the terms of the offer, LSE shareholders would receive 2,045 pence in cash and 2.495 newly issued HKEX shares. HKEX said it intended to apply for a secondary listing of its shares on the LSE if the deal went through.",
    "Citigroup downgraded HKEX to 'sell' from 'buy', saying the acquisition price was high and could \"add downward pressure\" to the exchange's shares and valuation. Regulatory hurdles for the deal were also high, it said in its research note.",
    "Some analysts, however, said they could see strategic logic in HKEX's move.",
    "\"We believe that bringing the largest listed exchanges in Asia and Europe together could create new revenue streams and a lot depends on how well HKEX can capitalise on this,\" Daiwa Capital Markets analyst Jonas Kan wrote in a research report.",
    "($1 = 0.8110 pounds)"
  ],
  "published_datetime": "2019-09-12 01:25:00"
}