{
  "url": "https://www.nasdaq.com/article/activision-blizzard-stock-set-for-a-wow-and-cod-fuelled-recovery-cm1207514",
  "title": "Activision Blizzard Stock Set for a WoW and CoD-Fuelled Recovery - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Last year, the holidays failed to arrive for Activision Blizzard  (NASDAQ: ATVI ) investors. They watched the video game publisher's stock tumble 47% between the start of October and Christmas Eve.",
    "After sinking to two-year lows in February, ATVI stock has been clawing its way back, managing to eke out a 13% gain so far in 2019. But ATVI's chances at a sustained recovery lie with two of its most popular game franchises. The retro \"World of Warcraft Classic\" launched on Aug. 27, while \"Call of Duty: Modern Warfare\" goes on sale Oct. 25.",
    "The two game launches are generating considerable buzz that has already given ATVI stock a boost. Analysts have a median 12-month price forecast for ATVI stock of $55, with estimates ranging as high as $68, along with a Strong Buy recommendation .",
    "The performance of ATVI stock over the past 12 months has tested the patience of many investors. For those who bought last fall, expecting the massive roll ATVI had been on for years to continue, it was especially painful. After starting 2013 at the $11 level, ATVI stock climbed relentlessly, hitting an all-time high of $83.39 on Oct. 2. Then the bottom fell out for ATVI.",
    "\"Call of Duty: Black Ops 4\" launched on Oct. 12, setting digital sales records for game consoles, but failed to generate the numbers investors were expecting based on its adoption of the hugely popular \"battle royale\" concept from runaway hit \"Fortnight.\" A miss on its Q3 earnings in November added to the rout and by the time markets closed on Dec. 31, Activision Blizzard stock was trading for $46.57 - a 44% loss in just three months.",
    "But it hadn't hit rock bottom yet. That happened Feb. 11 when ATVI closed at $40.11, its lowest point in two years. The reasons for that drop were concerns about Q4 earnings combined with news the company was planning to lay off hundreds of employees .",
    "Since then, ATVI stock has had a bumpy ride, but the overall trend has been up. At this point, it has put together a 13% gain for 2019. In comparison, rival Electronic Arts (NASDAQ: EA ) is up 22% in 2019.",
    "Two of Activision Blizzard's most important game franchises have launches this fall. If they perform as expected, there is significant upside for ATVI stock.",
    "At the end of August, the company released \"World of Warcraft Classic,\" a retro take on its popular WoW game that celebrates its 15th anniversary. So far the results have been positive - the new WoW version set a launch day record of 1.1 million concurrent viewers on Amazon's (NASDAQ: AMZN ) Twitch game streaming platform. WoW generates revenue through ongoing subscription revenue of $14.99 per month. If \"World of Warcraft Classic\" can  rejuvenate subscriber levels (an estimated 5.5 million in 2018 compared to 12 million in 2010), the boost to ATVI's bottom line would be significant.",
    "On Oct. 25, the company is launching \"Call of Duty: Modern Warfare.\" Early reviews have been glowing, raising hopes that the latest CoD release will eclipse last year's version. 2018's \"Call of Duty: Black Ops 4\" set a launch day digital sales record , but its $500 million launch weekend failed to improve on 2017 CoD launch numbers. That disappointed investors …",
    "In addition, the company recently announced it is expanding development teams for its popular Diablo and Overwatch franchises, as well as Candy Crush - the ultra popular mobile game series that earned Activision Blizzard over $1.5 billion in micro transactions last year alone .  ",
    "Based on this fall's game lineup and the resources being committed to other key game franchises - not to mention the 2020 launch of new game consoles from Microsoft (NASDAQ: MSFT ) and Sony (NYSE:S NE ) - ATVI is poised to leave a terrible 12 months behind. And Activision Blizzard stock is well-positioned for continued recovery.",
    "As of this writing, Brad Moon did not hold a position in any of the aforementioned securitie s.",
    "The post Activision Blizzard Stock Set for a WoW and CoD-Fuelled Recovery appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:56:39"
}