{
  "url": "https://www.nasdaq.com/article/united-technologies-utx-outpaces-stock-market-gains-what-you-should-know-cm1207606",
  "title": "United Technologies (UTX) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " United Technologies (UTX) closed the most recent trading day at $131.05, moving +1.61% from the previous trading session. The stock outpaced the S&P 500's daily gain of 1.08%. Elsewhere, the Dow gained 0.91%, while the tech-heavy Nasdaq added 1.31%. Heading into today, shares of the maker of elevators, jet engines and other products had gained 0.13% over the past month, outpacing the Conglomerates sector's loss of 4.67% and the S&P 500's loss of 0.68% in that time. Investors will be hoping for strength from UTX as it approaches its nex t earnings  release. On that day, UTX is projected to report earnings of $2.01 per share, which would represent year-over-year growth of 4.15%. Meanwhile, our latest consensus estimate is calling for revenue of $19.24 billion, up 16.52% from the prior-year quarter. UTX's full-year Zacks Consensus Estimates are calling for earnings of $8.03 per share and revenue of $77.13 billion. These results would represent year-over-year changes of +5.52% and +15.98%, respectively. Any recent changes to analyst estimates for UTX should also be noted by investors. These revisions help to show the ever-changing nature of near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model. Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Within the past 30 days, our consensus EPS projection has moved 0.11% higher. UTX is currently a Zacks Rank #2 (Buy). Digging into valuation, UTX currently has a Forward P/E ratio of 16.07. Its industry sports an average Forward P/E of 16.06, so we one might conclude that UTX is trading at a premium comparatively. It is also worth noting that UTX currently has a PEG ratio of 1.83. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Diversified Operations industry currently had an average PEG ratio of 1.8 as of yesterday's close. The Diversified Operations industry is part of the Conglomerates sector. This industry currently has a Zacks Industry Rank of 46, which puts it in the top 18% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Be sure to follow all of these stock-moving metrics, and many more, on Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  United Technologies Corporation (UTX): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "United Technologies (UTX) closed the most recent trading day at $131.05, moving +1.61% from the previous trading session. The stock outpaced the S&P 500's daily gain of 1.08%. Elsewhere, the Dow gained 0.91%, while the tech-heavy Nasdaq added 1.31%.",
    "Heading into today, shares of the maker of elevators, jet engines and other products had gained 0.13% over the past month, outpacing the Conglomerates sector's loss of 4.67% and the S&P 500's loss of 0.68% in that time.",
    "Investors will be hoping for strength from UTX as it approaches its nex t earnings  release. On that day, UTX is projected to report earnings of $2.01 per share, which would represent year-over-year growth of 4.15%. Meanwhile, our latest consensus estimate is calling for revenue of $19.24 billion, up 16.52% from the prior-year quarter.",
    "UTX's full-year Zacks Consensus Estimates are calling for earnings of $8.03 per share and revenue of $77.13 billion. These results would represent year-over-year changes of +5.52% and +15.98%, respectively.",
    "Any recent changes to analyst estimates for UTX should also be noted by investors. These revisions help to show the ever-changing nature of near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.",
    "Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Within the past 30 days, our consensus EPS projection has moved 0.11% higher. UTX is currently a Zacks Rank #2 (Buy).",
    "Digging into valuation, UTX currently has a Forward P/E ratio of 16.07. Its industry sports an average Forward P/E of 16.06, so we one might conclude that UTX is trading at a premium comparatively.",
    "It is also worth noting that UTX currently has a PEG ratio of 1.83. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Diversified Operations industry currently had an average PEG ratio of 1.8 as of yesterday's close.",
    "The Diversified Operations industry is part of the Conglomerates sector. This industry currently has a Zacks Industry Rank of 46, which puts it in the top 18% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Be sure to follow all of these stock-moving metrics, and many more, on Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:50:20"
}