{
  "url": "https://www.nasdaq.com/article/its-not-back-to-business-as-usual-at-disney-world-cm1207554",
  "title": "It's Not Back to Business as Usual at Disney World - Nasdaq.com",
  "text": [
    " It's back to business as usual at Central Florida's leading   tourist attractions.   Disney    (NYSE: DIS) , Universal Orlando parent   Comcast    (NASDAQ: CMCSA) , and   SeaWorld Entertainment    (NYSE: SEAS) reopened their industry-leading theme parks this   morning as Hurricane Dorian blew out of harm's way, moving north   just off the Atlantic coastline. All three operators had curbed their operations on Tuesday as   the fierce windstorm drew closer. Disney and Comcast shuttered   their theme parks in the late afternoon and early evening, hours   ahead of their normal closing times. SeaWorld Orlando didn't open   at all on Tuesday. For the three publicly traded operators, it   may seem as if they got off easy, missing just a handful of hours   -- and in SeaWorld's case, an entire day -- of visitors.   Obviously, things could've been far worse if Hurricane Dorian had   made landfall anywhere close to the popular theme parks -- but   there'll still be a price to pay for the disruptions.   Image source: Disney.makeArticleAd();  It's a small world Disney, Comcast, and SeaWorld Entertainment keep their   attractions open year-round, so Tuesday's disruptions may seem   like little more than rounding errors. We're talking about a   weekday during what is one of the quietest seasonal lulls for the   tourism industry. However, there are still a couple of things   that investors will want to keep in mind before concluding that   it's business as usual for the three entertainment giants. We can start with the   days leading up to the Tuesday closure    itself. Labor Day weekend is a pretty big deal as the peak summer   travel season comes to a close, and for Disney World, in   particular, this was supposed to be a huge holiday.   Star Wars    : Galaxy's Edge and the International Food and Wine Festival   debuted on Thursday, but booked visitors were already starting to   be audible at the line. With Hurricane Dorian's path still uncertain but initially   projected to be making a beeline to Central Florida, it's fair to   say Disney World travel plans were cancelled en masse. Social   media was ablaze the past few days, detailing how empty the   Disney, Comcast, and SeaWorld parks felt during the typically   busy extended holiday weekend. With locals busy preparing for the   storm, and out-of-towners making other plans, it's easy to see   why the impact of this storm extends beyond Tuesday's partial   shutdowns. Another factor that may get thornier in the years ahead is   nature's trend and what it can do to the vacation-booker's   mindset. Disney World opened in 1971 and went nearly 28 years   without a weather-related closure until Hurricane Floyd blew into   town in 1999. Outside of an early closure on 9/11 for global   security reasons and three hurricanes that threatened the area in   2004, Disney and its peers would remain open every day for the   next dozen years. It's been a rough run lately with   Hurricane Matthew in 2016    ,   Hurricane Irma in 2017    , and now, Dorian's date with the locked turnstiles on Tuesday.   Three windstorm-related closures in four years is a pretty big   deal and may weigh on potential visits in the future as folks   ponder whether to hit up Central Florida's attractions during the   hurricane season that technically runs from June through the end   of November -- but is typically at its worst in August and   September. Disney, Comcast, and SeaWorld aren't concerned right now.   They're all laying the groundwork for new big-ticket attractions   that will woo visitors in the years to come. However, between   investor fears that a   recession will rock the economy    and now, a problematic trend with hurricanes disrupting late   summer and early fall operations, one can argue that the industry   has its hands full.   Find out why Walt Disney is one of the 10 best stocks to buy now  Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* Tom and David just revealed their ten top stock picks for     investors to buy right now. Walt Disney     is on the list      -- but there are nine others you may be overlooking.  Click here to get access to the full       list!     *Stock Advisor returns as of June 1, 2019       Rick Munarriz      owns shares of Walt Disney. The Motley Fool owns shares of and     recommends Walt Disney. The Motley Fool has the following     options: long January 2021 $60 calls on Walt Disney and short     October 2019 $125 calls on Walt Disney. The Motley Fool     recommends Comcast. The Motley Fool has a     disclosure policy      .  ",
    "It's back to business as usual at Central Florida's leading   tourist attractions.   Disney    (NYSE: DIS) , Universal Orlando parent   Comcast    (NASDAQ: CMCSA) , and   SeaWorld Entertainment    (NYSE: SEAS) reopened their industry-leading theme parks this   morning as Hurricane Dorian blew out of harm's way, moving north   just off the Atlantic coastline.",
    "All three operators had curbed their operations on Tuesday as   the fierce windstorm drew closer. Disney and Comcast shuttered   their theme parks in the late afternoon and early evening, hours   ahead of their normal closing times. SeaWorld Orlando didn't open   at all on Tuesday. For the three publicly traded operators, it   may seem as if they got off easy, missing just a handful of hours   -- and in SeaWorld's case, an entire day -- of visitors.   Obviously, things could've been far worse if Hurricane Dorian had   made landfall anywhere close to the popular theme parks -- but   there'll still be a price to pay for the disruptions.",
    "  Image source: Disney.makeArticleAd(); ",
    "Image source: Disney.",
    "Disney, Comcast, and SeaWorld Entertainment keep their   attractions open year-round, so Tuesday's disruptions may seem   like little more than rounding errors. We're talking about a   weekday during what is one of the quietest seasonal lulls for the   tourism industry. However, there are still a couple of things   that investors will want to keep in mind before concluding that   it's business as usual for the three entertainment giants.",
    "We can start with the   days leading up to the Tuesday closure    itself. Labor Day weekend is a pretty big deal as the peak summer   travel season comes to a close, and for Disney World, in   particular, this was supposed to be a huge holiday.   Star Wars    : Galaxy's Edge and the International Food and Wine Festival   debuted on Thursday, but booked visitors were already starting to   be audible at the line.",
    "With Hurricane Dorian's path still uncertain but initially   projected to be making a beeline to Central Florida, it's fair to   say Disney World travel plans were cancelled en masse. Social   media was ablaze the past few days, detailing how empty the   Disney, Comcast, and SeaWorld parks felt during the typically   busy extended holiday weekend. With locals busy preparing for the   storm, and out-of-towners making other plans, it's easy to see   why the impact of this storm extends beyond Tuesday's partial   shutdowns.",
    "Another factor that may get thornier in the years ahead is   nature's trend and what it can do to the vacation-booker's   mindset. Disney World opened in 1971 and went nearly 28 years   without a weather-related closure until Hurricane Floyd blew into   town in 1999. Outside of an early closure on 9/11 for global   security reasons and three hurricanes that threatened the area in   2004, Disney and its peers would remain open every day for the   next dozen years.",
    "It's been a rough run lately with   Hurricane Matthew in 2016    ,   Hurricane Irma in 2017    , and now, Dorian's date with the locked turnstiles on Tuesday.   Three windstorm-related closures in four years is a pretty big   deal and may weigh on potential visits in the future as folks   ponder whether to hit up Central Florida's attractions during the   hurricane season that technically runs from June through the end   of November -- but is typically at its worst in August and   September.",
    "Disney, Comcast, and SeaWorld aren't concerned right now.   They're all laying the groundwork for new big-ticket attractions   that will woo visitors in the years to come. However, between   investor fears that a   recession will rock the economy    and now, a problematic trend with hurricanes disrupting late   summer and early fall operations, one can argue that the industry   has its hands full.",
    "  Find out why Walt Disney is one of the 10 best stocks to buy now  Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* Tom and David just revealed their ten top stock picks for     investors to buy right now. Walt Disney     is on the list      -- but there are nine others you may be overlooking.  Click here to get access to the full       list!     *Stock Advisor returns as of June 1, 2019    ",
    " Find out why Walt Disney is one of the 10 best stocks to buy now ",
    "Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "Tom and David just revealed their ten top stock picks for     investors to buy right now. Walt Disney     is on the list      -- but there are nine others you may be overlooking.",
    " Click here to get access to the full       list! ",
    " *Stock Advisor returns as of June 1, 2019 ",
    "  Rick Munarriz      owns shares of Walt Disney. The Motley Fool owns shares of and     recommends Walt Disney. The Motley Fool has the following     options: long January 2021 $60 calls on Walt Disney and short     October 2019 $125 calls on Walt Disney. The Motley Fool     recommends Comcast. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 04:10:00"
}