{
  "url": "https://www.nasdaq.com/article/nokia-stock-looks-ready-to-rock-with-5g-cm1206927",
  "title": "Nokia Stock Looks Ready to Rock With 5G - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "After a solid earnings announcement for the second quarter announced July 29, Nokia (NYSE: NOK ) shares enjoyed a brief rally, trading up to around $5.69. But since then, enthusiasm has leveled off, with NOK stock trading sideways for some weeks at around the $5.10 to $5.18 level before falling off even further.",
    "The August doldrums have wound down. Much of the fear of a trade war with China is priced into markets. For investors looking for a sleeping giant in telecoms, Nokia may be just the bet.",
    "Here are three key reasons why Nokia may outperform in the next telecom sector rally:",
    "The upcoming next-gen standard for mobile telecommunications service , 5G, will deliver significantly faster speed than today's 4G technology. 5G will allow users to browse data-intensive websites, such as Alphabet's (NASDAQ: GOOG , NASDAQ: GOOGL ) YouTube, upload or download videos and use data-intensive apps. 5G can also deliver virtual reality much more quickly than the current 4G system.",
    "In the U.S., Verizon (NYSE: VZ ) and AT&T (NYSE: T ) will likely be the first to offer 5G speeds. In fact, Verizon is already claiming that its 5G technology will probably deliver speeds 200 times faster than many of its 4G LTE users get now. Globally, Vodafone (NASDAQ: VOD ) will likely be the market leader in Europe.",
    "The market for 5G will likely not take off until 2020. But when it does, users across the globe will need a brand new 5G standard smartphone. Carriers will sink billions into new 5G equipment. And Nokia will be positioned front and center in offering the new hardware across the globe.",
    "According to Chief Executive Officer Rajeev Suri speaking to Bloomberg , \"Nokia is winning contracts quite handsomely in new 5G telecom networks as the top three suppliers go head-to-head for the emerging business.\" He added, \"We compete quite favorably with Huawei , with or without the current security concerns,\" Suri said referring to Huawei Technologies , the world's largest network equipment manufacturer.",
    "The market is now keenly focused on how far Nokia will pounce on 5G once the new standard introduced onto the global market. \"Only Huawei and Nokia have full end-to-end product portfolios with wireless, fixed networks, and IP routing solutions, positioning Nokia for leadership with the top carriers as networks transition to 5G,\" according to Michael Walkley, telecom analyst at Canaccord Research . \"[W]ith Huawei still potentially banned from certain markets, we view Nokia as the only global supplier with an end-to-end solution, as evidenced by leading global carriers choosing Nokia as a partner for 5G\".",
    "The history of technology paradigm shifts is filled with examples of companies throwing billions in capital down a black hole - only to face far more competition in the market and far less revenues than expected. NOK is undoubtedly spending heavily on building their 5G market lead - but with a certain degree of prudence.",
    "In the last earnings call, Nokia's CFO, Kristian Pullola, explained that they expect their most recent cost-savings program to result in a nearly $800 million reduction in recurring operating expenses and production overheads in 2020. So while NOK will make the massive capital investment necessary to win in the new 5G market, they are certainly keenly aware of past spending black holes - and are already implementing tight financial controls.",
    "NOK has managed to meet or beat analysts' estimates in for of the last five quarters. For their latest earnings call in July, NOK sounded more confident than ever that they will grow their critical metrics across the board for 2020. Full-year revenues are estimated to move into the positive territory up to 40 cents to 46 cents EPS. NOK also expects operating margin increasing from the 9-15% estimated this year up to 12 to 16% in 2020.",
    "\"Our expectation is that we will outperform our primary market in full-year 2019 and over the longer term, driven by our strategy, which includes competing in 5G more effectively due to our strong end to end portfolio, focusing on targeted growth opportunities in attractive adjacent markets and building a strong network agnostic software business,\" said Rajeev Suri, Nokia's president and CEO.",
    "Most telecom and tech stocks have had a rough ride over the summer, and are now tending to trade sideways. When the investing season starts to heat up in September, the sideways trend for NOK stock could turn decidedly bullish - and even more so after their third-quarter earnings call in October.",
    "As of this writing, Theodore Kim did not hold a position in any of the aforementioned securities.",
    "The post Nokia Stock Looks Ready to Rock With 5G appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:07:16"
}