{
  "url": "https://www.nasdaq.com/article/gold-silver-up-amid-trade-war-brexit-concerns-dollar-contains-gains-cm1206877",
  "title": "Gold, Silver Up Amid Trade War, Brexit Concerns, Dollar Contains Gains - Nasdaq.com",
  "text": [
    "Gold is being underpinned by the news as another set of tariffs for Chinese products took into effect with the new month, and political problems in the United Kingdom are heading to a hard Brexit outcome; however, the USD is containing gains in the gold as it is also joining its safe-haven status.",
    "Hey FX Emperors, as Hurricane Dorian is approaching my desk, the market is trading under pressure by different news that are hurting the sentiment.",
    "Risk aversion is the theme of the day as investors are battling against multiple levels of uncertainty. Besides the mentioned trade war and Brexit topics, the economic uncertainty in the European Union with its German engine losing steam is fueling fears of a possible recession.",
    "In that framework, gold and silver are trading higher, but so does the dollar index, which is trading positive for the fifth straight day. DXY is at fresh highs since May 2017 at 99.40.",
    "Dollar is positive as the British sterling and the euro are trading down on the day. Too many uncertainties around those two currencies due to recession and fears of a no-deal Brexit. Both the Euro and Pound are trading at multi-year lows against the greenback.",
    "Gold is trading positive for the second day on Tuesday as investors are trading on risk aversion mode due to political and economic concerns. The positive side is, however, contained by a strong dollar.",
    "The metal recovered from early losses on the day as the unit found support at 1,520 and it started to regain ground with the opening of the European session. Then, gold rallied to test the 1,535 area, where the price is now.",
    "Gold is currently trading 0.25% positive on the day at 1,535. The unit is consolidating levels above the now critical 1,520 support. Technical conditions in the short term suggest a consolidation phase in the next hours. But the overall picture suggests additional gains.",
    "FX Empire analyst James Hyerczyk highlights the role of US bond yields in gold's forecast. \"Gold is likely to remain underpinned on Tuesday as long as Treasury yields remain under pressure and stocks weaken. However, gains are likely to remain limited by the stronger U.S. Dollar, which tends to reduce foreign demand for dollar-denominated gold.\"",
    "If you are a bull, 1,535 is the level you need to watch, above it, 1,545 would be the next selling area. Then, August 29 high at 1,555.",
    "To the downside, the unit is well supported by the 1,520. However, if the level is broken, 1,510 is the next frontier.",
    "Silver is trading positive for the third session in a row as investors are buying the metal as an alternative of gold.",
    "Early in the day, XAG/USD traded in consolidation mode around 18.50, but with the beginning of the American morning, it broke above the 18.60 critical resistance. The unit is now moving above August 29 highs at 18.65, which is the maximum since April 2017.",
    "Currently, silver is trading 1.20% positive on the day around 18.70.",
    "FX Empire analyst Christopher Lewis expects more buys for the metal, \"with that, I think that the market will continue to look at dips as potential buying opportunities, but I would be a bit cautious about buying up here considering that we are so overbought.\"",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:23:42"
}