{
  "url": "https://www.nasdaq.com/article/3-big-stock-charts-for-tuesday-weyerhaeuser-western-digital-and-air-products-chemicals-cm1206784",
  "title": "3 Big Stock Charts for Tuesday: Weyerhaeuser, Western Digital and Air Products & Chemicals - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "The market was higher and lower on Friday, but when all was said and done, it essentially ended the day flat. The S&P 500 finished last week's action essentially flat, gaining a tiny 0.06% … the usual modest action we see before a three-day weekend, on the usual modest volume.",
    "General Electric (NYSE: GE ) may have been the ultimate reason stocks finished the week on a (barely) high note. It gained 1.8% on Friday, rallying on a partial legal victory that should ease its vulnerability to a lawsuit that alleges accounting fraud. The suit now must prove there was forehand knowledge of accounting problems that have become nightmarish for the organization and its shareholders.",
    "And, the market managed to overcome the drag that Chesapeake Energy (NYSE: CHK ) proved to be on Friday, when it slumped more than 6%. There was no news, but a major selloff in crude oil and natural gas tripped up most names in the industry.",
    "As the new, shortened trading week gets going though, it's the stock charts of Western Digital (NASDAQ: WDC ), Weyerhaeuser (NYSE: WY ) and Air Products & Chemicals (NYSE: APD ) that deserve the closest looks. Here's why, and what to look for next.",
    "Weyerhaeuser suffered the same rough end to 2018 most other stocks did. But, it hasn't enjoyed the same rebound most other names have mustered so far in 2019. Rather, the stock has seemingly been stuck on a range.",
    "Slowly but surely though, that's changing. While WY stock may remain trapped between support and resistance, it's also starting to find support in places where it hadn't. In the meantime, a handful of momentum indicators have flipped to a bullish mode.",
    "With nothing more than a passing glance, it would be easy to just say Air Products & Chemicals shares are bouncing around, moving sideways after a big runup over the course of the first half of the year. And, perhaps that's all that's happening at this time.",
    "A longer, more detailed examination of the chart since the end of July, however, reveals there may be more going on than it superficially seems. A pullback may be brewing, and the stock's vulnerability could be even more pronounced because of the 44% advance that took shape between January and July.",
    "Finally, the rebound Western Digital stock has been working on since the beginning of this year has really taken hold. It's not yet over a key hump, and has another one to test following that. But, we're starting to see support where we need to see it most, and starting to see momentum indicators solidify in a major way.",
    "As of this writing, James Brumley did not hold a position in any of the aforementioned securities. You can learn more about him at his website jamesbrumley.com , or follow him on Twitter , at @jbrumley.",
    "The post 3 Big Stock Charts for Tuesday: Weyerhaeuser, Western Digital and Air Products & Chemicals appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:00:41"
}