{
  "url": "https://www.nasdaq.com/article/3-reasons-why-shoe-carnival-scvl-is-a-great-growth-stock-cm1207242",
  "title": "3 Reasons Why Shoe Carnival (SCVL) Is a Great Growth Stock - Nasdaq.com",
  "text": [
    " Growth investors focus on stocks that are seeing above-average financial growth, as this feature helps these securities garner the market's attention and deliver solid returns. But finding a great growth stock is not easy at all. That's because, these stocks usually carry above-average risk and volatility. In fact, betting on a stock for which the growth story is actually over or nearing its end could lead to significant loss. However, the task of finding cutting-edge growth stocks is made easy with the help of the Zacks Growth Style Score (part of the Zacks Style Scores  system), which looks beyond the traditional growth attributes to analyze a company's real growth prospects. Shoe Carnival (SCVL) is on the list of such stocks currently recommended by our proprietary system. In addition to a favorable Growth Score, it carries a top Zacks Rank. Research shows that stocks carrying the best growth features consistently beat the market. And returns are even better for stocks that possess the combination of a Growth Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 (Buy). Here are three of the most important factors that make the stock of this footwear retailer a great growth pick right now.  Earnings Growth  Arguably nothing is more important than earnings growth, as surging profit levels is what most investors are after. And for growth investors, double-digi t earnings  growth is definitely preferable, and often an indication of strong prospects (and stock price gains) for the company under consideration. While the historical EPS growth rate for Shoe Carnival is 15%, investors should actually focus on the projected growth. The company's EPS is expected to grow 13.5% this year, crushing the industry average, which calls for EPS growth of -1.6%.  Cash Flow Growth  Cash is the lifeblood of any business, but higher-than-average cash flow growth is more beneficial and important for growth-oriented companies than for mature companies. That's because, high cash accumulation enables these companies to undertake new projects without raising expensive outside funds. Right now, year-over-year cash flow growth for Shoe Carnival is 24.1%, which is higher than many of its peers. In fact, the rate compares to the industry average of 9.9%. While investors should actually consider the current cash flow growth, it's worth taking a look at the historical rate too for putting the current reading into proper perspective. The company's annualized cash flow growth rate has been 6.3% over the past 3-5 years versus the industry average of 0.2%.  Promising Earnings Estimate Revisions  Superiority of a stock in terms of the metrics outlined above can be further validated by looking at the trend in earnings estimate revisions. A positive trend is of course favorable here. Empirical research shows that there is a strong correlation between trends in earnings estimate revisions and near-term stock price movements. The current-year earnings estimates for Shoe Carnival have been revising upward. The Zacks Consensus Estimate for the current year has surged 0.4% over the past month.  Bottom Line  Shoe Carnival has not only earned a Growth Score of A based on a number of factors, including the ones discussed above, but it also carries a Zacks Rank #2 because of the positive earnings estimate revisions. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  . This combination positions Shoe Carnival well for outperformance, so growth investors may want to bet on it.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Shoe Carnival, Inc. (SCVL): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Growth investors focus on stocks that are seeing above-average financial growth, as this feature helps these securities garner the market's attention and deliver solid returns. But finding a great growth stock is not easy at all.",
    "That's because, these stocks usually carry above-average risk and volatility. In fact, betting on a stock for which the growth story is actually over or nearing its end could lead to significant loss.",
    "However, the task of finding cutting-edge growth stocks is made easy with the help of the Zacks Growth Style Score (part of the Zacks Style Scores  system), which looks beyond the traditional growth attributes to analyze a company's real growth prospects.",
    "Shoe Carnival (SCVL) is on the list of such stocks currently recommended by our proprietary system. In addition to a favorable Growth Score, it carries a top Zacks Rank.",
    "Research shows that stocks carrying the best growth features consistently beat the market. And returns are even better for stocks that possess the combination of a Growth Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 (Buy).",
    "Here are three of the most important factors that make the stock of this footwear retailer a great growth pick right now.",
    " Earnings Growth ",
    "Arguably nothing is more important than earnings growth, as surging profit levels is what most investors are after. And for growth investors, double-digi t earnings  growth is definitely preferable, and often an indication of strong prospects (and stock price gains) for the company under consideration.",
    "While the historical EPS growth rate for Shoe Carnival is 15%, investors should actually focus on the projected growth. The company's EPS is expected to grow 13.5% this year, crushing the industry average, which calls for EPS growth of -1.6%.",
    " Cash Flow Growth ",
    "Cash is the lifeblood of any business, but higher-than-average cash flow growth is more beneficial and important for growth-oriented companies than for mature companies. That's because, high cash accumulation enables these companies to undertake new projects without raising expensive outside funds.",
    "Right now, year-over-year cash flow growth for Shoe Carnival is 24.1%, which is higher than many of its peers. In fact, the rate compares to the industry average of 9.9%.",
    "While investors should actually consider the current cash flow growth, it's worth taking a look at the historical rate too for putting the current reading into proper perspective. The company's annualized cash flow growth rate has been 6.3% over the past 3-5 years versus the industry average of 0.2%.",
    " Promising Earnings Estimate Revisions ",
    "Superiority of a stock in terms of the metrics outlined above can be further validated by looking at the trend in earnings estimate revisions. A positive trend is of course favorable here. Empirical research shows that there is a strong correlation between trends in earnings estimate revisions and near-term stock price movements.",
    "The current-year earnings estimates for Shoe Carnival have been revising upward. The Zacks Consensus Estimate for the current year has surged 0.4% over the past month.",
    " Bottom Line ",
    "Shoe Carnival has not only earned a Growth Score of A based on a number of factors, including the ones discussed above, but it also carries a Zacks Rank #2 because of the positive earnings estimate revisions.",
    "You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .",
    "This combination positions Shoe Carnival well for outperformance, so growth investors may want to bet on it.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:45:07"
}