{
  "url": "https://www.nasdaq.com/article/yahoo-japan-bids-for-control-of-fashion-etailer-zozo-for-37-bln-20190912-00091",
  "title": "Yahoo Japan bids for control of fashion e-tailer Zozo for $3.7 bln - Nasdaq.com",
  "text": [
    "By Ritsuko Ando and Sam Nussey",
    "TOKYO, Sept 12 (Reuters) - Yahoo Japan Corp  said it will take over Japan's biggest online fashion retailer Zozo Inc  for 400 billion yen ($3.7 billion), seeking to breathe fresh life into the business and compete better against the likes of Amazon.com .",
    "Zozo's billionaire founder Yusaku Maezawa said he will step down as chief executive and sell most of his stake after a series of missteps which have slashed its market value by more than half from a peak last year of $14 billion.",
    "It comes as investors have grown increasingly wary about growth prospects for Zozo - a more affordable, Japan-focused version of Britain'sFarfetch Ltd  - after a failed experiment with bespoke tailoring and clashes with brands over discounting.",
    "\"My style may have been too top-down... It was the right time for a new CEO,\" Maezawa, a former punk band member, told a news conference, in which he began crying as he thanked shareholders and employees.",
    "Yahoo Japan's offer of 2,620 yen per Zozo share represents a premium of around 21% versus Wednesday's closing price, but is 44% lower than its peak around a year ago. Zozo's stock ended up 13% on Thursday, while Yahoo Japan shares rose 2%.",
    "The deal also comes at a time of change in Japanese tech, where Rakuten is launching wireless telecom services in a direct challenge to SoftBank Group Corp's  cash-cow business and Amazon has embarked on an aggressive push into fashion.",
    "Yahoo Japan, which will next month change its name to Z Holdings Corp, is a unit of SoftBank controlled by the investment conglomerate's telecoms unit SoftBank Corp .",
    "WINDFALL",
    "For Maezawa, it would bring a windfall of around $2.3 billion. He said he will sell a stake of around 30%, leaving him with about 6% in the company.",
    "The entrepreneur is credited with creating a trendy, user-friendly website over a decade ago at a time of scepticism about whether Japanese consumers would buy clothes online. The site, whose early stores included A Bathing Ape, Hysteric Glamour and United Arrows Ltd , still has few rivals.",
    "In recent years, it is Maezawa's lifestyle that has attracted attention. Maezawa signed up as the first private passenger to be taken around the moon by Elon Musk's SpaceX, and paid $110 million for a Jean-Michel Basquiat painting.",
    "However, fortunes have turned for Zozo and Maezawa, with the businessman selling part of his extensive art collection at Sotheby's, saying he has no money. ",
    "Zozo booked its first annual earnings decline in the last financial year, due mainly to a failed made-to-measure service. It distributed skin-tight bodysuits to allow consumers to upload measurements, but ended up with few orders and huge costs.",
    "Zozo has also been hit by the departure of several brands, some unhappy with its discounting policies and others wanting to create their own e-commerce services. In March, it said it secured a 15 billion yen commitment line from banks.",
    "Dressed in a white t-shirt emblazoned with the phrase \"Let's Start Today\" at the conference, Maezawa contrasted markedly with newly-appointed CEO Kotaro Sawada, who was dressed in a suit and tie and read his remarks from a piece of paper.",
    "\"You may say I'm the direct opposite of Maezawa, and you'd be right,\" Sawada said, promising to keep the company interesting but bringing much-needed stability to management.",
    "The deal comes at a turbulent time for Yahoo Japan, which recently ousted the chief executive of another investment, retailer Askul Corp , over lacklustre results. Askul has requested Yahoo Japan dissolve its capital ties.",
    "($1 = 107.9800 yen)"
  ],
  "published_datetime": "2019-09-12 03:51:00"
}