{
  "url": "https://www.nasdaq.com/article/medtronic-names-next-ceo-as-omar-ishrak-to-step-down-in-2020-cm1206772",
  "title": "Medtronic Names Next CEO as Omar Ishrak to Step Down in 2020 - Nasdaq.com",
  "text": [
    " Shares of Medtronic plc. MDT  slipped a marginal 0.1% (to close at $107.89 on Aug 30) following the company's retirement announcement of Omar Ishrak, its current chairman and CEO since 2011. This was a period that wrote the triumph of this MedTech stalwart in golden letter s  . As planned, Ishrak has to step down from the CEO's post on Apr 26, 2020 after the company exits its current fiscal year as by that time, he will attain the mandatory retirement age of 65 years. This is a big news in itself as during Ishrak's tenure, among a host of enormous achievements that he made, annual revenues of the company doubled and its market capitalization increased by more than $100 billion. Per a Mass Device article, \"Ishrak will be most widely remembered for the largest-ever medtech merger - the $50-billion buyout of Covidien in early 2015 - and the raft of other M&A moves that defined his time at Medtronic.\" The Covidien acquisition is still the most gigantic one in the history of medical device industry.  The Successor to Omar  The market seems pretty positive about the board of directors' decision regarding the successor to fill Ishrak's shoes. Notably, Medtronic announced that Geoff Martha, the current executive vice president (EVP) of the company's Restorative Therapies Group (RTG), will take over the reins effective Apr 27, 2020. Meanwhile, Nov 1 onward, Martha will assume the newly-created role as Medtronic's president and also join its board members.    Like Ishrak, Martha's feat was also significant for Medtronic as he headed the company's path-breaking acquisition of Covidien. In July 2014, he was named the CEO for the integration of Covidien into Medtronic and later became the president of RTG in 2015. Prior to Medtronic, Martha spent 19 years handling a variety of business development, strategic marketing and sales management roles at GE Healthcare and GE Capital. Meanwhile, Brett Wall, the present senior vice president and president of RTG's Brain Therapies division, will be appointed as EVP and group president of RTG in November 2019. During his term, the Brain Therapies division generated double-digit annual growth and introduced devices like the Solitaire Revascularization for minimally invasive treatment in case of ischemic stroke.  Share Price Performance  Over the past year, shares of Medtronic have outperformed the industry  . The stock has returned 14.4% compared with the industry's 2.8% rise.  Zacks Rank and Other Stocks Worth a Look  Medtronic currently has a Zacks Rank #2 (Buy). A few other top-ranked stocks in the broader medical space are AmerisourceBergen Corporation ABC  , Baxter BAX  and NuVasive NUVA  , each carrying the same solid Zacks Rank as Medtronic. You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   . AmerisourceBergen's long-term historical earnings growth rate is estimated at 14.3%. Baxter's long-term earnings growth rate is projected at 12.8%. NuVasive's long-term earnings growth rate is expected to be 12.75%.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Medtronic PLC (MDT): Free Stock Analysis Report   NuVasive, Inc. (NUVA): Free Stock Analysis Report   Baxter International Inc. (BAX): Free Stock Analysis Report   AmerisourceBergen Corporation (ABC): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Shares of Medtronic plc. MDT  slipped a marginal 0.1% (to close at $107.89 on Aug 30) following the company's retirement announcement of Omar Ishrak, its current chairman and CEO since 2011. This was a period that wrote the triumph of this MedTech stalwart in golden letter s  .",
    "As planned, Ishrak has to step down from the CEO's post on Apr 26, 2020 after the company exits its current fiscal year as by that time, he will attain the mandatory retirement age of 65 years.",
    "This is a big news in itself as during Ishrak's tenure, among a host of enormous achievements that he made, annual revenues of the company doubled and its market capitalization increased by more than $100 billion.",
    "Per a Mass Device article, \"Ishrak will be most widely remembered for the largest-ever medtech merger - the $50-billion buyout of Covidien in early 2015 - and the raft of other M&A moves that defined his time at Medtronic.\" The Covidien acquisition is still the most gigantic one in the history of medical device industry.",
    " The Successor to Omar ",
    "The market seems pretty positive about the board of directors' decision regarding the successor to fill Ishrak's shoes. Notably, Medtronic announced that Geoff Martha, the current executive vice president (EVP) of the company's Restorative Therapies Group (RTG), will take over the reins effective Apr 27, 2020. Meanwhile, Nov 1 onward, Martha will assume the newly-created role as Medtronic's president and also join its board members.",
    "Like Ishrak, Martha's feat was also significant for Medtronic as he headed the company's path-breaking acquisition of Covidien. In July 2014, he was named the CEO for the integration of Covidien into Medtronic and later became the president of RTG in 2015. Prior to Medtronic, Martha spent 19 years handling a variety of business development, strategic marketing and sales management roles at GE Healthcare and GE Capital.",
    "Meanwhile, Brett Wall, the present senior vice president and president of RTG's Brain Therapies division, will be appointed as EVP and group president of RTG in November 2019. During his term, the Brain Therapies division generated double-digit annual growth and introduced devices like the Solitaire Revascularization for minimally invasive treatment in case of ischemic stroke.",
    " Share Price Performance ",
    "Over the past year, shares of Medtronic have outperformed the industry  . The stock has returned 14.4% compared with the industry's 2.8% rise.",
    " Zacks Rank and Other Stocks Worth a Look ",
    "Medtronic currently has a Zacks Rank #2 (Buy). A few other top-ranked stocks in the broader medical space are AmerisourceBergen Corporation ABC  , Baxter BAX  and NuVasive NUVA  , each carrying the same solid Zacks Rank as Medtronic. You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "AmerisourceBergen's long-term historical earnings growth rate is estimated at 14.3%.",
    "Baxter's long-term earnings growth rate is projected at 12.8%.",
    "NuVasive's long-term earnings growth rate is expected to be 12.75%.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:46:00"
}