{
  "url": "https://www.nasdaq.com/article/aurora-cannabis-inc-acb-reports-break-even-earnings-for-q4-cm1210819",
  "title": "Aurora Cannabis Inc. (ACB) Reports Break-Even Earnings for Q4 - Nasdaq.com",
  "text": [
    " Aurora Cannabis Inc. (ACB) reported break-even quarterly earnings per share versus the Zacks Consensus Estimate of a loss of $0.02. This compares to earnings of $0.13 per share a year ago. These figures are adjusted for non-recurring items. This quarterly report represents an earnings surprise of 100%. A quarter ago, it was expected that this company would post a loss of $0.03 per share when it actually produced a loss of $0.08, delivering a surprise of -166.67%. Over the last four quarters, the company has surpassed consensus EPS estimates just once. Aurora Cannabis Inc.Which belongs to the Zacks Medical - Products industry, posted revenues of $85.37 million for the quarter ended June 2019, surpassing the Zacks Consensus Estimate by 6.30%. This compares to year-ago revenues of $14.84 million. The company has topped consensus revenue estimates just once over the last four quarters. The sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the   earnings call  . Aurora Cannabis Inc. Shares have added about 26.6% since the beginning of the year versus the S&P 500's gain of 18.9%.  What's Next for Aurora Cannabis Inc.  While Aurora Cannabis Inc. Has outperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock? There are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately. Empirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power o f earnings  estimate revisions. Ahead of this earnings release, the estimate revisions trend for Aurora Cannabis Inc. Was unfavorable. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #4 (Sell) for the stock. So, the shares are expected to underperform the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  . It will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is -$0.02 on $93.16 million in revenues for the coming quarter and -$0.05 on $487.39 million in revenues for the current fiscal year. Investors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Medical - Products is currently in the top 28% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Aurora Cannabis Inc. (ACB): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Aurora Cannabis Inc. (ACB) reported break-even quarterly earnings per share versus the Zacks Consensus Estimate of a loss of $0.02. This compares to earnings of $0.13 per share a year ago. These figures are adjusted for non-recurring items.",
    "This quarterly report represents an earnings surprise of 100%. A quarter ago, it was expected that this company would post a loss of $0.03 per share when it actually produced a loss of $0.08, delivering a surprise of -166.67%.",
    "Over the last four quarters, the company has surpassed consensus EPS estimates just once.",
    "Aurora Cannabis Inc.Which belongs to the Zacks Medical - Products industry, posted revenues of $85.37 million for the quarter ended June 2019, surpassing the Zacks Consensus Estimate by 6.30%. This compares to year-ago revenues of $14.84 million. The company has topped consensus revenue estimates just once over the last four quarters.",
    "The sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the   earnings call  .",
    "Aurora Cannabis Inc. Shares have added about 26.6% since the beginning of the year versus the S&P 500's gain of 18.9%.",
    " What's Next for Aurora Cannabis Inc. ",
    "While Aurora Cannabis Inc. Has outperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?",
    "There are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.",
    "Empirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power o f earnings  estimate revisions.",
    "Ahead of this earnings release, the estimate revisions trend for Aurora Cannabis Inc. Was unfavorable. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #4 (Sell) for the stock. So, the shares are expected to underperform the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .",
    "It will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is -$0.02 on $93.16 million in revenues for the coming quarter and -$0.05 on $487.39 million in revenues for the current fiscal year.",
    "Investors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Medical - Products is currently in the top 28% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:15:03"
}