{
  "url": "https://www.nasdaq.com/article/ensign-group-acquires-nursing-facility-to-expand-in-idaho-cm1208129",
  "title": "Ensign Group Acquires Nursing Facility to Expand in Idaho - Nasdaq.com",
  "text": [
    "  The Ensign Group, Inc. ENSG  recently acquired the real estate and the operations of Temple View Transitional Care Center in Rexburg, ID. This transaction was effective Sep 1, 2019.  makeArticleAd();  With this buyout, Ensign Group will be able to expand its presence in Idaho where it has already penetrated as a leading company providing post-acute care. It expects to offer better healthcare with the aid of acquired skills.    Last July, Ensign Group also acquired the real estate and operations of McCall Rehabilitation and Care Center, a 40-bed skilled nursing facility located in McCall, ID. Idaho seems an attractive region with plenty of growth opportunities for the company since it has been constantly taking initiatives to boost its existence in this state over the past decade.    With this purchase, Ensign Group now has a portfolio of 202 skilled nursing hubs, of which 27 consist of assisted living operations, 57 assisted and independent living operations, 26 home health agencies, 28 hospice agencies and nine home care businesses across 16 states. The company owns the real estate at 80 of its 259 healthcare facilities.    Management announced that the company will continue to seek transactions to acquire real estate and lease both well-performing and struggling skilled nursing, assisted living and other healthcare related businesses in the new and the existing markets.    Last month, Ensign Group purchased the real estate and operations of Surprise Health and Rehabilitation Center in Surprise, AZ, the operations of Mainplace Senior Living, a 91-unit assisted living community in Orange, CA, the assets of Agape Hospice and Palliative Care and the real estate and operations of The Terrace at Mt. Ogden in UT. The company boasts a strong inorganic growth story with several acquisitions in the past decade. With each takeover, the company has whetted its efficiency, both clinically and financially. We expect all these buyouts to bode well for the company's long-term growth.    Ensign Group has also announced that its board of directors has authorized the separation of its home health and hospice business plus all its senior living operations from the parent company into a publicly traded entity. With this spin-off, the company expects to enhance its shareholder value. It hopes that it will be able to add value to its home health, senior living and hospice business line from this split-up.    Shares of this Zacks Rank #2 (Buy) company have rallied 28.9% in a year's time against its industry  's decline of 0.1%.     Other Key Picks    Investors interested in the medical sector can also take a look at some other top-ranked stocks like UnitedHealth Group Incorporated UNH  , Universal Health Services, Inc. UHS  and Molina Healthcare, Inc. MOH  .    UnitedHealth Group works as a diversified health care company. In the trailing four quarters, it came up with average beat of 3.4%. The company currently carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  .  Universal Health owns and operates acute care hospitals, outpatient facilities and behavioral health care facilities. In the last four quarters, the company delivered average beat of 4.5%. The stock is a Zacks #2 Ranked player.    Molina Healthcare provides managed health care services under the Medicaid and Medicare programs as well as via the state insurance marketplaces. The company currently sports a Zacks Rank #1 and managed to pull off average four-quarter positive surprise of 66.9%.  It's Illegal in 42 States, But Investors Will Make Billions Legally    In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.    That's twice as much as they spend on marijuana, legally or otherwise. Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.    See these 5 \"sin stocks\" now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Molina Healthcare, Inc (MOH): Free Stock Analysis Report   UnitedHealth Group Incorporated (UNH): Free Stock Analysis Report   Universal Health Services, Inc. (UHS): Free Stock Analysis Report   The Ensign Group, Inc. (ENSG): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " The Ensign Group, Inc. ENSG  recently acquired the real estate and the operations of Temple View Transitional Care Center in Rexburg, ID. This transaction was effective Sep 1, 2019.  makeArticleAd();  With this buyout, Ensign Group will be able to expand its presence in Idaho where it has already penetrated as a leading company providing post-acute care. It expects to offer better healthcare with the aid of acquired skills.    Last July, Ensign Group also acquired the real estate and operations of McCall Rehabilitation and Care Center, a 40-bed skilled nursing facility located in McCall, ID. Idaho seems an attractive region with plenty of growth opportunities for the company since it has been constantly taking initiatives to boost its existence in this state over the past decade.    With this purchase, Ensign Group now has a portfolio of 202 skilled nursing hubs, of which 27 consist of assisted living operations, 57 assisted and independent living operations, 26 home health agencies, 28 hospice agencies and nine home care businesses across 16 states. The company owns the real estate at 80 of its 259 healthcare facilities.    Management announced that the company will continue to seek transactions to acquire real estate and lease both well-performing and struggling skilled nursing, assisted living and other healthcare related businesses in the new and the existing markets.    Last month, Ensign Group purchased the real estate and operations of Surprise Health and Rehabilitation Center in Surprise, AZ, the operations of Mainplace Senior Living, a 91-unit assisted living community in Orange, CA, the assets of Agape Hospice and Palliative Care and the real estate and operations of The Terrace at Mt. Ogden in UT. The company boasts a strong inorganic growth story with several acquisitions in the past decade. With each takeover, the company has whetted its efficiency, both clinically and financially. We expect all these buyouts to bode well for the company's long-term growth.    Ensign Group has also announced that its board of directors has authorized the separation of its home health and hospice business plus all its senior living operations from the parent company into a publicly traded entity. With this spin-off, the company expects to enhance its shareholder value. It hopes that it will be able to add value to its home health, senior living and hospice business line from this split-up.    Shares of this Zacks Rank #2 (Buy) company have rallied 28.9% in a year's time against its industry  's decline of 0.1%.",
    "    Other Key Picks    Investors interested in the medical sector can also take a look at some other top-ranked stocks like UnitedHealth Group Incorporated UNH  , Universal Health Services, Inc. UHS  and Molina Healthcare, Inc. MOH  .    UnitedHealth Group works as a diversified health care company. In the trailing four quarters, it came up with average beat of 3.4%. The company currently carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  . ",
    "Universal Health owns and operates acute care hospitals, outpatient facilities and behavioral health care facilities. In the last four quarters, the company delivered average beat of 4.5%. The stock is a Zacks #2 Ranked player.    Molina Healthcare provides managed health care services under the Medicaid and Medicare programs as well as via the state insurance marketplaces. The company currently sports a Zacks Rank #1 and managed to pull off average four-quarter positive surprise of 66.9%.",
    " It's Illegal in 42 States, But Investors Will Make Billions Legally    In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.    That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.    See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:15:00"
}