{
  "url": "https://www.nasdaq.com/article/value-etf-lvhd-hits-new-52-week-high-cm1210411",
  "title": "Value ETF (LVHD) Hits New 52-Week High - Nasdaq.com",
  "text": [
    " For investors seeking momentum, Legg Mason Low Volatility High Dividend ETF LVHD   is probably on the radar. The fund just hit a 52-week high, and is up 21% from its 52-week low of $27.38 per share.  makeArticleAd();  But are more gains in store for this ETF? Let's take a quick look at the fund and the near-term outlook on it to get a better idea on where it might be headed:   LVHD in Focus    This fund provides exposure to U.S. companies with a relatively high yield, low price and earnings volatility by tracking the QS Low Volatility High Dividend Index. Utilities dominates the fund's portfolio with 25.3% share while real estate and consumer staples round off the next two spots. The ETF charges 27 basis points in fees (see: all the Large Cap Value ETFs here  ).   Why the Move?    The value corner of the broad investing world has been an area to watch lately given the continued volatility and uncertainty. This is because value ETFs seek to capitalize on inefficiencies in the market and have the potential to deliver higher returns with lower volatility compared with growth and blend counterparts. Additionally, they are less susceptible to trending markets and their dividend payouts offer safety in times of market turbulence.   More Gains Ahead?    Currently, LVHD has a Zacks ETF Rank #3 (Hold). Therefore, it is hard to get a handle on its future returns one way or the other. However, many of the segments that make up this ETF have a strong Zacks Industry Rank. So, there is definitely some promise for those who want to ride this surging ETF a little further.   Want key ETF info delivered straight to your inbox?    Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week. Get it free >>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Legg Mason Low Volatility High Dividend ETF (LVHD): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    "For investors seeking momentum, Legg Mason Low Volatility High Dividend ETF LVHD   is probably on the radar. The fund just hit a 52-week high, and is up 21% from its 52-week low of $27.38 per share.  makeArticleAd();  But are more gains in store for this ETF? Let's take a quick look at the fund and the near-term outlook on it to get a better idea on where it might be headed:   LVHD in Focus    This fund provides exposure to U.S. companies with a relatively high yield, low price and earnings volatility by tracking the QS Low Volatility High Dividend Index. Utilities dominates the fund's portfolio with 25.3% share while real estate and consumer staples round off the next two spots. The ETF charges 27 basis points in fees (see: all the Large Cap Value ETFs here  ).   Why the Move?    The value corner of the broad investing world has been an area to watch lately given the continued volatility and uncertainty. This is because value ETFs seek to capitalize on inefficiencies in the market and have the potential to deliver higher returns with lower volatility compared with growth and blend counterparts. Additionally, they are less susceptible to trending markets and their dividend payouts offer safety in times of market turbulence.   More Gains Ahead?    Currently, LVHD has a Zacks ETF Rank #3 (Hold). Therefore, it is hard to get a handle on its future returns one way or the other. However, many of the segments that make up this ETF have a strong Zacks Industry Rank. So, there is definitely some promise for those who want to ride this surging ETF a little further.   Want key ETF info delivered straight to your inbox?    Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week. Get it free >> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:00:00"
}