{
  "url": "https://www.nasdaq.com/article/why-shares-of-verint-systems-slumped-today-cm1208204",
  "title": "Why Shares of Verint Systems Slumped Today - Nasdaq.com",
  "text": [
    "Shares of Verint Systems (NASDAQ: VRNT) dropped on Thursday after the data analytics company reported its second-quarter results. The headline numbers were mixed relative to analyst expectations, with revenue growing more sluggishly than expected. The stock was down about 10.9% at 12:10 p.m. EDT.",
    "Verin t report ed second-quarter revenue of $324.3 million, up 5.9% year over year but more than $10 million below the average analyst estimate. Adjusted for currency, revenue grew by 7.1% from the prior-year period.",
    "Image source: Getty Images.",
    "Customer engagement revenue was up 8.1%, with cloud revenue soaring 37%. The company booked 11 cloud orders each with a total contract value exceeding $1 million. In the cyberintelligence business, revenue grew by 6.1% as the company accelerates its planned reduction of low-margin pass-through hardware sales.",
    "Non-GAAP (adjusted) earnings per share came in at $0.82, up from $0.76 in the prior-year period and $0.02 better than analysts were expecting. On a GAAP basis, EPS plunged by about 50% year over year to $0.16 thanks to higher operating costs.",
    "\"Overall, we continue to accelerate innovation and evolve our business models which we believe is resonating well with our customers and large partner network,\" said Verint CEO Dan Bodner in prepared remarks included in the earnings release.",
    "For the full fiscal year, Verint expects to produce non-GAAP revenue of $1.375 billion, up 10.5%, and non-GAAP EPS of $3.65, up 14%. This guidance implies stronger second-half revenue growth, but it wasn't enough to overcome a mixed report. Verint stock has rallied in 2019, but a big chunk of those gains disappeared on Thursday.",
    "10 stocks we like better than Verint Systems\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Verint Systems wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Timothy Green has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 12:51:00"
}