{
  "url": "https://www.nasdaq.com/article/absolutely-not-pm-johnson-denies-lying-to-queen-elizabeth-in-brexit-crisis-20190912-00420",
  "title": "\"Absolutely not\": PM Johnson denies lying to Queen Elizabeth in Brexit crisis - Nasdaq.com",
  "text": [
    "By Andrew MacAskill and Guy Faulconbridge",
    "LONDON, Sept 12 (Reuters) - Prime Minister Boris Johnson on Thursday denied lying to Queen Elizabeth over the reasons for suspending the British parliament after a court ruled his decision was unlawful and opponents called for lawmakers to be recalled to discuss Brexit.",
    "Since Johnson won the top job in July, Britain's Brexit crisis has spun more furiously, leaving investors and allies bewildered by an array of decisions that have pushed the once stable political system to its limits.",
    "Scotland's highest court of appeal ruled on Wednesday that the suspension was not lawful and was intended to stymie lawmakers, prompting opponents to question whether Johnson had lied to Elizabeth, the world's longest reining monarch, who must formally order the prorogation.",
    "\"Absolutely not,\" Johnson said when asked if he had misled the queen, who is widely respected for more than 67 years of dedicated service during which she has stayed above the fray of politics.",
    "Johnson said the current session of parliament was longer than any since the English Civil war in the 17th Century, adding that lawmakers would have plenty of time to again discuss Brexit after an EU summit on Oct. 17-18.",
    "He says parliament was suspended to allow the government to present its legislative programme.",
    "With less than 50 days until the United Kingdom is due to leave, the government and parliament are locked in conflict over the future of Brexit, with possible outcomes ranging from leaving without a deal to another referendum.",
    "A 'no-deal' Brexit could snarl cross-Channel trade routes, disrupting supplies of medicines and fresh food while protests spread across Britain, according to a worst-case scenario reluctantly released by the government on Wednesday.",
    "The \"Operation Yellowhammer\" assumptions, prepared six weeks ago just days after Johnson became prime minister, form the basis of government no-deal planning.",
    "\"SIGNIFICANT GAPS\" ",
    "Johnson has repeatedly said he will seek to strike a deal at the EU summit to remove the Irish border backstop, an insurance agreement to prevent the return of border controls between Northern Ireland and the Irish Republic. British lawmakers fear the backstop will lock the United Kingdom into the EU's orbit for years to come.",
    "The European Union would respond positively if the British government shifts its position in Brexit talks in the coming weeks, Ireland's Foreign Minister Simon Coveney said.",
    "But Coveney said that there were \"significant gaps\" between British proposals and what Ireland and the EU would consider. He said the threat of a no-deal Brexit might help make the British debate \"more honest\". ",
    "Belfast'sHigh Court dismissed on Thursday a case arguing that a British exit from the European Union without a withdrawal agreement would contravene Northern Ireland's 1998 peace accord. ",
    "Johnson said the government is waiting to hear an appeal next week against the Scottish court ruling by the Supreme Court, the United Kingdom's highest judicial body, and he respected the independence of the judges.",
    "Last week, the High Court of England and Wales rejected a similar challenge by campaigners, saying it was a political not a judicial matter.",
    "\"Indeed, as I say, the High Court in England plainly agrees with us, but the Supreme Court will have to decide,\" Johnson said. Buckingham Palace has declined to comment on the ruling, saying it is a matter for the government.",
    "But the publication of the government's no-deal Brexit scenario prompted calls from Labour and other opposition parties for parliament to be recalled."
  ],
  "published_datetime": "2019-09-12 07:46:00"
}