{
  "url": "https://www.nasdaq.com/article/sabra-sbra-amends-22b-credit-facility-extends-maturities-cm1210464",
  "title": "Sabra (SBRA) Amends $2.2B Credit Facility, Extends Maturities - Nasdaq.com",
  "text": [
    "  Sabra Health Care REIT, Inc. SBRA  recently boosted its balance-sheet strength by amending the company's unsecured credit facility aggregating $2.2 billion. The amendment will also improve the company's debt maturities laddering. The credit facility consists of $1-billion revolving credit facility, $1.1-billion term loans (both in U.S. dollars) and a CAD $125-million term loan. The company has restated the facility to reduce interest rates on the loan and to extend maturities. Specifically, the amended credit facility indicates lower interest-rate spreads for the revolver of 15 basis points (bps) and 20 bps for the term loan borrowings, based on Sabra's current credit rating. This is likely to result in annual interest expense savings of nearly $2.8 million, considering the revolver balance as of the end of the second quarter. Management also noted that the improved pricing will be conducive to the company's earnings. Further, maturity of the revolver has been extended from August 2021 to August 2023, while the term loans have been laddered with various maturities through August 2024 as compared with the prior maturity dates through August 2022. With this, the company has no significant maturities until 2022. Per management, Sabra remains committed to strengthen its balance sheet. In fact, by the end of this year, the company aims to reduce leverage to below 5.5x. Moreover, in May, it completed the first investment-grade rated bond issuance. Net proceeds were used to redeem the outstanding 5.5% senior notes maturing in 2021. These efforts provide a cheaper line of credit to the company and help reduce annualized interest expense. These will also boost Sabra's cash flow and alleviate its bottom-line pressure. Moreover, extended maturities of the assumed debt will help improve its maturity profile and ensure greater liquidity for day-to-day operations. Shares of this Zacks Rank #3 (Hold) company have gained 12.6% over the past six months compared with the  industry  's rally of 3.8%.       Stocks to Consider  Investors can consider some better-ranked stocks from the same space like Alexandria Real Estate Equities, Inc. ARE  , EastGroup Properties, Inc. EGP  and Prologis, Inc. PLD  , each carrying a Zacks Rank of 2 (Buy), at present. You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   . Alexandria Real Estate's Zacks Consensus Estimate for 2019 funds from operations (FFO) per share has remained unchanged at $6.98 in the past month. EastGroup Properties' Zacks Consensus Estimate for the ongoing year's FFO per share has remained unchanged at $4.92 in a month's time. Prologis' FFO per share estimates for the current year remained unchanged at $3.28 over the past month. Note:  Anything related to earnings presented in this write-up represent funds from operations (FFO) - a widely used metric to gauge the performance of REITs.   Looking for Stocks with Skyrocketing Upside? makeArticleAd();   Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Sabra Healthcare REIT, Inc. (SBRA): Free Stock Analysis Report   Alexandria Real Estate Equities, Inc. (ARE): Free Stock Analysis Report   EastGroup Properties, Inc. (EGP): Free Stock Analysis Report   Prologis, Inc. (PLD): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Sabra Health Care REIT, Inc. SBRA  recently boosted its balance-sheet strength by amending the company's unsecured credit facility aggregating $2.2 billion. The amendment will also improve the company's debt maturities laddering.",
    "The credit facility consists of $1-billion revolving credit facility, $1.1-billion term loans (both in U.S. dollars) and a CAD $125-million term loan. The company has restated the facility to reduce interest rates on the loan and to extend maturities.",
    "Specifically, the amended credit facility indicates lower interest-rate spreads for the revolver of 15 basis points (bps) and 20 bps for the term loan borrowings, based on Sabra's current credit rating. This is likely to result in annual interest expense savings of nearly $2.8 million, considering the revolver balance as of the end of the second quarter. Management also noted that the improved pricing will be conducive to the company's earnings.",
    "Further, maturity of the revolver has been extended from August 2021 to August 2023, while the term loans have been laddered with various maturities through August 2024 as compared with the prior maturity dates through August 2022. With this, the company has no significant maturities until 2022.",
    "Per management, Sabra remains committed to strengthen its balance sheet. In fact, by the end of this year, the company aims to reduce leverage to below 5.5x. Moreover, in May, it completed the first investment-grade rated bond issuance. Net proceeds were used to redeem the outstanding 5.5% senior notes maturing in 2021.",
    "These efforts provide a cheaper line of credit to the company and help reduce annualized interest expense. These will also boost Sabra's cash flow and alleviate its bottom-line pressure. Moreover, extended maturities of the assumed debt will help improve its maturity profile and ensure greater liquidity for day-to-day operations.",
    "Shares of this Zacks Rank #3 (Hold) company have gained 12.6% over the past six months compared with the  industry  's rally of 3.8%. ",
    "  Stocks to Consider ",
    "Investors can consider some better-ranked stocks from the same space like Alexandria Real Estate Equities, Inc. ARE  , EastGroup Properties, Inc. EGP  and Prologis, Inc. PLD  , each carrying a Zacks Rank of 2 (Buy), at present. You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "Alexandria Real Estate's Zacks Consensus Estimate for 2019 funds from operations (FFO) per share has remained unchanged at $6.98 in the past month.",
    "EastGroup Properties' Zacks Consensus Estimate for the ongoing year's FFO per share has remained unchanged at $4.92 in a month's time.",
    "Prologis' FFO per share estimates for the current year remained unchanged at $3.28 over the past month.",
    "Note:  Anything related to earnings presented in this write-up represent funds from operations (FFO) - a widely used metric to gauge the performance of REITs. ",
    " Looking for Stocks with Skyrocketing Upside? makeArticleAd();   Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:18:00"
}