{
  "url": "https://www.nasdaq.com/article/why-is-chesapeake-chk-up-58-since-last-earnings-report-cm1208061",
  "title": "Why Is Chesapeake (CHK) Up 5.8% Since Last Earnings Report? - Nasdaq.com",
  "text": [
    " It has been about a month since the las t earnings  report for Chesapeake Energy (CHK). Shares have added about 5.8% in that time frame, outperforming the S&P 500. Will the recent positive trend continue leading up to its next earnings release, or is Chesapeake due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important drivers.  Chesapeake Q2 Earnings Lag Estimates, Revenues   Beat  Chesapeake Energy Corporation reported second-quarter 2019 loss per share (excluding special items) of 10 cents, wider than the Zacks Consensus Estimate of loss of 7 cents. In the year-ago quarter, the company reported a profit of 15 cents a share. Operating revenues amounted to $1,454 million, up from $982 million in the year-ago quarter. The top line also beat the Zacks Consensus Estimate of $1,163 million. The bottom line has been affected by lower natural gas production and a decline in commodity price, partially offset by record quarterly oil volumes.  Operational Performance  Chesapeake's production in the reported quarter was approximately 45 million barrels of oil equivalent (MMBoe), down from 48 MMBoe a year ago. The total production comprised 11 million barrels (MMbbls) of oil (up 38% year over year), 185 billion cubic feet of natural gas (down 12%) and 3 MMbbls of natural gas liquids (NGLs) (down 40%). Importantly, the daily oil production of 122 MBbl during the June quarter represents the highest volume of crude produced in any quarter by the upstream energy player. Oil equivalent realized price - exclusive of unrealized gains (losses) on derivatives - was $26.25 per barrel of oil equivalent (Boe), increasing from $23.82 in the year-ago quarter. Oil price rose to $61.44 per barrel from $57.16 in the year-ago quarter. However,  natural gas prices  declined to $2.48 per thousand cubic feet from the year-ago level of $2.64. Moreover, average sales price of NGLs was recorded at $13.43 per barrel in the quarter compared with $24.97 a year ago.  Operating Expenses  Total operating costs in the second quarter declined to $2,108 million from $2,449 million in the prior-year period. However, quarterly production expenses per Boe increased to $3.68 from $2.86 in the year-ago period.  Capital Expenditure  Total capital expenditure increased to $559 million in the second quarter from $530 million in the year-ago period, primarily due to a rise in initial drilling and completion capital spending.  Financials  At the end of the quarter under review, Chesapeake had a cash balance of $4 million. Net long-term debt was $9,701 million, leading to a debt-to-capitalization ratio of 69.6%.  Guidance  The company issued its updated production guidance for 2019 in the range of 484,000-505,000 Boe per day. Notably, the company maintained its total capital budget for 2019 at $2,105-$2,305 million.   How Have Estimates Been Moving Since Then?  It turns out, fresh estimates have trended downward during the past month. The consensus estimate has shifted -32.22% due to these changes.  VGM Scores  Currently, Chesapeake has an average Growth Score of C, though it is lagging a bit on the Momentum Score front with a D. Charting a somewhat similar path, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy. Overall, the stock has an aggregate VGM Score of C. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. It's no surprise Chesapeake has a Zacks Rank #4 (Sell). We expect a below average return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Chesapeake Energy Corporation (CHK): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "It has been about a month since the las t earnings  report for Chesapeake Energy (CHK). Shares have added about 5.8% in that time frame, outperforming the S&P 500.",
    "Will the recent positive trend continue leading up to its next earnings release, or is Chesapeake due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important drivers.  Chesapeake Q2 Earnings Lag Estimates, Revenues   Beat  Chesapeake Energy Corporation reported second-quarter 2019 loss per share (excluding special items) of 10 cents, wider than the Zacks Consensus Estimate of loss of 7 cents. In the year-ago quarter, the company reported a profit of 15 cents a share. Operating revenues amounted to $1,454 million, up from $982 million in the year-ago quarter. The top line also beat the Zacks Consensus Estimate of $1,163 million. The bottom line has been affected by lower natural gas production and a decline in commodity price, partially offset by record quarterly oil volumes.  Operational Performance  Chesapeake's production in the reported quarter was approximately 45 million barrels of oil equivalent (MMBoe), down from 48 MMBoe a year ago. The total production comprised 11 million barrels (MMbbls) of oil (up 38% year over year), 185 billion cubic feet of natural gas (down 12%) and 3 MMbbls of natural gas liquids (NGLs) (down 40%). Importantly, the daily oil production of 122 MBbl during the June quarter represents the highest volume of crude produced in any quarter by the upstream energy player. Oil equivalent realized price - exclusive of unrealized gains (losses) on derivatives - was $26.25 per barrel of oil equivalent (Boe), increasing from $23.82 in the year-ago quarter. Oil price rose to $61.44 per barrel from $57.16 in the year-ago quarter. However,  natural gas prices  declined to $2.48 per thousand cubic feet from the year-ago level of $2.64. Moreover, average sales price of NGLs was recorded at $13.43 per barrel in the quarter compared with $24.97 a year ago.  Operating Expenses  Total operating costs in the second quarter declined to $2,108 million from $2,449 million in the prior-year period. However, quarterly production expenses per Boe increased to $3.68 from $2.86 in the year-ago period.  Capital Expenditure  Total capital expenditure increased to $559 million in the second quarter from $530 million in the year-ago period, primarily due to a rise in initial drilling and completion capital spending.  Financials  At the end of the quarter under review, Chesapeake had a cash balance of $4 million. Net long-term debt was $9,701 million, leading to a debt-to-capitalization ratio of 69.6%.  Guidance  The company issued its updated production guidance for 2019 in the range of 484,000-505,000 Boe per day. Notably, the company maintained its total capital budget for 2019 at $2,105-$2,305 million. ",
    " Chesapeake Q2 Earnings Lag Estimates, Revenues   Beat ",
    "Chesapeake Energy Corporation reported second-quarter 2019 loss per share (excluding special items) of 10 cents, wider than the Zacks Consensus Estimate of loss of 7 cents. In the year-ago quarter, the company reported a profit of 15 cents a share.",
    "Operating revenues amounted to $1,454 million, up from $982 million in the year-ago quarter. The top line also beat the Zacks Consensus Estimate of $1,163 million.",
    "The bottom line has been affected by lower natural gas production and a decline in commodity price, partially offset by record quarterly oil volumes.",
    " Operational Performance ",
    "Chesapeake's production in the reported quarter was approximately 45 million barrels of oil equivalent (MMBoe), down from 48 MMBoe a year ago. The total production comprised 11 million barrels (MMbbls) of oil (up 38% year over year), 185 billion cubic feet of natural gas (down 12%) and 3 MMbbls of natural gas liquids (NGLs) (down 40%). Importantly, the daily oil production of 122 MBbl during the June quarter represents the highest volume of crude produced in any quarter by the upstream energy player.",
    "Oil equivalent realized price - exclusive of unrealized gains (losses) on derivatives - was $26.25 per barrel of oil equivalent (Boe), increasing from $23.82 in the year-ago quarter. Oil price rose to $61.44 per barrel from $57.16 in the year-ago quarter. However,  natural gas prices  declined to $2.48 per thousand cubic feet from the year-ago level of $2.64. Moreover, average sales price of NGLs was recorded at $13.43 per barrel in the quarter compared with $24.97 a year ago.",
    " Operating Expenses ",
    "Total operating costs in the second quarter declined to $2,108 million from $2,449 million in the prior-year period. However, quarterly production expenses per Boe increased to $3.68 from $2.86 in the year-ago period.",
    " Capital Expenditure ",
    "Total capital expenditure increased to $559 million in the second quarter from $530 million in the year-ago period, primarily due to a rise in initial drilling and completion capital spending.",
    " Financials ",
    "At the end of the quarter under review, Chesapeake had a cash balance of $4 million. Net long-term debt was $9,701 million, leading to a debt-to-capitalization ratio of 69.6%.",
    " Guidance ",
    "The company issued its updated production guidance for 2019 in the range of 484,000-505,000 Boe per day. Notably, the company maintained its total capital budget for 2019 at $2,105-$2,305 million.",
    " How Have Estimates Been Moving Since Then? ",
    "It turns out, fresh estimates have trended downward during the past month. The consensus estimate has shifted -32.22% due to these changes.",
    " VGM Scores ",
    "Currently, Chesapeake has an average Growth Score of C, though it is lagging a bit on the Momentum Score front with a D. Charting a somewhat similar path, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of C. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. It's no surprise Chesapeake has a Zacks Rank #4 (Sell). We expect a below average return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:31:22"
}