{
  "url": "https://www.nasdaq.com/article/britains-clydesdale-bank-shares-plunge-20-on-ppi-provisions-bombshell-20190905-00175",
  "title": "Britain's Clydesdale Bank shares plunge 20% on PPI provisions bombshell - Nasdaq.com",
  "text": [
    "By Sinead Cruise and Iain Withers",
    "LONDON, Sept 5 (Reuters) - Shares in Britain'sClydesdale Bank  tumbled by a fifth on Thursday, after it made a fresh 300 million to 450 million pound ($368 million-$552 million) provision to settle mis-selling claims linked to Britain's most expensive consumer banking scandal.",
    "The lender, which also owns Yorkshire Bank and Virgin Money brands, said late on Wednesday it had received an \"unprecedented volume\" of complaints from customers seeking compensation for mis-sold payment protection insurance (PPI) before an Aug. 29 deadline.",
    "RBS  warned on Wednesday it faced additional costs of up to 900 million pounds. ",
    "During August alone, CYBG said it had received more than eight months' worth of Information Requests, with 340,000 in aggregate over five weeks. Some 120,000 complaints were received in the three days before the deadline.",
    "Investors had expected Clydesdale to become a dividend paying stock as early as this year, but analysts said the additional provision was likely to wipe out its excess capital and put future payouts at risk.",
    "\"Given management's credibility is challenged on PPI, investors are likely to avoid this share until results on Nov. 28\", Jefferies said in a client note. \"Potential capital distributions are likely off the table for full year 2019.\"",
    "A spokesman for Clydesdale declined to comment on the potential impact on its dividend plans.",
    "Clydesdale previously told investors it planned to return excess capital to shareholders above a target core capital ratio of 13%, with a 50% payout ratio over time.",
    "The bank said in its statement the additional PPI provision would hit its capital ratio by up to 190 basis points, taking it to between 13.3% and 12.7% depending on the final bill.",
    "Clydesdale said it would remain above regulatory capital requirements.",
    "($1 = 0.8145 pounds)"
  ],
  "published_datetime": "2019-09-05 05:12:00"
}