{
  "url": "https://www.nasdaq.com/article/5-top-ranked-blue-chip-tech-stocks-to-buy-in-september-cm1207075",
  "title": "5 Top-Ranked Blue Chip Tech Stocks to Buy in September - Nasdaq.com",
  "text": [
    " The technology sector, which is benefiting from rapid digital transformation, has been one of the best performing sectors so far this year. Notably, Technology Select Sector SPDR ETF (XLK) has returned 26.7% year to date, reflecting the sector's strength. The last few years have witnessed a series of breakthroughs in cloud computing, predictive analysis, AI, self-driving vehicles, digital personal assistants and IoT. Moreover, the accelerated deployment of 5G technology - the next wireless revolution - is likely to create more opportunities. This will significantly raise demand for high-tech handheld gadgets and micro-processors. However, the ongoing U.S.-China trade war and a slowing China economy are potent challenges. Therefore, there are chances that small-cap stocks will collapse in the face of aggravated economic slowdown. With that said, we have highlighted five blue chips with large capital base and solid fundamentals, which may prove to be the best option for investors in the months ahead.  Strategy to Pick Stocks  With the help of our Zacks Stock Screener  , we've cherry picked five blue-chip technology stocks that possess strong fundamentals. Each of these stocks have a market cap of more than $5 billion and carries a Zacks Rank #1 (Strong Buy) or 2 (Buy). You can see  the complete list of today's Zacks #1 Rank stocks here  .  To narrow down the list, we have selected those with a VGM Score  of A or B. Our research shows that stocks with a VGM Score of A or B when combined with a Zacks Rank #1 or 2 offer the best upside potential. All the five stocks carry a Zacks Rank #2.  Our Picks   Alphabet GOOGL  provides web-based search, advertisements, maps, software applications, mobile operating systems, consumer content, enterprise solutions, commerce and hardware products. The company outpaced the Zacks Consensus Estimate in the trailing four quarters, the average positive earnings surprise being 18.9%. The company has an expected earnings growth rate of 14.3% for the current year. The stock has a VGM Score of B. The stock has returned 11.9% on a year-to-date basis.  Alphabet Inc. Price and Consensus         Alphabet Inc. price-consensus-chart    |   Alphabet Inc. Quote    Cognizant Technology Solutions Corporation CTSH  is a leading professional services company. Its services include digital services and solutions, consulting, application development, systems integration, application testing, application maintenance, infrastructure services, and business process services. The company outpaced the Zacks Consensus Estimate in three of the trailing four quarters, the average positive earnings surprise being 0.59%. The stock has a VGM Score of A. The stock has lost 3.2% on a year-to-date basis.   Cognizant Technology Solutions Corporation Price and     Consensus        Cognizant Technology Solutions Corporation   price-consensus-chart    |   Cognizant Technology Solutions Corporation   Quote    Verizon Communications VZ  isone of the largest communication technology companies in the world. The company offers communications, information and entertainment products and services to consumers, businesses and governmental agencies worldwide. The company outpaced the Zacks Consensus Estimate in the trailing four quarters, the average positive earnings surprise being 2.6%. The company has an expected earnings growth rate of 1.91% for the current year.  The stock has a VGM Score of B. The stock has returned 3.3% on a year-to-date basis.  Verizon Communications Inc. Price and Consensus         Verizon Communications Inc.   price-consensus-chart    |   Verizon Communications Inc. Quote    CDW Corporation CDW  is a leading provider of integrated information technology solutions to small, medium and large business, government, education and healthcare customers in the United States, the United Kingdom and Canada. The company outpaced the Zacks Consensus Estimate in the trailing four quarters, the average positive earnings surprise being 8.87%. CDW Corporation has an expected earnings growth rate of 13.35% for the current year. The stock has a VGM Score of A. The stock has returned 43.2% on a year-to-date basis.  CDW Corporation Price and Consensus         CDW Corporation price-consensus-chart    |   CDW Corporation Quote    Symantec SYMC  is known for some of the popular brands in security and utilities. It offers a wide range of application and software products for firewall, virtual private network, virus protection, vulnerability management, intrusion detection and security services. The company outpaced the Zacks Consensus Estimate in three of the trailing four quarters, the average positive earnings surprise being 18.62%. The company has an expected earnings growth rate of 9.43% for the current year.  The stock has a VGM Score of B Symantec has returned 21.7% on a year-to-date basis.  Symantec Corporation Price and Consensus         Symantec Corporation price-consensus-chart    |   Symantec Corporation Quote    Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Alphabet Inc. (GOOGL): Free Stock Analysis Report   Cognizant Technology Solutions Corporation (CTSH): Free Stock Analysis Report   CDW Corporation (CDW): Free Stock Analysis Report   Verizon Communications Inc. (VZ): Free Stock Analysis Report   Symantec Corporation (SYMC): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "The technology sector, which is benefiting from rapid digital transformation, has been one of the best performing sectors so far this year.",
    "Notably, Technology Select Sector SPDR ETF (XLK) has returned 26.7% year to date, reflecting the sector's strength.",
    "The last few years have witnessed a series of breakthroughs in cloud computing, predictive analysis, AI, self-driving vehicles, digital personal assistants and IoT.",
    "Moreover, the accelerated deployment of 5G technology - the next wireless revolution - is likely to create more opportunities. This will significantly raise demand for high-tech handheld gadgets and micro-processors.",
    "However, the ongoing U.S.-China trade war and a slowing China economy are potent challenges. Therefore, there are chances that small-cap stocks will collapse in the face of aggravated economic slowdown.",
    "With that said, we have highlighted five blue chips with large capital base and solid fundamentals, which may prove to be the best option for investors in the months ahead.",
    " Strategy to Pick Stocks ",
    "With the help of our Zacks Stock Screener  , we've cherry picked five blue-chip technology stocks that possess strong fundamentals. Each of these stocks have a market cap of more than $5 billion and carries a Zacks Rank #1 (Strong Buy) or 2 (Buy). You can see  the complete list of today's Zacks #1 Rank stocks here  . ",
    "To narrow down the list, we have selected those with a VGM Score  of A or B. Our research shows that stocks with a VGM Score of A or B when combined with a Zacks Rank #1 or 2 offer the best upside potential.",
    "All the five stocks carry a Zacks Rank #2.",
    " Our Picks ",
    " Alphabet GOOGL  provides web-based search, advertisements, maps, software applications, mobile operating systems, consumer content, enterprise solutions, commerce and hardware products.",
    "The company outpaced the Zacks Consensus Estimate in the trailing four quarters, the average positive earnings surprise being 18.9%. The company has an expected earnings growth rate of 14.3% for the current year. The stock has a VGM Score of B.",
    "The stock has returned 11.9% on a year-to-date basis.",
    " Alphabet Inc. Price and Consensus ",
    "     Alphabet Inc. price-consensus-chart    |   Alphabet Inc. Quote  ",
    " Alphabet Inc. price-consensus-chart    |   Alphabet Inc. Quote ",
    " Cognizant Technology Solutions Corporation CTSH  is a leading professional services company. Its services include digital services and solutions, consulting, application development, systems integration, application testing, application maintenance, infrastructure services, and business process services.",
    "The company outpaced the Zacks Consensus Estimate in three of the trailing four quarters, the average positive earnings surprise being 0.59%. The stock has a VGM Score of A.",
    "The stock has lost 3.2% on a year-to-date basis.",
    "  Cognizant Technology Solutions Corporation Price and     Consensus        Cognizant Technology Solutions Corporation   price-consensus-chart    |   Cognizant Technology Solutions Corporation   Quote  ",
    " Cognizant Technology Solutions Corporation Price and     Consensus ",
    " Cognizant Technology Solutions Corporation   price-consensus-chart    |   Cognizant Technology Solutions Corporation   Quote ",
    " Verizon Communications VZ  isone of the largest communication technology companies in the world. The company offers communications, information and entertainment products and services to consumers, businesses and governmental agencies worldwide.",
    "The company outpaced the Zacks Consensus Estimate in the trailing four quarters, the average positive earnings surprise being 2.6%. The company has an expected earnings growth rate of 1.91% for the current year.  The stock has a VGM Score of B.",
    "The stock has returned 3.3% on a year-to-date basis.",
    " Verizon Communications Inc. Price and Consensus ",
    "     Verizon Communications Inc.   price-consensus-chart    |   Verizon Communications Inc. Quote  ",
    " Verizon Communications Inc.   price-consensus-chart    |   Verizon Communications Inc. Quote ",
    " CDW Corporation CDW  is a leading provider of integrated information technology solutions to small, medium and large business, government, education and healthcare customers in the United States, the United Kingdom and Canada.",
    "The company outpaced the Zacks Consensus Estimate in the trailing four quarters, the average positive earnings surprise being 8.87%. CDW Corporation has an expected earnings growth rate of 13.35% for the current year. The stock has a VGM Score of A.",
    "The stock has returned 43.2% on a year-to-date basis.",
    " CDW Corporation Price and Consensus ",
    "     CDW Corporation price-consensus-chart    |   CDW Corporation Quote  ",
    " CDW Corporation price-consensus-chart    |   CDW Corporation Quote ",
    " Symantec SYMC  is known for some of the popular brands in security and utilities. It offers a wide range of application and software products for firewall, virtual private network, virus protection, vulnerability management, intrusion detection and security services.",
    "The company outpaced the Zacks Consensus Estimate in three of the trailing four quarters, the average positive earnings surprise being 18.62%. The company has an expected earnings growth rate of 9.43% for the current year.  The stock has a VGM Score of B",
    "Symantec has returned 21.7% on a year-to-date basis.",
    " Symantec Corporation Price and Consensus ",
    "     Symantec Corporation price-consensus-chart    |   Symantec Corporation Quote  ",
    " Symantec Corporation price-consensus-chart    |   Symantec Corporation Quote ",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 07:58:00"
}