{
  "url": "https://www.nasdaq.com/article/mexicos-5-bln-debt-bailout-for-pemex-a-one-off-deputy-minister-20190912-00104",
  "title": "Mexico's $5 bln debt bailout for Pemex 'a one off' -deputy minister - Nasdaq.com",
  "text": [
    "MEXICO CITY, Sept 12 (Reuters) - Mexico's$5 billion rescue package to pay down debt at Pemex  is a one-of-a-kind transaction that should give the struggling state oil company breathing space to focus on output and costs, Deputy Finance Minister Gabriel Yorio said.",
    "Yorio told Reuters in an interview on Wednesday that the transaction, which also includes a debt refinancing plan, would be the last support the government gives to the world's most indebted oil company this year.",
    "The step, announced earlier on Wednesday, was the latest by President Andres Manuel Lopez Obrador to plot a brighter future for the cash-strapped, debt-laden oil and gas producer after years of declining output. ",
    "Yorio said a second such downgrade risked contaminating Mexico's sovereign debt profile, which is rated by Fitch as BBB and that Moody's has on negative outlook.",
    "To stave off a possible Pemex downgrade, the Mexican government has given Pemex several tax breaks and cash support this year, and has budgeted for another $4.4 billion of similar support in 2020. The government is expected to continue providing extra cash to the company for several more years.",
    "The package including the $5 billion for prepayment of bonds that mature between 2020 and 2023 was a one-off, however, Yorio said.",
    "\"A transaction like this is only this time. We don't plan to do it every year, nor are we planning capitalizations like this every year,\" he said.",
    "\"This is the last piece of support that we are planning to give to Pemex from the point of view of the 2019 fiscal year.\"",
    "Pemex did not immediately respond to a request for comment.",
    "The company said in its announcement of the package on Wednesday that it will issue new bonds in maturities of seven, 10 and 30 years to refinance short-term debt, although it did not give a value for the new bond placements.",
    "Yorio also declined to give the scale of the refinancing Pemex was targeting, beyond saying it should be larger than a similar program launched by Brazil this week. ",
    "In June, Pemex's chief financial officer said it was aiming to refinance $2.5 billion in maturing debt during 2019. ",
    "\"We think is will be a transaction with enough volume that we can eliminate the company's credit risk in the short term,\" Yorio said.",
    "With the level of relief provided to Pemex this year by the government, it was now the turn of the company to make improvements to head off further ratings actions, Yorio said.",
    "\"We think that by controlling the part of the finances, it permits (Pemex) to concentrate more on production,\" he said, adding that he wanted to see Pemex meet a target of producing 1.8 million barrels of oil per day in December, up from around 1.65 million currently.",
    "\"More than the government, they have to turn round the financial and production indicators,\" he said. \"They have to work now on cost efficiencies.\""
  ],
  "published_datetime": "2019-09-12 04:10:00"
}