{
  "url": "https://www.nasdaq.com/article/uk-stocksfactors-to-watch-on-sept-12-20190912-00064",
  "title": "UK Stocks-Factors to watch on Sept. 12 - Nasdaq.com",
  "text": [
    " (Adds news items, futures)",
    "Sept 12 (Reuters) - Britain's FTSE 100 .FTSE index is seen opening up 37points at 7,375 on Thursday, according to financial bookmakers, with futures up0.4% ahead of cash market open.",
    "* CO-OP GROUP: Britain'sCo-Operative Group42TE.L , the mutually-ownedsupermarkets-to-funerals group, reported a lower first-half profit, as weaknessin its funeral unit offset a strong performance in its food business. urn:newsml:reuters.com:*:nL3N2631EO",
    "* MORRISONS: Morrisons MRW.L , Britain's No. 4 grocer, reported its firstfall in quarterly underlying sales since 2016, partly reflecting a toughcomparison with last year when it was boosted by a hot summer. urn:newsml:reuters.com:*:nL5N2630YN",
    "* BAT: British American Tobacco PlcBATS.L said it would lay off 2,300employees globally by January as the world's second largest tobacco company bysales looks to streamline its operations. urn:newsml:reuters.com:*:nL3N2631BG",
    "* HSBC: HSBCHSBA.L is planning to exit its French retail banking businessunder interim chief executive Noel Quinn, the Wall Street Journal reported onWednesday, citing people familiar with the matter. urn:newsml:reuters.com:*:nL3N2623BX",
    "* OIL: Oil prices jumped, bouncing back from heavy losses in the previoussession, buoyed by moves to ease trade tensions between Washington and Beijingand a drop in U.S. crude inventories to the lowest in nearly a year. O/R",
    "* GOLD: Gold prices fell as equities gained on improving risk sentimentbuoyed by signs of gradual de-escalation in U.S.-China trade tensions, whileinvestors eyed European Central Bank's meeting for cues on monetary policyeasing. urn:newsml:reuters.com:*:nL3N2630CN",
    "* EX-DIVS: Melrose Industries PLCMRON.L will trade without entitlement toits latest dividend pay-out, trimming 0.3 points off the FTSE 100 according toReuters calculations. ",
    "* The UK blue chip index on Wednesday closed up 1% at 7338.03 points onsigns of less tension in the U.S.-China trade fight and prospects of morestimulus from central banks, while shares in London Stock Exchange scaled arecord high after Hong Kong Exchanges and Clearing's offer. urn:newsml:reuters.com:*:nL3N2621TK",
    "* For more on the factors affecting European stocks, please click on: LIVE/",
    "TODAY'S UK PAPERS",
    "> Financial TimesPRESS/FT",
    "> Other business headlines             PRESS/GB  (Reporting by Indranil Sarkar in Bengaluru) ((Indranil.Sarkar@thomsonreuters.com; within UK +44 20 7542 1810, outside UK+91 80 6749 9573;))"
  ],
  "published_datetime": "2019-09-12 02:57:00"
}