{
  "url": "https://www.nasdaq.com/article/the-bull-market-in-chipotle-stock-is-far-from-finished-cm1210649",
  "title": "The Bull Market in Chipotle Stock Is Far From Finished - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Although Chipotle (NYSE: CMG ) has been red hot recently, it finally met a small roadblock on Tuesday. Here's an in-depth explanation for the session's uncomfortable selloff and, more importantly, what likely lies ahead for CMG stock.",
    "CMG stock has enjoyed a terrific 2019. Shares of Chipotle have returned an amazing 83%. That's more than Home Depot (NYSE: HD ), Amazon (NASDAQ: AMZN ), Apple (NASDAQ: AAPL ) or most any other large-cap stock out there. And that's on top of 2018's gains of nearly 50% in CMG. Yet as recently as Monday, shares were up nearly 99% and hitting all-time-highs.",
    "So, what gives?",
    "On Tuesday, New York City filed a lawsuit against the fast-fresh restaurant operator. Authorities allege the company violated its Fair Workweek Law. But despite investors not taking any chances with CMG stock, today's troubles aren't remotely close to being a repeat of Chipotle's food scare scandal from a couple years back.",
    "To be clear, I'm not suggesting Chipotle stock will walk away scot-free. There will be a monetary slap on the wrist when all is said and done as NYC wants at least $1 million in restitution. utlimately though, the damage will be negligible and Chipotle is working dutifully alongside officials to ensure procedures and systems are in place to comply with the city's laws in the future.",
    "The other fact to remember is Tuesday's story won't impact Chipotle's stunning and well-deserved recovery over the past two years from the nadir of its food scare crisis. The company is poised to deliver more growth with its rapidly building digital leadership through e-commerce sales, mobile apps and loyalty programs.",
    "According to Wedbush's Nick Setyan, Chipotle's strategic sales channels should usher in a multi-year streak of mid-to-high single-digit same-store sales growth. Along with Monday's upbeat forecast, Wedbush upgraded CMG stock from neutral to buy , while slapping a $980 12-month price target on shares.",
    "If investors look at the Chipotle stock chart for today, conditions are serving up a nice-looking pullback in the making. Tuesday's pressure has taken shares back into a test of uptrend support and toward a test of its prior, pre-scandal, all-time-high set in late 2015 and the stock's massive corrective base.",
    "Ideally, another couple sessions of profit-taking or short sellers trying their hand once again in CMG will take shares down to $755 - $760. And buyers stepping up to buy technical support around the old high will enjoy immediate gratification. Don't hold your breath though.",
    "Technically, the real world rarely works out so neatly on the price chart. That's not to say Chipotle stock isn't a buy. It is, but be prepared for price volatility around any future purchases of CMG stock.",
    "My suggestion is to size the initial buy decision in shares with the intention of buying additional CMG stock on weakness into a wide area of Fibonacci support from $565 - $773. Additionally, as the more extreme levels could produce some intestinal discomfort for any investors acting too aggressively, I'd also advise waiting for a bullish stochastics crossover or for actual oversold conditions to come into play before making that first move.",
    "Disclosure: Investment accounts under Christopher Tyler's management recently exited Chipotle stock (CMG) and / or its derivatives. The information offered is based upon Christopher Tyler's observations and strictly intended for educational purposes only; the use of which is the responsibility of the individual. For additional options-based strategies and related musings, follow Chris on Twitter @Options_CAT and StockTwits .",
    "The post The Bull Market in Chipotle Stock Is Far From Finished appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:21:00"
}