{
  "url": "https://www.nasdaq.com/article/having-cake-eating-it-too-jobs-numbers-good-rate-cut-coming-cm1207984",
  "title": "Having Cake & Eating It Too? Jobs Numbers Good, Rate Cut Coming - Nasdaq.com",
  "text": [
    "  Thursday, September 5, 2019  makeArticleAd();  The first week of every month, even holiday-shortened weeks like this one, come with new employment data from the previous month. This morning, we see new August private-sector payroll totals from Automatic Data Processing ADP   , which provided good news for the U.S. labor market: a headline number of 195K - 53,000 more jobs than we saw in July (a downwardly revised 142K).    As usual, Services outperformed Goods by a large margin: 184K vs. 11K. That said, the recently flagging Manufacturing sector brought 8,000 of those new jobs last month, which is the strongest we've seen this summer. Medium-sized businesses (50-499 employees) created 77K new jobs last month, followed by 66K from small businesses and 52K from large firms. This shows better-than-expected growth in small firms especially, which had been struggling to keep up in recent months.    Education/Healthcare led the way with 58K - this is a normal occurrence, but even this figure is higher than normal. Next was Leisure/Hospitality with 42K and Trade/Transportation at 39K. So even when we look under the hood, we see strength in monthly jobs totals, at least in the private sector.    Tomorrow morning brings the all-inclusive U.S. non-farm payroll report from the Bureau of Labor Statistics (BLS)  , as well as a fresh Unemployment Rate  . Expectations - recorded prior to this morning's ADP release - were for between 150-170K new jobs created in August and maintaining 3.7% unemployment, which is historically pretty low. Perhaps we'll see a bump-up in analyst estimates today based on the ADP numbers, but this remains to be seen.   Weekly Jobless Claims Stay Within Range    Initial Jobless Claims  for last week posted a 217K headline, up 1000 claims from the previous week's upwardly revised 216K. Yet this number stays cozily within the long-term 200-225K weekly new claims numbers we've seen, which is a clear representation of a continuing robust labor market.    Whether we start to see dings in the armor as the trade war moves forward (and possibly worsens) remains to be seen, but for now these headwinds do not appear in near-term employment data. Continuing Claims took a step lower from the previous week to 1.662 million, after ebbing above 1.7 million temporarily a few weeks ago. Again, very solid strength in U.S. employment.   Pre-Markets Up Big    Following a roughly 1% gain in major indexes during regular trading yesterday, these strong figures in the jobs market - in addition to relief coming from the U.S.-China trade tensions this week - are sending the Dow up 260 points at this part of the pre-market, the Nasdaq up 95 and the S&P 500 up 27.    It would appear the markets are currently having their cake and eating it, too: robust jobs numbers with a pending interest rate cut next week, plus an unresolved trade war many market participants have chosen to turn optimistic about. Perhaps this will be the tonic for gains this month, after a rough time of it in August.    Mark Vickery   Senior Editor    Questions or comments about this article and/or its author? Click here>>   Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>       Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   SPDR Dow Jones Industrial Average ETF (DIA): ETF Research Reports   Invesco QQQ (QQQ): ETF Research Reports   SPDR S&P 500 ETF (SPY): ETF Research Reports   Automatic Data Processing, Inc. (ADP): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    " Thursday, September 5, 2019  makeArticleAd();  The first week of every month, even holiday-shortened weeks like this one, come with new employment data from the previous month. This morning, we see new August private-sector payroll totals from Automatic Data Processing ADP   , which provided good news for the U.S. labor market: a headline number of 195K - 53,000 more jobs than we saw in July (a downwardly revised 142K).    As usual, Services outperformed Goods by a large margin: 184K vs. 11K. That said, the recently flagging Manufacturing sector brought 8,000 of those new jobs last month, which is the strongest we've seen this summer.",
    "Medium-sized businesses (50-499 employees) created 77K new jobs last month, followed by 66K from small businesses and 52K from large firms. This shows better-than-expected growth in small firms especially, which had been struggling to keep up in recent months.    Education/Healthcare led the way with 58K - this is a normal occurrence, but even this figure is higher than normal. Next was Leisure/Hospitality with 42K and Trade/Transportation at 39K. So even when we look under the hood, we see strength in monthly jobs totals, at least in the private sector.    Tomorrow morning brings the all-inclusive U.S. non-farm payroll report from the Bureau of Labor Statistics (BLS)  , as well as a fresh Unemployment Rate  . Expectations - recorded prior to this morning's ADP release - were for between 150-170K new jobs created in August and maintaining 3.7% unemployment, which is historically pretty low. Perhaps we'll see a bump-up in analyst estimates today based on the ADP numbers, but this remains to be seen.   Weekly Jobless Claims Stay Within Range    Initial Jobless Claims  for last week posted a 217K headline, up 1000 claims from the previous week's upwardly revised 216K. Yet this number stays cozily within the long-term 200-225K weekly new claims numbers we've seen, which is a clear representation of a continuing robust labor market.    Whether we start to see dings in the armor as the trade war moves forward (and possibly worsens) remains to be seen, but for now these headwinds do not appear in near-term employment data. Continuing Claims took a step lower from the previous week to 1.662 million, after ebbing above 1.7 million temporarily a few weeks ago. Again, very solid strength in U.S. employment.   Pre-Markets Up Big    Following a roughly 1% gain in major indexes during regular trading yesterday, these strong figures in the jobs market - in addition to relief coming from the U.S.-China trade tensions this week - are sending the Dow up 260 points at this part of the pre-market, the Nasdaq up 95 and the S&P 500 up 27.    It would appear the markets are currently having their cake and eating it, too: robust jobs numbers with a pending interest rate cut next week, plus an unresolved trade war many market participants have chosen to turn optimistic about. Perhaps this will be the tonic for gains this month, after a rough time of it in August.    Mark Vickery   Senior Editor    Questions or comments about this article and/or its author? Click here>> ",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>    ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:59:00"
}