{
  "url": "https://www.nasdaq.com/article/nvidia-needs-to-squash-its-competitors-cm1206966",
  "title": "Nvidia Needs to Squash its Competitors - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "All industries are competitive, but the semiconductor industry takes competition to the next level - something Nvidia (NASDAQ: NVDA ) investors know all too well.",
    "Considering the headwinds facing the chip industry, namely the ongoing U.S.-China trade war , the almost 1.6% August gain posted by Nvidia stock is impressive. It's even more so when measured against a monthly decline of 0.35% for the widely followed iShares PHLX Semiconductor ETF (NASDAQ: SOXX ).",
    "Remember that late last month, various reports indicated that Advanced Micro Devices (NASDAQ: AMD ), one of Nvidia's primary rivals, surpassed Nvidia for the first time since 2014 in terms of overall graphics card shipments? In that market, there are just three players, AMD, Nvidia and Intel (NASDAQ: INTC ).",
    "Jon Peddie Researchreported last week that in the second quarter, AMD took the lead in graphics processing unit shipments, up 9.8% quarter-over-quarter. Nvidia's shipments were flat and Intel's shipments dropped quarter-over-quarter.",
    "As is the case with other areas of the semiconductor market, demand for the chips Nvidia specializes in can be volatile . Favorably for Nvidia stock, the company has been entering new arenas in an effort to rejuvenate its revenue stream.",
    "Don't get too excited about Nvidia stock because it resides almost 43% below its 52-week high. Investors must acknowledge the company has some areas to address before NVDA can get its groove back. One of these areas is the data center space.",
    "For the second quarter,  Morningstar  reported that NVDA's data center revenue was down 14% year-over-year. This revenue came in at $655 million, labeled \"unimpressive\" by sector strategist Abhinav Davuluri.",
    "\"Hyperscale spending was particularly poor but Nvidia expects the weakness to be short-lived, noting continued activity in AI engineering,\" Davuluri wrote.",
    "Combine that with softness in the gaming business - a major driver of Nvidia's revenue - and the aforementioned rivalry with AMD, and there are spots management needs to address before Wall Street starts fawning over AMD again.",
    "Those soft spots don't mean the case for Nvidia stock is dead. The company is establishing itself in some of the fastest-growing markets of tomorrow including artificial intelligence, robotics and self-driving cars.",
    "Self-driving cars aren't on the road in significant numbers yet, currently accounting for a scant percentage of Nvidia's revenue. But that space could prove meaningful to the company's top line in the future.",
    "\"The firm views the car as a 'supercomputer on wheels,'\" said Morningstar's Davuluri . \"Although this segment currently contributes relatively little to the top line, we acknowledge the opportunity Nvidia has to grow its presence in cars beyond infotainment as drivers seek autonomous features in newer vehicles.\"",
    "Self-driving cars are one of many AI applications. The chips Nvidia is developing can potentially serve more uses throughout the burgeoning AI/robotics ecosystem, which is encouraging at a time of soaring demand for industrial robots . The company makes a chip it hails as the \"brains\" of robots.",
    "In an Aug. 20 news release, the Robotics Industry Association announced that North American companies had ordered 8,752 robots. These robots have a cumulative value of $446 million.",
    "For long-term investors considering Nvidia stock, it is encouraging that the company has some scale in the GPU market. This enables it to stem some of the demand ebbs and flows associated with the PC and gaming segments. The data center market is expected to boom and could represent half of Nvidia's revenue by 2023.",
    "That's a positive, but investors should also demand that management continue its efforts to bolster revenue diversity. Management can do this by leveraging its superior switching costs to become a force in the self-driving automobile market.",
    "Over the near term, a \"neutral\"approach to Nvidia stock may be best unless the shares aggressively surpass the $170 range. Below $150, the stock could have downside to $130.",
    "As of this writing, Todd Shriber did not own any of the aforementioned securities.",
    "The post Nvidia Needs to Squash its Competitors appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:47:09"
}