{
  "url": "https://www.nasdaq.com/article/chinese-online-insurance-intermediary-huize-files-for-a-150-million-us-ipo-cm1207466",
  "title": "Chinese online insurance intermediary Huize files for a $150 million US IPO - Nasdaq.com",
  "text": [
    " Huize Holding, which operates an online insurance intermediation platform in China, filed on Wednesday with the SEC to raise up to $150 million in an initial public offering.    The Shenzhen, China-based company was founded in 2014 and booked $108 million in revenue for the 12 months ended June 30, 2019. It plans to list on the Nasdaq or the NYSE under the symbol HUIZ. Huize Holding filed confidentially on June 6, 2019. Morgan Stanley, Citi, CICC and Tiger Brokers are the joint bookrunners on the deal. No pricing terms were disclosed.    The article Chinese online insurance intermediary Huize files for a $150 million US IPO  originally appeared on IPO investment manager Renaissance Capital's web site renaissancecapital.com.   Investment Disclosure:  The information and opinions expressed herein were prepared by Renaissance Capital's research analysts and do not constitute an offer to buy or sell any security. Renaissance Capital's Renaissance IPO ETF (symbol: IPO)  , Renaissance International ETF (symbol: IPOS)  , or separately managed institutional accounts may have investments in securities of companies mentioned.",
    "Huize Holding, which operates an online insurance intermediation platform in China, filed on Wednesday with the SEC to raise up to $150 million in an initial public offering.    The Shenzhen, China-based company was founded in 2014 and booked $108 million in revenue for the 12 months ended June 30, 2019. It plans to list on the Nasdaq or the NYSE under the symbol HUIZ. Huize Holding filed confidentially on June 6, 2019. Morgan Stanley, Citi, CICC and Tiger Brokers are the joint bookrunners on the deal. No pricing terms were disclosed.  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 01:16:00"
}