{
  "url": "https://www.nasdaq.com/article/the-1-thing-you-should-not-do-before-you-apply-for-a-big-loan-cm1210765",
  "title": "The 1 Thing You Should NOT Do Before You Apply for a Big Loan - Nasdaq.com",
  "text": [
    "       Thinking of applying for a big loan? Make sure you avoid this   financial misstep in the months before you apply.  There comes a time in most people's lives when borrowing a lot of money is necessary. Perhaps you need to take out a mortgage to buy a home, for example, or borrow to buy a car, or take out a personal loan  to fund another big purchase or pay off some debt. If you do need to borrow a big sum, it's important you get the best rate possible. After all, the more you borrow, the higher the interest costs will be -- even if you get a loan with a favorable rate. You also want to shop around to find the best overall loan terms, including rates, fees, and repayment timelines.makeArticleAd();   Image source: Getty Images  To get the very best rate and have the widest choice of lenders willing to approve you for financing, it's imperative you avoid major financial mistakes in the time leading up to when you apply for your big loan. What is the key mistake you should avoid before applying for a big loan? Although there are many big financial mistakes that could jeopardize your ability to get a loan on favorable terms, there's one huge mistake that can have a major impact and that's far too common: Maxing out a credit card  . Maxing out a credit card can be tempting if you're about to buy a house. After all, you may need a ton of new furniture for your new abode. You may also max out a card on car repairs before finally deciding to bite the bullet and buy another vehicle. Or, you may max out a credit card before deciding to take out a personal loan for debt consolidation. Unfortunately, your maxed-out credit card could cost you the ability to apply for that mortgage, car loan, or personal loan you were hoping to secure. Or, it could make your loan much more expensive. In fact, it's so damaging to your ability to get favorable financing that it is something you should just never do before borrowing a lot of money. Why is maxing out a credit card prior to applying for a big loan such a terrible idea? Here are a few key reasons. Your maxed out-card could do major damage to your credit score Lots of factors go into determining your credit score, but your credit utilization ratio  is the second most important factor after payment history. This is a ratio that measures the amount of credit used versus credit available. If you use more than 30% of your available credit, your score will suffer. If you keep your credit utilization ratio low, your score will be higher. A maxed-out credit card can have a surprisingly serious impact on your credit score. In fact, according to myFico  , a credit score of 793 could fall as much as 128 points due to maxing out a credit card and a score of 607 could fall up to almost 50 points. If your score drops by this much, it can push you into a higher risk tier. Fewer lenders will be willing to give you a loan, so you'll have less choice of loan terms. And, you're likely to end up being offered only loans that carry much higher interest rates than you'd have paid had you kept your credit balance low. It could also hurt your debt-to-income ratio Lenders look at your credit score when deciding whether to allow you to borrow a lot of money. But they also look at your debt-to-income ratio  . This is the amount of debt you're carrying relative to your income. Lenders compare monthly debt payments with monthly income. If your debt takes up too high a percentage of your income, you either won't be approved for a loan or will only be approved at a much higher interest rate. Unfortunately, a maxed-out credit card means you'll have a higher debt balance and your minimum monthly payments will be higher. Your higher debt-to-income ratio will also affect your chances of loan approval, potentially reducing your choice of lender and resulting in a higher rate on your loan, which you'll then be paying for a very long time. Don't let a maxed-out credit card destroy your chances of getting the best possible loan Maxing out a credit card may not seem like a big deal. But if it makes your personal loan, car loan, mortgage, or other major debt source more expensive, you will regret it. You could end up paying much more in interest for many more years. Keep your credit utilization ratio well below 30% in the time leading up to borrowing for other things, and you'll be far better off in the long run. Our Picks of the Best Personal Loans for 2019 We've vetted the market to bring you our shortlist of the best personal loan providers  . Whether you're looking to pay off debt faster by slashing your interest rate or needing some extra money to tackle a big purchase, these best-in-class picks can help you reach your financial goals. Click here to get the full rundown  on our top picks.  The Motley Fool owns and recommends MasterCard and Visa, and recommends American Express. We're firm believers in the Golden Rule. If we wouldn't recommend an offer to a close family member, we wouldn't recommend it on The Ascent either. Our number one goal is helping people find the best offers to improve their finances. That is why editorial opinions are ours alone and have not been previously reviewed, approved, or endorsed by included advertisers. Editorial content from The Ascent is separate from The Motley Fool editorial content and is created by a different analyst team.",
    "      Thinking of applying for a big loan? Make sure you avoid this   financial misstep in the months before you apply. ",
    "There comes a time in most people's lives when borrowing a lot of money is necessary. Perhaps you need to take out a mortgage to buy a home, for example, or borrow to buy a car, or take out a personal loan  to fund another big purchase or pay off some debt.",
    "If you do need to borrow a big sum, it's important you get the best rate possible. After all, the more you borrow, the higher the interest costs will be -- even if you get a loan with a favorable rate. You also want to shop around to find the best overall loan terms, including rates, fees, and repayment timelines.",
    "  Image source: Getty Images ",
    "Image source: Getty Images",
    "To get the very best rate and have the widest choice of lenders willing to approve you for financing, it's imperative you avoid major financial mistakes in the time leading up to when you apply for your big loan.",
    "Although there are many big financial mistakes that could jeopardize your ability to get a loan on favorable terms, there's one huge mistake that can have a major impact and that's far too common: Maxing out a credit card  .",
    "Maxing out a credit card can be tempting if you're about to buy a house. After all, you may need a ton of new furniture for your new abode. You may also max out a card on car repairs before finally deciding to bite the bullet and buy another vehicle. Or, you may max out a credit card before deciding to take out a personal loan for debt consolidation.",
    "Unfortunately, your maxed-out credit card could cost you the ability to apply for that mortgage, car loan, or personal loan you were hoping to secure. Or, it could make your loan much more expensive. In fact, it's so damaging to your ability to get favorable financing that it is something you should just never do before borrowing a lot of money.",
    "Why is maxing out a credit card prior to applying for a big loan such a terrible idea? Here are a few key reasons.",
    "Lots of factors go into determining your credit score, but your credit utilization ratio  is the second most important factor after payment history. This is a ratio that measures the amount of credit used versus credit available. If you use more than 30% of your available credit, your score will suffer. If you keep your credit utilization ratio low, your score will be higher.",
    "A maxed-out credit card can have a surprisingly serious impact on your credit score. In fact, according to myFico  , a credit score of 793 could fall as much as 128 points due to maxing out a credit card and a score of 607 could fall up to almost 50 points.",
    "If your score drops by this much, it can push you into a higher risk tier. Fewer lenders will be willing to give you a loan, so you'll have less choice of loan terms. And, you're likely to end up being offered only loans that carry much higher interest rates than you'd have paid had you kept your credit balance low.",
    "Lenders look at your credit score when deciding whether to allow you to borrow a lot of money. But they also look at your debt-to-income ratio  . This is the amount of debt you're carrying relative to your income.",
    "Lenders compare monthly debt payments with monthly income. If your debt takes up too high a percentage of your income, you either won't be approved for a loan or will only be approved at a much higher interest rate.",
    "Unfortunately, a maxed-out credit card means you'll have a higher debt balance and your minimum monthly payments will be higher. Your higher debt-to-income ratio will also affect your chances of loan approval, potentially reducing your choice of lender and resulting in a higher rate on your loan, which you'll then be paying for a very long time.",
    "Maxing out a credit card may not seem like a big deal. But if it makes your personal loan, car loan, mortgage, or other major debt source more expensive, you will regret it. You could end up paying much more in interest for many more years.",
    "Keep your credit utilization ratio well below 30% in the time leading up to borrowing for other things, and you'll be far better off in the long run.",
    "We've vetted the market to bring you our shortlist of the best personal loan providers  . Whether you're looking to pay off debt faster by slashing your interest rate or needing some extra money to tackle a big purchase, these best-in-class picks can help you reach your financial goals. Click here to get the full rundown  on our top picks.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 04:00:00"
}