{
  "url": "https://www.nasdaq.com/article/china-us-to-hold-trade-talks-in-october--china-commerce-ministry-20190904-01227",
  "title": "China, U.S. to hold trade talks in October - China commerce ministry - Nasdaq.com",
  "text": [
    "BEIJING, Sept 5 (Reuters) - China and the United States agreed to hold high-level trade talks in early October in Washington, China's commerce ministry said on Thursday, amid fears that an escalating trade war could trigger a global economic recession.",
    "The announcement followed a call earlier in the day between China's Vice Premier Liu He and U.S. Trade Representative Robert Lighthizer and U.S. Treasury Secretary Steven Mnuchin, the Ministry of Commerce said in a statement on its website. China's central bank governor Yi Gang was also on the call.",
    "\"Both sides agreed that they should work together and take practical actions to create good conditions for consultations,\" the ministry said.",
    "A spokesman for the U.S. Trade Representative's office confirmed that Lighthizer and Mnuchin spoke with Liu and said they agreed to hold ministerial-level trade talks in Washington \"in the coming weeks\". ",
    "Washington began imposing 15% tariffs on an array of Chinese imports on Sunday, while China began placing new duties on U.S. crude oil. That prompted China to lodge a complaint against the United States at the World Trade Organization. ",
    "The United States plans to increase the tariff rate to 30% from the 25% duty already in place on $250 billion worth of Chinese imports from Oct. 1.",
    "U.S. President Donald Trump warned on Tuesday he would be tougher on Beijing in a second term if trade talks dragged on, compounding market fears that ongoing trade disputes between the United States and China could trigger a U.S. recession. ",
    "Chinese leaders will have a packed schedule next month, gearing up for National Day celebrations scheduled for Oct. 1.",
    "They will also hold a key meeting in October to discuss improving governance and \"perfecting\" the country's socialist system, state media has said, more than a year after the last was held. "
  ],
  "published_datetime": "2019-09-04 09:49:00"
}