{
  "url": "https://www.nasdaq.com/article/is-vanguard-dividend-appreciation-index-investor-vdaix-a-strong-mutual-fund-pick-right-now-cm1207720",
  "title": "Is Vanguard Dividend Appreciation Index Investor (VDAIX) a Strong Mutual Fund Pick Right Now? - Nasdaq.com",
  "text": [
    "If you've been stuck searching for Large Cap Blend funds, consider Vanguard Dividend Appreciation Index Investor (VDAIX) as a possibility. VDAIX has no Zacks Mutual Fund Rank, but we have been able to look into other metrics like performance, volatility, and cost.",
    "Objective",
    "We note that VDAIX is a Large Cap Blend option, an area loaded with different options. More often than not, Large Cap Blend mutual funds invest in companies with a market cap of over $10 billion. Buying stakes in bigger companies offer these funds more stability, and are well-suited for investors with a \" buy and hold \" mindset. Additionally, blended funds mix large, more established firms into their portfolios, giving investors exposure to value and growth opportunities.",
    "History of Fund/Manager",
    "VDAIX is a part of the Vanguard Group family of funds, a company based out of Malvern, PA. The Vanguard Dividend Appreciation Index Investor made its debut in April of 2006 and VDAIX has managed to accumulate roughly $23.80 million in assets, as of the most recently available information. Walter Nejman is the fund's current manager and has held that role since May of 2016.",
    "Performance",
    "Investors naturally seek funds with strong performance. This fund carries a 5-year annualized total return of 11.53%, and it sits in the top third among its category peers. If you're interested in shorter time frames, do not dismiss looking at the fund's 3-year annualized total return of 13.55%, which places it in the top third during this time-frame.",
    "When looking at a fund's performance, it is also important to note the standard deviation of the returns. The lower the standard deviation, the less volatility the fund experiences. Compared to the category average of 10.66%, the standard deviation of VDAIX over the past three years is 11.62%. Looking at the past 5 years, the fund's standard deviation is 11.15% compared to the category average of 10.77%. This makes the fund more volatile than its peers over the past half-decade.",
    "Risk Factors",
    "One cannot ignore the volatility of this segment, however, as it is always important for investors to remember the downside to any potential investment. In the most recent bear market, VDAIX lost 41.05% and outperformed its peer group by 8%. This makes the fund a possibly better choice than its peers during a sliding market environment.",
    "Even still, the fund has a 5-year beta of 0.9, so investors should note that it is hypothetically less volatile than the market at large. Another factor to consider is alpha, as it reflects a portfolio's performance on a risk-adjusted basis relative to a benchmark-in this case, the S&P 500. The fund has produced a positive alpha over the past 5 years of 1.2, which shows that managers in this portfolio are skilled in picking securities that generate better-than-benchmark returns.",
    "Expenses",
    "For investors, taking a closer look at cost-related metrics is key, since costs are increasingly important for mutual fund investing. Competition is heating up in this space, and a lower cost product will likely outperform its otherwise identical counterpart, all things being equal. In terms of fees, VDAIX is a no load fund. It has an expense ratio of 0.14% compared to the category average of 0.96%. So, VDAIX is actually cheaper than its peers from a cost perspective.",
    "While the minimum initial investment for the product is $3,000, investors should also note that each subsequent investment needs to be at least $1.",
    "Bottom Line",
    "This could just be the start of your research on VDAIXin the Large Cap Blend category. Consider going to www.zacks.com/funds/mutual-funds for additional information about this fund, and all the others that we rank as well for additional information. If you are more of a stock investor, make sure to also check out our Zacks Rank, and our full suite of tools we have available for novice and professional investors alike.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 07:00:06"
}