{
  "url": "https://www.nasdaq.com/article/5-retail-stocks-that-belong-on-your-shopping-list-today-cm1206951",
  "title": "5 Retail Stocks That Belong on Your Shopping List Today - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Retail stocks are a tricky buy right now as several factors are weighing on the sector. The trade war between the U.S. and China remains an uncertainty for the majority of retailers, but consumer behavior and a changing landscape has also cast a shadow over several retail sectors. However, that doesn't mean there aren't deals to be had.",
    "Here's a look at 5 retail stocks that should be on your radar now. ",
    "Discount chain Dollar General (NYSE: DG ) is one of the retail stocks that investors should have on their shopping list. There are a lot of reasons to like DG stock, most prominently is the fact that the company is undergoing a major expansion that's likely to drive growth in the near term. DG is aggressively increasing its footprint with plans to open 975 new stores by the end of the year. ",
    "Plus, the firm is building out its fresh offerings in order to increase customer spend and potentially draw in new shoppers. To help with that expansion, the firm is remodeling its existing stores to include cold cases where fresh food can be displayed. That remodel effort is seen increasing same store sales by a minimum of 4% . ",
    "In an effort to further boost its expansion plans, Dollar General partnered with FedEx (NYSE: FDX ) in order to make many of its locations into pickup and drop-off points. That should help bring in customers who might not have otherwise visited a DG location.",
    "Dollar General stock also represents a defensive play should macroeconomic conditions worsen and a recession hits the U.S. Deep discounters like DG are unlikely to be as harshly affected as other retail stocks.",
    "Another firm to consider if you're looking for retail stocks to buy is electronics firm Best Buy (NYSE: BBY ). BBBY stock is down 14% from where it was a year ago and moving into the holiday shopping season the firm looks poised to make a big comeback.",
    "Before I lay out my reason for including Best Buy stock on this list, it's important to acknowledge that the electronics space that BBY operates in is rife with competition. There's a lot of price competition which could weigh on Best Buy's long-term margin expansion. With that said, I still believe BBY is a good bet.",
    "Over the past few years, Best Buy has been on a cost-cutting mission that has eliminated more than $1 billion in annual costs. Management isn't done yet, though - the company plans to raise its operating profit a further $600 million as it revamps its return and replacement procedures. The firm has also been able to create a successful omnichannel experience that allows customers to buy online and ship from in-store. That sets Best Buy apart from some of it's exclusively e-commerce opponents.",
    "This holiday quarter, Best Buy looks ready to run with new e-commerce centers that it says will help it offer free next-day delivery to 50 million customers . BBY has been working to build out its supply chain in order to offer competitive prices and shipping options and this holiday season will prove whether those investments can pay off.",
    "The grocery space has been shifting recently as new entrants like Amazon (NASDAQ: AMZN ) give online shopping additional momentum. However, unlike what happened with shopping malls and department stores, grocers have been better prepared to weather the storm and change with the times. Kroger (NYSE: KR ) is one such grocer who has proven to be a winner in the space, even with Amazon gobbling up some of the market share.",
    "KR stock is down nearly 30% from where it was a year ago, largely because of concerns about competition from the likes of Amazon, Target (NYSE: TGT ) and Walmart (NYSE: WMT ). Despite investor fears, Kroger delivered on its first-quarter results in June , proving that the supermarket chain's business was still on firm footing. Worries about the changing landscape of groceries kept the results from inspiring any confidence and Kroger stock continued to slide. ",
    "The bottom line on KR stock is that it's undervalued right now. Investor fears are overdone - Kroger is a best-in-class supermarket that's unlikely to buckle under the pressure of increased competition. The firm has a huge amount of customer data on hand to create targeted promotions and effectively manage inventory and buying. It's size has given it the ability to create an omnichannel experience to keep customers loyal even when they switch to online shopping.",
    "On top of that, KR recently raised its dividend for the 13th consecutive year, demonstrating management's commitment to shareholders. With a yield just shy of 3%, I think KR stock is one of the best retail bargains you can get right now. ",
    "Another grocery retailer that should be on your radar right now is wholesale giant Costco (NASDAQ: COST ). The firm's business model has proven to be iron clad, with its membership dues making up the bulk of its revenue. The firm sells it's goods with a razor thin margins which gives customers confidence that they're getting the best price when they shop. That leads to renewals, which keeps COST stock riding high. Costco's membership renewal rate is upwards of 90% - meaning customers are happy.",
    "And why wouldn't they be? Not only is Costco known for offering low prices, but the firm is also providing an experience for its customers that makes it worth driving to a physical location for. The company switches up some of its merchandise regularly which creates a 'treasure-hunt' feel for bargain shoppers. Plus the firm's sample stations and ultra-cheap cafe keep shoppers engaged in the Costco experience. ",
    "Unlike Kroger, though, Costco does appear to have a major catalyst ahead - growth in China. This week Costco opened its first location in mainland China where the sheer volume of shoppers caused the store to close early. Chinese shoppers waited up to three hours just to park. That says something about the firm's entrance into China and suggests that the US/China trade war has done little to quell Chinese shoppers' enthusiasm about a bargain. ",
    "Tanger Factory Outlet Centers (NYSE: SKT ) stock is, in a way, riskier than the others on this list because the REIT invests in shopping centers that house outlet stores. As there's quite a lot of uncertainty surrounding the future of shopping malls, SKT is inherently risky. However, that doesn't mean it's doomed. ",
    "Tanger has certainly felt the burn of the retail apocalypse and the potential for an economic downturn hasn't helped sentiment any, but at just $13 per share and with a dividend yield of 10%, it's hard to overlook. Yes, Tanger is struggling to grow its income as the popularity of shopping malls declines, but the firm has paired down its portfolio significantly by selling off its less-profitable assets and reinvesting in those that show potential. ",
    "Right now the firm boasts an occupancy rate of 96% , exceptional in the retail space, and more importantly traffic is moving in the right direction. The firm's yield looks safe for now and it's depressed share price makes it worth considering if you've got a strong stomach.  ",
    "As of this writing, the author held no positions in the aforementioned securities.",
    "The post 5 Retail Stocks That Belong on Your Shopping List Today appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:09:21"
}