{
  "url": "https://www.nasdaq.com/article/this-could-be-the-reason-40-of-baby-boomers-struggle-in-retirement-cm1210067",
  "title": "This Could Be the Reason 40% of Baby Boomers Struggle in Retirement - Nasdaq.com",
  "text": [
    " Credit card debt is a problem at any age, but it's especially   troubling later in life. Unfortunately, 40% of baby boomers are   still in the process of paying off credit card debt, according to   a   new survey    from real estate company Clever. And that could hurt their   retirement in more ways than one.  The problem with pre-retirement debt  Carrying credit card debt in the years leading up to   retirement can make it more difficult to save for that milestone,   thereby compromising your financial security once your career   comes to a close. Imagine you're in your early 60s and are on the   hook for a $400-a-month debt payment. If you're planning to   retire in five years, you might struggle to add to your nest egg   if your income is monopolized by that debt, coupled with other   expenses.   IMAGE SOURCE: GETTY IMAGES.makeArticleAd();  Imagine you   didn't    have that $400-a-month debt payment and could instead put that   money into a   retirement savings plan    like an IRA or 401(k). If you were to invest that money at an   average annual 5% return over five years, you'd boost your nest   egg by $26,500. That's not a small amount of money to give up,   especially if your savings aren't as robust as you'd like them to   be. Another issue with holding debt later in life is that you risk   taking it with you into retirement. And that's problematic   because once you move to a fixed income, you'll need that money   to pay your basic bills, like housing,   healthcare    , transportation, food, and utilities. But if you're forced to   part with a large chunk of your limited income, you may have no   choice but to cut back on those essentials, thereby compromising   your quality of life. A better bet? Aim to knock out your debt well before you're   set to retire. Otherwise, you'll risk stunting your savings'   growth and suffer financially once you   do    leave the workforce.  Getting out of debt  You don't want to wait until you're a few years away from   retirement to start tackling your debt problem. Rather, it's   something you should address earlier on in life. If you have a pile of credit card debt, your first step should   be to assess your various balances, see which come with the   highest interest rates attached to them, and pay your costliest   debts off first. Another option is to   transfer your various balances    onto a single credit card with a lower interest rate overall.   Doing so will make your payments less expensive and easier to   manage. Of course, you'll need money to pay off your debt, and to that   end, you may need to make some lifestyle changes to free up cash.   But if you're willing to cut back on expenses like dining out,   leisure, cable, and other luxuries, you might manage to eke out   enough savings to chip away at your debt so that it's gone well   before your golden years are upon you. It also pays to look into getting a   side job    if you're really loaded up with debt and cutting back on spending   doesn't do enough to eliminate it in a relatively quick fashion.   Since your earnings from that second gig won't be earmarked for   ongoing expenses, you can use all of your extra income to pay   down those credit card balances. Though it's never a good thing to have credit card debt, the   older you are, the more dangerous it becomes. If you're among the   40% of baby boomers with this type of debt, aim to eliminate it   as soon as you can -- before it hurts your ability to pad your   nest egg and eats up an unhealthy portion of your retirement   income.   The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .   The Motley Fool has a     disclosure policy      .  ",
    "Credit card debt is a problem at any age, but it's especially   troubling later in life. Unfortunately, 40% of baby boomers are   still in the process of paying off credit card debt, according to   a   new survey    from real estate company Clever. And that could hurt their   retirement in more ways than one.",
    "Carrying credit card debt in the years leading up to   retirement can make it more difficult to save for that milestone,   thereby compromising your financial security once your career   comes to a close. Imagine you're in your early 60s and are on the   hook for a $400-a-month debt payment. If you're planning to   retire in five years, you might struggle to add to your nest egg   if your income is monopolized by that debt, coupled with other   expenses.",
    "  IMAGE SOURCE: GETTY IMAGES.makeArticleAd(); ",
    "IMAGE SOURCE: GETTY IMAGES.",
    "Imagine you   didn't    have that $400-a-month debt payment and could instead put that   money into a   retirement savings plan    like an IRA or 401(k). If you were to invest that money at an   average annual 5% return over five years, you'd boost your nest   egg by $26,500. That's not a small amount of money to give up,   especially if your savings aren't as robust as you'd like them to   be.",
    "Another issue with holding debt later in life is that you risk   taking it with you into retirement. And that's problematic   because once you move to a fixed income, you'll need that money   to pay your basic bills, like housing,   healthcare    , transportation, food, and utilities. But if you're forced to   part with a large chunk of your limited income, you may have no   choice but to cut back on those essentials, thereby compromising   your quality of life.",
    "A better bet? Aim to knock out your debt well before you're   set to retire. Otherwise, you'll risk stunting your savings'   growth and suffer financially once you   do    leave the workforce.",
    "You don't want to wait until you're a few years away from   retirement to start tackling your debt problem. Rather, it's   something you should address earlier on in life.",
    "If you have a pile of credit card debt, your first step should   be to assess your various balances, see which come with the   highest interest rates attached to them, and pay your costliest   debts off first. Another option is to   transfer your various balances    onto a single credit card with a lower interest rate overall.   Doing so will make your payments less expensive and easier to   manage.",
    "Of course, you'll need money to pay off your debt, and to that   end, you may need to make some lifestyle changes to free up cash.   But if you're willing to cut back on expenses like dining out,   leisure, cable, and other luxuries, you might manage to eke out   enough savings to chip away at your debt so that it's gone well   before your golden years are upon you.",
    "It also pays to look into getting a   side job    if you're really loaded up with debt and cutting back on spending   doesn't do enough to eliminate it in a relatively quick fashion.   Since your earnings from that second gig won't be earmarked for   ongoing expenses, you can use all of your extra income to pay   down those credit card balances.",
    "Though it's never a good thing to have credit card debt, the   older you are, the more dangerous it becomes. If you're among the   40% of baby boomers with this type of debt, aim to eliminate it   as soon as you can -- before it hurts your ability to pad your   nest egg and eats up an unhealthy portion of your retirement   income.",
    "  The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      . ",
    " The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .",
    " The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:18:00"
}