{
  "url": "https://www.nasdaq.com/article/lagarde-clears-key-hurdle-in-becoming-next-ecb-chief-20190904-00876",
  "title": "Lagarde clears key hurdle in becoming next ECB chief - Nasdaq.com",
  "text": [
    "By Balazs Koranyi and Francesco Guarascio",
    "FRANKFURT/BRUSSELS, Sept 4 (Reuters) - Christine Lagarde took a major step towards becoming the European Central Bank's next president on Wednesday, securing the backing of a European Parliament committee after pledging to keep policy loose while undertaking a broader strategy review.",
    "Lagarde, who is due to take over from Mario Draghi on Nov. 1, argued that persistently low inflation requires prolonged stimulus. But she also acknowledged that economies have changed in the last decade, with new challenges including climate change warranting a deep dive into how policy is conducted.",
    "\"2003 was a long time ago and many things have changed as far as the ECB is concerned,\" Lagarde told the European Parliament's committee on economic affairs, referring to the ECB's last broad strategy review.",
    "\"My strong belief is that the cost-benefit analysis (of policy) and possibly a review of the monetary framework that would have to be conducted, not just by the ECB, but also in coordination with other central bank institutions from around the world, is warranted, given the circumstances,\" she said.",
    "With Parliament's backing, Lagarde now awaits final confirmation by euro zone leaders sometime in mid-October, a  formality as the bloc appears united in supporting her nomination.",
    "Acknowledging that the ECB's primary role is to maintain price stability, Lagarde went out of her way to emphasize the institution's role in combating climate change.",
    "\"My personal view is that any institution has to actually have climate change risk and protection of the environment at the core of their understanding of their mission,\" Lagarde said.",
    "\"Primary mandate is price stability, of course. But it has to be embedded that climate change and environmental risk are mission-critical.\"",
    "FRESH STIMULUS",
    "Asked if she was prepared to be as bold as Draghi when he promised in 2012 to \"do whatever it takes\" to save the euro, Lagarde said that having to make such a pledge would mean others, including governments, had failed to prop up growth.",
    "\"I hope I never have to say something like that. I really do. Because if I had that it would mean that the other economic policymakers are not doing what they have to do,\" she said.",
    "Lagarde largely avoided commentary on current policy but argued that a prolonged period of ultra-easy policy is necessary given global challenges, weak growth and uncomfortably low inflation.",
    "But she said the ECB should also be mindful of the negative side-effects of unconventional measures.",
    "Lagarde also appeared to support the ECB's interpretation of its inflation target as symmetrical, which would mean that after a period of undershooting the target, it could accept a period of overshooting.",
    "With growth slowing and inflation falling short of the ECB's target for years, the bank has all but promised fresh stimulus when policymakers meet on Sept. 12, Draghi's penultimate meeting before he steps down on Oct 31.",
    "As part of its package, the ECB is expected to cut rates deeper into negative territory, make a fresh promise to keep rates low for longer and compensate banks for the side-effects of negative rates.",
    "Many analysts are also convinced that the ECB will restart asset purchases, but scepticism or outright opposition from several key euro zone members, including Germany, France and the Netherlands, makes this discussion more complicated."
  ],
  "published_datetime": "2019-09-04 12:22:00"
}