{
  "url": "https://www.nasdaq.com/article/us-stockswall-street-gains-on-apple-boost-trade-optimism-20190911-00646",
  "title": "US STOCKS-Wall Street gains on Apple boost, trade optimism - Nasdaq.com",
  "text": [
    " (For a live blog on the U.S. stock market, click LIVE/ ortype LIVE/ in a news window)",
    "* Apple biggest boost to tech sector",
    "* China exempts 16 types of U.S. goods from tariffs",
    "* Indexes up: Dow 0.39%, S&P 500 0.49%, Nasdaq 0.87%  (Updates to early afternoon)",
    "By Uday Sampath Kumar",
    "Sept 11 (Reuters) - Wall Street rose on Wednesday, boostedby Apple Inc after the launch of its latest iPhones, whileinvestor nerves were also soothed by China's move to ease tradetensions with the United States.",
    "Shares of the Silicon Valley giant AAPL.O rose 2.79%, asit also rolled out a streaming TV service at a price thatundercuts Walt Disney CoDIS.N and Netflix IncNFLX.O . urn:newsml:reuters.com:*:nL2N2610X7",
    "The gains took Apple's market valuation above $1 trillionand lifted the wider technology sector .SPLRCT by 0.78%, thebiggest boost among the 11 major S&P 500 sectors.",
    "Tech stocks bounced from a drop in the previous session,which saw investors moving to more value-oriented stocks fromgrowth shares.",
    "Phil Orlando, chief equity market strategist at FederatedInvestors, said he believed investors will likely continue tomove money into sectors like financials and energy, as well assmall cap stocks, which have all underperformed this year.",
    "Adding to the positive momentum, China's finance ministrymoved to exempt 16 types of U.S. goods, including lubricants andsome animal feed ingredients, from additional retaliatorytariffs, ahead of a planned meeting between trade negotiators. urn:newsml:reuters.com:*:nL3N2621DV",
    "While on the surface, the move is seen as a friendly gestureto thaw relations with the United States, analysts are skepticalabout how much it will move the needle in resolving a protractedtrade war that has hurt the global economy.",
    "The nature of the goods that are being exempted are staplesand indicates that China's decision is likely more to do withsupporting its own economy rather than extending an olive branchto the United States, Ed Egilinsky, head of alternativeinvestments at Direxion said.",
    "\"There's a big difference between today's move and sittingdown at the negotiating table and actually ironing out a deal.\"    ",
    "Comments from a senior White House adviser on Tuesday urginginvestors to be patient about resolving the dispute furtherdownplayed expectations that a trade deal would be agreed thisyear. urn:newsml:reuters.com:*:nL2N2611SF",
    "Investors held out on big bets ahead of stimulus decisionsfrom central banks to stem a global slowdown in economic growth.The U.S. Federal Reserve and the European Central Bank areexpected to cut interest rates at their policy meetings over thenext two weeks.",
    "U.S. President Donald Trump on Wednesday renewed his attackson Fed Chairman Jerome Powell, saying that the central bankshould get interest rates down to \"ZERO, or less\".",
    "While the domestic economy is well insulated fromuncertainties like Brexit that are dragging on European markets,U.S. investors will react negatively on Thursday in the eventthat the ECB puts out a more hawkish policy decision thanexpected, Orlando said. ",
    "At 1:05 p.m. ET, the Dow Jones Industrial Average .DJI wasup 105.55 points, or 0.39%, at 27,014.98, the S&P 500 .SPX wasup 14.57 points, or 0.49%, at 2,993.96 and the Nasdaq Composite .IXIC was up 70.16 points, or 0.87%, at 8,154.31.",
    "Shares of Micron Technology IncMU.O rose 1.8% afterLongbow Research upgraded its stock to \"buy\". urn:newsml:reuters.com:*:nL3N2622HJ",
    "Baker Hughes BHGE.N fell 4.5%, the most among S&P 500companies, after parent General ElectricGE.N looked to sell amajority stake in the oilfield services provider. urn:newsml:reuters.com:*:nL3N2613UN",
    "Advancing issues outnumbered decliners for a 2.11-to-1 ratioon the NYSE and a 2.58-to-1 ratio on the Nasdaq.",
    "The S&P index recorded 22 new 52-week highs and no new low,while the Nasdaq recorded 45 new highs and 11 new lows. (Reporting by Uday Sampath in Bengaluru; Editing by SaumyadebChakrabarty, Arun Koyyur and Shounak Dasgupta) ((UdaySampath.Kumar@thomsonreuters.com; within U.S.+1 646 2238780; Twitter: @sampath_uday; Reuters Messaging:UdaySampath.Kumar.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-11 01:32:00"
}