{
  "url": "https://www.nasdaq.com/article/us-sues-to-stop-novelis-purchase-of-aleris-20190904-00953",
  "title": "U.S. sues to stop Novelis purchase of Aleris - Nasdaq.com",
  "text": [
    "By Diane Bartz",
    "WASHINGTON, Sept 4 (Reuters) - The U.S. Justice Department on Wednesday filed a lawsuit aimed at stopping Novelis Inc's  proposed $2.6 billion purchase of Aleris Corp because of concern over higher prices for aluminum sheet used to make cars.",
    "The department said in a statement that the deal would combine two of the four major North American producers of aluminum to make automobile bodies. The department described Ohio-based Aleris as an \"aggressive competitor\" and said the deal would give Novelis up to 60% of projected domestic capacity.",
    "The company also said the Justice Department failed to understand that the market was bigger than just aluminum and that aluminum competed with steel.",
    "The deal was announced in July 2018. Aleris had previously struck a deal to be purchased by Zhongwang USA, an investment firm backed by a Chinese tycoon, but scrapped it in late 2017 after a national security panel, the U.S. Committee on Foreign Investment in the United States, failed to approve it.",
    "\"We continue to believe that this acquisition will be extremely positive for Aleris customers, employees and shareholders,\" Aleris Chairman and Chief Executive Sean Stack said in a statement.",
    "Unusually, the Justice Department's Antitrust Division agreed with the companies to use binding arbitration to define the product market, which is usually the key battle in any antitrust fight as companies seek to make the relevant market as large so they look like relatively small players.",
    "\"This arbitration would allow the Antitrust Division to resolve the dispositive issue of market definition in this case efficiently and effectively, saving taxpayer resources,\" said Assistant Attorney General Makan Delrahim of the Justice Department's Antitrust Division, in a statement."
  ],
  "published_datetime": "2019-09-04 03:39:00"
}