{
  "url": "https://www.nasdaq.com/article/japans-mufg-looks-online-to-boost-africa-middle-east-networks-20190912-00268",
  "title": "Japan's MUFG looks online to boost Africa, Middle East networks - Nasdaq.com",
  "text": [
    "By Takashi Umekawa and Takaya Yamaguchi",
    "TOKYO, Sept 12 (Reuters) - MUFG Bank Ltd  plans to roll out an online platform to help clients find business partners in countries outside of Asia where it does not have a strong network, an official with Japan's largest lender said.",
    "The MUFG Trade Club, to be introduced this month, will link MUFG clients into a broader network of 13 other banks including Spain's Santander  and South Africa'sStandard Bank , the official said, who declined to be identified, as the information has not been made public yet.",
    "MUFG Bank is the lending arm of Mitsubishi UFJ Financial Group, one of the world's largest banks by assets.",
    "\"There are clients who want to sell their products such as cosmetics, accessories, and Japanese sake, into non-Asian countries,\" the official said.",
    "Japan's big banks have typically followed the lead of their large clients in moving abroad. MUFG has a presence in the United States, the United Kingdom and elsewhere, including a wide network in Asia.",
    "It has stakes in PT Bank Danamon Indonesia Tbk , Thailand'sBank of Ayudhya Pcl , Security Bank Corp  of the Philippines, and Vietnam-based VietinBank. The ties reflect Japan's status as a top exporter to those countries, accounting for $83 billion in exports in 2018, according to IMF trade data.",
    "By contrast, Japanese companies and banks have lagged behind Chinese rivals in other emerging markets, particularly in sub-Saharan Africa. Standard Bank, Africa's largest lender by assets, is 20% owned by Industrial and Commercial Bank of China",
    "While the new service will be provided for free, MUFG is betting it will mean new business if clients need foreign exchange transactions or capital investment.",
    "It aims to have at least 300 clients registered on the platform, the official said."
  ],
  "published_datetime": "2019-09-12 07:00:00"
}