{
  "url": "https://www.nasdaq.com/article/malaysia-cbank-sees-growth-holding-up-keeps-key-rate-unchanged-20190912-00111",
  "title": "Malaysia c.bank sees growth holding up, keeps key rate unchanged - Nasdaq.com",
  "text": [
    "By Joseph Sipalan",
    "KUALA LUMPUR, Sept 12 (Reuters) - Malaysia's central bank, counting on domestic demand to keep supporting growth while global expansion slows, held its key interest rate at 3.00% on Thursday as expected. ",
    "Bank Negara Malaysia (BNM) said its overnight policy rate  remains \"accommodative\".",
    "Nine out of 11 economists in a Reuters poll had forecast no change to BNM'S key rate. The other two predicted a 25 basis point cut. ",
    "\"They've kind of saved their bullets for now,\" said Charu Chanana, analyst of Continuum Economics said of the rate hold.",
    "Malaysia was the only nation in Southeast Asia to report higher growth in the second quarter than the first, but the trade-dependent nation is worried about global growth and the U.S.-China trade war. ",
    "BNM maintained a 2019 growth projection of 4.3-4.8%, but said the range is \"subject to further downside risks from worsening trade tensions, uncertainties in the global and domestic environment, and extended weakness in commodity-related sectors.\"",
    "Maintaining the projection \"provides reassurance as (BNM) expect growths to remain steady going into the second half\", said Julia Goh, economist for UOB Bank.",
    "She predicted the key rate will be held the rest of this year.",
    "Others disagree and expect at least one cut after the Federal Reserve cuts U.S. rates, as is expected at its policy meeting next week.",
    "RATE CUT SOON?",
    "Capital Economics, predicting a Malaysia cut \"soon\", said \"Although growth has held up well recently, we don't think this resilience will last. Consumer spending growth is set to slow following the recent jump in inflation.\"",
    "The annual inflation rate was 1.4% in July, the fastest pace in over a year as the effects of tax policy changes faded. BNM said the inflation will be higher for the rest of 2019 and into next year. ",
    "BNM cut its policy rate in May by 25 basis points, the first trim  since 2016.",
    "The central bank said diversified exports will partly mitigate the impact of softening global demand. ",
    "While exports weakened slightly in the first half, they unexpectedly grew 1.7% in July, on solid demand for manufactured goods and higher shipments to China. ",
    "However, July industrial production grew at its slowest pace in five years at 1.2% annually, on a sharp decline in mining output. ",
    "The ringgit , which did not move after the central bank announcement, has weakened about 0.9% against the dollar this year."
  ],
  "published_datetime": "2019-09-12 04:03:00"
}