{
  "url": "https://www.nasdaq.com/article/the-shocking-interest-rate-chart-you-need-to-see-to-believe-cm1207560",
  "title": "The Shocking Interest Rate Chart You Need To See To Believe... - Nasdaq.com",
  "text": [
    " The Federal Reserve's recent interest rate cut set off another round o f report  s noting that interest rates are at 5,000-year lows. Sound crazy? Well take a look at the chart below, which shows the history of rates... ...since 3000 BC.  This is interesting. It shows the highs and lows of world history. In times of global stress, rates generally rose. For example, governments often needed to pay higher interest rates to borrow during wars. The chart below shows the rate the Bank of England paid in the late 1700s.   ​  Source: Bank of England  Rates rose after 1776, as England needed more funds to finance their role in the American Revolution. Rates came down after the war and rose again to fund the Napoleonic Wars in the early 1800s. This pattern held into the 1900s. Even as the worst conflict in world history raged, interest rates were at historic lows in the 1940s. That's because the central banks like the Fed worked with governments to hold rates down, making it possible to finance World War II. The power of central banks has ebbed and flowed over the centuries. For now, the banks seem to be powerful, but there could be other factors at work that make low rates normal. Maybe the global economy has downshifted to lower levels of growth. In that case, lower interest rates would be expected. That's a question for economists. For investors, the question is who wins - and who loses - with lower rates.  Winners And Losers   One economist noted  that \"low interest rates are good for Millennials and bad for Boomers.\" She pointed out how low rates are helpful for younger generations looking for a mortgage. However, low rates hurt savers and retirees. As investors, we fall into that latter group. That means we need to look beyond the usual suspects when it comes to earning income. Relying on a certificate of deposit at your local bank isn't going to cut it. Neither are treasuries, corporate bonds, or  dividend stocks  -- at least, not by themselves anyway. That's where the strategies like the one we use over at my premium   Income Trader    service come in handy. For those who are unfamiliar, the strategy we use involves put options. But forget what you think you may know about options, because our system involves safely using these to generate upfront income without taking on a lot of risk. For those of you who do know about options, you already know that selling options is an important income strategy. The key to success with this strategy is stock selection. That's why I created tools like the Income Trader Volatility (ITV) indicator to alert us to trading opportunities. And part of the reason why we've made successful trades more than 90% of the time -- year after year -- in any market environment.  It's Time To Try Something Different   Bottom line, because we're in uncharted territory, it's more challenging than ever for investors to earn the income they need. And that's why I think it's time for a lot of investors to start considering strategies that might be a little bit out of their comfort zone. If the idea of selling put options is new to you, that's OK. But a good investor should always be open to expanding their skill set. I wasn't always an options trader... I didn't go to a fancy Ivy League school or work on Wall Street before starting Income Trader  . Instead, I learned about this stuff while I was in the military serving in Iraq. And now, I make more income using my proprietary indicator to make safe, conservative options trades than I ever did in the Army. If you think it's too complicated, then I'm here to tell you it's not. In fact, in just a few minutes, you can be up and running, earning more income than you ever thought possible.  I've prepared a full briefing that will tell you   everything you need to know   .   Related Articles   2 Cancer-Fighting Favorites To Put On Your     Watchlist   This May Be The Simplest Way To Pick Winning     Stocks   The Absolute Best Retirement Strategy We've     Ever Found   ",
    "The Federal Reserve's recent interest rate cut set off another round o f report  s noting that interest rates are at 5,000-year lows.",
    "Sound crazy? Well take a look at the chart below, which shows the history of rates...",
    "...since 3000 BC.",
    "This is interesting. It shows the highs and lows of world history. In times of global stress, rates generally rose. For example, governments often needed to pay higher interest rates to borrow during wars. The chart below shows the rate the Bank of England paid in the late 1700s.",
    "Rates rose after 1776, as England needed more funds to finance their role in the American Revolution. Rates came down after the war and rose again to fund the Napoleonic Wars in the early 1800s.",
    "This pattern held into the 1900s. Even as the worst conflict in world history raged, interest rates were at historic lows in the 1940s. That's because the central banks like the Fed worked with governments to hold rates down, making it possible to finance World War II.",
    "The power of central banks has ebbed and flowed over the centuries. For now, the banks seem to be powerful, but there could be other factors at work that make low rates normal. Maybe the global economy has downshifted to lower levels of growth. In that case, lower interest rates would be expected.",
    "That's a question for economists. For investors, the question is who wins - and who loses - with lower rates.",
    " Winners And Losers   One economist noted  that \"low interest rates are good for Millennials and bad for Boomers.\" She pointed out how low rates are helpful for younger generations looking for a mortgage. However, low rates hurt savers and retirees.",
    "As investors, we fall into that latter group. That means we need to look beyond the usual suspects when it comes to earning income. Relying on a certificate of deposit at your local bank isn't going to cut it. Neither are treasuries, corporate bonds, or  dividend stocks  -- at least, not by themselves anyway.",
    "That's where the strategies like the one we use over at my premium   Income Trader    service come in handy.",
    "For those who are unfamiliar, the strategy we use involves put options. But forget what you think you may know about options, because our system involves safely using these to generate upfront income without taking on a lot of risk.",
    "For those of you who do know about options, you already know that selling options is an important income strategy. The key to success with this strategy is stock selection. That's why I created tools like the Income Trader Volatility (ITV) indicator to alert us to trading opportunities. And part of the reason why we've made successful trades more than 90% of the time -- year after year -- in any market environment.",
    " It's Time To Try Something Different   Bottom line, because we're in uncharted territory, it's more challenging than ever for investors to earn the income they need. And that's why I think it's time for a lot of investors to start considering strategies that might be a little bit out of their comfort zone.",
    "If the idea of selling put options is new to you, that's OK. But a good investor should always be open to expanding their skill set.",
    "I wasn't always an options trader... I didn't go to a fancy Ivy League school or work on Wall Street before starting Income Trader  . Instead, I learned about this stuff while I was in the military serving in Iraq. And now, I make more income using my proprietary indicator to make safe, conservative options trades than I ever did in the Army.",
    "If you think it's too complicated, then I'm here to tell you it's not. In fact, in just a few minutes, you can be up and running, earning more income than you ever thought possible.  I've prepared a full briefing that will tell you   everything you need to know   .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\n© Copyright 2001-2016 StreetAuthority, LLC. All Rights Reserved.\n"
  ],
  "published_datetime": "2019-09-04 03:30:00"
}