{
  "url": "https://www.nasdaq.com/article/brexit-casts-shadow-over-uk-housing-market-outlook--rics-20190911-00881",
  "title": "Brexit casts shadow over UK housing market outlook - RICS - Nasdaq.com",
  "text": [
    "LONDON, Sept 12 (Reuters) - Brexit uncertainty is likely to press down on house prices and the volume of property sales over the next three months, a closely watched industry survey showed on Thursday.",
    "The Royal Institution of Chartered Surveyors said its headline price balance for August rose to -4 from -9 in July, bucking economists' average expectation in a Reuters poll for a further decline to -11.",
    "But RICS members' outlook for the next three months - during which period Britain is scheduled to leave the European Union - grew darker.",
    "\"It is hard to get away from the shadow being cast over the housing market by the seemingly never-ending Brexit saga. Indeed uncertainty is a theme that respondents continue to highlight as a negative influence on sentiment in survey after survey,\" RICS chief economist Simon Rubinsohn said.",
    "Although Prime Minister Boris Johnson has vowed to take Britain out of the EU by Oct. 31 - without a transition deal if needed - parliament has ordered him to ask the EU for a delay if he fails to negotiate a new agreement with the bloc.",
    "Britain's housing market has slowed since June 2016's referendum decision to leave the EU, though outright price falls have been concentrated in London and nearby areas - a pattern that persisted in August's RICS data.",
    "Higher purchase taxes on housing costing more than 1 million pounds ($1.23 million), as well as concern about the effect of Brexit on London's financial services industry, have weighed on prices in the British capital.",
    "RICS also noted continued strong demand from tenants at the national level, combined with fewer landlords listing property to rent.",
    "\"The pressure is for rents to continue moving higher and indeed outstripping any price gains both in the near and medium term,\" Rubinsohn said.",
    "($1 = 0.8110 pounds)"
  ],
  "published_datetime": "2019-09-11 07:01:00"
}