{
  "url": "https://www.nasdaq.com/article/navistar-international-corp-nav-q3-2019-earnings-call-transcript-cm1207572",
  "title": "Navistar International Corp (NAV) Q3 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   Navistar International Corp    (NYSE: NAV)        Q3 2019 Earnings Call       Sep 4, 2019 ,   9:00 a.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Good day, ladies and gentlemen, and welcome to the Navistar   Third Quarter 2019 Earnings Results Conference Call. [Operator   Instructions] I would now like to introduce your host for today's   conference, Mr. Marty Ketelaar, Vice President of Investor   Relations. Sir, you may begin.  Martin Ketelaar    --   Vice President of Investor Relations  Thank you, Daniel. Good morning, everyone, and thanks for   joining us for Navistar's Third Quarter 2019 Conference Call.   Today, we will discuss the financial performance of Navistar   International Corporation for the fiscal period ended July 31,   2019. With me today are Troy Clarke, our Chairman, President and   Chief Executive Officer; Walter Borst, our Executive Vice   President and Chief Financial Officer; and Persio Lisboa,   Executive Vice President and Chief Operating Officer. After   concluding our prepared remarks, we'll take questions from   participants. Before we begin, I'd like to cover a few items. A copy of this   morning's press release and the presentation slides has been   posted to the Investor Relations page of our website for   reference. The non-GAAP financial measures discussed in this call   are reconciled to the U.S. GAAP equivalent and can be found in   the press release that we issued this morning as well as the   appendix of the presentation slide deck. Today's earnings press release, investor presentation and our   prepared remarks may include forward-looking statements about our   expectations for future industry and financial performance, and   the company expressly disclaims any obligation to update these   statements. Actual results could differ materially from those   suggested by our comments made here. For additional information   concerning factors that could cause actual results to differ   materially from those included in today's presentation, please   refer to our most recent SEC filings. We would also refer you to   our safe harbor statement and other cautionary notes disclaimer   presented in today's material for more information on the   subject. With that, I'll turn the call over to Troy Clarke for opening   comments. Troy?  Troy Clarke    --   President, Chief Executive Officer and Chairman  Okay. Hi, thanks, Marty, and good morning, and welcome to   Navistar's third quarter       earnings call    . All over with few high level thoughts on the quarter and the   industry and Walter will walk you through more details on the   company's financial performance and outlook for the rest of the   year. We delivered another strong quarter, total revenues grew   17% to over $3 billion, adjusted EBITDA grew 22% and adjusted net   income increased 55%. The growth came from the truck segment,   where volumes rose 45% year-over-year. Retail market share   continues to grow year-over-year as well. In the third quarter   Class 8 share grew 1.6 points to 13.9% and medium Class 6/7 share   rose 4.9 points to 26.8%. From an industry perspective, the U.S. economy is moderating,   a number of key economic indicators remain above their long run   averages, but they are trending lower. U.S. GDP is softening and   is expected to be around 2% for the balance of the year. The 2%   threshold is important to us as the industry tends to add   capacity when GDP increases more than 2% annually. The ISM Manufacturing Index, something we also follow, also   continues to trend lower and it's hovering around 50, indicating   to us that manufacturing growth is shifting to neutral. Yet   consumer confidence and -- spending remain positive, but new   housing permits are still running lower than expected. Lots of   mixed signals indicate an economy that is in transition. The   truck market is decelerating, truck orders tend to be a leading   indicator of economic activity as carriers forecast their need   for trucks. As freight tonnage and rates decline industry orders   for Class 8 trucks in particular have also declined about 75% in   the quarter. The used truck market is also slowing, pressuring   prices is inventories of less than five year old sleepers are   rising as trade receipts have increased in conjunction with new   truck deliveries. Build rates of new trucks have exceeded orders, causing   industry class 8 backlogs to decline 44% since peaking last   October. Navistar's backlogs are declining as well, and as you've   seen, we're actively managing this by adjusting assembly line   rates to create a balance between customer demand, inventory   levels and a healthy backlog. For example, in November of last   year we added a second shift to meet class 8 demand while   increasing line rates at all our truck plants. In addition, we   added overtime and weekend shifts as needed. Today, weaker U.S. orders as well as lower Mexico and Latin   America orders has resulted in the need to reduce assembly line   rates in both of our truck plants. We make these type of   decisions every day, actively managing our business appropriately   with the goal of being efficient order to delivery process. As a   result, total company and dealer inventories remain at the low   end of the normal range at 85 days. Over the balance of 2019,   order activity should pick up from the levels of the last couple   of months due to the traditional fleet ordering season as   carriers continue to replace aging trucks. This fall ordering   season will provide further insight into 2020, currently we are   expecting 2020 core industry volumes to be down about 20%,   reflecting a 25% reduction in Class 8 trucks and a 10% reduction   in Class 6/7 and bus units. Tentatively, we are planning for 2020 Class 6-8 trucks and   buses in our core markets to range between 335,000 and 365,000   units. Given Navistar's strong Class 6/7 and bus franchises, we   do not expect to be down as much as the industry. We'll continue   to refine our view and share more details with you in the near   future. Shifting gears, you know, over the past several years, we   made a number of investments to improve our business. We met a   lot of times customers listen to their feedback, ideas, their   suggestions. Next, with this understanding, we invested in our   products. We developed and delivered a full line of new products   which have been very well received as demonstrated by our growing   retail market share, improve sales, selected volume and share,   earnings and improved cash flow. Now it's time to make investments in the next phase of our   future. Earlier this quarter, we announced we were investing $125   million in our engine plant in Huntsville, Alabama, over the next   three years. This investment is being made in preparation or   producing our next generation big-bore diesel powertrain being   developed with our alliance partner trade time. The production of   these new proprietary powertrains will add to the existing   facility where we currently build our international A26 engine.   We also [Indecipherable] invested in our uptime commitment. A new   parts distribution center in Memphis is now open, offering   industry leading cut off times for next day delivery of parts.   Our service partnership with Loves is now operational adding more   than 320 Love's and Speedco locations and more than a 1,000   technicians to our service network. In an updated version of our   dealer parts inventory management system has significantly   reduced emergency orders and works to position parts where they   are needed. You know, our third quarter was another great quarter for   Navistar. Our operational and financial progress demonstrates   that our investments are paying on. Market share is increasing,   revenue and earnings are growing and now we're accelerating   investments to improve our operations and deliver on our promise   of Uptime. I look forward to talking to you again at our Investor   Day later this month, where we'll discuss our plans to further   grow the earnings power of Navistar. And so with that, let me turn it over to Walter.  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  Thanks, Troy. Good morning, everyone. Navistar has continued   its cadence of delivering excellent results in the third quarter.   Revenues, adjusted EBITDA, adjusted net income and free cash flow   were all up year-over-year. Let's dive into the results. As Troy   mentioned, revenues grew 17% in the quarter to $3 billion. The   improvement was driven by a 28% increase in core Truck volumes.   Core market share grew 2.6 points to 18.2%, reflecting higher   share in all vehicle segments year-over-year. Q3 gross margin was   17.8%, up a point from last quarter, segment mix continue to   impact consolidated gross margins as truck revenues including the   new Class 4/5 products grew substantially year-over-year. As   we've discussed previously, parts margins are higher than truck   margins and in the long run, selling more trucks today will   benefit part sales in the future. Turning to structural costs, year-over-year SG&A expenses   declined 25% to $167 million, largely from the release of a $32   million accrual related to certain legacy engine litigation.   Engineering costs increased $9 million, largely from the   development of next generation powertrains with our alliance   partner TRATON. Even if one adjusts for the legal accrual,   structural costs including SG&A and engineering expenses fell   as a percentage of revenue to 9.2% from 11.3% in the prior year.   Net income in the quarter was $156 million, or $1.56 per diluted   share. Prior year income of $170 million, or $1.71 per diluted share   included a $71 million settlement gain related to a business   economic loss claims excluding one time items in both periods on   an after tax basis, adjusted net income in the quarter grew 55%   to $147 million versus $95 million last year. Adjusted EBITDA   rose 22% to $266 million in the third quarter versus $218 million   year ago after excluding one time items on a pre-tax basis. Moving to the segment results. Our truck segment sales in the   quarter grew 25% to $2.4 billion. The sales growth was driven by   an increase in all core product segments plus the production   ramp-up of the new Class 4/5 trucks. Total core volumes grew 28%   to 24,400 vehicles. Truck segment profit grew and excluding the   two one-time line items, I mentioned earlier, the segment was up   44% year-over-year. The increase was largely driven by higher   volumes and improved pricing, partially offset by the impact of   the sale of a majority interest in Navistar Defense. Our Parts business delivered another solid quarter. The Parts   segment revenue results were impacted by the new revenue   recognition standard, which Navistar adopted at the beginning of   this year. The implementation of this standard reduced third   quarter revenue by $31 million. On a comparable basis, revenues   were largely flat from Q3, 2018. Profit was up 3% to $149   million, due to improved U.S. operating results, reflecting our   growing private label business partially offset by lower Blue   Diamond Parts volumes. Parts segment profit margin grew over two points   year-over-year to 26%. The global operations segment continues to   be impacted by a weaker than expected economy in Brazil. Revenues   were flat year-over-year and the operations remain profitable.   Our financial services segment is benefiting from larger average   portfolio balances. As a result, revenues increased 14% to $74   million. Segment profitability rose 30%, $30 million, largely   from higher interest margin and income from an intercompany loan,   partially offset by the write-off of debt issuance costs. During the third quarter, NFC closed a new five year, nearly   $750 million revolving credit facility and repaid its $400   million Term Loan B issued in 2018. The new facility provides for   additional liquidity with increased flexibility at a lower   borrowing cost. During the quarter, the company generated $250   million of manufacturing free cash flow, largely from strong   adjusted EBITDA and net working capital performance. The company   ended the period with the manufacturing cash balance of $1.1   billion. Next, let me take a moment to update our guidance for 2019.   For the Class 8 industry, we expect volumes to come in toward the   upper end of our prior range. Also, we're seeing higher Class 6/7   volumes, including greater gasoline units where Navistar does not   participate. We now believe 2019 industry volumes will range   between 435,000 and 455,000 units, a 10,000 unit increase from   our prior guidance. Today, retail market share is 18%. During the   fourth quarter, we expect share to continue to grow largely from   the seasonal increase in school bus registrations. As a result,   we believe fiscal year retail market share will range between   18.5% and 19%. 1 to 1.5 points higher than 2018 market share. As Troy mentioned, the decline is domestic and export orders   and backlogs led to the decision to lower assembly line rates in   both of our Truck plants. Due to lower production volumes in the   fourth quarter, we expect revenues to be toward the lower half of   our guidance range of $11.25 billion to $11.75 billion for the   year. To-date, consolidated gross margin is 17.7%. We are   expecting margin growth in the fourth quarter from the seasonal   benefit of higher parts revenues a larger mix of severe service   truck sales. We now believe gross margins will end up between   17.75% and 18% for the year. Lower aggregate gross margin from lower production volumes and   revised margin percentage expectations is being offset by lower   SG&A expenses. Consequently, we are holding our 2019 adjusted   EBITDA guidance at the midpoint of $900 million for the year.   Finally, capital expenditures are trending lower and are now   expected to be $115 million versus our prior guidance of $150   million. In summary, the third quarter results show the effectiveness   of executing our strategy as we are recapturing market share and   growing revenue, EBITDA and cash flow. I look forward to talking   to you again at our Investor Day on September 19th, where we'll   provide insights on our strategy, improvements we've made to the   business and our road map to becoming a market leader. If you   haven't registered for the event, please reach out to the IR team   for details. We look forward to your attendance. Also, we invite   you -- we invite you to see our latest product offerings and   technology developments at this year's North America Commercial   Vehicle Show in Atlanta from October 28 through the 31st. With that, I'll turn it back to the operator to begin the   Q&A. Questions and Answers:  Operator  Thank you. [Operator Instructions] Our first question comes   from Stephen Volkmann with Jefferies. Your line is now open.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Steve, are you there?  Stephen Volkmann    --   Jefferies -- Analyst  Yes, I am sorry about that. Good morning.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Good morning.  Stephen Volkmann    --   Jefferies -- Analyst  So maybe let's just start off, since you've provided this kind   of preliminary look into 2020 industry volumes, I guess we have   yet to really have a clear idea from you guys about how you think   you'll perform in a down market and I guess specifically I'm   thinking about decremental margins. I know you've lowered your   break even, significantly, but any help you could give us just on   how you kind of modeled the business in a declining top-line   environment would be great.  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  Yes, Steve, it's Walter. you know we'll provide some   additional insights on that on our Investor Day, but, you did   allude to the fact that we've continued to work to lower our   break even point, that's continued, we've also been growing our   shares, so, the decline that we could see in industry volumes   before we would drop to break even results in our truck segments,   give us even that much room that versus where we were a couple of   years ago? As we entered 2020, we do continue to see   opportunities to grow our market share, given the strong product   offering that we have and with the industry environment changing,   we would expect to be able to continue to improve our cost   structure as well as we wouldn't have the same kind of headwinds   that we had this year in the strong industry with supplier costs   and the like, so, we think that our position for next year will   continue to improve even as the industry volumes decline, from a   profitability per unit perspective.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Yes. Hi, Steve. This is Troy, but obviously, this is a   cyclical industry, we've talked openly about that, I think on   this call and other occasions in the past. We've been preparing   for this. So we have modeled out the scenarios of what we think   2020 looks like kind of to the good and to the bad levels and we   think 2020 will be a good year for Navistar with gains and things   like market share and continued progress on costs, as Walter has   indicated.  Stephen Volkmann    --   Jefferies -- Analyst  Okay. And just so I make sure I understand what you said,   Walter, it sounded like you're kind of saying that you think you   can grow EPS in a down market, basically around what you've   forecasted next year? Or am I reading that wrong?  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  No, I don't think you're reading that right. I think what I   tried to say, at least was that, on a per unit basis, we would   continue to look to improve our profitability, if units are down   and the overall earnings would probably down as well, but we've   got a lot more room vis-a-vis our break evens that we had a   couple of years back.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Right.  Stephen Volkmann    --   Jefferies -- Analyst  Okay. Great. All right. I'll pass it on. Thanks.  Operator  Thank you. And our next question comes from Andy Casey with   Wells Fargo. Your line is now open.  Andy Casey    --   Wells Fargo -- Analyst  Thanks a lot. Good morning.  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  Good morning.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Good morning.  Andy Casey    --   Wells Fargo -- Analyst  Within -- back to the 2020 sales view, I appreciate you expect   to be down less than the industry, but can you give us a little   bit of color around the commentary you made, specifically the   Class 8 assembly line reduction so far. And I'm just wondering   how to frame up 2020 as -- are you expecting that to be down 25%   on a retail basis off the bad or for production to kind of scale   down during the year if orders do not improve?  Troy Clarke    --   President, Chief Executive Officer and Chairman  Yes, I think it's more the latter, you know, look, we've made   these -- this is a company that ran for a number of years with no   or a very skinny backlog and we've taken advantage, I think if   these last couple of years to restore backlog to a far more   normal range, our current backlog is in kind of at the industry   average over 150 days, closer to 165 days. We adjust our   production rates to maintain some manner of backlog because this   order to delivery system runs more effectively, more efficient   balancing between customer needs, the needs to manage the   inventory, that's in the pipeline as well as the inventory that's   basically on the ground. With these adjustments, we believe we see a stable environment   through Q1. And then, we'll have to see how the seasonality of   additional orders that are coming in from larger players, from   larger customers plays out through the year. Now, very recently,   we won't make any announcements you know several large players,   our share of their buy year-over-year is going up and it's very   encouraging, so it supports the thought that with the adjustments   we've made, we should be stable through Q1, and then we'll have   to see what happens if the economy and the industry as we go past   that. But certainly it will be a topic we'll update at our nex   t earnings    call as well as we'll just have more insight at that particular   point in time.  Andy Casey    --   Wells Fargo -- Analyst  Okay. Thanks, Troy. I'll leave it at that. Thank you.  Troy Clarke    --   President, Chief Executive Officer and Chairman  You're welcome, Andy.  Operator  Thank you. And our next question comes from Neil Frohnapple   with Buckingham Research. Your line is now open.  Neil Frohnapple    --   Buckingham Research -- Analyst  Hi, guys. Thanks and congrats on a good quarter. Walter, can   you remind us from a high level, what the adjusted EBITDA number   is you need to generate in order to be free cash flow breakeven?   Is it still in that $650 million to $700 million range? Just   trying to get a sense of whether you guys will generate free cash   flow in FY '20 even if the market cycle is down?  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  Yes. Hope to see at the Investor Day.  Neil Frohnapple    --   Buckingham Research -- Analyst  All right. And then just could you -- could you, Walter   discussed a slight reduction in the gross margin outlook versus   your prior guidance. Any more granularity on the puts and takes,   whether the embedded price cost outlook is less favorable? Are   you seeing more new -- more aggressive new truck pricing, whether   it's just mix? Just any help that would be great.  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  Yes, probably three or four items I'd point too. Pricing is   actually been good, as we indicated in our remarks, pricing is up   year-over-year, so that's kind of come in as we expected, well,   we've continue to see as the segment mix, which I commented in my   remarks, so truck versus parts as the truck volumes have been   stronger, that impacts our overall gross margins because our   parts had some impact on our margins. Thirdly, we've seen, in the strong environment, we could see   higher commodity prices, which we've indicated at the beginning   of the year would be a headwind and we've seen additional freight   costs as well with the tighter supplies, so that has impacted our   material costs. And then lastly, as Troy mentioned in his   remarks, we've seen some weakness in used trucks, in particular   the sleeper market and so we've made some small adjustments there   too, are the prices of the units in our used truck portfolio.  Neil Frohnapple    --   Buckingham Research -- Analyst  Okay. Thanks. I'll pass it on.  Operator  Thank you. And our next question comes from Ann Duignan with   JP Morgan. Your line is now open.  Ann Duignan    --   JP Morgan -- Analyst  Yes. Thank you. Good morning. I wonder if you could give us a   bit more color on the lower production levels at both facilities,   I mean, how much lower is production going to be in fiscal Q4, is   it going to at whatever fiscal Q4 run rate is at the end into Q1   of next year, just from the modeling perspective, if you could   give us a bit more specifics on those?  Persio V. Lisboa    --   Executive Vice President and Chief Operating Officer  Hi, Ann. This is Persio Lisboa. Well, I think for Q4, the exit   rate, we are probably going to be calibrating the -- as Troy   mentioned, we are rebalancing our lines. So overall throughout   our plants will be down close to 15% versus the Q3, which is and   that's the level that we are going to enter Q1, but you have also   to consider that, that's the nominal rate, we used a lot of   overtime days in the last few quarters and we are removing some   of them. So but overall, nominal rates will go down 15% and   that's what we intend to keep for the first quarter as well.  Troy Clarke    --   President, Chief Executive Officer and Chairman  And Ann, I just might indicate that by taking those -- down   those rates, that's after we increased the rates earlier this   year, so that brings the overall daily rates back to about where   we were in November and December of 2018, so, on earlier calls   we've reported about production line rate increases, we're now   effectively reversing that with this 15% reduction that Persio   mentioned.  Ann Duignan    --   JP Morgan -- Analyst  Okay. That's very helpful, especially on a year-over-year to   keep that -- bear that in mind that we didn't take up production   and then back. And then just a quick follow up, last quarter you   guys had noted that at the summer months, we're going to be very   important for fleet orders, I think all the OEM 2020 order books   are now open, now we're kind of pushing them back, saying fall   months are going to be very important or what are the large fleet   saying and doing, I know you said you're gaining more share of   pocket with them, but in general what is the commentary that   you're hearing from the large fleets, they obviously are not   placing orders yet.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Yes. What do we you talked about previously Ann was, in some   years where everybody anticipates that the following year or the   coming year, like in 2020 would be strong, people would open up   their order books in the July timeframe, but the more traditional   timeframe is September and in fact, that's what we're seeing, so   this really supports what we think to be a fairly normal, I think   timing for an ordering cycle. So we are engaged with large   customers, and quite frankly, Ann, just put your plug-in for the   products, our products are performing well in your fleets and,   this is what we're hearing from them and what we're seeing from   them, the deals that we're working on with them is we're   continuing to improve our share of their buy on large fleets and   that's our expectation. So we would expect certainly in the Class   8 space, that will continue to grow with these large customers.   The second thing is, as we have a lot of trucks, we have some   real momentum building on the vocational side of the business.   Obviously, lower volume and share impact, but you know pretty   good business for us and quite profitable, and a lot of those   units are still working their way through the TEMs and so, we   anticipate that this momentum on the vocational side of the house   will continue well into 2020. And then last, but not least, as you indicated, as you heard   in my comments, we've picked up nearly five points of market   share in a piece of the business where we're traditionally very   strong in the medium duty -- in the medium duty segment. And the   discussions that we're currently having with customers who buy   those trucks without giving too much more way, our portion of   that buy continues to be strong as we look into 2020. So we're   not planning on seeding certainly any share in a segment that we   believe we have advantages over our competitors. So as far as   some color and insight goes, yes, 2020 is going be down, but if   you take a look at the -- we have a concept we call kind of share   of wallet or a share of a target customers buy, those numbers   look that they will continue to improve and that's how the orders   are lining up for us as we see. We'll give little more color in   our Investor Day. But again, contributes whole thought process   that we'll roll into Q1, a lot like we look today.  Ann Duignan    --   JP Morgan -- Analyst  Okay. I appreciate the color and look forward to hear more. So   I'll leave it there. Thanks.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Thanks, Ann.  Operator  Thank you. (Operator Instructions) Our next question comes   from Adam Uhlman with Cleveland Research. Your line is now   open.  Adam Uhlman    --   Cleveland Research -- Analyst  Hi, guys. Good morning.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Hi, Adam, good morning.  Adam Uhlman    --   Cleveland Research -- Analyst  Congrats on all the progress. I guess, I wanted to start with   the clarification. Walter, you mentioned several headwinds that   we faced this year with supplier cost, material cost. I believe   you gave us a figure at the beginning of the year. I was   wondering if you could update us with that, we can put that into   context when we think about the 2020 profit headwinds that   shouldn't exist.  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  Yes, we began the year, I think we've said that overall, we   would expect performance in pricing less the headwinds that we   saw material cost still to be positive to the bottom line, that's   still the case as we sit here today, but it's less so than what   we had seen, given the factors that I mentioned impacting our   product costs on the procurement and logistics side of the   business, but net-net, it's still a positive for the year, as we   had expected coming in and that's in large part is due to   continued efforts, including from the procurement joint venture   that we have with TRATON to continue to work our product costs   lower.  Adam Uhlman    --   Cleveland Research -- Analyst  Okay. And the fright headwinds and supplier disruptions, is   that still, a meaningful headwind outside of price cost?  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  We see that as an opportunity to be less of a negative impact   going forward. It's -- I made the comments, I did to Steve   earlier in the call about. As we look into 2020, as those   headwinds abate that should help our profitability for years.  Persio V. Lisboa    --   Executive Vice President and Chief Operating Officer  And this is Persio. We are also seeing on a supply base much   fewer disruptions than we've ever saw before, so I think at the   levels of productions that we are today, we are pretty safe on   the supply side and freight rates start coming down. So you could   imagine that as we are running overtime days and extra weekends,   we were basically driving more volume and capacity in the supply   base and generating some level of expedite. That's all gone.  Adam Uhlman    --   Cleveland Research -- Analyst  Okay. Got it. And then on the capital spending plan for this   year going forward, the CapEx came down, but there are several   big projects, it sounds like under way, should we be expecting a   material pickup next year or maybe back to what the prior plan   was and then just along with that, if you could just expand it on   the Huntsville plan through 2021, what steps should we be   thinking about or listening for? Thanks.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Yes. Let me break it into a couple of pieces and my colleagues   will probably join in as well. So cap spending, we indicated, is   going to be lower this year than what we had said previously. In   part, that's due to the stronger industry that we've seen, so   we've pushed out some projects, some of the maintenance and so on   that we do in our facilities as we wanted to keep those running,   so we'll be able to do some of that work as the industry slows a   little bit in 2020 back more to kind of replacement volumes. We do see CapEx will be increasing, we'll provide some more   insights at Investor Day around that as well as we do have some   of these investments like the Huntsville investment coming, that   will come in over the next few years in Huntsville and is related   to the alliance activities around the Localization of some   big-bore diesel engine or diesel powertrain investments that   we've mentioned previously. So CapEx will be up versus this   year's levels, but obviously CapEx has been favorable to our cash   flow for this year versus what we'd originally suggested.  Adam Uhlman    --   Cleveland Research -- Analyst  Okay. Thanks.  Operator  Thank you. And our next question comes from David Leiker with   Baird. Your line is now open.  David Leiker    --   Baird -- Analyst  Good morning, everyone.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Good morning.  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  Good morning.  David Leiker    --   Baird -- Analyst  Walter, I want to go back in reverse, I know you talk through   this and I want to just try and find some of the puts and takes   on the truck pretty significant revenue increase to flat profits   and I know there's some moving pieces underneath the surface. But   can you just help reconcile that a bit for us to just kind of get   to what the real contribution margin was here in the quarter?  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  Well, I guess, I didn't do a good job on the first time.  David Leiker    --   Baird -- Analyst  Walt, I might have missed that too.  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  Yes. So what -- if you're just looking within the Truck   segment, then a couple of comments there, I did mention earlier   on the call that we do have the segment mix between truck and   parts, which we've think [Indecipherable] long as the Truck   volumes have been strong. Within the truck segment, we've   mentioned couple of times this thing on the call, we did grow our   medium share some of that was with rental and leasing customers,   those margins are lower than with some of our other customers,   we've also been ramping up the Class 4/5 vehicles and so those   have a lower profit margin than our average portfolio as well. We   produced those units largely for General Motors on a cost-plus   type basis, which helps them to fixed in our plants. But those   margins aren't as high and we do run that through the revenue as   well as the profitability side of our income statement. So that   year-on-year is a lower average profit margin. We also don't have   the defense business this year, which was a big contributor to   profitability in the third and fourth quarter of last year. So   those would be a couple of puts and takes.  David Leiker    --   Baird -- Analyst  Okay. Great. Thanks. And then, Troy, as we look at during the   year end and then calendar 2020. Can you talk at all about what   you think the makeup on the backlog looks like, our people   cleaned out that backlog, how real that is and then just kind of   your thoughts of cancellations as we go into 2020?  Troy Clarke    --   President, Chief Executive Officer and Chairman  Yes. Look, we -- I'll make a couple of comments here then I'll   ask Persio to jump in as well, because, I mean, I think certainly   the second half of this year, this -- these are numbers that   we've looked at quite a lot just to make sure that we're making   the right decisions and have the right interpretations. I have to   say, I think, let me just say overall, I think the quality of our   backlog is very high, when I say that we have a very normal   backlog in 165 day range, which I think is comparable to where   other competitors are, there's not a lot of orders in there which   have the potential for cancellation, there are orders that have   the potential for retiming because as we are attempting to   deliver units, some of our customers have to -- they have to   figure how to dispose of their used truck right now. And now   we're slipping into that, thing we've been in the past where they   go to the market with a truck that has a book value and if the   market's value below then they have to work that equation a   little bit more so that they don't take a loss and that sometimes   gets in the way of our delivery. And that happens with very large customers, and it happens   with very small customers. We have the ability to help somewhat   in used trucks, OK, but, we've been in difficulties in used   trucks in the past. And so we're working to manage that very,   very seriously as well, OK? So that's kind of the phenomenon, but   I would say that the backlog itself, we believe it's fairly high   quality. Let me pass to Persio, who really keeps tracking our --   I know he watches these numbers on cancellations more than I say.   Well, we all -- we all look at it, but he's the guy who kind of   keeps his eye on that to make sure that the quality of this   backlog is high.  Persio V. Lisboa    --   Executive Vice President and Chief Operating Officer  Okay. Thank you, Troy. What we are seeing today in the backlog   is as Troy referred to some of the -- we have two types of orders   that get into the system, some of those that are -- that come   from the very large customers that have a very constant buy   throughout the year and those have been timed, as Troy referred   too. I think that's where we see the most of that, because some   of those customers are working through the used truck kind of   phenomena that Troy described. On the dealer side, I think we have also the activity on the   retail, that's the one that's now is more impacted in the short   term and we monitor that very closely with our dealers. Having   said that, our dealers today have 85 days off dealer sales in   their inventory, which is within the normal range that we   operate, so we feel that no time will tell a little bit more as   we get into Q4 and Q1, but we haven't seen any abnormal signs off   cancellations compared to what we are seeing in the industry from   a backlog standpoint. I think we've averaged in the last quarter   3% to 4% of the backlog cancellation, which is now pretty well   insight of the industry is being presenting to us as data.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Yes. So David, let me just, if I could just summarize this,   because I think this is kind of a point that I'd like to make.   Look, our guidance for the fourth quarter provides, provides for   potential further softening in Mexico and Latin America, where we   really don't put those orders in until we know they've got to   home. The potential for customers to push out deliveries a little   bit, it's the kind of thing that might happen, sometimes those   gives backfield, sometimes they just get out and with the line   rate adjustments we've done -- we haven't given up the ability to   produce and deliver units to the previous levels that we've   highlighted of our guidance, which in fact then allows us to   protect the upside. And we've done all this with the ability to roll into Q1 with   a healthy backlog that allows our order to delivery systems to   run efficiently without a lot of stranded inventory, a lot of   premium freights and other type costs that we might -- that we   might run into. I mean, it's hard for us to describe because the   company hasn't been in that position for a while, but we believe   -- we've got this thing boxed in very nicely and all the numbers   kind of interlock and we have a lot of confidence in our forecast   and the ability to protect the upside.  David Leiker    --   Baird -- Analyst  Yes. Great. Thanks. Any thoughts on how the industry sets? I   know it's hard for you to do.  Troy Clarke    --   President, Chief Executive Officer and Chairman  I think, you know, we look at their numbers and they kind of   look a lot like our numbers. So, I mean, I don't know [Speech   Overlap].  Persio V. Lisboa    --   Executive Vice President and Chief Operating Officer  Well, I think from what we're experiencing with our customers,   I think we're all in the same position at this point in time. And   honestly, I think as we've been gaining share, we want to   continue the -- kind of the performance that we've delivered to   customers are not only on the product side, but on the service   side and customers are valuing us more because of, I think, what   we've done in the last few months in 2019. So -- but I don't see   anything different happening in the industry overall, I think all   the customers are the same. We're all knocking on the same   doors.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Yes. And I think they're doing the same thing, they're looking   at what the orders are coming in, what the customers are telling   them. There is just one small difference, our quarter ends at the   end of October, right our fiscal year does their fiscal years   tend to end at the end of the calendar year. So the kind of the   last minute push to kind of meet the target on the scorecards   looks a little different between us and them. So I certainly   anticipate that they'll be pushing for deliveries between now and   the end of the calendar year. And our market share forecast, by   the way provides for that kind of push, because this is something   that we have we see every year.  David Leiker    --   Baird -- Analyst  Yes. Great. Thank you very much.  Operator  Thank you. And our next question comes from Seth Weber with   RBC Capital Markets. Your line is now open.  Brendan    --   RBC Capital Markets -- Analyst  Good morning. This is Brendan on for Seth. Thanks for taking   my question. You had a healthy market share gains this quarter   again, I appreciate the comments that you anticipate growing   market share again 2020. I was just wondering any extra color you   can give on, I guess, what you're seeing that drove your decision   to decrease the 19% share gain to the 18.5% to 19% from over 19%   indicated last quarter.  Troy Clarke    --   President, Chief Executive Officer and Chairman  I think, I can comment to that. What we're -- no, we --   typically what we do, we have a forecast for the industry and we   have a forecast for our no deliveries. The deliveries are pretty   locked at this point in time, we know what they are going to be,   what we don't know 100% control is the forecasts on the top line   of the industry and as we mentioned before, there is now an   effort that I think there is we are seeing more of an effort on   in retail to retail, more units from all distributors. And so the industry forecast being a slightly higher, now   force us to basically consider that now our share may not be as   aggressive as we thought it would, all though year-to-date, we   have been performing above, I think now where we were last year,   as we alluded in prepared comments. So it is more of an   adjustment on a forecasting of the industry than anything else,   we don't see a deterioration in our forecasted deliveries and   DTUs we called it, the units that get charged out and retailed in   the market, so it is more of an adjustment on overall forecasts   and making sure as we got closer to the end of the year, it's   easier for us to put a tighter range.  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  Yes. So as we look at the inventories of our competitors and   their dealers, especially going into a softer year 2020. We have   every reason to believe that they'll be pushing those units off   the lots and through the pipeline, just like we will be doing   that. It's one of the reasons why Walter increased in his   comments the industry by 10,000 units. And so it's really the   effect of the increase in the industry as Persio said, it's a   math phenomenon as opposed to we think we'll be selling fewer   units in the quarter than we had planned.  Brendan    --   RBC Capital Markets -- Analyst  Okay. Great. Thank you.  Operator  Thank you. And our next question comes from Jerry Revich with   Goldman Sachs. Your line is now.  Ben Burud    --   Goldman Sachs -- Analyst  Hi. Good morning, everyone. This has Ben Burud on for Jerry.   So you all are currently guiding to about $900 million of EBITDA   this year at the peak of the cycle. And if we think about   layering on the tree tiling cost savings that number will move to   more around $1.1 billion to $1.2 billion. Is that how we should   think about what the next peak looks like in your business? Or   you achieving more of the trade time sourcing cost savings   already at this point?  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  Hopefully, Jerry will let you come to Investor Day.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Yes, you need to come to Investor Day, Ben. Ben, I know Jerry   is out of the line [Indecipherable] you need to come or Jerry   needs to Investor Day because it's -- there's no 30 second answer   to that particular question. Okay. Look, we're going to grow and   we're going to continue to improve the returns that this business   provide shareholders and to say that the TRATON savings that   we've talked about, and we're on track for is all we're going to   be able to do, that is not the case. Okay. But to explain what is   the case, we're going to be a little bit more time, but you   should have confidence that and I'll state it again in my closing   remarks, no other OEM has the upside opportunity that we do to   gain share to lower cost to grow their business, to create   additional cash flow and you'll see that and what our plans are   for the next handful of years at Investor Day.  Ben Burud    --   Goldman Sachs -- Analyst  Got it. Understood. And in 3Q, obviously continued this trend   of strong market share gains, you all have seen across the   portfolio. How do we think about share gain momentum into 2020?   Do we keep going at this current cadence. And are there any more   notable share opportunities -- on the horizon in 2020?  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  Well, I think what we -- we'd never say that, what to say that   we're going to slow down anything we continue to work to   demonstrate the value of our products and services to our   customers and we've been rewarded by that. So, again, I think   we'll be able to provide more guidance into next year in our next   call, but at this point in time, we just want to stay the course   and make sure that we continue to do the right things, there is a   lot of activity taking place right now, not only on the product   side of the business, but also on the service side. We launched a   very aggressive plan to transform our dealer network, we have a   lot of support and you heard Troy talking about Loves and how we   expanded our network to better serve our customers. Our Uptime   promise is really sticking. Right now we see that customers are   valuing us more than just for the products that we deliver to   them. So we hope that, that will continue into 2020. And we do   expect our share to go up next year.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Yeah. I'm sure everybody is going to say the same thing, but   we really mean it.  Ben Burud    --   Goldman Sachs -- Analyst  Got it. Thank you very much.  Operator  Thank you. And our next question comes from Steven Fisher with   UBS. Your line is now open.  Steven Fisher    --   UBS -- Analyst  Thanks. Good morning, guys. Within your 2020 initial industry   Class 8 outlook. Do have any feel yet for how that would shape up   between severe service and heavy trucks. I'm kind of particularly   curious about the severe service piece in your backlog has been   holding up better than the heavy trucks, but it is starting to   come down now as well?  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  Within that, I'd have to look up the numbers, but I think   within that we continue to see the severe service portion of   Class 8 holding up a better for the industry as a whole with   heavy coming down a little bit more than severe.  Steven Fisher    --   UBS -- Analyst  Okay. And I was curious, what's behind the double digit   decline in the Class 6 to 7 outlook for 2020? I've always thought   of that as a relatively steady your business, but still you have   it down about 14% for the industry. What's the thinking behind   that market decline for next year?  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  Well, I think what we are seeing is -- no, as the industry   peaked in two different segments. If we take leasing and rental   there is usually a movement on with the leasing companies when   they start seeing a decline in a market, what traditionally they   do, they take their rental units and they move their own rental   units into leasing business and that's a portion, that's   something that basically goes away from the industry, it is an   internal movement. So that's one thing. And the other is really,   we're monitoring all the housing, all the stocks and all construction and things that   also impact medium-duty segment. And that on you -- you add all   those two factors together, we got to do 10%, I just saw there.   But it is still at a very strong level, we are still considering   that this is above replacement demand for medium duty. So --  Troy Clarke    --   President, Chief Executive Officer and Chairman  We're only counting our medium duty being down as an industry   10% next year and we don't think we'll be down in line with the   industry, as Persio indicated, 50% of the medium duty trucks are   bought by the two largest rental on leasing companies, when they   choose to push their units from rental to leasing, then nobody is   building a unit for them and that's part of what you see -- part   of what you see in that particular number. But again, this is   above replacement demand, so it's an area of traditional strength   for us that we've built a lot on in the last couple of years and   we'll continue to do that.  Steven Fisher    --   UBS -- Analyst  Great. Thanks a lot.  Operator  Thank you. And our next question comes from Rob Wertheimer   with Melius Research. Your line is now open.  Robert Wertheimer    --   Melius Research -- Analyst  Hi. Thanks, and good morning, everybody. Troy, I think you   mentioned you mean it on share gain and you've talked -- and   we've talked in the past about some of that natural entitlement   coming in back to you is fleets that had been customers, more   customers are now starting to be customers. Any insight on how   far along in that path you are? If you've got them all trailing   or only a few of them trailing? Are they trailing at high levels,   normal levels? Still just testing the waters, anything you can do   there?  Troy Clarke    --   President, Chief Executive Officer and Chairman  Yes, I'll give you a little bit of color on that without   trying to give you too much detail because again, it kind of gets   complicated, it's been Persio and Michael Cancelliere in sales,   they have a number of very complicated charts. But look, we've   staked out and you'll see a little bit more of that on our   Investor Day as well, just putting in a plug for that. Look, we   staked out a number of customers, so think about like 15 major   customers and between those, a bunch of them used to business   with us and then stopped and some of them stopped doing business   with us and really never had a bad experience with the previous   emissions technology. In both of those cases, OK, every one of   them have in some cases for a couple of years had some of our new   units with our new Uptime proposition, with the new quality, the   new design, the new driver centric kind of design philosophy we   add and every one of them had given us very positive   feedback. Now, in a handful of cases, they have -- in the course of two   years stepped up their percentage of our buy to where we are at   parity with the other brands that they buy for their fleet. In   other handful of cases, we are becoming the largest supplier to   them. And in another handful of cases, they're working themselves   off from under some longer term contracts, so we get a portion of   their buy that we would anticipate that we would gain over time.   Michael, call these customers as influencers, these are the   trucks that, their color, their badging, the freight they haul,   those are rolling billboards. Right. Because their endorsements   that, these are well-run truck companies that manage total cost   of operation that don't make these decisions lightly. I mean,   they're making them for the right reasons. And so I would tell you, on all 15 of those very key largest   kind of customers, we have made significant progress, some more   than others. I mean, this is just one of the things that gives us   tremendous encouragement for -- look, I don't -- I don't know   that some of these customers are going to buy 1,000 trucks next   year or they're going to buy 100 trucks next year. But, over 50%   in some of those customers, they're going to be our trucks and   last year, it was 50. And so, that's the kind of insight that we   have now. We'll take that 15, and we'll start expanding that for next   year, we'll take the next five, the next 10. And then we have a   very intensive sales process where we go in, we introduce   ourselves, talk about the value proposition and a good   business-to-business kind of sales process, so we're extremely   encouraged.  Robert Wertheimer    --   Melius Research -- Analyst  Okay. Thanks. That's very informative. Thank you.  Operator  Thank you. And our next question comes from Rob Salmon with   Wolfe Research. Your line is now open.  Rob Salmon    --   Wolfe Research -- Analyst  Hey, good morning, guys. I guess kind of segueing on that   question. As you guys have been going into those larger kind of   high profile fleets. Could you give us a sense of any sort of   residual value guarantees that you guys have been doing earlier   in the conference call, you noted that you're seeing some   weakness on the used truck. So just curious how we should be   thinking about that piece of the business.  Persio V. Lisboa    --   Executive Vice President and Chief Operating Officer  Alright. This is Persio. Every case is a case we used   traditionally don't have a lot of residual value guarantees, we   really manage to the fair market value of the units when they   have to go for a trade and customers understand that. I think the   good news is that the new products that we have not have been   really, now demonstrating that our residuals are going up and   they'll dramatically with all the new products that we've   launched. So this is not a practice for us to really work with,   residual value guarantees.  Rob Salmon    --   Wolfe Research -- Analyst  Got it. Appreciate that commentary. It's helpful. So kind of   more of just the improvement in the underlying product driving   that incremental market share from your perspective.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Yes, and the confidence that the residual value will continue   to improve over the life cycle of the product.  Rob Salmon    --   Wolfe Research -- Analyst  That makes sense. Could you speak more broadly about what you   guys are seeing from a used truck inventory as well as pricing   perspective we saw those kind of less than five year trucks,   particularly the four or five year in the month of July inflect   negatively looking at some industry data, but we'd love to get   your perspective of what you're seeing across your dealers from   both the price and inventory perspective?  Troy Clarke    --   President, Chief Executive Officer and Chairman  Inventories are going up because the strong new volume truck   sales that we've seen this year, our used truck inventories are   up as well in the third quarter when we expect to work those   lower in Q4. I think we alluded to the sleepers in particular   where there's some weakness in the pricing. And what is happening   right now is that, now in the past actually between first and   second quarter, I think it was taking longer for customers to   trade their units and now we are seeing a higher velocity on the   trade, so this is not taking as long, that's why I think is   happening in the industry as the inventories start going up,   that's one of the reasons why as new units get delivered, the old   ones are returned faster.  Rob Salmon    --   Wolfe Research -- Analyst  That makes sense. And should we be contemplating, just as the   later model used truck inventories kind of rise and we see   additional pressure there, should we be contemplating softer   pricing as we look out to next year relative to what we've seen   this year?  Walter G. Borst    --   Executive Vice President and Chief Financial Officer  Well, I mean, I think, yes. I mean, we're already seeing the   softer pricing, I mean, I think, as we and the industry turn   those units, that support -- that also support pricing. Right.   So, -- the couple of things that affect used truck value. Right.   If you need a whole bunch of trucks, you tend to hold on your   used trucks a little bit longer while you're waiting for your new   ones, that phenomenon is reversing, that was what Persio was   describing. The second phenomenon is when the market starts to recover,   used trucks is the quick [Phonetic] way to add capacity to your   fleet and get -- and take advantage of rising freight rates. And   so look -- I mean, I think how we look at this, we're kind of in   a period of time where especially on the classic sleepers, we are   -- we as an industry are a little oversupplied and so there will   be pressure on those prices until that oversupply is resolved.   And I think that will take probably a couple of quarters to make   that happen.  Rob Salmon    --   Wolfe Research -- Analyst  That makes sense. Appreciate the time, guys.  Operator  Thank you. Ladies and gentlemen, this concludes our   question-and-answer session. I would now like to turn the call   back over to Troy Clarke for any closing remarks.  Troy Clarke    --   President, Chief Executive Officer and Chairman  Hey, thanks. In closing, Q3 was a great quarter for Navistar,   and I really want to thank our customers, our employees, our   dealers for helping us deliver these strong results, truth be   told, as we've indicated, it's no surprise the U.S. economy and   the trucking market is moderating. Our industry tends to run in   four year cycles, this isn't a surprise for us, we have been   preparing for this time. During our turnaround, we'd lowered the break even afforded   the company by implementing lean practices, reducing our cost   structure while growing market share and strengthening the   balance sheet. We are in a much better position today and we   remain firm in our belief that, it's no OEM has the potential to   increase volume, gain share, lower costs and create improved cash   flow like Navistar. And we plan to continue those improvements   into 2020, and this is why, I remain optimistic that 2020 will be   another good year for Navistar. We look forward to talking to you again at our Investor Day,   please reach out to the IR team for any additional questions or   details on those events. Thanks for your time and interest in our   company this morning.  Operator  [Operator Closing Remarks]  Duration: 60 minutes  Call participants:  Martin Ketelaar    --   Vice President of Investor Relations   Troy Clarke    --   President, Chief Executive Officer and Chairman   Walter G. Borst    --   Executive Vice President and Chief Financial Officer   Persio V. Lisboa    --   Executive Vice President and Chief Operating Officer   Stephen Volkmann    --   Jefferies -- Analyst   Andy Casey    --   Wells Fargo -- Analyst   Neil Frohnapple    --   Buckingham Research -- Analyst   Ann Duignan    --   JP Morgan -- Analyst   Adam Uhlman    --   Cleveland Research -- Analyst   David Leiker    --   Baird -- Analyst   Brendan    --   RBC Capital Markets -- Analyst   Ben Burud    --   Goldman Sachs -- Analyst   Steven Fisher    --   UBS -- Analyst   Robert Wertheimer    --   Melius Research -- Analyst   Rob Salmon    --   Wolfe Research -- Analyst   More NAV analysis   All earnings call transcripts        10 stocks we like better than Navistar   International     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Navistar   International wasn't one of them! That's right --   they think these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " Navistar International Corp    (NYSE: NAV)        Q3 2019 Earnings Call       Sep 4, 2019 ,   9:00 a.m. ET ",
    " Operator ",
    "Good day, ladies and gentlemen, and welcome to the Navistar   Third Quarter 2019 Earnings Results Conference Call. [Operator   Instructions]",
    "I would now like to introduce your host for today's   conference, Mr. Marty Ketelaar, Vice President of Investor   Relations. Sir, you may begin.",
    " Martin Ketelaar    --   Vice President of Investor Relations ",
    "Thank you, Daniel. Good morning, everyone, and thanks for   joining us for Navistar's Third Quarter 2019 Conference Call.   Today, we will discuss the financial performance of Navistar   International Corporation for the fiscal period ended July 31,   2019. With me today are Troy Clarke, our Chairman, President and   Chief Executive Officer; Walter Borst, our Executive Vice   President and Chief Financial Officer; and Persio Lisboa,   Executive Vice President and Chief Operating Officer. After   concluding our prepared remarks, we'll take questions from   participants.",
    "Before we begin, I'd like to cover a few items. A copy of this   morning's press release and the presentation slides has been   posted to the Investor Relations page of our website for   reference. The non-GAAP financial measures discussed in this call   are reconciled to the U.S. GAAP equivalent and can be found in   the press release that we issued this morning as well as the   appendix of the presentation slide deck.",
    "Today's earnings press release, investor presentation and our   prepared remarks may include forward-looking statements about our   expectations for future industry and financial performance, and   the company expressly disclaims any obligation to update these   statements. Actual results could differ materially from those   suggested by our comments made here. For additional information   concerning factors that could cause actual results to differ   materially from those included in today's presentation, please   refer to our most recent SEC filings. We would also refer you to   our safe harbor statement and other cautionary notes disclaimer   presented in today's material for more information on the   subject.",
    "With that, I'll turn the call over to Troy Clarke for opening   comments. Troy?",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Okay. Hi, thanks, Marty, and good morning, and welcome to   Navistar's third quarter       earnings call    . All over with few high level thoughts on the quarter and the   industry and Walter will walk you through more details on the   company's financial performance and outlook for the rest of the   year. We delivered another strong quarter, total revenues grew   17% to over $3 billion, adjusted EBITDA grew 22% and adjusted net   income increased 55%. The growth came from the truck segment,   where volumes rose 45% year-over-year. Retail market share   continues to grow year-over-year as well. In the third quarter   Class 8 share grew 1.6 points to 13.9% and medium Class 6/7 share   rose 4.9 points to 26.8%.",
    "From an industry perspective, the U.S. economy is moderating,   a number of key economic indicators remain above their long run   averages, but they are trending lower. U.S. GDP is softening and   is expected to be around 2% for the balance of the year. The 2%   threshold is important to us as the industry tends to add   capacity when GDP increases more than 2% annually.",
    "The ISM Manufacturing Index, something we also follow, also   continues to trend lower and it's hovering around 50, indicating   to us that manufacturing growth is shifting to neutral. Yet   consumer confidence and -- spending remain positive, but new   housing permits are still running lower than expected. Lots of   mixed signals indicate an economy that is in transition. The   truck market is decelerating, truck orders tend to be a leading   indicator of economic activity as carriers forecast their need   for trucks. As freight tonnage and rates decline industry orders   for Class 8 trucks in particular have also declined about 75% in   the quarter. The used truck market is also slowing, pressuring   prices is inventories of less than five year old sleepers are   rising as trade receipts have increased in conjunction with new   truck deliveries.",
    "Build rates of new trucks have exceeded orders, causing   industry class 8 backlogs to decline 44% since peaking last   October. Navistar's backlogs are declining as well, and as you've   seen, we're actively managing this by adjusting assembly line   rates to create a balance between customer demand, inventory   levels and a healthy backlog. For example, in November of last   year we added a second shift to meet class 8 demand while   increasing line rates at all our truck plants. In addition, we   added overtime and weekend shifts as needed.",
    "Today, weaker U.S. orders as well as lower Mexico and Latin   America orders has resulted in the need to reduce assembly line   rates in both of our truck plants. We make these type of   decisions every day, actively managing our business appropriately   with the goal of being efficient order to delivery process. As a   result, total company and dealer inventories remain at the low   end of the normal range at 85 days. Over the balance of 2019,   order activity should pick up from the levels of the last couple   of months due to the traditional fleet ordering season as   carriers continue to replace aging trucks. This fall ordering   season will provide further insight into 2020, currently we are   expecting 2020 core industry volumes to be down about 20%,   reflecting a 25% reduction in Class 8 trucks and a 10% reduction   in Class 6/7 and bus units.",
    "Tentatively, we are planning for 2020 Class 6-8 trucks and   buses in our core markets to range between 335,000 and 365,000   units. Given Navistar's strong Class 6/7 and bus franchises, we   do not expect to be down as much as the industry. We'll continue   to refine our view and share more details with you in the near   future. Shifting gears, you know, over the past several years, we   made a number of investments to improve our business. We met a   lot of times customers listen to their feedback, ideas, their   suggestions. Next, with this understanding, we invested in our   products. We developed and delivered a full line of new products   which have been very well received as demonstrated by our growing   retail market share, improve sales, selected volume and share,   earnings and improved cash flow.",
    "Now it's time to make investments in the next phase of our   future. Earlier this quarter, we announced we were investing $125   million in our engine plant in Huntsville, Alabama, over the next   three years. This investment is being made in preparation or   producing our next generation big-bore diesel powertrain being   developed with our alliance partner trade time. The production of   these new proprietary powertrains will add to the existing   facility where we currently build our international A26 engine.   We also [Indecipherable] invested in our uptime commitment. A new   parts distribution center in Memphis is now open, offering   industry leading cut off times for next day delivery of parts.   Our service partnership with Loves is now operational adding more   than 320 Love's and Speedco locations and more than a 1,000   technicians to our service network. In an updated version of our   dealer parts inventory management system has significantly   reduced emergency orders and works to position parts where they   are needed.",
    "You know, our third quarter was another great quarter for   Navistar. Our operational and financial progress demonstrates   that our investments are paying on. Market share is increasing,   revenue and earnings are growing and now we're accelerating   investments to improve our operations and deliver on our promise   of Uptime. I look forward to talking to you again at our Investor   Day later this month, where we'll discuss our plans to further   grow the earnings power of Navistar.",
    "And so with that, let me turn it over to Walter.",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "Thanks, Troy. Good morning, everyone. Navistar has continued   its cadence of delivering excellent results in the third quarter.   Revenues, adjusted EBITDA, adjusted net income and free cash flow   were all up year-over-year. Let's dive into the results. As Troy   mentioned, revenues grew 17% in the quarter to $3 billion. The   improvement was driven by a 28% increase in core Truck volumes.   Core market share grew 2.6 points to 18.2%, reflecting higher   share in all vehicle segments year-over-year. Q3 gross margin was   17.8%, up a point from last quarter, segment mix continue to   impact consolidated gross margins as truck revenues including the   new Class 4/5 products grew substantially year-over-year. As   we've discussed previously, parts margins are higher than truck   margins and in the long run, selling more trucks today will   benefit part sales in the future.",
    "Turning to structural costs, year-over-year SG&A expenses   declined 25% to $167 million, largely from the release of a $32   million accrual related to certain legacy engine litigation.   Engineering costs increased $9 million, largely from the   development of next generation powertrains with our alliance   partner TRATON. Even if one adjusts for the legal accrual,   structural costs including SG&A and engineering expenses fell   as a percentage of revenue to 9.2% from 11.3% in the prior year.   Net income in the quarter was $156 million, or $1.56 per diluted   share.",
    "Prior year income of $170 million, or $1.71 per diluted share   included a $71 million settlement gain related to a business   economic loss claims excluding one time items in both periods on   an after tax basis, adjusted net income in the quarter grew 55%   to $147 million versus $95 million last year. Adjusted EBITDA   rose 22% to $266 million in the third quarter versus $218 million   year ago after excluding one time items on a pre-tax basis.",
    "Moving to the segment results. Our truck segment sales in the   quarter grew 25% to $2.4 billion. The sales growth was driven by   an increase in all core product segments plus the production   ramp-up of the new Class 4/5 trucks. Total core volumes grew 28%   to 24,400 vehicles. Truck segment profit grew and excluding the   two one-time line items, I mentioned earlier, the segment was up   44% year-over-year. The increase was largely driven by higher   volumes and improved pricing, partially offset by the impact of   the sale of a majority interest in Navistar Defense.",
    "Our Parts business delivered another solid quarter. The Parts   segment revenue results were impacted by the new revenue   recognition standard, which Navistar adopted at the beginning of   this year. The implementation of this standard reduced third   quarter revenue by $31 million. On a comparable basis, revenues   were largely flat from Q3, 2018. Profit was up 3% to $149   million, due to improved U.S. operating results, reflecting our   growing private label business partially offset by lower Blue   Diamond Parts volumes.",
    "Parts segment profit margin grew over two points   year-over-year to 26%. The global operations segment continues to   be impacted by a weaker than expected economy in Brazil. Revenues   were flat year-over-year and the operations remain profitable.   Our financial services segment is benefiting from larger average   portfolio balances. As a result, revenues increased 14% to $74   million. Segment profitability rose 30%, $30 million, largely   from higher interest margin and income from an intercompany loan,   partially offset by the write-off of debt issuance costs.",
    "During the third quarter, NFC closed a new five year, nearly   $750 million revolving credit facility and repaid its $400   million Term Loan B issued in 2018. The new facility provides for   additional liquidity with increased flexibility at a lower   borrowing cost. During the quarter, the company generated $250   million of manufacturing free cash flow, largely from strong   adjusted EBITDA and net working capital performance. The company   ended the period with the manufacturing cash balance of $1.1   billion.",
    "Next, let me take a moment to update our guidance for 2019.   For the Class 8 industry, we expect volumes to come in toward the   upper end of our prior range. Also, we're seeing higher Class 6/7   volumes, including greater gasoline units where Navistar does not   participate. We now believe 2019 industry volumes will range   between 435,000 and 455,000 units, a 10,000 unit increase from   our prior guidance. Today, retail market share is 18%. During the   fourth quarter, we expect share to continue to grow largely from   the seasonal increase in school bus registrations. As a result,   we believe fiscal year retail market share will range between   18.5% and 19%. 1 to 1.5 points higher than 2018 market share.",
    "As Troy mentioned, the decline is domestic and export orders   and backlogs led to the decision to lower assembly line rates in   both of our Truck plants. Due to lower production volumes in the   fourth quarter, we expect revenues to be toward the lower half of   our guidance range of $11.25 billion to $11.75 billion for the   year. To-date, consolidated gross margin is 17.7%. We are   expecting margin growth in the fourth quarter from the seasonal   benefit of higher parts revenues a larger mix of severe service   truck sales. We now believe gross margins will end up between   17.75% and 18% for the year.",
    "Lower aggregate gross margin from lower production volumes and   revised margin percentage expectations is being offset by lower   SG&A expenses. Consequently, we are holding our 2019 adjusted   EBITDA guidance at the midpoint of $900 million for the year.   Finally, capital expenditures are trending lower and are now   expected to be $115 million versus our prior guidance of $150   million.",
    "In summary, the third quarter results show the effectiveness   of executing our strategy as we are recapturing market share and   growing revenue, EBITDA and cash flow. I look forward to talking   to you again at our Investor Day on September 19th, where we'll   provide insights on our strategy, improvements we've made to the   business and our road map to becoming a market leader. If you   haven't registered for the event, please reach out to the IR team   for details. We look forward to your attendance. Also, we invite   you -- we invite you to see our latest product offerings and   technology developments at this year's North America Commercial   Vehicle Show in Atlanta from October 28 through the 31st.",
    "With that, I'll turn it back to the operator to begin the   Q&A.",
    " Operator ",
    "Thank you. [Operator Instructions] Our first question comes   from Stephen Volkmann with Jefferies. Your line is now open.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Steve, are you there?",
    " Stephen Volkmann    --   Jefferies -- Analyst ",
    "Yes, I am sorry about that. Good morning.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Good morning.",
    " Stephen Volkmann    --   Jefferies -- Analyst ",
    "So maybe let's just start off, since you've provided this kind   of preliminary look into 2020 industry volumes, I guess we have   yet to really have a clear idea from you guys about how you think   you'll perform in a down market and I guess specifically I'm   thinking about decremental margins. I know you've lowered your   break even, significantly, but any help you could give us just on   how you kind of modeled the business in a declining top-line   environment would be great.",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "Yes, Steve, it's Walter. you know we'll provide some   additional insights on that on our Investor Day, but, you did   allude to the fact that we've continued to work to lower our   break even point, that's continued, we've also been growing our   shares, so, the decline that we could see in industry volumes   before we would drop to break even results in our truck segments,   give us even that much room that versus where we were a couple of   years ago? As we entered 2020, we do continue to see   opportunities to grow our market share, given the strong product   offering that we have and with the industry environment changing,   we would expect to be able to continue to improve our cost   structure as well as we wouldn't have the same kind of headwinds   that we had this year in the strong industry with supplier costs   and the like, so, we think that our position for next year will   continue to improve even as the industry volumes decline, from a   profitability per unit perspective.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Yes. Hi, Steve. This is Troy, but obviously, this is a   cyclical industry, we've talked openly about that, I think on   this call and other occasions in the past. We've been preparing   for this. So we have modeled out the scenarios of what we think   2020 looks like kind of to the good and to the bad levels and we   think 2020 will be a good year for Navistar with gains and things   like market share and continued progress on costs, as Walter has   indicated.",
    " Stephen Volkmann    --   Jefferies -- Analyst ",
    "Okay. And just so I make sure I understand what you said,   Walter, it sounded like you're kind of saying that you think you   can grow EPS in a down market, basically around what you've   forecasted next year? Or am I reading that wrong?",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "No, I don't think you're reading that right. I think what I   tried to say, at least was that, on a per unit basis, we would   continue to look to improve our profitability, if units are down   and the overall earnings would probably down as well, but we've   got a lot more room vis-a-vis our break evens that we had a   couple of years back.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Right.",
    " Stephen Volkmann    --   Jefferies -- Analyst ",
    "Okay. Great. All right. I'll pass it on. Thanks.",
    " Operator ",
    "Thank you. And our next question comes from Andy Casey with   Wells Fargo. Your line is now open.",
    " Andy Casey    --   Wells Fargo -- Analyst ",
    "Thanks a lot. Good morning.",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "Good morning.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Good morning.",
    " Andy Casey    --   Wells Fargo -- Analyst ",
    "Within -- back to the 2020 sales view, I appreciate you expect   to be down less than the industry, but can you give us a little   bit of color around the commentary you made, specifically the   Class 8 assembly line reduction so far. And I'm just wondering   how to frame up 2020 as -- are you expecting that to be down 25%   on a retail basis off the bad or for production to kind of scale   down during the year if orders do not improve?",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Yes, I think it's more the latter, you know, look, we've made   these -- this is a company that ran for a number of years with no   or a very skinny backlog and we've taken advantage, I think if   these last couple of years to restore backlog to a far more   normal range, our current backlog is in kind of at the industry   average over 150 days, closer to 165 days. We adjust our   production rates to maintain some manner of backlog because this   order to delivery system runs more effectively, more efficient   balancing between customer needs, the needs to manage the   inventory, that's in the pipeline as well as the inventory that's   basically on the ground.",
    "With these adjustments, we believe we see a stable environment   through Q1. And then, we'll have to see how the seasonality of   additional orders that are coming in from larger players, from   larger customers plays out through the year. Now, very recently,   we won't make any announcements you know several large players,   our share of their buy year-over-year is going up and it's very   encouraging, so it supports the thought that with the adjustments   we've made, we should be stable through Q1, and then we'll have   to see what happens if the economy and the industry as we go past   that. But certainly it will be a topic we'll update at our nex   t earnings    call as well as we'll just have more insight at that particular   point in time.",
    " Andy Casey    --   Wells Fargo -- Analyst ",
    "Okay. Thanks, Troy. I'll leave it at that. Thank you.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "You're welcome, Andy.",
    " Operator ",
    "Thank you. And our next question comes from Neil Frohnapple   with Buckingham Research. Your line is now open.",
    " Neil Frohnapple    --   Buckingham Research -- Analyst ",
    "Hi, guys. Thanks and congrats on a good quarter. Walter, can   you remind us from a high level, what the adjusted EBITDA number   is you need to generate in order to be free cash flow breakeven?   Is it still in that $650 million to $700 million range? Just   trying to get a sense of whether you guys will generate free cash   flow in FY '20 even if the market cycle is down?",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "Yes. Hope to see at the Investor Day.",
    " Neil Frohnapple    --   Buckingham Research -- Analyst ",
    "All right. And then just could you -- could you, Walter   discussed a slight reduction in the gross margin outlook versus   your prior guidance. Any more granularity on the puts and takes,   whether the embedded price cost outlook is less favorable? Are   you seeing more new -- more aggressive new truck pricing, whether   it's just mix? Just any help that would be great.",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "Yes, probably three or four items I'd point too. Pricing is   actually been good, as we indicated in our remarks, pricing is up   year-over-year, so that's kind of come in as we expected, well,   we've continue to see as the segment mix, which I commented in my   remarks, so truck versus parts as the truck volumes have been   stronger, that impacts our overall gross margins because our   parts had some impact on our margins.",
    "Thirdly, we've seen, in the strong environment, we could see   higher commodity prices, which we've indicated at the beginning   of the year would be a headwind and we've seen additional freight   costs as well with the tighter supplies, so that has impacted our   material costs. And then lastly, as Troy mentioned in his   remarks, we've seen some weakness in used trucks, in particular   the sleeper market and so we've made some small adjustments there   too, are the prices of the units in our used truck portfolio.",
    " Neil Frohnapple    --   Buckingham Research -- Analyst ",
    "Okay. Thanks. I'll pass it on.",
    " Operator ",
    "Thank you. And our next question comes from Ann Duignan with   JP Morgan. Your line is now open.",
    " Ann Duignan    --   JP Morgan -- Analyst ",
    "Yes. Thank you. Good morning. I wonder if you could give us a   bit more color on the lower production levels at both facilities,   I mean, how much lower is production going to be in fiscal Q4, is   it going to at whatever fiscal Q4 run rate is at the end into Q1   of next year, just from the modeling perspective, if you could   give us a bit more specifics on those?",
    " Persio V. Lisboa    --   Executive Vice President and Chief Operating Officer ",
    "Hi, Ann. This is Persio Lisboa. Well, I think for Q4, the exit   rate, we are probably going to be calibrating the -- as Troy   mentioned, we are rebalancing our lines. So overall throughout   our plants will be down close to 15% versus the Q3, which is and   that's the level that we are going to enter Q1, but you have also   to consider that, that's the nominal rate, we used a lot of   overtime days in the last few quarters and we are removing some   of them. So but overall, nominal rates will go down 15% and   that's what we intend to keep for the first quarter as well.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "And Ann, I just might indicate that by taking those -- down   those rates, that's after we increased the rates earlier this   year, so that brings the overall daily rates back to about where   we were in November and December of 2018, so, on earlier calls   we've reported about production line rate increases, we're now   effectively reversing that with this 15% reduction that Persio   mentioned.",
    " Ann Duignan    --   JP Morgan -- Analyst ",
    "Okay. That's very helpful, especially on a year-over-year to   keep that -- bear that in mind that we didn't take up production   and then back. And then just a quick follow up, last quarter you   guys had noted that at the summer months, we're going to be very   important for fleet orders, I think all the OEM 2020 order books   are now open, now we're kind of pushing them back, saying fall   months are going to be very important or what are the large fleet   saying and doing, I know you said you're gaining more share of   pocket with them, but in general what is the commentary that   you're hearing from the large fleets, they obviously are not   placing orders yet.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Yes. What do we you talked about previously Ann was, in some   years where everybody anticipates that the following year or the   coming year, like in 2020 would be strong, people would open up   their order books in the July timeframe, but the more traditional   timeframe is September and in fact, that's what we're seeing, so   this really supports what we think to be a fairly normal, I think   timing for an ordering cycle. So we are engaged with large   customers, and quite frankly, Ann, just put your plug-in for the   products, our products are performing well in your fleets and,   this is what we're hearing from them and what we're seeing from   them, the deals that we're working on with them is we're   continuing to improve our share of their buy on large fleets and   that's our expectation. So we would expect certainly in the Class   8 space, that will continue to grow with these large customers.   The second thing is, as we have a lot of trucks, we have some   real momentum building on the vocational side of the business.   Obviously, lower volume and share impact, but you know pretty   good business for us and quite profitable, and a lot of those   units are still working their way through the TEMs and so, we   anticipate that this momentum on the vocational side of the house   will continue well into 2020.",
    "And then last, but not least, as you indicated, as you heard   in my comments, we've picked up nearly five points of market   share in a piece of the business where we're traditionally very   strong in the medium duty -- in the medium duty segment. And the   discussions that we're currently having with customers who buy   those trucks without giving too much more way, our portion of   that buy continues to be strong as we look into 2020. So we're   not planning on seeding certainly any share in a segment that we   believe we have advantages over our competitors. So as far as   some color and insight goes, yes, 2020 is going be down, but if   you take a look at the -- we have a concept we call kind of share   of wallet or a share of a target customers buy, those numbers   look that they will continue to improve and that's how the orders   are lining up for us as we see. We'll give little more color in   our Investor Day. But again, contributes whole thought process   that we'll roll into Q1, a lot like we look today.",
    " Ann Duignan    --   JP Morgan -- Analyst ",
    "Okay. I appreciate the color and look forward to hear more. So   I'll leave it there. Thanks.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Thanks, Ann.",
    " Operator ",
    "Thank you. (Operator Instructions) Our next question comes   from Adam Uhlman with Cleveland Research. Your line is now   open.",
    " Adam Uhlman    --   Cleveland Research -- Analyst ",
    "Hi, guys. Good morning.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Hi, Adam, good morning.",
    " Adam Uhlman    --   Cleveland Research -- Analyst ",
    "Congrats on all the progress. I guess, I wanted to start with   the clarification. Walter, you mentioned several headwinds that   we faced this year with supplier cost, material cost. I believe   you gave us a figure at the beginning of the year. I was   wondering if you could update us with that, we can put that into   context when we think about the 2020 profit headwinds that   shouldn't exist.",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "Yes, we began the year, I think we've said that overall, we   would expect performance in pricing less the headwinds that we   saw material cost still to be positive to the bottom line, that's   still the case as we sit here today, but it's less so than what   we had seen, given the factors that I mentioned impacting our   product costs on the procurement and logistics side of the   business, but net-net, it's still a positive for the year, as we   had expected coming in and that's in large part is due to   continued efforts, including from the procurement joint venture   that we have with TRATON to continue to work our product costs   lower.",
    " Adam Uhlman    --   Cleveland Research -- Analyst ",
    "Okay. And the fright headwinds and supplier disruptions, is   that still, a meaningful headwind outside of price cost?",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "We see that as an opportunity to be less of a negative impact   going forward. It's -- I made the comments, I did to Steve   earlier in the call about. As we look into 2020, as those   headwinds abate that should help our profitability for years.",
    " Persio V. Lisboa    --   Executive Vice President and Chief Operating Officer ",
    "And this is Persio. We are also seeing on a supply base much   fewer disruptions than we've ever saw before, so I think at the   levels of productions that we are today, we are pretty safe on   the supply side and freight rates start coming down. So you could   imagine that as we are running overtime days and extra weekends,   we were basically driving more volume and capacity in the supply   base and generating some level of expedite. That's all gone.",
    " Adam Uhlman    --   Cleveland Research -- Analyst ",
    "Okay. Got it. And then on the capital spending plan for this   year going forward, the CapEx came down, but there are several   big projects, it sounds like under way, should we be expecting a   material pickup next year or maybe back to what the prior plan   was and then just along with that, if you could just expand it on   the Huntsville plan through 2021, what steps should we be   thinking about or listening for? Thanks.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Yes. Let me break it into a couple of pieces and my colleagues   will probably join in as well. So cap spending, we indicated, is   going to be lower this year than what we had said previously. In   part, that's due to the stronger industry that we've seen, so   we've pushed out some projects, some of the maintenance and so on   that we do in our facilities as we wanted to keep those running,   so we'll be able to do some of that work as the industry slows a   little bit in 2020 back more to kind of replacement volumes.",
    "We do see CapEx will be increasing, we'll provide some more   insights at Investor Day around that as well as we do have some   of these investments like the Huntsville investment coming, that   will come in over the next few years in Huntsville and is related   to the alliance activities around the Localization of some   big-bore diesel engine or diesel powertrain investments that   we've mentioned previously. So CapEx will be up versus this   year's levels, but obviously CapEx has been favorable to our cash   flow for this year versus what we'd originally suggested.",
    " Adam Uhlman    --   Cleveland Research -- Analyst ",
    "Okay. Thanks.",
    " Operator ",
    "Thank you. And our next question comes from David Leiker with   Baird. Your line is now open.",
    " David Leiker    --   Baird -- Analyst ",
    "Good morning, everyone.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Good morning.",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "Good morning.",
    " David Leiker    --   Baird -- Analyst ",
    "Walter, I want to go back in reverse, I know you talk through   this and I want to just try and find some of the puts and takes   on the truck pretty significant revenue increase to flat profits   and I know there's some moving pieces underneath the surface. But   can you just help reconcile that a bit for us to just kind of get   to what the real contribution margin was here in the quarter?",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "Well, I guess, I didn't do a good job on the first time.",
    " David Leiker    --   Baird -- Analyst ",
    "Walt, I might have missed that too.",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "Yes. So what -- if you're just looking within the Truck   segment, then a couple of comments there, I did mention earlier   on the call that we do have the segment mix between truck and   parts, which we've think [Indecipherable] long as the Truck   volumes have been strong. Within the truck segment, we've   mentioned couple of times this thing on the call, we did grow our   medium share some of that was with rental and leasing customers,   those margins are lower than with some of our other customers,   we've also been ramping up the Class 4/5 vehicles and so those   have a lower profit margin than our average portfolio as well. We   produced those units largely for General Motors on a cost-plus   type basis, which helps them to fixed in our plants. But those   margins aren't as high and we do run that through the revenue as   well as the profitability side of our income statement. So that   year-on-year is a lower average profit margin. We also don't have   the defense business this year, which was a big contributor to   profitability in the third and fourth quarter of last year. So   those would be a couple of puts and takes.",
    " David Leiker    --   Baird -- Analyst ",
    "Okay. Great. Thanks. And then, Troy, as we look at during the   year end and then calendar 2020. Can you talk at all about what   you think the makeup on the backlog looks like, our people   cleaned out that backlog, how real that is and then just kind of   your thoughts of cancellations as we go into 2020?",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Yes. Look, we -- I'll make a couple of comments here then I'll   ask Persio to jump in as well, because, I mean, I think certainly   the second half of this year, this -- these are numbers that   we've looked at quite a lot just to make sure that we're making   the right decisions and have the right interpretations. I have to   say, I think, let me just say overall, I think the quality of our   backlog is very high, when I say that we have a very normal   backlog in 165 day range, which I think is comparable to where   other competitors are, there's not a lot of orders in there which   have the potential for cancellation, there are orders that have   the potential for retiming because as we are attempting to   deliver units, some of our customers have to -- they have to   figure how to dispose of their used truck right now. And now   we're slipping into that, thing we've been in the past where they   go to the market with a truck that has a book value and if the   market's value below then they have to work that equation a   little bit more so that they don't take a loss and that sometimes   gets in the way of our delivery.",
    "And that happens with very large customers, and it happens   with very small customers. We have the ability to help somewhat   in used trucks, OK, but, we've been in difficulties in used   trucks in the past. And so we're working to manage that very,   very seriously as well, OK? So that's kind of the phenomenon, but   I would say that the backlog itself, we believe it's fairly high   quality. Let me pass to Persio, who really keeps tracking our --   I know he watches these numbers on cancellations more than I say.   Well, we all -- we all look at it, but he's the guy who kind of   keeps his eye on that to make sure that the quality of this   backlog is high.",
    " Persio V. Lisboa    --   Executive Vice President and Chief Operating Officer ",
    "Okay. Thank you, Troy. What we are seeing today in the backlog   is as Troy referred to some of the -- we have two types of orders   that get into the system, some of those that are -- that come   from the very large customers that have a very constant buy   throughout the year and those have been timed, as Troy referred   too. I think that's where we see the most of that, because some   of those customers are working through the used truck kind of   phenomena that Troy described.",
    "On the dealer side, I think we have also the activity on the   retail, that's the one that's now is more impacted in the short   term and we monitor that very closely with our dealers. Having   said that, our dealers today have 85 days off dealer sales in   their inventory, which is within the normal range that we   operate, so we feel that no time will tell a little bit more as   we get into Q4 and Q1, but we haven't seen any abnormal signs off   cancellations compared to what we are seeing in the industry from   a backlog standpoint. I think we've averaged in the last quarter   3% to 4% of the backlog cancellation, which is now pretty well   insight of the industry is being presenting to us as data.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Yes. So David, let me just, if I could just summarize this,   because I think this is kind of a point that I'd like to make.   Look, our guidance for the fourth quarter provides, provides for   potential further softening in Mexico and Latin America, where we   really don't put those orders in until we know they've got to   home. The potential for customers to push out deliveries a little   bit, it's the kind of thing that might happen, sometimes those   gives backfield, sometimes they just get out and with the line   rate adjustments we've done -- we haven't given up the ability to   produce and deliver units to the previous levels that we've   highlighted of our guidance, which in fact then allows us to   protect the upside.",
    "And we've done all this with the ability to roll into Q1 with   a healthy backlog that allows our order to delivery systems to   run efficiently without a lot of stranded inventory, a lot of   premium freights and other type costs that we might -- that we   might run into. I mean, it's hard for us to describe because the   company hasn't been in that position for a while, but we believe   -- we've got this thing boxed in very nicely and all the numbers   kind of interlock and we have a lot of confidence in our forecast   and the ability to protect the upside.",
    " David Leiker    --   Baird -- Analyst ",
    "Yes. Great. Thanks. Any thoughts on how the industry sets? I   know it's hard for you to do.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "I think, you know, we look at their numbers and they kind of   look a lot like our numbers. So, I mean, I don't know [Speech   Overlap].",
    " Persio V. Lisboa    --   Executive Vice President and Chief Operating Officer ",
    "Well, I think from what we're experiencing with our customers,   I think we're all in the same position at this point in time. And   honestly, I think as we've been gaining share, we want to   continue the -- kind of the performance that we've delivered to   customers are not only on the product side, but on the service   side and customers are valuing us more because of, I think, what   we've done in the last few months in 2019. So -- but I don't see   anything different happening in the industry overall, I think all   the customers are the same. We're all knocking on the same   doors.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Yes. And I think they're doing the same thing, they're looking   at what the orders are coming in, what the customers are telling   them. There is just one small difference, our quarter ends at the   end of October, right our fiscal year does their fiscal years   tend to end at the end of the calendar year. So the kind of the   last minute push to kind of meet the target on the scorecards   looks a little different between us and them. So I certainly   anticipate that they'll be pushing for deliveries between now and   the end of the calendar year. And our market share forecast, by   the way provides for that kind of push, because this is something   that we have we see every year.",
    " David Leiker    --   Baird -- Analyst ",
    "Yes. Great. Thank you very much.",
    " Operator ",
    "Thank you. And our next question comes from Seth Weber with   RBC Capital Markets. Your line is now open.",
    " Brendan    --   RBC Capital Markets -- Analyst ",
    "Good morning. This is Brendan on for Seth. Thanks for taking   my question. You had a healthy market share gains this quarter   again, I appreciate the comments that you anticipate growing   market share again 2020. I was just wondering any extra color you   can give on, I guess, what you're seeing that drove your decision   to decrease the 19% share gain to the 18.5% to 19% from over 19%   indicated last quarter.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "I think, I can comment to that. What we're -- no, we --   typically what we do, we have a forecast for the industry and we   have a forecast for our no deliveries. The deliveries are pretty   locked at this point in time, we know what they are going to be,   what we don't know 100% control is the forecasts on the top line   of the industry and as we mentioned before, there is now an   effort that I think there is we are seeing more of an effort on   in retail to retail, more units from all distributors.",
    "And so the industry forecast being a slightly higher, now   force us to basically consider that now our share may not be as   aggressive as we thought it would, all though year-to-date, we   have been performing above, I think now where we were last year,   as we alluded in prepared comments. So it is more of an   adjustment on a forecasting of the industry than anything else,   we don't see a deterioration in our forecasted deliveries and   DTUs we called it, the units that get charged out and retailed in   the market, so it is more of an adjustment on overall forecasts   and making sure as we got closer to the end of the year, it's   easier for us to put a tighter range.",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "Yes. So as we look at the inventories of our competitors and   their dealers, especially going into a softer year 2020. We have   every reason to believe that they'll be pushing those units off   the lots and through the pipeline, just like we will be doing   that. It's one of the reasons why Walter increased in his   comments the industry by 10,000 units. And so it's really the   effect of the increase in the industry as Persio said, it's a   math phenomenon as opposed to we think we'll be selling fewer   units in the quarter than we had planned.",
    " Brendan    --   RBC Capital Markets -- Analyst ",
    "Okay. Great. Thank you.",
    " Operator ",
    "Thank you. And our next question comes from Jerry Revich with   Goldman Sachs. Your line is now.",
    " Ben Burud    --   Goldman Sachs -- Analyst ",
    "Hi. Good morning, everyone. This has Ben Burud on for Jerry.   So you all are currently guiding to about $900 million of EBITDA   this year at the peak of the cycle. And if we think about   layering on the tree tiling cost savings that number will move to   more around $1.1 billion to $1.2 billion. Is that how we should   think about what the next peak looks like in your business? Or   you achieving more of the trade time sourcing cost savings   already at this point?",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "Hopefully, Jerry will let you come to Investor Day.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Yes, you need to come to Investor Day, Ben. Ben, I know Jerry   is out of the line [Indecipherable] you need to come or Jerry   needs to Investor Day because it's -- there's no 30 second answer   to that particular question. Okay. Look, we're going to grow and   we're going to continue to improve the returns that this business   provide shareholders and to say that the TRATON savings that   we've talked about, and we're on track for is all we're going to   be able to do, that is not the case. Okay. But to explain what is   the case, we're going to be a little bit more time, but you   should have confidence that and I'll state it again in my closing   remarks, no other OEM has the upside opportunity that we do to   gain share to lower cost to grow their business, to create   additional cash flow and you'll see that and what our plans are   for the next handful of years at Investor Day.",
    " Ben Burud    --   Goldman Sachs -- Analyst ",
    "Got it. Understood. And in 3Q, obviously continued this trend   of strong market share gains, you all have seen across the   portfolio. How do we think about share gain momentum into 2020?   Do we keep going at this current cadence. And are there any more   notable share opportunities -- on the horizon in 2020?",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "Well, I think what we -- we'd never say that, what to say that   we're going to slow down anything we continue to work to   demonstrate the value of our products and services to our   customers and we've been rewarded by that. So, again, I think   we'll be able to provide more guidance into next year in our next   call, but at this point in time, we just want to stay the course   and make sure that we continue to do the right things, there is a   lot of activity taking place right now, not only on the product   side of the business, but also on the service side. We launched a   very aggressive plan to transform our dealer network, we have a   lot of support and you heard Troy talking about Loves and how we   expanded our network to better serve our customers. Our Uptime   promise is really sticking. Right now we see that customers are   valuing us more than just for the products that we deliver to   them. So we hope that, that will continue into 2020. And we do   expect our share to go up next year.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Yeah. I'm sure everybody is going to say the same thing, but   we really mean it.",
    " Ben Burud    --   Goldman Sachs -- Analyst ",
    "Got it. Thank you very much.",
    " Operator ",
    "Thank you. And our next question comes from Steven Fisher with   UBS. Your line is now open.",
    " Steven Fisher    --   UBS -- Analyst ",
    "Thanks. Good morning, guys. Within your 2020 initial industry   Class 8 outlook. Do have any feel yet for how that would shape up   between severe service and heavy trucks. I'm kind of particularly   curious about the severe service piece in your backlog has been   holding up better than the heavy trucks, but it is starting to   come down now as well?",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "Within that, I'd have to look up the numbers, but I think   within that we continue to see the severe service portion of   Class 8 holding up a better for the industry as a whole with   heavy coming down a little bit more than severe.",
    " Steven Fisher    --   UBS -- Analyst ",
    "Okay. And I was curious, what's behind the double digit   decline in the Class 6 to 7 outlook for 2020? I've always thought   of that as a relatively steady your business, but still you have   it down about 14% for the industry. What's the thinking behind   that market decline for next year?",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "Well, I think what we are seeing is -- no, as the industry   peaked in two different segments. If we take leasing and rental   there is usually a movement on with the leasing companies when   they start seeing a decline in a market, what traditionally they   do, they take their rental units and they move their own rental   units into leasing business and that's a portion, that's   something that basically goes away from the industry, it is an   internal movement. So that's one thing. And the other is really,   we're monitoring all the",
    "housing, all the stocks and all construction and things that   also impact medium-duty segment. And that on you -- you add all   those two factors together, we got to do 10%, I just saw there.   But it is still at a very strong level, we are still considering   that this is above replacement demand for medium duty. So --",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "We're only counting our medium duty being down as an industry   10% next year and we don't think we'll be down in line with the   industry, as Persio indicated, 50% of the medium duty trucks are   bought by the two largest rental on leasing companies, when they   choose to push their units from rental to leasing, then nobody is   building a unit for them and that's part of what you see -- part   of what you see in that particular number. But again, this is   above replacement demand, so it's an area of traditional strength   for us that we've built a lot on in the last couple of years and   we'll continue to do that.",
    " Steven Fisher    --   UBS -- Analyst ",
    "Great. Thanks a lot.",
    " Operator ",
    "Thank you. And our next question comes from Rob Wertheimer   with Melius Research. Your line is now open.",
    " Robert Wertheimer    --   Melius Research -- Analyst ",
    "Hi. Thanks, and good morning, everybody. Troy, I think you   mentioned you mean it on share gain and you've talked -- and   we've talked in the past about some of that natural entitlement   coming in back to you is fleets that had been customers, more   customers are now starting to be customers. Any insight on how   far along in that path you are? If you've got them all trailing   or only a few of them trailing? Are they trailing at high levels,   normal levels? Still just testing the waters, anything you can do   there?",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Yes, I'll give you a little bit of color on that without   trying to give you too much detail because again, it kind of gets   complicated, it's been Persio and Michael Cancelliere in sales,   they have a number of very complicated charts. But look, we've   staked out and you'll see a little bit more of that on our   Investor Day as well, just putting in a plug for that. Look, we   staked out a number of customers, so think about like 15 major   customers and between those, a bunch of them used to business   with us and then stopped and some of them stopped doing business   with us and really never had a bad experience with the previous   emissions technology. In both of those cases, OK, every one of   them have in some cases for a couple of years had some of our new   units with our new Uptime proposition, with the new quality, the   new design, the new driver centric kind of design philosophy we   add and every one of them had given us very positive   feedback.",
    "Now, in a handful of cases, they have -- in the course of two   years stepped up their percentage of our buy to where we are at   parity with the other brands that they buy for their fleet. In   other handful of cases, we are becoming the largest supplier to   them. And in another handful of cases, they're working themselves   off from under some longer term contracts, so we get a portion of   their buy that we would anticipate that we would gain over time.   Michael, call these customers as influencers, these are the   trucks that, their color, their badging, the freight they haul,   those are rolling billboards. Right. Because their endorsements   that, these are well-run truck companies that manage total cost   of operation that don't make these decisions lightly. I mean,   they're making them for the right reasons.",
    "And so I would tell you, on all 15 of those very key largest   kind of customers, we have made significant progress, some more   than others. I mean, this is just one of the things that gives us   tremendous encouragement for -- look, I don't -- I don't know   that some of these customers are going to buy 1,000 trucks next   year or they're going to buy 100 trucks next year. But, over 50%   in some of those customers, they're going to be our trucks and   last year, it was 50. And so, that's the kind of insight that we   have now.",
    "We'll take that 15, and we'll start expanding that for next   year, we'll take the next five, the next 10. And then we have a   very intensive sales process where we go in, we introduce   ourselves, talk about the value proposition and a good   business-to-business kind of sales process, so we're extremely   encouraged.",
    " Robert Wertheimer    --   Melius Research -- Analyst ",
    "Okay. Thanks. That's very informative. Thank you.",
    " Operator ",
    "Thank you. And our next question comes from Rob Salmon with   Wolfe Research. Your line is now open.",
    " Rob Salmon    --   Wolfe Research -- Analyst ",
    "Hey, good morning, guys. I guess kind of segueing on that   question. As you guys have been going into those larger kind of   high profile fleets. Could you give us a sense of any sort of   residual value guarantees that you guys have been doing earlier   in the conference call, you noted that you're seeing some   weakness on the used truck. So just curious how we should be   thinking about that piece of the business.",
    " Persio V. Lisboa    --   Executive Vice President and Chief Operating Officer ",
    "Alright. This is Persio. Every case is a case we used   traditionally don't have a lot of residual value guarantees, we   really manage to the fair market value of the units when they   have to go for a trade and customers understand that. I think the   good news is that the new products that we have not have been   really, now demonstrating that our residuals are going up and   they'll dramatically with all the new products that we've   launched. So this is not a practice for us to really work with,   residual value guarantees.",
    " Rob Salmon    --   Wolfe Research -- Analyst ",
    "Got it. Appreciate that commentary. It's helpful. So kind of   more of just the improvement in the underlying product driving   that incremental market share from your perspective.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Yes, and the confidence that the residual value will continue   to improve over the life cycle of the product.",
    " Rob Salmon    --   Wolfe Research -- Analyst ",
    "That makes sense. Could you speak more broadly about what you   guys are seeing from a used truck inventory as well as pricing   perspective we saw those kind of less than five year trucks,   particularly the four or five year in the month of July inflect   negatively looking at some industry data, but we'd love to get   your perspective of what you're seeing across your dealers from   both the price and inventory perspective?",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Inventories are going up because the strong new volume truck   sales that we've seen this year, our used truck inventories are   up as well in the third quarter when we expect to work those   lower in Q4. I think we alluded to the sleepers in particular   where there's some weakness in the pricing. And what is happening   right now is that, now in the past actually between first and   second quarter, I think it was taking longer for customers to   trade their units and now we are seeing a higher velocity on the   trade, so this is not taking as long, that's why I think is   happening in the industry as the inventories start going up,   that's one of the reasons why as new units get delivered, the old   ones are returned faster.",
    " Rob Salmon    --   Wolfe Research -- Analyst ",
    "That makes sense. And should we be contemplating, just as the   later model used truck inventories kind of rise and we see   additional pressure there, should we be contemplating softer   pricing as we look out to next year relative to what we've seen   this year?",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    "Well, I mean, I think, yes. I mean, we're already seeing the   softer pricing, I mean, I think, as we and the industry turn   those units, that support -- that also support pricing. Right.   So, -- the couple of things that affect used truck value. Right.   If you need a whole bunch of trucks, you tend to hold on your   used trucks a little bit longer while you're waiting for your new   ones, that phenomenon is reversing, that was what Persio was   describing.",
    "The second phenomenon is when the market starts to recover,   used trucks is the quick [Phonetic] way to add capacity to your   fleet and get -- and take advantage of rising freight rates. And   so look -- I mean, I think how we look at this, we're kind of in   a period of time where especially on the classic sleepers, we are   -- we as an industry are a little oversupplied and so there will   be pressure on those prices until that oversupply is resolved.   And I think that will take probably a couple of quarters to make   that happen.",
    " Rob Salmon    --   Wolfe Research -- Analyst ",
    "That makes sense. Appreciate the time, guys.",
    " Operator ",
    "Thank you. Ladies and gentlemen, this concludes our   question-and-answer session. I would now like to turn the call   back over to Troy Clarke for any closing remarks.",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    "Hey, thanks. In closing, Q3 was a great quarter for Navistar,   and I really want to thank our customers, our employees, our   dealers for helping us deliver these strong results, truth be   told, as we've indicated, it's no surprise the U.S. economy and   the trucking market is moderating. Our industry tends to run in   four year cycles, this isn't a surprise for us, we have been   preparing for this time.",
    "During our turnaround, we'd lowered the break even afforded   the company by implementing lean practices, reducing our cost   structure while growing market share and strengthening the   balance sheet. We are in a much better position today and we   remain firm in our belief that, it's no OEM has the potential to   increase volume, gain share, lower costs and create improved cash   flow like Navistar. And we plan to continue those improvements   into 2020, and this is why, I remain optimistic that 2020 will be   another good year for Navistar.",
    "We look forward to talking to you again at our Investor Day,   please reach out to the IR team for any additional questions or   details on those events. Thanks for your time and interest in our   company this morning.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 60 minutes ",
    " Martin Ketelaar    --   Vice President of Investor Relations ",
    " Troy Clarke    --   President, Chief Executive Officer and Chairman ",
    " Walter G. Borst    --   Executive Vice President and Chief Financial Officer ",
    " Persio V. Lisboa    --   Executive Vice President and Chief Operating Officer ",
    " Stephen Volkmann    --   Jefferies -- Analyst ",
    " Andy Casey    --   Wells Fargo -- Analyst ",
    " Neil Frohnapple    --   Buckingham Research -- Analyst ",
    " Ann Duignan    --   JP Morgan -- Analyst ",
    " Adam Uhlman    --   Cleveland Research -- Analyst ",
    " David Leiker    --   Baird -- Analyst ",
    " Brendan    --   RBC Capital Markets -- Analyst ",
    " Ben Burud    --   Goldman Sachs -- Analyst ",
    " Steven Fisher    --   UBS -- Analyst ",
    " Robert Wertheimer    --   Melius Research -- Analyst ",
    " Rob Salmon    --   Wolfe Research -- Analyst ",
    " More NAV analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than Navistar   International     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Navistar   International wasn't one of them! That's right --   they think these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:23:26"
}