{
  "url": "https://www.nasdaq.com/article/mutual-funds-vs-etfs-why-choose-one-when-you-can-use-both-cm1206486",
  "title": "Mutual Funds vs. ETFs: Why Choose One When You Can Use Both? - Nasdaq.com",
  "text": [
    "Both mutual funds and exchange-traded funds (ETFs) are designed to give investors great diversification. For example, instead of just investing in a few technology stocks, buying a technology stock mutual fund or ETF would allow you to own dozens or more than 100 technology stocks at the same time so you don't have all of your eggs in just a few technology stocks.",
    "Diversification is one of the best rules an investor can use to protect principal. The downturn of one company's stock doesn't affect your returns nearly as much if you have a diversified mutual fund or ETF.",
    "There is no shortage of arguments in the active-vs.-passive investment management debate, with brilliant minds arguing each side.",
    "Morningstar found that active U.S. stock funds succeeded nearly twice as often in down 36-month periods than up periods. The ability of fund managers to make proactive changes during volatile and down-trending times works well historically. In the 11th year of this bull market, downside protection makes a lot of sense for our retired clients.",
    "Regardless of the reasons, many investment professionals choose to believe in either active or passive investing strategies, but few seem to believe in both. However, when you dig into the characteristics of each, there are pros and cons worth exploring, which is why we use a combination of the two approaches for our clients.",
    "For the individual investor, one of the best ways to compare active and passive strategies is through mutual funds (often actively managed) and ETFs (often passive). By default, usually mutual funds are actively managed by a team of professional portfolios managers who decide which stocks to buy and sell within the fund. Those managers have to be compensated for managing the money, so mutual funds typically carry higher internal costs.",
    "Alternatively, ETFs often have very low expenses because they are usually passive. There really isn't a portfolio manager or investment professional behind the scenes making daily investment decisions as there is with mutual funds .",
    "Buying a mutual fund is like hiring someone to manage your money for you and buy and sell stocks within the fund on your behalf. Performance will largely be dependent on the fund manager's investment criteria and stock-picking acumen. Buying an ETF is like buying the entire S&P 500 index or another \"basket\" of stocks that rarely changes. Performance will be tied to the overall index itself and will not deviate, because the ETF is set up to own the exact stocks of the index it tracks and in the exact same quantities. ETFs can be tied to an index, a specific asset or basket of assets such as bonds, currencies, real estate, etc. The point is ETFs give you diversification within that index or asset type.",
    "While fees and \"behind-the-scenes\" investment activity are two key differences, each strategy comes with positive and negative attributes.",
    "In addition to having higher costs, mutual funds are often considered less tax-efficient than ETFs. Every time a mutual fund manager sells a stock within the fund at a gain, that gain is passed on to the investor, who in turn owes taxes on it. Comparatively , ETF investors typically only pay taxes on the gain between the price they paid for the ETF and the price they sold it for.",
    "While lower costs are a primary advantage, ETFs may not have the flexibility to take advantage of short-term stock price movements the way a mutual fund manager does. ETF holdings will remain the same regardless of short-term conditions, whereas a mutual fund manager can quickly sell one stock and replace it with a different one for strategic reasons. Or a mutual fund manager can have less stock exposure if they feel they should due to overall market conditions.",
    "Another primary difference is ETFs are bought and sold like a stock throughout the day, and mutual fund shares are purchased or sold only at the end of the trading day. While neither good nor bad in the grand scheme of things, the ability to buy and sell entire baskets of stocks throughout the day using ETFs can be appealing.",
    "Investing in mutual funds offers the chance at outperforming the stock market, especially during downturns, while most ETFs typically do not as they simply follow the index returns. At the same time, mutual funds can underperform the market, and generally ETFs will always perform the same as the index or \"market\" they are designed to track, less a small fee.",
    "Traditional mutual funds can carry higher expenses, as Investopedia research states that the average large cap mutual fund expense ratio is 1.25% per year. The mutual funds I prefer to use, when available, are institutional class , which have a minimum investment of $200,000 per fund and typically the lowest mutual fund fees. Our firm's strategic relationships with various investment providers and platforms often allow us to provide minimum thresholds significantly lower than the standard.",
    "ETFs are low cost and can be traded throughout the day. Mutual funds may come with higher fees (though much lower when using institutional class shares) but offer the ability to make strategic moves within the portfolio as well as the opportunity to outperform benchmarks during challenging times.",
    "The bottom line is ETFs and institutional mutual funds are both useful tools. Active stock mutual funds historically outperform ETFs in down markets, and in the 11th year of this bull market, we prefer to use a combination of the two strategies. We find this is an effective way to get our clients what they want: true diversification, generally very low internal fees and the ability to get returns with a level of risk the client is comfortable with.",
    "As a fiduciary, I have to act in the best interest of my clients, which means putting them in portfolios with the amount of risk that is appropriate and that they want to take. Since most of my clients are millionaire retirees who have a higher amount of wealth, protection of their principal is often their utmost concern at this time.",
    "Investment advisory services offered only by duly registered individuals through AE Wealth Management LLC (AEWM). AEWM and Stuart Estate Planning Wealth Advisors are not affiliated companies. Stuart Estate Planning Wealth Advisors is an independent financial services firm that creates retirement strategies using a variety of investment and insurance products. Neither the firm nor its representatives may give tax or legal advice. Investing involves risk, including the potential loss of principal. No investment strategy can guarantee a profit or protect against loss in periods of declining values. Past performance cannot predict future results. Any references to protection benefits or lifetime income generally refer to fixed insurance products, never securities or investment products. Insurance and annuity product guarantees are backed by the financial strength and claims-paying ability of the issuing insurance company. Any media logos and/or trademarks contained herein are the property of their respective owners and no endorsement by those owners of Craig Kirsner or Stuart Estate Planning Wealth Advisors is stated or implied. The information and opinions contained in this article are provided by third parties and have been obtained from sources believed to be reliable, but accuracy and completeness cannot be guaranteed. They are given for informational purposes only and are not a solicitation to buy or sell any of the products mentioned. The information is not intended to be used as the sole basis for financial decisions, nor should it be construed as advice designed to meet the particular needs of an individual's situation. 190170",
    "Comments are suppressed in compliance with industry guidelines. Click here to learn more and read more articles from the author.",
    "This article was written by and presents the views of our contributing adviser, not the Kiplinger editorial staff. You can check adviser records with the SEC or with FINRA .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-02 08:02:46"
}