{
  "url": "https://www.nasdaq.com/article/wall-street-bogged-down-by-weak-manufacturing-data-trade-worries-20190903-00966",
  "title": "Wall Street bogged down by weak manufacturing data, trade worries - Nasdaq.com",
  "text": [
    "By Uday Sampath Kumar",
    "Sept 3 (Reuters) - U.S. stocks fell on Tuesday as data showed factory activity shrank for the first time since 2016 in August, renewing fears that a drawn-out trade war between the United States and China could tip the world's largest economy into recession.",
    "The Institute for Supply Management said its index of national factory activity dropped to 49.1, compared with a reading of 51.1 estimated by analysts polled by Reuters.  ",
    "\"Sentiment was already poor to start the day and then the weaker-than-expected manufacturing data just added fuel to the fire,\" said Dave Mazza, managing director and head of product at asset management firm Direxion in New York.",
    "\"We now have confirmation that the escalation in the trade war has spilled over to U.S. manufacturing just as it has to manufacturing around the globe,\" he added.",
    "U.S. stocks started the day on weak footing as Washington and Beijing kicked off a new round of tariffs over the weekend, worrying investors who see no signs of an early resolution to the long-running trade war, which has rattled markets for months and weighed on world economies.",
    "Rising OPEC and Russian production, combined with demand concerns due to a global economic slowdown dragged down oil prices and drove a 1.3% drop in energy shares .",
    "Trade-sensitive industrials  slipped 1.8%, while technology stocks  fell 1.2%.",
    "Chipmakers, which have large revenue exposure to China, also fell. The Philadelphia Semiconductor index  dropped 2%.",
    "At 12:56 p.m. ET the Dow Jones Industrial Average  was down 355.99 points, or 1.35%, at 26,047.29, the S&P 500  was down 24.48 points, or 0.84%, at 2,901.98 and the Nasdaq Composite  was down 85.73 points, or 1.08%, at 7,877.15.",
    "Boeing Co shares , tumbled 3.2%, weighing the most on the Dow, after the Federal Aviation Administration said on Friday a global panel of experts will need a few more weeks to finish its review into the company's 737 MAX certification. ",
    "U.S. casino operators felt the brunt of slowing economic growth in China as gambling hub Macau posted weak August casino revenue. Shares of Wynn Resorts Ltd , Las Vegas Sands Corp  and MGM Resorts International  fell between 2% and 4.5%. ",
    "Investors will also keep a close watch on the monthly jobs report due on Friday, which is expected to offer clues on the likelihood of another rate cut from the Federal Reserve at its mid-September meeting.",
    "The disappointing manufacturing data is not out of sync with the market's expectation of a 25 basis point rate cut this month but weaker-than-expected non-manufacturing data may change the central bank's perspective on cutting rates further, Mazza said.",
    "Among few gainers were the defensive utilities , real estate  and consumer staples  sectors.",
    "Declining issues outnumbered advancers for a 1.94-to-1 ratio on the NYSE and for a 2.57-to-1 ratio on the Nasdaq.",
    "The S&P index recorded 36 new 52-week highs and nine new lows, while the Nasdaq recorded 42 new highs and 113 new lows."
  ],
  "published_datetime": "2019-09-03 13:33:00"
}