{
  "url": "https://www.nasdaq.com/article/top-us-trade-official-submits-usmca-ideas-to-democrats--lawmakers-20190911-00885",
  "title": "Top U.S. trade official submits USMCA ideas to Democrats - lawmakers - Nasdaq.com",
  "text": [
    "WASHINGTON, Sept 11 (Reuters) - The Trump administration on Wednesday sent U.S. House of Representatives Democrats its latest proposals for addressing legislators' concerns about the new U.S.-Mexico-Canada trade deal, lawmakers and congressional sources said.",
    "Democrats are reviewing the proposals, a spokeswoman for the House Ways and Means Committee said, without providing any details.",
    "The trade agreement, which leaders from the United States, Mexico and Canada signed in November, must be ratified by lawmakers in all three countries. Mexican lawmakers have already done so.",
    "Democrats, who control the House, said they would decide on next steps after reviewing the administration's response to the written recommendations they had submitted in July on how to strengthen the proposed trade pact. ",
    "\"We have paper back from USTR that's being reviewed and then we will move from there,\" Representative Rosa DeLauro said.",
    "President Donald Trump has urged Congress to approve the trade pact, known as USMCA, but Democrats have said they will only proceed when their concerns about enforcement of the labor and environmental provisions, and certain pharmaceutical issues, are addressed.",
    "In the past, Trump has threatened to pull out of NAFTA, which he sees as detrimental to American businesses and farmers.",
    "House Speaker Nancy Pelosi has repeatedly said that she wants to \"get to yes\" on the deal, but first needed revisions.",
    "Details of the Democrats' formal proposals and Lighthizer's response were not available.",
    "During Wednesday's discussions with Lighthizer, Representative Steve Scalise, the No. 2 House Republican, urged House approval of the USMCA before Canada's national elections, which are set for Oct. 21.",
    "Jordan Haas, director of trade policy for the Internet Association, said his group was upbeat that the two sides would reach agreement paving the way for passage of USMCA.",
    "\"We are pretty optimistic that the USMCA agreement will be passed. USTR has signaled that there are landing zones to address the Democrat's concerns, and they are working toward a deal,\" he said.",
    "The group and 10 others on Monday urged Congress to pass the trade agreement, but not to give the Trump administration the power to change thresholds for duty-free shipments into the United States. "
  ],
  "published_datetime": "2019-09-11 07:26:00"
}