{
  "url": "https://www.nasdaq.com/article/if-the-company-delivers-ibm-stock-has-a-rally-brewing-cm1206912",
  "title": "If the Company Delivers, IBM Stock Has a Rally Brewing - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "International Business Machines (NASDAQ: IBM ) has been a big, fat dud. Shares of Big Blue are down 8% in the past year, 15% in the past three years and 30% over the past five years. The performance of IBM stock is a major drag compared to big tech and the stock market overall.",
    "Rather than be in IBM as a contrarian play, investors could have sat in consensus picks. For instance, Apple (NASDAQ: AAPL ) and Alphabet (NASDAQ: GOOGL , NASDAQ: GOOG ) have doubled over the past five years. Microsoft (NASDAQ: MSFT ) has tripled, while Amazon (NASDAQ: AMZN ) is up five-fold.",
    "IBM may have had Buffett along for the ride for a while, but other than that, it severely lacked any positive catalysts. More than five straight years of quarterly revenue declines say as much. However, are the long-term charts starting to turn more bullish on International Business Machines stock?",
    "Some may say yes. Let's take a look.",
    "\r\n Click to Enlarge",
    "Above is a long-term weekly chart of the IBM stock price. One can see that, short of a few spikes and plunges, IBM has mostly gone nowhere over the past few years. In fact, it has trickled lower, as a series of lower highs has pressured the share price.",
    "However, while that downtrend line is technically still in place because IBM is below it, note that the stock did push above it earlier this year. Only once the volatility in August picked up did IBM stock fall back below it.",
    "The preceding price action is important though because IBM made a higher low from its May/June lows. That also came amid intensifying trade talks, just as the August spill did.",
    "Now though, IBM stock price is putting together an uptrend, as well as holding its 50-week moving average. Coiling just below its 200-week moving average, the stock is pressing above it in Friday's trading session.",
    "\r\n Click to Enlarge",
    "In the short-term, a move to $139 could be in the cards. That's where IBM stock will find its 50-day moving average, as shown on the daily chart above. Over that mark puts IBM above its major moving averages, both daily and weekly, as well as weekly downtrend resistance.",
    "That opens the door to its 2019 highs near $151. Also worth mentioning is that while IBM stock has struggled over the past 12 months, it's actually up 19.5% so far on the year. That's not all that far from the 22% gain the PowerShares QQQ ETF (NASDAQ: QQQ ) has logged so far in 2019.",
    "So perhaps IBM stock has a bit more momentum than investors tend to give it credit for.",
    "The problem with International Business Machines stock has not been the valuation. Instead, it's been growth.",
    "While Amazon, Microsoft and Alphabet continue to generate a huge presence in the cloud, IBM has been relatively quiet. That's not to say it has no presence in the cloud space (because it most certainly does). But it missed a huge opportunity to emulate what has become key growth pillars for top mega-cap tech stocks.",
    "Acquiring Red Hat does help, but it came at a price of $34 billion. That's not a cheap figure and one could argue that for such a price, IBM could have acquired other companies with better growth. Remember, IBM has a market cap of \"just\" $120 billion.",
    "Either way, growth is still hurting. Analysts forecast a 2.1% decline in revenue for 2019. This goes alongside estimates calling for a 7.1% dip in earnings to $12.81 per share. Should IBM report in-line results, it leaves shares trading at about 10.5 times current earnings. At that price, it's not exactly expensive, particularly with a ~5% dividend yield to boot .",
    "If the technicals start to work out and if IBM can actually deliver, the stock could be setting up for a long-awaited rally .",
    "Estimates call for revenue to grow a whopping 4.1% next year and for earnings to explode higher by 4.8%. All jest aside, a return to mid-single-digit growth, a strong dividend and low valuation could certainly attract buyers. Let's see if the charts will confirm the change in sentiment going forward.",
    "Bret Kenwell is the manager and author of Future Blue Chips and is on Twitter @BretKenwell . As of this writing, Bret Kenwell was long AAPL, MSFT and AMZN.",
    "The post If the Company Delivers, IBM Stock Has a Rally Brewing appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:33:29"
}