{
  "url": "https://www.nasdaq.com/article/why-ardelyx-is-soaring-today-cm1206887",
  "title": "Why Ardelyx Is Soaring Today - Nasdaq.com",
  "text": [
    "After upbeat results from a Phase 3 trial, shares of Ardelyx (NASDAQ: ARDX) , a clinical-stage biotech focused on cardiorenal disease, rose as much as 23% in early-morning trading on Tuesday. Shares were up about 16% as of 10:37 a.m. EDT.",
    "Ardelyx reported positive results from its Phase 3 AMPLIFY study today. This trial was designed to test its experimental drug tenapanor in combination with phosphate binders as a hopeful treatment for patients with chronic kidney disease who are on dialysis.",
    "Here are the key takeaways from the study:",
    "Image source: Getty Images.",
    "Ardelyx's CEO Mike Raab was happy with the results:",
    "We are thrilled with the positive results from the AMPLIFY study demonstrating that tenapanor can help significantly more patients achieve the established serum phosphorus treatment goal of less than 5.5 mg/dL. This result is striking as serum phosphorus levels above 5.5 mg/dL are associated with increased mortality. For too long, hyperphosphatemia management has been an enormous challenge for patients and clinicians. With tenapanor, patients may finally be able to achieve their treatment goal.",
    "Traders are bidding up the stock in response to the encouraging clinical results.",
    "Ardelyx is currently running another Phase 3 study called PHREEDOM that is testing tenapanor as a monotherapy. The company expects to share results from that trial in the fourth quarter. Once the PHREEDOM trial is complete, management plans to submit tenapanor for regulatory approval in monotherapy and combination therapy for the treatment of hyperphosphatemia.",
    "Investing in biotech stocks can be risky, especially when the company is still in the clinical stage. However, Ardelyx could be on the cusp of becoming a commercial business, because tenapanor is currently pending FDA approval as a potential treatment for irritable bowel syndrome with constipation . A go/no go decision is expected to be handed down by Sept. 12, 2019, so investors won't have to wait long to learn more.",
    "The back half of 2019 should be an exciting time for Ardelyx's investors. This Fool plans on following this company's progress with great interest.",
    "10 stocks we like better than Ardelyx\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Ardelyx wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Brian Feroldi has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:56:00"
}