{
  "url": "https://www.nasdaq.com/article/stock-market-news-baker-hughes-gets-its-independence-peloton-sets-its-ipo-range-cm1210579",
  "title": "Stock Market News: Baker Hughes Gets Its Independence; Peloton Sets Its IPO Range - Nasdaq.com",
  "text": [
    " Wednesday morning saw nice advances for most stock market   indexes. Market participants responded favorably to news that the   Chinese government might choose to lift its tariffs from certain   types of products exported from the U.S. In addition, tepid   inflation data seemed to give the Federal Reserve more latitude   to cut interest rates as soon as next week. As of 11:30 a.m. EDT,   the   Dow Jones Industrial Average    (DJINDICES: ^DJI) was up 89 points to 26,998. The   S&P 500    (SNPINDEX: ^GSPC) was up 11 points to 2,990, and the   Nasdaq Composite    (NASDAQINDEX: ^IXIC) had gained 57 points to 8,141. Among individual companies,   General Electric    (NYSE: GE) grabbed the attention of investors by announcing that   it would sell a large portion of its stake in oilfield services   giant   Baker Hughes    (NYSE: BHGE) . Meanwhile, exercise equipment specialist Peloton   came a step closer to going public, announcing its anticipated   pricing range on its coming IPO. GE makes a big sale Shares  of General Electric rose by 1.5% Wednesday   morning after the industrial conglomerate revealed its plan to   reduce its position in Baker Hughes. After the market closed   Tuesday, Baker Hughes announced a secondary offering of 105   million shares owned by various GE entities, with the typical   underwriter option to purchase an additional 15.75 million Baker   Hughes shares from GE.makeArticleAd();   Image source: Baker Hughes.  The move will have a dramatic impact on Baker Hughes' internal   operations. The sale will cut GE's total stake in Baker Hughes   below 50%. As such, it will cede majority control of the oilfield   services company, and the number of board directors it's allowed   to designate will fall from five to three. However, Baker Hughes   anticipates allowing all five of GE's current designees to   continue to serve. For investors, the sale is bittersweet. GE's purchase of Baker   Hughes produced some   clear advantages    for the companies, including cost savings and efficiency gains.   Yet General Electric has been going through an extended period of   difficulties, dealing with challenges on multiple fronts. The   anticipated cash proceeds from the offering, which could approach   $2.9 billion even after Wednesday morning's 3% drop in Baker   Hughes stock, could help the conglomerate restructure its   operations and turn its business around. Meanwhile, Baker Hughes   management will have greater freedom to pursue its own agenda   while still making the most of a close collaboration with General   Electric. Peloton hits the track Late Tuesday, Peloton updated its filings with the U.S.   Securities and Exchange Commission, saying that it anticipates an   offering price of between $26 and $29 per share when it goes   public. Given that price range, the maker of interactive exercise   cycles and treadmills will be able to raise roughly $1.2 billion   in IPO proceeds. With the company offering about 15% of its   equity in an initial public offering, shares valued at the upper   end of that range would put an $8 billion market cap on the   company. Investors have been curious to see   how Peloton intends to grow its business    . Currently, the company's equipment carries high price tags of   roughly $2,000 to $4,000, and owners also have to pay monthly   membership fees to gain access to the interconnected exercise   classes that distinguish Peloton's exercise equipment from its   rivals' offerings. It's a business model that focuses on   upper-income customers, and would-be shareholders will want to   know how Peloton intends to scale up its business and broaden its   target market. Like many companies that have gone public recently, Peloton is   experiencing both substantial sales growth and large bottom-line   losses. Hype about the fitness equipment innovator will likely   drive investor interest in the offering, but in the long run,   Peloton will have to find a clearer path if it wants to remain a   high-growth powerhouse.    10 stocks we like better than General Electric       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and General Electric wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Dan Caplinger      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Wednesday morning saw nice advances for most stock market   indexes. Market participants responded favorably to news that the   Chinese government might choose to lift its tariffs from certain   types of products exported from the U.S. In addition, tepid   inflation data seemed to give the Federal Reserve more latitude   to cut interest rates as soon as next week. As of 11:30 a.m. EDT,   the   Dow Jones Industrial Average    (DJINDICES: ^DJI) was up 89 points to 26,998. The   S&P 500    (SNPINDEX: ^GSPC) was up 11 points to 2,990, and the   Nasdaq Composite    (NASDAQINDEX: ^IXIC) had gained 57 points to 8,141.",
    "Among individual companies,   General Electric    (NYSE: GE) grabbed the attention of investors by announcing that   it would sell a large portion of its stake in oilfield services   giant   Baker Hughes    (NYSE: BHGE) . Meanwhile, exercise equipment specialist Peloton   came a step closer to going public, announcing its anticipated   pricing range on its coming IPO.",
    "Shares  of General Electric rose by 1.5% Wednesday   morning after the industrial conglomerate revealed its plan to   reduce its position in Baker Hughes. After the market closed   Tuesday, Baker Hughes announced a secondary offering of 105   million shares owned by various GE entities, with the typical   underwriter option to purchase an additional 15.75 million Baker   Hughes shares from GE.",
    "  Image source: Baker Hughes. ",
    "Image source: Baker Hughes.",
    "The move will have a dramatic impact on Baker Hughes' internal   operations. The sale will cut GE's total stake in Baker Hughes   below 50%. As such, it will cede majority control of the oilfield   services company, and the number of board directors it's allowed   to designate will fall from five to three. However, Baker Hughes   anticipates allowing all five of GE's current designees to   continue to serve.",
    "For investors, the sale is bittersweet. GE's purchase of Baker   Hughes produced some   clear advantages    for the companies, including cost savings and efficiency gains.   Yet General Electric has been going through an extended period of   difficulties, dealing with challenges on multiple fronts. The   anticipated cash proceeds from the offering, which could approach   $2.9 billion even after Wednesday morning's 3% drop in Baker   Hughes stock, could help the conglomerate restructure its   operations and turn its business around. Meanwhile, Baker Hughes   management will have greater freedom to pursue its own agenda   while still making the most of a close collaboration with General   Electric.",
    "Late Tuesday, Peloton updated its filings with the U.S.   Securities and Exchange Commission, saying that it anticipates an   offering price of between $26 and $29 per share when it goes   public.",
    "Given that price range, the maker of interactive exercise   cycles and treadmills will be able to raise roughly $1.2 billion   in IPO proceeds. With the company offering about 15% of its   equity in an initial public offering, shares valued at the upper   end of that range would put an $8 billion market cap on the   company.",
    "Investors have been curious to see   how Peloton intends to grow its business    . Currently, the company's equipment carries high price tags of   roughly $2,000 to $4,000, and owners also have to pay monthly   membership fees to gain access to the interconnected exercise   classes that distinguish Peloton's exercise equipment from its   rivals' offerings. It's a business model that focuses on   upper-income customers, and would-be shareholders will want to   know how Peloton intends to scale up its business and broaden its   target market.",
    "Like many companies that have gone public recently, Peloton is   experiencing both substantial sales growth and large bottom-line   losses. Hype about the fitness equipment innovator will likely   drive investor interest in the offering, but in the long run,   Peloton will have to find a clearer path if it wants to remain a   high-growth powerhouse. ",
    "  10 stocks we like better than General Electric       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and General Electric wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than General Electric       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and General Electric wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Dan Caplinger      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:40:00"
}