{
  "url": "https://www.nasdaq.com/article/endo-gains-fda-nod-for-orfadin-generic-to-treat-rare-disease-cm1208145",
  "title": "Endo Gains FDA Nod for Orfadin Generic to Treat Rare Disease - Nasdaq.com",
  "text": [
    "Endo International plcENDP announced that Novitium Pharma, LLC, a partner of its subsidiary Endo Ventures Limited, secured an approval from the FDA for a room temperature stable, AB-rated, generic equivalent of Swedish Orphan Biovitrum's Orfadin (nitisinone capsules).",
    "These capsules are indicated for the treatment of adult and pediatric patients with hereditary tyrosinemia type 1 (HT-1) in combination with dietary restriction of tyrosine and phenylalanine. Global sales for Orfadin were approximately $85M over the last four quarters.",
    "Par Pharmaceutical, Inc., Endo's operating company, expects to distribute the product through specialty pharmacies beginning this month. HT-1 affects at least 1 in 100,000 patients worldwide with approximately 150 patients alone in the United States.",
    "Earlier in the week, Par Pharmaceutical began shipping an authorized generic version of Merck's MRK Noxafil delayed-release tablets, 100 mg.  The shipping was started after Endo Ventures Limited entered into an exclusive U.S. supply and distribution agreement with a unit of Merck & Co., Inc., of Kenilworth, NJ, thereby allowing Par to launch and distribute an authorized generic version of the product. ",
    "These new launches will boost Endo's dwindling business. Meanwhile, generics base business plummeted significantly due to the loss of marketing exclusivity of a few products. Moreover, the business line is facing competitive pressures. Product discontinuances and pricing pressure from an increased competition impacted the same.",
    "Notably, Endo has been in news of late due to the ongoing opioid litigation cases. Last month, the company reached a settlement in principle with the County of Cuyahoga, Ohio, the County of Summit, Ohio and specific persons in connection with the pending lawsuits at various U.S. District cases. The settlement will resolve the Track 1 Cases regarding claims related to the manufacturing, marketing, distribution, supply, sale, prescribing, use and/or abuse of branded and generic opioid medications. The cases are scheduled to go under trial in October 2019.",
    "Per the settlement terms, Endo will pay a total sum of $10 million and provide up to $1 million of Vasostrict and Adrenalin products free of charge. While the company still has many pending litigations related to opioid drugs, investors seem upbeat about the settlement terms of these cases.  The settlement relieves Endo of a major hangover, giving its investors some respite. Notably, shares of the company have slumped 66.6% in the year so far against the industry 's 6.1% growth.",
    "Last week, Johnson & Johnson JNJ received an unfavorable ruling in the court case filed by the state authorities of Oklahoma pertaining to the abuse of its opioid-based drugs, namely Duragesic, Nucynta and Nucynta ER. The Cleveland County District Court has ordered the company to pay $572 million to the state.  Allergan AGN too has settled with two counties of Ohio for almost $5 million, thereby resolving all claims against itself in relation to the federal multidistrict litigation for opioid drug abuse scheduled in October.",
    "Endo currently carries a Zacks Rank #3 (Hold). You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here .",
    "It's Illegal in 42 States, But Investors Will Make Billions Legally",
    "In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    "That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:35:00"
}