{
  "url": "https://www.nasdaq.com/article/ebola-survivors-face-kidney-problems-and-risk-of-premature-death-20190904-01201",
  "title": "Ebola survivors face kidney problems and risk of premature death - Nasdaq.com",
  "text": [
    "By Kate Kelland",
    "LONDON, Sept 4 (Reuters) - People who survive Ebola virus infection face a dramatically higher risk of dying - probably from severe kidney damage - within a year of leaving hospital, according to a study of survivors of an epidemic in Guinea.",
    "Researchers who followed more than 1,100 survivors of the Ebola virus outbreak - which swept through West Africa in the world's largest epidemic from 2013 to 2016 - found their mortality rates a year after discharge from hospital were up to five times higher than expected in general Guinean population.",
    "The findings show an urgent need for more investigation of the long-term effects of Ebola infection, the researchers said, especially since the number of Ebola survivors has risen significantly with two large epidemics in the past five years.",
    "A continuing outbreak of Ebola in Democratic Republic of Congo has become the world's second largest in history since it began in August 2018. It has spread to infect almost 3,000 people in Congo so far, killing two-thirds of them. ",
    "In the survivor study, published on Wednesday in the Lancet Infectious Diseases, scientists led by Ibrahima Socé Fall, an emergency response expert at the World Health Organization, followed 1,130 Guinean survivors of the 2013-16 outbreak.",
    "Over a follow-up period of an average of 22 months, 59 deaths were reported, of which 37 were tentatively attributed to renal failure based on reports by family members of the symptoms suffered by their dead loved one, the researchers said.",
    "It was not possible to give the exact cause or date of death for many patients, they said, since there were few medical documents or autopsies available. Case studies of patients with Ebola, however, have found that the virus can be detected in urine - showing it can infect the kidney - and that some patients with Ebola develop acute kidney injury.",
    "\"Although cause of death evidence was weak for most patients, renal failure is a biologically plausible cause of death in survivors of Ebola virus disease,\" said Mory Keita, a medical doctor and epidemiologist from Guinea who is now working with the WHO to help control the Congo Ebola outbreak.",
    "Judith Glynn of the London School of Hygiene & Tropical Medicine, who also worked on the research team, said the findings should help emergency response experts focus resources towards higher-risk groups. \"Those hospitalised with Ebola for longer may be at greater risk, and could be specifically targeted,\" she said.",
    "The 2013-2016 Ebola outbreak in West Africa was the largest and deadliest ever, killing more than 11,300 people of the 28,000 who were infected."
  ],
  "published_datetime": "2019-09-04 06:30:00"
}