{
  "url": "https://www.nasdaq.com/article/gold-slides-2-silver-sheds-4-on-trade-optimism-strong-us-data-20190905-00836",
  "title": "Gold slides 2%, silver sheds 4% on trade optimism, strong U.S. data - Nasdaq.com",
  "text": [
    "By Asha Sistla and Arpan Varghese",
    "Sept 5 (Reuters) - Gold slumped more than 2% and silver fell over 4% on Thursday as stronger-than-expected U.S. economic data and hopes of a thaw in the U.S.-China trade war boosted Treasury yields and soothed fears of an economic slowdown, driving riskier assets higher.",
    "Spot gold  fell 2.3% to $1,517.20 per ounce at 1:47 p.m. EDT (1747 GMT) and silver  fell 4.2% to $18.74 per ounce, after earlier dipping as low as $1,509.03 and $18.48, respectively. Both precious metals were set for their worst daily percentage decline in more than 2-1/2 years.",
    "Platinum  also declined about 2.3% to $963 per ounce, after touching a low for the day at $940.50.",
    "Data showing U.S. private employers' payrolls rose and the growth of the U.S. services sector accelerated in August boosted stock markets, which were already buoyed by positive signs on U.S.-China trade.  MKTS/GLOB",
    "\"The gold market trading at highs was ambushed by strong U.S. data from ADP to ISM; the data also savaged a frothy bond market, which helped drive the slide in gold,\" said Tai Wong, head of base and precious metals derivatives trading at BMO.",
    "Driving hopes of a thaw in the protracted dispute between the world's two largest economies, China'sCommerce Ministry confirmed high-level trade discussions with the United States set for early October. ",
    "\"The risk sentiment that was sparked by the ebbing trade situation is leading gold market participants to take some of their bets off,\" said Daniel Ghali, commodity strategist at TD Securities.",
    "The changes in gold and Treasury yields are both symptoms of the same economic circumstances, Ghali said. \"The longer yields are rising because growth expectations are.\"",
    "Treasury yields jumped on the positive developments on U.S.-China trade as well as the strong U.S. data. US/",
    "Investors will now turn their attention to the U.S. nonfarm payrolls data on Friday for further clarity on the health of the U.S. economy.",
    "With additional positive payrolls data, \"you could see a further retreat from bonds and gold,\" BMO's Wong said.",
    "\"But barring a stunning trade resolution it remains a bullish bond market in the U.S. due in large part to the fact that yields in the rest of the developed world are practically non-existent. Gold might correct but the overall positive outlook will remain,\" Wong added.",
    "Palladium  was the sole gainer, rising 0.6% to $1,562.93 per ounce, having hit its highest level in more than 1-1/2 months at $1,567.68 earlier in the session."
  ],
  "published_datetime": "2019-09-05 12:22:00"
}