{
  "url": "https://www.nasdaq.com/article/etfs-to-gain-from-the-booming-genomics-market-cm1207506",
  "title": "ETFs to Gain From the Booming Genomics Market - Nasdaq.com",
  "text": [
    " Developments in genomics have been rapidly altering the healthcare landscape by decoding the mysteries behind the function, structure, evolution, editing and mapping of genomes  . Accordingly, growing demand for personalized medicine, solid investments and higher R&D activities  will soon make genomics the next big thing in the investing space. In fact,  going by a MarketsandMarkets report  , the $18.9-billion global genomics market is expected to reach $35.7 billion by 2024 at a CAGR of 13.5%. The report further states that North America accounted for the largest share of the global genomics market in 2018.  What's Favouring the Genomic Testing Space?  The global genomics market has been  favored by a streak of solid developments   in sequencing, microarray, PCR (Polymerase Chain Reaction), Nucleic acid extraction and Purification techniques. Further, the implications of AI, cloud-based technologies and increased R&D focus have lent a competitive edge to the companies with significant exposure to genomics. Accordingly, the genomics market is seeing  decreasing sequencing costs and widening genomics-based applications. The genomics market  is also seeing a  ramp-up in government spending   with a huge number of start-ups entering the market.  Partnerships between research institutes and companies   are also opening up new growth opportunities  in the global genomics market. In March 2019, Illumina ILMN collaborated  with the Lundbeck Foundation GeoGenetics Centre at the University of Copenhagen to study the relationship between the evolutionary history of certain mental and neurological disorders and infectious pathogens.  Tremendous progress is being observed within the  gene editing space as well   . CRISPR  (Clustered Regularly Interspaced Short Palindromic Repeats)/Cas9 gene editing is now being tested in early clinical trials for certain disorders like sickle cell disease, cystic fibrosis and Huntington's disease. This development is taking place after six years of CRISPR technique's first application to animals  . However, a new advanced technique addressing the shortcomings of existing gene-editing platforms  - SATI  (intercellular linearized Single homology Arm donor mediated intron-Targeting Integration) - has been developed by the scientists at the Salk Institute.  ETFs to Gain From the Momentum  The above-mentioned trends have been benefiting genomics ETFs. Here we highlight a host of ETFs that investors can keep tabs on:  ARK Genomic Revolution Multi-Sector ETF  ARKG  This is an actively managed ETF focusing on the companies likely to benefit from the extension and enhancement of the quality of human and other life by incorporating technological and scientific developments plus improvements and advancements in genomics into their business. The fund holds 39 stocks in its basket and has 0.75% in expense ratio. It has accumulated $428.1 million in its asset base (read:  5 Sector ETFs That Beat the Market in the First Half  ).  Invesco Dynamic Biotechnology & Genome ETF PBE  This fund follows the Dynamic Biotech & Genome Intellidex Index. The index comprises companies that are majorly engaged in the research, development, manufacturing and marketing plus distribution of various biotechnological products, services and processes and companies that gain significantly from scientific and technological advances in biotechnology and genetic engineering and research. The fund holds 29 stocks in its basket. It has managed $230 million in its asset base. Expense ratio comes in at 0.59% (read: Amgen to Buy Celgene's Otezla: 5 ETF Drugs  ).  Global X Genomics & Biotechnology ETF GNOM  This is a new entrant in the space having accumulated $15.1 million since its inception on Apr 5, 2019. It seeks to invest in companies that potentially stand to benefit from further advancements in the field of genomic science, such as companies involved in gene editing, genomic sequencing, genetic medicine/therapy, computational genomics and biotechnology. The product follows the Solactive Genomics Index, charging 68 bps in annual fees. It holds 41 stocks in its basket (read: Best June for Stocks in Decades: 5 Best ETFs  ).  iShares Genomics Immunology and Healthcare ETF IDNA  This is another new entrant, which was launched in June 2019. Tracking the NYSE FactSet Global Genomics and Immuno Biopharma Index, the fund provides exposure to developed and emerging market companies that could gain from long-term growth and innovation in genomics, immunology and bioengineering. Holding a basket of 44 securities, the fund has an AUM of $23.2 million. It charges a fee of 47 basis points.   Want key ETF info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.  Get it free >>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Invesco Dynamic Biotechnology & Genome ETF (PBE): ETF Research Reports   Illumina, Inc. (ILMN): Free Stock Analysis Report   ISHR-GEN IMM HC (IDNA): ETF Research Reports   Global X Genomics & Biotechnology ETF (GNOM): ETF Research Reports   ARK Genomic Revolution ETF (ARKG): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    "Developments in genomics have been rapidly altering the healthcare landscape by decoding the mysteries behind the function, structure, evolution, editing and mapping of genomes  . Accordingly, growing demand for personalized medicine, solid investments and higher R&D activities  will soon make genomics the next big thing in the investing space.",
    "In fact,  going by a MarketsandMarkets report  , the $18.9-billion global genomics market is expected to reach $35.7 billion by 2024 at a CAGR of 13.5%. The report further states that North America accounted for the largest share of the global genomics market in 2018.",
    " What's Favouring the Genomic Testing Space? ",
    "The global genomics market has been  favored by a streak of solid developments   in sequencing, microarray, PCR (Polymerase Chain Reaction), Nucleic acid extraction and Purification techniques. Further, the implications of AI, cloud-based technologies and increased R&D focus have lent a competitive edge to the companies with significant exposure to genomics. Accordingly, the genomics market is seeing  decreasing sequencing costs and widening genomics-based applications.",
    "The genomics market  is also seeing a  ramp-up in government spending   with a huge number of start-ups entering the market.  Partnerships between research institutes and companies   are also opening up new growth opportunities  in the global genomics market. In March 2019, Illumina ILMN collaborated  with the Lundbeck Foundation GeoGenetics Centre at the University of Copenhagen to study the relationship between the evolutionary history of certain mental and neurological disorders and infectious pathogens. ",
    "Tremendous progress is being observed within the  gene editing space as well   . CRISPR  (Clustered Regularly Interspaced Short Palindromic Repeats)/Cas9 gene editing is now being tested in early clinical trials for certain disorders like sickle cell disease, cystic fibrosis and Huntington's disease. This development is taking place after six years of CRISPR technique's first application to animals  . However, a new advanced technique addressing the shortcomings of existing gene-editing platforms  - SATI  (intercellular linearized Single homology Arm donor mediated intron-Targeting Integration) - has been developed by the scientists at the Salk Institute.",
    " ETFs to Gain From the Momentum ",
    "The above-mentioned trends have been benefiting genomics ETFs. Here we highlight a host of ETFs that investors can keep tabs on:",
    " ARK Genomic Revolution Multi-Sector ETF  ARKG ",
    "This is an actively managed ETF focusing on the companies likely to benefit from the extension and enhancement of the quality of human and other life by incorporating technological and scientific developments plus improvements and advancements in genomics into their business. The fund holds 39 stocks in its basket and has 0.75% in expense ratio. It has accumulated $428.1 million in its asset base (read:  5 Sector ETFs That Beat the Market in the First Half  ).",
    " Invesco Dynamic Biotechnology & Genome ETF PBE ",
    "This fund follows the Dynamic Biotech & Genome Intellidex Index. The index comprises companies that are majorly engaged in the research, development, manufacturing and marketing plus distribution of various biotechnological products, services and processes and companies that gain significantly from scientific and technological advances in biotechnology and genetic engineering and research. The fund holds 29 stocks in its basket. It has managed $230 million in its asset base. Expense ratio comes in at 0.59% (read: Amgen to Buy Celgene's Otezla: 5 ETF Drugs  ).",
    " Global X Genomics & Biotechnology ETF GNOM ",
    "This is a new entrant in the space having accumulated $15.1 million since its inception on Apr 5, 2019. It seeks to invest in companies that potentially stand to benefit from further advancements in the field of genomic science, such as companies involved in gene editing, genomic sequencing, genetic medicine/therapy, computational genomics and biotechnology. The product follows the Solactive Genomics Index, charging 68 bps in annual fees. It holds 41 stocks in its basket (read: Best June for Stocks in Decades: 5 Best ETFs  ).",
    " iShares Genomics Immunology and Healthcare ETF IDNA ",
    "This is another new entrant, which was launched in June 2019. Tracking the NYSE FactSet Global Genomics and Immuno Biopharma Index, the fund provides exposure to developed and emerging market companies that could gain from long-term growth and innovation in genomics, immunology and bioengineering. Holding a basket of 44 securities, the fund has an AUM of $23.2 million. It charges a fee of 47 basis points. ",
    " Want key ETF info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.  Get it free >> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 03:18:00"
}