{
  "url": "https://www.nasdaq.com/article/is-barrick-gold-gold-stock-outpacing-its-basic-materials-peers-this-year-cm1207173",
  "title": "Is Barrick Gold (GOLD) Stock Outpacing Its Basic Materials Peers This Year? - Nasdaq.com",
  "text": [
    " The Basic Materials group has plenty of great stocks, but investors should always be looking for companies that are outperforming their peers. Barrick Gold (GOLD) is a stock that can certainly grab the attention of many investors, but do its recent returns compare favorably to the sector as a whole? A quick glance at the company's year-to-date performance in comparison to the rest of the Basic Materials sector should help us answer this question. Barrick Gold is a member of our Basic Materials group, which includes 248 different companies and currently sits at #13 in the Zacks Sector Rank. The Zacks Sector Rank gauges the strength of our 16 individual sector groups by measuring the average Zacks Rank of the individual stocks within the groups. The Zacks Rank is a proven model that highlights a variety of stocks with the right characteristics to outperform the market over the next one to three months. The system emphasizes earnings estimate revisions and favors companies with improving earnings outlooks. GOLD is currently sporting a Zacks Rank of #2 (Buy). The Zacks Consensus Estimate for GOLD's full-year earnings has moved 39.44% higher within the past quarter. This is a sign of improving analyst sentiment and a positive earnings outlook trend. Based on the most recent data, GOLD has returned 43.43% so far this year. In comparison, Basic Materials companies have returned an average of 4.93%. As we can see, Barrick Gold is performing better than its sector in the calendar year. To break things down more, GOLD belongs to the Mining - Gold industry, a group that includes 32 individual companies and currently sits at #9 in the Zacks Industry Rank. This group has gained an average of 54.47% so far this year, so GOLD is slightly underperforming its industry in this area. Investors in the Basic Materials sector will want to keep a close eye on GOLD as it attempts to continue its solid performance.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Barrick Gold Corporation (GOLD): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "The Basic Materials group has plenty of great stocks, but investors should always be looking for companies that are outperforming their peers. Barrick Gold (GOLD) is a stock that can certainly grab the attention of many investors, but do its recent returns compare favorably to the sector as a whole? A quick glance at the company's year-to-date performance in comparison to the rest of the Basic Materials sector should help us answer this question.",
    "Barrick Gold is a member of our Basic Materials group, which includes 248 different companies and currently sits at #13 in the Zacks Sector Rank. The Zacks Sector Rank gauges the strength of our 16 individual sector groups by measuring the average Zacks Rank of the individual stocks within the groups.",
    "The Zacks Rank is a proven model that highlights a variety of stocks with the right characteristics to outperform the market over the next one to three months. The system emphasizes earnings estimate revisions and favors companies with improving earnings outlooks. GOLD is currently sporting a Zacks Rank of #2 (Buy).",
    "The Zacks Consensus Estimate for GOLD's full-year earnings has moved 39.44% higher within the past quarter. This is a sign of improving analyst sentiment and a positive earnings outlook trend.",
    "Based on the most recent data, GOLD has returned 43.43% so far this year. In comparison, Basic Materials companies have returned an average of 4.93%. As we can see, Barrick Gold is performing better than its sector in the calendar year.",
    "To break things down more, GOLD belongs to the Mining - Gold industry, a group that includes 32 individual companies and currently sits at #9 in the Zacks Industry Rank. This group has gained an average of 54.47% so far this year, so GOLD is slightly underperforming its industry in this area.",
    "Investors in the Basic Materials sector will want to keep a close eye on GOLD as it attempts to continue its solid performance.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:12"
}