{
  "url": "https://www.nasdaq.com/article/preciousgold-slips-as-chinaus-trade-talk-hopes-lift-risk-appetite-20190905-00001",
  "title": "PRECIOUS-Gold slips as China-U.S. trade talk hopes lift risk appetite - Nasdaq.com",
  "text": [
    "    * Gold slips after three straight sessions of gains ",
    "* Platinum hits 1-1/2 year peak of $990.37/oz",
    "* China, U.S. to hold high-level trade talks in Oct (Adds comments, updates prices)",
    "Sept 5 (Reuters) - Gold prices dropped on Thursday asrisk-on sentiment got a boost after China and the United Statesagreed to hold talks to end their protracted trade dispute. ",
    "Spot gold XAU= fell 0.5% to $1,545.37 per ounce as of 0327GMT, set to snap a three-day gaining streak. Prices touched$1,557 on Wednesday, their highest since April 2013.",
    "U.S. gold futures GCcv1 dropped 0.4% to $1,554.00 perounce.",
    "China'sCommerce Ministry said its trade team will holdtalks with U.S. counterparts in mid-September in preparation forhigh-level negotiations in early October. urn:newsml:reuters.com:*:nL3N25W0JF",
    "Gold has jumped about 23% this year as the bruising tradewar between the world's two largest economies has sparked fearsof a global economic slowdown and led to monetary easing bymajor central banks around the world.",
    " The news is \"driving everything at the moment\", said OANDAanalyst Jeffrey Halley. ",
    "\"Gold will remain under pressure, because trade tensionshave been the elephant in the room. Any sign there is a thawingin that situation is going to see a rotation out of gold andinto growth-orientated assets.\"",
    "Also encouraging risk sentiment was the withdrawal of anextradition bill that had triggered months of often violentprotests in Hong Kong and an easing of Brexit- relateduncertainties. urn:newsml:reuters.com:*:nL3N25V0NCurn:newsml:reuters.com:*:nL5N25V2FD",
    "Bullion is seen as a safe-haven during times of politicaland economic uncertainty.",
    "MSCI's broadest index of Asia-Pacific shares outside Japan.MIAPJ0000PUS was up 0.24%. U.S. Treasury yields extendedgains in Asia and the yield curve steepened, signs thatinvestors were willing to take on riskier assets. MKTS/GLOBUS/",
    "\"Gold is facing technical resistance at $1,560, and a breakat that opens the door to $1,600 an ounce, probably notsomething we are going to see that this week,\" said Halleyadding that gold has strong technical support at $1,520.",
    "Among other precious metals, silver XAG= eased 0.8% to$19.41 per ounce, but was near a three-year high of $19.64 ittouched in the previous session.",
    "Platinum XPT= rose 0.5% to $990.37, marking its highestsince Feb. 2018, while palladium XPD= rose 0.4% to $1,558.26per ounce. (Reporting by Karthika Suresh Namboothiri in Bengaluru; Editingby Sriraj Kalluvila) ((karthikasuresh.namboothiri@thomsonreuters.com; +91 80 67490997 (If within U.S. call 651-848-5832); Reuters Messaging:karthikasuresh.namboothiri.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-05 12:03:00"
}