{
  "url": "https://www.nasdaq.com/article/why-glu-mobile-stock-jumped-today-cm1210721",
  "title": "Why Glu Mobile Stock Jumped Today - Nasdaq.com",
  "text": [
    " What happened Shares of   Glu Mobile    (NASDAQ: GLUU) have jumped today, up by 10% as of 2:40 p.m. EDT,   after the mobile-game maker received an upgrade when Roth   Capital boosted its rating to buy. So what Roth Capital analyst Darren Aftahi upgraded his rating on Glu   while assigning a price target of $7 for   the stock    . Shares had been   completely demolished    in early August after Glu reported second-quarter results and   drastically cut its full-year 2019 bookings outlook in part to   \"reflect the timing of new launches.\" Aftahi believes that   sell-off was overdone and that the stock has been \"overly   penalized.\"   Image source: Getty Images.makeArticleAd();  Shares now represent a compelling risk-reward trade-off and   \"look attractive relative to second-half 2019 and 2020 estimates,   with new games likely to help substantiate out-year growth,\" the   analyst wrote in a research note to investors. Now what Glu, which has historically licensed intellectual property for   games, has been working to grow its royalty-free titles.   Royalty-free games represented 64% of bookings in the second   quarter. The company also said it was adjusting its guidance   methodology for new games, choosing not to include bookings in   its forecasts until a title launches globally. \"We feel this is a   prudent approach to reduce guidance volatility and increase our   forecast precision,\" said CFO Eric Ludwig. Glu's bookings in the third quarter are trending to an   estimated $117 million, according to Roth's proprietary tracking   model, which would top Glu's outlook of $110 million to $112   million in bookings for the quarter. A little further out, Glu is   currently forecasting fourth-quarter bookings to be $101.5   million to $103.5 million.   10 stocks we like better than Glu Mobile       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Glu Mobile wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Evan Niu, CFA      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   Glu Mobile    (NASDAQ: GLUU) have jumped today, up by 10% as of 2:40 p.m. EDT,   after the mobile-game maker received an upgrade when Roth   Capital boosted its rating to buy.",
    "Roth Capital analyst Darren Aftahi upgraded his rating on Glu   while assigning a price target of $7 for   the stock    . Shares had been   completely demolished    in early August after Glu reported second-quarter results and   drastically cut its full-year 2019 bookings outlook in part to   \"reflect the timing of new launches.\" Aftahi believes that   sell-off was overdone and that the stock has been \"overly   penalized.\"",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Shares now represent a compelling risk-reward trade-off and   \"look attractive relative to second-half 2019 and 2020 estimates,   with new games likely to help substantiate out-year growth,\" the   analyst wrote in a research note to investors.",
    "Glu, which has historically licensed intellectual property for   games, has been working to grow its royalty-free titles.   Royalty-free games represented 64% of bookings in the second   quarter. The company also said it was adjusting its guidance   methodology for new games, choosing not to include bookings in   its forecasts until a title launches globally. \"We feel this is a   prudent approach to reduce guidance volatility and increase our   forecast precision,\" said CFO Eric Ludwig.",
    "Glu's bookings in the third quarter are trending to an   estimated $117 million, according to Roth's proprietary tracking   model, which would top Glu's outlook of $110 million to $112   million in bookings for the quarter. A little further out, Glu is   currently forecasting fourth-quarter bookings to be $101.5   million to $103.5 million.",
    "  10 stocks we like better than Glu Mobile       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Glu Mobile wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Glu Mobile       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Glu Mobile wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Evan Niu, CFA      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:46:00"
}