{
  "url": "https://www.nasdaq.com/article/energy-sector-update-for-09042019-eqnrboommusa-cm1207503",
  "title": "Energy Sector Update for 09/04/2019: EQNR,BOOM,MUSA - Nasdaq.com",
  "text": [
    "Top Energy Stocks",
    "XOM +1.0%",
    "CVX +0.8%",
    "COP +2.35%",
    "SLB +4.4%",
    "OXY +1.8%",
    "Energy stocks added to their market-leading gains this afternoon, with the NYSE Energy Sector Index (^NYE) climbing more than 1.5% while shares of energy companies in the S&P 500 ( XLE  ) rose more than 1.6% as a group. West Texas Intermediate crude oil for October delivery settled $2.32 higher at $56.266 per barrel on Wednesday. Among energy stocks moving on news, Transocean Ltd ( RIG  ) was 5% higher again shortly before Wednesday's closing bell, recovering from a modest dip off its earlier intra-day high, after the oilfield-services company late Tuesday disclosed plans to retire three of its ultra-deepwater floating drill-rigs.",
    "Among energy stocks moving on news:",
    "(+) Transocean Ltd ( RIG  ) was 5% higher again shortly before Wednesday's closing bell, recovering from a modest dip off its earlier intra-day high, after the oilfield-services company late Tuesday disclosed plans to retire three of its ultra-deepwater floating drill-rigs. The company is expecting to take a $580 million non-cash charge against its Q3 financial results because of the decision, also saying in the regulatory filing it may identify more rigs for possible retirement as it continues to evaluate the long-term competitiveness of its fleet.",
    "In other sector news:",
    "(+) DMC Global ( BOOM  ) climbed over 4% after the energy infrastructure firm, citing its recent strong performance, raised its annual cash dividend to $0.50 per share from $0.08 per share, beginning with its Q3 distribution payable Oct. 15 to shareholders of record on Sept. 30. The company slashed its dividend in half from $0.16 per share yearly following a slump in the global oil and natural gas industry.",
    "(+) Equinor ( EQNR  ) rose 1.9% following an upgrade of the Norwegian energy major at Credit Suisse, which raised its stock rating for Equinor by two notches to outperform and said that declining  natural gas prices  already have been largely priced into its share price. The research shop also said the company is expected to open the Johan Sverdrup oilfield on the Norwegian continental shelf before the end of the year, adding Equinor may eventually share some of the funds generated from the new field with shareholders through a stock buyback program.",
    "(+) Murphy USA ( MUSA  ) was 1% higher after the convenience store and gasoline seller Wednesday announced plans for a $500 million private placement of senior notes due 2029. The company expects to use the net proceeds, plus available cash, to redeem all $500 million of its 6.000% senior notes maturing in 2023 through a tender offer slated to expire next Tuesday, Sept. 10.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-04 03:24:10"
}