{
  "url": "https://www.nasdaq.com/article/brazil-senate-passes-telecoms-modernization-bill-20190912-00415",
  "title": "Brazil Senate passes telecoms modernization bill - Nasdaq.com",
  "text": [
    "BRASILIA, Sept 12 (Reuters) - The Brazilian Senate late on Wednesday approved a bill that will modernize Brazil's telecommunications law and boost companies in the sector by lifting restrictions on asset sales, according to the upper house's news service, Agencia Senado.",
    "The bill, known as PLC 79, had already passed the lower house of Congress and will now go to President Jair Bolosonaro to be signed into law.",
    "The law aims to encourage investment in broadband in remote areas of Brazil by allowing companies to own outright telecom assets, such as cellphone towers and valuable real estate, that they may sell if they so choose.",
    "Shares of Oi jumped 4% on news that the bill cleared the committee stage before drifting back down again on Sao Paulo's stock market, while Telefonica Brasil SA  gained 1.1%.",
    "Analysts at Itau BBA estimate that approval of the bill could add 2.4 reais to the value of Telefonica Brasil's shares and 0.5 reais to Oi's shares.",
    "The bill could also benefit Claro, the local subsidiary of Mexico'sAmerica Movil SAB de CV , and TIM Participações SA , a subsidiary of Telecom Italia SpA .",
    "The bill changes the current, more restricted model so that assets used under concessions would no longer revert to the government once a service provider's contract period expires. It also ends the requirement that providers invest in outdated technology such as public phones and landlines.",
    "Besides removing restrictions on asset sales, the new law would allow fixed-voice concessionaires to swap obligations they have under current concessions for investments in broadband assigned by telecoms regulator Anatel.",
    "It is now up to Anatel to implement the changes, which could take 12 to 18 months. But the bill's passage reduces uncertainty about concessions and will speed up new investment decisions and sector consolidation, Itau BBA said in a research note to clients.",
    "The committee that handled PLC 79 postponed until next Wednesday a vote on a separate bill that would lift a ban on cross-ownership between distributors and content producers in Brazil's paid-TV sector.",
    "The current law has prevented approval by Anatel of the $85 billion takeover of content group Time Warner Inc by AT&T Inc , which owns Sky Brasil, the country's largest satellite provider. The merger was approved in 2017 by Brazil's antitrust regulator, CADE, which allowed the companies to keep their assets in the country as long as they remain separate operations."
  ],
  "published_datetime": "2019-09-12 08:03:00"
}