{
  "url": "https://www.nasdaq.com/article/blackrock-inc-blk-ex-dividend-date-scheduled-for-september-04-2019-cm1206556",
  "title": "BlackRock, Inc. (BLK) Ex-Dividend Date Scheduled for September 04, 2019 - Nasdaq.com",
  "text": [
    "BlackRock, Inc. ( BLK  ) will begin trading ex-dividend on September 04, 2019. A cash dividend payment of $3.3 per share is scheduled to be paid on September 24, 2019. Shareholders who purchased BLK prior to the ex-dividend date are eligible for the cash dividend payment. This marks the 3rd quarter that BLK has paid the same dividend. At the current stock price of $422.56, the dividend yield is 3.12%.",
    "The previous trading day's last sale of BLK was $422.56, representing a -14.11% decrease from the 52 week high of $492 and a 17.12% increase over the 52 week low of $360.79.",
    "BLK is a part of the Finance sector, which includes companies such as CME Group Inc. ( CME  ) and Goldman Sachs Group, Inc. ( GS  ). BLK's current earnings per share, an indicator of a company's profitability, is $26.34. Zacks Investment Research reports BLK's forecasted earnings growth in 2019 as 2.21%, compared to an industry average of -.1%.",
    "For more information on the declaration, record and payment dates, visit the BLK Dividend History  page. Our  Dividend Calendar  has the full list of stocks that have an ex-dividend today.",
    " Interested in gaining exposure to BLK through an Exchange Traded Fund [ETF]?   The following ETF(s) have BLK as a top-10 holding:  iShares MSCI USA ESG Select ETF (   SUSA    ) First Trust VL Dividend (   FVD    ) ETF Industry Exposure & Financial Services ETF   (TETF).  ",
    "The top-performing ETF of this group is TETF with an increase of 6.49% over the last 100 days. SUSA has the highest percent weighting of BLK at 1.98%.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:00:04"
}