{
  "url": "https://www.nasdaq.com/article/dollar-yen-fall-as-global-tensions-ease-pound-rallies-20190904-01163",
  "title": "Dollar, yen fall as global tensions ease, pound rallies - Nasdaq.com",
  "text": [
    "By Gertrude Chavez-Dreyfuss",
    "NEW YORK, Sept 4 (Reuters) - The safe-haven dollar and yen fell on Wednesday after global political worries eased with what markets perceived as positive news in Hong Kong, Italy and Britain.",
    "Sterling hit a one-week high against the dollar as investors grew more optimistic after British lawmakers took steps to block a no-deal Brexit. ",
    "Edward Moya, senior market analyst at OANDA in New York, said the dollar's weakness was triggered by this \"risk-on move in Hong Kong that gave Hong Kong equities one of the best moves in a few years.\" That has boosted appetite for riskier currencies that have generally higher yields, he added.",
    "Moya said, \"This is providing a little bit of unwinding of some dollar bullish positions.\"",
    "In Italy, Prime Minister Giuseppe Conte unveiled a new cabinet that united the anti-establishment 5-Star Movement and the centre-left Democratic Party, an unlikely coalition that is expected to improve ties with the European Union. ",
    "The dollar ended down 0.6% against a basket of major currencies, at 98.403 , marking its biggest one-day loss in three months.",
    "The yen fell against the dollar, which rose 0.42% to 106.41 yen . It also declined against the euro, which gained 0.99% to 117.43 yen .",
    "The euro also rose 0.57% versus the dollar to $1.1035  after the UK parliamentary votes and comments from Christine Lagarde, who will likely be the European Central Bank's next president, introduced some doubt over the scale of an ECB stimulus package expected next week.",
    "Lagarde said highly accommodative monetary policy for a prolonged period was necessary but she added that the bank needed to be mindful of the negative side-effects of such tools. ",
    "Expectations for an interest rate cut, the relaunch of asset purchases and other ECB measures to stimulate the economy have weighed on the euro. On Tuesday, it hit a 28-month low around $1.0924.",
    "Meanwhile, sterling jumped 1.37% to $1.2253 , and against the euro it rallied 0.85% to 90.03 pence . It produced its biggest one-day gain against the dollar since March 13, while it improved to its strongest level against the single currency in over a month.",
    "The lower house of the British parliament voted on Wednesday to prevent Prime Minister Boris Johnson taking Britain out of the EU without a deal. It also rejected Johnson's call for a snap election on Oct. 15, just weeks before Brexit, to free his hands. ",
    "\"There is no way the UK leaves empty-handed. At this point, if there is enough popular pressure, there will be perhaps a second referendum on the Brexit question,\" said Juan Perez, senior currency trader at Tempus Inc in Washington."
  ],
  "published_datetime": "2019-09-04 05:41:00"
}