{
  "url": "https://www.nasdaq.com/article/intervention-helps-stabilize-fx-market-says-brazils-campos-neto-20190905-00681",
  "title": "Intervention helps stabilize FX market, says Brazil's Campos Neto - Nasdaq.com",
  "text": [
    "By Marcela Ayres and Jamie McGeever",
    "BRASILIA, Sept 5 (Reuters) - Currency market interventions serve to stabilize the market, Brazilian central bank president Roberto Campos Neto said on Thursday, in one of his first comments on the issue since the monetary authority's landmark interventions last month.",
    "Inflation is well-anchored and gives the central bank room to cut interest rates again, while the underperforming economy should start to show solid signs of recovery later this year, Campos Neto said at an event in Brasilia.",
    "\"Foreign exchange interventions act as a mechanism of stability in the foreign exchange market,\" Campos Neto said, adding Brazil's net reserves position was \"pretty solid.\"",
    "Last month, as the real slid toward 4.20 per dollar , its weakest level in almost a year and within sight of its record low around 4.25 per dollar, the central bank said it would sell dollars outright for the first time since 2009.",
    "Since then, the real has bounced back to 4.07 per dollar.",
    "Many analysts said this marked a change of foreign exchange policy at the central bank, which is now much more willing to sell into its $385 billion pile of international reserves.",
    "Campos Neto also said the central bank had a bill to simplify and lower the cost of FX transactions in Brazil that was ready to put to lawmakers and should be voted on soon. The bill's ultimate aim will be full currency convertibility within three to four years, he said.",
    "On the current economic situation, growth has been weaker than expected, he said, but should start to pick up again later this year. Increasing the availability and reducing the cost of mortgage and infrastructure lending was one of the central bank's top priorities, he said.",
    "In the meantime, low inflation provides space to further cut the benchmark Selic rate, currently at a record low 6.00%. The central bank's rate-setting committee meets later this month and is widely expected to reduce the Selic again."
  ],
  "published_datetime": "2019-09-05 09:46:00"
}