{
  "url": "https://www.nasdaq.com/article/noteworthy-wednesday-option-activity-tdoc-goss-c-cm1207523",
  "title": "Noteworthy Wednesday Option Activity: TDOC, GOSS, C - Nasdaq.com",
  "text": [
    "Among the underlying components of the Russell 3000 index, we saw noteworthy  options trading  volume today in Teladoc Health Inc (Symbol: TDOC), where a total of 5,011 contracts have traded so far, representing approximately 501,100 underlying shares. That amounts to about 46.2% of TDOC's average daily trading volume over the past month of 1.1 million shares. Especially high volume was seen for the $60 strike call option expiring September 20, 2019  , with 1,938 contracts trading so far today, representing approximately 193,800 underlying shares of TDOC. Below is a chart showing TDOC's trailing twelve month trading history, with the $60 strike highlighted in orange:       makeArticleAd();    Gossamer Bio Inc (Symbol: GOSS) saw options trading volume of 1,290 contracts, representing approximately 129,000 underlying shares or approximately 46.1% of GOSS's average daily trading volume over the past month, of 279,665 shares. Particularly high volume was seen for the $17.50 strike put option expiring October 18, 2019  , with 550 contracts trading so far today, representing approximately 55,000 underlying shares of GOSS. Below is a chart showing GOSS's trailing twelve month trading history, with the $17.50 strike highlighted in orange:       And Citigroup Inc (Symbol: C) saw options trading volume of 62,853 contracts, representing approximately 6.3 million underlying shares or approximately 42.9% of C's average daily trading volume over the past month, of 14.6 million shares. Especially high volume was seen for the $65 strike call option expiring September 20, 2019  , with 10,441 contracts trading so far today, representing approximately 1.0 million underlying shares of C. Below is a chart showing C's trailing twelve month trading history, with the $65 strike highlighted in orange:         For the various different available expirations for TDOC options  , GOSS options  , or C options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 03:25:05"
}