{
  "url": "https://www.nasdaq.com/article/slacks-first-earnings-as-a-public-company-after-the-bell-wednesday-cm1206934",
  "title": "Slack's First Earnings As A Public Company After The Bell Wednesday - Nasdaq.com",
  "text": [
    "   Slack WORK  is reporting its firs t earnings  report as a public company after the bell on Wednesday, August 4 th  . Slack shares have had a depressing ride since they were opened up to public trading on June 20 th  . Expectations have dropped since WORK initially hit the market with concerns about competition, but I expect that this report could have a significant impact on share price one way or the other. Zacks Consensus estimates consist of an EPS of -$0.19 on revenues of $140 million. Uncertainty is high with stock, so expect some excitement in after-hours trading on Wednesday.  The Business  Slack's goal is to make email obsolete, to be the next universally used organizational communication platform. The company currently has over 10 million daily active users across the globe, and this figure continues to proliferate.     Slack's topline is expected to grow 50% this year and close to 40% the following 2 years. Their margin deficit is also expected to shrink in the coming quarters as the company gets closer and closer to profitability. Economies of scale should eventually propel this company into profitability, but as of now, analysts don't have a date in which they expect a profit to be turned. Competition is growing in this space on business communication with Microsoft Team experiencing category influencing growth figures. This is causing investor concern with the WORK share, which is a contributing reason that these shares have fallen 32% from their $42 high in June. I believe that their room for all of these email killing businesses to grow with business communication needs becoming increasingly diverse. The future of this space has a lot of expansion ahead.  The Direct Listing  Slack entered the market in a very unconventional way, listing its shares directly on the New York Stock Exchange. A direct listing differs from a traditional IPO in that an investment bank is not underwriting the shares. The market decides the initial price on the day the shares are listed, with all buy and sell orders agreeing on a fair price. Slack didn't need to raise any additional capital with more than $800 million in cash already. Not having an investment bank underwrite your offering has some significant risks but if the firm's only intention is to provide liquidity to its current shareholders, it makes sense to leave the investment banks and their exuberant fees out of it. Although they did use Goldman Sachs GS  , Morgan Stanley MS  , and several other firms as advisers for the process, this expense was only marginal. Slack is only the second large tech firm to pursue this unconventional method of public listing following the Swedish music streaming giant, Spotify SPOT  , who had their pioneering debut in April of last year. Both SPOT and WORK have produced negative returns and underperformed the markets since their direct listings. Spotify's shares have depreciated over 10% in value since they listed last year, while Slack's shares are down an egregious 26% in the roughly 11.5 weeks since they debuted their shares to the public. WORK initial soared on its first day of trading, surging over 50% from its initial reference price but the shares have gone nowhere but down since. These ostensibly negative direct listing narratives may deter companies from using this method of public share offering in the future. The investment banks don't have anything to fear quite yet.  Take Away  I like Slack, but I am not sure if I like its current valuation. As WORK has begun to depreciate the share price is becoming more attractive, but a forward P/S of 19.7x could still be a hazardous play if growth expectations don't come to fruition. There is a ton of growth priced into this stock and earnings after the bell on Wednesday will further prove or disprove this valuation. Slack is way down going into its firs t earnings report  as a public company, but a positive surprise could change its course. Management guidance and sentiment are going to be crucial. Investors and analysts are anxious to hear more about this pioneering company's strategy that will allow it to continue this prolific growth as competition increases.    Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();   Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>       Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Morgan Stanley (MS): Free Stock Analysis Report   The Goldman Sachs Group, Inc. (GS): Free Stock Analysis Report   Slack Technologies, Inc. (WORK): Free Stock Analysis Report   Spotify Technology SA (SPOT): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Slack WORK  is reporting its firs t earnings  report as a public company after the bell on Wednesday, August 4 th  . Slack shares have had a depressing ride since they were opened up to public trading on June 20 th  .",
    "Expectations have dropped since WORK initially hit the market with concerns about competition, but I expect that this report could have a significant impact on share price one way or the other. Zacks Consensus estimates consist of an EPS of -$0.19 on revenues of $140 million. Uncertainty is high with stock, so expect some excitement in after-hours trading on Wednesday.",
    " The Business ",
    "Slack's goal is to make email obsolete, to be the next universally used organizational communication platform. The company currently has over 10 million daily active users across the globe, and this figure continues to proliferate. ",
    "Slack's topline is expected to grow 50% this year and close to 40% the following 2 years. Their margin deficit is also expected to shrink in the coming quarters as the company gets closer and closer to profitability. Economies of scale should eventually propel this company into profitability, but as of now, analysts don't have a date in which they expect a profit to be turned.",
    "Competition is growing in this space on business communication with Microsoft Team experiencing category influencing growth figures. This is causing investor concern with the WORK share, which is a contributing reason that these shares have fallen 32% from their $42 high in June.",
    "I believe that their room for all of these email killing businesses to grow with business communication needs becoming increasingly diverse. The future of this space has a lot of expansion ahead.",
    " The Direct Listing ",
    "Slack entered the market in a very unconventional way, listing its shares directly on the New York Stock Exchange. A direct listing differs from a traditional IPO in that an investment bank is not underwriting the shares. The market decides the initial price on the day the shares are listed, with all buy and sell orders agreeing on a fair price.",
    "Slack didn't need to raise any additional capital with more than $800 million in cash already. Not having an investment bank underwrite your offering has some significant risks but if the firm's only intention is to provide liquidity to its current shareholders, it makes sense to leave the investment banks and their exuberant fees out of it. Although they did use Goldman Sachs GS  , Morgan Stanley MS  , and several other firms as advisers for the process, this expense was only marginal.",
    "Slack is only the second large tech firm to pursue this unconventional method of public listing following the Swedish music streaming giant, Spotify SPOT  , who had their pioneering debut in April of last year.",
    "Both SPOT and WORK have produced negative returns and underperformed the markets since their direct listings. Spotify's shares have depreciated over 10% in value since they listed last year, while Slack's shares are down an egregious 26% in the roughly 11.5 weeks since they debuted their shares to the public.",
    "WORK initial soared on its first day of trading, surging over 50% from its initial reference price but the shares have gone nowhere but down since.",
    "These ostensibly negative direct listing narratives may deter companies from using this method of public share offering in the future. The investment banks don't have anything to fear quite yet.",
    " Take Away ",
    "I like Slack, but I am not sure if I like its current valuation. As WORK has begun to depreciate the share price is becoming more attractive, but a forward P/S of 19.7x could still be a hazardous play if growth expectations don't come to fruition. There is a ton of growth priced into this stock and earnings after the bell on Wednesday will further prove or disprove this valuation.",
    "Slack is way down going into its firs t earnings report  as a public company, but a positive surprise could change its course. Management guidance and sentiment are going to be crucial. Investors and analysts are anxious to hear more about this pioneering company's strategy that will allow it to continue this prolific growth as competition increases.",
    " Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();   Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>    ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:30:00"
}