{
  "url": "https://www.nasdaq.com/article/energy-sector-update-for-09032019-cop-cxo-cm1206791",
  "title": "Energy Sector Update for 09/03/2019: COP, CXO - Nasdaq.com",
  "text": [
    "Top Energy Stocks:",
    "XOM: -0.39%",
    "CVX: -1.99%",
    "COP: -1.32%",
    "SLB: -1.03%",
    "OXY: -2.09%",
    "Energy giants were weaker midday Tuesday with the NYSE Energy Index falling 1.2% while the S&P 500 energy index slumped 1.2%. West Texas Intermediate crude oil for October delivery was down $1.77 at $53.33 per barrel at the New York Mercantile Exchange. The global benchmark Brent crude November contract lost $1.04 to $57.62 per barrel and October natural gas futures were 7 cents higher at $2.36 per 1 million British Thermal Units. Among energy-related ETFs, the United States Oil Fund was down over 3%, while the United States Natural Gas fund was 3.2% higher. The Philadelphia Oil Service Sector index was down about 2.3% today.",
    "In industry news:",
    "Denmark's MP Pension is divesting its holdings in the 10 biggest oil companies because they haven't lived up to climate accord targets, Bloomberg reported.",
    "Among energy stocks moving on news:",
    "(-) ConocoPhillips ( COP  ) was over 1% lower after Reuters reported that its initial $8.7 billion award for Venezuela's 2007 expropriation of its assets has been lowered to $8.5 billion by a World Bank arbitration panel.",
    "In other  stock news  :",
    "(-) Concho Resources ( CXO  ) was down 4% after saying it agreed to sell its assets in the New Mexico Shelf to an affiliate of Spur Energy Partners LLC for $925 million.",
    "(-) Nine Energy Service ( NINE  ) was plunging 9.7%, after it sold its Production Solutions segment to Brigade Energy Services for about $17 million in cash.",
    "(-) Equinor ( EQNR  ) was over 1% lower, after the Norwegian Petroleum Directorate allowed the state oil firm and its partners to commence production at the large Johan Sverdrup oil field in the North Sea starting in the fall.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-03 12:43:26"
}