{
  "url": "https://www.nasdaq.com/article/asia-stocks-higher-as-trump-delays-tariffs-on-china-cm1210843",
  "title": "Asia Stocks Higher as Trump Delays Tariffs on China - Nasdaq.com",
  "text": [
    "The major Asia Pacific Shares are trading mostly higher early Thursday in reaction to a further easing of tensions between the United States and China. Volume in a little light, however, as investor await the release of the European Central Bank (ECB) interest rate and monetary policy decisions at 11:45 GMT and ECB President Mario Draghi's press conference at 12:30 GMT.",
    "At 04:00 GMT, Japan's Nikkei 225 Index is at 21787.79, up 190.03 or +0.88%. China's Shanghai Index is trading 3014.80, up 5.99 or +0.20 and Australia's S&P/ASX 200 Index is at 6654.30, up 16.30 or +0.25%.",
    "Hong Kong's Hang Seng Index is the lone loser, coming in at 27067.71, down 91.35 or -0.34%.",
    "Late Wednesday, President Donald Trump tweeted that he will delay increasing tariffs on $250 billion worth of Chinese goods from October 1 to October 15 as a \"gesture of good will\" to China.",
    "Trump said the postponement came \"at the request of the Vice Premier of China, Liu He, and due to the fact that the People's Republic of China will be celebrating their 70 th Anniversary.\"",
    "U.S. stock futures jumped more than 0.5% after news of the delay. The Dow is poised to open up about 150 points higher.",
    "Earlier in the month, Treasury Secretary Steven Mnuchin said the U.S. and China have a \"conceptual\" agreement on enforcement concerns, emphasizing positive progress already made in trade talks, which are set to resume at high levels next month.",
    "\"I think the enforcement area we at least have a conceptual, an agreement on,\" Mnuchin told Fox Business Network.",
    "On Friday and Tuesday, Politico and South China Morning Post respectively, reported China is expected to agree to buy more American agricultural products in hopes of a better trade deal with the United States as the two nations prepare for a meeting between their top negotiators next month.",
    "Hong Kong Exchanges and Clearing Limited (HKEX) said Wednesday it had made a proposal to the board of London Stock Exchange Group Plc (LSE) to \"combine the two companies,\" in a deal which values the (LSE) at about 29.6 billion Pounds or $36.6 billion.",
    "In a subsequent conference call held for media and analysts, HKEX executives described the deal as a means of connecting trading and capital between East and West. They added the deal would create an 18-hour trading zone and also help the rise of the Chinese Yuan as a globally-traded currency.",
    "There are some worries that a Chinese firm would be taking control of a strategic U.K. brand with access to sensitive market information, but that was downplayed by Charles Li, the chief executive of HKEX.",
    "\"We are not a Chinese company. We are not even a Hong Kong-only company. We are a global company,\" he said.",
    "Although HKEX sees the move as \"complementary\" Swiss bank UBS doesn't see the LSE seriously entertaining the offer.",
    "\"Given the recent transformational announcement by LSE to acquire Refintiv in early August, made by a CEO just 12 months into his role, we would be surprised to see LSE's management and board prefer a takeover bid from HKEX,\" said UBS.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 01:38:28"
}