{
  "url": "https://www.nasdaq.com/article/zacks-market-edge-highlights-anglogold-barrick-gold-royal-gold-spdr-gold-and-direxion-3x-gold-miners-cm1208148",
  "title": "Zacks Market Edge Highlights: AngloGold, Barrick Gold, Royal Gold, SPDR Gold and Direxion 3x Gold Miners - Nasdaq.com",
  "text": [
    "For Immediate Release",
    "Chicago, IL - September 5, 2019 - Zacks Market Edge is a podcast hosted weekly by cks Stock Strategist Tracey Ryniec. Every week, Tracey will be joined by guests to discuss the hottest investing topics in stocks, bonds and ETFs and how it impacts your life. To listen to the podcast, click here:",
    "(Please use the Soundcloud link from this URL for the PR. Thanks: https://www.zacks.com/stock/news/501595/gold-is-hot-should-investors-be-buying )",
    "Gold Is Hot: Should Investors Be Buying?",
    "Welcome to Episode #192 of the Zacks Market Edge Podcast.",
    "Every week, host and Zacks stock strategist, Tracey Ryniec, will be joined by guests to discuss the hottest investing topics in stocks, bonds and ETFs and how it impacts your life.",
    "This week, Tracey is joined by Kevin Cook, Zacks Senior Strategist and the editor of the TAZR newsletter, to talk about gold.",
    "It's hot (again).",
    "Gold has hit new 6-year highs in 2019 and the gold stocks are soaring.",
    "The gold miners now rank in the top 4% of Zacks Rank Industries as the earnings estimates are on the rise.",
    "Is this like the recent cryptocurrency manias or does gold have a legitimate place in your portfolio?",
    "Gold Stocks Soar",
    "Gold miners AngloGold Ashanti Ltd.AU and Barrick Gold Corp.GOLD are up 84% and 45%, respectively, year-to-date.",
    "Metal streaming and royalty company Royal GoldRGLD has soared 60%. But it's not cheap. It now trades at 52x forward earnings.",
    "Are ETFs the Way to Invest?",
    "In 2004, State Street launched the SPDR Gold ETFGLD and it has been the gold standard, literally, for those wanting to invest in the physical metal.",
    "But there are also leveraged ETFs such as the Direxion 3x Gold Miners ETFNUGT which is up 147% year-to-date thanks to the bullish mining stocks.",
    "But NUGT isn't meant to be held by long-term investors. It's designed for single-day traders.",
    "What else should you know about investing in gold and the mining stocks?",
    "Listen to this week's podcast to find out.",
    "Biggest Tech Breakthrough in a Generation",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "See 7 breakthrough stocks now>>",
    "Follow us on Twitter:  https://twitter.com/zacksresearch",
    "Join us on Facebook:  https://www.facebook.com/home.php#/pages/Zacks-Investment-Research/57553657748?ref=ts",
    "Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "support@zacks.com",
    "https://www.zacks.com/performance",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance  for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:31:00"
}