{
  "url": "https://www.nasdaq.com/article/strong-chinese-data-easing-geopolitical-worries-push-wall-st-higher-20190904-00896",
  "title": "Strong Chinese data, easing geopolitical worries push Wall St higher - Nasdaq.com",
  "text": [
    "By Uday Sampath Kumar",
    "Sept 4 (Reuters) - Wall Street's main indexes rose on Wednesday as fears of a global economic slowdown were calmed by robust economic data from China, while easing tensions in Hong Kong added to an upbeat mood.",
    "Activity in China's services sector expanded at the fastest pace in three months in August, providing a boost to the world's second-largest economy that has been struggling to reverse a prolonged slump in its manufacturing sector. ",
    "\"This is a sentiment driven market and whenever you get news like this, while it may not directly impact the U.S., it causes a ripple effect,\" said Ryan Nauman, market strategist at Informa Financial Intelligence in Lake Taho, California.",
    "Markets struggled last month as escalating trade tensions and the inversion of a key part of the U.S. yield curve, often seen as a sign of recession, drove investors away from risky assets and pushed the S&P 500  to log its worst August in four years.",
    "A contraction in U.S. factory activity in August and new rounds of tariffs from the Washington and Beijing only added to those concerns on Tuesday, pulling the Dow Jones Industrial Average  and Nasdaq  down over 1%.",
    "However, risk sentiment improved on Wednesday, pushing the benchmark U.S. Treasury 10-year yield  higher, with the yield curve at its steepest in more than two weeks. US/",
    "Helping cool slowdown concerns were comments from New York Federal Reserve President John Williams who said the economy appeared to be in a good place and he is ready to \"act as appropriate\" to help avoid a downturn. ",
    "Technology stocks  led gains among the 11 major S&P sectors with a 1.6% rise and provided the biggest boost.",
    "The U.S. nonfarm payrolls report due Friday will also be a critical piece of data, with some analysts cautioning that any weakness could be taken as a signal that the domestic economy is slowing.",
    "\"The strong labor market and consumer is what's driving economic growth and if we start seeing cracks in the labor market, that would give me pause that a recession is on the horizon,\" Nauman said.",
    "However, he added weakness in the labor market could pressure the Federal Reserve to cut interest rates by as much as 50 basis points in its mid-September meeting. Market participants are currently expecting a quarter percentage point cut.",
    "At 12:55 p.m. ET, the Dow  was up 211.68 points, or 0.81%, at 26,329.70 and the S&P 500  was up 26.93 points, or 0.93%, at 2,933.20.",
    "The Nasdaq Composite  was up 91.56 points, or 1.16%, at 7,965.72.",
    "Tyson Foods Inc  shares fell 6.12% to the bottom of the S&P 500 after the United States' biggest meat processor cut its 2019 earnings forecast. ",
    "Starbucks Corp  dropped 1.02% after the company said it expects 2020 adjusted profit growth to be lower than 2019 as it factors in the impact of a one-time tax benefit that has inflated its bottom line this year. ",
    "Advancing issues outnumbered decliners by a 3.99-to-1 ratio on the NYSE and by a 2.06-to-1 ratio on the Nasdaq.",
    "The S&P index recorded 61 new 52-week highs and three new lows, while the Nasdaq recorded 54 new highs and 64 new lows."
  ],
  "published_datetime": "2019-09-04 01:07:00"
}