{
  "url": "https://www.nasdaq.com/article/argentina-country-risk-improves-for-second-day-peso-steadies-20190905-00764",
  "title": "Argentina country risk improves for second day, peso steadies - Nasdaq.com",
  "text": [
    "BUENOS AIRES, Sept 5 (Reuters) - Argentina's country risk fell on Thursday for the second consecutive day and the peso held its ground as the government's new capital controls help steady markets.",
    "Country risk fell by 140 basis points to 2,000, after previously touching the highest levels since 2005. The peso  was 0.1% weaker at 56.08 per dollar by early afternoon, traders said. Argentina's S&P Merval stock index  was up by more than 6% for a second day.    ",
    "\"After the abrupt collapse, Argentine assets are warming up for a technical rebound as traders look to selectively take some positions by betting on the excessive accumulated weakness (of bonds and stocks),\" said economist Gustavo Ber of local firm Estudio Ber.",
    "But by late morning, Fitch Ratings had downgraded the debt ratings of eight Argentine companies, ranging from telecoms to energy, saying it believes \"the current controls and risks of further tightening could potentially impair the private sector's ability to access foreign exchange to meet debt service, in spite of exceptions that have been included in the controls for debt repayment.\"",
    "That came after Moody's downgraded several major Argentine financial institutions' debt ratings on Wednesday evening, including Banco Hipotecario , Banco Supervielle  and Banco Macro .",
    "Argentina's primary election result sparked a market crash which saw the peso lose 26% of its value against the dollar in August. The country risk index soared and bond prices sank to record lows.",
    "In response, Macri, who came to power in 2015 as a free-market champion and critic of interventionist policy, has rolled out plans to push back payments on around $100 billion of debt and imposed capital controls to protect the peso.",
    "While markets have stabilized, the country's economic outlook has darkened. A central bank poll of economists hiked its inflation forecast for the year to 55% on Tuesday, and cut its outlook for the economy, which it now expected to shrink 2.5%. "
  ],
  "published_datetime": "2019-09-05 10:56:00"
}