{
  "url": "https://www.nasdaq.com/article/preciousgold-scales-new-sixyear-peak-as-us-yields-slip-20190904-00932",
  "title": "PRECIOUS-Gold scales new six-year peak as U.S. yields slip - Nasdaq.com",
  "text": [
    " (Corrects quote in paragraph five)",
    "* Silver scales three-year peak",
    "* SPDR Gold Trust holdings at highest level since November2016 ",
    "Sept 4 (Reuters) - Gold on Wednesday jumped to a freshsix-year high as focus returned to economic woes with 10-yearU.S. Treasury yields slumping to a three-year low.",
    "Spot gold XAU= was up 0.6% at $1,556.40 per ounce at 1:52p.m. EDT (1752 GMT), touching a new high since April 2013.",
    "U.S. gold futures GCcv1 settled down 0.3% at $1,560.40.",
    "\"Gold can move a bit higher, a big driving macro force isthe decline in global yields, which seems to be spreading,\" saidEdward Meir, analyst at INTL FCStone.",
    "\"When you have gold, at least you can get your money back ifprices are unchanged. If you buy sovereign bonds, you won't getyour money back.\"",
    "U.S. Treasury yields fell as the benchmark 10-year yield hitits lowest level since July 2016, after U.S. manufacturing datashowed the first contraction since 2016 on worries about aweakening global economy and U.S.-China trade tensions. US/",
    "U.S. President Donald Trump threatened on Tuesday that hewould be \"tougher\" on Beijing in a second term as president iftalks dragged on. urn:newsml:reuters.com:*:nL2N25U0FTurn:newsml:reuters.com:*:nL2N25R073",
    "However, global stock markets gained after a parliamentaryvote raised chances of another delay to Brexit while a politicalgridlock in Italy seemed to have eased. MKTS/GLOBurn:newsml:reuters.com:*:nL5N25V2FD",
    "Investors also kept a close watch on developments in HongKong, after the region's leader, Carrie Lam, withdrew acontroversial extradition bill that had triggered months ofviolent protests in the Asian financial hub. However, somelawmakers said it still remains uncertain if this action wouldhelp end the protests. urn:newsml:reuters.com:*:nL3N25V0NC",
    "Meanwhile, traders fully priced in a 25 basis-point interestrate cut at the U.S. Federal Reserve's meeting later this month,according to CME's FedWatch tool. FEDWATCH",
    "Lower interest rates reduce the opportunity cost of holdingnon-yielding bullion and weigh on the dollar. The dollar .DXY fell against a basket of currencies. USD/",
    "Indicative of sentiment, holdings of SPDR Gold TrustGLD ,the world's largest gold-backed exchange-traded fund, rose to890.04 tonnes on Tuesday, their highest level since November2016. urn:newsml:reuters.com:*:nAQN0000KN",
    "Spot silver XAG= rose 1.4% to $19.50 per ounce, afterhitting $19.57 earlier, its highest level since September 2016. ",
    "\"It (silver) has climbed further to a three-year high of$19.6 per troy ounce this morning, bringing the psychologicallyimportant $20 mark into reach. Silver is continuing tooutperform gold - the gold/silver ratio has dropped below 80 forthe first time in over a year,\" Commerzbank analysts wrote in anote.",
    "Elsewhere, spot platinum XPT= rose 2.5% to $982.00 perounce after jumping 3% to $986 earlier in the session, itshighest price since February 2018. Palladium XPD= was up 0.9%at $1,556.25. (Reporting by Asha Sistla in BengaluruEditing by Matthew Lewis) ((Asha.Sistla@thomsonreuters.com; If within U.S. +1 646 2238780; outside U.S. +91 80 6749 5072; Reuters Messaging: ReutersMessaging: asha.sistla.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-04 02:32:00"
}