{
  "url": "https://www.nasdaq.com/article/forexeuro-slides-to-lowest-since-2017-on-investors-eye-ecb-cuts-dollar-strength-20190903-00333",
  "title": "FOREX-Euro slides to lowest since 2017 on investors eye ECB cuts, dollar strength - Nasdaq.com",
  "text": [
    "    * US Treasury yields fall towards recent mid-2016 low",
    "* The pound drops below $1.20 on Brexit clash, but recovers",
    "* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh (Adds context, updates prices)",
    "By Olga Cotaga",
    "LONDON, Sept 3 (Reuters) - The euro plunged to a 28-monthlow against the dollar on Tuesday as investors priced in deepernegative interest rates for longer in the euro zone.",
    "The common currency's drop also came on the back of astrengthening dollar as the trade spat between Washington andBeijing intensified and traders turned to buying U.S. assets assafe-haven investments without hedging their dollar currencyexposure, analysts said. ",
    "Money markets have increased to more than 80% theprobability that the European Central Bank will cut itsbenchmark rate by 20 basis points when it meets next week. ",
    " The ECB benchmark rate now stands at minus 0.40% and it has all but promised a monetary policy stimulus package as economicgrowth falters. Monday's PMI survey showed Europeanmanufacturing contracted for seven straightmonths. urn:newsml:reuters.com:*:nL5N25Q2T8urn:newsml:reuters.com:*:nL5N25Q32W",
    "The euro EUR=EBS was last down by 0.3% at $1.0936. It fellto $1.0926 earlier, its lowest since mid-May 2017. A break belowthe key $1.1000 level last week had sparked heavier sell-offs.",
    "Against an index of its six major rivals, the dollar .DXY rose to 99.37 on Tuesday, the highest since mid-May 2017, asinvestors became more gloomy about the global economy'sprospects amid the U.S.-China trade dispute.",
    "Bloomberg News reported that Chinese and U.S. officials arestruggling to agree a schedule for a round of trade negotiationsthat had been expected this month.",
    "Overseas investors dived into buying U.S. Treasuries,considered the most liquid and safe investment in tumultuoustimes. ",
    "The 10-year Treasury bond yield fell 2.5 basis points to1.48% on Tuesday, close to the low of $1.44% it reached lastweek that was last seen in mid-2016.",
    "The flows have boosted the dollar, but investors' decisionto either buy Treasuries unhedged, or trim some of theircurrency hedges has intensified the gains in the greenback, saidRichard Falkenhall, senior forex strategist at SEB. ",
    "Higher government bonds in the United States compared withthe rest of the developed world makes it worthless to buy U.S.government bonds to overseas investors if they also buyprotection against unexpected swings in the U.S. currency.",
    "\"The dollar tends to outperform all other currencies exceptthe yen\" when the global economy slows down, said Falkenhall. ",
    "\"Everything is going in the same direction pointing to astronger dollar,\" he said.",
    "EURO AND ITALY ",
    "The euro could get some relief if the 5-Star Movement andthe Democratic Party form a coalition government in Italy,analysts said. 5-Star members will vote on Tuesday on forming acoalition with PD.",
    "\"If the vote succeeds, the euro could gain somewhat,\" MUFGanalysts said in a note, adding that \"Italian assets like bondsand stocks would likely rally somewhat further\". ",
    "Elsewhere, the pound fell to its lowest in nearly threeyears on Tuesday as British lawmakers prepared to vote on thefirst stage of their plan to block Prime Minister Boris Johnsonfrom pursuing a no-deal Brexit. GBP/urn:newsml:reuters.com:*:nL5N25U0GW",
    "Sterling was last down 0.4% at $1.2012GBP=D3 afterfalling to $1.1959, the lowest since October 2016, when itplunged to $1.1491 in a flash crash. Against the euro, sterlingtouched a two-week low of 91.47 penceEURGBP=D3 .",
    "\n<^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\nEuro lowest since May 2017   https://tmsnrt.rs/2zMVY6w\n    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^> (Reporting by Olga CotagaEditing by Larry King and Frances Kerry) ((olga.cotaga@thomsonreuters.com))"
  ],
  "published_datetime": "2019-09-03 07:38:00"
}