{
  "url": "https://www.nasdaq.com/article/arizona-cities-and-towns-ranked-for-taxes-cm1207463",
  "title": "Arizona Cities and Towns Ranked for Taxes - Nasdaq.com",
  "text": [
    "Arizona is a hot destination for retirees and other people looking to relocate--and I'm not talking about the weather. From July 1, 2017, to July 1, 2018, more than 83,000 people moved to Arizona from other states. That's second only to Florida in terms of population growth from domestic migration during that time period.",
    "The Grand Canyon State's sizzling population growth is partly due to its low state tax burden. It's the eighth-most taxpayer-friendly state in the country , according to our latest rankings. That favorable assessment is based largely on Arizona's low state income taxes, but you can still get burned by local property and sales taxes depending on where you live (property taxes typically drain your wallet the most). So if you're packing your bags and heading to Arizona, or looking to relocate within the state, do yourself a favor and compare the local tax rates first. To make that comparison easier, we ranked the 30 largest cities and towns in Arizona (including \" census designated places \") based on the estimated local tax burden (from highest to lowest). Our estimates reflect what a hypothetical couple would pay in common county and municipal taxes in each location if they moved there and purchased a $250,000 home. Check out our list to see where you can go to cool down your overall tax bill.",
    "Sorry, Marana residents, but your town has the highest estimated local tax burden of the 30 Arizona locales in our rankings. Property taxes are primarily to blame for the town's poor showing. In 2017 (the latest U.S. Census data available), the average property tax rate in Marana was about $1,090 per $100,000 in home value. Based on the average rate, the annual property tax on our hypothetical couple's $250,000 home in Marana would be about $2,726. That's the highest amount on our list.",
    "In addition to the 5.6% statewide sales tax, a 0.5% county tax and a 2% municipal tax are tacked on to retail sales in Marana. That comes to a combined general sales tax rate of 8.1% in the town, which is average for the cities and towns in our survey.",
    "Although there are no state or county taxes in Arizona on the sale of groceries, a number of cities and towns in the state impose their own taxes on \"food for home consumption.\" Thankfully, Marana is not one of them, and that helps keep the town's overall tax burden a little lower. However, if you're dining out or wetting your whistle at your favorite tavern in Marana, expect a combined (state, county and local) restaurant and bar sales tax of 8.1% to show up on your check. That rate is actually below average for the locales on our list.",
    "Local sales taxes on utilities such as electricity, natural gas and water in Marana are high. The combined tax rate for these is 10.1%, which is tied for the third-highest utilities tax rate on our list. The local sales tax on communications services, such as phones and cable television, is on the high end, too. The combined rate for this tax is also 10.1%, which is the sixth-highest communications tax rate in our rankings.",
    "You'll pay more in local taxes in Arizona's second-largest city than you will in most other places in the state. Tucson has the third-highest average property tax rate on our list, which is the driving force behind the city's overall high local tax burden. The 2017 average property tax rate in Tucson was $1,016 per $100,000 in home value. If you own a $250,000 home in Tucson, your yearly property tax bill will be about $2,540.",
    "At 8.7%, the combined (state, county and local) general sales tax rate in Tucson is a tad above average when compared with the rate in the other Arizona cities we evaluated.",
    "There's no local tax on groceries in Tucson. That's good for residents. There is, however, a combined 8.7% sales tax on restaurant and bar tabs in the city. That's right around average for that tax, though.",
    "Utility and communications taxes are very high in Tucson. The combined (state, county and city) rate for both taxes is 13.2%. That's the highest rate for these taxes in our rankings (and by a fair margin).",
    "Property taxes are high in Apache Junction. In 2017, the average property tax rate in the city was about $913 per $100,000 in home value. Only five other locations on our list had a higher property tax rate that year. The owner of a $250,000 home in Apache Junction can expect an annual property tax bill of about $2,282.",
    "Shopping for everyday items costs more in Apache Junction because of the city's high combined general sales tax rate--an eye-popping 9.6%. That's the highest general retail sales tax rate in our rankings.",
    "Filling your belly and getting a beer will cost you more in Apache Junction than most other places in Arizona, too. First, there's a 2.4% city sales tax on groceries (remember, there's no state or county tax in Arizona on food for home consumption). That's the seventh-highest grocery tax rate on our list. Plus, you'll pay a high sales tax if you visit a restaurant or bar in Apache Junction, where the combined rate is 9.6%. That's the fifth-highest rate you'll see here for the restaurant and bar tax.",
    "Continuing the trend, the utilities and communications taxes in Apache Junction are high as well. The combined rate for each tax is 10.6%. That's the second-highest utilities tax rate and the fourth-highest communications tax rate in our rankings.",
    "Maricopa has an above-average property tax rate. The average rate in 2017 was $904 per $100,000 in home value. For a $250,000 home, that comes to about $2,259 per year in real property taxes for our hypothetical couple.",
    "The combined state, county and city general sales tax rate in Maricopa is 9.2%. That's one of the highest retail sales tax rates on our list--tied for fourth-highest, to be exact. Not exactly the best place to do your shopping in the state.",
    "Taxes on food and drinks in Maricopa are higher than average, too. The city's sales tax on groceries is levied at a 2% rate, while dining or visiting a bar in Maricopa will cost you an extra 9.2% in state, county and city taxes.",
    "The combined sales tax rate on utilities in Maricopa is 9.2%. That's the same combined rate you'll see for communications taxes in the city. Both tax rates fall within the \"above average\" range for our survey.",
    "At $881 per $100,000 in home value, Casa Grande's 2017 average property tax rate gets an above-average ranking among the 30 largest Arizona cities and towns. So, for a $250,000 home, you can expect to pay about $2,202 per year in real property taxes. Not great, but it could be worse.",
    "The general retail sales tax in Casa Grande is on the high side. The combined state, county and city rate is 9.2%. That's tied for the fourth-highest general sales tax rate on our list.",
    "Casa Grande has a 2% sales tax on groceries, which is above average for our rankings. Casa Grande's sales tax at restaurants and bars is only average, though. It's levied at a 9% combined rate.",
    "Taxes on utilities and communications services are above average in Casa Grande. The combined rate for each tax is 9.2%.",
    "Property taxes are high in Oro Valley. The town's 2017 average property tax rate was $969 per $100,000 of property value, which is the fourth-highest rate on our list. That puts the annual property tax bill for our hypothetical couple's $250,000 home in the city at right around $2,422.",
    "Oro Valley's general retail sales tax is in the \"average\" range, with a combined state, county and local tax rate of 8.6%. So you won't get burned too badly if you do your shopping there.",
    "Taxes on food and beverages aren't too bad in Oro Valley, either. There's no tax on groceries. Plus, the sales tax rate for restaurants and bars is only 8.6%, which is average for our survey.",
    "The tax on utilities in Oro Valley is high, though. At 10.1%, the town's combined sales tax rate on utilities is tied for the third-highest such rate in our rankings. But the sales tax on communications services in the town is very low--tied for the lowest on our list, to be precise. The combined tax rate is only 6.1%. It's so low because there isn't a local tax on communications services in Oro Valley--just state and county taxes.",
    "Property taxes aren't cheap in Yuma, which is the first of our \"above-average tax burden\" cities. In 2017, property taxes in the city averaged $930 per $100,000 in home value. That adds up to $2,326 in annual property taxes on a $250,000 home, which is fifth-highest on our list.",
    "Yuma's combined general sales tax rate is reasonable, at 8.412%. That's right about in the middle as far as the general sales tax rates on our list go.",
    "If you live in Yuma, you'll save a lot of money by eating at home as much as possible. While there is a sales tax on groceries in Yuma, it's only 1.7%. That's one of the lowest grocery tax rates among the cities and towns in our survey that impose such a tax. One the other hand, the sales tax rate at Yuma restaurants and bars is a whopping 10.412%. That's the second-highest rate in our rankings for that tax.",
    "The sales tax on electricity, natural gas and water service in Yuma is imposed at an 8.412% combined rate. That's actually below average for our list. The city's tax on communications isn't bad, either. It's also imposed at an 8.412% combined rate, which is average for our rankings.",
    "Buckeye has an above-average property tax rate, but at least it isn't in our list's top 10. The average rate in 2017 was $765 per $100,000 in home value, which comes to about $1,912 per year in real property taxes for a $250,000 home.",
    "The general retail sales tax rate in Buckeye solidifies the city's \"above-average tax burden\" ranking. At 9.3%, the city's combined general sales tax rate is tied for the second-highest such rate in our list.",
    "Sales taxes on food and drink in Buckeye are high. The city tax rate on groceries is 3%, which is tied for the highest tax on groceries in our rankings. You'll pay when you go out for dinner or drinks, too. The combined sales tax rate at restaurants and bars in Buckeye is 9.3%, which is above average for this list.",
    "Sales taxes on utilities and communications services are high in Buckeye, too. The combined tax rate is 9.3% for utilities (tied for sixth-highest) and 10.3% for communications services (fifth-highest).",
    "The average property tax rate in 2017 for homes in Goodyear was the 10th-highest in our rankings--$801 per $100,000 in home value. For our hypothetical couple's $250,000 home in the city, that comes to an estimated annual tax bill of $2,003.",
    "The general retail sales tax for shoppers in Goodyear is above average. The combined tax rate in the city is 8.8%.",
    "Groceries are taxed in Goodyear at a 2% rate, which is pretty average for cities and towns in Arizona that impose such a tax. Goodyear's sales tax on restaurants and bars, however, is very high. At 10.3% (combined state, county and city tax), it's the third-highest rate in our rankings for this type of tax.",
    "Taxes on utilities and communications services in Goodyear are middle-of-the-road. Each tax is levied at a combined rate of 8.8%.",
    "The 2017 average property tax rate in Glendale was $715 per $100,000 in home value. That's about average for the Arizona cities on our list. If you own a $250,000 home in Glendale, your yearly property tax bill will be about $1,788.",
    "Although property taxes are average in Glendale, the other taxes we're tracking are fairly high in the city. That certainly goes for the general retail sales tax in Glendale. The combined tax rate in the city is 9.2%, which is tied for the fourth-highest combined rate in our survey.",
    "Food and drink are also heavily taxed in Glendale. You'll see a 2.5% sales tax on groceries at supermarkets in the city. That's tied for the fifth-highest rate in our rankings. If you decide to go out for a meal or a round of drinks, don't be surprised by the 10.2% sales tax on your bill. That's the fourth-highest restaurant and bar sales tax rate among Arizona's 30 largest cities and towns.",
    "At 9.2%, the combined sales tax rate on utilities in Glendale is above average. The city's combined sales tax rate on communications services is even higher--a staggering 12.4%, which is the second-highest rate on our list for that tax type.",
    "Because it's a \"census designated place,\" Casas Adobes doesn't impose its own sales tax (although state and county sales taxes apply). As a result, most of the taxes we're covering are, comparatively, extremely low for its residents. However, the overall local tax burden in Casas Adobes is in the \"above average\" range because property taxes are so high. In 2017, the average property tax rate was $1,045 per $100,000 in home value. At that rate, the annual property tax on a $250,000 home in Casas Adobes would be about $2,613. That's the second-highest average for our group of Arizona locations.",
    "As we mentioned above, there are only state and county sales taxes to worry about in Casas Adobes. They add up to just 6.1%, which is tied for the lowest general sales tax rate in our rankings.",
    "There are no taxes on groceries in Casas Adobes. Plus, the 6.1% combined state and county tax on sales at restaurants and bars is tied for the lowest such tax on our list.",
    "Ditto for utilities and communications services taxes. The 6.1% rate (combined state and county) for these two tax types is also tied for the lowest rate for each tax.",
    "How fitting--Avondale has the 12th-highest overall local tax burden on our list and the 12th-highest property tax rate on our list. In 2017, the average property tax rate in the city was about $732 per $100,000 in home value. Based on that rate, the annual property tax bill on our hypothetical couple's $250,000 home in Avondale would be about $1,829.",
    "Avondale has an above-average general sales tax rate. The combined state, county and city tax rate is 8.8%.",
    "The sales tax rates for food are mixed in Avondale. The tax rate on groceries is 2.5%, which is tied for the fifth-highest rate in our rankings. However, the 8.8% combined sales tax rate for restaurants and bars is in the middle of the pack.",
    "The 8.8% combined sales tax rates for utilities and communications services are average, too.",
    "El Mirage is the first Arizona city we come to with an \"average\" overall tax burden. Its property tax rate is actually in the \"below average\" zone, though. The city had a 2017 average property tax rate of $674 per $100,000 in home value. If you do the math, that comes to about $1,686 per year for property taxes on a $250,000 home.",
    "Sales tax rates in El Mirage certainly aren't below average. In fact, they're quite high. For instance, the combined general retail sales tax rate in the city is 9.3%, which is tied for the second-highest rate in our rankings.",
    "Shopping for groceries and dining out are taxed heavily as well. El Mirage imposes a 3% tax on groceries, which is tied for the highest rate on our list. The combined sales tax rate for restaurant and bar purchases is 9.3%. That's tied for the seventh-highest rate for that tax.",
    "At 9.3%, the combined sales tax rate on both utilities and communications services is on the high end, too.",
    "The 2017 average property tax rate in the Town of Prescott Valley was $675 per $100,000 in home value. That's a below-average rate for our list. So, if you own a $250,000 home in Prescott Valley, your property tax bill will come to about $1,688 per year.",
    "While property taxes are lower than average in Prescott Valley, sales taxes are above average. The combined state, county and local general retail sales tax rate in the town is 9.18%.",
    "Sales taxes on food and beverages are rather high in Prescott Valley. The tax on groceries is levied at a 2.83% clip, which is the third-highest grocery tax rate in our survey. Patrons at Prescott Valley restaurants and bars get hit with a combined 9.18% tax. That's an above-average rate for our list.",
    "Utilities and communications services are both taxed at a combined rate of 9.18% in Prescott Valley. That's an above-average rate for both taxes.",
    "At $720 per $100,000 in home value for 2017, Sierra Vista has a middle-of-the-pack property tax rate when compared with Arizona's other large cities and towns. At that rate, if our hypothetical couple owned a $250,000 home in Sierra Vista, they would pay about $1,800 in taxes each year.",
    "At 8.05%, the combined general sales tax rate in Sierra Vista is quite reasonable. It falls within the \"below average\" range for our rankings.",
    "Grocery taxes in Sierra Vista are a bit above average at 1.95%. Eating out won't drain your wallet too much--at least not as far as the tax rate goes. The combined sales tax rate for restaurants and bars in Sierra Vista is 8.7%, which is average for our survey.",
    "Utilities and communications services taxes won't set you back too much, either, if you live in Sierra Vista. At 8.1% for both taxes, the combined rates are lower than average for the 30 largest cities and towns in Arizona.",
    "Property taxes in Tempe are close to the midpoint for our list of the 30 largest cities and towns in Arizona. In 2017, the average rate in the city was $694 per $100,000 in home value. At that rate, a $250,000 home in Tempe would trigger an annual tax bill of about $1,736.",
    "The general retail sales tax rate in Tempe is average--8.1% when state, county and city rates are combined.",
    "Taxes on food are mixed in Tempe. The city's sales tax rate on groceries is slightly above average at 1.8%. However, the combined sales tax rate for restaurants and bars in Tempe is below average at 8.1%.",
    "Taxes on utilities and communications services are levied at a combined rate of 8.1% each. That's below our list's average for each tax.",
    "Property taxes in Arizona's largest city are middle-of-the-road when compared with the other cities and towns on our list. For 2017, the average property tax rate in Phoenix was $678 per $100,000 of home value. So, for a $250,000 home in the city, the owner will have to fork out about $1,695 per year in real property taxes.",
    "The combined general sales tax rate in Phoenix is 8.6%. That's about average for our list, so shoppers in the city aren't overly taxed.",
    "There's no sales tax on groceries in Phoenix, so feel free to stock your pantry tax-free if you live in the city. Phoenix has a lot of great restaurants and bars, too. You can expect to pay sales tax at a combined rate of 8.6%--which is average for our list--if you eat out or meet friends after work for a drink (or two).",
    "The combined sales tax rate for utilities in Phoenix is 9%, which is pretty much at the midpoint for our rankings. The tax on communications services in the city, however, is quite high. At 11% (combined state, county and city taxes), it's the third-highest rate on our list for this tax type.",
    "You might be pleasantly surprised to learn that property taxes aren't too bad in Surprise. If you're buying a home in the city, expect to see an average property tax rate of about $661 per $100,000 in home value (that's what it was in 2017). If our hypothetical couple bought a home worth $250,000 in Surprise, their annual property tax bill would be about $1,651, which is a below-average amount for our list of the 30 largest cities and towns in Arizona.",
    "At 8.5%, the combined state, county and city general sales tax in Surprise is middle-of-the-road for our rankings.",
    "There's no tax on groceries in Surprise. However, if you dine out, expect a 9.5% charge for sales tax on your bill. The sales tax rate on restaurants and bars in Surprise is the sixth-highest on our list.",
    "The combined sales tax rate on both utilities and communications services is 8.5% in Surprise. For both taxes, that's in the \"average\" range for our survey.",
    "Peoria is the first Arizona city on our list to get an overall \"below average\" ranking. That ranking is based largely on Peoria's below-average property taxes. In 2017, the city's average property tax rate was $676 per $100,000 in home value. That comes to a $1,691 annual property tax bill for a $250,000 home.",
    "Peoria's 8.1% combined general sales tax rates is in the \"average\" range for our rankings.",
    "The sales tax rate on groceries in Peoria is average as well--1.6%. The city's combined sales tax rate for restaurants and bars, however, is above average at 9.1%.",
    "It's a mixed bag for utility and communications services taxes in Peoria. The combined sales tax rate for utilities is 9.6%, which is the fifth-highest such rate in our rankings. But the combined sales tax rate for communications services is only 8.1%, which is slightly below the average for our list.",
    "The property tax rate in Bullhead City is average--$685 in 2017 for every $100,000 in home value, on average. So, for a $250,000 home in the city, the yearly property tax bill for our hypothetical couple should come to about $1,712.",
    "Bullhead City's combined general sales tax rate is below average for our rankings. Its only 7.85%.",
    "Food isn't taxed heavily in Bullhead City, either. There is no sales tax on groceries, and the city's combined sales tax rate for restaurants and bars in on the low end, at only 7.85%.",
    "Residents of Bullhead City don't pay too much in utility or communications services taxes, either. Both taxes are levied at a combined rate of 7.85%, which is in the \"below average\" range for our survey.",
    "Catalina Foothills is a low-tax area for everything except property taxes. For 2017, the average property tax rate in Catalina Foothills was $857 per $100,000 in home value. That's above average for our list. This means the owner of a $250,000 home in Catalina Foothills would pay about $2,143 in real property taxes each year.",
    "Here's were Catalina Foothills starts earning its overall below-average tax burden ranking. At 6.1%, the locale's combined state and county general sales tax rate is tied for the lowest on our list. (Catalina Foothills is a \"census designated place,\" which means that only state and county sales taxes apply there.)",
    "The trend continues for food purchases, whether you're shopping at the local supermarket or eating out. There are no sales taxes on groceries in Catalina Foothills. Plus, the combined sales tax rate for restaurants and bars is only 6.1% in the locale. Again, that's tied for the lowest such rate in our rankings.",
    "Ditto for taxes on utilities and communication services. The combined sales tax rate for each is only 6.1%, which is tied for the lowest rate in our survey for both taxes.",
    "Property taxes are really low in Flagstaff. In 2017, the average rate in the city was only $515 per $100,000 in home value. That rate translates into a $1,288 annual property tax bill for a $250,000 home in the city. That's the second-lowest amount in our rankings.",
    "On the other hand, the combined state, county and city general sales tax rate in Flagstaff is well above the average for our list at 9.181%.",
    "Taxes make the choice between eating at home or dining out a little easier in Flagstaff. There is no sales tax if you pick up food at the grocery store and have a nice home-cooked meal. If, however, you go out to eat in the city, you're going to see a jaw-dropping 11.181% sales tax charge added to your bill. That's the highest combined sales tax rate for restaurants and bars on our list.",
    "Taxes on utilities and communications services are above average in Flagstaff. The combined sales tax rate is 9.181% for both.",
    "The 2017 average property tax rate in San Tan Valley was $719 per $100,000 in home value. That's about average for the Arizona cities on our list. If you own a $250,000 home in San Tan Valley, your yearly property tax bill will be about $1,797.",
    "The general sales tax rate is low in San Tan Valley. Because it's a \"census designated place,\" there is no city- or town-level sales tax in the locale (although state and county sales taxes still apply). As a result, the combined general sales tax rate in San Tan Valley is only 7.2%, which is the fourth-lowest rate on our list.",
    "Taxes on food are low in San Tan Valley, too. There is no tax on groceries, and the combined (state and county) sales tax at restaurants and bars is imposed at only a 7.2% rate. Like the general sales tax rate in the locale, that's the fourth-lowest rate in our rankings.",
    "The combined sales tax rates on utilities and communications services are both set at 7.2%. Those are the fourth-lowest and fifth-lowest rates in our survey, respectively.",
    "Although some taxes aren't exactly light in Prescott, the city has the lowest property tax rate in our rankings. Prescott's 2017 average property tax rate was only $482 per $100,000 in home value. That comes out to a very comfortable $1,206 per year for a $250,000 home.",
    "Here's where the tax burden in Prescott gets a little uncomfortable: At 9.1%, the city's combined general sales tax rate is the ninth-highest on our list, which is an above-average ranking.",
    "Taxes on food are on the high end in Prescott, too. The city's sales tax on groceries is the fourth-highest on our list, at 2.75%. The combined sales tax rate at restaurants and bars in Prescott is above average as well, at 9.1%.",
    "Taxes on utilities and communications services are a bit better in Prescott. The combined sales tax rate for both is 9.1%. For the utilities tax, that's in the \"average\" range. For the communications services tax, that's in the \"above average\" range, but just barely.",
    "We start our countdown of the Arizona cities and towns with the lowest overall tax burden with the Town of Gilbert. It had a below-average property tax rate for 2017. With an average rate of $630 per $100,000 in home value, the owner of a $250,000 home in the town would owe about $1,574 in real property taxes per year.",
    "The combined general sales tax rate in Gilbert is on the low end, at only 7.8%.",
    "Sales tax on food and drinks is generally reasonable in Gilbert. The city imposes a 1.5% tax on groceries, which falls within the \"average\" range for our survey. The combined sales tax rate in the town for purchases at restaurants and bars is in the low range, at 7.8%.",
    "At 7.8%, the combined sales tax rates for both utilities and communications services are considered low when compared with the same rates for the other Arizona locales in our rankings.",
    "On average, Chandler residents paid only $606 per $100,000 in home value for property taxes in 2017. For our hypothetical couple, that translates into an annual tax bill of only $1,514 on a home worth $250,000. That's the sixth-lowest amount for the Grand Canyon State's 30 most populous places to live.",
    "Sales taxes in Chandler are low, too. The combined general sales tax rate in the city is only 7.8%.",
    "The city's sales tax on groceries is imposed at a reasonable 1.5% rate, which is average for our rankings. At 8.1%, the combined sales tax in Chandler for restaurants and bars is below average for our list.",
    "The combined sales tax rate on both utilities and communications services in Chandler is 9.05%. That's about average for both taxes when compared with the other Arizona cities and towns we're covering.",
    "In 2017, property taxes in Arizona's third-largest city averaged only $614 per $100,000 in home value. That means the owner of a $250,000 home in Mesa will owe about $1,811 in real property taxes annually. That puts the city in \"below average\" territory for our list as far as property taxes go.",
    "The combined state, county and city general sales tax rate in Mesa is 8.3%. That's about average for our rankings.",
    "Mesa does not impose a sales tax on groceries. Plus, at 8.3%, the combined sales tax for restaurants and bars in the city is below average. That's good news for hungry Mesa residents.",
    "The combined sales tax rate on both utilities and communications services is 8.3%. For utilities, that's a below-average rate; for communications services, it's average.",
    "Low property taxes are the main reason why Lake Havasu City is the third-most taxpayer-friendly locale on our list. With a 2017 average rate of $587 per $100,000 in home value, the owner of a $250,000 home in the city would owe about $1,468 in real property taxes per year. That's the fifth-lowest amount on our list.",
    "The general retail sales tax rate in Lake Havasu City is below the average for our survey. The combined rate is a reasonable 7.85%.",
    "There are no taxes on groceries in Lake Havasu City. However, if you're eating out or grabbing a beer at a local restaurant or bar, you'll be hit with an 8.85% sales tax (combined state, county and city taxes). That's a middle-of-the-pack rate for our rankings.",
    "Taxes on utilities and communications services in Lake Havasu City are below average for Arizona's 30 largest cities and towns. The combined sales tax rate for both tax types is 7.85%.",
    "Scottsdale has the third-lowest property taxes of the 30 cities and towns on our list. In 2017, the average property tax rate in the city was $540 per $100,000 in home value. That means the owner of a $250,000 home in Scottsdale pays about $1,350 per year in property taxes.",
    "The general sales tax rate in Scottdale is below average for our rankings. The city's combined rate is a reasonable 8.05%.",
    "Scottsdale imposes a 1.75% sales tax on groceries sold in the city. That's an average rate for our list. The 8.05% combined sales tax rate in the city for restaurants and bars is below average for the list.",
    "Taxes on utilities and communications in Scottsdale are also below average for our list. The combined rate for both taxes is 8.05%.",
    "Congratulations, Sun City residents! You have the lowest estimated tax burden out of the 30 most populous locales in Arizona. For all the taxes we're considering, this \"census designated place\" is never far from having the lowest tax rate in our rankings. For property taxes, Sun City has the fourth-lowest rate. The average property tax rate in 2017 was just $576 per $100,000 in home value. That comes to only $1,441 in taxes per year on a $250,000 home for our hypothetical couple.",
    "The combined general sales tax rate in Sun City is only 6.3%. That's the third-lowest rate in our rankings.",
    "You can shop at the supermarket in Sun City and leave without paying a penny in sales tax on your groceries. If you're dining out or gathering with friends at your favorite watering hole, the sales tax you'll pay in Sun City at a restaurant or bar is only 6.3%, which is the third-lowest such rate on our list.",
    "Sales taxes on utilities and communications services are also levied at a 6.3% rate in Sun City. For utilities, that's the third-lowest rate for the 30 largest cities and towns in Arizona. For communications services, that's the fourth-lowest rate.",
    "Our rankings are based on information collected from various sources. We then use that information to compare the local tax situation for a hypothetical couple living in each of the 30 most populous cities, towns and census-designated places in Arizona (based on data from the U.S. Census Bureau ). Consistent use of the data throughout the process is key to determining our rankings.",
    "We used the following local taxes for our comparison:",
    "Other local taxes may be imposed in the locations evaluated, but the listed taxes were determined to be the most relevant, impactful and widespread local taxes in Arizona.",
    "The local tax estimates are for a hypothetical couple. The hypothetical couple's combined income was set at $61,249, which is the average total income per Arizona return based on the latest IRS data available.",
    "The actual rankings are based on each location's \"Estimated Annual Local Taxes.\" This amount appears at the top of each slide along with other general information.",
    "\"Estimated Annual Local Taxes\" are the total of the location's estimated (1) property taxes; and (2) transaction privilege (sales) taxes on general retail sales, groceries, purchases at restaurants and bars, utilities (electricity, natural gas and water), and communications services (phone, television, etc.). These components are explained in more detail below.",
    "The local property tax rates described in the slides are based on 2017 data for median real property taxes paid and median home values from the U.S. Census Bureau . A formula using this information and the described rates was used to calculate the estimated property tax amounts.",
    "To make it easier to compare property taxes from one Arizona location to another, estimated property tax bills are provided for each location for a $250,000 home. According to data from the U.S. Census Bureau, the Arizona median home value in 2017 was $193,200. This figure was increased to $250,000 for our rankings.",
    "The combined state, county and local transaction privilege (sales) tax rates for general retail sales are based on information from the Arizona Department of Revenue . The rates are those in effect as of September 1, 2019.",
    "The estimated sales tax amounts included in the \"Estimated Annual Local Taxes\" total were generated using the IRS's Sales Tax Deduction Calculator . The calculator estimates the amount of sales tax actually paid by a taxpayer based on income, family size and zip code.",
    "The local transaction privilege (sales) tax rates for groceries (\"food for home consumption\") are based on information from the Arizona Department of Revenue . The rates are those in effect as of September 1, 2019.",
    "Additional data from the U.S. Bureau of Labor Statistics was used to estimate annual grocery purchases for our hypothetical couple.",
    "The combined state, county and local transaction privilege (sales) tax rates for restaurants and bars are based on information from the Arizona Department of Revenue . The rates are those in effect as of September 1, 2019.",
    "Additional data from the U.S. Bureau of Labor Statistics was used to estimate annual expenditures at restaurants and bars for our hypothetical couple.",
    "The combined state, county and local transaction privilege (sales) tax rates for utilities (electricity, natural gas and water) are based on information from the Arizona Department of Revenue . The rates are those in effect as of September 1, 2019.",
    "Additional data from the U.S. Bureau of Labor Statistics was used to estimate annual expenditures for utilities for our hypothetical couple.",
    "The combined state, county and local transaction privilege (sales) tax rates for communications services are based on information from the Arizona Department of Revenue . The rates are those in effect as of September 1, 2019.",
    "Taxable communications services include: two-way voice, sound, and/or video communication over a communications channel; one-way voice, sound, and/or video transmission or relay over a communications channel; facsimile transmissions; providing relay or repeater services; providing computer interface services over a communications channel; and time-sharing activities with a computer accomplished through the use of a communications channel.",
    "Additional data from various phone, internet and TV service providers was used to estimate annual expenditures for communications services for our hypothetical couple.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 02:47:08"
}