{
  "url": "https://www.nasdaq.com/article/why-you-should-invest-in-dividend-growth-etfs-now-cm1206973",
  "title": "Why You Should Invest in Dividend Growth ETFs Now - Nasdaq.com",
  "text": [
    "      (1:00) - Breaking Down The Current Market Environment (4:50) - Why Should Investors Consider High Dividend Paying   Stocks? (11:00) - ProShares Suite Of Dividend ETFs:   NOBL, REGL & SMDV  (17:05) - ProShares International Dividend ETFs (19:20) - How Do These ETFs Fit Into An Investors   Portfolio?       Podcast@Zacks.com   In this episode of ETF Spotlight, I speak with Kieran Kirwan, Senior Investment Strategist at ProShares. We discuss dividend growth ETFs that focus on high-quality companies with a history of dividend growth each year, even in times of stress. Markets have been on a wild ride of late, with trade tensions, global growth slowdown and geopolitical uncertainties. And inversion of the yield curve has led to recession fears. As a result, investors have been piling into safe haven assets like government bonds and gold, driving bond yields lower. Last week, the yield on 30-year Treasuries fell below the S&P 500′s dividend yield, for the first time since 2009. For long-term focused, income seeking investors, it makes more sense to look at dividend paying stocks. We discuss the investment case for dividend paying stocks in the current environment and why investors should consider dividend growth stocks and not high  dividend stocks  . About a third of S&P 500's total returns since 1960 can be attributed to dividends. Additionally, dividend growth stocks usually hold up relatively well in volatile markets as they have strong balance sheets with less leverage. The ProShares S&P 500 Dividend Aristocrats ETF NOBL  holds S&P 500 companies that have grown their dividend for at least 25 consecutive years, most doing so for 40 years or more. Its top holdings include Target TGT  , Procter & Gamble PG  and Lowe's LOW  . The ProShares S&P MidCap 400 Dividend Aristocrats ETF REGL  invests in mid-cap companies that have increased their dividends for at least 15 consecutive years. The ProShares Russell 2000 Dividend Growers ETF SMDV  focuses on the best dividend growers in the small-cap space that have grown their dividends for at least 10 consecutive years. ProShares also offers three international dividend growth ETFs-- EAFE Dividend Growers ETF EFAD  , Europe Dividend Growers ETF EUDV  and Emerging Markets Dividend Growers ETF EMDV  . These are excellent choices for investors looking for bargain opportunities in international markets. To learn more about these ETFs, please visit  ProShares.com  . Make sure to be on the lookout for the next edition of ETF Spotlight! If you have any comments or questions, please email podcast@zacks.com.  Want key ETF info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.  Get it free >>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Lowe's Companies, Inc. (LOW): Free Stock Analysis Report   ProShares Russell 2000 Dividend Growers ETF (SMDV): ETF Research Reports   ProShares S&P 500 Dividend Aristocrats ETF (NOBL): ETF Research Reports   ProShares S&P MidCap 400 Dividend Aristocrats ETF (REGL): ETF Research Reports   ProShares MSCI Emerging Markets Dividend Growers ETF (EMDV): ETF Research Reports   ProShares MSCI Europe Dividend Growers ETF (EUDV): ETF Research Reports   Target Corporation (TGT): Free Stock Analysis Report   Procter & Gamble Company (The) (PG): Free Stock Analysis Report   ProShares MSCI EAFE Dividend Growers ETF (EFAD): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "In this episode of ETF Spotlight, I speak with Kieran Kirwan, Senior Investment Strategist at ProShares. We discuss dividend growth ETFs that focus on high-quality companies with a history of dividend growth each year, even in times of stress.",
    "Markets have been on a wild ride of late, with trade tensions, global growth slowdown and geopolitical uncertainties. And inversion of the yield curve has led to recession fears. As a result, investors have been piling into safe haven assets like government bonds and gold, driving bond yields lower.",
    "Last week, the yield on 30-year Treasuries fell below the S&P 500′s dividend yield, for the first time since 2009. For long-term focused, income seeking investors, it makes more sense to look at dividend paying stocks.",
    "We discuss the investment case for dividend paying stocks in the current environment and why investors should consider dividend growth stocks and not high  dividend stocks  .",
    "About a third of S&P 500's total returns since 1960 can be attributed to dividends. Additionally, dividend growth stocks usually hold up relatively well in volatile markets as they have strong balance sheets with less leverage.",
    "The ProShares S&P 500 Dividend Aristocrats ETF NOBL  holds S&P 500 companies that have grown their dividend for at least 25 consecutive years, most doing so for 40 years or more. Its top holdings include Target TGT  , Procter & Gamble PG  and Lowe's LOW  .",
    "The ProShares S&P MidCap 400 Dividend Aristocrats ETF REGL  invests in mid-cap companies that have increased their dividends for at least 15 consecutive years.",
    "The ProShares Russell 2000 Dividend Growers ETF SMDV  focuses on the best dividend growers in the small-cap space that have grown their dividends for at least 10 consecutive years.",
    "ProShares also offers three international dividend growth ETFs-- EAFE Dividend Growers ETF EFAD  , Europe Dividend Growers ETF EUDV  and Emerging Markets Dividend Growers ETF EMDV  .",
    "These are excellent choices for investors looking for bargain opportunities in international markets.",
    "To learn more about these ETFs, please visit  ProShares.com  .",
    "Make sure to be on the lookout for the next edition of ETF Spotlight! If you have any comments or questions, please email podcast@zacks.com.",
    " Want key ETF info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.  Get it free >> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 17:00:00"
}