{
  "url": "https://www.nasdaq.com/article/chime-varo-launch-free-programs-to-pay-account-overdrafts-cm1210365",
  "title": "Chime, Varo Launch Free Programs to Pay Account Overdrafts - Nasdaq.com",
  "text": [
    " Chime and Varo banking customers who fall into the red with   certain checking account transactions may find that their bank   will cover them - and without a fee. The two mobile banking firms launched similar no-fee overdraft   programs within days of each other. These are the equivalent of   the overdraft coverage service that traditional banks offer for a   fee, typically around $34 per transaction - one of the steepest   fees that banks charge. How they differ Chime's SpotMe may cover customers whose checking accounts dip   as much as $100 past the money available. Varo's No Fee Overdraft   program will cover transactions only up to $50 over the account   balance.makeArticleAd(); Chime covers only debit card purchases, while Varo helps   customers with purchases, transfers, checks and bill   payments.      Options at other banks Other banks have similar fee-free alternatives to traditional   overdraft services, such as allowing customers to overdraw up to   $5 before charging a fee. The prepaid debit card Netspend has a   free program called a \"purchase cushion\" that may cover up to a   $10 overdraft. Netspend charges additional regular fees and lacks   some of the banking features Chime and Varo offer, such as   check-writing and a free ATM network. (To see more details,   including about their free checking accounts, read NerdWallet's   Chime review    and   Varo review    .) More details Both Chime and Varo require customers to have monthly direct   deposits to use the programs, and Varo tacks on an additional   qualification of making at least five debit card purchases   monthly. Banks typically don't require direct deposits or a set   number of monthly payments for customers to take advantage of   overdraft services. Transactions that go past the banks' overdraft limits or   aren't covered by the programs would be rejected without a fee.   But even Chime's and Varo's limited bailouts could be helpful for   customers. Across banks, debit card transactions that result in   overdraft fees are often small; the median amount is $24,   according to a study by the Consumer Financial Protection   Bureau. Neither Chime nor Varo offers other overdraft services common   at many banks, such as overdraft lines of credit or overdraft   protection transfers linked to a savings account. While these   typically carry fees, they don't have as low an overdraft limit   as $20 or $50. You can find some   banks with cheap overdraft programs    .   More From NerdWallet    Radius Bank Launches New Cash Back,         Interest-Bearing Checking Account   4 Smart Ways to Split Bills With Friends         While Traveling Abroad   How to Bypass ATM Fees While You're on the         Road      Spencer Tierney is a writer at NerdWallet. Email:       spencer.tierney@nerdwallet.com. Twitter: @SpencerNerd.   The article Chime, Varo Launch Free Programs to Pay Account   Overdrafts originally appeared on NerdWallet. ",
    "Chime and Varo banking customers who fall into the red with   certain checking account transactions may find that their bank   will cover them - and without a fee.",
    "The two mobile banking firms launched similar no-fee overdraft   programs within days of each other. These are the equivalent of   the overdraft coverage service that traditional banks offer for a   fee, typically around $34 per transaction - one of the steepest   fees that banks charge.",
    "Chime's SpotMe may cover customers whose checking accounts dip   as much as $100 past the money available. Varo's No Fee Overdraft   program will cover transactions only up to $50 over the account   balance.",
    "Chime covers only debit card purchases, while Varo helps   customers with purchases, transfers, checks and bill   payments.",
    "Other banks have similar fee-free alternatives to traditional   overdraft services, such as allowing customers to overdraw up to   $5 before charging a fee. The prepaid debit card Netspend has a   free program called a \"purchase cushion\" that may cover up to a   $10 overdraft.",
    "Netspend charges additional regular fees and lacks   some of the banking features Chime and Varo offer, such as   check-writing and a free ATM network. (To see more details,   including about their free checking accounts, read NerdWallet's   Chime review    and   Varo review    .)",
    "Both Chime and Varo require customers to have monthly direct   deposits to use the programs, and Varo tacks on an additional   qualification of making at least five debit card purchases   monthly. Banks typically don't require direct deposits or a set   number of monthly payments for customers to take advantage of   overdraft services.",
    "Transactions that go past the banks' overdraft limits or   aren't covered by the programs would be rejected without a fee.   But even Chime's and Varo's limited bailouts could be helpful for   customers. Across banks, debit card transactions that result in   overdraft fees are often small; the median amount is $24,   according to a study by the Consumer Financial Protection   Bureau.",
    "Neither Chime nor Varo offers other overdraft services common   at many banks, such as overdraft lines of credit or overdraft   protection transfers linked to a savings account. While these   typically carry fees, they don't have as low an overdraft limit   as $20 or $50. You can find some   banks with cheap overdraft programs    .",
    "  More From NerdWallet    Radius Bank Launches New Cash Back,         Interest-Bearing Checking Account   4 Smart Ways to Split Bills With Friends         While Traveling Abroad   How to Bypass ATM Fees While You're on the         Road   ",
    " More From NerdWallet ",
    "  Spencer Tierney is a writer at NerdWallet. Email:       spencer.tierney@nerdwallet.com. Twitter: @SpencerNerd.  ",
    " Spencer Tierney is a writer at NerdWallet. Email:       spencer.tierney@nerdwallet.com. Twitter: @SpencerNerd. ",
    "Spencer Tierney is a writer at NerdWallet. Email:       spencer.tierney@nerdwallet.com. Twitter: @SpencerNerd.",
    "The article Chime, Varo Launch Free Programs to Pay Account   Overdrafts originally appeared on NerdWallet.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:09:49"
}