{
  "url": "https://www.nasdaq.com/article/boeing-shares-ba-dip-as-737-max-may-be-grounded-through-holiday-season-cm1206938",
  "title": "Boeing Shares (BA) Dip as 737 MAX May Be Grounded Through Holiday Season - Nasdaq.com",
  "text": [
    " Boeing BA  shares fell roughly 3% in intraday trading today after news broke that the company may not return its 737 MAX in time for the busy holiday season. Friction between Boeing and international air safety authorities threaten a new delay of the return of their 737 MAX fleet. Regulators from the US, Europe, Brazil, and elsewhere complained that Boeing failed to provide technical details and answers to specifics about modifications in the operation of MAX flight-control computers. As a result, Boeing is now forced to resubmit briefing documents describing proposed software changes.  Airlines Push Back 737 Return Dates   Major airlines have been pushing back the dates they expect to reincorporate the Boeing 737 into their fleets. Southwest Airlines LUV  reported in late July that it would not be flying the Boeing 737 until next year. United UAL  and American AAL  Airlines have both canceled 737 flights until December. Forcing Boeing to resubmit its briefing documents sets the company back by several weeks and diminishes any chance it had of returning by the end of the year holidays. Industry officials in Europe do not believe they will be seeing the Boeing plane return to service until January at the earliest. European regulators will likely need more time to examine the changes made to the 737 MAX's flight control computers and its MCAS. Misfires from the MCAS were the causes of two fatal crashes and resulted in the grounding of the airplane in mid-March. A Federal Aviation Administration spokesman said that the agency continues to follow a thorough process, not a prescribed timeline. Airlines do not want to run the risk of counting on the plane for it to end up being hit with an additional delay. People flying during the busy holiday season don't have much flexibility or patience for last minute changes. Southwest commented, \"By proactively removing the MAX from scheduled service, we can reduce last-minute flight cancellations and unexpected disruptions to our customers' travel plans.\"  Takeaway  Boeing is hoping to have the 737 MAX back in the air early in their fourth quarter, but the continued friction between the company and international air safety regulators have made it difficult. Boeing has submitted, or been on the verge of submitting, three earlier versions of software fixes only to be delayed by various technical issues. Airlines are beginning to move on from the Boeing aircraft as their busy holiday traveling season is just around the corner. Continued difficulties with getting the FAA's approval to have the plane back in the sky poses the risk of major airliners making plans without the aircraft in 2020. Boeing has seen its shares fall approximately 20% since early March, falling behind the Aerospace-Defense market.     Legalizing THIS Could Be Even Bigger than Marijuana    makeArticleAd();   Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.   Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>       Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Southwest Airlines Co. (LUV): Free Stock Analysis Report   American Airlines Group Inc. (AAL): Free Stock Analysis Report   United Airlines Holdings Inc (UAL): Free Stock Analysis Report   The Boeing Company (BA): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Boeing BA  shares fell roughly 3% in intraday trading today after news broke that the company may not return its 737 MAX in time for the busy holiday season. Friction between Boeing and international air safety authorities threaten a new delay of the return of their 737 MAX fleet. Regulators from the US, Europe, Brazil, and elsewhere complained that Boeing failed to provide technical details and answers to specifics about modifications in the operation of MAX flight-control computers. As a result, Boeing is now forced to resubmit briefing documents describing proposed software changes.",
    " Airlines Push Back 737 Return Dates  ",
    "Major airlines have been pushing back the dates they expect to reincorporate the Boeing 737 into their fleets. Southwest Airlines LUV  reported in late July that it would not be flying the Boeing 737 until next year. United UAL  and American AAL  Airlines have both canceled 737 flights until December. Forcing Boeing to resubmit its briefing documents sets the company back by several weeks and diminishes any chance it had of returning by the end of the year holidays. Industry officials in Europe do not believe they will be seeing the Boeing plane return to service until January at the earliest.",
    "European regulators will likely need more time to examine the changes made to the 737 MAX's flight control computers and its MCAS. Misfires from the MCAS were the causes of two fatal crashes and resulted in the grounding of the airplane in mid-March. A Federal Aviation Administration spokesman said that the agency continues to follow a thorough process, not a prescribed timeline.",
    "Airlines do not want to run the risk of counting on the plane for it to end up being hit with an additional delay. People flying during the busy holiday season don't have much flexibility or patience for last minute changes. Southwest commented, \"By proactively removing the MAX from scheduled service, we can reduce last-minute flight cancellations and unexpected disruptions to our customers' travel plans.\"",
    " Takeaway ",
    "Boeing is hoping to have the 737 MAX back in the air early in their fourth quarter, but the continued friction between the company and international air safety regulators have made it difficult. Boeing has submitted, or been on the verge of submitting, three earlier versions of software fixes only to be delayed by various technical issues. Airlines are beginning to move on from the Boeing aircraft as their busy holiday traveling season is just around the corner. Continued difficulties with getting the FAA's approval to have the plane back in the sky poses the risk of major airliners making plans without the aircraft in 2020. Boeing has seen its shares fall approximately 20% since early March, falling behind the Aerospace-Defense market.",
    " Legalizing THIS Could Be Even Bigger than Marijuana    makeArticleAd();  ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.   Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "   See these 5 \"sin stocks\" now >>    ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:13:00"
}