{
  "url": "https://www.nasdaq.com/article/its-time-to-quit-japanese-staffing-giant-recruit-20190912-00129",
  "title": "It's time to quit Japanese staffing giant Recruit - Nasdaq.com",
  "text": [
    "By Jeffrey Goldfarb",
    "(The author is a Reuters Breakingviews columnist.)",
    "LONDON, Sept 12 (Reuters Breakingviews) - Recruit  has been doing a bang-up job, but it's time for investors to take a leave of absence. The sale of a combined 7% stake in the Tokyo-based human resources conglomerate calls attention to remaining cross-holdings, a hefty overhang on the stock. Worse, a market valuation of some $50 billion imputes heady growth, but insufficiently discounts stiff challenges ahead.",
    "Also problematic is the decision by 13 owners, including Toppan Printing  and Mizuho Bank, to offload some $3 billion of Recruit stock. A national push to unwind these sorts of cosy corporate arrangements suggests there's more to come. Even after the deal, local companies hold more than 20% of Recruit. To cushion the blow, Recruit is spending over $700 million to buy back shares trading near an all-time high.",
    "That rich price incorporates chirpy assumptions, according to Breakingviews calculations using divisional forecasts from CLSA and Jefferies. Start with the so-called media and solutions business, a collection of websites and apps for recruiting, restaurants and more. Apply a multiple of 11 times expected EBITDA - the average of a group of imperfect comparisons including Yahoo Japan  - and that's almost $19 billion. Put the domestic staffing unit on a par with its local peers, and the overseas one on a premium to rivals because of its higher margins, and they're worth more than $7 billion.",
    "To get the rest of the way to $50 billion means valuing the Indeed and Glassdoor job sites at an eye-popping 35 times EBITDA. That's optimistic given the economic omens and fresh competition. The downturn a decade ago hurt profitability at the likes of Hays  and Manpower . And Google's fledgling job listings service could become a bigger threat to Recruit.",
    "It already expects rapid revenue growth in its HR tech business, where Indeed is housed, to cool a bit. This growing list of obstacles will make justifying Recruit's valuation increasingly harder work.",
    "\nOn Twitter\n",
    "CONTEXT NEWS",
    "- Thirteen shareholders in Recruit Holdings on Sept. 10 raised 325 billion yen, or about $3 billion, from selling stock in the Japanese human resources giant at about a 3% discount, according to IFR. The shares on offer, including an overallotment option, represented about 7.2% of Recruit's total shares outstanding.",
    "- The company said on Aug. 28, when it disclosed the secondary share sale, that it was implementing an 80 billion yen stock repurchase plan to buy back up to 30 million shares.",
    "- Recruit said the coordinated offering was designed to reduce the impact on its stock price and to expand its shareholder base globally. Selling shareholders included Toppan Printing, NTT Data and Sumitomo Mitsui Banking Corp.",
    "- The company's shares closed at 3,237 yen apiece in Tokyo on Sept. 12.",
    "Recruit announcement"
  ],
  "published_datetime": "2019-09-12 04:51:00"
}