{
  "url": "https://www.nasdaq.com/article/pre-market-most-active-for-sep-11-2019-nymt-mnk-nok-qqq-roku-lxrx-fran-zs-t-san-gme-teva-cm1210090",
  "title": "Pre-Market Most Active for Sep 11, 2019 : NYMT, MNK, NOK, QQQ, ROKU, LXRX, FRAN, ZS, T, SAN, GME, TEVA - Nasdaq.com",
  "text": [
    "The NASDAQ 100 Pre-Market Indicator  is up 7.55 to 7,822.29. The total Pre-Market volume is currently 13,505,069 shares traded.       The following are the  most active stocks for the pre-market session  :  makeArticleAd();    New York Mortgage Trust, Inc. ( NYMT  ) is -0.19 at $6.09, with 7,558,124 shares traded. NYMT's current last sale is 97.44% of the target price of $6.25.    Mallinckrodt plc ( MNK  ) is -0.24 at $3.64, with 947,969 shares traded. MNK's current last sale is 45.5% of the target price of $8.    Nokia Corporation ( NOK  ) is -0.01 at $5.09, with 804,225 shares traded. As reported by Zacks, the current mean recommendation for NOK is in the \"buy range\".    Invesco QQQ Trust, Series 1 ( QQQ  ) is +0.44 at $191.08, with 390,274 shares traded. This represents a 33.19% increase from its 52 Week Low.    Roku, Inc. ( ROKU  ) is +2.17 at $146.31, with 321,075 shares traded. ROKU's current last sale is 133.01% of the target price of $110.    Lexicon Pharmaceuticals, Inc. ( LXRX  ) is +0.38 at $2.10, with 296,452 shares traded. LXRX's current last sale is 60% of the target price of $3.5.    Francesca's Holdings Corporation ( FRAN  ) is +0.9 at $11.30, with 279,317 shares traded. As reported in the last short interest update the days to cover for FRAN is 9.174524; this calculation is based on the average trading volume of the stock.    Zscaler, Inc. ( ZS  ) is -12.1 at $49.50, with 262,691 shares traded. ZS's current last sale is 61.88% of the target price of $80.    AT&T Inc. ( T  ) is +0.43 at $38.01, with 251,570 shares traded. As reported by Zacks, the current mean recommendation for T is in the \"buy range\".    Banco Santander, S.A. ( SAN  ) is -0.02 at $4.07, with 237,478 shares traded. SAN's current last sale is 81.4% of the target price of $5.    Gamestop Corporation ( GME  ) is -0.8 at $4.29, with 192,275 shares traded. GME's current last sale is 61.29% of the target price of $7.    Teva Pharmaceutical Industries Limited ( TEVA  ) is +0.09 at $8.22, with 154,830 shares traded. TEVA's current last sale is 91.33% of the target price of $9.",
    "    The following are the  most active stocks for the pre-market session  :",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:23:54"
}