{
  "url": "https://www.nasdaq.com/article/alcoa-stock-upgraded-what-you-need-to-know-cm1210761",
  "title": "Alcoa Stock Upgraded: What You Need to Know - Nasdaq.com",
  "text": [
    "  Every day, Wall Street analysts upgrade some stocks,     downgrade others, and \"initiate coverage\" on a few more. But do     these analysts even know what they're talking about? Today,     we're taking one high-profile Wall Street pick and putting it     under the microscope....  President Donald Trump's   trade war    with China has been largely bad news for a number of stocks, but   for one company in particular --   Alcoa    (NYSE: AA) -- that trade war pales in comparison to the \"trade   peace\" with Canada and Mexico. It's been nearly four months since the Trump administration   announced it was   lifting tariffs    on steel and aluminum imports from America's neighbors to the   immediate north and south. In the months following that   announcement, shares of Alcoa lost as much as 32% of their value   -- part of the stock's roughly 50% decline in value over the past   year.makeArticleAd(); Alcoa's share price has been slowly climbing in recent weeks,   however. And one announcement today could help to maintain that   uptrend as we move toward next month's Q3 earnings release.   Here's what you need to know.   Image source: Getty Images.  Upgrading Alcoa Early this morning, analysts at investment banker Credit   Suisse announced they're upgrading shares of Alcoa stock to an   outperform rating, after the stock's 50% fall in price. They feel   the shutdown of Alumina Partners of Jamaica (\"Alpart,\" a   Chinese-owned alumina refinery), announced last month, is likely   to curtail global aluminum production at a time of \"significant   capacity cuts in China\" and an \"end to inventory destocking\"   globally. At the same time, \"key raw material inputs for alumina,   caustic soda, energy, and calcined coke\" are declining in price   and boosting profit margin for Alcoa \"significantly,\" even as   London Metal Exchange prices for the metal remain \"firm,\" Credit   Suisse explained in a note   covered on StreetInsider.com    today. And yet, despite all these positive developments, Alcoa shares   today still sell for half what they cost a year ago, leaving the   shares \"significantly undervalued on most metrics,\" the analysts   say. But which metrics are these? Valuing Alcoa If you value Alcoa by its ratio of price to book value (0.8),   for example, the stock actually looks significantly pricier than   other well-known metals-makers such as   ArcelorMittal    (P/B of 0.4) or   U.S. Steel    (P/B of 0.5). Similarly, Alcoa costs more when valued on its   price-to-sales ratio. However, Alcoa can't be valued on price divided by its   trailing-12-month earnings -- its price-to-earnings ratio,   probably the most widely   accepted valuation metric    for profitable companies -- because over the past 12 months,   Alcoa has not earned any profit at all. It lost $579 million   instead. And yet, a closer look at the company's numbers (helpfully   provided by our friends at      S&P Global Market Intelligence    ) reveals that much of this loss was \"non-cash,\" and a result of   around $430 million in restructuring charges deducted from   earnings over the trailing 12 months. Credit Suisse believes that   while these restructuring efforts have depressed earnings in the   short term, they should provide \"material tailwinds\" to the   company's free cash flow beginning early next year. Valuing Alcoa on forward earnings, analysts see the stock as   selling for only about 15.7 times next year's earnings, which   doesn't seem excessive. Indeed, the stock might even be cheaper than that. Valuing Alcoa...on cash Consider the company's cash flow statement, for example.   According to S&P Global data, over the past year -- a year,   remember, in which Alcoa has reported nothing but losses under   generally accepted accounting principles (   GAAP    ) -- Alcoa actually generated positive free cash flow of $685   million. Weighed against the company's market capitalization of   $3.5 billion, and adjusting for net debt to arrive at its   enterprise value    , this leaves Alcoa stock selling for only about 10 times free   cash flow, which doesn't seem expensive at all. Granted, as with GAAP earnings, analysts are forecasting   negative free cash flow for Alcoa by the end of this year. Next   year's quarterly report should tell us whether that prediction is   likely to be correct, or if Alcoa can maintain through the end of   this year the strong rate of FCF production that it's exhibited   so far. Either way, consensus forecasts for   next    year and for 2021 back up Credit Suisse's predictions of   \"material tailwinds\" emerging, and $667 million in cash profit   being collected next year (on par with trailing FCF), growing to   $735 million in 2021. Despite the weak GAAP earnings number, Alcoa is continuing to   throw off impressive levels of cash despite the lifting of tariff   protections against imports from Canada and Mexico. With the   stock price still not reflecting that fact, Credit Suisse's   upgrade today looks both timely and correct.   10 stocks we like better than Alcoa       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Alcoa wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Rich Smith      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    " Every day, Wall Street analysts upgrade some stocks,     downgrade others, and \"initiate coverage\" on a few more. But do     these analysts even know what they're talking about? Today,     we're taking one high-profile Wall Street pick and putting it     under the microscope.... ",
    "President Donald Trump's   trade war    with China has been largely bad news for a number of stocks, but   for one company in particular --   Alcoa    (NYSE: AA) -- that trade war pales in comparison to the \"trade   peace\" with Canada and Mexico.",
    "It's been nearly four months since the Trump administration   announced it was   lifting tariffs    on steel and aluminum imports from America's neighbors to the   immediate north and south. In the months following that   announcement, shares of Alcoa lost as much as 32% of their value   -- part of the stock's roughly 50% decline in value over the past   year.",
    "Alcoa's share price has been slowly climbing in recent weeks,   however. And one announcement today could help to maintain that   uptrend as we move toward next month's Q3 earnings release.   Here's what you need to know.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Early this morning, analysts at investment banker Credit   Suisse announced they're upgrading shares of Alcoa stock to an   outperform rating, after the stock's 50% fall in price. They feel   the shutdown of Alumina Partners of Jamaica (\"Alpart,\" a   Chinese-owned alumina refinery), announced last month, is likely   to curtail global aluminum production at a time of \"significant   capacity cuts in China\" and an \"end to inventory destocking\"   globally.",
    "At the same time, \"key raw material inputs for alumina,   caustic soda, energy, and calcined coke\" are declining in price   and boosting profit margin for Alcoa \"significantly,\" even as   London Metal Exchange prices for the metal remain \"firm,\" Credit   Suisse explained in a note   covered on StreetInsider.com    today.",
    "And yet, despite all these positive developments, Alcoa shares   today still sell for half what they cost a year ago, leaving the   shares \"significantly undervalued on most metrics,\" the analysts   say.",
    "But which metrics are these?",
    "If you value Alcoa by its ratio of price to book value (0.8),   for example, the stock actually looks significantly pricier than   other well-known metals-makers such as   ArcelorMittal    (P/B of 0.4) or   U.S. Steel    (P/B of 0.5). Similarly, Alcoa costs more when valued on its   price-to-sales ratio.",
    "However, Alcoa can't be valued on price divided by its   trailing-12-month earnings -- its price-to-earnings ratio,   probably the most widely   accepted valuation metric    for profitable companies -- because over the past 12 months,   Alcoa has not earned any profit at all. It lost $579 million   instead.",
    "And yet, a closer look at the company's numbers (helpfully   provided by our friends at      S&P Global Market Intelligence    ) reveals that much of this loss was \"non-cash,\" and a result of   around $430 million in restructuring charges deducted from   earnings over the trailing 12 months. Credit Suisse believes that   while these restructuring efforts have depressed earnings in the   short term, they should provide \"material tailwinds\" to the   company's free cash flow beginning early next year.",
    "Valuing Alcoa on forward earnings, analysts see the stock as   selling for only about 15.7 times next year's earnings, which   doesn't seem excessive.",
    "Indeed, the stock might even be cheaper than that.",
    "Consider the company's cash flow statement, for example.   According to S&P Global data, over the past year -- a year,   remember, in which Alcoa has reported nothing but losses under   generally accepted accounting principles (   GAAP    ) -- Alcoa actually generated positive free cash flow of $685   million. Weighed against the company's market capitalization of   $3.5 billion, and adjusting for net debt to arrive at its   enterprise value    , this leaves Alcoa stock selling for only about 10 times free   cash flow, which doesn't seem expensive at all.",
    "Granted, as with GAAP earnings, analysts are forecasting   negative free cash flow for Alcoa by the end of this year. Next   year's quarterly report should tell us whether that prediction is   likely to be correct, or if Alcoa can maintain through the end of   this year the strong rate of FCF production that it's exhibited   so far. Either way, consensus forecasts for   next    year and for 2021 back up Credit Suisse's predictions of   \"material tailwinds\" emerging, and $667 million in cash profit   being collected next year (on par with trailing FCF), growing to   $735 million in 2021.",
    "Despite the weak GAAP earnings number, Alcoa is continuing to   throw off impressive levels of cash despite the lifting of tariff   protections against imports from Canada and Mexico. With the   stock price still not reflecting that fact, Credit Suisse's   upgrade today looks both timely and correct.",
    "  10 stocks we like better than Alcoa       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Alcoa wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Alcoa       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Alcoa wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Rich Smith      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 04:08:00"
}