{
  "url": "https://www.nasdaq.com/article/this-is-why-first-american-financial-faf-is-a-great-dividend-stock-cm1210468",
  "title": "This is Why First American Financial (FAF) is a Great Dividend Stock - Nasdaq.com",
  "text": [
    " Getting big returns from financial portfolios, whether through stocks, bonds, ETFs, other securities, or a combination of all, is an investor's dream. However, when you're an income investor, your primary focus is generating consistent cash flow from each of your liquid investments. While cash flow can come from bond interest or interest from other types of investments, income investors hone in on dividends. A dividend is the distribution of a company's earnings paid out to shareholders; it's often viewed by its dividend yield, a metric that measures a dividend as a percent of the current stock price. Many academic studies show tha t dividends  make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.  First American Financial in Focus  Headquartered in Santa Ana, First American Financial (FAF) is a Finance stock that has seen a price change of 32.57% so far this year. The financial services company is paying out a dividend of $0.42 per share at the moment, with a dividend yield of 2.84% compared to the Insurance - Property and Casualty industry's yield of 1.24% and the S&P 500's yield of 1.9%. In terms of dividend growth, the company's current annualized dividend of $1.68 is up 5% from last year. First American Financial has increased its dividend 5 times on a year-over-year basis over the last 5 years for an average annual increase of 15.39%. Future dividend growth will depend on earnings growth as well as payout ratio, which is the proportion of a company's annual earnings per share that it pays out as a dividend. First American Financial's current payout ratio is 34%, meaning it paid out 34% of its trailing 12-month EPS as dividend. Earnings growth looks solid for FAF for this fiscal year. The Zacks Consensus Estimate for 2019 is $4.93 per share, which represents a year-over-year growth rate of 17.66%.  Bottom Line  Investors like dividends for a variety of different reasons, from tax advantages and decreasing overall portfolio risk to considerably improving stock investing profits. But, not every company offers a quarterly payout. Big, established firms that have more secure profits are often seen as the best dividend options, but it's fairly uncommon to see high-growth businesses or tech start-ups offer their stockholders a dividend. Income investors have to be mindful of the fact that high-yielding stocks tend to struggle during periods of rising interest rates. That said, they can take comfort from the fact that FAF is not only an attractive dividend play, but is also a compelling investment opportunity with a Zacks Rank of #2 (Buy).   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  First American Financial Corporation (FAF): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Getting big returns from financial portfolios, whether through stocks, bonds, ETFs, other securities, or a combination of all, is an investor's dream. However, when you're an income investor, your primary focus is generating consistent cash flow from each of your liquid investments.",
    "While cash flow can come from bond interest or interest from other types of investments, income investors hone in on dividends. A dividend is the distribution of a company's earnings paid out to shareholders; it's often viewed by its dividend yield, a metric that measures a dividend as a percent of the current stock price. Many academic studies show tha t dividends  make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.",
    " First American Financial in Focus ",
    "Headquartered in Santa Ana, First American Financial (FAF) is a Finance stock that has seen a price change of 32.57% so far this year. The financial services company is paying out a dividend of $0.42 per share at the moment, with a dividend yield of 2.84% compared to the Insurance - Property and Casualty industry's yield of 1.24% and the S&P 500's yield of 1.9%.",
    "In terms of dividend growth, the company's current annualized dividend of $1.68 is up 5% from last year. First American Financial has increased its dividend 5 times on a year-over-year basis over the last 5 years for an average annual increase of 15.39%. Future dividend growth will depend on earnings growth as well as payout ratio, which is the proportion of a company's annual earnings per share that it pays out as a dividend. First American Financial's current payout ratio is 34%, meaning it paid out 34% of its trailing 12-month EPS as dividend.",
    "Earnings growth looks solid for FAF for this fiscal year. The Zacks Consensus Estimate for 2019 is $4.93 per share, which represents a year-over-year growth rate of 17.66%.",
    " Bottom Line ",
    "Investors like dividends for a variety of different reasons, from tax advantages and decreasing overall portfolio risk to considerably improving stock investing profits. But, not every company offers a quarterly payout.",
    "Big, established firms that have more secure profits are often seen as the best dividend options, but it's fairly uncommon to see high-growth businesses or tech start-ups offer their stockholders a dividend. Income investors have to be mindful of the fact that high-yielding stocks tend to struggle during periods of rising interest rates. That said, they can take comfort from the fact that FAF is not only an attractive dividend play, but is also a compelling investment opportunity with a Zacks Rank of #2 (Buy).",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:15:12"
}