{
  "url": "https://www.nasdaq.com/article/ventas-completes-investment-in-quebec-portfolio-with-lgm-cm1207977",
  "title": "Ventas Completes Investment in Quebec Portfolio With LGM - Nasdaq.com",
  "text": [
    "  Ventas, Inc. VTR  recently completed its investment in a portfolio of Class-A apartment-like senior housing assets in the thriving Quebec senior-housing market through an equity partnership with Le Groupe Maurice (\"LGM\"). LGM will continue to manage the portfolio under its brand. The transaction will help strengthen Ventas' foothold in Canada.  The portfolio is valued at $1.8 billion and consists of a highly-occupied stabilized portfolio, communities in lease-up as well as assets under development. Specifically, Ventas has acquired 87% of 34 communities rather than acquiring 85% of 35 communities, as previously announced this June, due to tax and legal structuring considerations. (Read more:  Ventas to Buy Seniors Housing Portfolio Worth   $1.8B   ).  makeArticleAd();  The investment is a strategic fit as it will help Ventas diversify its assets, business model and operator base. Additionally, Ventas has the rights to fund and own all additional developments through an exclusive pipeline agreement with LGM. This will create a new platform for growth together with LGM. The transaction will enable the companies to cater to the growing demand of an outstanding lifestyle for seniors. Additionally, the high-quality portfolio is highly occupied, offers stable cash flows, and built-in growth from existing and new development projects. On completion of the investment, pro-forma net operating income (NOI) from Ventas' Canadian senior housing operating property (\"SHOP\") portfolio is expected to increase 10 percentage points to 22% of its total annualized SHOP NOI. Further, the company's Canadian assets will account for 8% of its NOI, while LGM will represent 4% NOI. The deal is expected to be neutral to 2019 normalized funds from operations (FFO) per share and accretive to 2020 normalized FFO by around 3 cents per share. Currently, Ventas carries a Zacks Rank #3 (Hold). In the year-to-date period, shares of the company have rallied 27.9%, outperforming the  industry  's growth of 26.1%.      Top Picks  OUTFRONT Media Inc. OUT  currently sports a Zacks Rank of 1 (Strong Buy). The Zacks Consensus Estimate for 2019 FFO per share has been revised marginally upward to $2.34 over the past month. You can see   the complete list of today's Zacks #1 Rank stocks here  .  Crown Castle International Corp. CCI  holds a Zacks Rank of 2 (Buy), at present. The Zacks Consensus Estimate for the current-year FFO per share remained unchanged at $5.92 in the past month. Extra Space Storage Inc EXR  is another Zacks #2 Ranked company, currently. The Zacks Consensus Estimate for the ongoing year's FFO per share has been revised marginally upward to $4.86 in a month's time. Note:  Anything related to earnings presented in this write-up represent funds from operations (FFO) - a widely used metric to gauge the performance of REITs.   It's Illegal in 42 States, But Investors Will Make Billions Legally    In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.    That's twice as much as they spend on marijuana, legally or otherwise.    Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special   Report revealing 5 top stocks to watch in this space.    See these 5 \"sin stocks\" now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Crown Castle International Corporation (CCI): Free Stock Analysis Report   OUTFRONT Media Inc. (OUT): Free Stock Analysis Report   Extra Space Storage Inc (EXR): Free Stock Analysis Report   Ventas, Inc. (VTR): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Ventas, Inc. VTR  recently completed its investment in a portfolio of Class-A apartment-like senior housing assets in the thriving Quebec senior-housing market through an equity partnership with Le Groupe Maurice (\"LGM\"). LGM will continue to manage the portfolio under its brand. The transaction will help strengthen Ventas' foothold in Canada. ",
    "The portfolio is valued at $1.8 billion and consists of a highly-occupied stabilized portfolio, communities in lease-up as well as assets under development. Specifically, Ventas has acquired 87% of 34 communities rather than acquiring 85% of 35 communities, as previously announced this June, due to tax and legal structuring considerations. (Read more:  Ventas to Buy Seniors Housing Portfolio Worth   $1.8B   ).  makeArticleAd();  The investment is a strategic fit as it will help Ventas diversify its assets, business model and operator base. Additionally, Ventas has the rights to fund and own all additional developments through an exclusive pipeline agreement with LGM. This will create a new platform for growth together with LGM.",
    "The transaction will enable the companies to cater to the growing demand of an outstanding lifestyle for seniors. Additionally, the high-quality portfolio is highly occupied, offers stable cash flows, and built-in growth from existing and new development projects.",
    "On completion of the investment, pro-forma net operating income (NOI) from Ventas' Canadian senior housing operating property (\"SHOP\") portfolio is expected to increase 10 percentage points to 22% of its total annualized SHOP NOI. Further, the company's Canadian assets will account for 8% of its NOI, while LGM will represent 4% NOI.",
    "The deal is expected to be neutral to 2019 normalized funds from operations (FFO) per share and accretive to 2020 normalized FFO by around 3 cents per share.",
    "Currently, Ventas carries a Zacks Rank #3 (Hold). In the year-to-date period, shares of the company have rallied 27.9%, outperforming the  industry  's growth of 26.1%.",
    " Top Picks ",
    "OUTFRONT Media Inc. OUT  currently sports a Zacks Rank of 1 (Strong Buy). The Zacks Consensus Estimate for 2019 FFO per share has been revised marginally upward to $2.34 over the past month. You can see   the complete list of today's Zacks #1 Rank stocks here  . ",
    "Crown Castle International Corp. CCI  holds a Zacks Rank of 2 (Buy), at present. The Zacks Consensus Estimate for the current-year FFO per share remained unchanged at $5.92 in the past month.",
    "Extra Space Storage Inc EXR  is another Zacks #2 Ranked company, currently. The Zacks Consensus Estimate for the ongoing year's FFO per share has been revised marginally upward to $4.86 in a month's time.",
    "Note:  Anything related to earnings presented in this write-up represent funds from operations (FFO) - a widely used metric to gauge the performance of REITs. ",
    " It's Illegal in 42 States, But Investors Will Make Billions Legally    In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.    That's twice as much as they spend on marijuana, legally or otherwise.    Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special   Report revealing 5 top stocks to watch in this space.    See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:04:00"
}