{
  "url": "https://www.nasdaq.com/article/coupa-coup-earnings-and-revenues-beat-estimates-in-q2-cm1207203",
  "title": "Coupa (COUP) Earnings and Revenues Beat Estimates in Q2 - Nasdaq.com",
  "text": [
    "  Coupa Software Inc. COUP  delivered second-quarter fiscal 2020 non-GAAP earnings of 7 cents per share against the Zacks Consensus Estimate of a loss of 10 cents. Further, the bottom line was better than the year-ago figure of 5 cents per share. Revenues improved 54% from the year-ago quarter to $95.1 million, driven by growth of 51% in subscription services, which totaled $83.5 million. Professional services & other revenues also soared 85.7% to $11.7 million. Further, the figure surpassed the Zacks Consensus Estimate of $86 million. The top line was primarily driven by expanding customer base. Further, rising adoption of Coupa's platform is bolstering subscription services revenues. Billing during the quarter came in at $95.1 million, improving 57% year over year. Notably, the stock has returned 74.8% in the past year, substantially outperforming the industry  's rally of 5%.     Customer Base Expands  Coupa provides a unified, cloud-based spend management platform that helps enterprises keep a tab on daily expenditures. The company's customer base continued to expand in the reported quarter. In the first half of this fiscal year, more than 90 customers went live on Coupa platform. Notable customer wins in the quarter include Affirmed Networks, Auckland Savings Bank, Carousell, Commonwealth Bank of Australia, Las Vegas Valley Water District, Suntory, Rakuten, Redfin, Sainsbury's Supermarkets, Tullow Oil, University of St. Augustine, and Volkswagen Group Australia. The company also announced collaboration with PayPal (PYPL), which will enable Coupa Pay users access their PayPal account that in turn will enhance customer experience. The latest integration provides Coupa Pay users with more flexibility when paying PayPal-enabled suppliers, thereby ensuring hassle-free and secure online payment experience for buyers and suppliers.  Operating Details  Non-GAAP gross margin contracted 190 basis points from the year-ago quarter to 72.7%. Non-GAAP operating income came in at $4.8 million compared with $4 million reported in the year-ago quarter. Non-GAAP operating margin came in at 5.1% compared with 6.5% a year ago.  Balance Sheet  As on Jul 31, 2019, Coupa had cash and cash equivalents of $613.9 million, up from $346.4 million in the previous quarter. Cash flow from operations came in at $1.3 million during the quarter. Free cash flow was ($2.3) million during the fiscal second quarter.  Guidance  For third-quarter fiscal 2020, revenues are anticipated between $95.5 million and $96.5 million. The Zacks Consensus Estimate for revenues is currently pegged at $87.2 million. Subscription revenues are expected between $86 million and $87 million, while professional services revenues are anticipated to be approximately $9.5 million. Non-GAAP income from operations is estimated to be in the range of $3.5-$5.5 million. Non-GAAP net income is projected to be 5-8 cents per share. The Zacks Consensus Estimate for earnings is currently pegged at 6 cents per share. For fiscal 2020, Coupa updated outlook. The company now anticipates total revenues between $369 million and $372 million (previously $342 million and $344 million). The Zacks Consensus Estimate for revenues is currently pegged at $346.2 million. Non-GAAP income from operations is now anticipated in the $10-$13 million range (previously $7-$9 million). Non-GAAP net income is expected to be 11-16 cents per share (previously 7-10 cents per share). The Zacks Consensus Estimate for earnings is currently pegged at 9 cents per share.  Zacks Rank & Key Picks  Coupa currently carries a Zacks Rank #3 (Hold). Some better-ranked stocks in the broader technology sector are Alibaba Group Holding Limited BABA  , Keysight Technologies Inc. KEYS  and Anixter International AXE  . Both the stocks flaunt a Zacks Rank #1 (Strong Buy). You can see   the complete list of today's Zacks #1 Rank stocks   here   . Long-term earnings growth rate for Alibaba, Keysight and Anixter is currently pegged at 28%, 10% and 8%, respectively.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Alibaba Group Holding Limited (BABA): Free Stock Analysis Report   COUPA SOFTWARE (COUP): Free Stock Analysis Report   Keysight Technologies Inc. (KEYS): Free Stock Analysis Report   Anixter International Inc. (AXE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Coupa Software Inc. COUP  delivered second-quarter fiscal 2020 non-GAAP earnings of 7 cents per share against the Zacks Consensus Estimate of a loss of 10 cents. Further, the bottom line was better than the year-ago figure of 5 cents per share.",
    "Revenues improved 54% from the year-ago quarter to $95.1 million, driven by growth of 51% in subscription services, which totaled $83.5 million. Professional services & other revenues also soared 85.7% to $11.7 million.",
    "Further, the figure surpassed the Zacks Consensus Estimate of $86 million.",
    "The top line was primarily driven by expanding customer base. Further, rising adoption of Coupa's platform is bolstering subscription services revenues. Billing during the quarter came in at $95.1 million, improving 57% year over year.",
    "Notably, the stock has returned 74.8% in the past year, substantially outperforming the industry  's rally of 5%.",
    " Customer Base Expands ",
    "Coupa provides a unified, cloud-based spend management platform that helps enterprises keep a tab on daily expenditures. The company's customer base continued to expand in the reported quarter. In the first half of this fiscal year, more than 90 customers went live on Coupa platform.",
    "Notable customer wins in the quarter include Affirmed Networks, Auckland Savings Bank, Carousell, Commonwealth Bank of Australia, Las Vegas Valley Water District, Suntory, Rakuten, Redfin, Sainsbury's Supermarkets, Tullow Oil, University of St. Augustine, and Volkswagen Group Australia.",
    "The company also announced collaboration with PayPal (PYPL), which will enable Coupa Pay users access their PayPal account that in turn will enhance customer experience. The latest integration provides Coupa Pay users with more flexibility when paying PayPal-enabled suppliers, thereby ensuring hassle-free and secure online payment experience for buyers and suppliers.",
    " Operating Details ",
    "Non-GAAP gross margin contracted 190 basis points from the year-ago quarter to 72.7%.",
    "Non-GAAP operating income came in at $4.8 million compared with $4 million reported in the year-ago quarter. Non-GAAP operating margin came in at 5.1% compared with 6.5% a year ago.",
    " Balance Sheet ",
    "As on Jul 31, 2019, Coupa had cash and cash equivalents of $613.9 million, up from $346.4 million in the previous quarter.",
    "Cash flow from operations came in at $1.3 million during the quarter. Free cash flow was ($2.3) million during the fiscal second quarter.",
    " Guidance ",
    "For third-quarter fiscal 2020, revenues are anticipated between $95.5 million and $96.5 million. The Zacks Consensus Estimate for revenues is currently pegged at $87.2 million. Subscription revenues are expected between $86 million and $87 million, while professional services revenues are anticipated to be approximately $9.5 million.",
    "Non-GAAP income from operations is estimated to be in the range of $3.5-$5.5 million. Non-GAAP net income is projected to be 5-8 cents per share. The Zacks Consensus Estimate for earnings is currently pegged at 6 cents per share.",
    "For fiscal 2020, Coupa updated outlook. The company now anticipates total revenues between $369 million and $372 million (previously $342 million and $344 million). The Zacks Consensus Estimate for revenues is currently pegged at $346.2 million.",
    "Non-GAAP income from operations is now anticipated in the $10-$13 million range (previously $7-$9 million). Non-GAAP net income is expected to be 11-16 cents per share (previously 7-10 cents per share). The Zacks Consensus Estimate for earnings is currently pegged at 9 cents per share.",
    " Zacks Rank & Key Picks ",
    "Coupa currently carries a Zacks Rank #3 (Hold).",
    "Some better-ranked stocks in the broader technology sector are Alibaba Group Holding Limited BABA  , Keysight Technologies Inc. KEYS  and Anixter International AXE  . Both the stocks flaunt a Zacks Rank #1 (Strong Buy). You can see   the complete list of today's Zacks #1 Rank stocks   here   .",
    "Long-term earnings growth rate for Alibaba, Keysight and Anixter is currently pegged at 28%, 10% and 8%, respectively.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:18:00"
}