{
  "url": "https://www.nasdaq.com/article/roku-introduces-180-smart-soundbar-subwoofer-cm1207172",
  "title": "Roku Introduces $180 Smart Soundbar, Subwoofer - Nasdaq.com",
  "text": [
    "  A year after its first foray into the home audio market,   Roku    is back with 2 new products that promise to marry TV streaming   with smart sound: A $180 soundbar that doubles as a   Roku    video streaming device, and a $180 Roku subwoofer to add some   bass to either the soundbar or the company's bookshelf   speakers. The Roku Smart Soundbar connects to your TV via HDMI, and   effectively includes a full-blown Roku streaming box, capable of   streaming 4K Ultra HD HDR video. This means that you won't need   any additional devices, or even a smart TV, to watch videos from   Netflix, Amazon Prime, YouTube or the company's own Roku   Channel. The soundbar measures 32 inches, and packs four 2.5-inch   tweeters. It uses HDMI ARC, which allows TVs to send audio both   ways, so you can also use it to amplify the sound of anything you   might watch with your cable box. Older TVs without HDMI Arc can   be connected via optical audio, but there is no analog audio   connectivity.makeArticleAd(); The device includes a typical Roku remote, complete with mic   button for voice control. There's also an option to control the   soundbar with an external Amazon Echo or Google Home speaker, but   the soundbar itself doesn't have far-field microphones on   board.    The Roku Wireless Subwoofer is a bit simpler, and doesn't come   with built-in video streaming. The idea is instead that you buy   it as an add-on. At launch, it will only work with the Smart   Soundbar, but the company is working on making it compatible with   its bookshelf speakers as well. During a brief demo, both products sounded good, and   definitely better than TV sound by itself. However, don't expect   the Smart Soundbar to beat a Sonos soundbar or other   premium-priced devices with Dolby Atmos in a head-to-head   competition. Roku's emphasis is clearly on price and usability as   opposed to mind-blowing audio quality. To that effect, the company has also once again added its own   smart audio features. This includes the ability to amplify   dialogue, and also a night mode that equalizes the entire   soundscape to make sure that a sudden car crash in a movie won't   wake up the entire house. Speaking of whole home: Roku's Smart Soundbar is not yet able   to pair with the company's bookshelf speakers, either for 5.1   audio setups, or for multi-room audio, but Roku product   management director Sheldon Radford told   Variety    that the company will add these types of features over the coming   months. Radford also clarified the status of the company's homegrown   voice assistant. The Wall Street Journal   recently reported    that the company stopped developing the assistant, but Roku took   issue with that assessment. \"Voice is still an important part\" of   the company's audio platform, Radford said, while adding: \"It's   evolved over time.\" Roku's entry into the home audio market has been a bit rocky.   The company   announced a partnership with TCL to build a   soundbar together at the beginning of 2018    , but that product never made it to market. The company's   bookshelf speakers, which exclusively work with   Roku TVs    , have only been sold via Roku's website. Roku's new Smart   Soundbar and Subwoofer products will be available online as well   as at Best Buy in October. At the same time, the company may still partner with consumer   electronics manufacturers to build Roku-powered audio equipment.   \"There is opportunity there,\" said Radford. \"We look at both   models.\"   More from Variety    Roku Is Embracing Kids Content With New         Roku Channel Section   U.S. Delays Tariffs on Smart Phones, Game         Consoles, Set-top Boxes   Roku Surpasses 30 Million Accounts,         Delivers Better-Than-Expected Q2 Results     ",
    "A year after its first foray into the home audio market,   Roku    is back with 2 new products that promise to marry TV streaming   with smart sound: A $180 soundbar that doubles as a   Roku    video streaming device, and a $180 Roku subwoofer to add some   bass to either the soundbar or the company's bookshelf   speakers.",
    "The Roku Smart Soundbar connects to your TV via HDMI, and   effectively includes a full-blown Roku streaming box, capable of   streaming 4K Ultra HD HDR video. This means that you won't need   any additional devices, or even a smart TV, to watch videos from   Netflix, Amazon Prime, YouTube or the company's own Roku   Channel.",
    "The soundbar measures 32 inches, and packs four 2.5-inch   tweeters. It uses HDMI ARC, which allows TVs to send audio both   ways, so you can also use it to amplify the sound of anything you   might watch with your cable box. Older TVs without HDMI Arc can   be connected via optical audio, but there is no analog audio   connectivity.",
    "The device includes a typical Roku remote, complete with mic   button for voice control. There's also an option to control the   soundbar with an external Amazon Echo or Google Home speaker, but   the soundbar itself doesn't have far-field microphones on   board.",
    "The Roku Wireless Subwoofer is a bit simpler, and doesn't come   with built-in video streaming. The idea is instead that you buy   it as an add-on. At launch, it will only work with the Smart   Soundbar, but the company is working on making it compatible with   its bookshelf speakers as well.",
    "During a brief demo, both products sounded good, and   definitely better than TV sound by itself. However, don't expect   the Smart Soundbar to beat a Sonos soundbar or other   premium-priced devices with Dolby Atmos in a head-to-head   competition. Roku's emphasis is clearly on price and usability as   opposed to mind-blowing audio quality.",
    "To that effect, the company has also once again added its own   smart audio features. This includes the ability to amplify   dialogue, and also a night mode that equalizes the entire   soundscape to make sure that a sudden car crash in a movie won't   wake up the entire house.",
    "Speaking of whole home: Roku's Smart Soundbar is not yet able   to pair with the company's bookshelf speakers, either for 5.1   audio setups, or for multi-room audio, but Roku product   management director Sheldon Radford told   Variety    that the company will add these types of features over the coming   months.",
    "Radford also clarified the status of the company's homegrown   voice assistant. The Wall Street Journal   recently reported    that the company stopped developing the assistant, but Roku took   issue with that assessment. \"Voice is still an important part\" of   the company's audio platform, Radford said, while adding: \"It's   evolved over time.\"",
    "Roku's entry into the home audio market has been a bit rocky.   The company   announced a partnership with TCL to build a   soundbar together at the beginning of 2018    , but that product never made it to market. The company's   bookshelf speakers, which exclusively work with   Roku TVs    , have only been sold via Roku's website. Roku's new Smart   Soundbar and Subwoofer products will be available online as well   as at Best Buy in October.",
    "At the same time, the company may still partner with consumer   electronics manufacturers to build Roku-powered audio equipment.   \"There is opportunity there,\" said Radford. \"We look at both   models.\"",
    "  More from Variety    Roku Is Embracing Kids Content With New         Roku Channel Section   U.S. Delays Tariffs on Smart Phones, Game         Consoles, Set-top Boxes   Roku Surpasses 30 Million Accounts,         Delivers Better-Than-Expected Q2 Results   ",
    " More from Variety ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:00:33"
}