{
  "url": "https://www.nasdaq.com/article/zumz-vs-goos-which-stock-is-the-better-value-option-cm1207991",
  "title": "ZUMZ vs. GOOS: Which Stock Is the Better Value Option? - Nasdaq.com",
  "text": [
    " Investors interested in stocks from the Retail - Apparel and Shoes sector have probably already heard of Zumiez (ZUMZ) and Canada Goose (GOOS). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look. Everyone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits. Zumiez has a Zacks Rank of #1 (Strong Buy), while Canada Goose has a Zacks Rank of #2 (Buy) right now. This means that ZUMZ's earnings estimate revision activity has been more impressive, so investors should feel comfortable with its improving analyst outlook. But this is only part of the picture for value investors. Value investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels. Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years. ZUMZ currently has a forward P/E ratio of 14.01, while GOOS has a forward P/E of 30. We also note that ZUMZ has a PEG ratio of 1.04. This figure is similar to the commonly-used P/E ratio, with the PEG ratio also factoring in a company's expected earnings growth rate. GOOS currently has a PEG ratio of 1.05. Another notable valuation metric for ZUMZ is its P/B ratio of 1.73. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, GOOS has a P/B of 16.69. Based on these metrics and many more, ZUMZ holds a Value grade of B, while GOOS has a Value grade of D. ZUMZ has seen stronger estimate revision activity and sports more attractive valuation metrics than GOOS, so it seems like value investors will conclude that ZUMZ is the superior option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Zumiez Inc. (ZUMZ): Free Stock Analysis Report   Canada Goose Holdings Inc. (GOOS): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors interested in stocks from the Retail - Apparel and Shoes sector have probably already heard of Zumiez (ZUMZ) and Canada Goose (GOOS). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look.",
    "Everyone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits.",
    "Zumiez has a Zacks Rank of #1 (Strong Buy), while Canada Goose has a Zacks Rank of #2 (Buy) right now. This means that ZUMZ's earnings estimate revision activity has been more impressive, so investors should feel comfortable with its improving analyst outlook. But this is only part of the picture for value investors.",
    "Value investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels.",
    "Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years.",
    "ZUMZ currently has a forward P/E ratio of 14.01, while GOOS has a forward P/E of 30. We also note that ZUMZ has a PEG ratio of 1.04. This figure is similar to the commonly-used P/E ratio, with the PEG ratio also factoring in a company's expected earnings growth rate. GOOS currently has a PEG ratio of 1.05.",
    "Another notable valuation metric for ZUMZ is its P/B ratio of 1.73. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, GOOS has a P/B of 16.69.",
    "Based on these metrics and many more, ZUMZ holds a Value grade of B, while GOOS has a Value grade of D.",
    "ZUMZ has seen stronger estimate revision activity and sports more attractive valuation metrics than GOOS, so it seems like value investors will conclude that ZUMZ is the superior option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:40:22"
}