{
  "url": "https://www.nasdaq.com/article/why-match-group-stock-gained-13-in-august-cm1207272",
  "title": "Why Match Group Stock Gained 13% in August - Nasdaq.com",
  "text": [
    " What happened  Match Group    (NASDAQ: MTCH) gained 13% last month, well outperforming the   broader market as the S&P 500 fell 2%, according to data   provided by      S&P Global Market Intelligence    . The August rally added on to what has been a good year for   shareholders in the   tech stock    , who are up roughly 100% so far in 2019.   Image source: Getty Images.makeArticleAd();  So what August's gains were propelled by a second-quarter earnings   report that was met with cheers on Wall Street. In that   announcement, the dating app specialist said its Tinder   application   gained just over 500,000 subscribers    , beating expectations, and helping push revenue up 18% for the   period. Adjusted earnings also landed well ahead of targets. Now what Match Group management issued an aggressive outlook for the   current quarter based on its view that Tinder's momentum will   continue. Looking further out, executives are excited about the   potential of their platform in new international markets and   among different demographics. But perhaps the most impressive   metric in last month's report was the 6% increase in average   revenue per user. That gain suggests the company could become far   more profitable as it begins monetizing its rapidly expanding   user base.   Find out why Match Group is one of the 10 best stocks to buy now  Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* Tom and David just revealed their ten top stock picks for     investors to buy right now. Match Group     is on the list      -- but there are nine others you may be overlooking.  Click here to get access to the full       list!     *Stock Advisor returns as of June 1, 2019       Demitrios Kalogeropoulos      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Match Group. The Motley Fool has     a     disclosure policy      .  ",
    " Match Group    (NASDAQ: MTCH) gained 13% last month, well outperforming the   broader market as the S&P 500 fell 2%, according to data   provided by      S&P Global Market Intelligence    .",
    "The August rally added on to what has been a good year for   shareholders in the   tech stock    , who are up roughly 100% so far in 2019.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "August's gains were propelled by a second-quarter earnings   report that was met with cheers on Wall Street. In that   announcement, the dating app specialist said its Tinder   application   gained just over 500,000 subscribers    , beating expectations, and helping push revenue up 18% for the   period. Adjusted earnings also landed well ahead of targets.",
    "Match Group management issued an aggressive outlook for the   current quarter based on its view that Tinder's momentum will   continue. Looking further out, executives are excited about the   potential of their platform in new international markets and   among different demographics. But perhaps the most impressive   metric in last month's report was the 6% increase in average   revenue per user. That gain suggests the company could become far   more profitable as it begins monetizing its rapidly expanding   user base.",
    "  Find out why Match Group is one of the 10 best stocks to buy now  Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* Tom and David just revealed their ten top stock picks for     investors to buy right now. Match Group     is on the list      -- but there are nine others you may be overlooking.  Click here to get access to the full       list!     *Stock Advisor returns as of June 1, 2019    ",
    " Find out why Match Group is one of the 10 best stocks to buy now ",
    "Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "Tom and David just revealed their ten top stock picks for     investors to buy right now. Match Group     is on the list      -- but there are nine others you may be overlooking.",
    " Click here to get access to the full       list! ",
    " *Stock Advisor returns as of June 1, 2019 ",
    "  Demitrios Kalogeropoulos      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Match Group. The Motley Fool has     a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:52:00"
}