{
  "url": "https://www.nasdaq.com/article/dont-retire-until-youve-made-these-key-decisions-cm1206737",
  "title": "Don't Retire Until You've Made These Key Decisions - Nasdaq.com",
  "text": [
    "Whether you're thinking of retiring one year, three years, or 10 years from now, it's a decision that shouldn't be taken lightly. And while there are many factors that will no doubt go into it, you must address these three important points before taking that leap.",
    "Social Security will likely constitute a decent chunk of your retirement income, so it's imperative that you claim your benefits strategically. If you file at your full retirement age , which, depending on your year of birth, is either 66, 67, or somewhere in between, you'll get the exact monthly benefit your earnings history entitles you to. File before full retirement age (you can do so as early as age 62) and you'll face a reduction in benefits that will most likely remain in effect for the rest of your life. Another option is to delay benefits past full retirement age, which will increase them by 8% a year up until you turn 70.",
    "IMAGE SOURCE: GETTY IMAGES.",
    "Your Social Security filing decision will impact your spouse, too, if you're married. If your spouse never worked, he or she can claim spousal benefits , but only once you start collecting your benefits. Furthermore, your spouse is entitled to survivors benefits once you pass, assuming he or she outlives you, so the higher a paycheck you get from Social Security, the more your spouse gets as well.",
    "Many people retire in the same city they lived in during their working years. Others, meanwhile, relocate to benefit from things like better weather and a lower cost of living. The place you'll be living during retirement will largely determine how much income (and savings) you need to cover your expenses, so it's a decision you'll need to land on in advance.",
    "When determining how affordable a city is, you'll need to focus on things like housing costs, property taxes (if you're planning to be a homeowner), and income taxes, which can vary significantly from one state to another. Keep in mind that some states also impose a tax on Social Security benefits , so if you want to avoid losing a portion of that income, you may want to cross them off your list (though some states that tax Social Security also offer a relatively low cost of living, so you'll need to weigh the positive against the negative).",
    "Boredom can be a retiree's worst nightmare, especially when it leads to feelings of sadness and worthlessness that can be harmful from a mental and health-related perspective. That's why you must figure out what you'll do with your newfound free time before pulling the plug on your career. Maybe you'll start a small business , or focus on hobbies that fell by the wayside all that time you were working. Or maybe you'll travel a lot or volunteer for an organization you've always supported.",
    "There are plenty of things you can do with your days in retirement, but have some ideas mapped out beforehand. Also, make sure they're realistic given your financial situation. You may want to explore the globe, but if you don't have the funds to support that goal, you'll need a backup plan.",
    "Another thing -- make sure your spouse is on board with your plans. For example, you may have the money to travel, but if your spouse wants to mostly stay local, that could be the source of a conflict you're better off resolving ahead of time.",
    "The last thing you want to do is rush into retirement and regret that decision after the fact. Before bringing your career to a close, be sure to address the above points and make sure you have clear direction on each. Doing so could help you avoid a world of stress -- and distress -- during your golden years.",
    "The $16,728 Social Security bonus most retirees completely overlook\r\n If you're like most Americans, you're a few years (or more) behind on your retirement savings. But a handful of little-known \"Social Security secrets\" could help ensure a boost in your retirement income. For example: one easy trick could pay you as much as $16,728 more... each year! Once you learn how to maximize your Social Security benefits, we think you could retire confidently with the peace of mind we're all after. Simply click here to discover how to learn more about these strategies .",
    "The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 06:36:00"
}