{
  "url": "https://www.nasdaq.com/article/weather-and-execution-issues-crimp-hd-supplys-second-quarter-cm1210683",
  "title": "Weather and Execution Issues Crimp HD Supply's Second Quarter - Nasdaq.com",
  "text": [
    " Industrial tools, materials, and facilities maintenance supply   organization   HD Supply    (NASDAQ: HDS) issued results for its fiscal second quarter on   Sept. 10. While the company's revenue and earnings fell within   previously issued guidance, its forecast for the entire year was   found wanting by investors, as shares declined 4% in the trading   session following the report's release. Below, we'll review the   quarter and the specific issues that have limited HD Supply's   ability to generate financial momentum this year. Note that all   comparative numbers in this article are presented against those   of the prior-year quarter. The raw numbers  Data source: HD Supply Holdings. What happened with HD Supply this quarter?  The organization's top-line result, as seen in the table     above, hit the low end of a forecasted range of $1.62 billion     to $1.67 billion, which was shared with investors     last quarter      . Net income also fell nearer the lower end of the company's     anticipated band of $131 million to $142 million. Earnings per     share (EPS) landed at the midpoint of an expected range of     $0.77 to $0.83. Facilities maintenance revenue rose by 1.2% to $830     million. Management attributed the slight growth to colder     weather during the quarter, which impacted HVAC (heating,     ventilation, and air conditioning) sales, as well as the     rollout of an automated fulfillment process in the company's     Atlanta distribution center. Problems originating with the     automation vendor caused HD Supply to temporarily resume manual     order fulfillment during the summer. According to management,     automated fulfillment has resumed and is now running smoothly.     Together, the weather and fulfillment issues shaved an     estimated 150 to 250     basis points      from facilities maintenance sales during the quarter. Construction and industrial net sales improved by 1.8% to     $795 million. While the company is benefiting from numerous     multiyear projects in the construction industry, spread over a     variety of sectors, industry activity has generally decelerated     during 2019 due to cooler weather in the spring and summer, as     well as from a dearth of skilled labor.  Gross margin      was unchanged at 38.9%. Adjusted     EBITDA      slipped less than 1% to $244 million. After quarter-end, on Sept. 1, HD Supply acquired     Houston-based maintenance, repair, and operations (MRO)     provider Presto Maintenance Supply. Presto booked sales of $15     million in 2018; terms of the deal were not disclosed.    Image source: Getty Images.makeArticleAd();  Management's perspective In addition to the impact of moderating construction industry   growth this year, HD Supply has faced earnings volatility due to   the current tariff environment,   as I discussed last quarter    . During HD Supply's   earnings conference call    , CFO Evan Levitt offered a counterpoint to these external   headwinds, pointing to the distributor's generation of $562   million in   free cash flow    over the last 12 months. Levitt also discussed positive aspects   of the company's balance sheet and capital allocation strategies,   burnishing   the investment thesis    on HD Supply:  As of the end of the second quarter of 2019, our     net-debt-to-adjusted-EBITDA ratio was 2.4 times, comfortably     within our targeted range of 2 to 3 times. Our capital     allocation strategy remains the same; we will opportunistically     deploy capital to the most attractive return opportunities     available. These include organic investments in the business,     selective bolt-on or tuck-in acquisitions -- such as the Presto     acquisition that closed after the quarter -- and return of cash     to shareholders, currently through our existing share     repurchase authorization.  Looking forward Management continues to display wariness regarding the effect   of import tariffs with the back half of the year in sight. Due to   this caution and expected softer revenue from construction   industry supply sales, the company trimmed full-year fiscal 2019   earnings projections on Tuesday. Sales are now expected to range   between $6.1 billion and $6.2 billion, against the previous   projection of $6.25 billion to $6.35 billion. Full-year net   income is slated to land between $450 million and $472 million,   versus last quarter's predicted range of $474 million to $504   million. Finally, diluted EPS has been trimmed to a range of   $2.68 to $2.81, from an initial expectation of $2.77 to   $2.95.   10 stocks we like better than HD Supply     Holdings       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and HD Supply Holdings wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Asit Sharma      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Industrial tools, materials, and facilities maintenance supply   organization   HD Supply    (NASDAQ: HDS) issued results for its fiscal second quarter on   Sept. 10. While the company's revenue and earnings fell within   previously issued guidance, its forecast for the entire year was   found wanting by investors, as shares declined 4% in the trading   session following the report's release. Below, we'll review the   quarter and the specific issues that have limited HD Supply's   ability to generate financial momentum this year. Note that all   comparative numbers in this article are presented against those   of the prior-year quarter.",
    "Data source: HD Supply Holdings.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "In addition to the impact of moderating construction industry   growth this year, HD Supply has faced earnings volatility due to   the current tariff environment,   as I discussed last quarter    . During HD Supply's   earnings conference call    , CFO Evan Levitt offered a counterpoint to these external   headwinds, pointing to the distributor's generation of $562   million in   free cash flow    over the last 12 months. Levitt also discussed positive aspects   of the company's balance sheet and capital allocation strategies,   burnishing   the investment thesis    on HD Supply:",
    "As of the end of the second quarter of 2019, our     net-debt-to-adjusted-EBITDA ratio was 2.4 times, comfortably     within our targeted range of 2 to 3 times. Our capital     allocation strategy remains the same; we will opportunistically     deploy capital to the most attractive return opportunities     available. These include organic investments in the business,     selective bolt-on or tuck-in acquisitions -- such as the Presto     acquisition that closed after the quarter -- and return of cash     to shareholders, currently through our existing share     repurchase authorization.",
    "Management continues to display wariness regarding the effect   of import tariffs with the back half of the year in sight. Due to   this caution and expected softer revenue from construction   industry supply sales, the company trimmed full-year fiscal 2019   earnings projections on Tuesday. Sales are now expected to range   between $6.1 billion and $6.2 billion, against the previous   projection of $6.25 billion to $6.35 billion. Full-year net   income is slated to land between $450 million and $472 million,   versus last quarter's predicted range of $474 million to $504   million. Finally, diluted EPS has been trimmed to a range of   $2.68 to $2.81, from an initial expectation of $2.77 to   $2.95.",
    "  10 stocks we like better than HD Supply     Holdings       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and HD Supply Holdings wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than HD Supply     Holdings       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and HD Supply Holdings wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Asit Sharma      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:05:00"
}