{
  "url": "https://www.nasdaq.com/article/why-you-should-be-concerned-about-this-fomo-market-cm1210835",
  "title": "Why You Should Be Concerned About This \"FOMO\" Market - Nasdaq.com",
  "text": [
    " For the past few weeks, I've been closely monitoring   sentiment. Sentiment indicators measure what investors think about the   markets. This class of indicators includes the weekly survey   conducted by the American Association of Individual Investors   (AAII). I've noted several times recently that this survey dates back   to 1987. For an average week, 38% of investors are bullish, 30%   are bearish and 32% are neutral. I believe it's important to   consider those long-term averages when looking at the current   readings. Last week, just 28.6% were bullish, almost 40% were bearish   and 32% were neutral.    Source:   AAII.com  Currently, the number of bulls remains unusually low. More   than 70% of investors are bearish or neutral. This is important because the stock market moved higher last   week, and investors suffer from FOMO.  Fear Of Missing Out    , or FOMO, is formally defined as \"a pervasive apprehension that   others might be having rewarding experiences from which one is   absent.\" Less formally, FOMO is the fear of regretting a decision. FOMO   completely explains the cryptocurrency mania that developed in   2017.  Two years ago, few investors understood what bitcoin was. Yet,   they were buying because they feared that bitcoin would create   great wealth and they would have missed out on the next big   thing. That wasn't the first time FOMO led to a market rally.   Internet stocks in the late 1990s also moved up because investors   were worried about missing out on gains. In fact, FOMO explains   every bubble since tulipomania gripped Holland in late 1637. Right now, FOMO could be setting up a tradable stock market   rally. (There's one easy way you could trade it, brought to you   by my colleague Jim Fink. For details   go here    .)  A \"Dangerous\" (But Profitable) Market Rally     It's important to acknowledge that the fundamentals don't support   a rally. Neither does the economic data. But none of that matters   when investors have billions of dollars in cash and a desire to   buy. Those two factors - cash and desire - are the only reasons   bitcoin rallied in 2017. There were no fundamental reasons to   explain why bitcoin should be worth $20,000 or $1. The price of   bitcoin is based solely on what traders are willing to pay. In hindsight, it's obvious that a market unhinged from   fundamentals is a dangerous market. That was true of bitcoin,   internet stocks during the bubble, and tulips in 17th century   Holland. That means this could be a dangerous stock market.   Fundamentals do not support gains. Standard & Poor's analysts expec   t earnings    per share (   EPS    ) of the companies in the S&P 500 to increase 6.8% this year   compared to 2018. For 2020, EPS is expected to increase by 12%.   Those are aggressive - and optimistic - estimates given almost   all economists agree economic growth is slowing. Rather than lowering the estimates, I will assume S&P is   correct and EPS for the companies in the S&P 500 will be   $181.42 next year. EPS for the index is weighted just like the   price index is weighted. If the price-to-earnings (P/E) ratio is   17 at the end of next year, the S&P 500 would be at about   3,084. With an average P/E ratio, the index would gain about 3.6%   in the next 15 months, based on fundamentals. But the index isn't going to be priced based on fundamentals   in the next year.   Fear will drive the stock market over the next   year.   For now, the fear of missing out on gains will be the   dominant fear    , in my opinion. If the economic news worsens, fear of recession   will become dominant, and that could lead to a bear market.   Prices driven by fear tend to move far away from fair value. This is the kind of market where momentum indicators tend to   be useful. The chart of the SPDR S&P 500 ETF (   SPY    ) below shows that my Income Trader Volatility (ITV) indicator is   bullish.   Action To Take     To trade this market, I will be following sentiment and momentum   indicators because they tend to work well in emotional markets.   Eventually, fundamentals will matter. But that won't be the case   until the end of the bear market, which is most likely a year or   more away. For now, momentum is up, and that means prices are   more likely to move up than down. Aside from my own indicators, I'll also be watching what my   colleague Jim Fink is doing. Jim has fine-tuned a proprietary but very simple investing   technique that generates steady income. It makes money for his   followers, no matter what's happening in Washington or in the   markets. Jim's returns are so reliable, they look just like a   paycheck. With his system, you can collect regular deposits of   $2,950 or more, every Thursday. We explain exactly how Jim's moneymaking technique works, and   what you need to do to earn your first \"paycheck\" using it.    Click here for all the details.     Related Articles   We're Up 220% On My Favorite Utility       Fund...   Why It Pays To Look For \"Picks And Shovels\"       Tech Stocks   We're Up 47% On This \"Weird\" Real Estate       Investment   ",
    "For the past few weeks, I've been closely monitoring   sentiment.",
    "Sentiment indicators measure what investors think about the   markets. This class of indicators includes the weekly survey   conducted by the American Association of Individual Investors   (AAII).",
    "I've noted several times recently that this survey dates back   to 1987. For an average week, 38% of investors are bullish, 30%   are bearish and 32% are neutral. I believe it's important to   consider those long-term averages when looking at the current   readings.",
    "Last week, just 28.6% were bullish, almost 40% were bearish   and 32% were neutral.",
    "Currently, the number of bulls remains unusually low. More   than 70% of investors are bearish or neutral.",
    "This is important because the stock market moved higher last   week, and investors suffer from FOMO.",
    " Fear Of Missing Out    , or FOMO, is formally defined as \"a pervasive apprehension that   others might be having rewarding experiences from which one is   absent.\"",
    "Less formally, FOMO is the fear of regretting a decision. FOMO   completely explains the cryptocurrency mania that developed in   2017.",
    "Two years ago, few investors understood what bitcoin was. Yet,   they were buying because they feared that bitcoin would create   great wealth and they would have missed out on the next big   thing.",
    "That wasn't the first time FOMO led to a market rally.   Internet stocks in the late 1990s also moved up because investors   were worried about missing out on gains. In fact, FOMO explains   every bubble since tulipomania gripped Holland in late 1637.",
    "Right now, FOMO could be setting up a tradable stock market   rally. (There's one easy way you could trade it, brought to you   by my colleague Jim Fink. For details   go here    .)",
    " A \"Dangerous\" (But Profitable) Market Rally     It's important to acknowledge that the fundamentals don't support   a rally. Neither does the economic data. But none of that matters   when investors have billions of dollars in cash and a desire to   buy.",
    "Those two factors - cash and desire - are the only reasons   bitcoin rallied in 2017. There were no fundamental reasons to   explain why bitcoin should be worth $20,000 or $1. The price of   bitcoin is based solely on what traders are willing to pay.",
    "In hindsight, it's obvious that a market unhinged from   fundamentals is a dangerous market. That was true of bitcoin,   internet stocks during the bubble, and tulips in 17th century   Holland.",
    "That means this could be a dangerous stock market.   Fundamentals do not support gains.",
    "Standard & Poor's analysts expec   t earnings    per share (   EPS    ) of the companies in the S&P 500 to increase 6.8% this year   compared to 2018. For 2020, EPS is expected to increase by 12%.   Those are aggressive - and optimistic - estimates given almost   all economists agree economic growth is slowing.",
    "Rather than lowering the estimates, I will assume S&P is   correct and EPS for the companies in the S&P 500 will be   $181.42 next year. EPS for the index is weighted just like the   price index is weighted. If the price-to-earnings (P/E) ratio is   17 at the end of next year, the S&P 500 would be at about   3,084. With an average P/E ratio, the index would gain about 3.6%   in the next 15 months, based on fundamentals.",
    "But the index isn't going to be priced based on fundamentals   in the next year.   Fear will drive the stock market over the next   year. ",
    " For now, the fear of missing out on gains will be the   dominant fear    , in my opinion. If the economic news worsens, fear of recession   will become dominant, and that could lead to a bear market.   Prices driven by fear tend to move far away from fair value.",
    "This is the kind of market where momentum indicators tend to   be useful. The chart of the SPDR S&P 500 ETF (   SPY    ) below shows that my Income Trader Volatility (ITV) indicator is   bullish.",
    " Action To Take     To trade this market, I will be following sentiment and momentum   indicators because they tend to work well in emotional markets.   Eventually, fundamentals will matter. But that won't be the case   until the end of the bear market, which is most likely a year or   more away. For now, momentum is up, and that means prices are   more likely to move up than down.",
    "Aside from my own indicators, I'll also be watching what my   colleague Jim Fink is doing.",
    "Jim has fine-tuned a proprietary but very simple investing   technique that generates steady income. It makes money for his   followers, no matter what's happening in Washington or in the   markets. Jim's returns are so reliable, they look just like a   paycheck. With his system, you can collect regular deposits of   $2,950 or more, every Thursday.",
    "We explain exactly how Jim's moneymaking technique works, and   what you need to do to earn your first \"paycheck\" using it.    Click here for all the details.  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\n© Copyright 2001-2016 StreetAuthority, LLC. All Rights Reserved.\n"
  ],
  "published_datetime": "2019-09-12 01:00:00"
}