{
  "url": "https://www.nasdaq.com/article/can-jumia-earn-back-its-amazon-of-africa-title-cm1206874",
  "title": "Can Jumia Earn Back Its Amazon of Africa Title? - Nasdaq.com",
  "text": [
    "Jumia's (NYSE: JMIA) public life is only a few months old. Founded in 2012, the online African merchant went public in April 2019. Investors compared Jumia with Amazon  in the U.S. and MercadoLibre in Latin America and rushed to invest. Consequently, the stock price climbed as high as $52 per share from the IPO price of $14.5.",
    "Shortly after the IPO, Citron Research, a well-known short-seller, published a controversial report that referred to several unverified discrepancies in the company's reported numbers to accuse Jumia of significant fraud. Since then, Jumia's stock price is significantly lower than its short-lived, all-time high level, and even fell under the IPO price. Now that IPO excitement subsided, it's time to dig in and decide whether Jumia is worthy of its almighty title of the Amazon of Africa.",
    "Source: YCharts",
    "The company's business is broken into three parts: an e-commerce marketplace, online delivery logistics, and an online payment platform. It operates across 14 countries in Africa, and more than 50% of its revenue comes from Nigeria and Egypt. What's more, less than 1% of African commerce happens online, making Jumia's opportunity for growth massive. But according to the company's Q2 2019 earnings report , Jumia burns $277 million to run its operations and has $379 million in cash and equivalents to fund them. In other words, Jumia has slightly more than one year's worth of its operating costs in the bank, before needing to raise money. Can Jumia raise the funds it needs to grow?",
    "With its brand damages and controversies, a secondary public offering may not be possible any time soon. But during its IPO, Mastercard (NYSE: MA) invested more than $50 million in the company. Jumia still has the option to raise money from more significant players like Mastercard that may want to leverage the opportunity as a gateway to enter Africa.",
    "Jumia's first competitive moat is its scale and presence across Africa. With almost five million users and 81,000 sellers, it's not difficult to imagine large international brands leveraging Jumia as a way to break into Africa. We've seen a similar model to work in China .",
    "Jumia also has an asset-light model. Jumia has a partnership with Vivo Energy- Shell 's licensee in Africa. The company's sellers and customers can drop off, pick up, and even pay for their orders across Vivo Energy's locations. Having an already established network of sites to pay and pick up orders is a unique way to eliminate the need for operating a delivery fleet.",
    "Image Source: Getty Images",
    "The company still has the option of growing through digital-only transactions. Online-only orders such as paying for bills, purchasing music, or buying airline tickets, for example, do not need to be delivered physically but maintain a firm place within an African consumer base.",
    "Also, Jumia's comprehensive technology platform connects banks and financial institutions to sellers and consumers. While JumiaPay handles e-commerce transactions, it also operates as a marketplace for other financial products such as loan and financing services. Jumia makes a commission off of those connections. It seems that the company has a few sources of revenue to continue its rapid growth.",
    "Despite what Citron wants investors to believe, trailblazing in the e-commerce and online payment market, especially when there is a lack of digital and physical delivery infrastructure, is inevitably prone to fraud. Early users of PayPal may remember the large-scale fraudulent activities on the platform. Fraud incidences are predictable and understandable in such early stages of significant shifts in consumer behavior away from the status quo. The way the company solves those issues matters more than the fact that such fraudulent incidents are widespread in the company's core market.",
    "Assuming that Jumia is leading the African consumers' transition to the digital economy, it is going to grow significantly larger than its current billion-dollar valuation. The company has a large-enough scale that can develop further through digital-only transactions and local partnerships with existing brick and mortar facilities. Institutional and corporate investors can use Jumia to access the African market, and as such, they may be willing to fund its path to becoming the Amazon of Africa.",
    "However, the growth phase is going to take a long time to pan. That's not bad news, as some may assume. A lengthy growth phase means that there will be an extended period (think in years) for savvy investors to pick up a few shares. I don't own Jumia's shares yet, but I'm closely monitoring the company's progress. As they say, good things come to those with patience. Jumia has what it takes to be the Amazon of Africa, but the path to get there is long and arduous.",
    "10 stocks we like better than Jumia Technologies AG-ADR\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Jumia Technologies AG-ADR wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "John Mackey, CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Hoda Mehr owns shares of Amazon and PayPal Holdings. The Motley Fool owns shares of and recommends Amazon, Mastercard, MercadoLibre, and PayPal Holdings. The Motley Fool has the following options: short October 2019 $97 calls on PayPal Holdings. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:45:00"
}