{
  "url": "https://www.nasdaq.com/article/737-max-will-continue-to-hurt-boeing-stock-cm1207580",
  "title": "737 Max Will Continue to Hurt Boeing Stock - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Boeing (NYSE: BA ) stock has been relatively volatile in the recent past. The stock bounced back from recent lows near $320 to levels of $364. However, the concerns related to its 737 Max have come back to hurt the stock. I believe that renewed downside will sustain in the foreseeable future.",
    "Before talking about the near- to medium-term concerns, I must emphasize here that Boeing still has an order backlog of 4,413 Max aircraft. I can say with some conviction that the return of the 737 Max is inevitable.",
    "The key basis for a bearish outlook is the potential impact on earnings in 2019 and 2020 as regulatory clearance takes longer than expected.",
    "According to the latest report by the Wall Street Journal , there is friction between the Federal Aviation Administration and Boeing. The FAA has indicated its \"frustration\" over the level of cooperation extended by Boeing. The FAA also mentioned that it is not following any prescribed timeline for 737 Max regulatory clearances.",
    "Boeing's CEO Dennis Muilenburg told analysts in July he was confident that Max aircraft would be back in service by October. Clearly, there are contradictions and it makes more sense to listen to what the FAA has to say. And it seems to be certain that the Boeing 737 Max will remain grounded in the coming months.",
    "Another point worth noting is that the FAA is hoping that global regulators simultaneously approve 737 Max to fly again. That's again uncertain and regulatory approval can differ from country to country. It might make more sense to say that over the next 6-12 months, it is likely that the 737 Max achieves approval globally.",
    "From a stock price perspective, there are two implications.",
    "First, earnings estimate for 2020 and potentially for 2021 will be revised in the coming months and Boeing stock is likely to react negatively.",
    "Second, Airbus (OTCMKTS: EADSF ) is winning the battle against Boeing. At least in the foreseeable future, Airbus is gaining at the expense of Boeing. This will negatively impact earnings visibility and the stock price.",
    "According to a study led by consultant Henry Harteveldt, 20% of U.S. travelers opined that they will avoid Boeing 737 in the first six months after flight resumes. A UBS  (NYSE: UBS )  survey also indicated that 70% of travelers would hesitate to book a flight on a 737 Max.",
    "The point I am trying to make is that this perception or fear might translate into airlines increasingly opting for Airbus. News of friction between the FAA and Boeing also does not help in terms of image building.",
    "Airlines have already suffered due to the grounding of 737 Max - and traveler perception can exaggerate the negative impact.",
    "It is worth noting that investigators are looking at the possibility of Boeing rushing into the launch of 737 Max to beat competition from Airbus. Without a doubt, the move has backfired and Boeing will feel the financial implications in the years to come.",
    "I expect BA stock to remain bearish in the medium term as delays in regulatory approval impact revenue and earnings per share outlook.",
    "However, there is no reason to believe that Boeing will be a long-term underperformer. When the 737 Max is back in service, the company can fulfill the robust backlog. I also expect the defense, space and security sector will deliver meaningful growth in the long term. As of Q2 2019, the segment reported an order backlog worth $64 billion.",
    "From a balance sheet perspective, Boeing reported cash and equivalents of $9.6 billion for the second quarter. While operating cash flow was impacted by 737 Max groundings, the company has an ample cash buffer and leveraging headroom to navigate this near-term crisis.",
    "Overall, I believe that investors can avoid Boeing stock at current levels, but a possible 10%-15% correction will provide a good long-term entry opportunity.",
    "As of this writing, Faisal Humayun did not hold a position in any of the aforementioned securities.",
    "The post 737 Max Will Continue to Hurt Boeing Stock appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 01:26:17"
}