{
  "url": "https://www.nasdaq.com/article/health-care-sector-update-for-09032019-alny-emma-azn-cdtx-cm1206797",
  "title": "Health Care Sector Update for 09/03/2019: ALNY, EMMA, AZN, CDTX - Nasdaq.com",
  "text": [
    "Top Health Care Stocks:",
    "JNJ: +0.27%",
    "PFE: +1.59%",
    "ABT: -1.28%",
    "MRK: -0.01%",
    "AMGN: -1.47%",
    "Top health care stocks were mixed in midday trading, including a 0.3% dip for the NYSE Health Care Index. Also, shares of health care companies in the S&P 500 were 0.7% lower as a group while the Nasdaq Biotechnology index was down 1.7%.",
    "Among health care stocks moving on news:",
    "(+) Alnylam Pharma ( ALNY  ) was advancing over 1.6% after results from its Orion-11 phase 3 study of inclisiran for the treatment of hypercholesterolemia showing \"significant efficacy\" and an \"encouraging\" safety profile.",
    "In other sector news:",
    "(+) Emmaus Life Sciences ( EMMA  ) was advancing 3% after the European Patent Office issued an allowance to its patent application covering a treatment for diverticulosis.",
    "(-) Forty Seven ( FTSV  ) was falling over 4%, even after securing FDA's Fast Track designation to magrolimab for the treatment of myelodysplastic syndrome and acute myeloid leukemia.",
    "(-) Zynerba Pharmaceuticals ( ZYNE  ) was down 0.4%, after planning to sell shares to raise $75 million via Cantor Fitzgerald, Canaccord Genuity, H.C. Wainwright, and Ladenburg Thalmann.",
    "(+) AstraZeneca ( AZN  ) was 0.6% higher after late-stage results from Themis trial showed that its drug Brilinta taken with aspirin reduced the relative risk for the composite of cardiovascular death, heart attack, or stroke by 10% compared with aspirin alone.",
    "(+) Cidara Therapeutics (CDTX) was rallying 65% after the company said it has entered into a strategic tie-up worth up to $568 million with Mundipharma to develop and commercialize rezafungin to treat and prevent invasive fungal infections.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-03 13:27:40"
}