{
  "url": "https://www.nasdaq.com/article/carnival-ccl-gains-but-lags-market-what-you-should-know-cm1210782",
  "title": "Carnival (CCL) Gains But Lags Market: What You Should Know - Nasdaq.com",
  "text": [
    " Carnival (CCL) closed the most recent trading day at $49.71, moving +0.1% from the previous trading session. The stock lagged the S&P 500's daily gain of 0.72%. Elsewhere, the Dow gained 0.85%, while the tech-heavy Nasdaq added 1.06%. Heading into today, shares of the cruise operator had gained 8.1% over the past month, outpacing the Consumer Discretionary sector's gain of 2.9% and the S&P 500's gain of 2.25% in that time. Investors will be hoping for strength from CCL as it approaches its nex t earnings  release. The company is expected to report EPS of $2.52, up 6.78% from the prior-year quarter. Our most recent consensus estimate is calling for quarterly revenue of $6.21 billion, up 6.34% from the year-ago period. Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $4.34 per share and revenue of $20.34 billion. These totals would mark changes of +1.88% and +7.73%, respectively, from last year. Any recent changes to analyst estimates for CCL should also be noted by investors. These revisions help to show the ever-changing nature of near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 0.12% lower. CCL is currently sporting a Zacks Rank of #3 (Hold). Digging into valuation, CCL currently has a Forward P/E ratio of 11.45. This represents a discount compared to its industry's average Forward P/E of 19.15. We can also see that CCL currently has a PEG ratio of 1.18. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. CCL's industry had an average PEG ratio of 1.79 as of yesterday's close. The Leisure and Recreation Services industry is part of the Consumer Discretionary sector. This industry currently has a Zacks Industry Rank of 188, which puts it in the bottom 27% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Carnival Corporation (CCL): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Carnival (CCL) closed the most recent trading day at $49.71, moving +0.1% from the previous trading session. The stock lagged the S&P 500's daily gain of 0.72%. Elsewhere, the Dow gained 0.85%, while the tech-heavy Nasdaq added 1.06%.",
    "Heading into today, shares of the cruise operator had gained 8.1% over the past month, outpacing the Consumer Discretionary sector's gain of 2.9% and the S&P 500's gain of 2.25% in that time.",
    "Investors will be hoping for strength from CCL as it approaches its nex t earnings  release. The company is expected to report EPS of $2.52, up 6.78% from the prior-year quarter. Our most recent consensus estimate is calling for quarterly revenue of $6.21 billion, up 6.34% from the year-ago period.",
    "Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $4.34 per share and revenue of $20.34 billion. These totals would mark changes of +1.88% and +7.73%, respectively, from last year.",
    "Any recent changes to analyst estimates for CCL should also be noted by investors. These revisions help to show the ever-changing nature of near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 0.12% lower. CCL is currently sporting a Zacks Rank of #3 (Hold).",
    "Digging into valuation, CCL currently has a Forward P/E ratio of 11.45. This represents a discount compared to its industry's average Forward P/E of 19.15.",
    "We can also see that CCL currently has a PEG ratio of 1.18. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. CCL's industry had an average PEG ratio of 1.79 as of yesterday's close.",
    "The Leisure and Recreation Services industry is part of the Consumer Discretionary sector. This industry currently has a Zacks Industry Rank of 188, which puts it in the bottom 27% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:50:11"
}