{
  "url": "https://www.nasdaq.com/article/wednesday-sector-leaders-energy-technology-communications-cm1207498",
  "title": "Wednesday Sector Leaders: Energy, Technology & Communications - Nasdaq.com",
  "text": [
    "In afternoon trading on Wednesday, Energy stocks are the best performing sector, higher by 2.0%. Within that group, Concho Resources Inc (Symbol: CXO) and Schlumberger Ltd (Symbol: SLB) are two large stocks leading the way, showing a gain of 4.6% and 4.5%, respectively. Among energy ETFs  , one ETF following the sector is the Energy Select Sector SPDR ETF (Symbol: XLE), which is up 1.7% on the day, and up 3.31% year-to-date. Concho Resources Inc, meanwhile, is down 28.95% year-to-date, and Schlumberger Ltd, is down 3.95% year-to-date. Combined, CXO and SLB make up approximately 5.8% of the underlying holdings of XLE. The next best performing sector is the Technology & Communications sector, up 1.5%. Among large Technology & Communications stocks, IPG Photonics Corp (Symbol: IPGP) and Activision Blizzard, Inc. (Symbol: ATVI) are the most notable, showing a gain of 6.4% and 4.6%, respectively. One ETF closely tracking Technology & Communications stocks is the Technology Select Sector SPDR ETF ( XLK  ), which is up 1.5% in midday trading, and up 29.48% on a year-to-date basis. IPG Photonics Corp, meanwhile, is up 10.09% year-to-date, and Activision Blizzard, Inc. is up 15.46% year-to-date. IPGP makes up approximately 0.1% of the underlying holdings of XLK.    Comparing these stocks and ETFs on a trailing twelve month basis, below is a relative stock price performance chart, with each of the symbols shown in a different color as labeled in the legend at the bottom:  makeArticleAd();       Here's a snapshot of how the S&P 500 components within the various sectors are faring in afternoon trading on Wednesday. As you can see, seven sectors are up on the day, while one sector is down.      10 ETFs With Stocks That Insiders Are Buying   »  ",
    "The next best performing sector is the Technology & Communications sector, up 1.5%. Among large Technology & Communications stocks, IPG Photonics Corp (Symbol: IPGP) and Activision Blizzard, Inc. (Symbol: ATVI) are the most notable, showing a gain of 6.4% and 4.6%, respectively. One ETF closely tracking Technology & Communications stocks is the Technology Select Sector SPDR ETF ( XLK  ), which is up 1.5% in midday trading, and up 29.48% on a year-to-date basis. IPG Photonics Corp, meanwhile, is up 10.09% year-to-date, and Activision Blizzard, Inc. is up 15.46% year-to-date. IPGP makes up approximately 0.1% of the underlying holdings of XLK.",
    "  10 ETFs With Stocks That Insiders Are Buying   » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:36:34"
}