{
  "url": "https://www.nasdaq.com/article/why-is-marriott-international-mar-down-33-since-last-earnings-report-cm1207347",
  "title": "Why Is Marriott International (MAR) Down 3.3% Since Last Earnings Report? - Nasdaq.com",
  "text": [
    " It has been about a month since the las t earnings  report for Marriott International (MAR). Shares have lost about 3.3% in that time frame, underperforming the S&P 500. Will the recent negative trend continue leading up to its next earnings release, or is Marriott International due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important drivers.  Marriott Meets Q2 Earnings Estimates, Trims '19   View  Marriott  reported mixed second-quarter 2019 results, wherein earnings matched the Zacks Consensus Estimate but revenues lagged the same. Notably, this marked the sixth straight quarter of revenue miss. Adjusted earnings of $1.56 per share, came in line with Zacks Consensus Estimate but decreased 9.3% year over year. The company's earnings in the year-ago quarter include 26 cents gain from an asset sale. Total revenues of $5,305 million missed the consensus mark of $5,531 million. The top line also declined 2% on a year-over-year basis.  RevPAR & Margins  In the quarter under review, RevPAR for worldwide comparable system-wide properties increased 1.2% in constant dollars (down 0.3% in actual dollars) driven by a 1.1% improvement in average daily rate (ADR). The metric was partially offset by a flat occupancy. Comparable system-wide RevPAR in North America grew 0.7% in constant dollars (up 0.4% in actual dollars) owing to a 1.3% gain in ADR, partially overshadowed by a 0.5% decline in occupancy. On a constant-dollar basis, international comparable system-wide RevPAR rose 2.8% (down 2.4% in actual dollars). Both occupancy rate and ADR improved 1.5% and 0.6%, respectively. Meanwhile, worldwide comparable company-operated house profit margins decreased 10 bps as robust cost control and synergies from the Starwood acquisition were overshadowed by marginal growth in RevPAR and increase in wages. North American comparable company-operated house profit margins contracted 50 basis points (bps). On the flip side, house profit margins for comparable company-operated properties outside North America expanded 30 bps. Total expenses decreased 7% year over year to $4.9 billion mainly due to a decline in Owned, leased, and other expenses. Adjusted earnings before interest, taxes, depreciation and amortization (EBITDA) summed $952 million, up 1% year over year.  Third-Quarter 2019 Outlook  For the third quarter of 2019, the company expects comparable system-wide RevPAR to increase in the range of 1-2% in North America (in constant currency). Marriott anticipates the same metric to rise 2-3% outside North America and approximately 1-2% worldwide. Furthermore, gross fee revenues are projected between $945 million and $960 million, up 1-3% on a year-over-year basis. Operating income is anticipated between $725 million and $745 million. General, administrative and other expenses are expected to be in the $220-$225 million band. Adjusted EBITDA is anticipated to be $896-$916 million, flat to up 2% year over year. Earnings per share are envisioned in the $1.47-$1.51 range compared with adjusted earnings of $1.70 in third-quarter 2018. The Zacks Consensus Estimate for third-quarter earnings is pegged at $1.61.  Fourth-Quarter 2019 View  For the fourth quarter of 2019, the company expects comparable system-wide RevPAR to increase in the range of 1-2% in North America (in constant currency). Marriott anticipates the same to rise 2-3% outside North America and approximately 1-2% worldwide. Furthermore, gross fee revenues are projected between $981 million and $996 million, up 8-9% on a year-over-year basis. Operating income is anticipated between $744 million and $764 million. General, administrative, and other expenses are expected to be $249-$254 million. Adjusted EBITDA is anticipated to be $917-$937 million, up 6-8% year over year. Earnings per share are envisioned in the $1.53-$1.58 band.  2019 Guidance  For 2019, Marriott anticipates earnings of $5.97-$6.06 per share compared with $5.97-$6.19 projected earlier. The Zacks Consensus Estimate for full-year earnings is pegged at $6.09. Gross fee revenues are expected between $3,820 million and $3,850 million, up 5-6% from the year-ago period. Comparable system-wide RevPAR is expected to increase in the range of 1-2% in North America, 2-3% outside North America and 1-2% worldwide. Marriot now expects room additions of nearly 5.5.5% in 2019, which comprises deletions of 1-1.5%.Operating income is envisioned to be $2,910-$2,950 million compared with 2,925-$3,025 million estimated earlier. General, administrative and other expenses are anticipated to be $920-$930 million. Adjusted EBITDA is projected in the band of $3,586-$3,626 million, up 3-4% from 2018.   How Have Estimates Been Moving Since Then?  In the past month, investors have witnessed a downward trend in estimates review. The consensus estimate has shifted -6.87% due to these changes.  VGM Scores  Currently, Marriott International has a nice Growth Score of B, though it is lagging a bit on the Momentum Score front with a C. Following the exact same course, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy. Overall, the stock has an aggregate VGM Score of C. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Marriott International has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Marriott International (MAR): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "It has been about a month since the las t earnings  report for Marriott International (MAR). Shares have lost about 3.3% in that time frame, underperforming the S&P 500.",
    "Will the recent negative trend continue leading up to its next earnings release, or is Marriott International due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important drivers.  Marriott Meets Q2 Earnings Estimates, Trims '19   View  Marriott  reported mixed second-quarter 2019 results, wherein earnings matched the Zacks Consensus Estimate but revenues lagged the same. Notably, this marked the sixth straight quarter of revenue miss. Adjusted earnings of $1.56 per share, came in line with Zacks Consensus Estimate but decreased 9.3% year over year. The company's earnings in the year-ago quarter include 26 cents gain from an asset sale. Total revenues of $5,305 million missed the consensus mark of $5,531 million. The top line also declined 2% on a year-over-year basis.  RevPAR & Margins  In the quarter under review, RevPAR for worldwide comparable system-wide properties increased 1.2% in constant dollars (down 0.3% in actual dollars) driven by a 1.1% improvement in average daily rate (ADR). The metric was partially offset by a flat occupancy. Comparable system-wide RevPAR in North America grew 0.7% in constant dollars (up 0.4% in actual dollars) owing to a 1.3% gain in ADR, partially overshadowed by a 0.5% decline in occupancy. On a constant-dollar basis, international comparable system-wide RevPAR rose 2.8% (down 2.4% in actual dollars). Both occupancy rate and ADR improved 1.5% and 0.6%, respectively. Meanwhile, worldwide comparable company-operated house profit margins decreased 10 bps as robust cost control and synergies from the Starwood acquisition were overshadowed by marginal growth in RevPAR and increase in wages. North American comparable company-operated house profit margins contracted 50 basis points (bps). On the flip side, house profit margins for comparable company-operated properties outside North America expanded 30 bps. Total expenses decreased 7% year over year to $4.9 billion mainly due to a decline in Owned, leased, and other expenses. Adjusted earnings before interest, taxes, depreciation and amortization (EBITDA) summed $952 million, up 1% year over year.  Third-Quarter 2019 Outlook  For the third quarter of 2019, the company expects comparable system-wide RevPAR to increase in the range of 1-2% in North America (in constant currency). Marriott anticipates the same metric to rise 2-3% outside North America and approximately 1-2% worldwide. Furthermore, gross fee revenues are projected between $945 million and $960 million, up 1-3% on a year-over-year basis. Operating income is anticipated between $725 million and $745 million. General, administrative and other expenses are expected to be in the $220-$225 million band. Adjusted EBITDA is anticipated to be $896-$916 million, flat to up 2% year over year. Earnings per share are envisioned in the $1.47-$1.51 range compared with adjusted earnings of $1.70 in third-quarter 2018. The Zacks Consensus Estimate for third-quarter earnings is pegged at $1.61.  Fourth-Quarter 2019 View  For the fourth quarter of 2019, the company expects comparable system-wide RevPAR to increase in the range of 1-2% in North America (in constant currency). Marriott anticipates the same to rise 2-3% outside North America and approximately 1-2% worldwide. Furthermore, gross fee revenues are projected between $981 million and $996 million, up 8-9% on a year-over-year basis. Operating income is anticipated between $744 million and $764 million. General, administrative, and other expenses are expected to be $249-$254 million. Adjusted EBITDA is anticipated to be $917-$937 million, up 6-8% year over year. Earnings per share are envisioned in the $1.53-$1.58 band.  2019 Guidance  For 2019, Marriott anticipates earnings of $5.97-$6.06 per share compared with $5.97-$6.19 projected earlier. The Zacks Consensus Estimate for full-year earnings is pegged at $6.09. Gross fee revenues are expected between $3,820 million and $3,850 million, up 5-6% from the year-ago period. Comparable system-wide RevPAR is expected to increase in the range of 1-2% in North America, 2-3% outside North America and 1-2% worldwide. Marriot now expects room additions of nearly 5.5.5% in 2019, which comprises deletions of 1-1.5%.Operating income is envisioned to be $2,910-$2,950 million compared with 2,925-$3,025 million estimated earlier. General, administrative and other expenses are anticipated to be $920-$930 million. Adjusted EBITDA is projected in the band of $3,586-$3,626 million, up 3-4% from 2018. ",
    " Marriott Meets Q2 Earnings Estimates, Trims '19   View ",
    "Marriott  reported mixed second-quarter 2019 results, wherein earnings matched the Zacks Consensus Estimate but revenues lagged the same. Notably, this marked the sixth straight quarter of revenue miss.",
    "Adjusted earnings of $1.56 per share, came in line with Zacks Consensus Estimate but decreased 9.3% year over year. The company's earnings in the year-ago quarter include 26 cents gain from an asset sale.",
    "Total revenues of $5,305 million missed the consensus mark of $5,531 million. The top line also declined 2% on a year-over-year basis.",
    " RevPAR & Margins ",
    "In the quarter under review, RevPAR for worldwide comparable system-wide properties increased 1.2% in constant dollars (down 0.3% in actual dollars) driven by a 1.1% improvement in average daily rate (ADR). The metric was partially offset by a flat occupancy.",
    "Comparable system-wide RevPAR in North America grew 0.7% in constant dollars (up 0.4% in actual dollars) owing to a 1.3% gain in ADR, partially overshadowed by a 0.5% decline in occupancy.",
    "On a constant-dollar basis, international comparable system-wide RevPAR rose 2.8% (down 2.4% in actual dollars). Both occupancy rate and ADR improved 1.5% and 0.6%, respectively.",
    "Meanwhile, worldwide comparable company-operated house profit margins decreased 10 bps as robust cost control and synergies from the Starwood acquisition were overshadowed by marginal growth in RevPAR and increase in wages.",
    "North American comparable company-operated house profit margins contracted 50 basis points (bps). On the flip side, house profit margins for comparable company-operated properties outside North America expanded 30 bps.",
    "Total expenses decreased 7% year over year to $4.9 billion mainly due to a decline in Owned, leased, and other expenses.",
    "Adjusted earnings before interest, taxes, depreciation and amortization (EBITDA) summed $952 million, up 1% year over year.",
    " Third-Quarter 2019 Outlook ",
    "For the third quarter of 2019, the company expects comparable system-wide RevPAR to increase in the range of 1-2% in North America (in constant currency). Marriott anticipates the same metric to rise 2-3% outside North America and approximately 1-2% worldwide. Furthermore, gross fee revenues are projected between $945 million and $960 million, up 1-3% on a year-over-year basis. Operating income is anticipated between $725 million and $745 million.",
    "General, administrative and other expenses are expected to be in the $220-$225 million band. Adjusted EBITDA is anticipated to be $896-$916 million, flat to up 2% year over year. Earnings per share are envisioned in the $1.47-$1.51 range compared with adjusted earnings of $1.70 in third-quarter 2018. The Zacks Consensus Estimate for third-quarter earnings is pegged at $1.61.",
    " Fourth-Quarter 2019 View ",
    "For the fourth quarter of 2019, the company expects comparable system-wide RevPAR to increase in the range of 1-2% in North America (in constant currency). Marriott anticipates the same to rise 2-3% outside North America and approximately 1-2% worldwide.",
    "Furthermore, gross fee revenues are projected between $981 million and $996 million, up 8-9% on a year-over-year basis. Operating income is anticipated between $744 million and $764 million. General, administrative, and other expenses are expected to be $249-$254 million. Adjusted EBITDA is anticipated to be $917-$937 million, up 6-8% year over year. Earnings per share are envisioned in the $1.53-$1.58 band.",
    " 2019 Guidance ",
    "For 2019, Marriott anticipates earnings of $5.97-$6.06 per share compared with $5.97-$6.19 projected earlier. The Zacks Consensus Estimate for full-year earnings is pegged at $6.09. Gross fee revenues are expected between $3,820 million and $3,850 million, up 5-6% from the year-ago period. Comparable system-wide RevPAR is expected to increase in the range of 1-2% in North America, 2-3% outside North America and 1-2% worldwide. Marriot now expects room additions of nearly 5.5.5% in 2019, which comprises deletions of 1-1.5%.Operating income is envisioned to be $2,910-$2,950 million compared with 2,925-$3,025 million estimated earlier. General, administrative and other expenses are anticipated to be $920-$930 million. Adjusted EBITDA is projected in the band of $3,586-$3,626 million, up 3-4% from 2018.",
    " How Have Estimates Been Moving Since Then? ",
    "In the past month, investors have witnessed a downward trend in estimates review. The consensus estimate has shifted -6.87% due to these changes.",
    " VGM Scores ",
    "Currently, Marriott International has a nice Growth Score of B, though it is lagging a bit on the Momentum Score front with a C. Following the exact same course, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of C. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Marriott International has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:41"
}