{
  "url": "https://www.nasdaq.com/article/why-shares-of-qutoutiao-fell-today-cm1208170",
  "title": "Why Shares of Qutoutiao Fell Today - Nasdaq.com",
  "text": [
    " What happened Shares of   Qutoutiao    (NASDAQ: QTT) slumped on Thursday after the   Chinese mobile-content platform company    reported its second-quarter results. They were mixed relative to   analyst expectations, and its guidance called for no sequential   revenue growth in the third quarter. The stock was down about   12.2% at 10:45 a.m. EDT today. So what Second-quarter revenue was $201.9 million, up 187.9% year over   year in local currency and about $8.8 million above the average   analyst estimate. Average monthly active users reached 119.3   million, up from 111.4 million in the first quarter, and average   daily active users totaled 38.7 million, up from 37.5 million in   the first quarter. Average daily time spent per daily active user   was 60 minutes, down from 62.1 minutes in the first quarter.   Image source: Getty Images.makeArticleAd();  \"In this quarter, we further improved our efficiency and   internal collaboration through modularizing common   functionalities, building full function teams, and introducing   internal rotation programs for team leaders,\" said CEO Eric   Siliang Tan in prepared remarks with the earnings release. Non-   GAAP    (adjusted) earnings per American depositary share came in at a   loss of $0.28, worse than analyst expectations by $0.05. The   company's total non-GAAP net loss was $72.3 million, more than   quadrupling from the prior-year period in local currency. Now what For the third quarter, the company expects revenue to be   roughly unchanged from the second quarter. That implies user   growth will likely stagnate. The plunge on Thursday brings the stock close to $4 per share,   far below the highs around $15 reached earlier this year. The   stock is now down about 74% from its 2019 high.   10 stocks we like better than QUTOUTIAO INC       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and QUTOUTIAO INC wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Timothy Green      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   Qutoutiao    (NASDAQ: QTT) slumped on Thursday after the   Chinese mobile-content platform company    reported its second-quarter results. They were mixed relative to   analyst expectations, and its guidance called for no sequential   revenue growth in the third quarter. The stock was down about   12.2% at 10:45 a.m. EDT today.",
    "Second-quarter revenue was $201.9 million, up 187.9% year over   year in local currency and about $8.8 million above the average   analyst estimate. Average monthly active users reached 119.3   million, up from 111.4 million in the first quarter, and average   daily active users totaled 38.7 million, up from 37.5 million in   the first quarter. Average daily time spent per daily active user   was 60 minutes, down from 62.1 minutes in the first quarter.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "\"In this quarter, we further improved our efficiency and   internal collaboration through modularizing common   functionalities, building full function teams, and introducing   internal rotation programs for team leaders,\" said CEO Eric   Siliang Tan in prepared remarks with the earnings release.",
    "Non-   GAAP    (adjusted) earnings per American depositary share came in at a   loss of $0.28, worse than analyst expectations by $0.05. The   company's total non-GAAP net loss was $72.3 million, more than   quadrupling from the prior-year period in local currency.",
    "For the third quarter, the company expects revenue to be   roughly unchanged from the second quarter. That implies user   growth will likely stagnate.",
    "The plunge on Thursday brings the stock close to $4 per share,   far below the highs around $15 reached earlier this year. The   stock is now down about 74% from its 2019 high.",
    "  10 stocks we like better than QUTOUTIAO INC       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and QUTOUTIAO INC wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than QUTOUTIAO INC       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and QUTOUTIAO INC wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Timothy Green      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:36:00"
}