{
  "url": "https://www.nasdaq.com/article/stock-market-news-for-sep-5-2019-cm1207973",
  "title": "Stock Market News for Sep 5, 2019 - Nasdaq.com",
  "text": [
    " Major indexes ended in the green on Wednesday after the Fed's Beige Book revealed that the U.S. economy expanded modestly through August-end. In addition, monetary easing by China to boost its slowing economy and the UK Parliament's approval of a law to delay Brexit boosted investors' sentiment. The Dow Jones Industrial Average climbed 0.9% to close at 26,355.47 on Sep 4. The broader S&P 500 and Nasdaq Composite followed suit, rising 1.1% and 1.3% respectively. The former closed at 2,937.78 and the latter finished the day at 7,976.88. The fear-gauge CBOE Volatility Index (VIX) slumped 11.9% to close at 17.33 on Wednesday. Finally, advancers outnumbered decliners on the NYSE by a 4.17-to-1 ratio.  Fed's Biege Book Points to a Decent U.S. Economy  On Sep 4, the closely followed Fed's Beige Book disclosed  U.S. economy's decent pace through the end of August. It noted that most businesses had an optimistic near-term outlook despite the ongoing U.S.-China trade war. Auto sales rose modestly in most districts although transportation activity declined due to lower global demand and rise in trade tensions. Reports on consumer spending remained mixed. Tourism activity remained firm in most districts. Home sales were limited due to low inventory levels and average new home construction activity. Commercial real estate construction and sales activity remained sound and the pace of leasing rose as well. It was noted that manufacturing activity was lower than the previous report. Agricultural conditions were weak too, primarily due to adverse weather conditions, low prices of commodities and uncertainties related to trade dispute. You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  .   China Takes Further Steps to Fuel its Economy  China's cabinet signaled a series of steps to lift the Asian country's slowing economy. The cabinet indicated that a decline in the amount of funds that banks have to hold in reserve was underway. It also stressed upon lowering \"faster\" the real borrowing cost for businesses. The State Council on Sep 4, following an executive meeting  chaired by Premier Li Keqiang, called for using tools such as broad and targeted reserve-ratio cuts to cushion the country's economy.  UK's Attempt for an Orderly Exit from EU  United Kingdom's parliament, late on Sep 3, took steps  to prevent a no-deal exit from EU. First, the House of Commons rejected UK Prime Minister Boris Johnson's call for a snap election. The Labor opposition won't support it until a bill that blocks a no-deal Brexit is passed. The bill, which requests EU for a three-month delay in order to figure out a Brexit deal, is expected to move through the House of Lords by Sep 6.  Economic News  U.S. trade deficit lowered by 3%, thanks to increase in exports of drugs, autos and oil. The deficit declined from a revised $55.5 billion in June to $54 billion in July. July's exports were $207.4 billion, which were $1.2 billion more than exports in the month before.  Stocks that Made Headlines    Stryker's Mobius Imaging Buyout to Boost Its Spine     Division   Stryker Corporation SYK  recently announced an agreement to acquire Mobius Imaging for a deal value of $370 million upfront and up to $130 million of contingent payments. ( Read more  )   Equinor's $5B Buyback to be Aided by Johan Sverdrup     Output   Equinor ASA EQNR  recently announced a share repurchase program valued at $5 billion. ( Read more  )  It's Illegal in 42 States, But Investors Will Make   Billions Legally  In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year. That's twice as much as they spend on marijuana, legally or otherwise. Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.   See these 5 \"sin stocks\" now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Stryker Corporation (SYK): Free Stock Analysis Report   Statoil ASA (EQNR): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Major indexes ended in the green on Wednesday after the Fed's Beige Book revealed that the U.S. economy expanded modestly through August-end. In addition, monetary easing by China to boost its slowing economy and the UK Parliament's approval of a law to delay Brexit boosted investors' sentiment.",
    "The Dow Jones Industrial Average climbed 0.9% to close at 26,355.47 on Sep 4. The broader S&P 500 and Nasdaq Composite followed suit, rising 1.1% and 1.3% respectively. The former closed at 2,937.78 and the latter finished the day at 7,976.88. The fear-gauge CBOE Volatility Index (VIX) slumped 11.9% to close at 17.33 on Wednesday. Finally, advancers outnumbered decliners on the NYSE by a 4.17-to-1 ratio.",
    " Fed's Biege Book Points to a Decent U.S. Economy ",
    "On Sep 4, the closely followed Fed's Beige Book disclosed  U.S. economy's decent pace through the end of August. It noted that most businesses had an optimistic near-term outlook despite the ongoing U.S.-China trade war. Auto sales rose modestly in most districts although transportation activity declined due to lower global demand and rise in trade tensions.",
    "Reports on consumer spending remained mixed. Tourism activity remained firm in most districts. Home sales were limited due to low inventory levels and average new home construction activity. Commercial real estate construction and sales activity remained sound and the pace of leasing rose as well.",
    "It was noted that manufacturing activity was lower than the previous report. Agricultural conditions were weak too, primarily due to adverse weather conditions, low prices of commodities and uncertainties related to trade dispute. You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  . ",
    " China Takes Further Steps to Fuel its Economy ",
    "China's cabinet signaled a series of steps to lift the Asian country's slowing economy. The cabinet indicated that a decline in the amount of funds that banks have to hold in reserve was underway. It also stressed upon lowering \"faster\" the real borrowing cost for businesses.",
    "The State Council on Sep 4, following an executive meeting  chaired by Premier Li Keqiang, called for using tools such as broad and targeted reserve-ratio cuts to cushion the country's economy.",
    " UK's Attempt for an Orderly Exit from EU ",
    "United Kingdom's parliament, late on Sep 3, took steps  to prevent a no-deal exit from EU. First, the House of Commons rejected UK Prime Minister Boris Johnson's call for a snap election. The Labor opposition won't support it until a bill that blocks a no-deal Brexit is passed. The bill, which requests EU for a three-month delay in order to figure out a Brexit deal, is expected to move through the House of Lords by Sep 6.",
    " Economic News ",
    "U.S. trade deficit lowered by 3%, thanks to increase in exports of drugs, autos and oil. The deficit declined from a revised $55.5 billion in June to $54 billion in July. July's exports were $207.4 billion, which were $1.2 billion more than exports in the month before.",
    " Stocks that Made Headlines ",
    "  Stryker's Mobius Imaging Buyout to Boost Its Spine     Division  ",
    "Stryker Corporation SYK  recently announced an agreement to acquire Mobius Imaging for a deal value of $370 million upfront and up to $130 million of contingent payments. ( Read more  )",
    "  Equinor's $5B Buyback to be Aided by Johan Sverdrup     Output  ",
    "Equinor ASA EQNR  recently announced a share repurchase program valued at $5 billion. ( Read more  )",
    " It's Illegal in 42 States, But Investors Will Make   Billions Legally ",
    "In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    "That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "  See these 5 \"sin stocks\" now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:06:00"
}