{
  "url": "https://www.nasdaq.com/article/hong-kong-leader-to-meet-media-after-killing-extradition-bill-20190904-01211",
  "title": "Hong Kong leader to meet media after killing extradition bill - Nasdaq.com",
  "text": [
    "HONG KONG, Sept 5 (Reuters) - Hong Kong leader Carrie Lam is due to address the media on Thursday, a day after she withdrew a controversial extradition bill that has triggered mass protests and plunged the Chinese territory into its worst political crisis in decades.",
    "Lam, in a pre-recorded televised message, on Wednesday formally withdrew the bill, acceding to one of pro-democracy protesters' five demands, although many demonstrators and lawmakers said the move was too little, too late. ",
    "The official China Daily said on Thursday that the withdrawal of the bill was an olive branch that leaves demonstrators with no excuse to continue violence. ",
    "The Beijing-backed leader is due to speak to the the media at 0315 GMT before she departs for a trip to China's Guangxi province on Thursday afternoon.",
    "Skirmishes broke out in some districts late on Wednesday after Lam's announcement, which came after a weekend of some of the most violent protests the city has seen in the past three months.",
    "Police said a suspected petrol bomb was hurled at a luxury property in Kowloon district in the early hours of Thursday and the suspects fled on a motorbike. Local newspaper Apple Daily said the house belonged to Jimmy Lai, who was in the property at the time. Pro-democracy publishing tycoon Lai is an outspoken critic of Beijing.",
    "The Asian financial hub has been roiled by some of the worst violence in decades, with protesters burning barricades and throwing petrol bombs and police retaliating with water cannon, tear gas and batons.",
    "The bill, which would have allowed people in the city to be sent to China for trial in courts controlled by the Communist Party, was seen as the latest example of what many residents see as ever-tighter control by Beijing, despite the promise of autonomy.",
    "The former British colony was handed back to China in 1997 under a \"one country, two systems\" administration which gave the city of more than 7 million people more freedoms than mainland cities, such as an independent judiciary.",
    "China denies meddling in Hong Kong's affairs and accuses Western countries of fuelling the protests.",
    "Images of some of the fiercest clashes have been beamed live on television screens across the world, sending jitters across the international business community and leading to a large drop in tourism. ",
    "The Hong Kong government took out a full-page advert in the Australian Financial Review on Thursday saying it is \"determined to achieve a peaceful, rational and reasonable resolution\" and is resolutely committed to \"One Country, Two Systems\".",
    "It ends the advert by saying: \"We will no doubt bounce back. We always do\".",
    "More than 1,100 people have been arrested since the violence escalated in June and Hong Kong is facing its first recession in a decade.",
    "China has strongly denounced the violence and warned it could use force to restore order. Beijing is eager to quell the unrest before the 70th anniversary of the founding of the People's Republic of China on Oct 1.",
    "Lam, wearing a navy blue blazer and pink top, said in her televised message that her administration would reach out to the community to start a dialogue to address the discontent with the \"foremost priority now is to end violence, to safeguard the rule of law and to restore order and safety in society.\""
  ],
  "published_datetime": "2019-09-04 08:50:00"
}