{
  "url": "https://www.nasdaq.com/article/yields-soar-on-news-china-us-to-hold-oct-talks-20190905-00780",
  "title": "Yields soar on news China, U.S. to hold Oct. talks - Nasdaq.com",
  "text": [
    "By Kate Duguid",
    "NEW YORK, Sept 5 (Reuters) - Treasury yields rocketed higher on Thursday after news that the United States and China had agreed to hold talks in October, spurring hopes for a long-awaited trade deal that might remove a drag on growth. ",
    "Across maturities, yields were at least 10 basis points higher, with the benchmark 10-year yield  at 1.574%, up 11.7 basis points. The two-year yield , which moves with expectations of interest rate policy, was up 11.8 basis points to 1.552%.",
    "\"It all started last night with the headline that there would be U.S.-China talks in October. Basically it sent a risk-on tone around the globe. Even as we hit multi-year low yields in the 2s, 3s and 5s yesterday - the market is just under heavy pressure as all assets are at least seen as a short-term positive,\" said Justin Lederer, Treasury analyst and trader at Cantor Fitzgerald.  ",
    "\"Does it last? We'll see what headline events ultimately occur in the next few days, weeks, month.\"",
    "The talks were agreed to in a phone call between Chinese Vice Premier Liu He and U.S. Trade Representative Robert Lighthizer and U.S. Treasury Secretary Steven Mnuchin, China's commerce ministry said in a statement on its website. ",
    "The rise in U.S. Treasury yields was on top of an earlier increase as payroll processor ADP said U.S. private employment grew at its fastest pace in four months in August, beating analysts' expectations. ",
    "Euro zone bond yields also inched higher as investors welcomed signs of progress in resolving the U.S.-China trade war and seized on recent doubts about whether a European Central Bank stimulus package next week can match expectations.",
    "After a strong rally in August, euro zone bonds stumbled in recent days. Reduced political risk, from the approval of a coalition government in Italy to the UK parliament's battle to avert a no-deal Brexit, have helped improve investors' mood, reducing demand for safe-haven government bonds. ",
    "Lederer said traders this week were also watching the very heavy corporate debt issuance calendar. Nearly $27 billion of U.S. investment-grade debt from 21 issuers came to market on Tuesday, the busiest day on record in terms of numbers of borrowers seeking funding, according to IFR. ",
    "Traders sell Treasuries to offset long positions in new corporate debt, driving yields higher.  "
  ],
  "published_datetime": "2019-09-05 11:00:00"
}