{
  "url": "https://www.nasdaq.com/article/forexsinous-trade-thaw-sparks-risk-rally-euro-awaits-ecb-20190911-00918",
  "title": "FOREX-Sino-U.S. trade thaw sparks risk rally, euro awaits ECB - Nasdaq.com",
  "text": [
    "    * Risk currencies rally after Trump postpones tariffs",
    "* Dollar at six-week peak vs yen, yuan jumps",
    "* Euro slides ahead of ECB meeting",
    "SINGAPORE, Sept 12 (Reuters) - An exchange of olive branchesbetween Washington and Beijing on trade pushed the dollar to asix-week high against the safe-haven yen on Thursday and alsosupported the risk-sensitive currencies of China, Australia andSouth Korea.",
    "The world's two largest economies granted concessions intheir heated tariff dispute on Wednesday ahead of planned talks.China exempted a basket of U.S. goods from its own tariffs whileU.S. President Donald Trump said he would delay a scheduledtariff hike by two-weeks in October.",
    "The thaw in hostilities supported broader risk appetite inglobal financial markets with the Chinese yuan CNH= jumping0.2% to 7.0861 in offshore trade, its highest in three weeks.The trade-exposed Korean won KRW= hit a six-week peak of1,185.67 per dollar. The Australian dollar AUD=D3 rose 0.2%.",
    "The yen JPY=EBS fell almost 0.2% to 108.00 per dollar, itsweakest since Aug. 1.",
    "\"It's a conciliatory move,\" said Joe Capurso, seniorcurrency strategist at the Commonwealth Bank of Australia inSydney, while warning not to get too carried away.",
    "\"It's not really a change in policy...we don't see anystrong evidence there's going to be a permanent agreement toratchet down these tariffs.\"",
    "The other major driver for currency markets on Thursday is ameeting of the European Central Bank, where expectations ofeasing have weakened the euro.",
    "The single currency EUR=EBS has shed 3.5% since June andfell to a one-week low of $1.0983 overnight. It was steady at$1.1010 in Asian morning trade.",
    "With growth slowing, the ECB has all but promised moresupport for the economy in one of the most closely watchedmeetings in years. urn:newsml:reuters.com:*:nL5N2622HL",
    "The ECB is almost certain to cut rates, promise to keeprates low for longer and provide banks relief from the sideeffects of negative rates. However, new asset purchases, pricedin by markets, are not a done deal with some conservativepolicymakers opposing the move.",
    "\"Market reaction will likely hinge on the confirmation of arate cut,\" said David de Garis, a director of economics andmarkets at National Australia Bank in London.",
    "\"The real kicker though will not be whether QE isre-started, but crucially, whether it leaves markets feeling theECB is running out of room, or hamstrung by internalopposition,\" he said. \"What markets would not want to hear isduring the press conference evidence of a disagreement.\"",
    "Sterling also dipped after a Scottish court ruled onWednesday that Prime Minister Boris Johnson's suspension of theBritish Parliament was unlawful, prompting immediate calls forlawmakers to return to work as the government and Parliamentbattle over the future of Brexit. urn:newsml:reuters.com:*:nL5N2620Z5",
    "The British pound GBP=D3 fell as much as 0.4% to $1.2313overnight, and hovered around $1.2330 in Asian hours.",
    " (Reporting by Tom Westbrook; Editing by Sam Holmes) ((tom.westbrook@tr.com; +61466355340;))"
  ],
  "published_datetime": "2019-09-11 08:59:00"
}