{
  "url": "https://www.nasdaq.com/article/3-groundbreaking-back-to-school-stocks-cm1206908",
  "title": "3 Groundbreaking Back-to-School Stocks - Nasdaq.com",
  "text": [
    "  This article was     first published by MyWallSt.   Which 2 pot stocks will beat the market? Find out in our       free guide!   September is upon us again, and we all know what that means.   Students everywhere, young and not-so-young alike, are   frantically searching for campus accommodation, bargaining over   second-hand textbooks, and trying not to think about the hefty   school fees that lie ahead.   Image source: Unsplash.makeArticleAd();  While brick-and-mortar education continues to boast undoubted   advantages for the general student -- the prestige of traditional   accreditations, the opportunity to expand one's social life --   the various alternative ventures made possible by the internet   may be better-tailored to specialists in the long run. At any   rate,   the rise of digital education    has created one of the most exciting megatrends of recent   years. Here are three companies that are poised to capitalize on   these changes in education.  1. Chegg  The world of online education may resemble the Wild West in   some regards, with no acknowledged leaders in the space, no   Harvards or Yales to speak of, but   Chegg    (NYSE: CHGG) is quickly emerging as a serious contender for the   title of first brand-name digital course. Chegg's mission -- the name, by the way, is a portmanteau of   \"chicken\" and \"egg\" -- is nothing less than to \"   Provide Overwhelming Value    to Solve Students' Problems.\" Among the biggest of these problems   is the sheer cost of schooling. One of Chegg's top solutions is   its   Netflix    -inspired subscription service, which allows students to rent   textbooks for a semester at half the cost of buying them. On top   of that, the company also offers one-on-one tutoring services in   a variety of subjects at bargain prices. Students are lapping it up, too. At the beginning of this   year, Chegg recorded more than   3 million subscribers    , while in its most recen   t earnings    report the company said its content had been viewed almost 200   million times. These are astonishing figures, but with almost 20   million students in the U.S. alone, Chegg's most exciting period   of growth may well lie ahead.  2. K12  Founded in 1999,   K12    (NYSE: LRN) is a rough contemporary of Chegg. On the surface, the   two companies offer similar services, but the main difference   between them is that K12 aims at a younger base. The company   provides students with value in three ways: through its full-time   online public schools, its individual educational products (sold   directly to families), and its partnerships with traditional   schools. The company's mixture of accredited coursework and digital   innovation has proven to be a hit with students, families, and   schools alike. While many of its virtual courses are   tuition-free, it also offers private education for as much as   $7,000 annually. As a result, the company pulled in revenue of   more than $1 billion in fiscal 2019, while its enrollment figures   are higher than ever.  3. Bright Horizons  While Chegg appeals mostly to university students, and K12 to   middle- and high-school pupils,   Bright Horizons    (NYSE: BFAM) is best known for its child care programs,   especially its pioneering ventures in early education, which   include preschool STEM training. Partnering with over 1,100 employers ranging from the U.S. to   India, Bright Horizons has a truly global presence. Wherever   there are working parents, there will be a need for the company's   range of services, which include everything from brick-and-mortar   day care facilities to online tuition management. Mostly due to the strength of its corporate contracts, Bright   Horizons is on the verge of turning child care into big business.   Indeed, in its most recen   t quarterly   report    , the company saw revenue climb by 8% year over year to $528   million, while it continues to invest in marketing and technology   in a bid to deepen the Bright Horizons presence in its key   markets.   Image source: MyWallSt.     One of these pot stocks is         already +100% this year. What are you waiting for?     MyWallSt operates a full disclosure policy. MyWallSt staff     currently hold long positions in Chegg. Read our  full disclosure policy here  .    10 stocks we like better than K12       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and K12 wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       The Motley Fool owns shares of and recommends Netflix. The     Motley Fool has a     disclosure policy      .  ",
    " This article was     first published by MyWallSt.   Which 2 pot stocks will beat the market? Find out in our       free guide!  ",
    "September is upon us again, and we all know what that means.   Students everywhere, young and not-so-young alike, are   frantically searching for campus accommodation, bargaining over   second-hand textbooks, and trying not to think about the hefty   school fees that lie ahead.",
    "  Image source: Unsplash.makeArticleAd(); ",
    "Image source: Unsplash.",
    "While brick-and-mortar education continues to boast undoubted   advantages for the general student -- the prestige of traditional   accreditations, the opportunity to expand one's social life --   the various alternative ventures made possible by the internet   may be better-tailored to specialists in the long run. At any   rate,   the rise of digital education    has created one of the most exciting megatrends of recent   years.",
    "Here are three companies that are poised to capitalize on   these changes in education.",
    "The world of online education may resemble the Wild West in   some regards, with no acknowledged leaders in the space, no   Harvards or Yales to speak of, but   Chegg    (NYSE: CHGG) is quickly emerging as a serious contender for the   title of first brand-name digital course.",
    "Chegg's mission -- the name, by the way, is a portmanteau of   \"chicken\" and \"egg\" -- is nothing less than to \"   Provide Overwhelming Value    to Solve Students' Problems.\" Among the biggest of these problems   is the sheer cost of schooling. One of Chegg's top solutions is   its   Netflix    -inspired subscription service, which allows students to rent   textbooks for a semester at half the cost of buying them. On top   of that, the company also offers one-on-one tutoring services in   a variety of subjects at bargain prices.",
    "Students are lapping it up, too. At the beginning of this   year, Chegg recorded more than   3 million subscribers    , while in its most recen   t earnings    report the company said its content had been viewed almost 200   million times. These are astonishing figures, but with almost 20   million students in the U.S. alone, Chegg's most exciting period   of growth may well lie ahead.",
    "Founded in 1999,   K12    (NYSE: LRN) is a rough contemporary of Chegg. On the surface, the   two companies offer similar services, but the main difference   between them is that K12 aims at a younger base. The company   provides students with value in three ways: through its full-time   online public schools, its individual educational products (sold   directly to families), and its partnerships with traditional   schools.",
    "The company's mixture of accredited coursework and digital   innovation has proven to be a hit with students, families, and   schools alike. While many of its virtual courses are   tuition-free, it also offers private education for as much as   $7,000 annually. As a result, the company pulled in revenue of   more than $1 billion in fiscal 2019, while its enrollment figures   are higher than ever.",
    "While Chegg appeals mostly to university students, and K12 to   middle- and high-school pupils,   Bright Horizons    (NYSE: BFAM) is best known for its child care programs,   especially its pioneering ventures in early education, which   include preschool STEM training.",
    "Partnering with over 1,100 employers ranging from the U.S. to   India, Bright Horizons has a truly global presence. Wherever   there are working parents, there will be a need for the company's   range of services, which include everything from brick-and-mortar   day care facilities to online tuition management.",
    "Mostly due to the strength of its corporate contracts, Bright   Horizons is on the verge of turning child care into big business.   Indeed, in its most recen   t quarterly   report    , the company saw revenue climb by 8% year over year to $528   million, while it continues to invest in marketing and technology   in a bid to deepen the Bright Horizons presence in its key   markets.",
    "  Image source: MyWallSt. ",
    "Image source: MyWallSt.",
    "   One of these pot stocks is         already +100% this year. What are you waiting for?   ",
    " MyWallSt operates a full disclosure policy. MyWallSt staff     currently hold long positions in Chegg. Read our  full disclosure policy here  . ",
    "  10 stocks we like better than K12       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and K12 wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than K12       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and K12 wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " The Motley Fool owns shares of and recommends Netflix. The     Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 15:19:00"
}