{
  "url": "https://www.nasdaq.com/article/exxonmobil-drops-out-of-top-10-in-sp-500-tech-stocks-shine-cm1207295",
  "title": "ExxonMobil Drops Out of Top 10 in S&P 500, Tech Stocks Shine - Nasdaq.com",
  "text": [
    " The hydrocarbon energy industry was recently dealt a major blow, with Exxon Mobil Corporation XOM  dropping from the S&P 500 Index's top 10 companies, ending a nine-decade-long streak. This August, energy stocks climbed down the ranking list, giving way to technology stocks. Currently, the top 10 places are occupied by companies from technology, communications, health care and financial services. This marks a major event for the energy industry as a whole, which can shape the future of the market.  Gradual Decline of Energy Stocks  In terms of company rankings, a decade ago, ExxonMobil - the largest publicly-traded energy company - stayed at the top spot of the list for six straight years. The Zacks Rank #3 (Hold) company is now in the 12 th  spot, with its peer Chevron Corporation CVX  holding the 19 th  place. You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  .  Notably, energy stocks made up 25% of the index about four decades ago, which declined to 11.7% a decade ago. The sector now accounts for 4.4% of the index. If we look at the price performance, ExxonMobil gained only 0.6% year to date while the S&P 500 jumped 15.3%. The Oils-Energy sector fell 5.1% during this time period.         Factors Affecting Hydrocarbon Market  There are several factors that affected the energy sector, among which soft as well as volatile  oil prices  played spoilsports. With the shale-oil boom, the hydrocarbon market stayed oversupplied for a long time, partially offset by the Organization of the Petroleum Exporting Countries' production-cut initiatives and Iranian sanctions from the Washington. Moreover, concerns regarding future oil demand affected the sector to a significant extent. With developing countries like India, China and others expected to see a bleak economic growth rate in the coming years, demand for hydrocarbons is expected to decline further. This has put a lid on oil prices. Also, the trade war between Washington and Beijing has sparked concerns regarding oil demand. Additionally, climate changes have triggered a drive toward renewable energy sources. Environmental campaigns have witnessed somewhat success with several major funds withdrawing from stocks in fossil fuels. Also, efficiency gain in wind, solar and other renewable and clean energy sources are working against the fossil-fuel industry. All these key factors compelled investors to dump oil stocks.  Tech Leads the Way  Currently, the top three spots are occupied by tech giants Microsoft Corporation MSFT  , Apple Inc. AAPL  and Amazon.com, Inc. AMZN  . Overall, the tech stocks have come a long way in the last few years supported by major breakthroughs. In the year-to-date period, the Zacks Technology sector jumped 18.7%, with Microsoft, Apple and Amazon.com gaining 33.9%, 30.4% and 19.2%, respectively.    With the energy industry losing its position and the technology industry coming to the forefront, the dynamics of the market are set to change in the coming years. The newfound strength in technology will likely help renewable energy sources see efficiency gain and cost reduction. Over time, it can lead to a further decline in the hydrocarbon market, while boosting investments in renewable energy sources.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Amazon.com, Inc. (AMZN): Free Stock Analysis Report   Apple Inc. (AAPL): Free Stock Analysis Report   Microsoft Corporation (MSFT): Free Stock Analysis Report   Chevron Corporation (CVX): Free Stock Analysis Report   Exxon Mobil Corporation (XOM): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "The hydrocarbon energy industry was recently dealt a major blow, with Exxon Mobil Corporation XOM  dropping from the S&P 500 Index's top 10 companies, ending a nine-decade-long streak. This August, energy stocks climbed down the ranking list, giving way to technology stocks. Currently, the top 10 places are occupied by companies from technology, communications, health care and financial services. This marks a major event for the energy industry as a whole, which can shape the future of the market.",
    " Gradual Decline of Energy Stocks ",
    "In terms of company rankings, a decade ago, ExxonMobil - the largest publicly-traded energy company - stayed at the top spot of the list for six straight years. The Zacks Rank #3 (Hold) company is now in the 12 th  spot, with its peer Chevron Corporation CVX  holding the 19 th  place. You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here  . ",
    "Notably, energy stocks made up 25% of the index about four decades ago, which declined to 11.7% a decade ago. The sector now accounts for 4.4% of the index. If we look at the price performance, ExxonMobil gained only 0.6% year to date while the S&P 500 jumped 15.3%. The Oils-Energy sector fell 5.1% during this time period.",
    " Factors Affecting Hydrocarbon Market ",
    "There are several factors that affected the energy sector, among which soft as well as volatile  oil prices  played spoilsports. With the shale-oil boom, the hydrocarbon market stayed oversupplied for a long time, partially offset by the Organization of the Petroleum Exporting Countries' production-cut initiatives and Iranian sanctions from the Washington.",
    "Moreover, concerns regarding future oil demand affected the sector to a significant extent. With developing countries like India, China and others expected to see a bleak economic growth rate in the coming years, demand for hydrocarbons is expected to decline further. This has put a lid on oil prices. Also, the trade war between Washington and Beijing has sparked concerns regarding oil demand.",
    "Additionally, climate changes have triggered a drive toward renewable energy sources. Environmental campaigns have witnessed somewhat success with several major funds withdrawing from stocks in fossil fuels. Also, efficiency gain in wind, solar and other renewable and clean energy sources are working against the fossil-fuel industry. All these key factors compelled investors to dump oil stocks.",
    " Tech Leads the Way ",
    "Currently, the top three spots are occupied by tech giants Microsoft Corporation MSFT  , Apple Inc. AAPL  and Amazon.com, Inc. AMZN  . Overall, the tech stocks have come a long way in the last few years supported by major breakthroughs. In the year-to-date period, the Zacks Technology sector jumped 18.7%, with Microsoft, Apple and Amazon.com gaining 33.9%, 30.4% and 19.2%, respectively.",
    "With the energy industry losing its position and the technology industry coming to the forefront, the dynamics of the market are set to change in the coming years. The newfound strength in technology will likely help renewable energy sources see efficiency gain and cost reduction. Over time, it can lead to a further decline in the hydrocarbon market, while boosting investments in renewable energy sources.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:08:00"
}