{
  "url": "https://www.nasdaq.com/article/boeing-ba-gains-but-lags-market-what-you-should-know-cm1207628",
  "title": "Boeing (BA) Gains But Lags Market: What You Should Know - Nasdaq.com",
  "text": [
    " In the latest trading session, Boeing (BA) closed at $356.59, marking a +0.61% move from the previous day. This move lagged the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%. Prior to today's trading, shares of the airplane builder had gained 6.61% over the past month. This has outpaced the Aerospace sector's gain of 4.92% and the S&P 500's loss of 0.68% in that time. BA will be looking to display strength as it nears its nex t earnings  release. On that day, BA is projected to report earnings of $2.33 per share, which would represent a year-over-year decline of 34.92%. Meanwhile, our latest consensus estimate is calling for revenue of $20.71 billion, down 17.63% from the prior-year quarter. BA's full-year Zacks Consensus Estimates are calling for earnings of $3.98 per share and revenue of $85.61 billion. These results would represent year-over-year changes of -75.14% and -15.35%, respectively. Investors should also note any recent changes to analyst estimates for BA. These revisions help to show the ever-changing nature of near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 2% higher. BA is currently a Zacks Rank #3 (Hold). Looking at its valuation, BA is holding a Forward P/E ratio of 89.11. This valuation marks a premium compared to its industry's average Forward P/E of 18.27. Investors should also note that BA has a PEG ratio of 10.8 right now. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. Aerospace - Defense stocks are, on average, holding a PEG ratio of 2.14 based on yesterday's closing prices. The Aerospace - Defense industry is part of the Aerospace sector. This industry currently has a Zacks Industry Rank of 18, which puts it in the top 8% of all 250+ industries. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  The Boeing Company (BA): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "In the latest trading session, Boeing (BA) closed at $356.59, marking a +0.61% move from the previous day. This move lagged the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%.",
    "Prior to today's trading, shares of the airplane builder had gained 6.61% over the past month. This has outpaced the Aerospace sector's gain of 4.92% and the S&P 500's loss of 0.68% in that time.",
    "BA will be looking to display strength as it nears its nex t earnings  release. On that day, BA is projected to report earnings of $2.33 per share, which would represent a year-over-year decline of 34.92%. Meanwhile, our latest consensus estimate is calling for revenue of $20.71 billion, down 17.63% from the prior-year quarter.",
    "BA's full-year Zacks Consensus Estimates are calling for earnings of $3.98 per share and revenue of $85.61 billion. These results would represent year-over-year changes of -75.14% and -15.35%, respectively.",
    "Investors should also note any recent changes to analyst estimates for BA. These revisions help to show the ever-changing nature of near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 2% higher. BA is currently a Zacks Rank #3 (Hold).",
    "Looking at its valuation, BA is holding a Forward P/E ratio of 89.11. This valuation marks a premium compared to its industry's average Forward P/E of 18.27.",
    "Investors should also note that BA has a PEG ratio of 10.8 right now. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. Aerospace - Defense stocks are, on average, holding a PEG ratio of 2.14 based on yesterday's closing prices.",
    "The Aerospace - Defense industry is part of the Aerospace sector. This industry currently has a Zacks Industry Rank of 18, which puts it in the top 8% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:45:23"
}