{
  "url": "https://www.nasdaq.com/article/japanese-stocks-hit-4month-high-as-trade-detente-hopes-lift-cyclicals-20190912-00054",
  "title": "Japanese stocks hit 4-month high as trade detente hopes lift cyclicals - Nasdaq.com",
  "text": [
    "    * Nikkei, Topix hit highest levels since early May",
    "* Chip-related sector lead gains on U.S.-China trade hopes",
    "* Reversal in value shares dissipates ",
    "TOKYO, Sept 12 (Reuters) - Japanese shares posted solidgains on Thursday, with both the Nikkei and the broader Topixindexes hitting four-month highs, as signs of an easing inU.S.-China trade frictions lifted cyclical stocks such asmachine makers.",
    "The Nikkei share average .N225 rose 0.75% to 21,759.61,while the broader Topix .TOPX advanced 0.72% to 1,595.10, bothreaching their highest since early May.",
    "It was the eighth straight day of gains for the Nikkei,during which it has risen 5.5 percent. In another positive sign,in dollar terms, the Nikkei raced to its highest levels sinceOctober.",
    "U.S. President Donald Trump said on Wednesday Washington hasagreed to delay increasing tariffs on $250 billion worth ofChinese imports by two weeks after Beijing said it would exempt16 types of U.S. products from import tariffs.",
    "\"Hopes for U.S.-China deals are driving the markets now. Iexpect this to continue for the next few weeks,\" said SoichiroMonji, senior economist at Sumitomo Mitsui DS Asset Management.",
    "\"But once any deal is done, the rally will lose momentum asthe market will focus on the strength of the economy and by thattime, it is possible that there will be more signs of slowdown.So now is the time to buy. If you wait, it will be too late,\" hesaid.",
    "Cyclical shares such as manufactures of semiconductor androbotics, which are seen as closely dependent on demand inChina, rose sharply. ",
    "Fanuc Corp6954.T rallied 2.2% and Keyence Corp6861.T gained 1.9%. Advantest6857.T jumped 4.1% and Tokyo Electron8035.T climbed 2.7% to a 15-month high.",
    "The reversal of value-oriented stocks, such as banks andautomakers that had dominated the market until Wednesday, ranout of steam. Growth stocks .TOPXG led gains with a rise of0.8%, versus a 0.6% increase in value stocks .TOPXV .",
    "Banking stocks .IBNKS.T fell 0.3% after rising more than10% in the previous five sessions. Transport equipment shares .ITEQP.T , which had gained more than 8% in the last fivesessions, were up 0.3%.",
    "Online fashion retailer Zozo Inc3092.T jumped 13.4%,having catapulted as much as 18.9% at one point, after YahooJapan Corp4689.T said it aimed to buy 50.1% of its stake.Yahoo Japan Corp4689.T rose 2.4%. urn:newsml:reuters.com:*:nL3N26243X",
    "Elsewhere, Dai Nippon Printing Co Ltd7912.T advanced 9.3%after the company announced share buyback of up to 60 billionyen, or 9.94% of its outstanding shares.",
    "The turnover of the main board hit 2.77 trillion yen ($25.65 billion), the highest since Aug. 2.($1 = 108.0100 yen) (Editing by Subhranshu Sahu & Shri Navaratnam) ((hideyuki.sano@thomsonreuters.com; +81 3 6441 1827;))"
  ],
  "published_datetime": "2019-09-12 02:33:00"
}