{
  "url": "https://www.nasdaq.com/article/multiple-income-streams-are-key-to-building-long-lasting-wealth-cm1207493",
  "title": "Multiple Income Streams Are Key to Building Long-Lasting Wealth - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Chris' note:  If you've been reading  The Daily Cut , you know one of the keys to making money… and keeping it… is to avoid putting all your eggs in one basket. It's something colleague and former hedge fund manager Teeka Tiwari learned the hard way in his early Wall Street days.",
    "Below, Teeka shares the investing philosophy that changed his life - and helped him build long-lasting wealth in four simple steps…",
    "It was December 2017. We were wrapping up a banner year at my flagship cryptocurrency newsletter,  Palm Beach Confidential .",
    "Now, back in January 2016, I'd realized cryptos were the next big investing megatrend. I knew we were at the beginning stages of the biggest story of my investing career.",
    "My publishers at Palm Beach Research Group were skeptical at first. But I eventually convinced them to let me share my crypto ideas with hundreds of thousands of subscribers who rely on us for income-producing and money-making ideas.",
    "The rest is history…",
    "Bitcoin rocketed from about $450 per coin when I first recommended it in March 2016 to nearly $20,000 in December 2017. Ethereum did even better - and has been up as much as 15,821% since then.",
    "My top recommendation rose as much as 151,323%. Even after the 2018 crypto pullback, it's still up a staggering 7,477% today.",
    "As you can imagine, many of my readers made buckets of money. Some became \"overnight millionaires.\" And others built on their already sizable nest eggs.",
    "While I'm extremely proud of these results… I've always advised against going \"all in.\"",
    "One thing I've always been clear on is: Cryptos are ideal asymmetric bets. Put simply, placing relatively small, equal amounts of money on my well-researched picks can lead to life-altering gains.",
    "I recommend putting no more than 5-10% of your liquid net worth into cryptos. They're intelligent speculations. And my system is the best in the world at sniffing out the next 100-bagger cryptos.",
    "But if you truly want to build long-lasting wealth, you need to generate multiple streams of income.",
    "It's a lesson I learned the hard way - and one of four that I'll share with you today…",
    "How I Lost It All",
    "I made my first big haul in the early 1990s, buying beaten-down junk bonds. And in the mid-1990s, I started making money hand-over-fist in technology stocks. I was making a fortune.",
    "But by late 1998, I'd lost it all. You see, I made a terrible mistake…",
    "Instead of taking small bets on high-risk, high-reward ideas, I was taking massive stakes.",
    "By the time the 1997 Asian financial crisis rolled around, I'd built up a substantial portfolio. But I stuck around too long and got too greedy.",
    "And when the market went against me, I made bigger and riskier bets. I lost all perspective and was investing for my ego, not my bank account.",
    "Within three weeks, I lost everything I'd made and more. I went from wealthy to poor in less than a month. And I ultimately filed for personal bankruptcy.",
    "It was a stunning reversal. Here I was, the golden boy who finally got his comeuppance.",
    "I learned many lessons on position-sizing, risk management, and diversification. But one of the biggest lessons I learned was: You can't build your portfolio solely with high-risk assets.",
    "Four Wealth-Building Lessons",
    "To truly build long-lasting wealth, you need to generate  multiple, reliable streams of income  - in addition to your riskier strategies.",
    "Please reread that sentence. Don't dismiss it as unimportant. My whole life changed when I embraced this investing philosophy.",
    "And you can open up the same road to wealth I did by doing the following:",
    "While all these steps are important, the last one will build the foundation for your future wealth.",
    "More Income = More Choices",
    "It may seem paradoxical. But the more \"safe\" income you build, the more \"free\" income you'll have to speculate on high-risk, high-reward plays.",
    "You can use that extra money to make more life-changing, asymmetric, \"crypto-type\" plays - like bets on small cannabis stocks - without risking your current lifestyle.",
    "With extra income, you can spend money on your hobbies without guilt… go on a dream vacation… buy a second home… or pad your retirement nest egg.",
    "The point is, when you have a steady income source (separate from your employment or main source), you'll have so many more options in your life.",
    "Look, it's never too early or too late to begin building your wealth. The sands of time will continue to slip away, regardless of your actions.",
    "So why not make the choice today to do something different… Put yourself on the road to the happiness, security, and independence that comes from creating financial security for yourself and your family.",
    "Let the Game Come to You!",
    "Regards,",
    "Teeka Tiwari",
    "Editor, Palm Beach Confidential",
    "The post Multiple Income Streams Are Key to Building Long-Lasting Wealth appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:11:53"
}