{
  "url": "https://www.nasdaq.com/article/national-health-investors-nhi-passes-through-5-yield-mark-cm1207529",
  "title": "National Health Investors (NHI) Passes Through 5% Yield Mark - Nasdaq.com",
  "text": [
    "Looking at the universe of stocks we cover at Dividend Channel  , in trading on Wednesday, shares of National Health Investors, Inc. (Symbol: NHI) were yielding above the 5% mark based on its quarterly dividend (annualized to $4.2), with the stock changing hands as low as $83.54 on the day. Dividends are particularly important for investors to consider, because historically speaking dividends have provided a considerable share of the stock market's total return. To illustrate, suppose for example you purchased shares of the iShares Russell 3000 ETF ( IWV  ) back on 5/31/2000 - you would have paid $78.27 per share. Fast forward to 5/31/2012 and each share was worth $77.79 on that date, a loss of $0.48 or 0.6% decrease over twelve years. But now consider that you collected a whopping $10.77 per share in dividends over the same period, increasing your return to 13.15%. Even with dividends reinvested, that only amounts to an average annual total return of about 1.0%; so by comparison collecting a yield above 5% would appear considerably attractive if that yield is sustainable. National Health Investors, Inc. (Symbol: NHI) is a member of the Russell 3000, giving it special status as one of the largest 3000 companies on the U.S. stock markets.      In general, dividend amounts are not always predictable and tend to follow the ups and downs of profitability at each company. In the case of National Health Investors, Inc., looking at the history chart for NHI below can help in judging whether the most recent dividend is likely to continue, and in turn whether it is a reasonable expectation to expect a 5% annual yield.   makeArticleAd();   Click here to find out which 9 other dividend   stocks just recently went on sale »  ",
    "  Click here to find out which 9 other dividend   stocks just recently went on sale » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 03:11:35"
}