{
  "url": "https://www.nasdaq.com/article/ericsson-eric-outpaces-stock-market-gains-what-you-should-know-cm1207627",
  "title": "Ericsson (ERIC) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Ericsson (ERIC) closed the most recent trading day at $7.79, moving +1.17% from the previous trading session. This move outpaced the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%. Coming into today, shares of the telecommunications equipment provider had lost 9.09% in the past month. In that same time, the Computer and Technology sector lost 1.68%, while the S&P 500 lost 0.68%. Investors will be hoping for strength from ERIC as it approaches its nex t earnings  release. In tha t report  , analysts expect ERIC to post earnings of $0.08 per share. This would mark a year-over-year decline of 33.33%. Our most recent consensus estimate is calling for quarterly revenue of $6.12 billion, down 4.61% from the year-ago period. Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $0.36 per share and revenue of $23.95 billion. These totals would mark changes of +1100% and -2.55%, respectively, from last year. Investors might also notice recent changes to analyst estimates for ERIC. Recent revisions tend to reflect the latest near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. ERIC is currently a Zacks Rank #3 (Hold). Investors should also note ERIC's current valuation metrics, including its Forward P/E ratio of 21.54. Its industry sports an average Forward P/E of 21.54, so we one might conclude that ERIC is trading at a no noticeable deviation comparatively. The Wireless Equipment industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 98, which puts it in the top 39% of all 250+ industries. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Ericsson (ERIC): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Ericsson (ERIC) closed the most recent trading day at $7.79, moving +1.17% from the previous trading session. This move outpaced the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%.",
    "Coming into today, shares of the telecommunications equipment provider had lost 9.09% in the past month. In that same time, the Computer and Technology sector lost 1.68%, while the S&P 500 lost 0.68%.",
    "Investors will be hoping for strength from ERIC as it approaches its nex t earnings  release. In tha t report  , analysts expect ERIC to post earnings of $0.08 per share. This would mark a year-over-year decline of 33.33%. Our most recent consensus estimate is calling for quarterly revenue of $6.12 billion, down 4.61% from the year-ago period.",
    "Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $0.36 per share and revenue of $23.95 billion. These totals would mark changes of +1100% and -2.55%, respectively, from last year.",
    "Investors might also notice recent changes to analyst estimates for ERIC. Recent revisions tend to reflect the latest near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. ERIC is currently a Zacks Rank #3 (Hold).",
    "Investors should also note ERIC's current valuation metrics, including its Forward P/E ratio of 21.54. Its industry sports an average Forward P/E of 21.54, so we one might conclude that ERIC is trading at a no noticeable deviation comparatively.",
    "The Wireless Equipment industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 98, which puts it in the top 39% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:45:23"
}