{
  "url": "https://www.nasdaq.com/article/asian-shares-higher-led-by-4-surge-in-hong-kongs-hang-seng-index-cm1207176",
  "title": "Asian Shares Higher, Led by 4% Surge in Hong Kong’s Hang Seng Index - Nasdaq.com",
  "text": [
    "The major Asia Pacific stock indexes are trading higher on Wednesday helped by a softening tone by the Hong Kong government and stronger-than-expected economic data from China. Australian economic data was steady. Despite the early strength in Asia that has spread to Europe and Asia, gains continue to be capped by worries over Brexit, concerns over a weakening U.S. economy and uncertainty over U.S.-China trade relations.",
    "At 08:04 GMT, Japan's Nikkei 225 Index is trading 20649.14, up 23.98 or +0.12%. Hong Kong's Hang Seng Index is at 26606.24, up 1078.39 or +4.22% and South Korea's KOSPI is at 1988.53, up 22.84 or 1.16%.",
    "In China, the Shanghai Index settled at 2957.41, up 27.26 or +0.93% and Australia's S&P/ASX 200 Index closed at 6553.00, down 20.40 or -0.31%.",
    "Stocks in Hong Kong soared over 4.0% during the Wednesday afternoon session following reports that a controversial extradition bill is set to be withdrawn.",
    "According to the South China Morning Post and other local media reports, Hong Kong leader Carrie Lam will reportedly announce the withdrawal of a contentious extradition bill that has sparked months of mass protests and dampened investor sentiment. Lam is due to make the announcement on Wednesday. CNBC sources confirmed that Lam will be calling for an urgent meeting with pro-Beijing supporters on Wednesday, but the agenda has not been confirmed.",
    "Shares of companies that have been pressured lately due to the turmoil in Hong Kong skyrocketed after the announcement. These included railway operator MTR and airliner Cathay Pacific. Shares of both companies surged 6.74% and 7.82% respectively. The good news also helped boost shares in China.",
    "According to Reuters, activity in China's services sector expanded at the fastest pace in three months in August as new orders rose, prompting the biggest increase in hiring in over a year, a private survey showed on Wednesday.",
    "The Caixin/Markit services purchasing managers' index (PMI) picked up to 52.1 last month, the highest since May, compared with July's 51.6.",
    "Shares in Australia weakened following the release of the country's latest Gross Domestic Product ( GDP ) report. Data releases early Wednesday showed Australia's economy rising as expected during the second quarter. GDP rose 0.5% quarter-on-quarter on a seasonally adjusted basis, and grew 1.4% year-on-year.  Both figures met expectations.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 04:37:14"
}