{
  "url": "https://www.nasdaq.com/article/skywests-skyw-august-block-hours-load-factor-increase-cm1210600",
  "title": "SkyWest's (SKYW) August Block Hours & Load Factor Increase - Nasdaq.com",
  "text": [
    "  SkyWest, Inc  . SKYW  reported a 5.3% year-over-year increase in block hours (a measure of aircraft utilization) to 130,381 for August 2019. The carrier stated that the rise in block hours resulted from the addition of E175, CRJ900 and CRJ700 aircraft to its fleet since last August.  makeArticleAd();  This regional airline is focused on streamlining its operations. It aims to reduce the 50-seat jets from its fleet and add E175 aircraft.    The company's dual class aircraft (E175, CRJ900 and CRJ700) accounted for approximately 64.5% of the carrier's total block-hour production for the month compared with approximately 61.1% a year ago.   SkyWest, Inc. Price        SkyWest, Inc. price    |   SkyWest, Inc. Quote   Additionally, this St. George, UT-based company reported 6.6% ascent in block hours for the first eight months of 2019. Load factor (percentage of seats filled with passengers) improved 80 basis points (bps) to 84% in August. Also, the number of departures and passenger count climbed 6.1% and 7.1% each in the month.    Notably, SkyWest completed the sale of ExpressJet Airlines to a third party on Jan 22 this year. Hence, the traffic report did not include ExpressJet for the year-ago period as well.   Zacks Rank & Other Key Picks    SkyWest carries a Zacks Rank #2 (Buy). Some other top-ranked stocks in the same space are Controladora Vuela Compania de Aviacion, S.A.B. de C.V. VLRS  , Copa Holdings, S.A. CPA  and Allegiant Travel Company ALGT  . While Controladora Vuela and Copa sport a Zacks Rank #1 (Strong Buy), Allegiant carries the same Zacks Rank as SkyWest. You can see  the complete list of today's Zacks #1 Rank stocks   here   .    Shares of Controladora Vuela, Copa and Allegiant have rallied more than 93%, 26% and 46% so far this year, respectively.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Copa Holdings, S.A. (CPA): Free Stock Analysis Report   Allegiant Travel Company (ALGT): Free Stock Analysis Report   Controladora Vuela Compania de Aviacion, S.A.B. de C.V. (VLRS): Free Stock Analysis Report   SkyWest, Inc. (SKYW): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " SkyWest, Inc  . SKYW  reported a 5.3% year-over-year increase in block hours (a measure of aircraft utilization) to 130,381 for August 2019. The carrier stated that the rise in block hours resulted from the addition of E175, CRJ900 and CRJ700 aircraft to its fleet since last August.  makeArticleAd();  This regional airline is focused on streamlining its operations. It aims to reduce the 50-seat jets from its fleet and add E175 aircraft.    The company's dual class aircraft (E175, CRJ900 and CRJ700) accounted for approximately 64.5% of the carrier's total block-hour production for the month compared with approximately 61.1% a year ago.",
    "  SkyWest, Inc. Price        SkyWest, Inc. price    |   SkyWest, Inc. Quote  ",
    " SkyWest, Inc. Price ",
    " SkyWest, Inc. price    |   SkyWest, Inc. Quote ",
    "Additionally, this St. George, UT-based company reported 6.6% ascent in block hours for the first eight months of 2019. Load factor (percentage of seats filled with passengers) improved 80 basis points (bps) to 84% in August. Also, the number of departures and passenger count climbed 6.1% and 7.1% each in the month.    Notably, SkyWest completed the sale of ExpressJet Airlines to a third party on Jan 22 this year. Hence, the traffic report did not include ExpressJet for the year-ago period as well.   Zacks Rank & Other Key Picks    SkyWest carries a Zacks Rank #2 (Buy). Some other top-ranked stocks in the same space are Controladora Vuela Compania de Aviacion, S.A.B. de C.V. VLRS  , Copa Holdings, S.A. CPA  and Allegiant Travel Company ALGT  . While Controladora Vuela and Copa sport a Zacks Rank #1 (Strong Buy), Allegiant carries the same Zacks Rank as SkyWest. You can see  the complete list of today's Zacks #1 Rank stocks   here   .    Shares of Controladora Vuela, Copa and Allegiant have rallied more than 93%, 26% and 46% so far this year, respectively.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:34:00"
}