{
  "url": "https://www.nasdaq.com/article/beijing-set-to-exit-list-of-worlds-top-200-mostpolluted-cities--data-20190911-00945",
  "title": "Beijing set to exit list of world's top 200 most-polluted cities - data - Nasdaq.com",
  "text": [
    "BEIJING, Sept 12 (Reuters) - China's capital of Beijing is on track to drop out from the list of the world's top 200 most-polluted cities this year, with hazardous smog concentrations falling to their lowest on record in August, data compiled by IQAir AirVisual showed on Thursday.",
    "Beijing is set to reduce levels of small, lung-damaging particulate matter known as PM2.5 by almost 20% this year compared with 2018, and by almost a third from 2017, data from the Switzerland-based air quality technology company showed.",
    "The capital city has been on the frontline of a war on pollution launched in 2014 and has worked to shut down and relocate polluting industries, improve fuel and emission standards and reduce coal consumption both in the city and in surrounding regions. ",
    "In the first eight months of this year, Beijing had an average hourly PM2.5 concentration reading of 42.6 micrograms, 19.3% lower than last year. The figures were less than half of the average in the same period in 2009, IQAir AirVisual said in a study of data from the U.S. Embassy in Beijing as well as 34 official government monitoring stations.",
    "Beijing's average hourly PM2.5 concentration in August was 22.1 micrograms - the lowest monthly average since records began in April 2008, the data showed.",
    "China has said that it will adopt more efficient and targeted measures during its campaign against pollution in 2019, but will not relax its efforts or ease the crackdown on violators. ",
    "Beijing has already said it will restrict firework and fuel sales this month to ensure it minimises air pollution during celebrations of the 70th anniversary of the founding of the People's Republic on Oct. 1. "
  ],
  "published_datetime": "2019-09-11 10:09:00"
}