{
  "url": "https://www.nasdaq.com/article/dorians-toll-bahamas-officials-say-2500-missing-in-storms-wake-20190911-00805",
  "title": "Dorian's toll: Bahamas officials say 2,500 missing in storm's wake - Nasdaq.com",
  "text": [
    "By Zachary Fagenson",
    "NASSAU, Bahamas, Sept 11 (Reuters) - Around 2,500 people are feared missing in the Bahamas in the wake of devastating Hurricane Dorian, a number that may include people who fled to shelters around the Caribbean island chain, authorities said on Wednesday.",
    "More than a week after the top-of-scale Category 5 hurricane ravaged Great Abaco Island, Freeport and other parts of the tourism-dependent country, the number of those officially registered as missing was another sign the storm's death toll may rise significantly over the 50 reported so far.",
    "Thousands of people are in shelters on the islands and officials have warned the number of dead is likely to rise substantially.",
    "People all over Nassau are still searching for friends and family they have not seen since the storm.",
    "\"My friends are missing, a few of my cousins are missing over there, five in total, they lived in Marsh Harbour,\" said Clara Bain, a 38-year-old tour guide, referring to the Abaco town where officials estimate that 90% of homes and buildings were damaged or destroyed by the storm.",
    "\"Everyone on the islands are missing someone, it's really devastating,\" Bain said.",
    "Dorian slammed into the Bahamas over a week ago as one of the strongest Atlantic hurricanes on record, packing top sustained winds of 185 miles (298 km) per hour.",
    "Smith said more than 5,000 people had evacuated to New Providence, the island where the capital Nassau is located, but that there had been a \"significant reduction\" in the number of people now asking to be relocated.",
    "Commercial flights to Abaco, one of the hardest-hit areas, were due to resume on Wednesday on a limited basis, officials said.",
    "Some 15,000 people are still in need of shelter or food, according to the Caribbean Disaster Emergency Management Agency.",
    "Officials have already put up large tents in Nassau to house people made homeless by the storm and plan to put up tent cities on Abaco capable of sheltering up to 4,000 people. ",
    "Private forecasters estimated that Dorian destroyed or damaged some $3 billion in insured property in the Caribbean."
  ],
  "published_datetime": "2019-09-11 03:58:00"
}