{
  "url": "https://www.nasdaq.com/article/qutoutiao-inc-qtt-q2-2019-earnings-call-transcript-cm1208162",
  "title": "Qutoutiao Inc. (QTT) Q2 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   Qutoutiao Inc.    (NASDAQ: QTT)        Q2 2019 Earnings Call       Sept. 4, 2019,   9:00 p.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Hello, ladies and gentlemen. Thank you for standing by for the   Second Quarter 2019 Earnings Conference Call for Qutoutiao Inc.   At this time, all participants are in a listen-only mode. After   management's remarks, there will be a question-and-answer   session. Today's conference call is being recorded and I will now   turn the call over to your host, Sai Chi [ph]. Please go ahead,   Sai Chi.  Sai Chi    --   Qutoutiao Inc.  Thank you very much. Welcome, everyone, to the second quarter   of 2019       earnings conference call    of Qutoutiao Inc. The company's financial and operational results   were released via newswire services earlier today and have been   made available online. You can also view the earnings press   release by visiting the IR section of our website at   ir.qutoutiao.net. Participants on today's call will include our   Co-Founder and CEO, Mr. Eric Tan, and our Co-CFOs, Mr. Jingbo   Wang and Mr. Xiaolu Zhu. Before we continue, please note that today's discussion will   contain forward-looking statements made under the safe harbor   provisions of the U.S. Private Securities Litigation and Reform   Act of 1995. Forward-looking statements involve inherent risks   and uncertainties. As such, the company's results may be   materially different from the views expressed today. Further   information regarding these and other risks and uncertainties is   included in the company's prospectus and other public filings, as   filed with the U.S. Securities and Exchange Commission. The   company does not assume any obligation to update any   forward-looking statements except as required under applicable   law.   10 stocks we like better than QUTOUTIAO INC       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and QUTOUTIAO INC wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019      Please note that Qutoutiao's earnings press release and this   conference call include discussions of unaudited GAAP financial   measures as well as unaudited non-GAAP financial measures.   Qutoutiao's press release contains a reconciliation of the   unaudited non-GAAP measures to the unaudited GAAP measures. Now, let me start by reading out Eric's commentary on the   business first.  Eric Tan    --   Chairman and Chief Executive Officer  [Through translator] I would like to review the business and   our strategy with you first and then provide some outlook for the   rest of the year. In the second quarter, we have focused on three   things. The first is growth. The overall business continues to   enjoy strong momentum, with quarterly average combined DAU   reaching 38.7 million and combined MAU reaching 119.3 million,   both more than tripled from a year ago. In addition to scaling up existing apps, we have leveraged our   platform capabilities to develop new products. In May, we started   Midu Light, which is a mobile application that allows users to   read online literature for free while earning loyalty points. The   valuation and design helps us to attract a user base that is   different from that of the Midu app and is, therefore, a valuable   addition to our family of apps. The second is compliance. As we all know, compliance   requirements for internet content have tightened up considerably   this year. We have one of the best track records in compliance   among all the sizable newsfeed players in the space, as we have   put in significant efforts from the very beginning in building   our content compliance teams and capabilities. Last month, we   expanded our compliance personnel by adding a team based in   Xinjiang, which will strengthen our content review and   monitoring. We have recently been granted an internet news   license, which is the first for a non-state-owned company since   2017 and the first and only one in Shanghai, representing an   official recognition of our effort in content quality and   compliance as well as our leading market position. The third is the optimization of internal teams to support   future growth. Our shift to build a service-oriented architecture   by modularizing common functionalities and building full-function   teams is progressing well. It's a significant step toward our   long-term positioning as a multi-product platform. In this   quarter, we started a rotational program for our team leaders,   which offered them opportunities to be fully involved   operationally in various parts of the business. This gives our   key management staff a more comprehensive operational experience   with the business, which will enhance efficiency and internal   collaboration. We believe such organizational changes will pay   off over time and strengthen our long-term competitive advantage,   especially as our business continues to scale up. Let me also talk about our competition in the market. With the   Qutoutiao app, by focusing on regions outside of Tier 1 and Tier   2 cities in China and pioneering the loyalty program, it has   differentiated itself from competitors and captured a large   underserved market. The relative lack of technology   infrastructure and services have caused low-tier cities to   digitally fall behind the Tier 1 and Tier 2 cities. By   contributing to the narrowing of this digital gap, Qutoutiao is   playing a positive role in social development, which we believe   is both a great cause in itself and a great structural theme to   play into. We have built a deep understanding of the people we   serve, which has underpinned our leadership position in the   market. Midu started in a competitive online literature market where   strong and dominant players already existed. Pioneering the   free-to-read model, Midu expanded the addressable market by   offering a solution to hundreds of millions of online literature   lovers who had been previously excluded by the traditional   paid-only business models. Midu has maintained a leading position   in the free-to-read market since inception and already has the   rigid content ecosystem by a clear margin in comparison to direct   peers. We have also built an internal editor team to work with   writers directly to introduce original and differentiated   content, which has grown exponentially in page view share, albeit   from a very low base. The value of our efforts in enhancing   content offerings will not be visible in the immediate quarter or   quarters but will, over time, lead to better user retention and   engagement, which is key to our user base expansion. For mid-July, we have temporarily suspended content updates   and commercial activities on Midu as we sort through our existing   library to adjust to the regulators' compliance requirements.   This also puts a temporary break on our DAU as we are not able to   acquire any new users through regular channels during the period.   We expect this phase to pass by early Q4, by which time growth   will resume. Our objective of reaching 10 million-plus DAU with Midu and   Midu Light combined by year end and of becoming the biggest   online literature platform and home market in 2020 remains   unchanged. We remain confident about achieving the objective and   given the better than expected start of Midu Light, the strong   growth momentum of Midu we enjoyed in Q2, and the tremendous   market opportunities lying ahead. Turning to the second half of 2019 outlook, we will continue   to grow our user base for Qutoutiao and to further strengthen   Midu's leading position once normal operations resume by   mid-October. Our year-end DAU target remains unchanged at 50   million to 60 million DAU for the group, which is about double   the level at the end of last year. The overall digital   advertising market is experiencing weakness this year due to the   supply/demand imbalance and weak national conditions. Despite a   much tougher operational environment, we are delivering one of   the fastest growth rates in the industry. We continue to diversify our monetization avenues, focusing on   casual games and live streaming, which have been increasing their   share of group revenues. Looking longer term, as we are far from   realizing our monetization potential, our focus undoubtedly   continues to be optimizing the efficiency of our app platform,   which will drive structurally higher ARPU. This concludes Eric's remarks. I will now read the prepared   remarks of Jingbo.  Jingbo Wang    --   Co-Chief Financial Officer  [Through translator] Despite the weakness in the ad market,   which directly impacts us through pricing, our unit economics   remain healthy. Our average user acquisition cost was RMB6.93.   Our user engagement expenses for the whole group was RMB0.13 per   DAU per day, while our ARPU was RMB0.39. We continue to invest across the different products based on   what we think makes strategic sense. We have invested heavily in   Midu on the content front just before the suspension. As a   result, it has a far better coverage of the high-quality books   available in the market than any free-reading peer does. We have   also built a very capable in-house editor team, which works with   writers directly to generate original and differentiated content.   We have seen pleasing performance data, which clearly showed that   these original books have been well-received by the readers. We have significant potential to further drive our   monetization by improving the efficiency of our proprietary   advertising platform, which we built last year, as the business   grows, which diversifies our advertising inventories. Through the   investment in technology and accumulation of data, we will be   able to enhance the billing system and algorithms to close the   gap between us and the established payers. In the meantime, we are deepening our existing customer   relationships as we build better understanding of our customers   and deliver better results, as well as expanding into more   advertiser industries to better match the ever diversifying ad   inventories that are being added on to our platform. We are also   making good progress on growing revenues from casual games and   livestreaming. This concludes Jingbo's remarks. Now, I will move on to   Xiaolu's comments.  Xiaolu Zhu    --   Co-Chief Financial Officer  [Through translator] Our revenue has recovered from a seasonal   low of Q1 to reach RMB1.4 billion in Q2, which is close to three   times higher versus the same period last year. This rapid growth   is being driven predominantly by DAU growth and has been achieved   against a backdrop of the weak overall advertising market,   especially from a pricing perspective. The recovery since Q2 has   progressed more slowly than what one would expect under normal   market conditions, but we're not seeing any worsening trends. ARPU, which we define as net revenues per DAU per day, was   RMB0.39 in Q2 2019 compared to RMB0.33 in Q1 2019 and RMB0.42 in   Q2 2018. The year-on-year decline has been driven by the faster   growth of new products, such as Midu, which have lower ARPUs in   comparison to Qutoutiao, and also the general weakness of the   advertising market in China. Sequentially, we see meaningful ARPU   growth across all products, which is a combination of favorable   seasonality impact and structural improvement, as monetization of   products grows. Turning to costs and expenses, I will focus on non-GAAP   measures, which exclude stock-based compensation. For Q2 2019,   our gross margin was 74%, which declined 1.2% quarter-on-quarter,   or 9.1% year-on-year, mostly due to our investment in IT   infrastructure to better accommodate more bandwidth   data-intensive content such as videos, livestreaming, and games.   However, sequentially, our operating margin has improved by   18.7%, as we have kept our expenses under control while   monetization improved. Our user engagement expenses as a percentage of revenue have   improved both sequentially and year-on-year as we have continued   to bring down the absolute amount we pay to each active user   every day, which will be stable and within the range of RMB0.15   to RMB0.20 for the Qutoutiao app. Our ad load is at a healthy level, and given the potential for   ad inventory to increase coming from our products scaling up,   such as Midu, and subsequently the higher efficiency of our   central ad platform manifested through higher click-through rates   and cost per click, we're confident about the growth   opportunities lying ahead. R&D expenses were 13.3% of revenue compared to 12.4% in Q1   2019 and 7.9% in Q2 2018, as we continue to invest in talent and   our core technological capabilities, which underpin our long-term   competitiveness. Other sales and marketing expenses amounted to 5.2% of revenue   compared to 3% of revenue last quarter and 4.4% of revenue in Q2   2018. The increase was driven by our increased spending on brand   advertising, which we believe will be more value-creating from   her onwards given that we have reached a meaningful scale.   G&A expenses were stable at 3.6% of revenue, in line with   history. Overall, our non-GAAP net loss was RMB496 million,   representing a loss ratio of 35.8%, which has increased from a   year ago, largely due to our increased investment in our IT   infrastructure and higher user acquisition costs on a per new   installation basis. Looking ahead, in terms of guidance, and given that Midu has   been suspended for new content updates and commercial activities   since July 15th and will remain suspended for the rest of Q3, we   will have very little revenue contribution from Midu this   quarter. We do expect the business to resume regular operation by   October 15th so the impact on Q4 should be small. And as   discussed earlier during the call, our year-end traffic as well   as revenue run rate targets for Midu remain unchanged given the   strong growth momentum for Midu we have witnessed in Q2 and the   better than expected start of Midu Light so far. For Q3, based on our view of the market and the operating   conditions, which are subject to change, we expect net revenues   to be at a similar level as we have achieved in the second   quarter. This has taken into account the short-term impact of   lost revenues from Midu. Finally, in terms of balance sheet, we are in a strong   position, with RMB2.3 billion in cash, and we are confident this   will support us as we take the business to the next level. This concludes all our prepared remarks today. Now we are open   for questions. Operator, please proceed. Questions and Answers:  Operator  Thank you. Ladies and gentlemen, we'll now begin the   question-and-answer session. If you wish to ask a question,   please press \"*1\" on your telephone keypad and wait for your name   to be announced. If you wish to cancel your request, please press   \"#\". Ladies and gentlemen, once again, it's \"*1\" if you wish to   ask a question. The first question we have is from the line of Zhijing Liu   from UBS. You may now ask your question.  Zhijing Liu    --   UBS -- Analyst  Thank you, management, for taking my questions. We noticed   that DAU was stagnant in Q2. Can you elaborate more on your user   acquisition strategy on both Qutoutiao and Midu and their DAU   change? Due to advertising and accounting upgrade suspension,   Midu DAU and monetization will be under pressure in 3Q. I   understand that you already launched a light version to offset   some pressures. Can you elaborate more on current progress on how   you deal with the Midu app issue? I'll stop here. Thank you.  Xiaolu Zhu    --   Co-Chief Financial Officer  Thank you, Zhijing. This is Xiaolu. So, regarding your first   question on DAU growth trends, I think we did discuss this a   little bit in our last       earnings call    . We had some pressure in late Q1/early Q2 in terms of user   growth due to irrational competitions in the market and also the   overall weakness in ad markets. But we have since seen some   recovery in terms of user growth starting from the second half of   the second quarter, especially in June, and I would say that our   user growth has since reactivated and that trend has been carried   over to Q3. In terms of Qutoutiao and Midu on a stand-alone basis, for   Qutoutiao, I think we have seen some very healthy trends so far   this quarter. DAU on a stand-alone basis increased, on average,   about 10-15 cents compared to Q2 on a quarter-to-quarter basis.   On the Midu side, I think, as we said in our prepared remarks, we   had a very strong second quarter and the early results in the   beginning of Q3 is also very good. The PPAU for Midu has reached   over 8 million as of the beginning of Q3. However, we did have   this suspension for Midu starting from July 15th. So, this will   be trending for us in Q3. The suspension will last from July 15th   until October 15th. So, the impact mainly was in Q3. So, to your second question, regarding the Midu situation, we   do have some additional efforts. First of all, we continue to   expand our content library. We continue to be the No. 1 player in   the free online literature market and we have a comfortable   margin based on our third-party data. And also with the launch of   Midu Light, we were able to keep our combined user traffic stable   for Q3 compared to Q2, although the monetization has been stopped   so the impact on the revenue side will be much bigger. Assuming   that we have no growth from Midu in Q3, it still has, I believe,   8 million DAU. And assuming 30-35 cents income from ARPU, that   means we are losing RMB2.2 million income from revenue per day   for the entirety of Q3. However, we do have better than expected start of Midu Light.   So far, the traffic growth has been very strong. So, we were able   to keep the combined user traffic of Midu and Midu Light at a   stable level compared to Q2. And also with the additional loyalty   program on Midu Light, the new app attracts a somewhat different   user base compared to the original Midu app. And with that, we   are able to increase ARPUs, as early results have showed. So, we   are confident that both apps will do well once we do resume some   operation and our year-end target of combined DAU of 10-15   million for Midu has not changed. On the monetization side, I think Midu's potential has yet to   be fully realized given the low ad load in the first half of this   year and also the new opportunities from Midu Light. So, we   believe, combined, the two apps will contribute potentially RMB2   million to RMB3 million per day in terms of revenue in Q4. Thank   you.  Zhijing Liu    --   UBS -- Analyst  Thank you.  Operator  Thank you. The next question we have is from the line of   Alicia Yap from Citigroup. You may now ask your question.  Alicia Yap    --   Citigroup -- Analyst  Hi. Good evening. Good morning, management. Thanks for taking   my questions. I have a couple of questions. No. 1 is just to   follow up on the Midu question. I wanted to understand how sure   are you regarding the regulatory headwind that we are seeing   could really relax and resume by mid-October. And then if we look forward, in terms of when we can resume   the monetization, how big do you think the Midu app revenue could   grow into, in terms of percentage of total revenue contribution   for Midu that you believe that could reach? And then the same question just regarding the costs and   expenses. So, we did see some cost control benefit. Right? User   engagement coming down but user acquisition and content   procurement costs seem to be going up a little bit. So, can you   help us understand what will be the expense trend for the second   half, in terms of the content and user acquisition and user   engagement? So, any color on the direction, that would be   helpful. Thank you.  Xiaolu Zhu    --   Co-Chief Financial Officer  Thank you, Alicia. I think, regarding your first question, we   are quite confident that Midu will resume normal operations by   October 15th. We also received an internet news license recently.   So, this is the first license issued since early 2017 and the   first and only issued in Shanghai, which means that our efforts   from the very beginning through our content compliance teams and   capabilities has been well-recognized by the regulators. And I   think based on our understanding of our communications with the   regulators, we are quite confident that the impact on Midu in Q4   will be limited. Regarding your second question, in terms of revenue   contribution, as I said previously, we do see a very healthy   traffic growth of Midu in Q2 and early Q3, and also we had a very   strong start of Midu Light so far this quarter. So, I think in   Q4, we do have very high expectations for Midu. And with the   current trends, we see that Midu can contribute up to 20% of our   total revenue in Q4. In terms of your third question, regarding costs and expenses,   I think several things. First, for content costs, given the   nature of our business, we believe we will be able to control the   content costs at a 6% to 7% level, as a percentage of revenue, on   the Qutoutiao side, and around 20% on the Midu side,   respectively. As the head contributors come from a large share of   users compared to other content formats, while the tail is low   and fat for both newsfeed and online literature. We are confident   to keep our content costs at the current level in the near   future. For user acquisitions, it has stayed at RMB6 to RMB7 per   installation level for several quarters and we don't see any big   changes for the rest of the year. In terms of engagement costs, I   think this quarter we were able to further reduce our average   user engagement costs to RMB13 cents per DAU on a blended basis,   compared to 17 cents in Q1 and over 20 cents in the second half   last year. The reduction is a result of our improved algorithms,   through which we can focus our engagement budget on users that   are most susceptible to catch stimulation and also an effect that   we intentionally cut back some of the costs during low season and   in the phase of irrational competition in Q1 and Q2. For Q3 and Q4, we expect our average engagement cost per DAU   to increase a little bit due to seasonality and better   monetization on the ARPU side, but still below compared to the   same period last year and to be around 15 cents per DAU on a   blended basis. Thank you.  Alicia Yap    --   Citigroup -- Analyst  Okay. Thank you.  Operator  Thank you. The next question we have is from the line of Hans   Chung from KeyBanc Capital Markets. Your line is now open.  Hans Chung    --   KeyBanc Capital Markets -- Analyst  Thanks for taking my question. So, I have a couple of   questions. First, can you give us some color around your view on   the 4Q revenue outlook? And then I remember last quarter, we had   annual guidance for 6 to 7 and I just wonder if that guidance   still maintains. And then, secondly, it seems like the engagement   ratio, which is DAU to MAU, and also the conversion from   installed user to MAU, if you look at the two metrics, they both   came down quite a bit in the second quarter. So, I just wonder   what drove the trend and how should we think about the trend to   get us stabilized going forward? Thank you.  Xiaolu Zhu    --   Co-Chief Financial Officer  Thanks, Hans. So, regarding the revenue outlook and guidance,   I think if you look at our Q3 numbers, as we explained that we   have almost little to zero revenue contribution from Midu this   quarter. So, our guidance for this quarter is that we are   expecting Q3 revenues to be on a similar level of flattish   compared to Q2 on a quarter-over-quarter basis. That means   Qutoutiao app alone will contribute revenues on a similar level   as Qutoutiao and Midu combined in Q2. So, for Q4, I think once Midu resumes normal operations, and   also as I explained in the previous question, we believe Midu can   contribute as much as 20% of our total revenue. We do think that   Q4 will be a strong quarter for us in terms of revenue   growth. And regarding the overall annual guidance, I think so far   every trend is growing as we expected and as we have discussed   with the market before. But there is a loss of revenue in Q3 from   Midu so I think the main difference will be that part. Otherwise,   we think we have strong confidence in achieving our other annual   goals. Especially on the traffic side, we are still very   confident that we can achieve our goal of year-end DAU of 50   million to 60 million. In terms of your third question regarding engagement ratio, I   think we have touched upon that a little bit previously as well.   We had some pressures in the first quarter and the first half of   the second quarter due to irrational competition and the overall   weakness of the ad market. However, we did make several efforts   in terms of optimizing our user engagement costs and also   increasing the quality of our content. And we have seen some very   promising early results starting from the second half of Q2,   especially starting from June. And as I explained, we have seen a 10% to 15% user traffic   growth in Q3 so far compared to Q2 and we believe the trend will   continue. And also in terms of Midu, despite the suspension, we   have a very strong start of Midu Light, so combined traffic of   Midu and Midu Light stays flattish compared to Midu in Q2. And I   think we can restart the growth of Midu once the normal   operations resume. So, overall, I think we are still very   confident in terms of achieving our year-end goal of 50 million   to 60 million DAUs and the pressure we had earlier this year, we   don't think it's a long-term thing. Thank you.  Operator  Thank you. The next question is coming from the line of Tian   Hou from T.H. Capital. Your line is now open.  Tian Hou    --   T.H. Capital -- Analyst  Yes. So, two questions. One is regarding the retention rate.   So, what is the current retention rate of the two apps combined?   And also what is the target retention rate by the end of this   year since the newer app, Midu, is going to come back live? So,   that's going to be really helpful to retention. So, that's the   first question. The second question is related to advertising and advertisers.   So, in Q3, what are the newer or growing sectors of advertisers?   What are the decreasing sectors of advertisers? So, what trends   do you see in the advertising sector front? That's two questions.   Thank you.  Xiaolu Zhu    --   Co-Chief Financial Officer  Thank you, Tian. Regarding user retention, as I said earlier,   we did see some pressure in the first half of this year as we   continued to optimize our user engagement profile while facing   irrational competition in the market at the same time. And March   and April were the low points for us. For Q1, we saw a downward   trend but for Q2, we have ended the quarter on a higher mark.   Quarter-end DAU exceeded 40 million and the strong momentum   continued in Q3. And also as I said earlier, we see average DAU   for the two Midu apps have increased over 10% so far in Q3   compared to the second quarter. Regarding the user acquisition costs, as I explained earlier,   we are trying to keep that cost down to the 6 to 7 RMB range and   we don't have any plans to increase that budget on a large scale.   So, overall, I think we are trying still to continue to increase   our content quality, continue to optimize our operations and to   offer more social features, video games, live streaming, and   expect to add also all kinds of new content features on the   Qutoutiao side to increase user engagement and activity. And, so   far, we have seen some very strong early results. And as I said,   our year-end target of 50 million to 60 million DAU has not been   changed. So, so far, we are quite confident in terms of user   traffic growth and user retention. In terms of your second question, regarding the advertisers,   so far this year, e-commerce has been quite strong and continues   to be the largest segment of our advertisers. Otherwise, I think   most segments are more or less the same as previous quarters. And   we think that this trend will continue for the rest of the year.   Thank you.  Tian Hou    --   T.H. Capital -- Analyst  Thank you.  Operator  Thank you. As there are no further questions, I will now like   to hand the conference back to the company for closing remarks.   Again, if there are no further questions, I'd like to turn the   call over to the company for closing remarks.  Sai Chi    --   Qutoutiao Inc.  Thank you, everyone. That concludes today's conference call.   Thank you.  Xiaolu Zhu    --   Co-Chief Financial Officer  Thank you.  Duration: 34 minutes  Call participants:  Sai Chi    --   Qutoutiao Inc.   Eric Tan    --   Chairman and Chief Executive Officer   Jingbo Wang    --   Co-Chief Financial Officer   Xiaolu Zhu    --   Co-Chief Financial Officer   Zhijing Liu    --   UBS -- Analyst   Alicia Yap    --   Citigroup -- Analyst   Hans Chung    --   KeyBanc Capital Markets -- Analyst   Tian Hou    --   T.H. Capital -- Analyst   More QTT analysis   All earnings call transcripts   This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions   for additional details, including our Obligatory     Capitalized Disclaimers of Liability.      Motley Fool Transcription      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " Qutoutiao Inc.    (NASDAQ: QTT)        Q2 2019 Earnings Call       Sept. 4, 2019,   9:00 p.m. ET ",
    " Operator ",
    "Hello, ladies and gentlemen. Thank you for standing by for the   Second Quarter 2019 Earnings Conference Call for Qutoutiao Inc.   At this time, all participants are in a listen-only mode. After   management's remarks, there will be a question-and-answer   session. Today's conference call is being recorded and I will now   turn the call over to your host, Sai Chi [ph]. Please go ahead,   Sai Chi.",
    " Sai Chi    --   Qutoutiao Inc. ",
    "Thank you very much. Welcome, everyone, to the second quarter   of 2019       earnings conference call    of Qutoutiao Inc. The company's financial and operational results   were released via newswire services earlier today and have been   made available online. You can also view the earnings press   release by visiting the IR section of our website at   ir.qutoutiao.net. Participants on today's call will include our   Co-Founder and CEO, Mr. Eric Tan, and our Co-CFOs, Mr. Jingbo   Wang and Mr. Xiaolu Zhu.",
    "Before we continue, please note that today's discussion will   contain forward-looking statements made under the safe harbor   provisions of the U.S. Private Securities Litigation and Reform   Act of 1995. Forward-looking statements involve inherent risks   and uncertainties. As such, the company's results may be   materially different from the views expressed today. Further   information regarding these and other risks and uncertainties is   included in the company's prospectus and other public filings, as   filed with the U.S. Securities and Exchange Commission. The   company does not assume any obligation to update any   forward-looking statements except as required under applicable   law.",
    "  10 stocks we like better than QUTOUTIAO INC       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and QUTOUTIAO INC wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than QUTOUTIAO INC       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and QUTOUTIAO INC wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "Please note that Qutoutiao's earnings press release and this   conference call include discussions of unaudited GAAP financial   measures as well as unaudited non-GAAP financial measures.   Qutoutiao's press release contains a reconciliation of the   unaudited non-GAAP measures to the unaudited GAAP measures.",
    "Now, let me start by reading out Eric's commentary on the   business first.",
    " Eric Tan    --   Chairman and Chief Executive Officer ",
    "[Through translator] I would like to review the business and   our strategy with you first and then provide some outlook for the   rest of the year. In the second quarter, we have focused on three   things. The first is growth. The overall business continues to   enjoy strong momentum, with quarterly average combined DAU   reaching 38.7 million and combined MAU reaching 119.3 million,   both more than tripled from a year ago.",
    "In addition to scaling up existing apps, we have leveraged our   platform capabilities to develop new products. In May, we started   Midu Light, which is a mobile application that allows users to   read online literature for free while earning loyalty points. The   valuation and design helps us to attract a user base that is   different from that of the Midu app and is, therefore, a valuable   addition to our family of apps.",
    "The second is compliance. As we all know, compliance   requirements for internet content have tightened up considerably   this year. We have one of the best track records in compliance   among all the sizable newsfeed players in the space, as we have   put in significant efforts from the very beginning in building   our content compliance teams and capabilities. Last month, we   expanded our compliance personnel by adding a team based in   Xinjiang, which will strengthen our content review and   monitoring. We have recently been granted an internet news   license, which is the first for a non-state-owned company since   2017 and the first and only one in Shanghai, representing an   official recognition of our effort in content quality and   compliance as well as our leading market position.",
    "The third is the optimization of internal teams to support   future growth. Our shift to build a service-oriented architecture   by modularizing common functionalities and building full-function   teams is progressing well. It's a significant step toward our   long-term positioning as a multi-product platform. In this   quarter, we started a rotational program for our team leaders,   which offered them opportunities to be fully involved   operationally in various parts of the business. This gives our   key management staff a more comprehensive operational experience   with the business, which will enhance efficiency and internal   collaboration. We believe such organizational changes will pay   off over time and strengthen our long-term competitive advantage,   especially as our business continues to scale up.",
    "Let me also talk about our competition in the market. With the   Qutoutiao app, by focusing on regions outside of Tier 1 and Tier   2 cities in China and pioneering the loyalty program, it has   differentiated itself from competitors and captured a large   underserved market. The relative lack of technology   infrastructure and services have caused low-tier cities to   digitally fall behind the Tier 1 and Tier 2 cities. By   contributing to the narrowing of this digital gap, Qutoutiao is   playing a positive role in social development, which we believe   is both a great cause in itself and a great structural theme to   play into. We have built a deep understanding of the people we   serve, which has underpinned our leadership position in the   market.",
    "Midu started in a competitive online literature market where   strong and dominant players already existed. Pioneering the   free-to-read model, Midu expanded the addressable market by   offering a solution to hundreds of millions of online literature   lovers who had been previously excluded by the traditional   paid-only business models. Midu has maintained a leading position   in the free-to-read market since inception and already has the   rigid content ecosystem by a clear margin in comparison to direct   peers.",
    "We have also built an internal editor team to work with   writers directly to introduce original and differentiated   content, which has grown exponentially in page view share, albeit   from a very low base. The value of our efforts in enhancing   content offerings will not be visible in the immediate quarter or   quarters but will, over time, lead to better user retention and   engagement, which is key to our user base expansion.",
    "For mid-July, we have temporarily suspended content updates   and commercial activities on Midu as we sort through our existing   library to adjust to the regulators' compliance requirements.   This also puts a temporary break on our DAU as we are not able to   acquire any new users through regular channels during the period.   We expect this phase to pass by early Q4, by which time growth   will resume.",
    "Our objective of reaching 10 million-plus DAU with Midu and   Midu Light combined by year end and of becoming the biggest   online literature platform and home market in 2020 remains   unchanged. We remain confident about achieving the objective and   given the better than expected start of Midu Light, the strong   growth momentum of Midu we enjoyed in Q2, and the tremendous   market opportunities lying ahead.",
    "Turning to the second half of 2019 outlook, we will continue   to grow our user base for Qutoutiao and to further strengthen   Midu's leading position once normal operations resume by   mid-October. Our year-end DAU target remains unchanged at 50   million to 60 million DAU for the group, which is about double   the level at the end of last year. The overall digital   advertising market is experiencing weakness this year due to the   supply/demand imbalance and weak national conditions. Despite a   much tougher operational environment, we are delivering one of   the fastest growth rates in the industry.",
    "We continue to diversify our monetization avenues, focusing on   casual games and live streaming, which have been increasing their   share of group revenues. Looking longer term, as we are far from   realizing our monetization potential, our focus undoubtedly   continues to be optimizing the efficiency of our app platform,   which will drive structurally higher ARPU.",
    "This concludes Eric's remarks. I will now read the prepared   remarks of Jingbo.",
    " Jingbo Wang    --   Co-Chief Financial Officer ",
    "[Through translator] Despite the weakness in the ad market,   which directly impacts us through pricing, our unit economics   remain healthy. Our average user acquisition cost was RMB6.93.   Our user engagement expenses for the whole group was RMB0.13 per   DAU per day, while our ARPU was RMB0.39.",
    "We continue to invest across the different products based on   what we think makes strategic sense. We have invested heavily in   Midu on the content front just before the suspension. As a   result, it has a far better coverage of the high-quality books   available in the market than any free-reading peer does. We have   also built a very capable in-house editor team, which works with   writers directly to generate original and differentiated content.   We have seen pleasing performance data, which clearly showed that   these original books have been well-received by the readers.",
    "We have significant potential to further drive our   monetization by improving the efficiency of our proprietary   advertising platform, which we built last year, as the business   grows, which diversifies our advertising inventories. Through the   investment in technology and accumulation of data, we will be   able to enhance the billing system and algorithms to close the   gap between us and the established payers.",
    "In the meantime, we are deepening our existing customer   relationships as we build better understanding of our customers   and deliver better results, as well as expanding into more   advertiser industries to better match the ever diversifying ad   inventories that are being added on to our platform. We are also   making good progress on growing revenues from casual games and   livestreaming.",
    "This concludes Jingbo's remarks. Now, I will move on to   Xiaolu's comments.",
    " Xiaolu Zhu    --   Co-Chief Financial Officer ",
    "[Through translator] Our revenue has recovered from a seasonal   low of Q1 to reach RMB1.4 billion in Q2, which is close to three   times higher versus the same period last year. This rapid growth   is being driven predominantly by DAU growth and has been achieved   against a backdrop of the weak overall advertising market,   especially from a pricing perspective. The recovery since Q2 has   progressed more slowly than what one would expect under normal   market conditions, but we're not seeing any worsening trends.",
    "ARPU, which we define as net revenues per DAU per day, was   RMB0.39 in Q2 2019 compared to RMB0.33 in Q1 2019 and RMB0.42 in   Q2 2018. The year-on-year decline has been driven by the faster   growth of new products, such as Midu, which have lower ARPUs in   comparison to Qutoutiao, and also the general weakness of the   advertising market in China. Sequentially, we see meaningful ARPU   growth across all products, which is a combination of favorable   seasonality impact and structural improvement, as monetization of   products grows.",
    "Turning to costs and expenses, I will focus on non-GAAP   measures, which exclude stock-based compensation. For Q2 2019,   our gross margin was 74%, which declined 1.2% quarter-on-quarter,   or 9.1% year-on-year, mostly due to our investment in IT   infrastructure to better accommodate more bandwidth   data-intensive content such as videos, livestreaming, and games.   However, sequentially, our operating margin has improved by   18.7%, as we have kept our expenses under control while   monetization improved.",
    "Our user engagement expenses as a percentage of revenue have   improved both sequentially and year-on-year as we have continued   to bring down the absolute amount we pay to each active user   every day, which will be stable and within the range of RMB0.15   to RMB0.20 for the Qutoutiao app.",
    "Our ad load is at a healthy level, and given the potential for   ad inventory to increase coming from our products scaling up,   such as Midu, and subsequently the higher efficiency of our   central ad platform manifested through higher click-through rates   and cost per click, we're confident about the growth   opportunities lying ahead.",
    "R&D expenses were 13.3% of revenue compared to 12.4% in Q1   2019 and 7.9% in Q2 2018, as we continue to invest in talent and   our core technological capabilities, which underpin our long-term   competitiveness.",
    "Other sales and marketing expenses amounted to 5.2% of revenue   compared to 3% of revenue last quarter and 4.4% of revenue in Q2   2018. The increase was driven by our increased spending on brand   advertising, which we believe will be more value-creating from   her onwards given that we have reached a meaningful scale.   G&A expenses were stable at 3.6% of revenue, in line with   history.",
    "Overall, our non-GAAP net loss was RMB496 million,   representing a loss ratio of 35.8%, which has increased from a   year ago, largely due to our increased investment in our IT   infrastructure and higher user acquisition costs on a per new   installation basis.",
    "Looking ahead, in terms of guidance, and given that Midu has   been suspended for new content updates and commercial activities   since July 15th and will remain suspended for the rest of Q3, we   will have very little revenue contribution from Midu this   quarter. We do expect the business to resume regular operation by   October 15th so the impact on Q4 should be small. And as   discussed earlier during the call, our year-end traffic as well   as revenue run rate targets for Midu remain unchanged given the   strong growth momentum for Midu we have witnessed in Q2 and the   better than expected start of Midu Light so far.",
    "For Q3, based on our view of the market and the operating   conditions, which are subject to change, we expect net revenues   to be at a similar level as we have achieved in the second   quarter. This has taken into account the short-term impact of   lost revenues from Midu.",
    "Finally, in terms of balance sheet, we are in a strong   position, with RMB2.3 billion in cash, and we are confident this   will support us as we take the business to the next level.",
    "This concludes all our prepared remarks today. Now we are open   for questions. Operator, please proceed.",
    " Operator ",
    "Thank you. Ladies and gentlemen, we'll now begin the   question-and-answer session. If you wish to ask a question,   please press \"*1\" on your telephone keypad and wait for your name   to be announced. If you wish to cancel your request, please press   \"#\". Ladies and gentlemen, once again, it's \"*1\" if you wish to   ask a question.",
    "The first question we have is from the line of Zhijing Liu   from UBS. You may now ask your question.",
    " Zhijing Liu    --   UBS -- Analyst ",
    "Thank you, management, for taking my questions. We noticed   that DAU was stagnant in Q2. Can you elaborate more on your user   acquisition strategy on both Qutoutiao and Midu and their DAU   change? Due to advertising and accounting upgrade suspension,   Midu DAU and monetization will be under pressure in 3Q. I   understand that you already launched a light version to offset   some pressures. Can you elaborate more on current progress on how   you deal with the Midu app issue? I'll stop here. Thank you.",
    " Xiaolu Zhu    --   Co-Chief Financial Officer ",
    "Thank you, Zhijing. This is Xiaolu. So, regarding your first   question on DAU growth trends, I think we did discuss this a   little bit in our last       earnings call    . We had some pressure in late Q1/early Q2 in terms of user   growth due to irrational competitions in the market and also the   overall weakness in ad markets. But we have since seen some   recovery in terms of user growth starting from the second half of   the second quarter, especially in June, and I would say that our   user growth has since reactivated and that trend has been carried   over to Q3.",
    "In terms of Qutoutiao and Midu on a stand-alone basis, for   Qutoutiao, I think we have seen some very healthy trends so far   this quarter. DAU on a stand-alone basis increased, on average,   about 10-15 cents compared to Q2 on a quarter-to-quarter basis.   On the Midu side, I think, as we said in our prepared remarks, we   had a very strong second quarter and the early results in the   beginning of Q3 is also very good. The PPAU for Midu has reached   over 8 million as of the beginning of Q3. However, we did have   this suspension for Midu starting from July 15th. So, this will   be trending for us in Q3. The suspension will last from July 15th   until October 15th. So, the impact mainly was in Q3.",
    "So, to your second question, regarding the Midu situation, we   do have some additional efforts. First of all, we continue to   expand our content library. We continue to be the No. 1 player in   the free online literature market and we have a comfortable   margin based on our third-party data. And also with the launch of   Midu Light, we were able to keep our combined user traffic stable   for Q3 compared to Q2, although the monetization has been stopped   so the impact on the revenue side will be much bigger. Assuming   that we have no growth from Midu in Q3, it still has, I believe,   8 million DAU. And assuming 30-35 cents income from ARPU, that   means we are losing RMB2.2 million income from revenue per day   for the entirety of Q3.",
    "However, we do have better than expected start of Midu Light.   So far, the traffic growth has been very strong. So, we were able   to keep the combined user traffic of Midu and Midu Light at a   stable level compared to Q2. And also with the additional loyalty   program on Midu Light, the new app attracts a somewhat different   user base compared to the original Midu app. And with that, we   are able to increase ARPUs, as early results have showed. So, we   are confident that both apps will do well once we do resume some   operation and our year-end target of combined DAU of 10-15   million for Midu has not changed.",
    "On the monetization side, I think Midu's potential has yet to   be fully realized given the low ad load in the first half of this   year and also the new opportunities from Midu Light. So, we   believe, combined, the two apps will contribute potentially RMB2   million to RMB3 million per day in terms of revenue in Q4. Thank   you.",
    " Zhijing Liu    --   UBS -- Analyst ",
    "Thank you.",
    " Operator ",
    "Thank you. The next question we have is from the line of   Alicia Yap from Citigroup. You may now ask your question.",
    " Alicia Yap    --   Citigroup -- Analyst ",
    "Hi. Good evening. Good morning, management. Thanks for taking   my questions. I have a couple of questions. No. 1 is just to   follow up on the Midu question. I wanted to understand how sure   are you regarding the regulatory headwind that we are seeing   could really relax and resume by mid-October.",
    "And then if we look forward, in terms of when we can resume   the monetization, how big do you think the Midu app revenue could   grow into, in terms of percentage of total revenue contribution   for Midu that you believe that could reach?",
    "And then the same question just regarding the costs and   expenses. So, we did see some cost control benefit. Right? User   engagement coming down but user acquisition and content   procurement costs seem to be going up a little bit. So, can you   help us understand what will be the expense trend for the second   half, in terms of the content and user acquisition and user   engagement? So, any color on the direction, that would be   helpful. Thank you.",
    " Xiaolu Zhu    --   Co-Chief Financial Officer ",
    "Thank you, Alicia. I think, regarding your first question, we   are quite confident that Midu will resume normal operations by   October 15th. We also received an internet news license recently.   So, this is the first license issued since early 2017 and the   first and only issued in Shanghai, which means that our efforts   from the very beginning through our content compliance teams and   capabilities has been well-recognized by the regulators. And I   think based on our understanding of our communications with the   regulators, we are quite confident that the impact on Midu in Q4   will be limited.",
    "Regarding your second question, in terms of revenue   contribution, as I said previously, we do see a very healthy   traffic growth of Midu in Q2 and early Q3, and also we had a very   strong start of Midu Light so far this quarter. So, I think in   Q4, we do have very high expectations for Midu. And with the   current trends, we see that Midu can contribute up to 20% of our   total revenue in Q4.",
    "In terms of your third question, regarding costs and expenses,   I think several things. First, for content costs, given the   nature of our business, we believe we will be able to control the   content costs at a 6% to 7% level, as a percentage of revenue, on   the Qutoutiao side, and around 20% on the Midu side,   respectively. As the head contributors come from a large share of   users compared to other content formats, while the tail is low   and fat for both newsfeed and online literature. We are confident   to keep our content costs at the current level in the near   future.",
    "For user acquisitions, it has stayed at RMB6 to RMB7 per   installation level for several quarters and we don't see any big   changes for the rest of the year. In terms of engagement costs, I   think this quarter we were able to further reduce our average   user engagement costs to RMB13 cents per DAU on a blended basis,   compared to 17 cents in Q1 and over 20 cents in the second half   last year. The reduction is a result of our improved algorithms,   through which we can focus our engagement budget on users that   are most susceptible to catch stimulation and also an effect that   we intentionally cut back some of the costs during low season and   in the phase of irrational competition in Q1 and Q2.",
    "For Q3 and Q4, we expect our average engagement cost per DAU   to increase a little bit due to seasonality and better   monetization on the ARPU side, but still below compared to the   same period last year and to be around 15 cents per DAU on a   blended basis. Thank you.",
    " Alicia Yap    --   Citigroup -- Analyst ",
    "Okay. Thank you.",
    " Operator ",
    "Thank you. The next question we have is from the line of Hans   Chung from KeyBanc Capital Markets. Your line is now open.",
    " Hans Chung    --   KeyBanc Capital Markets -- Analyst ",
    "Thanks for taking my question. So, I have a couple of   questions. First, can you give us some color around your view on   the 4Q revenue outlook? And then I remember last quarter, we had   annual guidance for 6 to 7 and I just wonder if that guidance   still maintains. And then, secondly, it seems like the engagement   ratio, which is DAU to MAU, and also the conversion from   installed user to MAU, if you look at the two metrics, they both   came down quite a bit in the second quarter. So, I just wonder   what drove the trend and how should we think about the trend to   get us stabilized going forward? Thank you.",
    " Xiaolu Zhu    --   Co-Chief Financial Officer ",
    "Thanks, Hans. So, regarding the revenue outlook and guidance,   I think if you look at our Q3 numbers, as we explained that we   have almost little to zero revenue contribution from Midu this   quarter. So, our guidance for this quarter is that we are   expecting Q3 revenues to be on a similar level of flattish   compared to Q2 on a quarter-over-quarter basis. That means   Qutoutiao app alone will contribute revenues on a similar level   as Qutoutiao and Midu combined in Q2.",
    "So, for Q4, I think once Midu resumes normal operations, and   also as I explained in the previous question, we believe Midu can   contribute as much as 20% of our total revenue. We do think that   Q4 will be a strong quarter for us in terms of revenue   growth.",
    "And regarding the overall annual guidance, I think so far   every trend is growing as we expected and as we have discussed   with the market before. But there is a loss of revenue in Q3 from   Midu so I think the main difference will be that part. Otherwise,   we think we have strong confidence in achieving our other annual   goals. Especially on the traffic side, we are still very   confident that we can achieve our goal of year-end DAU of 50   million to 60 million.",
    "In terms of your third question regarding engagement ratio, I   think we have touched upon that a little bit previously as well.   We had some pressures in the first quarter and the first half of   the second quarter due to irrational competition and the overall   weakness of the ad market. However, we did make several efforts   in terms of optimizing our user engagement costs and also   increasing the quality of our content. And we have seen some very   promising early results starting from the second half of Q2,   especially starting from June.",
    "And as I explained, we have seen a 10% to 15% user traffic   growth in Q3 so far compared to Q2 and we believe the trend will   continue. And also in terms of Midu, despite the suspension, we   have a very strong start of Midu Light, so combined traffic of   Midu and Midu Light stays flattish compared to Midu in Q2. And I   think we can restart the growth of Midu once the normal   operations resume. So, overall, I think we are still very   confident in terms of achieving our year-end goal of 50 million   to 60 million DAUs and the pressure we had earlier this year, we   don't think it's a long-term thing. Thank you.",
    " Operator ",
    "Thank you. The next question is coming from the line of Tian   Hou from T.H. Capital. Your line is now open.",
    " Tian Hou    --   T.H. Capital -- Analyst ",
    "Yes. So, two questions. One is regarding the retention rate.   So, what is the current retention rate of the two apps combined?   And also what is the target retention rate by the end of this   year since the newer app, Midu, is going to come back live? So,   that's going to be really helpful to retention. So, that's the   first question.",
    "The second question is related to advertising and advertisers.   So, in Q3, what are the newer or growing sectors of advertisers?   What are the decreasing sectors of advertisers? So, what trends   do you see in the advertising sector front? That's two questions.   Thank you.",
    " Xiaolu Zhu    --   Co-Chief Financial Officer ",
    "Thank you, Tian. Regarding user retention, as I said earlier,   we did see some pressure in the first half of this year as we   continued to optimize our user engagement profile while facing   irrational competition in the market at the same time. And March   and April were the low points for us. For Q1, we saw a downward   trend but for Q2, we have ended the quarter on a higher mark.   Quarter-end DAU exceeded 40 million and the strong momentum   continued in Q3. And also as I said earlier, we see average DAU   for the two Midu apps have increased over 10% so far in Q3   compared to the second quarter.",
    "Regarding the user acquisition costs, as I explained earlier,   we are trying to keep that cost down to the 6 to 7 RMB range and   we don't have any plans to increase that budget on a large scale.   So, overall, I think we are trying still to continue to increase   our content quality, continue to optimize our operations and to   offer more social features, video games, live streaming, and   expect to add also all kinds of new content features on the   Qutoutiao side to increase user engagement and activity. And, so   far, we have seen some very strong early results. And as I said,   our year-end target of 50 million to 60 million DAU has not been   changed. So, so far, we are quite confident in terms of user   traffic growth and user retention.",
    "In terms of your second question, regarding the advertisers,   so far this year, e-commerce has been quite strong and continues   to be the largest segment of our advertisers. Otherwise, I think   most segments are more or less the same as previous quarters. And   we think that this trend will continue for the rest of the year.   Thank you.",
    " Tian Hou    --   T.H. Capital -- Analyst ",
    "Thank you.",
    " Operator ",
    "Thank you. As there are no further questions, I will now like   to hand the conference back to the company for closing remarks.   Again, if there are no further questions, I'd like to turn the   call over to the company for closing remarks.",
    " Sai Chi    --   Qutoutiao Inc. ",
    "Thank you, everyone. That concludes today's conference call.   Thank you.",
    " Xiaolu Zhu    --   Co-Chief Financial Officer ",
    "Thank you.",
    " Duration: 34 minutes ",
    " Sai Chi    --   Qutoutiao Inc. ",
    " Eric Tan    --   Chairman and Chief Executive Officer ",
    " Jingbo Wang    --   Co-Chief Financial Officer ",
    " Xiaolu Zhu    --   Co-Chief Financial Officer ",
    " Zhijing Liu    --   UBS -- Analyst ",
    " Alicia Yap    --   Citigroup -- Analyst ",
    " Hans Chung    --   KeyBanc Capital Markets -- Analyst ",
    " Tian Hou    --   T.H. Capital -- Analyst ",
    " More QTT analysis ",
    " All earnings call transcripts ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions   for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcription      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:56:11"
}