{
  "url": "https://www.nasdaq.com/article/sinous-trade-thaw-sparks-risk-rally-euro-awaits-ecb-20190911-00921",
  "title": "Sino-U.S. trade thaw sparks risk rally, euro awaits ECB - Nasdaq.com",
  "text": [
    "By Tom Westbrook",
    "SINGAPORE, Sept 12 (Reuters) - An exchange of olive branches between Washington and Beijing on trade pushed the dollar to a six-week high against the safe-haven yen on Thursday and also supported the risk-sensitive currencies of China, Australia and South Korea.",
    "The world's two largest economies granted concessions in their heated tariff dispute on Wednesday ahead of planned talks. China exempted a basket of U.S. goods from its own tariffs while U.S. President Donald Trump said he would delay a scheduled tariff hike by two-weeks in October.",
    "The yen  fell almost 0.2% to 108.00 per dollar, its weakest since Aug. 1.",
    "\"It's a conciliatory move,\" said Joe Capurso, senior currency strategist at the Commonwealth Bank of Australia in Sydney, while warning not to get too carried away.",
    "\"It's not really a change in policy...we don't see any strong evidence there's going to be a permanent agreement to ratchet down these tariffs.\"",
    "The other major driver for currency markets on Thursday is a meeting of the European Central Bank, where expectations of easing have weakened the euro.",
    "The single currency  has shed 3.5% since June and fell to a one-week low of $1.0983 overnight. It was steady at $1.1010 in Asian morning trade.",
    "With growth slowing, the ECB has all but promised more support for the economy in one of the most closely watched meetings in years. ",
    "The ECB is almost certain to cut rates, promise to keep rates low for longer and provide banks relief from the side effects of negative rates. However, new asset purchases, priced in by markets, are not a done deal with some conservative policymakers opposing the move.",
    "\"Market reaction will likely hinge on the confirmation of a rate cut,\" said David de Garis, a director of economics and markets at National Australia Bank in London.",
    "\"The real kicker though will not be whether QE is re-started, but crucially, whether it leaves markets feeling the ECB is running out of room, or hamstrung by internal opposition,\" he said. \"What markets would not want to hear is during the press conference evidence of a disagreement.\"",
    "Sterling also dipped after a Scottish court ruled on Wednesday that Prime Minister Boris Johnson's suspension of the British Parliament was unlawful, prompting immediate calls for lawmakers to return to work as the government and Parliament battle over the future of Brexit. ",
    "The British pound  fell as much as 0.4% to $1.2313 overnight, and hovered around $1.2330 in Asian hours."
  ],
  "published_datetime": "2019-09-11 08:59:00"
}