{
  "url": "https://www.nasdaq.com/article/vertex-vrtx-inks-all-cash-deal-to-acquire-semma-for-950m-cm1207421",
  "title": "Vertex (VRTX) Inks All-Cash Deal to Acquire Semma for $950M - Nasdaq.com",
  "text": [
    "  Vertex Pharmaceuticals VRTX  announced that it has decided to acquire Semma Therapeutics, a privately-held biotech, for $950 million in cash. This acquisition will add pre-clinical cell-based treatment candidates for type I diabetes to Vertex's pipeline. The deal is expected to close in the fourth quarter of 2019. Notably, Semma is using a differentiated therapeutic approach to treat type I diabetes by developing stem cell-derived human islets that have the potential to restore insulin secretion and ameliorate hypoglycemia through the production of functional human pancreatic beta cells. It also uses a novel device that encapsulates these pancreatic cells and protects them from the immune system, improving durability of the treatment without the need for ongoing immunosuppressive therapy. However, the company is yet to start clinical studies on humans. Type I diabetes is a serious disease affecting more than 1 million people in the United States. Currently, no curative therapies are available for this disease. In June, Vertex had announced an agreement to acquire another privately-held Exonics Therapeutics, focused on developing gene editing therapies for Duchenne muscular dystrophy and other severe genetic neuromuscular diseases. This buyout is expected to be complete by September end. Vertex will pay $245 million upfront to Exonics for acquiring all its outstanding shares and form a wholly-owned subsidiary. Shareholders of Exonics are eligible to receive approximately $1 billion including upfront and potential milestone payments. So far this year, Vertex has gained 7.8% against the industry  's 2.2% decline.    Furthermore, Vertex has a strong pipeline as well as marketed drugs in its cystic fibrosis (CF) franchise. In the first half of 2019, the company has generated almost $1.8 billion from the sale of its three CF drugs - Kalydeco, Orkambi and Symdeko, registering nearly 30% growth year over year. Meanwhile, the company is progressing well its CF pipeline. Last month, Vertex's new drug application seeking approval for its triple combination CF regimen VX-445 (elexacaftor), tezacaftor and Kalydeco was accepted by the FDA. If approved, the triple combination regimen will help Vertex address a significantly larger CF patient population (almost 90% of patients with CF) in the future. A similar regulatory filling in Europe is expected in the fourth quarter of 2019. Vertex's non-CF pipeline, though in early stage, looks interesting with treatments being developed for beta thalassemia, sickle cell disease, alpha-1 antitrypsin deficiency, APOL1-mediated kidney diseases and pain. The acquisition of Semma further diversifies its non-CF pipeline by adding a therapeutic option for type I diabetes. It should be noted that Eli Lilly LLY  is one of the large pharma companies, which has a strong presence in the diabetes segment with its drugs including Trulicity, Humalog and Humulin having blockbuster potential. Novo Nordisk NVO  is also a strong contender in this segment. Meanwhile, several other pharma/biotech companies are focused on developing a treatment for type I & II diabetes including AstraZeneca AZN  , Sanofi and Lexicon Pharmaceuticals.   Vertex Pharmaceuticals Incorporated Price        Vertex Pharmaceuticals Incorporated price    |   Vertex Pharmaceuticals Incorporated Quote    Zacks Rank  Vertex currently carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  AstraZeneca PLC (AZN): Free Stock Analysis Report   Novo Nordisk A/S (NVO): Free Stock Analysis Report   Eli Lilly and Company (LLY): Free Stock Analysis Report   Vertex Pharmaceuticals Incorporated (VRTX): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Vertex Pharmaceuticals VRTX  announced that it has decided to acquire Semma Therapeutics, a privately-held biotech, for $950 million in cash. This acquisition will add pre-clinical cell-based treatment candidates for type I diabetes to Vertex's pipeline. The deal is expected to close in the fourth quarter of 2019.",
    "Notably, Semma is using a differentiated therapeutic approach to treat type I diabetes by developing stem cell-derived human islets that have the potential to restore insulin secretion and ameliorate hypoglycemia through the production of functional human pancreatic beta cells. It also uses a novel device that encapsulates these pancreatic cells and protects them from the immune system, improving durability of the treatment without the need for ongoing immunosuppressive therapy. However, the company is yet to start clinical studies on humans.",
    "Type I diabetes is a serious disease affecting more than 1 million people in the United States. Currently, no curative therapies are available for this disease.",
    "In June, Vertex had announced an agreement to acquire another privately-held Exonics Therapeutics, focused on developing gene editing therapies for Duchenne muscular dystrophy and other severe genetic neuromuscular diseases. This buyout is expected to be complete by September end. Vertex will pay $245 million upfront to Exonics for acquiring all its outstanding shares and form a wholly-owned subsidiary. Shareholders of Exonics are eligible to receive approximately $1 billion including upfront and potential milestone payments.",
    "So far this year, Vertex has gained 7.8% against the industry  's 2.2% decline.",
    "Furthermore, Vertex has a strong pipeline as well as marketed drugs in its cystic fibrosis (CF) franchise. In the first half of 2019, the company has generated almost $1.8 billion from the sale of its three CF drugs - Kalydeco, Orkambi and Symdeko, registering nearly 30% growth year over year. Meanwhile, the company is progressing well its CF pipeline.",
    "Last month, Vertex's new drug application seeking approval for its triple combination CF regimen VX-445 (elexacaftor), tezacaftor and Kalydeco was accepted by the FDA. If approved, the triple combination regimen will help Vertex address a significantly larger CF patient population (almost 90% of patients with CF) in the future. A similar regulatory filling in Europe is expected in the fourth quarter of 2019.",
    "Vertex's non-CF pipeline, though in early stage, looks interesting with treatments being developed for beta thalassemia, sickle cell disease, alpha-1 antitrypsin deficiency, APOL1-mediated kidney diseases and pain. The acquisition of Semma further diversifies its non-CF pipeline by adding a therapeutic option for type I diabetes.",
    "It should be noted that Eli Lilly LLY  is one of the large pharma companies, which has a strong presence in the diabetes segment with its drugs including Trulicity, Humalog and Humulin having blockbuster potential. Novo Nordisk NVO  is also a strong contender in this segment. Meanwhile, several other pharma/biotech companies are focused on developing a treatment for type I & II diabetes including AstraZeneca AZN  , Sanofi and Lexicon Pharmaceuticals.",
    "  Vertex Pharmaceuticals Incorporated Price        Vertex Pharmaceuticals Incorporated price    |   Vertex Pharmaceuticals Incorporated Quote  ",
    " Vertex Pharmaceuticals Incorporated Price ",
    " Vertex Pharmaceuticals Incorporated price    |   Vertex Pharmaceuticals Incorporated Quote ",
    " Zacks Rank ",
    "Vertex currently carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:32:00"
}