{
  "url": "https://www.nasdaq.com/article/brazils-bolsonaro-irks-chile-with-personal-attack-on-uns-bachelet-20190904-01212",
  "title": "Brazil's Bolsonaro irks Chile with personal attack on U.N.'s Bachelet - Nasdaq.com",
  "text": [
    "By Stephanie Nebehay, Gabriel Stargardter and Aislinn Laing",
    "GENEVA/RIO DE JANEIRO/SANTIAGO, Sept 4 (Reuters) - Brazilian President Jair Bolsonaro caused friction with regional ally Chile on Wednesday when he accused its former leader Michelle Bachelet of meddling in Brazil's affairs by criticizing rising police violence and erosions of democracy.",
    "Bolsonaro, a far-right former army captain, reacted furiously to comments by Bachelet, the United Nations High Commissioner for Human Rights, who was tortured under the dictatorship of Augusto Pinochet and was the first female Chilean president.",
    "\"Bachelet ... (is) following Macron's line in meddling in domestic affairs and Brazilian sovereignty,\" Bolsonaro wrote on Facebook. \"She attacks Brazil with the agenda of the human rights (of criminals), attacking our valiant ... police.\"",
    "Bolsonaro also personally attacked Bachelet, whose father, an air force general, remained loyal to socialist President Salvador Allende after a 1973 coup in Chile and died in jail.",
    "\"(Bachelet) forgets that the only reason (her) country isn't like Cuba is thanks to those who had the courage to put a stop to the left in 1973,\" Bolsonaro wrote. \"Among those communists was her ... father.\"",
    "Bolsonaro's comments irked Chile's opposition parties and were even criticized by some leaders of President Sebastian Pinera's center-right ruling coalition.",
    "Pinera said Bachelet, his former presidential election rival, had made accusations against Brazil without evidence, but said that did not justify Bolsonaro's personal attack.",
    "\"There are differing views on the governments we had in the 70s and 80s but these views should be expressed with respect for the people involved,\" Pinera told reporters.",
    "\"As a consequence, I do not in any way share the allusion made by President Bolsonaro with respect to an ex-president of Chile, especially on a subject as painful as the death of her father.\"",
    "Between January and July, Rio police killed 1,075 people, more than five people per day, 20% more than the same period last year and on track to be the highest tally since records began in 2003.",
    "Bolsonaro was elected on a pledge to show no mercy to criminals after a dizzying rise in violence in Brazil. He has long praised the work of the police, a pillar of his support.",
    "The Brazilian Foreign Ministry, in response to Bachelet's criticism, said in a statement that Bolsonaro was elected by a majority of Brazilian voters with a mandate to improve public security and protect private property.",
    "Stepped up police activity was an important component of that mandate and is beginning to show results, the statement said, citing a 21.2 percent drop in the number of murders in Brazil in the first four months of this year.",
    "Bachelet on Wednesday expressed concern over the rise in police violence \"amidst a public discourse legitimizing summary executions.\" That discourse, she said, could \"reinforce the message that state agents are ... able to kill without being held to account.\"",
    "She also criticized \"a shrinking of civic and democratic space\" in Brazil.",
    "The foreign ministry statement suggested Bachelet should focus her attention on Venezuela's \"unprecedented humanitarian crisis\" instead of making \"false\" comments about Brazil, a democracy where the rule of law prevails, the statement said."
  ],
  "published_datetime": "2019-09-04 06:04:00"
}