{
  "url": "https://www.nasdaq.com/article/validea-joseph-piotroski-strategy-daily-upgrade-report-952019-cm1207697",
  "title": "Validea Joseph Piotroski Strategy Daily Upgrade Report - 9/5/2019 - Nasdaq.com",
  "text": [
    "The following are today's upgrades for Validea's Book/Market Investor model based on the published strategy of Joseph Piotroski . This value-quant strategy screens for high book-to-market stocks, and then separates out financially sound firms by looking at a host of improving financial criteria.",
    "PINNACLE FINANCIAL PARTNERS ( PNFP ) is a mid-cap value stock in the Regional Banks industry. The rating according to our strategy based on Joseph Piotroski changed from 0% to 80% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Pinnacle Financial Partners, Inc. is a bank holding company. The Company operates through its subsidiary, Pinnacle Bank. The Company operates as a community bank primarily in the urban markets of Nashville, Knoxville, Memphis and Chattanooga, Tennessee and other counties. It provides the personalized service associated with small community banks, while seeking to offer the products and services, such as investments and treasury management. Pinnacle Bank offers an array of convenience-centered products and services, including round the clock telephone and Internet banking, mobile banking, debit and credit cards, direct deposit, remote deposit and cash management services for small- to medium-sized businesses. In addition, Pinnacle Bank is associated with a network of automated teller machines of other financial institutions that its clients are able to use throughout Tennessee and other regions.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "Since its inception, Validea's strategy based on Joseph Piotroski has returned 121.31% vs. 156.59% for the S&P 500. For more details on this strategy, click here",
    "About Joseph Piotroski : Piotroski isn't your typical Wall Street big shot. In fact, he's not even a professional investor. He's a good old numbers-crunching accountant and college professor. But in 2000, shortly after he started teaching at the University of Chicago's Graduate School of Business, Piotroski published a groundbreaking paper in the Journal of Accounting Research entitled \"Value Investing: The Use of Historical Financial Statement Information to Separate Winners from Losers\". In it, Piotroski laid out an accounting-based stock-selection/shorting method that produced a 23 percent average annual back-tested return from 1976 through 1996 -- more than double the S&P 500's gain during that time. Piotroski's findings were reported in major financial publiations like SmartMoney. Today, he teaches accounting at Stanford University's Graduate School of Business.",
    "About Validea : Validea is an investment research service that follows the published strategies of investment legends. Validea offers both stock analysis and model portfolios based on gurus who have outperformed the market over the long-term, including Warren Buffett, Benjamin Graham, Peter Lynch and Martin Zweig. For more information about Validea, click here",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 08:04:00"
}