{
  "url": "https://www.nasdaq.com/article/only-these-10-pot-stocks-ended-august-higher-cm1206733",
  "title": "Only These 10 Pot Stocks Ended August Higher - Nasdaq.com",
  "text": [
    "On one hand, legal marijuana could prove to be one of the fastest-growing industries on the planet over the next decade. If investment bank Stifel's forecast of $200 billion in annual worldwide sales in 10 years proves accurate, we could be looking at a compound annual growth rate for cannabis of around 34%.",
    "On the other hand, marijuana stocks have been a train wreck since the beginning of the second quarter. Supply chain woes in Canada, high tax rates in the U.S., and disappointing operating results have sunk the industry. In August, the Horizons Marijuana Life Sciences ETF , the first tradable cannabis ETF, fell nearly 14%, and is now down 34%, inclusive o f dividends paid, since the end of March.",
    "The data gets even uglier for the combined 58 direct cannabis players and ancillary stocks I regularly follow. After July saw just nine pot stocks head higher , August tallied only 10 winners -- five of which rose by less than 4%. Suffice it to say, it was another ugly month for marijuana stocks.",
    "Image source: Getty Images.",
    "Nevertheless, the following 10 pot stocks, listed in descending order by percentage gain, managed to buck industrywide weakness last month.",
    "You'll probably note that a lot of brand-name marijuana stocks are absent from the list of August's gainers. However, a few trends do emerge that may help explain why this particular group of companies outperformed.",
    "Image source: Getty Images.",
    "Continuing a theme from July, ancillary cannabis stocks had a relatively good month, all things considered. The reason? Only a small percentage of their revenue is tied to marijuana, meaning they have other non-cannabis revenue streams to lean on.",
    "Shopify, for example, continues to kick \"bud\" and take names, with the highflier tacking on another 21% in August. Shopify is responsible for providing e-commerce solutions for Ontario's brick-and-mortar, online, and mobile marijuana sales, as well as various private retailers in British Columbia. Despite supply issues persisting throughout much of Canada, Shopify currently generates the bulk of its revenue from merchant solutions and subscription revenue outside of the marijuana industry. Thus, Shopify gets the benefit of being associated with the fast-growing cannabis industry without the pain of being a direct player.",
    "Similarly, Constellation Brands has been riding high (pardon the pun) thanks to its high-end spirits and beer selection. Back in November, Constellation closed on a $4 billion equity investment in Canopy Growth , thereby upping its stake in the company to 37%. Unfortunately, huge quarterly losses at Canopy have led Constellation to book losses tied to its equity stake . Nonetheless, high-margin alcohol sales remain strong, buffering Constellation Brands from recent weakness in the cannabis industry.",
    "Image source: Getty Images.",
    "In case you haven't noticed by now, operating results actually matter -- and companies that can surprise Wall Street with a positive report have been getting a lift.",
    "On Aug. 1, Aphria wound up reporting significantly better-than-expected fiscal fourth-quarter operating results, which helps explain why it was the top-performing direct pot stock last month. Sequential quarterly revenue soared 75% to nearly 129 million Canadian dollars, with adult-use marijuana sales surging by 158% from the sequential third quarter to CA$18.5 million. Even though most of Aphria's sales surge was tied to its distribution business and not marijuana, the bump up in recreational weed sales was a pleasant surprise at a time when supply issues are rampant in Canada.",
    "Plant biotechnology company 22nd Century Group, August's top-performing pot stock, also benefited from a well-received earnings report . On Aug. 7, 22nd Century Group announced that while second-quarter sales had declined by 15.9% to $5.82 million from the prior-year period, the company's net operating loss shrank by more than $2 million to $5.03 million. There was also a significant decline in equity-based compensation. Though 22nd Century Group is still a highly speculative investment, shareholders liked what they saw in the company's Augus t report .",
    "Image source: Getty Images.",
    "Lastly, while we've witnessed most marijuana acquisition and merger partners falling in tandem over the past couple of months, the duo of Cresco Labs and Origin House managed to buoy each other in August.",
    "There look to be two reasons behind the modest rise in both companies. First, there's the optimism that the U.S. Justice Department's Antitrust Division will approve the combination of Cresco Labs and Origin House . If the deal goes through, Cresco Labs will gain access to more than 500 California dispensaries, giving it the ability to rapidly grow sales. Origin House is one of just a small handful of licensed distributors in the Golden State.",
    "The other factor at work here is an extension of the previous point: operating results. Both companies reported their most recent quarterly operating results in late August, with Cresco delivering $29.9 million in sales , a 253% year-over-year increase, and Origin House generating CA$21.4 million in sales , representing a 511% increase from the prior-year quarter. In terms of sequential quarterly sales growth, Cresco and Origin House clocked in at 42% and 91%, respectively.",
    "Investors are clearly excited about this combination, and it certainly showed with these two pot stocks bucking general industry weakness in August.",
    "Here's The Marijuana Stock You've Been Waiting For A little-known Canadian company just unlocked what some experts think could be the key to profiting off the coming marijuana boom. ",
    "And make no mistake - it is coming.",
    "Cannabis legalization is sweeping over North America - 10 states plus Washington, D.C., have all legalized recreational marijuana over the last few years, and full legalization came to Canada in October 2018.",
    "And one under-the-radar Canadian company is poised to explode from this coming marijuana revolution.",
    "Because a game-changing deal just went down between the Ontario government and this powerhouse company...and you need to hear this story today if you have even considered investing in pot stocks.",
    "Simply click here to get the full story now.",
    "Learn more",
    "Sean Williams has no position in any of the stocks mentioned. The Motley Fool owns shares of and recommends Shopify. The Motley Fool recommends Auxly Cannabis Group, Constellation Brands, and Origin House. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 07:21:00"
}