{
  "url": "https://www.nasdaq.com/article/is-molina-moh-stock-undervalued-right-now-cm1210347",
  "title": "Is Molina (MOH) Stock Undervalued Right Now? - Nasdaq.com",
  "text": [
    " The proven Zacks Rank system focuses on earnings estimates and estimate revisions to find winning stocks. Nevertheless, we know that our readers all have their own perspectives, so we are always looking at the latest trends in value, growth, and momentum to find strong picks. Considering these trends, value investing is clearly one of the most preferred ways to find strong stocks in any type of market. Value investors use fundamental analysis and traditional valuation metrics to find stocks that they believe are being undervalued by the market at large. In addition to the Zacks Rank, investors looking for stocks with specific traits can utilize our Style Scores system. Of course, value investors will be most interested in the system's \"Value\" category. Stocks with \"A\" grades for Value and high Zacks Ranks are among the best value stocks available at any given moment. One company value investors might notice is Molina (MOH). MOH is currently sporting a Zacks Rank of #2 (Buy) and an A for Value. The stock holds a P/E ratio of 10.10, while its industry has an average P/E of 13.43. Over the last 12 months, MOH's Forward P/E has been as high as 21.90 and as low as 10.10, with a median of 13.67. Value investors also love the P/S ratio, which is calculated by simply dividing a stock's price with the company's sales. Some people prefer this metric because sales are harder to manipulate on an income statement. This means it could be a truer performance indicator. MOH has a P/S ratio of 0.43. This compares to its industry's average P/S of 0.45. Finally, we should also recognize that MOH has a P/CF ratio of 8.59. This data point considers a firm's operating cash flow and is frequently used to find companies that are undervalued when considering their solid cash outlook. MOH's P/CF compares to its industry's average P/CF of 12.04. Over the past 52 weeks, MOH's P/CF has been as high as 67.91 and as low as 8.43, with a median of 10.71. These are only a few of the key metrics included in Molina's strong Value grade, but they help show that the stock is likely undervalued right now. When factoring in the strength of its earnings outlook, MOH looks like an impressive value stock at the moment.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Molina Healthcare, Inc (MOH): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "The proven Zacks Rank system focuses on earnings estimates and estimate revisions to find winning stocks. Nevertheless, we know that our readers all have their own perspectives, so we are always looking at the latest trends in value, growth, and momentum to find strong picks.",
    "Considering these trends, value investing is clearly one of the most preferred ways to find strong stocks in any type of market. Value investors use fundamental analysis and traditional valuation metrics to find stocks that they believe are being undervalued by the market at large.",
    "In addition to the Zacks Rank, investors looking for stocks with specific traits can utilize our Style Scores system. Of course, value investors will be most interested in the system's \"Value\" category. Stocks with \"A\" grades for Value and high Zacks Ranks are among the best value stocks available at any given moment.",
    "One company value investors might notice is Molina (MOH). MOH is currently sporting a Zacks Rank of #2 (Buy) and an A for Value. The stock holds a P/E ratio of 10.10, while its industry has an average P/E of 13.43. Over the last 12 months, MOH's Forward P/E has been as high as 21.90 and as low as 10.10, with a median of 13.67.",
    "Value investors also love the P/S ratio, which is calculated by simply dividing a stock's price with the company's sales. Some people prefer this metric because sales are harder to manipulate on an income statement. This means it could be a truer performance indicator. MOH has a P/S ratio of 0.43. This compares to its industry's average P/S of 0.45.",
    "Finally, we should also recognize that MOH has a P/CF ratio of 8.59. This data point considers a firm's operating cash flow and is frequently used to find companies that are undervalued when considering their solid cash outlook. MOH's P/CF compares to its industry's average P/CF of 12.04. Over the past 52 weeks, MOH's P/CF has been as high as 67.91 and as low as 8.43, with a median of 10.71.",
    "These are only a few of the key metrics included in Molina's strong Value grade, but they help show that the stock is likely undervalued right now. When factoring in the strength of its earnings outlook, MOH looks like an impressive value stock at the moment.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:10:22"
}