{
  "url": "https://www.nasdaq.com/article/japanese-yen-plunges-chinese-yuan-jumps-on-uschina-trade-hopes-20190905-00121",
  "title": "Japanese yen plunges, Chinese yuan jumps on US-China trade hopes - Nasdaq.com",
  "text": [
    "By Olga Cotaga",
    "LONDON, Sept 5 (Reuters) - The Japanese yen slipped and risky currencies flourished on Thursday as investors turned more optimistic that the United States will find common ground with China on trade after agreeing to hold talks in October.",
    "Chinese representatives will travel to Washington next month, China's commerce ministry said on Thursday. ",
    "\"It does seem that the markets were positioning more bearishly, and now we've gotten this potential good news and the markets are running with it,\" he said, adding global economic indicators had also recently been showing some green shoots.",
    "The pound also gained ground, boosted by hopes that a no-deal Brexit will be avoided. British lawmakers approved legislation on Wednesday to extend the Brexit deadline for the third time and rejected Prime Minister Boris Johnson's motion to hold a snap election. ",
    "\"An amazing day when sterling is the best performer and the Japanese yen is the worst,\" said Marshal Gittler, a strategist at ACLS Global. \"Must indicate a real drop in risk sentiment, particularly with regards to Brexit!\"",
    "The yen plunged to a three-week low of 106.75 against the dollar , although it was last trading neutral at 106.41.",
    "The Chinese yuan rose to a two-week high of 7.1213 against the dollar in the offshore market  and was last up by 0.1% at 7.1382.",
    "The Australian dollar rose to a one-month high of 0.68255 against the U.S. dollar  and was last up 0.2% at 0.6811. The New Zealand dollar rose to a nine-day at 0.6379 .",
    "The dollar was flat against both the euro and five other major currencies . Euro/dollar was last at $1.1029 .",
    "Sterling was last trading down 0.3% at $1.2220 . It had earlier reached an eight-day high of $1.2262. Against the euro, the pound was down 0.2% at 90.245 pence ."
  ],
  "published_datetime": "2019-09-05 03:45:00"
}