{
  "url": "https://www.nasdaq.com/article/concho-to-sell-shelf-asset-plans-to-begin-buyback-program-cm1207426",
  "title": "Concho to Sell Shelf Asset, Plans to Begin Buyback Program - Nasdaq.com",
  "text": [
    "  Concho Resources Inc. CXO  has been executing its strategy to boost the value of its legacy assets and minimize its cost structure. To this end, it has announced that it will divest its New Mexico property for $925 million to a unit of Spur Energy Partners LLC. In line with this, the company has plans to initiate a $1.5-billion stock repurchase program. This will be partly backed by the divestiture of the New Mexico asset wherein 40% of the proceeds will be used for the buyback program and the remaining will be utilized in repaying the debts. Currently, the Continental Shelf asset produces 25,000 barrels of oil equivalent per day (bpd) at 100,000 gross acres adjoining Concho Resources' operation in the Delaware Basin. Notwithstanding the New Mexico asset sell-off, this Midland-based E&P company intends to continue with its various development projects in southeastern New Mexico for helping its employees. The oil-levered producer in the Permian Basin focuses on selling its non-core assets to enhance its portfolio value. Further, it aims to streamline its cost structure leading to cost-efficient growth. Additionally, Concho Resources concentrates on attaining its debt-reduction target and improve returns to its shareholders. So selling this non-core Shelf asset will help Concho Resources save its cash operating costs and inch closer to its 2020 target expense of $9 per barrel of oil equivalent (bpd) compared with the current figure of $9.83 bpd. Moreover, the stock repurchase program shows Concho Resources' strong belief in its strategy. Tim Leach, chairman and CEO, Concho Resources, feels that this venture is a vindication of the company's scheme to generate solid cash flow along with sustainable oil production. The transaction is contingent on pending approvals and is estimated to complete during November 2019.   Concho Resources Inc. Price         Concho Resources Inc. price      |     Concho Resources Inc. Quote     Zacks Rank & Key Picks  Concho Resources carries a Zacks Rank #3 (Hold). Better-ranked players in the energy space include BP Midstream Partners BPMP  , Dril-Quip, Inc. DRQ  and World Fuel Services Corporation INT  , each carrying a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   . BP Midstream's earnings beat the Zacks Consensus Estimate in three of the trailing four quarters. Dril-Quip earnings beat the Zacks Consensus Estimate in three of the previous four quarters. World Fuel Services earnings beat the Zacks Consensus Estimate in all the last four quarters.  Biggest Tech Breakthrough in a Generation  makeArticleAd();  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Dril-Quip, Inc. (DRQ): Free Stock Analysis Report   World Fuel Services Corporation (INT): Free Stock Analysis Report   Concho Resources Inc. (CXO): Free Stock Analysis Report   BP Midstream Partners LP (BPMP): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Concho Resources Inc. CXO  has been executing its strategy to boost the value of its legacy assets and minimize its cost structure. To this end, it has announced that it will divest its New Mexico property for $925 million to a unit of Spur Energy Partners LLC.",
    "In line with this, the company has plans to initiate a $1.5-billion stock repurchase program. This will be partly backed by the divestiture of the New Mexico asset wherein 40% of the proceeds will be used for the buyback program and the remaining will be utilized in repaying the debts.",
    "Currently, the Continental Shelf asset produces 25,000 barrels of oil equivalent per day (bpd) at 100,000 gross acres adjoining Concho Resources' operation in the Delaware Basin. Notwithstanding the New Mexico asset sell-off, this Midland-based E&P company intends to continue with its various development projects in southeastern New Mexico for helping its employees.",
    "The oil-levered producer in the Permian Basin focuses on selling its non-core assets to enhance its portfolio value. Further, it aims to streamline its cost structure leading to cost-efficient growth. Additionally, Concho Resources concentrates on attaining its debt-reduction target and improve returns to its shareholders.",
    "So selling this non-core Shelf asset will help Concho Resources save its cash operating costs and inch closer to its 2020 target expense of $9 per barrel of oil equivalent (bpd) compared with the current figure of $9.83 bpd. Moreover, the stock repurchase program shows Concho Resources' strong belief in its strategy. Tim Leach, chairman and CEO, Concho Resources, feels that this venture is a vindication of the company's scheme to generate solid cash flow along with sustainable oil production.",
    "The transaction is contingent on pending approvals and is estimated to complete during November 2019.",
    "  Concho Resources Inc. Price         Concho Resources Inc. price      |     Concho Resources Inc. Quote   ",
    " Concho Resources Inc. Price ",
    "  Concho Resources Inc. price      |     Concho Resources Inc. Quote  ",
    " Zacks Rank & Key Picks ",
    "Concho Resources carries a Zacks Rank #3 (Hold). Better-ranked players in the energy space include BP Midstream Partners BPMP  , Dril-Quip, Inc. DRQ  and World Fuel Services Corporation INT  , each carrying a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "BP Midstream's earnings beat the Zacks Consensus Estimate in three of the trailing four quarters.",
    "Dril-Quip earnings beat the Zacks Consensus Estimate in three of the previous four quarters.",
    "World Fuel Services earnings beat the Zacks Consensus Estimate in all the last four quarters.",
    " Biggest Tech Breakthrough in a Generation  makeArticleAd();  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:58:00"
}