{
  "url": "https://www.nasdaq.com/article/stock-market-news-today-september-3rd-2019-cm1206865",
  "title": "Stock Market News Today: September 3rd, 2019 - Nasdaq.com",
  "text": [
    " A metric tied to U.S. manufacturing activity showed   contraction on Tuesday, the gloomiest reading in 3 years. This   news sent all the major stock indices lower.  Data source: Yahoo! Finance. Shares of beer company   Boston Beer    (NYSE: SAM) and iron ore producer   Cleveland-Cliffs    (NYSE: CLF) suffered even deeper declines than the broader market   as investors digested some news. Seltzer could be a problem for Boston Beer Hard seltzer is having a moment this summer. Sales have   exploded, up something like 200% over the past year, according to   Nielson. This trend is putting pressure on sales of   higher-calorie alcoholic beverages like beer. Boston Beer Company, the brewer behind Samuel Adams beer, has   managed to ride the hard seltzer wave with its Truly brand, which   launched back in 2016. Along with White Claw, Truly has emerged   as one of the leading hard seltzer brands.   Image source: Boston Beer.  Ostensibly, this is good news for Boston Beer. Analysts from   Macquarie even upgraded the stock last month on the premise that   hard seltzer sales would drive earnings higher over the next few   years. But a dissenting view emerged on Tuesday, triggering a   steep sell-off. Shares of Boston Beer were down about 6.1% at 1   p.m. EDT. Analysts at Jefferies downgraded shares of Boston Beer to   \"underperform\" on Tuesday, lowering their price target from $360   to $332. Increasing competition in the hard seltzer market was   the driving force behind to downgrade. The big question is: How loyal will hard seltzer consumers be   to their currently preferred brand? In the same way that sales of   La Croix have come under pressure thanks to competition, Truly   could be displaced by any number of very similar competing   products. Boston Beer benefits from customer loyalty in its core   beer business, but the hard seltzer business could be a different   story. Cleveland-Cliffs sells off after dividend announcement A special dividend is usually viewed as good news by the   market, but that wasn't the case for iron ore miner   Cleveland-Cliffs on Tuesday. The stock was down 13.3% at 1 p.m.   EDT after the market reacted poorly to the company's latest   dividend announcement. Cleveland-Cliffs restarted its regular quarterly dividend last   year as profits began to soar. It raised that dividend by 20% in   May to $0.06 per share. This time around, the company is keeping   its regular quarterly dividend unchanged, but it's paying a   special cash dividend of $0.04 per share. That brings the total   dividend distribution up to $0.10 per share, payable on October   15 to shareholders of record on October 4. The iron ore business is cyclical, with prices hinging on   supply and demand. Cleveland-Cliff's results in recent quarters   have been solid - second-quarter revenue and adjusted earnings   increased. The company   believes iron ore prices will remain high    , boosting its bottom line. Cleveland-Cliffs CEO Lourenco   Goncalves has called the current situation \"The New Normal in the   global iron ore market.\" That sounds an awful lot like \"this time is different.\" The   market doesn't seem to be buying the story - the stock is now   down nearly 40% since peaking in late July. Fears of   a possible recession    in the not-too-distant future may be playing a role. While the   special dividend is a nice bonus for investors, it hasn't changed   the market's mind.   10 stocks we like better than Boston Beer       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now… and Boston Beer wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Timothy Green      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Boston Beer. The Motley Fool has     a     disclosure policy      .  ",
    "A metric tied to U.S. manufacturing activity showed   contraction on Tuesday, the gloomiest reading in 3 years. This   news sent all the major stock indices lower.",
    "Data source: Yahoo! Finance.",
    "Shares of beer company   Boston Beer    (NYSE: SAM) and iron ore producer   Cleveland-Cliffs    (NYSE: CLF) suffered even deeper declines than the broader market   as investors digested some news.",
    "Hard seltzer is having a moment this summer. Sales have   exploded, up something like 200% over the past year, according to   Nielson. This trend is putting pressure on sales of   higher-calorie alcoholic beverages like beer.",
    "Boston Beer Company, the brewer behind Samuel Adams beer, has   managed to ride the hard seltzer wave with its Truly brand, which   launched back in 2016. Along with White Claw, Truly has emerged   as one of the leading hard seltzer brands.",
    "  Image source: Boston Beer. ",
    "Image source: Boston Beer.",
    "Ostensibly, this is good news for Boston Beer. Analysts from   Macquarie even upgraded the stock last month on the premise that   hard seltzer sales would drive earnings higher over the next few   years. But a dissenting view emerged on Tuesday, triggering a   steep sell-off. Shares of Boston Beer were down about 6.1% at 1   p.m. EDT.",
    "Analysts at Jefferies downgraded shares of Boston Beer to   \"underperform\" on Tuesday, lowering their price target from $360   to $332. Increasing competition in the hard seltzer market was   the driving force behind to downgrade.",
    "The big question is: How loyal will hard seltzer consumers be   to their currently preferred brand? In the same way that sales of   La Croix have come under pressure thanks to competition, Truly   could be displaced by any number of very similar competing   products. Boston Beer benefits from customer loyalty in its core   beer business, but the hard seltzer business could be a different   story.",
    "A special dividend is usually viewed as good news by the   market, but that wasn't the case for iron ore miner   Cleveland-Cliffs on Tuesday. The stock was down 13.3% at 1 p.m.   EDT after the market reacted poorly to the company's latest   dividend announcement.",
    "Cleveland-Cliffs restarted its regular quarterly dividend last   year as profits began to soar. It raised that dividend by 20% in   May to $0.06 per share. This time around, the company is keeping   its regular quarterly dividend unchanged, but it's paying a   special cash dividend of $0.04 per share. That brings the total   dividend distribution up to $0.10 per share, payable on October   15 to shareholders of record on October 4.",
    "The iron ore business is cyclical, with prices hinging on   supply and demand. Cleveland-Cliff's results in recent quarters   have been solid - second-quarter revenue and adjusted earnings   increased. The company   believes iron ore prices will remain high    , boosting its bottom line. Cleveland-Cliffs CEO Lourenco   Goncalves has called the current situation \"The New Normal in the   global iron ore market.\"",
    "That sounds an awful lot like \"this time is different.\" The   market doesn't seem to be buying the story - the stock is now   down nearly 40% since peaking in late July. Fears of   a possible recession    in the not-too-distant future may be playing a role. While the   special dividend is a nice bonus for investors, it hasn't changed   the market's mind.",
    "  10 stocks we like better than Boston Beer       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now… and Boston Beer wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Boston Beer       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now… and Boston Beer wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Timothy Green      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Boston Beer. The Motley Fool has     a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:31:00"
}