{
  "url": "https://www.nasdaq.com/article/why-continental-resources-clr-could-be-positioned-for-a-slump-cm1208127",
  "title": "Why Continental Resources (CLR) Could Be Positioned for a Slump - Nasdaq.com",
  "text": [
    "Similar to wise buying decisions, exiting certain underperformers at the right time helps maximize portfolio returns. Selling off losers can be difficult, but if both the share price and estimates are falling, it could be time to get rid of the security before more losses hit your portfolio.\r\n One such stock that you may want to consider dropping is Continental Resources, Inc.CLR , which has witnessed a significant price decline in the past four weeks, and it has seen negative earnings estimate revisions for the current quarter and the current year. A Zacks Rank #5 (Strong Sell) further confirms weakness in CLR.\r\n A key reason for this move has been the negative trend in earnings estimate revisions. For the full year, we have seen nine estimates moving down in the past 30 days, compared with no upward revisions. This trend has caused the consensus estimate to trend lower, going from $2.49 per share a month ago to its current level of $2.34.\r\n Also, for the current quarter, Continental Resources has seen seven downward estimate revisions versus no revisions in the opposite direction, dragging the consensus estimate down to 55 cents a share from 62 cents over the past 30 days.   \r\n The stock also has seen some pretty dismal trading lately, as the share price has dropped 10.7% in the past month.",
    "Continental Resources, Inc. Price and Consensus",
    "Continental Resources, Inc. price-consensus-chart | Continental Resources, Inc. Quote",
    "So it may not be a good decision to keep this stock in your portfolio anymore, at least if you don't have a long time horizon to wait.\r\n If you are still interested in the Oil and Gas - Exploration and Production - United States industry, you may instead consider a better-ranked stock - Halcon Resources Corporation HKRSQ . The stock currently holds a Zacks Rank #1 (Strong Buy) and may be a better selection at this time.It's Illegal in 42 States, But Investors Will Make Billions Legally\r\n In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.\r\n That's twice as much as they spend on marijuana, legally or otherwise.\r\n Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.\r\n See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:20:00"
}