{
  "url": "https://www.nasdaq.com/article/plans-for-trade-talks-cheer-risk-currencies-hit-safehaven-yen-20190905-00065",
  "title": "Plans for trade talks cheer risk currencies, hit safe-haven yen - Nasdaq.com",
  "text": [
    "By Tom Westbrook",
    "SINGAPORE, Sept 5 (Reuters) - China's yuan and the Australian dollar rallied after news on Thursday that China-U.S. trade talks would resume next month, but investors sold the safe haven yen, even though any de-escalation in the trade war would benefit Japanese exporters.",
    "Other factors helping support risk sentiment, were reduced chances of Britain crashing out of the European Union on Oct. 31 without a deal, and a potential breakthrough in the Hong Kong political crisis following a move to withdraw an extradition bill that had sparked mass protests. ",
    "It still leaves Brexit up in the air, with possible outcomes still ranging from a no-deal exit to abandoning the whole endeavour.",
    "The pound sat around $1.2241 and the euro  at $1.1027, mostly holding on to overnight gains.",
    "\"This news has injected a fair amount of optimism in markets,\" said Prashant Newnaha, senior rates strategist at TD Securities in Singapore.",
    "\"It does seem that the markets were positioning more bearishly, and now we've gotten this potential good news and the markets are running with it,\" he said, adding global economic indicators had also recently been showing some green shoots.",
    "Sentiment has been skittish, however, and some analysts sounded a note of caution.",
    "\"The U.S. is still going to raise tariffs next month and December, as far as we know,\" said Joe Capurso, senior currency strategist at the Commonwealth Bank of Australia in Sydney.",
    "\"That's a negative for the world economy and the Chinese economy.\"",
    "The Australian dollar touched a one-month high of $0.6825, seen as a technical resistance level while the New Zealand dollar hit a one-week peak of $0.6377. The trade-exposed won climbed the most of Asia's currencies, rising about 0.5% to 1198.00 per dollar."
  ],
  "published_datetime": "2019-09-05 02:24:00"
}