{
  "url": "https://www.nasdaq.com/article/the-more-streaming-surges-the-better-roku-stock-looks-cm1206949",
  "title": "The More Streaming Surges, the Better Roku Stock Looks - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "There's no denying that Roku (NASDAQ: ROKU ) has been a beast over the last year. Year-to-date, shares of ROKU stock are up over 300% as the streaming kingpin has shifted focus.",
    "Once, just a simple maker of consumer gadgets, Roku has transformed itself into the must-have platform for streaming. This transition has asserted its dominance of the streaming sector. And along with that dominance, the streaming giant has started to seriously monetize its platform in a variety of ways.",
    "The best part is that this could just be the beginning for Roku.",
    "With its continued fast pace of user adoption and several new big streaming services coming down the pike, Roku should be able to keep these new sources of revenue humming alone. And that will be music to investor's ears. Yes, shares of ROKU have surged. But the streaming kingpin can keep its shares rising far into the future. That makes it a big-time buy even at today's levels.",
    "One of the biggest stories right now happens to be Disney (NYSE: DIS ) and the launch of its Disney+ service. But here's the real question? How are you going to access it and get the Star Wars or Hanna Montana content your tween is going crazy for ? The answer quickly is becoming Roku.",
    "The key for Roku is that its devices and now the embedded platform on many televisions. The key is that it's open-source. Everyone's apps and channels work well on the devices and OS. For consumers cutting the cord, Roku has been a blessing. Consumers can watch Hulu , their Disney+ and Netflix (NASDAQ: NFLX ) subscriptions all from the same device.",
    "In fact, Roku hosts more than 5,000 third-party streaming applications. That's made Roku the standard streaming platform. And with active accounts now numbering 30.5 million or about 39% of all streaming households, every streaming service wants to be part of the action.",
    "That's put Roku in a very enviable position. It's the gatekeeper. And the gatekeeper gets to make the rules. In this case, charging streaming networks a 20% to 30% revenue share fee for access to its platform. No wonder why Roku saw its total revenues surge by 59% year-over-year in its latest reported quarter .",
    "But even those great results don't tell the whole picture. Digging in deeper and you can see why ROKU stock still has plenty of gas left in the streaming tank.",
    "As we said, Roku makes most of its money via its platform- about 65% of its total revenues- versus device sales. Lately, the firm has made some serious moves to monetize that further. That has it becoming the next biggest advertising play.",
    "This includes its propriety Roku Channel, which serves as a hub for many shows and movies as well as ads on its homepage/start-up screen. The firm gets a slice of advertising revenue for those non-subscription streaming services such as Cheddar and Crackle that use its platform as well. Here, Roku places ads for the services.",
    "Heck, it even makes a hefty penny by selling the space on its device remotes for dedicated buttons that send viewers directly to a channel.",
    "With the number of active viewers continuing to rise, Roku is pulling in a lot of user data, and it is starting to massage that cache of data in a big way. Every time we click on a movie, watch a show, engage with an ad, Roku starts to build a profile; just like Facebook (NYSE: FB ) does on the web. The Roku Audience Marketplace allows marketers to tap into this trove of data in real-time.",
    "It's no secret that marketers are pulling their ad spend away from more traditional means and placing them on the web and in mobile channels. Unlike traditional cable television upon which advertisers simply buy time during popular shows, streaming can be customized. They want to target specific consumers that are more likely to buy or use a specific product or service. Given the sheer amount of data that Roku users make, it's a virtual goldmine.",
    "And Roku gets a piece of it all. Platform revenues for the firm jumped more than 86% last quarter. Moreover, platform revenues remain very juicy in terms of margins. Roku now makes just over $21 per active user on its network. That's very impressive.",
    "The best part is that Roku has a chance to keep the data/advertising following. Next year promises to be a major one in terms of new streaming services and networks- Disney+ notwithstanding. If they want to play ball, they have to be on Roku's platform. It's simply becoming the standard both via its own devices and as an OS already installed on televisions. That'll allow it to clip more revenues.",
    "With cord-cutting becoming an unstoppable trend, analysts now estimate that the firm will have more than 80 million users by 2025 . That's will allow it to produce more data, which in turn will drive advertising sales.",
    "In the end, ROKU stock has surprised most investors with its strong performance. But we haven't seen anything yet. Like FB and Amazon (NASDAQ: AMZN ), Roku has created something that users can't live without. And now that they are hooked, it's going to make money on them while they enjoy the platform.",
    "With growth rates rivaling NFLX during its heyday, ROKU has lots of years of gains ahead. The stock isn't cheap, but given the growth, it could be a big buy on any pullbacks.",
    "Disclosure: At the time of writing, Aaron Levitt held a Long position in AMZN and ROKU",
    "The post The More Streaming Surges, the Better Roku Stock Looks appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:12:05"
}