{
  "url": "https://www.nasdaq.com/article/lannett-lci-hits-52-week-high-can-the-run-continue-cm1207205",
  "title": "Lannett (LCI) Hits 52-Week High, Can the Run Continue? - Nasdaq.com",
  "text": [
    " Have you been paying attention to shares of Lannett Co (LCI)? Shares have been on the move with the stock up 56.7% over the past month. The stock hit a new 52-week high of $11.21 in the previous session. Lannett Co has gained 106.3% since the start of the year compared to the 1.9% move for the Zacks Medical sector and the 6% return for the Zacks Medical - Drugs industry.  What's Driving the Outperformance?  The stock has a great record of positive earnings surprises, as it hasn't missed our earnings consensus estimate in any of the last four quarters. In its las t earnings  report on August 27, 2019, Lannet t report  ed EPS of $0.37 versus consensus estimate of $0.21 while it beat the consensus revenue estimate by 9.68%. For the current fiscal year, Lannett is expected to post earnings of $1.18 per share on $531.66 million in revenues. This represents a -49.79% change in EPS on a -18.88% change in revenues. For the next fiscal year, the company is expected to earn $1.65 per share on $589.03 million in revenues. This represents a year-over-year change of 39.27% and 10.79%, respectively.  Valuation Metrics  Lannett may be at a 52-week high right now, but what might the future hold for the stock? A key aspect of this question is taking a look at valuation metrics in order to determine if the company has run ahead of itself. On this front, we can look at the Zacks Style Scores, as they provide investors with an additional way to sort through stocks (beyond looking at the Zacks Rank of a security). These styles are represented by grades running from A to F in the categories of Value, Growth, and Momentum, while there is a combined VGM Score as well. The idea behind the style scores is to help investors pick the most appropriate Zacks Rank stocks based on their individual investment style. Lannett has a Value Score of B. The stock's Growth and Momentum Scores are D and A, respectively, giving the company a VGM Score of B. In terms of its value breakdown, the stock currently trades at 8.7X current fiscal year EPS estimates. On a trailing cash flow basis, the stock currently trades at 2.7X versus its peer group's average of 10.9X. This isn't enough to put the company in the top echelon of all stocks we cover from a value perspective.  Zacks Rank  We also need to look at the Zacks Rank for the stock, as this supersedes any trend on the style score front. Fortunately, Lannett currently has a Zacks Rank of #1 (Strong Buy) thanks to rising earnings estimates. Since we recommend that investors select stocks carrying Zacks Rank of 1 (Strong Buy) or 2 (Buy) and Style Scores of A or B, it looks as if Lannett fits the bill. Thus, it seems as though Lannett shares could have a bit more room to run in the near term.  How Does Lannett Stack Up to the Competition?  Shares of Lannett have been moving higher, and the company still appears to be a decent choice, but what about the rest of the industry? Some of its industry peers are also solid potential picks, including Hikma Pharmaceuticals Plc (HKMPF), Catalent (CTLT), and Neurocrine Biosciences (NBIX), all of which currently have a Zacks Rank of at least #2 and a VGM Score of at least B, making them well-rounded choices. The Zacks Industry Rank is in the top 28% of all the industries we have in our universe, so it looks like there are some nice tailwinds for Lannett, even beyond its own solid fundamental situation.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Lannett Co Inc (LCI): Free Stock Analysis Report   Neurocrine Biosciences, Inc. (NBIX): Free Stock Analysis Report   Catalent, Inc. (CTLT): Free Stock Analysis Report   Hikma Pharmaceuticals Plc (HKMPF): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Have you been paying attention to shares of Lannett Co (LCI)? Shares have been on the move with the stock up 56.7% over the past month. The stock hit a new 52-week high of $11.21 in the previous session. Lannett Co has gained 106.3% since the start of the year compared to the 1.9% move for the Zacks Medical sector and the 6% return for the Zacks Medical - Drugs industry.",
    " What's Driving the Outperformance? ",
    "The stock has a great record of positive earnings surprises, as it hasn't missed our earnings consensus estimate in any of the last four quarters. In its las t earnings  report on August 27, 2019, Lannet t report  ed EPS of $0.37 versus consensus estimate of $0.21 while it beat the consensus revenue estimate by 9.68%.",
    "For the current fiscal year, Lannett is expected to post earnings of $1.18 per share on $531.66 million in revenues. This represents a -49.79% change in EPS on a -18.88% change in revenues. For the next fiscal year, the company is expected to earn $1.65 per share on $589.03 million in revenues. This represents a year-over-year change of 39.27% and 10.79%, respectively.",
    " Valuation Metrics ",
    "Lannett may be at a 52-week high right now, but what might the future hold for the stock? A key aspect of this question is taking a look at valuation metrics in order to determine if the company has run ahead of itself.",
    "On this front, we can look at the Zacks Style Scores, as they provide investors with an additional way to sort through stocks (beyond looking at the Zacks Rank of a security). These styles are represented by grades running from A to F in the categories of Value, Growth, and Momentum, while there is a combined VGM Score as well. The idea behind the style scores is to help investors pick the most appropriate Zacks Rank stocks based on their individual investment style.",
    "Lannett has a Value Score of B. The stock's Growth and Momentum Scores are D and A, respectively, giving the company a VGM Score of B.",
    "In terms of its value breakdown, the stock currently trades at 8.7X current fiscal year EPS estimates. On a trailing cash flow basis, the stock currently trades at 2.7X versus its peer group's average of 10.9X. This isn't enough to put the company in the top echelon of all stocks we cover from a value perspective.",
    " Zacks Rank ",
    "We also need to look at the Zacks Rank for the stock, as this supersedes any trend on the style score front. Fortunately, Lannett currently has a Zacks Rank of #1 (Strong Buy) thanks to rising earnings estimates.",
    "Since we recommend that investors select stocks carrying Zacks Rank of 1 (Strong Buy) or 2 (Buy) and Style Scores of A or B, it looks as if Lannett fits the bill. Thus, it seems as though Lannett shares could have a bit more room to run in the near term.",
    " How Does Lannett Stack Up to the Competition? ",
    "Shares of Lannett have been moving higher, and the company still appears to be a decent choice, but what about the rest of the industry? Some of its industry peers are also solid potential picks, including Hikma Pharmaceuticals Plc (HKMPF), Catalent (CTLT), and Neurocrine Biosciences (NBIX), all of which currently have a Zacks Rank of at least #2 and a VGM Score of at least B, making them well-rounded choices.",
    "The Zacks Industry Rank is in the top 28% of all the industries we have in our universe, so it looks like there are some nice tailwinds for Lannett, even beyond its own solid fundamental situation.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:15:08"
}