{
  "url": "https://www.nasdaq.com/article/3-reasons-growth-investors-will-love-hollysys-automation-holi-cm1207241",
  "title": "3 Reasons Growth Investors Will Love Hollysys Automation (HOLI) - Nasdaq.com",
  "text": [
    " Growth investors focus on stocks that are seeing above-average financial growth, as this feature helps these securities garner the market's attention and deliver solid returns. But finding a growth stock that can live up to its true potential can be a tough task. By their very nature, these stocks carry above-average risk and volatility. Moreover, if a company's growth story is over or nearing its end, betting on it could lead to significant loss. However, the task of finding cutting-edge growth stocks is made easy with the help of the Zacks Growth Style Score (part of the Zacks Style Scores  system), which looks beyond the traditional growth attributes to analyze a company's real growth prospects. Our proprietary system currently recommends Hollysys Automation (HOLI) as one such stock. This company not only has a favorable Growth Score, but also carries a top Zacks Rank. Studies have shown that stocks with the best growth features consistently outperform the market. And for stocks that have a combination of a Growth Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 (Buy), returns are even better. Here are three of the most important factors that make the stock of this maker of industrial, rail and subway automation systems a great growth pick right now.  Earnings Growth  Earnings growth is arguably the most important factor, as stocks exhibiting exceptionally surging profit levels tend to attract the attention of most investors. For growth investors, double-digi t earnings  growth is highly preferable, as it is often perceived as an indication of strong prospects (and stock price gains) for the company under consideration. While the historical EPS growth rate for Hollysys Automation is 3.3%, investors should actually focus on the projected growth. The company's EPS is expected to grow 6.2% this year, crushing the industry average, which calls for EPS growth of -11.4%.  Cash Flow Growth  While cash is the lifeblood of any business, higher-than-average cash flow growth is more important and beneficial for growth-oriented companies than for mature companies. That's because, growth in cash flow enables these companies to expand their businesses without depending on expensive outside funds. Right now, year-over-year cash flow growth for Hollysys Automation is 21.4%, which is higher than many of its peers. In fact, the rate compares to the industry average of 10.5%. While investors should actually consider the current cash flow growth, it's worth taking a look at the historical rate too for putting the current reading into proper perspective. The company's annualized cash flow growth rate has been 8.2% over the past 3-5 years versus the industry average of 7.4%.  Promising Earnings Estimate Revisions  Superiority of a stock in terms of the metrics outlined above can be further validated by looking at the trend in earnings estimate revisions. A positive trend is of course favorable here. Empirical research shows that there is a strong correlation between trends in earnings estimate revisions and near-term stock price movements. There have been upward revisions in current-year earnings estimates for Hollysys Automation. The Zacks Consensus Estimate for the current year has surged 4.3% over the past month.  Bottom Line  Hollysys Automation has not only earned a Growth Score of B based on a number of factors, including the ones discussed above, but it also carries a Zacks Rank #1 because of the positive earnings estimate revisions. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  . This combination indicates that Hollysys Automation is a potential outperformer and a solid choice for growth investors.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Hollysys Automation Technologies, Ltd. (HOLI): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Growth investors focus on stocks that are seeing above-average financial growth, as this feature helps these securities garner the market's attention and deliver solid returns. But finding a growth stock that can live up to its true potential can be a tough task.",
    "By their very nature, these stocks carry above-average risk and volatility. Moreover, if a company's growth story is over or nearing its end, betting on it could lead to significant loss.",
    "However, the task of finding cutting-edge growth stocks is made easy with the help of the Zacks Growth Style Score (part of the Zacks Style Scores  system), which looks beyond the traditional growth attributes to analyze a company's real growth prospects.",
    "Our proprietary system currently recommends Hollysys Automation (HOLI) as one such stock. This company not only has a favorable Growth Score, but also carries a top Zacks Rank.",
    "Studies have shown that stocks with the best growth features consistently outperform the market. And for stocks that have a combination of a Growth Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 (Buy), returns are even better.",
    "Here are three of the most important factors that make the stock of this maker of industrial, rail and subway automation systems a great growth pick right now.",
    " Earnings Growth ",
    "Earnings growth is arguably the most important factor, as stocks exhibiting exceptionally surging profit levels tend to attract the attention of most investors. For growth investors, double-digi t earnings  growth is highly preferable, as it is often perceived as an indication of strong prospects (and stock price gains) for the company under consideration.",
    "While the historical EPS growth rate for Hollysys Automation is 3.3%, investors should actually focus on the projected growth. The company's EPS is expected to grow 6.2% this year, crushing the industry average, which calls for EPS growth of -11.4%.",
    " Cash Flow Growth ",
    "While cash is the lifeblood of any business, higher-than-average cash flow growth is more important and beneficial for growth-oriented companies than for mature companies. That's because, growth in cash flow enables these companies to expand their businesses without depending on expensive outside funds.",
    "Right now, year-over-year cash flow growth for Hollysys Automation is 21.4%, which is higher than many of its peers. In fact, the rate compares to the industry average of 10.5%.",
    "While investors should actually consider the current cash flow growth, it's worth taking a look at the historical rate too for putting the current reading into proper perspective. The company's annualized cash flow growth rate has been 8.2% over the past 3-5 years versus the industry average of 7.4%.",
    " Promising Earnings Estimate Revisions ",
    "Superiority of a stock in terms of the metrics outlined above can be further validated by looking at the trend in earnings estimate revisions. A positive trend is of course favorable here. Empirical research shows that there is a strong correlation between trends in earnings estimate revisions and near-term stock price movements.",
    "There have been upward revisions in current-year earnings estimates for Hollysys Automation. The Zacks Consensus Estimate for the current year has surged 4.3% over the past month.",
    " Bottom Line ",
    "Hollysys Automation has not only earned a Growth Score of B based on a number of factors, including the ones discussed above, but it also carries a Zacks Rank #1 because of the positive earnings estimate revisions.",
    "You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .",
    "This combination indicates that Hollysys Automation is a potential outperformer and a solid choice for growth investors.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:45:07"
}