{
  "url": "https://www.nasdaq.com/article/aegn-or-ssd-which-is-the-better-value-stock-right-now-cm1210432",
  "title": "AEGN or SSD: Which Is the Better Value Stock Right Now? - Nasdaq.com",
  "text": [
    " Investors interested in Building Products - Miscellaneous stocks are likely familiar with Aegion (AEGN) and Simpson Manufacturing (SSD). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look. Everyone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits. Aegion has a Zacks Rank of #2 (Buy), while Simpson Manufacturing has a Zacks Rank of #5 (Strong Sell) right now. This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that AEGN is likely seeing its earnings outlook improve to a greater extent. But this is only part of the picture for value investors. Value investors also try to analyze a wide range of traditional figures and metrics to help determine whether a company is undervalued at its current share price levels. Our Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use. AEGN currently has a forward P/E ratio of 16.82, while SSD has a forward P/E of 24.39. We also note that AEGN has a PEG ratio of 1.68. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. SSD currently has a PEG ratio of 4.88. Another notable valuation metric for AEGN is its P/B ratio of 1.49. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, SSD has a P/B of 3.43. These metrics, and several others, help AEGN earn a Value grade of B, while SSD has been given a Value grade of F. AEGN sticks out from SSD in both our Zacks Rank and Style Scores models, so value investors will likely feel that AEGN is the better option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Aegion Corporation (AEGN): Free Stock Analysis Report   Simpson Manufacturing Company, Inc. (SSD): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors interested in Building Products - Miscellaneous stocks are likely familiar with Aegion (AEGN) and Simpson Manufacturing (SSD). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look.",
    "Everyone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits.",
    "Aegion has a Zacks Rank of #2 (Buy), while Simpson Manufacturing has a Zacks Rank of #5 (Strong Sell) right now. This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that AEGN is likely seeing its earnings outlook improve to a greater extent. But this is only part of the picture for value investors.",
    "Value investors also try to analyze a wide range of traditional figures and metrics to help determine whether a company is undervalued at its current share price levels.",
    "Our Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use.",
    "AEGN currently has a forward P/E ratio of 16.82, while SSD has a forward P/E of 24.39. We also note that AEGN has a PEG ratio of 1.68. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. SSD currently has a PEG ratio of 4.88.",
    "Another notable valuation metric for AEGN is its P/B ratio of 1.49. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, SSD has a P/B of 3.43.",
    "These metrics, and several others, help AEGN earn a Value grade of B, while SSD has been given a Value grade of F.",
    "AEGN sticks out from SSD in both our Zacks Rank and Style Scores models, so value investors will likely feel that AEGN is the better option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:40:14"
}