{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-xperi-onemain-waddell-reed-target-and-consolidated-communications-cm1206600",
  "title": "The Zacks Analyst Blog Highlights: Xperi, OneMain, Waddell & Reed, Target and Consolidated Communications - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 3, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Xperi Corporation XPER  , OneMain Holdings, Inc. OMF  , Waddell & Reed Financial, Inc. WDR  , Target Corporation TGT  and Consolidated Communications Holdings, Inc. CNSL  .  Here are highlights from Friday's Analyst Blog:    5 Value Picks That Will Go a Long Way   Value investing is about picking stocks that are trading below their intrinsic value. It should have been easy enough to do, through a comparison of the price to earnings multiple of the company and its peer group (or the S&P 500), or any other criterion you prefer to use for comparison. But of course it isn't that simple, or everyone would have been doing it. The tricky part is in understanding the fair valuation of the stock you're considering. Because, for all you know, the company doesn't have very bright prospects, or there are some big-time headwinds it's facing that aren't affecting the others in the group. And that's what could be keeping the pressure on prices. So how so we know whether a stock is worth putting money into? Obviously, in the current scenario, where there are significant market uncertainties, regular recession warnings and trade war concerns, as well as elevated share prices, one thing you want to avoid is getting into stocks that are headed down. Or extremely risky ventures like Tesla for example, that could either silence all critics or fall flat on its face. True, value investing is for the long haul, you aren't expecting to get rich overnight. But you just don't want to get caught in something like that. So what you basically need is a tried and tested formula that will fetch you guaranteed returns. And that's exactly what the Zacks Value Score for stocks brings you, especially when combined with buy (#1 or #2) ranked stocks.  You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   . So here are a few I've selected that should generate long-term gains. And just in case you need some funds in the interim, they also pay a nice dividend.  Xperi Corporation  Xperi Corporation, formerly Tessera Holding Corporation is a product and technology licensing company which manufactures semiconductors and related products. Its technologies and intellectual property are deployed in areas such as premium audio, computational imaging, computer vision, mobile computing and communications, memory, data storage, 3D semiconductor interconnect and packaging. The company reported revenue and earnings of $92 million and $0.57, respectively in the last quarter. Revenue was 2.3% ahead of the Zacks Consensus Estimates while earnings exceeded by 21.3%. Other details- Zacks Rank #1 Value Score A, VGM Score A Current year earnings estimate up 11.4% in the last 4 weeks, 2020 earnings estimate up 5.0% Dividend yield 4.5%  OneMain Holdings, Inc.  OneMain Holdings Inc. is a consumer-facing financial services holding company. Its operating segments consist of Consumer and Insurance, Acquisitions and Servicing and Real Estate. The company was formerly known as Springleaf Holdings, Inc. OMF reported revenue of $762 million in the last quarter that topped the Zacks Consensus Estimate by 2.5%. Earnings of $1.62 topped by 20.0%. Other details- Zacks Rank #1 Value Score A, VGM Score A Current year earnings estimate up 6.8% in the last 4 weeks, 2020 earnings estimate up 4.8% Dividend yield 2.8%  Waddell & Reed Financial, Inc.  Waddell & Reed Financial, Inc. is the exclusive underwriter and distributor of 41 mutual fund portfolios, including 18 comprising Waddell & Reed Advisors Funds (formerly the United Group of Mutual Funds) and 12 comprising W&R Funds (formerly Waddell & Reed Funds, Inc.). The remaining 11 portfolios comprise the W&R Target Funds, which serve as the underlying investment portfolios for variable annuities and variable life insurance products underwritten by United Investors Life Insurance Company and distributed by Waddell & Reed. Waddell reported revenue of $270 million that beat the Zacks Consensus Estimate of $266 million by 1.7% and earnings of 42 cents that topped the Zacks Consensus Estimate of 37 cents by 13.5% Other details- Zacks Rank #1 Value Score A, VGM Score A Current year earnings estimate up 5.4% in the last 4 weeks, 2020 earnings estimate up 3.8% Dividend yield 6.4%  Target Corporation  Target Corporation operates large-format general merchandise and food discount stores in the U.S., which include Target and SuperTarget stores. It offers both everyday essentials and fashionable, differentiated merchandise at attractive prices. The customer-focused business model is supported by a strong supply chain and technology infrastructure. Despite its size, the company has a single operating segment having integrated both its credit card operations and online business, Target.com into it. Although Target.com is small relative to the company's overall size, its sales are growing at a much faster pace than in-store sales, strongly supplementing its stores and credit card operations. Targe t report  ed revenue of $18.42 billion in the last quarter compared to the Zacks Consensus Estimate of $18.33 billion. Earnings of $1.82 also compared favorably with the Zacks Consensus Estimate of $1.61. Other details- Zacks Rank #2 Value Score A, VGM Score A Current year earnings estimate up 3.5% in the last 4 weeks, 2020 earnings estimate up 2.6% Dividend yield 2.5%  Consolidated Communications Holdings, Inc.  Consolidated Communications Holdings, Inc. offers a wide range of telecommunications services including local and long distance telephone, digital phone, high-speed Internet access and digital TV to individuals and businesses in Illinois, Pennsylvania, and Texas. The company also offers telephone directory publishing services, wholesale transport services, billing and collection services, inside wiring services, and maintenance services. Consolidated Communications reported revenue of $334 million that was just ahead of the estimated $333 million. The 5-cent loss was better than the estimated loss of 8 cents. Other details- Zacks Rank #2 Value Score A, VGM Score A Estimated loss per share in 2019 up from 11 cents to 6 cents in in the last 4 weeks, for 2020, estimated EPS is up from 41.7% Dividend yield 37.3%  Today's Best Stocks from Zacks  Would you like to see the updated picks from our best market-beating strategies? From 2017 through 2018, while the S&P 500 gained +15.8%, five of our screens returned +38.0%, +61.3%, +61.6%, +68.1%, and +98.3%. This outperformance has not just been a recent phenomenon. From 2000 - 2018, while the S&P averaged +4.8% per year, our top strategies averaged up to +56.2% per year.   See their latest picks free >>   Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Tessera Holding Corporation (XPER): Free Stock Analysis Report   OneMain Holdings, Inc. (OMF): Free Stock Analysis Report   Waddell & Reed Financial, Inc. (WDR): Free Stock Analysis Report   Target Corporation (TGT): Free Stock Analysis Report   Consolidated Communications Holdings, Inc. (CNSL): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 3, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Xperi Corporation XPER  , OneMain Holdings, Inc. OMF  , Waddell & Reed Financial, Inc. WDR  , Target Corporation TGT  and Consolidated Communications Holdings, Inc. CNSL  .",
    " Here are highlights from Friday's Analyst Blog: ",
    "  5 Value Picks That Will Go a Long Way  ",
    "Value investing is about picking stocks that are trading below their intrinsic value. It should have been easy enough to do, through a comparison of the price to earnings multiple of the company and its peer group (or the S&P 500), or any other criterion you prefer to use for comparison.",
    "But of course it isn't that simple, or everyone would have been doing it. The tricky part is in understanding the fair valuation of the stock you're considering. Because, for all you know, the company doesn't have very bright prospects, or there are some big-time headwinds it's facing that aren't affecting the others in the group. And that's what could be keeping the pressure on prices.",
    "So how so we know whether a stock is worth putting money into? Obviously, in the current scenario, where there are significant market uncertainties, regular recession warnings and trade war concerns, as well as elevated share prices, one thing you want to avoid is getting into stocks that are headed down. Or extremely risky ventures like Tesla for example, that could either silence all critics or fall flat on its face. True, value investing is for the long haul, you aren't expecting to get rich overnight. But you just don't want to get caught in something like that.",
    "So what you basically need is a tried and tested formula that will fetch you guaranteed returns. And that's exactly what the Zacks Value Score for stocks brings you, especially when combined with buy (#1 or #2) ranked stocks.  You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "So here are a few I've selected that should generate long-term gains. And just in case you need some funds in the interim, they also pay a nice dividend.",
    " Xperi Corporation ",
    "Xperi Corporation, formerly Tessera Holding Corporation is a product and technology licensing company which manufactures semiconductors and related products. Its technologies and intellectual property are deployed in areas such as premium audio, computational imaging, computer vision, mobile computing and communications, memory, data storage, 3D semiconductor interconnect and packaging.",
    "The company reported revenue and earnings of $92 million and $0.57, respectively in the last quarter. Revenue was 2.3% ahead of the Zacks Consensus Estimates while earnings exceeded by 21.3%.",
    "Other details-",
    "Zacks Rank #1",
    "Value Score A, VGM Score A",
    "Current year earnings estimate up 11.4% in the last 4 weeks, 2020 earnings estimate up 5.0% Dividend yield 4.5%",
    " OneMain Holdings, Inc. ",
    "OneMain Holdings Inc. is a consumer-facing financial services holding company. Its operating segments consist of Consumer and Insurance, Acquisitions and Servicing and Real Estate. The company was formerly known as Springleaf Holdings, Inc.",
    "OMF reported revenue of $762 million in the last quarter that topped the Zacks Consensus Estimate by 2.5%. Earnings of $1.62 topped by 20.0%.",
    "Other details-",
    "Zacks Rank #1",
    "Value Score A, VGM Score A",
    "Current year earnings estimate up 6.8% in the last 4 weeks, 2020 earnings estimate up 4.8% Dividend yield 2.8%",
    " Waddell & Reed Financial, Inc. ",
    "Waddell & Reed Financial, Inc. is the exclusive underwriter and distributor of 41 mutual fund portfolios, including 18 comprising Waddell & Reed Advisors Funds (formerly the United Group of Mutual Funds) and 12 comprising W&R Funds (formerly Waddell & Reed Funds, Inc.).",
    "The remaining 11 portfolios comprise the W&R Target Funds, which serve as the underlying investment portfolios for variable annuities and variable life insurance products underwritten by United Investors Life Insurance Company and distributed by Waddell & Reed.",
    "Waddell reported revenue of $270 million that beat the Zacks Consensus Estimate of $266 million by 1.7% and earnings of 42 cents that topped the Zacks Consensus Estimate of 37 cents by 13.5%",
    "Other details-",
    "Zacks Rank #1",
    "Value Score A, VGM Score A",
    "Current year earnings estimate up 5.4% in the last 4 weeks, 2020 earnings estimate up 3.8% Dividend yield 6.4%",
    " Target Corporation ",
    "Target Corporation operates large-format general merchandise and food discount stores in the U.S., which include Target and SuperTarget stores. It offers both everyday essentials and fashionable, differentiated merchandise at attractive prices. The customer-focused business model is supported by a strong supply chain and technology infrastructure.",
    "Despite its size, the company has a single operating segment having integrated both its credit card operations and online business, Target.com into it. Although Target.com is small relative to the company's overall size, its sales are growing at a much faster pace than in-store sales, strongly supplementing its stores and credit card operations.",
    "Targe t report  ed revenue of $18.42 billion in the last quarter compared to the Zacks Consensus Estimate of $18.33 billion. Earnings of $1.82 also compared favorably with the Zacks Consensus Estimate of $1.61.",
    "Other details-",
    "Zacks Rank #2",
    "Value Score A, VGM Score A",
    "Current year earnings estimate up 3.5% in the last 4 weeks, 2020 earnings estimate up 2.6% Dividend yield 2.5%",
    " Consolidated Communications Holdings, Inc. ",
    "Consolidated Communications Holdings, Inc. offers a wide range of telecommunications services including local and long distance telephone, digital phone, high-speed Internet access and digital TV to individuals and businesses in Illinois, Pennsylvania, and Texas. The company also offers telephone directory publishing services, wholesale transport services, billing and collection services, inside wiring services, and maintenance services.",
    "Consolidated Communications reported revenue of $334 million that was just ahead of the estimated $333 million. The 5-cent loss was better than the estimated loss of 8 cents.",
    "Other details-",
    "Zacks Rank #2",
    "Value Score A, VGM Score A",
    "Estimated loss per share in 2019 up from 11 cents to 6 cents in in the last 4 weeks, for 2020, estimated EPS is up from 41.7%",
    "Dividend yield 37.3%",
    " Today's Best Stocks from Zacks ",
    "Would you like to see the updated picks from our best market-beating strategies? From 2017 through 2018, while the S&P 500 gained +15.8%, five of our screens returned +38.0%, +61.3%, +61.6%, +68.1%, and +98.3%.",
    "This outperformance has not just been a recent phenomenon. From 2000 - 2018, while the S&P averaged +4.8% per year, our top strategies averaged up to +56.2% per year.",
    "  See their latest picks free >>  ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:17:00"
}