{
  "url": "https://www.nasdaq.com/article/venezuela-military-exercises-on-border-a-threat-colombia-minister-20190904-00914",
  "title": "Venezuela military exercises on border a 'threat' -Colombia minister - Nasdaq.com",
  "text": [
    "BOGOTA, Sept 4 (Reuters) - Venezuela's planned border military exercises are a direct threat to regional stability, Colombia's foreign minister said on Wednesday, as the neighboring countries renewed their frequent verbal sparring over security.",
    "Venezuelan President Nicolas Maduro late on Tuesday ordered the armed forces to be on alert for a potential attack by Colombia and announced military exercises on the border, after a group of former guerrilla commanders said they would rearm. ",
    "Former Revolutionary Armed Forces of Colombia (FARC) guerillas last week announced a rearmament in a video that Colombian authorities believe was filmed in Venezuela, spurring concern of a worsening of the Colombian armed conflict and expansion of armed groups in Venezuela.",
    "\"The dictatorial regime (of Maduro) favors the presence in its territory of terrorist organizations, not just Colombian ones, but from other parts of the world,\" Trujillo added.",
    "The two countries, which shared a 2,219 km (1,378 mile) border, have been frequently at odds over the past decade and do not maintain diplomatic relations.",
    "Colombia is the top destination for Venezuelan migrants fleeing that country's long-running economic and political crisis, which has caused widespread shortages of food and medicine. Some 1.4 million Venezuelans live in Colombia.",
    "Colombia has repeatedly denied any plans to attack Venezuela or allow the United States to launch attacks from its territory, despite repeated accusations by Maduro.",
    "Venezuela's foreign ministry has blamed the dissident rearmament on Colombia President Ivan Duque's failure to follow through on the peace accords. Maduro previously said that former rebel commanders are welcome in Venezuela. ",
    "The peace accord between the FARC and Colombia has led to the demobilization of more than 13,000 rebels, including some 7,000 combatants.",
    "The FARC, now a legal political party, has condemned the rearmament of some of its former members."
  ],
  "published_datetime": "2019-09-04 01:15:00"
}