{
  "url": "https://www.nasdaq.com/article/danahers-envista-sets-terms-for-602-million-ipo-cm1207074",
  "title": "Danaher's Envista sets terms for $602 million IPO - Nasdaq.com",
  "text": [
    " Envista Holdings, the dental supplies and equipment unit being carved out of Danaher, announced terms for its IPO on Wednesday.    The Brea, CA-based company plans to raise $602 million by offering 26.8 million shares at a price range of $21 to $24. At the midpoint of the proposed range, Envista Holdings would command a market value of $3.5 billion.    Envista Holdings traces its roots to 2004 and booked $2.8 billion in sales for the 12 months ended June 30, 2019. It plans to list on the NYSE under the symbol NVST. J.P. Morgan, Goldman Sachs, Morgan Stanley, Baird, Evercore ISI and Jefferies are the joint bookrunners on the deal. It is expected to price during the week of September 16, 2019.    The article Danaher's Envista sets terms for $602 million IPO  originally appeared on IPO investment manager Renaissance Capital's web site renaissancecapital.com.   Investment Disclosure:  The information and opinions expressed herein were prepared by Renaissance Capital's research analysts and do not constitute an offer to buy or sell any security. Renaissance Capital's Renaissance IPO ETF (symbol: IPO)  , Renaissance International ETF (symbol: IPOS)  , or separately managed institutional accounts may have investments in securities of companies mentioned.",
    "Envista Holdings, the dental supplies and equipment unit being carved out of Danaher, announced terms for its IPO on Wednesday.    The Brea, CA-based company plans to raise $602 million by offering 26.8 million shares at a price range of $21 to $24. At the midpoint of the proposed range, Envista Holdings would command a market value of $3.5 billion.    Envista Holdings traces its roots to 2004 and booked $2.8 billion in sales for the 12 months ended June 30, 2019. It plans to list on the NYSE under the symbol NVST. J.P. Morgan, Goldman Sachs, Morgan Stanley, Baird, Evercore ISI and Jefferies are the joint bookrunners on the deal. It is expected to price during the week of September 16, 2019.  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:42:00"
}