{
  "url": "https://www.nasdaq.com/article/new-store-growth-helps-conns-book-record-second-quarter-earnings-cm1206964",
  "title": "New Store Growth Helps Conn's Book Record Second-Quarter Earnings - Nasdaq.com",
  "text": [
    " Specialty retailer   Conn's    (NASDAQ: CONN)  reported record quarterly earnings per share   in its fiscal second quarter of 2020, in results released before   markets opened on Tuesday. The furniture, appliances, and   consumer credit chain also signaled imminent relief from a weight   on comparable-store sales. We'll discuss the all-important metric   of comps below, along with other crucial details from the   quarter. Note that all comparative numbers that follow refer to   those of the prior-year quarter. Conn's: The raw numbers  Data source: Conn's. What happened with Conn's this quarter?  Retail sales rose 3.3% to $306.1 million, led by new store     openings. The company added four locations during the quarter,     bringing its total to 131. Additional sales from new locations compensated for a     decline in same-store sales. Comps were pressured by areas hit     by Hurricane Harvey; stronger sales over the last two years in     these markets have made for tough comparisons this year, as     recovery activities from the 2017 storm wind down. Comps in     Harvey-impacted markets slumped by 9.3%, while all other     markets collectively managed a comps increase of 0.4%. Retail     gross margin       slipped by 90     basis points       to 40.5%. Conn's consumer credit segment improved revenue by 7.5% to     $94.8 million. Management attributed the increase primarily to     robust origination of Conn's high-yielding direct consumer loan     product, and higher average customer receivable balances. The consumer credit segment's provision for bad debts     decreased by 1.5% to $49.8 million. Coupled with higher revenue     and lower selling, general, and administrative (SG&A)     expenses as a percentage of fee income, the lower loss     provision helped cut the segment's pre-tax quarterly loss     roughly in half, to $8.7 million. Consolidated SG&A expense crept up just 40 basis points     despite the company's higher quarterly sales, to 31.8%. Conn's     exerted tight cost discipline across the board, as consolidated     operating margin      improved by 20 basis points to 10.4%. Conn's overall net income and EPS also benefited from lower     interest expense, which declined by $1.2 million to $14.4     million, due to early retirement of debt in the previous     year. The company repurchased $34.3 million of its own shares     during the second quarter, marking its first share buyback     during the fiscal year.    Image source: Getty Images.makeArticleAd();  What management had to say In Conn's' earnings press release, CEO Norm Miller detailed   factors behind the company's performance, and pointed to   significantly higher comps in the coming quarters. Miller also   announced Conn's plans for expansion into a vibrant market. This   information, along with strong earnings and a healthy outlook,   propelled shares 18% higher in the afternoon trading session on   Tuesday, as investors warmed to its viability as   a consumer goods investment    for the back half of the year. Miller said:  Retail sales growth as a result of new store openings,     strong retail profitability, and favorable credit performance     drove record second-quarter earnings of $0.62 per diluted     share. Our e-commerce sales are quickly ramping, and we are     well positioned to serve our customers online as we expand our     geographic footprint. During the second half of this fiscal     year, we expect to lap the benefits Hurricane Harvey rebuilding     efforts had on same-store sales, which have impacted the     year-over-year sales comparison over the past four     quarters.        With strong operating performance and financial results, I am     excited to announce our plans to enter the Florida market next     fiscal year. We believe that the State of Florida can support     over 40 Conn's HomePlus locations once fully penetrated.     Positive momentum is accelerating across our business, and we     believe fiscal year 2020 is shaping up to be a year of strong     earnings and operational growth.  Looking forward Looking ahead to the fiscal third quarter, Conn's expects   year-over-year retail sales growth of 4% to 8%, and comps results   between a 3% decline and a 1% gain. Markets impacted by Harvey   are anticipated to post a comps decline of between 4% and 8%,   while all other markets are slated to see comps results between a   2% decline and a 2% gain. Consumer segment revenue is pegged to land in a range of $94   million to $98 million. Conn's doesn't provide forward EPS or net   income guidance, but it does outline expected SG&A expense,   which should fall between 32.25% and 33.25% of total revenue next   quarter.   10 stocks we like better than Conn's       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Conn's wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Asit Sharma      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Specialty retailer   Conn's    (NASDAQ: CONN)  reported record quarterly earnings per share   in its fiscal second quarter of 2020, in results released before   markets opened on Tuesday. The furniture, appliances, and   consumer credit chain also signaled imminent relief from a weight   on comparable-store sales. We'll discuss the all-important metric   of comps below, along with other crucial details from the   quarter. Note that all comparative numbers that follow refer to   those of the prior-year quarter.",
    "Data source: Conn's.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "In Conn's' earnings press release, CEO Norm Miller detailed   factors behind the company's performance, and pointed to   significantly higher comps in the coming quarters. Miller also   announced Conn's plans for expansion into a vibrant market. This   information, along with strong earnings and a healthy outlook,   propelled shares 18% higher in the afternoon trading session on   Tuesday, as investors warmed to its viability as   a consumer goods investment    for the back half of the year. Miller said:",
    "Retail sales growth as a result of new store openings,     strong retail profitability, and favorable credit performance     drove record second-quarter earnings of $0.62 per diluted     share. Our e-commerce sales are quickly ramping, and we are     well positioned to serve our customers online as we expand our     geographic footprint. During the second half of this fiscal     year, we expect to lap the benefits Hurricane Harvey rebuilding     efforts had on same-store sales, which have impacted the     year-over-year sales comparison over the past four     quarters.",
    "       With strong operating performance and financial results, I am     excited to announce our plans to enter the Florida market next     fiscal year. We believe that the State of Florida can support     over 40 Conn's HomePlus locations once fully penetrated.     Positive momentum is accelerating across our business, and we     believe fiscal year 2020 is shaping up to be a year of strong     earnings and operational growth.",
    "Looking ahead to the fiscal third quarter, Conn's expects   year-over-year retail sales growth of 4% to 8%, and comps results   between a 3% decline and a 1% gain. Markets impacted by Harvey   are anticipated to post a comps decline of between 4% and 8%,   while all other markets are slated to see comps results between a   2% decline and a 2% gain.",
    "Consumer segment revenue is pegged to land in a range of $94   million to $98 million. Conn's doesn't provide forward EPS or net   income guidance, but it does outline expected SG&A expense,   which should fall between 32.25% and 33.25% of total revenue next   quarter.",
    "  10 stocks we like better than Conn's       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Conn's wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Conn's       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Conn's wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Asit Sharma      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 17:21:00"
}