{
  "url": "https://www.nasdaq.com/article/ceos-say-south-africa-is-years-from-meaningful-economic-recovery-20190905-00169",
  "title": "CEOs say South Africa is years from meaningful economic recovery - Nasdaq.com",
  "text": [
    "JOHANNESBURG, Sept 5 (Reuters) - The heads of two major South African financial firms said on Thursday that a meaningful recovery was years away for an economy that has been in the doldrums for a decade.",
    "Africa's most developed economy shrank 3.2%, its worst contraction in a decade, in the first quarter, while unemployment has hit an 11-year high, and hefty government debts, difficulties at state-run firms and power cuts have all knocked confidence. ",
    "\"It's beyond urgent now,\" Alan Pullinger, CEO of FirstRand , South Africa's biggest retail bank by market share, told Reuters after the bank reported a 5% rise in full-year profits.",
    "\"For us to expect meaningful improvement, I think we're talking five years,\" he said.",
    "Since being knocked off course by the global financial crisis, South Africa has never made it back to pre-2008 levels of growth of over 5% - the amount its 2030 National Development Plan says is needed for sustainable expansion and job creation. ",
    "Firms in sectors from finance to retail have struggled after a decade of corruption and mismanagement of state enterprises during the presidency of Jacob Zuma.",
    "Since succeeding Zuma in February 2018, Cyril Ramaphosa has staked his reputation on fixing those problems.",
    "However, early optimism has faded as the scale of the task has become clearer and ongoing problems, for instance at the state power firm Eskom, have intensified.",
    "DEEP DAMAGE",
    "South Africa's biggest insurer Sanlam  also reported interim results, with profits falling 35%, mostly due to one-off costs. ",
    "Like Pullinger, its CEO Ian Kirk said a surprise rebound in GDP growth to 3.1% in the second quarter was likely to be short-lived.",
    "Public Enterprises Minister Pravin Gordhan recently spoke of a recovery period of 18-24 months, but Kirk said: \"I think it's more serious. The damage is quite deep, the recovery period will be longer.\"",
    "FirstRand called for numerous reforms to avoid South Africa losing its last investment grade credit rating, from Moody's. Fitch and S&P have already downgraded its sovereign rating to 'junk' status. ",
    "Despite the economic climate, FirstRand's retail division increased earnings by 10%, while many peers barely grew at all.",
    "However, a weaker performance at its corporate and investment bank (CIB), car finance unit and in the group treasury weighed on overall headline earnings per share (HEPS) - the main profit measure in South Africa.",
    "Its diluted HEPS stood at 497.2 cents in the year to June 30, compared to 472.7 cents a year earlier.",
    "The bank's shares were up 2.75% at 0842 GMT.\n ($1 = 15.2369 rand)"
  ],
  "published_datetime": "2019-09-05 03:25:00"
}