{
  "url": "https://www.nasdaq.com/article/are-you-looking-for-a-high-growth-dividend-stock-fnf-group-fnf-could-be-a-great-choice-cm1210469",
  "title": "Are You Looking for a High-Growth Dividend Stock? FNF Group (FNF) Could Be a Great Choice - Nasdaq.com",
  "text": [
    " All investors love getting big returns from their portfolio, whether it's through stocks, bonds, ETFs, or other types of securities. But for income investors, generating consistent cash flow from each of your liquid investments is your primary focus. While cash flow can come from bond interest or interest from other types of investments, income investors hone in on dividends. A dividend is the distribution of a company's earnings paid out to shareholders; it's often viewed by its dividend yield, a metric that measures a dividend as a percent of the current stock price. Many academic studies show tha t dividends  make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.  FNF Group in Focus  Based in Jacksonville, FNF Group (FNF) is in the Finance sector, and so far this year, shares have seen a price change of 40.78%. The provider of title insurance and mortgage services is paying out a dividend of $0.31 per share at the moment, with a dividend yield of 2.8% compared to the Insurance - Property and Casualty industry's yield of 1.24% and the S&P 500's yield of 1.9%. In terms of dividend growth, the company's current annualized dividend of $1.24 is up 3.3% from last year. FNF Group has increased its dividend 5 times on a year-over-year basis over the last 5 years for an average annual increase of 13.85%. Future dividend growth will depend on earnings growth as well as payout ratio, which is the proportion of a company's annual earnings per share that it pays out as a dividend. FNF Group's current payout ratio is 45%. This means it paid out 45% of its trailing 12-month EPS as dividend. Earnings growth looks solid for FNF for this fiscal year. The Zacks Consensus Estimate for 2019 is $2.94 per share, with earnings expected to increase 8.89% from the year ago period.  Bottom Line  Investors like dividends for many reasons; they greatly improve stock investing profits, decrease overall portfolio risk, and carry tax advantages, among others. It's important to keep in mind that not all companies provide a quarterly payout. High-growth firms or tech start-ups, for example, rarely provide their shareholders a dividend, while larger, more established companies that have more secure profits are often seen as the best dividend options. Income investors must be conscious of the fact that high-yielding stocks tend to struggle during periods of rising interest rates. With that in mind, FNF is a compelling investment opportunity. Not only is it a strong dividend play, but the stock currently sits at a Zacks Rank of 3 (Hold).   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Fidelity National Financial, Inc. (FNF): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "All investors love getting big returns from their portfolio, whether it's through stocks, bonds, ETFs, or other types of securities. But for income investors, generating consistent cash flow from each of your liquid investments is your primary focus.",
    "While cash flow can come from bond interest or interest from other types of investments, income investors hone in on dividends. A dividend is the distribution of a company's earnings paid out to shareholders; it's often viewed by its dividend yield, a metric that measures a dividend as a percent of the current stock price. Many academic studies show tha t dividends  make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.",
    " FNF Group in Focus ",
    "Based in Jacksonville, FNF Group (FNF) is in the Finance sector, and so far this year, shares have seen a price change of 40.78%. The provider of title insurance and mortgage services is paying out a dividend of $0.31 per share at the moment, with a dividend yield of 2.8% compared to the Insurance - Property and Casualty industry's yield of 1.24% and the S&P 500's yield of 1.9%.",
    "In terms of dividend growth, the company's current annualized dividend of $1.24 is up 3.3% from last year. FNF Group has increased its dividend 5 times on a year-over-year basis over the last 5 years for an average annual increase of 13.85%. Future dividend growth will depend on earnings growth as well as payout ratio, which is the proportion of a company's annual earnings per share that it pays out as a dividend. FNF Group's current payout ratio is 45%. This means it paid out 45% of its trailing 12-month EPS as dividend.",
    "Earnings growth looks solid for FNF for this fiscal year. The Zacks Consensus Estimate for 2019 is $2.94 per share, with earnings expected to increase 8.89% from the year ago period.",
    " Bottom Line ",
    "Investors like dividends for many reasons; they greatly improve stock investing profits, decrease overall portfolio risk, and carry tax advantages, among others. It's important to keep in mind that not all companies provide a quarterly payout.",
    "High-growth firms or tech start-ups, for example, rarely provide their shareholders a dividend, while larger, more established companies that have more secure profits are often seen as the best dividend options. Income investors must be conscious of the fact that high-yielding stocks tend to struggle during periods of rising interest rates. With that in mind, FNF is a compelling investment opportunity. Not only is it a strong dividend play, but the stock currently sits at a Zacks Rank of 3 (Hold).",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:15:11"
}