{
  "url": "https://www.nasdaq.com/article/where-are-wearables-and-smart-speakers-in-2019-cm1206813",
  "title": "Where Are Wearables and Smart Speakers in 2019? - Nasdaq.com",
  "text": [
    "In this week's episode of Industry Focus: Tech , host Dylan Lewis and Motley Fool contributor Evan Niu check in on two consumer goods tech markets. First, they chat about smart speakers. The U.S. marketplace is starting to look a little tapped out on the smart-speaker front, and producers are seeking growth elsewhere. As a result, Baidu (NASDAQ: BIDU)  is coming in hot as a top seller. Apple (NASDAQ: AAPL) , unfortunately, still hasn't cracked the market in any meaningful way. What Apple has cracked, though, is wearables, where the Watch dominates the competition. Tune in to learn where both of these market spaces are going, what the trends mean for the future, how companies like Amazon.com (NASDAQ: AMZN) , Fitbit (NYSE: FIT) , and Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG)  fit in, how product differentiation can make or break these producers, and more.",
    "To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center . A full transcript follows the video.",
    "10 stocks we like better than Walmart\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, the Motley Fool Stock Advisor, has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks  for investors to buy right now... and Walmart wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "Click here  to learn about these picks!",
    "*Stock Advisor returns as of June 1, 2019\r\n The author(s) may have a position in any stocks mentioned.",
    "This video was recorded on Aug. 30, 2019.",
    "Dylan Lewis: Welcome to Industry Focus , the podcast that dives into a different sector of the stock market every day. It's Friday, August 30th, and we are checking in on the smart speaker and wearables markets. I'm your host, Dylan Lewis, and I've got fool.com 's Evan Niu with me on Skype. Evan, how are you doing, man?",
    "Evan Niu: Pretty good! Fun fact, Warren Buffett and I have the same birthday. That's today.",
    "Lewis: What a wonderful thing! We're pre-recording today's show. It's Thursday. We're trying to get ahead of the holiday weekend, get a little early start. I'm going to give you an early, rather than a belated, birthday greeting. When this goes live, listeners, if you feel like giving Evan a shout out on Twitter , feel free to. You're my favorite person of the famous people that have birthdays today, Evan.",
    "Niu: Oh, more than Buffett? He tends to overshadow me a little bit, because he is quite a bit more famous than I am.",
    "Lewis: Yeah, but I don't have a personal relationship with him, and I have a personal relationship with you, and I value that. [laughs] Alright, today we are talking about some updated data on two relatively new tech markets, specifically consumer tech markets. That's the smart speaker and wearables markets. This is primarily going to be based on research from a firm, Canalys. They are one of the leading researchers. They really have a finger on the pulse for what's going on.",
    "Why don't we start out talking about smart speakers? Canalys dropped their unit sales numbers, and there's really no surprise. The top of the list is Amazon. This is a category, Evan, that they have absolutely dominated over the last couple of years.",
    "Niu: Right. I would even go as far as to say that they created the category. When they came out with their Echo way back when, that was such a revolutionary device. It created this entire new category of smart speakers that people like to use with their voices, tap into Alexa to control their smart home devices, listen to music streaming, all sorts of stuff. They have been able to maintain their lead. Only a couple of times have they blipped into a No. 2 spot. But for the most part, they're always No. 1 by a healthy margin.",
    "Lewis: For them, business as usual. I think they sold about 6.6 million shipments during Q2, good for about 25% of the market. Even with more people coming into the space, they maintain their market share, which is pretty impressive. We've talked about it quite a bit on the show before, but it's worth mentioning, the smart speaker strategy for them, it's not a consumer hardware play. I mean, sure, they love selling these things. They probably sell them at or near cost, maybe a small margin there. But the reality is that this is plugging into a much larger ecosystem play for Amazon. It's not so much about the devices.",
    "Niu: Right. They want you to buy things with your voice, Prime members. Ideally, they want you to use Amazon music streaming, but in reality, probably not very many people do. But they do definitely have a pretty good smart home ecosystem as well, which I think entrenches people and gets them behaviorally used to using Alexa.",
    "Lewis: There was a bit of a surprise looking at the No. 2 player in the space by shipments. At 4.5 million shipments, Baidu took silver. I think it's worth emphasizing how far out of left field Baidu came this quarter. They grew shipments 3,700% year over year, which basically means that they had like 100,000 shipments in Q2 of 2018. That's pretty incredible.",
    "Niu: Right. It is coming off a very small base, because they were barely in the market a year ago. But over the past year to 18 months, they've been putting out a bunch of these different types of devices. A lot of different form factors. They're doing some smart displays, also some smaller, portable speakers. Kind of like what Amazon's doing with releasing a bunch of different things at different price points, different form factors, to offer something for everyone.",
    "Lewis: Looking at China broadly, some of the other big players, the names that people know, Alibaba and Xiaomi , both of them also on the list for major manufacturers. They're in fourth and fifth by units respectively. China's seeing a pretty crazy growth story with smart speakers. You go back to late 2017, and the market was just getting started. According to numbers from Canalys, they're about 50% of global shipments right now.",
    "Niu: I think they're a little bit more than that. China overtook the U.S. earlier this year as the largest smart speaker market in the world by unit volumes. I think that is still true today. The U.S. market is maturing, so it's showing a little bit of weakness. Their numbers show that the U.S. market dipped 2% or something. Nothing too scary, but not growing as quickly as places like China, where adoption is soaring, and it has a much larger market by population, and they're just now starting to get on this trend.",
    "Lewis: I think even for Amazon, and Google, who was formerly the No. 2 best seller by units, most of -- I think about half, 50% -- of their unit sales are international sales. So, when we see the U.S. market start to mature a little bit, you mentioned that small dip that we saw year over year, they are going elsewhere to find growth. Amazon was able to do that. Looking at the data, it looks like Google's actually one of the only major suppliers that experienced a year over year drop.",
    "Niu: Right. They're definitely looking outside the U.S. now to look for growth elsewhere. Although, both Amazon and Google don't have good inroads into China. It's tough for them because it is such a big market, which is why we see these Chinese companies, like you mentioned earlier, climbing these charts. They're able to capitalize on all that demand in China.",
    "Lewis: Baidu definitely stole the show, at least from my perspective, looking at all this data. You look at the strategy, it's very similar to Amazon. Smart speakers are not the core thesis for Baidu. If you're looking at the revenue contribution here, they lump all this into other revenues, as a lot of other major tech firms do, which is the most frustrating thing in the world if you're trying to pinpoint what's going on with the financials. The other stuff that's in there -- cloud services, and then they have the revenue from their streaming property, iQiyi . All told, that other revenue segment is about a quarter of revenue, but it grew 44% year over year in the most recent quarter. The core business, some of their online marketing, actually dipped. This is giving them some growth when they're otherwise struggling, but the reality is, like Amazon, the devices help them get more embedded with consumers. It's not so much that they are the end all, be all for this business.",
    "Niu: Right, exactly. And it is frustrating, in terms of investor transparency, but that's why we have to rely on these third party research estimates from companies like Canalys that give us as investors some data to actually go through to understand how this market is developing. It's really grown a lot. Total unit volumes were up like 55% up to like 26 million. Overall, we're still seeing a lot of really good growth numbers on a global basis.",
    "Lewis: There's one company that we would typically expect to have mentioned in a discussion about consumer technology noticeably absent from this discussion so far. That's Apple. It's wild to think, we're talking about all the big tech names, talking about a lot of companies that traditionally are strong in hardware, Apple's not mentioned. Samsung 's not mentioned, either.",
    "Niu: Apple has really dropped the ball on the smart speaker stuff, in my opinion. And pretty badly. Their whole thing has always been, \"We don't want to be first, we just want to be best,\" and they don't care if they're a little bit late to a market. But in this case, I think that the other players in that timeframe, when Apple was taking so long to come out with HomePod, these other companies were able to get in there and entrench themselves into people's homes. The whole idea of these smart speakers is, you have one in every room, you have multiple units all over the house. So, over time, people have been buying more Alexas, more Google Homes, and the Chinese brands, too, and putting them all over the house. Once you have all these, you're not going to go out and buy five or 10 more HomePods, which by themselves are extremely expensive. At the same time, Siri is not as capable as Alexa in terms of some of these capabilities. So, I really think they dropped the ball pretty badly. I don't see them coming back, frankly, in a meaningful way.",
    "Lewis: Yeah. I think it's really hard, if you're a consumer, to look out at something that you're not 100% sold on the use case for -- in the case of a smart speaker -- and maybe something that you want to test first, and say, \"Yeah, I'll go out there and buy a $300 product.\" I think most people are willing to make that leap with something that costs $50, $75. But to drop $300 when Siri has not necessarily been the greatest smart assistant out there is a bit of a stretch, and that bears it out in the unit shipments that we see.",
    "The one counter argument I'll mention is that Apple does have the ability to have a device in most people's pockets, particularly in the United States. They have such great penetration in the U.S. smartphone market that, if they are able to make Siri better, there may be some voice assistant play that they may be able to do there, rather than have to have something installed in every single room in the house.",
    "Niu: Right. They're reportedly working on a smaller, more affordable version of the HomePod that might be coming out in the next year or two. I think that's going to be a pretty key point for them, try to get in there with affordable devices. They really went high with this HomePod at $350. It's come down in price since then, but basically, they were betting on really high fidelity, audiophile quality sound, which average consumers don't care about. To your point, when this stuff all came out people we're sure. To test it out for $100, like the Echoes, was much more approachable than trying to drop $350 on a HomePod. We'll see if the mini does any better, we'll see how it's priced, we'll see if they pull back away from the high fidelity approach to it. But that's going to be their only chance.",
    "Lewis: Yeah, I think that this difference really speaks to the different business strategies for the likes of Apple, who is a primarily consumer hardware oriented company, and Amazon or Google, where Amazon, Google can very comfortably know that they are going to be the platform business. They have the e-commerce; they have the media. They have all these different things that they can then throw right on top of an installed base. Apple has that, to some extent, but it's a much smaller portion of the pie. Most of their money's coming from devices. If they're going to sell devices, and they're generally a premium product business, they need to have that across their entire portfolio.",
    "Niu: Right. I think, more broadly, it's also an open question of, how are these third-party developers going to be able to monetize their services on these platforms? That's also still a pretty nascent aspect of this broader trend, too. Most of the stuff that people do on these devices, you're not paying for subscriptions for an Alexa skill. Or, most people aren't. They do have some out there. But the vast majority of people are doing the built-in stuff. As that monetization stuff develops, maybe that'll present Apple with an opportunity. They are typically pretty good with helping their developers monetize services and subscriptions on their digital platforms.",
    "Lewis: OK, Evan, smart speakers aren't the only devices we're going to talk about today. We've also got an update on wearables. Also from Canalys. We're very grateful for all the work they do in market research. Why don't you kick us off there?",
    "Niu: They put out some numbers earlier this month on the North American wearables market. It's now hit $2 billion in revenue, total value. Unit volumes are up about 38% to 7.7 million. Again, seeing some pretty strong growth numbers here in terms of units. The North American market is the most valuable in the world by revenue, although China is growing a lot, too. They're actually the biggest in unit volumes. The big difference is that a lot of the units in China are these basic wearable tracker bands, whereas North America is becoming dominated by smart watches, which cost a lot more money. That's how you can make sense of that discrepancy there. Apple is, naturally, in first place because of the Apple Watch. That's the most popular smartwatch in the world. Fitbit comes in at No. 2. They've maintained that position for quite a while. Samsung was No. 3 with some of their new products, like the Galaxy Watch Active.",
    "Lewis:  I think for a long time, this market has been in price discovery mode a little bit. We've known that there's interest on the low end, especially with those bands that Xiaomi puts out that are like $10 or $20. And we know that there's some interest with the base level Fitbit devices. Those were extremely popular. Kind of a category creator, really. But for a while, I think these companies have struggled with understanding where they price those mid and high-tier smart watches.",
    "Niu: Right. There's been a lot going on. The whole market has been evolving. A lot of moving parts here. As you mentioned, it started off with these basic trackers, really low-cost, really cheap. Now, it's transitioning toward this more full-function, multi-feature smart watches that cost more but can do a whole lot more. At the same time there's pricing all across both fitness trackers and smart watches. So, yeah, the market is getting closer to finding those right price points that tap into mainstream demand.",
    "Fitbit is still on the cheaper end. For example, they're in the $100 to $200 range with their Versa. Samsung's in the $200 to $300 range with their products. Apple's at the high end with their Apple Watch Series 4, which starts at $400 and goes all the way up to $1,500, which is more than a MacBook Pro, which is wild. They also have the previous generation, Series 3, which is available for less than $300. I think what we're seeing right now is, the vast majority of units, 60% of the market, is in this $200 to $400 price band.",
    "Lewis: When we talk consumer devices, we're always mindful of what upgrade cycles look like. I think one of the reasons why the smart speaker market stalled a little bit most recently is because the people that tended to buy early generation devices are still using those early generation devices. Maybe they're adding other ones to them to build out how many they have in their home, but by and large, they haven't hit that refresh point yet. I was wondering where that was going to happen with wearables as well. It seems like these companies are adding functionality, and that's what's driving a lot of the growth, because a lot of these devices still work.",
    "Niu: Right, exactly. That's a good point with the smart speakers. Smart speakers, the technology hasn't really changed as quickly over the past couple of years compared to something like wearables, where a big driver right now is cellular connectivity and having a lot of health information on the smartwatch. I was actually skeptical back when Apple first put cellular into the Apple Watch. I didn't think it was that necessary. The smartwatch doesn't use that much data, but it still costs an extra $5 or $10 on your monthly bill. But, it turns out that has been a big demand driver, and people really do like that connectivity. Apple has marketed the LTE connection very well. They basically pitch it as a way to free the Apple Watch from the iPhone, use it as an independent device that can stream music, make calls, text, it actually has GPS built into it so you can leave your phone at home if you want to go out on a run. They really took the lead in terms of the cellular connectivity, and that is paying off pretty well for them.",
    "Lewis: Let's talk Fitbit a little bit here. This seems like the company that is best positioned to capitalize on growth in an industry. They created the category, and they have some of the more accessible lower-price options that still have decent functionality. And yet, it seems like this business just can't quite figure it out.",
    "Niu: Yeah, they can't really quite get their footing, even though they're such a prominent player. They do play both sides of it. They do the basic fitness trackers as well as the smart watches. Apple only does the smart watches. They've been transitioning to get onto the smartwatch bandwagon. But at the same time, they don't want to abandon their fitness tracker business, because there are many parts of the world -- like China and other emerging markets -- where basic trackers are still really popular, particularly in like the Middle East, for example, too. So, they have to do both while navigating this transition, and competing with Apple on smart watches. They had a pretty high profile flop recently with the Versa Lite. They recently actually had to cut their full-year forecasts on revenue because this device is not selling well. They attribute it to a different pricing strategy that didn't really work out. It was priced lower, but it turns out that people actually prefer to just hunt for discounts on the standard version that has more features. And a lot of times, those promotions will bring it down to the same price, anyways. So, they misread the market a little bit, and now they're starting to realize that, and adjust their strategy.",
    "Lewis: It seems like the market has been looking at this company and saying, like, \"Oh, they might be figuring it out! Nope, nope, we're seeing numbers that don't quite back it up yet.\" We've gotten this, \"Alright, we're trying new things.\" And it bears it out in the way the stock has traded, and the valuation that the company has earned, up until recently. We're seeing it now at levels that it hasn't been seen in quite some time. I think the current market cap for the business is under $800 million. Are you excited when you see some of the things that management's doing now? Or does it stay in the same place for you, where they're in \"figuring it out\" mode and they haven't proven that they've been able to do it in the past?",
    "Niu: I'm still in \"wait and see.\" I mean, they're at all-time lows. The stock is like $3 a share. They just announced a new version of the Versa, which has been their most popular smartwatch to date, with a bunch of minor improvements like better battery life, Alexa support, OLED display, that kind of stuff. But I think the bigger picture is that consumer electronics is a tough market. Preferences are fickle and always changing. Something you mentioned before, if you look at Fitbit's track record, the first thing they came out with was Ionic. It flopped. The Versa was next. It was a hit. The Versa Lite was next. It's a flop. Now it's Versa 2. It's just back and forth, back and forth. You don't know what's going to resonate and what's not. They haven't figured it out yet, either. I think that presents a lot of uncertainty to investors, because they haven't shown this consistent ability to come out with products that sell well.",
    "Lewis: The thing that would convince people -- at least, convince me -- more than anything else is, we have a hardware business, and, on top of that, we're putting in a very successful platform business. It seems like there's always the possibility for that. I haven't seen the execution there. You think about the amount of money that goes into fitness regimens and workout plans and all that kind of stuff. Peloton, a company that will be going public soon, has tapped into that in a way. They sell the device, but they're really making a lot of their money on membership. It's always seemed like Fitbit has been able to do that, but hasn't quite gotten the execution right. I think until they're able to, I'm always going to be waiting.",
    "Niu: I agree completely. They've been trying for years to get into the services stuff. And even before they went public, they had bought FitStar, which they had all these big plans about turning into a subscription business and all this stuff. Even to this day, subscription services for consumers is still less than 1% of total revenue. They haven't made any progress over the years. They just announced Fitbit Premium this week, which is $10 a month and offers personalized health and fitness type of stuff. But, again, I don't have a whole lot of confidence that they'll be able to pull it off in execution because they've been doing this for so long.",
    "That being said, they do have another health solutions segment, which is more targeting enterprises, corporate wellness programs, things like that. That is starting to show some signs of growth. They're forecasting that to reach $100 million in revenue this year, which would be about 7% of the total business. There's some progress on the services in terms of enterprise. Still, nothing on the consumer side. We just have to wait and see if they can finally pull it off.",
    "Lewis: The reason we want to see that's twofold. There's the financial impact of having generally higher margin and more predictable platform revenue coming in, but also, if you go from a point where you're only selling devices, and that's where all your money is coming from, to a point where people are paying to access apps or wellness programs or what have you on your platform, well, their next fitness device is probably also going to be a Fitbit. This is what has made Apple so successful with the iPhone. And it makes it a lot easier for them to predict success with their device sales. They feed each other really well. Until they're able to do that, I think they're going to continue to run into these series, where they have a great release, and then a ho-hum release that follows.",
    "Niu: Yeah, exactly. They're trying to diversify away from relying so much on hardware, which they've always done in the past. They've said that they're going to accelerate their development cycles to get onto this annual cadence of refreshing on an annual basis -- which, of course, is not unlike what Apple does. It gives them a little bit more visibility, helps them smooth out the seasonality, or at least plan better for the seasonality of it, because the consumer electronics market is so reliant on upgrades, and what's the newest thing, consumers want the newest, shiniest thing. So, being able to come out with that in a regular cadence is what they need to do. But, at the same time, because they haven't proven the ability to consistently do that, that's why they're trying to turn to the services stuff, to smooth it out on the other side of the business.",
    "Lewis: I think every time we've checked in on this company, we've been doubtfully watching from the sidelines. It sounds like that story continues, Evan.",
    "Niu: Yeah, pretty much. I've never really had an interest in touching the stock. I think it's very interesting because the market itself of wearables is interesting. But I'm still not interested.",
    "Lewis:  Yeah, I am right there with you. Thank you for pre-taping today! I hope you have a really nice birthday on Friday!",
    "Niu: Thank you!",
    "Lewis: I hope you have a good Labor Day weekend, as does our producer, Austin Morgan, and all of our listeners. Maybe you're listening to this episode while you're on a Labor Day weekend road trip. Hope you have a good time!",
    "Listeners, that does it for this episode of Industry Focus . If you have any questions or you want to reach out and say hey, you can shoot us an email over at industryfocus@fool.com , or you can tweet us @MFIndustryFocus. If you want more of our stuff, subscribe on iTunes, or you can catch some videos from the podcast and some additional content over on YouTube. As always, people on the program may own companies discussed on the show, and The Motley Fool may have formal recommendations for or against stocks mentioned, so don't buy or sell anything based solely on what you hear. Thanks to Austin Morgan for all his work behind the glass today! For Evan Niu, I'm Dylan Lewis. Thanks for listening and Fool on!",
    "John Mackey, CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Dylan Lewis owns shares of Alphabet (A shares), Amazon, Apple, and iQiyi. Evan Niu, CFA owns shares of Alibaba Group Holding Ltd., Amazon, and Apple. The Motley Fool owns shares of and recommends Alphabet (A shares), Alphabet (C shares), Amazon, Apple, Baidu, Fitbit, and Twitter. The Motley Fool has the following options: short January 2020 $155 calls on Apple, long January 2020 $150 calls on Apple, short January 2020 $155 calls on Apple, and long January 2020 $150 calls on Apple. The Motley Fool recommends iQiyi. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:56:00"
}