{
  "url": "https://www.nasdaq.com/article/gold-slips-as-thaw-in-sinous-trade-woes-lift-equities-20190911-00938",
  "title": "Gold slips as thaw in Sino-U.S. trade woes lift equities - Nasdaq.com",
  "text": [
    "Sept 12 (Reuters) - Gold prices fell on Thursday as equities gained on improving risk sentiment buoyed by signs of gradual de-escalation in U.S.-China trade tensions, while investors eyed European Central Bank's meeting for cues on monetary policy easing.",
    "FUNDAMENTALS",
    "* U.S. gold futures  were down 0.3% at $1,499.5 an ounce.",
    "* Asian stocks rose on hopes for a thaw in U.S.-China trade frictions and expectations that the ECB will kick off another wave of monetary easing by global central banks. USD/MKTS/GLOB",
    "* U.S. President Donald Trump on Wednesday welcomed China's decision to exempt some U.S. anti-cancer drugs and other goods from its tariffs and announced a delay to scheduled tariff hikes on billions worth of Chinese goods. ",
    "* Trump called on the \"boneheads\" at the Federal Reserve to push interest rates down into negative territory, a move reluctantly used by other central banks to battle weak economic growth that risks punishing savers and banks' earnings. ",
    "* U.S. producer prices unexpectedly rose in August, but the overall trend in producer inflation remains tame, cementing financial market expectations that the Federal Reserve will cut interest rates again next week to support a slowing economy. ",
    "* The ECB is set to unveil fresh stimulus measures on Thursday to prop up the ailing euro zone economy, but its exact moves are far from certain and a decision that underwhelms markets risks, pushing up borrowing costs. ",
    "* The ECB announces its rate decision at 1145 GMT, followed by ECB President Mario Draghi's news conference at 1230 GMT.",
    "* The British government's plans for a no-deal Brexit warn of severe disruption to cross-Channel routes, affecting the supply of medicines and certain types of fresh foods, and say that protests and counter-protests will take place across the country, accompanied by a possible rise in public disorder.",
    "DATA AHEAD",
    "0600   Germany   HICP Final YY               Aug",
    "0645   France    CPI (EU Norm) Final MM, YY  Aug",
    "1145   EU        ECB Refinancing Rate        Sept",
    "1145   EU        ECB Deposit Rate            Sept",
    "1200   India     Industrial Output YY        July",
    "1230   US        CPI MM, SA                  Aug",
    "1230   US        Initial Jobless Claims      Weekly"
  ],
  "published_datetime": "2019-09-11 09:42:00"
}