{
  "url": "https://www.nasdaq.com/article/zscaler-expects-growth-to-slow-down-cm1210734",
  "title": "Zscaler Expects Growth to Slow Down - Nasdaq.com",
  "text": [
    " Cloud security provider   Zscaler    (NASDAQ: ZS) reported its fiscal fourth-quarter results after the   market closed on Sept. 10. Revenue surged and the bottom line   improved, but the   software-as-a-service    company's guidance called for a much lower growth rate in the   year ahead. Here's what investors need to know. Zscaler results: The raw numbers  Data source: Zscaler.  . What happened with Zscaler this quarter?  Calculated billings increased by 32% year over year to     $125.8 million. This growth rate was much slower than the 55%     rate reported for     the third quarter      . Deferred revenue grew by 53% year over year to $251.2     million; the growth rate was 69% in the third quarter. Cash, cash equivalents, and short-term investments totaled     $364.6 million, up slightly from the third quarter. Zscaler's dollar-based net retention rate was 118%, flat     from the third quarter, and the customer churn rate declined     compared to the previous quarter and the prior-year     period. The Americas accounted for 51% of total revenue; Europe,     the Middle East, and Africa accounted for 41%; and the     Asia-Pacific region accounted for 8%. Zscaler ended the quarter with more than 3,900 customers,     including 100 Fortune 500 companies.    Image source: Getty Images.  What management had to say Zscaler CFO Remo Canessa explained during   the earnings call    that billings growth seems stronger if an adjustment is made: \"As   a reminder, our contract terms are typically one year to three   years, and we primarily invoice our customers one year in   advance. Excluding upfront greater-than-one-year billings in both   periods, billings would have grown over 50%.\" CEO Jay Chaudhry doesn't seem to be worried about competition:   \"Yeah, if I may add, I mean as we compete out there, we almost   win every deal, very low situations where we don't win. So very   comfortable with our differentiated technology, very comfortable   with our sales process.\" Looking forward Zscaler grew revenue by 59% in fiscal 2019. Fiscal 2020 won't   be quite as impressive. The company expects:  Revenue between $395 million and $405 million, up 32% at     the midpoint. Calculated billings between $490 million and $500 million,     up 27% at the midpoint. Non-GAAP earnings per share between $0.12 and $0.15, down     from $0.22.  Zscaler also provided guidance for the fiscal first   quarter:  Revenue between $89 million and $90 million, up 41.4% year     over year. Non-GAAP earnings per share between breakeven and $0.01,     compared to $0.01 in the prior-year period.  While management isn't worried about competition, the   company's guidance calls for substantially slower growth over the   next year. With the stock still trading for more than 20 times   trailing sales, even after a steep decline, slowing growth is the   last thing investors wanted to see.   Find out why Zscaler, Inc. is one of the 10 best stocks to buy now  Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* Tom and David just revealed their ten top stock picks for     investors to buy right now. Zscaler, Inc.     is on the list      -- but there are nine others you may be overlooking.  Click here to get access to the full       list!     *Stock Advisor returns as of June 1, 2019       Timothy Green      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Zscaler, Inc. The Motley Fool has     a     disclosure policy      .  ",
    "Cloud security provider   Zscaler    (NASDAQ: ZS) reported its fiscal fourth-quarter results after the   market closed on Sept. 10. Revenue surged and the bottom line   improved, but the   software-as-a-service    company's guidance called for a much lower growth rate in the   year ahead. Here's what investors need to know.",
    "Data source: Zscaler.  .",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Zscaler CFO Remo Canessa explained during   the earnings call    that billings growth seems stronger if an adjustment is made: \"As   a reminder, our contract terms are typically one year to three   years, and we primarily invoice our customers one year in   advance. Excluding upfront greater-than-one-year billings in both   periods, billings would have grown over 50%.\"",
    "CEO Jay Chaudhry doesn't seem to be worried about competition:   \"Yeah, if I may add, I mean as we compete out there, we almost   win every deal, very low situations where we don't win. So very   comfortable with our differentiated technology, very comfortable   with our sales process.\"",
    "Zscaler grew revenue by 59% in fiscal 2019. Fiscal 2020 won't   be quite as impressive. The company expects:",
    "Zscaler also provided guidance for the fiscal first   quarter:",
    "While management isn't worried about competition, the   company's guidance calls for substantially slower growth over the   next year. With the stock still trading for more than 20 times   trailing sales, even after a steep decline, slowing growth is the   last thing investors wanted to see.",
    "  Find out why Zscaler, Inc. is one of the 10 best stocks to buy now  Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* Tom and David just revealed their ten top stock picks for     investors to buy right now. Zscaler, Inc.     is on the list      -- but there are nine others you may be overlooking.  Click here to get access to the full       list!     *Stock Advisor returns as of June 1, 2019    ",
    " Find out why Zscaler, Inc. is one of the 10 best stocks to buy now ",
    "Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "Tom and David just revealed their ten top stock picks for     investors to buy right now. Zscaler, Inc.     is on the list      -- but there are nine others you may be overlooking.",
    " Click here to get access to the full       list! ",
    " *Stock Advisor returns as of June 1, 2019 ",
    "  Timothy Green      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Zscaler, Inc. The Motley Fool has     a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:03:00"
}