{
  "url": "https://www.nasdaq.com/article/wednesday-apple-rumors-new-features-coming-to-homepod-this-fall-cm1210775",
  "title": "Wednesday Apple Rumors: New Features Coming to HomePod This Fall - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Leading the Apple  (NASDAQ: AAPL ) rumor mill today is news of new HomePod features. Today, we'll look at that and other Apple Rumors for Wednesday.",
    "HomePod Updates : A new set of features will be coming to the HomePod this fall , reports 9to5Mac . Starting off, HomePod owners will be able to make use of the radio stations feature at the end of September. There are also other new features on the way, but they don't have exact release dates yet. This includes support for multiple user profiles, as well as the ability to hand off music from a mobile device to the smartspeaker. It also looks like the company plans to release a \"white noise\" feature sometime soon.",
    "iPhone 11 Deals : The iPhone 11 isn't even available for preorder yet and already has a discount , BGR notes. Walmart (NYSE: WMT ) says that it will be selling each of the iPhone 11 smartphones at a $50 discount. This discount is available as soon as the device are up for preorder this Friday. That means the iPhone 11 will cost $649, the iPhone 11 Pro will come in at $949 and customers will pay $1049 for the iPhone 11 Pro Max.",
    "New Betas : Apple is sending out the third betas for iOS 13.1 and iPadOS 13.1 , reports AppleInsider . These new betas are only available to developers, but a public version is likely coming soon. The updates to iOS 13 are coming out on September 30, which is just a short time after iOS 13 comes out on September 19.",
    "The post Wednesday Apple Rumors: New Features Coming to HomePod This Fall appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:05:04"
}