{
  "url": "https://www.nasdaq.com/article/this-renewable-energy-stock-has-a-clear-growth-runway-to-2030-cm1210826",
  "title": "This Renewable Energy Stock Has a Clear Growth Runway to 2030 - Nasdaq.com",
  "text": [
    " Despite all the doom-and-gloom headlines about climate change,   there's actually plenty of room for optimism. Consider that the   United States has cut total annual emissions by 862 million tons   on a carbon dioxide equivalent basis since 2005. That's a 15%   reduction, and more than the entire annual output of Germany. The   trend should accelerate in the near future. The National Renewable Energy Laboratory (NREL) projects that   the U.S. could boast over 500,000 megawatts of installed wind and   solar power capacity by 2030. That could generate 40% of the   nation's total electricity and result in a compound annual growth   rate of 15% for wind and solar electricity generation from 2018   to 2030. That also suggests that   NextEra Energy Partners    (NYSE: NEP) has a solid growth runway if the business can   maintain enough financial flexibility to take advantage of this   expansion.makeArticleAd();   Image source: Getty Images.  A significant long-term growth opportunity awaits NextEra Energy Partners was created by   NextEra Energy    (NYSE: NEE) , which is the largest publicly traded utility in the   world by market cap. Well, technically, it isn't a pure utility.   While NextEra Energy operates electric utilities in Florida   (read: companies that sell electricity to end users) , it also   derives a significant amount of revenue and income from its power   generation business (read: a company that sells electricity to   utilities). NextEra Energy Resources (NEER) builds,   operates, and sells wind and solar power assets across the United   States. It's one of the largest capital investors in the   country, generates more electricity from the wind and sun than   any other company on the planet, and owns more installed wind   power capacity -- 15,000 megawatts -- than all but seven   countries. The leadership position of NEER has helped NextEra Energy   Partners to assemble its own portfolio of wind and solar power   assets across the U.S. The partnership has acquired most of its   current 5,330-megawatt portfolio    , including nearly 2,000 megawatts since 2018, from the power   generation arm of the parent. While NextEra Energy Partners hasn't outlined specific growth   expectations in terms of power capacity, the company and its   parent have been outlining America's incredible renewable energy   growth potential in recent investor meetings. Consider how   NextEra Energy sees the market developing through the next   decade:  Data source: NextEra Energy investor presentation. For comparison, the United States exited 2018 with roughly   96,000 megawatts of installed wind power capacity and 62,000   megawatts of installed solar capacity. The nation could boast   500,000 megawatts of combined wind and solar power capacity by   2030. That sets up a clear growth runway for NEER and, by extension,   NextEra Energy Partners. The power generation business currently   operates roughly 18,000 megawatts of wind and solar power   capacity, bu   t report    s 9,600 megawatts in its backlog and thinks it could add and   develop another another 7,000 megawatts by 2022. The backlog   doesn't extend beyond that point, but investors can expect NEER   to remain aggressive.   Image source: Getty Images.  Can NextEra Energy Partners execute on the opportunity? The partnership has faced some obstacles on its recent growth   trajectory. The   United States is experiencing a wind drought    , which has been painful because wind assets comprise 85% of the   portfolio's power capacity. In the first half of 2019, renewable   energy sales declined 10% and total operating expenses climbed   23% compared to the year-ago period. Making matters worse, NextEra Energy Partners saw interest   expense soar to $362 million in the first six months of the year,   compared to $124 million in the year-ago period. That's because   the company has leaned on debt to acquire assets from NEER.   Therein lies the most significant obstacle to partaking in the   country's renewable energy bonanza by 2030: financing. Management maintains that the business has accessed low-cost   financing to support growth, but the partnership's debt currently   has non-investment-grade ratings (albeit at the high end of that   rating scale). The business recently consolidated some of its   revolving credit lines with long-term debt notes, but it has also   been forced to resort to third-party debt financing in the last   year. That could limit the company's growth potential if those   sources of cash dry up. Therefore, investors will need to keep a close eye on how   NextEra Energy Partners pays for growth, especially considering   ballooning debt balances have led to trouble for other renewable   energy companies over the years. A promising renewable energy stock, warts and all While investors cannot brush aside balance sheet worries and   financing obstacles, management has earned the benefit of the   doubt. Units of NextEra Energy Partners have delivered a 97%   return, with dividends included, since its initial public   offering (IPO), a performance that easily tops the   S&P 500    's total return of 69% in that span. Management expects to grow distributions 12% to 15% per year   through at least 2024 and doesn't think it will need to sell   common equity until 2021 at the earliest. The latter could become   necessary to maintain respectable leverage ratios, especially if   wind droughts persist. But given the company's track record and a   distribution yield of 3.9%, investors should be intrigued by the   growth potential for this   renewable energy stock    over the next decade.   10 stocks we like better than NextEra Energy       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and NextEra Energy wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Maxx Chatsko      has no position in any of the stocks mentioned. The Motley Fool     recommends NextEra Energy. The Motley Fool has a     disclosure policy      .  ",
    "Despite all the doom-and-gloom headlines about climate change,   there's actually plenty of room for optimism. Consider that the   United States has cut total annual emissions by 862 million tons   on a carbon dioxide equivalent basis since 2005. That's a 15%   reduction, and more than the entire annual output of Germany. The   trend should accelerate in the near future.",
    "The National Renewable Energy Laboratory (NREL) projects that   the U.S. could boast over 500,000 megawatts of installed wind and   solar power capacity by 2030. That could generate 40% of the   nation's total electricity and result in a compound annual growth   rate of 15% for wind and solar electricity generation from 2018   to 2030.",
    "That also suggests that   NextEra Energy Partners    (NYSE: NEP) has a solid growth runway if the business can   maintain enough financial flexibility to take advantage of this   expansion.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "NextEra Energy Partners was created by   NextEra Energy    (NYSE: NEE) , which is the largest publicly traded utility in the   world by market cap. Well, technically, it isn't a pure utility.   While NextEra Energy operates electric utilities in Florida   (read: companies that sell electricity to end users) , it also   derives a significant amount of revenue and income from its power   generation business (read: a company that sells electricity to   utilities). NextEra Energy Resources (NEER) builds,   operates, and sells wind and solar power assets across the United   States. It's one of the largest capital investors in the   country, generates more electricity from the wind and sun than   any other company on the planet, and owns more installed wind   power capacity -- 15,000 megawatts -- than all but seven   countries.",
    "The leadership position of NEER has helped NextEra Energy   Partners to assemble its own portfolio of wind and solar power   assets across the U.S. The partnership has acquired most of its   current 5,330-megawatt portfolio    , including nearly 2,000 megawatts since 2018, from the power   generation arm of the parent.",
    "While NextEra Energy Partners hasn't outlined specific growth   expectations in terms of power capacity, the company and its   parent have been outlining America's incredible renewable energy   growth potential in recent investor meetings. Consider how   NextEra Energy sees the market developing through the next   decade:",
    "Data source: NextEra Energy investor presentation.",
    "For comparison, the United States exited 2018 with roughly   96,000 megawatts of installed wind power capacity and 62,000   megawatts of installed solar capacity. The nation could boast   500,000 megawatts of combined wind and solar power capacity by   2030.",
    "That sets up a clear growth runway for NEER and, by extension,   NextEra Energy Partners. The power generation business currently   operates roughly 18,000 megawatts of wind and solar power   capacity, bu   t report    s 9,600 megawatts in its backlog and thinks it could add and   develop another another 7,000 megawatts by 2022. The backlog   doesn't extend beyond that point, but investors can expect NEER   to remain aggressive.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "The partnership has faced some obstacles on its recent growth   trajectory. The   United States is experiencing a wind drought    , which has been painful because wind assets comprise 85% of the   portfolio's power capacity. In the first half of 2019, renewable   energy sales declined 10% and total operating expenses climbed   23% compared to the year-ago period.",
    "Making matters worse, NextEra Energy Partners saw interest   expense soar to $362 million in the first six months of the year,   compared to $124 million in the year-ago period. That's because   the company has leaned on debt to acquire assets from NEER.   Therein lies the most significant obstacle to partaking in the   country's renewable energy bonanza by 2030: financing.",
    "Management maintains that the business has accessed low-cost   financing to support growth, but the partnership's debt currently   has non-investment-grade ratings (albeit at the high end of that   rating scale). The business recently consolidated some of its   revolving credit lines with long-term debt notes, but it has also   been forced to resort to third-party debt financing in the last   year. That could limit the company's growth potential if those   sources of cash dry up.",
    "Therefore, investors will need to keep a close eye on how   NextEra Energy Partners pays for growth, especially considering   ballooning debt balances have led to trouble for other renewable   energy companies over the years.",
    "While investors cannot brush aside balance sheet worries and   financing obstacles, management has earned the benefit of the   doubt. Units of NextEra Energy Partners have delivered a 97%   return, with dividends included, since its initial public   offering (IPO), a performance that easily tops the   S&P 500    's total return of 69% in that span.",
    "Management expects to grow distributions 12% to 15% per year   through at least 2024 and doesn't think it will need to sell   common equity until 2021 at the earliest. The latter could become   necessary to maintain respectable leverage ratios, especially if   wind droughts persist. But given the company's track record and a   distribution yield of 3.9%, investors should be intrigued by the   growth potential for this   renewable energy stock    over the next decade.",
    "  10 stocks we like better than NextEra Energy       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and NextEra Energy wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than NextEra Energy       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and NextEra Energy wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Maxx Chatsko      has no position in any of the stocks mentioned. The Motley Fool     recommends NextEra Energy. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:20:00"
}