{
  "url": "https://www.nasdaq.com/article/forexjapanese-yen-plunges-chinese-yuan-jumps-on-uschina-trade-hopes-20190905-00120",
  "title": "FOREX-Japanese yen plunges, Chinese yuan jumps on US-China trade hopes - Nasdaq.com",
  "text": [
    "    * Australian dollar, New Zealand dollar bounce on tradeoptimism",
    "* Pound holds earlier gains, but eases off slightly",
    "* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh",
    "LONDON, Sept 5 (Reuters) - The Japanese yen slipped andrisky currencies flourished on Thursday as investors turned moreoptimistic that the United States will find common ground withChina on trade after agreeing to hold talks in October.",
    "Chinese representatives will travel to Washington nextmonth, China's commerce ministry said on Thursday. urn:newsml:reuters.com:*:nB9N25400R",
    "\"This news has injected a fair amount of optimism inmarkets,\" said Prashant Newnaha, senior rates strategist at TDSecurities in Singapore.",
    "\"It does seem that the markets were positioning morebearishly, and now we've gotten this potential good news and themarkets are running with it,\" he said, adding global economicindicators had also recently been showing some green shoots.",
    "The pound also gained ground, boosted by hopes that ano-deal Brexit will be avoided. British lawmakers approvedlegislation on Wednesday to extend the Brexit deadline for thethird time and rejected Prime Minister Boris Johnson's motion tohold a snap election. urn:newsml:reuters.com:*:nL9N25Q00Jurn:newsml:reuters.com:*:nL9N24N02Z",
    "\"An amazing day when sterling is the best performer and theJapanese yen is the worst,\" said Marshal Gittler, a strategistat ACLS Global. \"Must indicate a real drop in risk sentiment,particularly with regards to Brexit!\" ",
    "The yen plunged to a three-week low of 106.75 against thedollar JPY=EBS , although it was last trading neutral at106.41. ",
    "The Chinese yuan rose to a two-week high of 7.1213 againstthe dollar in the offshore market CNH=EBS and was last up by0.1% at 7.1382. ",
    "The Australian dollar rose to a one-month high of 0.68255against the U.S. dollar AUD=D3 and was last up 0.2% at 0.6811.The New Zealand dollar rose to a nine-day at 0.6379 NZD=D3 .",
    "The dollar was flat against both the euro and five othermajor currencies .DXY . Euro/dollar was last at $1.1029EUR=EBS .",
    "Sterling was last trading down 0.3% at $1.2220GBP=D3 . Ithad earlier reached an eight-day high of $1.2262. Against theeuro, the pound was down 0.2% at 90.245 penceEURGBP=D3 .     (Reporting by Olga Cotaga; additional reporting by TomWestbrook in Singapore; editing by Larry King) ((olga.cotaga@thomsonreuters.com))"
  ],
  "published_datetime": "2019-09-05 03:45:00"
}