{
  "url": "https://www.nasdaq.com/article/4-best-fidelity-mutual-funds-to-buy-in-september-cm1206685",
  "title": "4 Best Fidelity Mutual Funds to Buy in September - Nasdaq.com",
  "text": [
    " Fidelity boasts of huge mutual fund assets under management and a wide variety of funds spanning a wide spectrum of sectors. Fidelity Investments is one of the largest and oldest mutual fund companies in the world. The company provides   investment advice  , discount brokerage services, retirement services, wealth management services, securities execution, and clearance and life insurance products to its clients. At Fidelity, a large group of investment professionals carry out extensive and in-depth research to provide potential investment avenues worldwide for their investors. Fidelity mutual funds have got more attention from investors lately. After all, Fidelity offers a variety of investment options from sector-based funds to key actively managed funds. To top it, low expenses, effective fund management and the ability to survive market volatility have resulted in strong fund performance. Let's consider mutual funds from Fidelity for stunning returns.  Fidelity's Performance So Far in 2019  By the end of July 2019, Fidelity Investments had more than $2 trillion of assets under management. The initial investment of the majority of Fidelity mutual funds ranges from $0 to $2,500. As of Jul 31, 2019, out of the total number of funds under Fidelity, only 3.2% were load funds, while the remaining 96.8% were no-load funds. Further, Fidelity Advisor Municipal Income 2023 Fund A FSODX  turned up as one of the best-performing mutual funds from the Fidelity family. The fund posted solid gains in the year-to-date (YTD) timeframe. FSODX, whose interest is free of federal income tax, has returned 5% over the last one-year period and has added 4.3% so far this year.  Awards & Recognitions  Fidelity Investments won 21 2019 U.S. Lipper Fund Awards. Lipper awards honor fund management firms as well as individual mutual funds, which significantly outperform its peers on a risk-adjusted basis. Further, such funds or family of funds should provide consistent returns over the last three-, five- and 10-year periods. The fund house has also been rated as the Best Online Broker in 2019 by Investopedia. Needless to say, the fund family performed exceedingly well in all the parameters. Fidelity's ability to offer effective research and tools, low-rate investment, and excellent services make it highly sought-after.  What Contributed to Fidelity's Gains?  Fidelity invests in a variety of sectors that are sensitive, cyclical and defensive. From the sensitive sectors, most investments were made in the technology sector. Among the cyclical sectors, the fund family invested the maximum in the financial services sector, while among the defensive sectors it invested heavily in the healthcare. Technology Select Sector SPDR (XLK) climbed 26% in the YTD period and has remained the best performing sector so far this year among the 11 S&P 500 sectors.  4 Best Funds to Buy Now  Given such circumstances, we have highlighted four Fidelity mutual funds carrying a Zacks Mutual Fund Rank #1 (Strong Buy) or 2 (Buy) that are poised to gain from such factors. Moreover, these funds have encouraging one-year and YTD returns. Additionally, the minimum initial investment is within $5000. We expect these funds to outperform their peers in the future. Remember, the goal of the Zacks Mutual Fund Rank is to guide investors to identify potential winners and losers. Unlike most of the fund-rating systems, the Zacks Mutual Fund Rank is not just focused on past performance, but also on the likely future success of the fund. The question here is: why should investors consider mutual funds? Reduced transaction costs and diversification of portfolio without several commission charges that are associated with stock purchases are primarily why one should be parking their money in mutual funds (read more:  Mutual Funds: Advantages, Disadvantages, and How They Make Investors Money  ).  Fidelity Select Semiconductors Portfolio FSELX  fund invests the bulk of its assets in common stocks of companies involved in the manufacture, design, and sale of electronic equipment and components. FSELX seeks growth of capital. The fund invests in both U.S. companies and non-U.S. companies. This Sector - Tech product has a history of positive total returns for over 10 years. Specifically, the fund's returns over the one year and YTD benchmarks are 11% and 35.4%, respectively. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  . The fund carries a Zacks Mutual Fund Rank #1 and has an annual expense ratio of 0.73%, which is below the category average of 1.28%.  Fidelity Select Consumer Finance Portfolio  FSVLX  fund seeks appreciation of capital. FSVLX invests more than 80% of its assets in equity securities of companies involved in offering products and services related to consumer finance. The fund considers financial strength and economic conditions before investing in a company. FSVLX invests in both U.S.-based and well as non-U.S.-based companies. This Zacks sector - Finance product has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  . FSVLX has a Zacks Mutual Fund Rank #1 and an annual expense ratio of 0.87%, which is below the category average of 1.43%. The fund has one-year and YTD returns of 14.8% and 30.6%, respectively.  Fidelity Select Software & IT Services Portfolio FSCSX  fund invests the majority of its assets in companies whose primary operations are related to software or information-based services. It primarily focuses on acquiring common stocks of both domestic and foreign companies.  This Sector - Tech product has a history of positive total returns for over 10 years. Specifically, the fund's returns over the one year and YTD benchmarks are 13.6% and 27.8%, respectively. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  . The fund carries a Zacks Mutual Fund Rank #1 and has an annual expense ratio of 0.72%, which is below the category average of 1.28%.  Fidelity Select Medical Technology And Devices Portfolio FSMEX  fund invests a large portion of its assets in securities of companies engaged in manufacturing and distribution of medical devices and equipment. The fund invests in both U.S. and non-U.S. stocks. This Zacks sector - Health product has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  . FSMEX has a Zacks Mutual Fund Rank #1 and an annual expense ratio of 0.73%, which is below the category average of 1.23%. The fund has one-year and YTD returns of 14.4% and 19.7%, respectively.  Want key mutual fund info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing mutual funds, each week.  Get it free >>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Get Your Free (FSMEX): Fund Analysis Report   Get Your Free (FSCSX): Fund Analysis Report   Get Your Free (FSODX): Fund Analysis Report   Get Your Free (FSVLX): Fund Analysis Report   Get Your Free (FSELX): Fund Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Fidelity boasts of huge mutual fund assets under management and a wide variety of funds spanning a wide spectrum of sectors. Fidelity Investments is one of the largest and oldest mutual fund companies in the world. The company provides   investment advice  , discount brokerage services, retirement services, wealth management services, securities execution, and clearance and life insurance products to its clients.",
    "At Fidelity, a large group of investment professionals carry out extensive and in-depth research to provide potential investment avenues worldwide for their investors. Fidelity mutual funds have got more attention from investors lately. After all, Fidelity offers a variety of investment options from sector-based funds to key actively managed funds.",
    "To top it, low expenses, effective fund management and the ability to survive market volatility have resulted in strong fund performance. Let's consider mutual funds from Fidelity for stunning returns.",
    " Fidelity's Performance So Far in 2019 ",
    "By the end of July 2019, Fidelity Investments had more than $2 trillion of assets under management. The initial investment of the majority of Fidelity mutual funds ranges from $0 to $2,500. As of Jul 31, 2019, out of the total number of funds under Fidelity, only 3.2% were load funds, while the remaining 96.8% were no-load funds.",
    "Further, Fidelity Advisor Municipal Income 2023 Fund A FSODX  turned up as one of the best-performing mutual funds from the Fidelity family. The fund posted solid gains in the year-to-date (YTD) timeframe. FSODX, whose interest is free of federal income tax, has returned 5% over the last one-year period and has added 4.3% so far this year.",
    " Awards & Recognitions ",
    "Fidelity Investments won 21 2019 U.S. Lipper Fund Awards. Lipper awards honor fund management firms as well as individual mutual funds, which significantly outperform its peers on a risk-adjusted basis. Further, such funds or family of funds should provide consistent returns over the last three-, five- and 10-year periods.",
    "The fund house has also been rated as the Best Online Broker in 2019 by Investopedia. Needless to say, the fund family performed exceedingly well in all the parameters. Fidelity's ability to offer effective research and tools, low-rate investment, and excellent services make it highly sought-after.",
    " What Contributed to Fidelity's Gains? ",
    "Fidelity invests in a variety of sectors that are sensitive, cyclical and defensive. From the sensitive sectors, most investments were made in the technology sector. Among the cyclical sectors, the fund family invested the maximum in the financial services sector, while among the defensive sectors it invested heavily in the healthcare.",
    "Technology Select Sector SPDR (XLK) climbed 26% in the YTD period and has remained the best performing sector so far this year among the 11 S&P 500 sectors.",
    " 4 Best Funds to Buy Now ",
    "Given such circumstances, we have highlighted four Fidelity mutual funds carrying a Zacks Mutual Fund Rank #1 (Strong Buy) or 2 (Buy) that are poised to gain from such factors. Moreover, these funds have encouraging one-year and YTD returns. Additionally, the minimum initial investment is within $5000.",
    "We expect these funds to outperform their peers in the future. Remember, the goal of the Zacks Mutual Fund Rank is to guide investors to identify potential winners and losers. Unlike most of the fund-rating systems, the Zacks Mutual Fund Rank is not just focused on past performance, but also on the likely future success of the fund.",
    "The question here is: why should investors consider mutual funds? Reduced transaction costs and diversification of portfolio without several commission charges that are associated with stock purchases are primarily why one should be parking their money in mutual funds (read more:  Mutual Funds: Advantages, Disadvantages, and How They Make Investors Money  ).",
    " Fidelity Select Semiconductors Portfolio FSELX  fund invests the bulk of its assets in common stocks of companies involved in the manufacture, design, and sale of electronic equipment and components. FSELX seeks growth of capital. The fund invests in both U.S. companies and non-U.S. companies.",
    "This Sector - Tech product has a history of positive total returns for over 10 years. Specifically, the fund's returns over the one year and YTD benchmarks are 11% and 35.4%, respectively. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  .",
    "The fund carries a Zacks Mutual Fund Rank #1 and has an annual expense ratio of 0.73%, which is below the category average of 1.28%.",
    " Fidelity Select Consumer Finance Portfolio  FSVLX  fund seeks appreciation of capital. FSVLX invests more than 80% of its assets in equity securities of companies involved in offering products and services related to consumer finance. The fund considers financial strength and economic conditions before investing in a company. FSVLX invests in both U.S.-based and well as non-U.S.-based companies.",
    "This Zacks sector - Finance product has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  .",
    "FSVLX has a Zacks Mutual Fund Rank #1 and an annual expense ratio of 0.87%, which is below the category average of 1.43%. The fund has one-year and YTD returns of 14.8% and 30.6%, respectively.",
    " Fidelity Select Software & IT Services Portfolio FSCSX  fund invests the majority of its assets in companies whose primary operations are related to software or information-based services. It primarily focuses on acquiring common stocks of both domestic and foreign companies. ",
    "This Sector - Tech product has a history of positive total returns for over 10 years. Specifically, the fund's returns over the one year and YTD benchmarks are 13.6% and 27.8%, respectively. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  .",
    "The fund carries a Zacks Mutual Fund Rank #1 and has an annual expense ratio of 0.72%, which is below the category average of 1.28%.",
    " Fidelity Select Medical Technology And Devices Portfolio FSMEX  fund invests a large portion of its assets in securities of companies engaged in manufacturing and distribution of medical devices and equipment. The fund invests in both U.S. and non-U.S. stocks.",
    "This Zacks sector - Health product has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds,  please click here  .",
    "FSMEX has a Zacks Mutual Fund Rank #1 and an annual expense ratio of 0.73%, which is below the category average of 1.23%. The fund has one-year and YTD returns of 14.4% and 19.7%, respectively.",
    " Want key mutual fund info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing mutual funds, each week.  Get it free >> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:19:00"
}