{
  "url": "https://www.nasdaq.com/article/why-stoneco-stock-fell-141-last-month-cm1210487",
  "title": "Why StoneCo Stock Fell 14.1% Last Month - Nasdaq.com",
  "text": [
    " What happened Shares of   StoneCo    (NASDAQ: STNE) dipped 14.1% in August, according to data from      S&P Global Market Intelligence    . The Brazilian   payment processing stock    lost ground after the company published its second-quarter   earnings results on Aug. 14.          STNE    data by   YCharts makeArticleAd(); The company managed to grow second-quarter revenue 68.8% year   over year to hit sales of 586.2 million Brazilian real (roughly   $145 million), but this performance fell short of the average   analyst target of 613.28 million real. Non-   GAAP    (adjusted) net income rose roughly 173% to hit 194 million   Brazilian real, working out to per-share earnings of roughly   $0.17 and missing the average analyst target by $0.01.   Image source: Getty Images.  So what It's worth noting that Aug. 14 was a very bad day for the   stock market as a whole, with the S&P 500 index falling   roughly 2.9% and the   Dow Jones Industrial Average    falling 3.05% and posting its worst daily performance of the   year. While Stone's results fell short of analyst targets, the   company still posted strong sales and earnings growth in the   second quarter, and its post-earnings stock performance may have   been affected by unfavorable timing. Now what StoneCo stock has regained a bit of ground this month, with   shares advancing roughly 3% in September's trading so far.              STNE    data by   YCharts  There's a lot of room for growth in the Brazilian and Latin   American fintech markets, and management has been making moves to   expand Stone's business outside the payment services space. The   company appears to be having some success on that front, with the   business more than doubling its software-subscriber base   sequentially to hit 70,000 users last quarter. Stone also   launched a financing unit in March and had supplied credit to   over 3,000 clients. The company's total active client count rose nearly 80% year   over year to hit 360,200, and the business managed to add 50,500   new clients in the quarter. If the business continues to add   users to its core payment processing services while successfully   ramping up its offerings and reach in other categories, there's   still plenty of potential for sales and earnings growth. Shares trade at roughly 44 times this year's expected   earnings.   10 stocks we like better than Stoneco LTD       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Stoneco LTD wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Keith Noonan      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   StoneCo    (NASDAQ: STNE) dipped 14.1% in August, according to data from      S&P Global Market Intelligence    . The Brazilian   payment processing stock    lost ground after the company published its second-quarter   earnings results on Aug. 14.",
    "    STNE    data by   YCharts ",
    "The company managed to grow second-quarter revenue 68.8% year   over year to hit sales of 586.2 million Brazilian real (roughly   $145 million), but this performance fell short of the average   analyst target of 613.28 million real. Non-   GAAP    (adjusted) net income rose roughly 173% to hit 194 million   Brazilian real, working out to per-share earnings of roughly   $0.17 and missing the average analyst target by $0.01.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "It's worth noting that Aug. 14 was a very bad day for the   stock market as a whole, with the S&P 500 index falling   roughly 2.9% and the   Dow Jones Industrial Average    falling 3.05% and posting its worst daily performance of the   year. While Stone's results fell short of analyst targets, the   company still posted strong sales and earnings growth in the   second quarter, and its post-earnings stock performance may have   been affected by unfavorable timing.",
    "StoneCo stock has regained a bit of ground this month, with   shares advancing roughly 3% in September's trading so far.",
    "    STNE    data by   YCharts ",
    "There's a lot of room for growth in the Brazilian and Latin   American fintech markets, and management has been making moves to   expand Stone's business outside the payment services space. The   company appears to be having some success on that front, with the   business more than doubling its software-subscriber base   sequentially to hit 70,000 users last quarter. Stone also   launched a financing unit in March and had supplied credit to   over 3,000 clients.",
    "The company's total active client count rose nearly 80% year   over year to hit 360,200, and the business managed to add 50,500   new clients in the quarter. If the business continues to add   users to its core payment processing services while successfully   ramping up its offerings and reach in other categories, there's   still plenty of potential for sales and earnings growth.",
    "Shares trade at roughly 44 times this year's expected   earnings.",
    "  10 stocks we like better than Stoneco LTD       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Stoneco LTD wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Stoneco LTD       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Stoneco LTD wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Keith Noonan      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:45:00"
}