{
  "url": "https://www.nasdaq.com/article/turkish-lira-weakens-ahead-of-possible-deeper-rate-cut-20190912-00090",
  "title": "Turkish lira weakens ahead of possible deeper rate cut - Nasdaq.com",
  "text": [
    "By Behiye Selin Taner and Daren Butler",
    "ISTANBUL, Sept 12 (Reuters) - The Turkish lira weakened in early trade on growing anticipation that an expected central bank interest rate cut at Thursday's policy-setting meeting could exceed a poll forecast of 250 basis points.",
    "Concerns about Turkey-U.S. tensions flaring up again also weighed on sentiment after Treasury Secretary Steven Mnuchin said on Monday Washington was considering imposing sanctions over Turkey's purchase of Russian missile systems. ",
    "A Reuters poll showed on Tuesday that the one-week repo rate will be cut to 17.25% this week and be lowered to 16% by year end as the bank continues an easing cycle meant to help lift the economy from recession. ",
    "However, the swap market indicates that a rate cut of 300-350 basis points was priced in and seven traders said on Wednesday that expectations ranged between 300-400 basis points.",
    "\"We expect a 175 basis point cut,\" said Beste Naz Sullu, assistant manager of investment counselling at Gedik Investment, noting the market expectations of a 300-400 basis point cut.",
    "\"A rapid cut by the central bank may be blocked by a somewhat softer slowdown in the second quarter, by uncertainty over whether the Fed will continue rate cuts and by (U.S.) sanctions still being on the table,\" she said.",
    "Data last week showed the Turkish economy contracted 1.5% year-on-year in the second quarter, less than a poll forecast of 2.0% contraction. ",
    "Sullu said the lira could strengthen to below 5.7 against the dollar if the rate cut is less than the market expected, but could weaken if the cut is at the top end of forecasts and creates the perception that the rate-cutting cycle is at an end.",
    "In July, the central bank slashed the rate to 19.75% from 24% in its first policy change since September 2018. Last year, a currency crisis chopped 30% from the value of the lira and sent inflation soaring to a 15-year high above 25%. ",
    "The bank is expected to follow up with another aggressive move and cut its policy rate by 250 basis points, the median estimate in a Reuters poll of 23 economists showed. Estimates ranged from cuts of 175 to 450 basis points.",
    "The Treasury's 10-year benchmark bond yield stood at 15.75% on Thursday, unchanged from Wednesday's close. The main share index  was up 0.47% in early trade.",
    "This year's inflation fall cleared the way for easing, and such expectations grew after Murat Uysal was appointed central bank governor and said there was room to manoeuvre on policy given the improving trend in prices.",
    "President Tayyip Erdogan, a self-described \"enemy\" of high interest rates, had sacked former central bank governor Murat Cetinkaya in early July, saying he did not follow instructions on monetary policy.",
    "The government has attempted to boost lending by state banks to liven up an economy that entered a recession last year.    "
  ],
  "published_datetime": "2019-09-12 03:36:00"
}