{
  "url": "https://www.nasdaq.com/article/emerging-currency-etf-an-awful-august-on-record-cm1206848",
  "title": "Emerging Currency ETF: An Awful August on Record - Nasdaq.com",
  "text": [
    " Currencies of emerging markets witnessed the worst August on record in 2019  , per Bloomberg. WisdomTree Emerging Currency Strategy Fund CEW  lost about 2% in the month  against 1.1% gain of the Invesco DB US Dollar Index Bullish Fund UUP  . Let's take a look at what led to the slump (read: August ETF Events That Grab Headlines  ).  Re-escalation of US-China Trade War  The month saw a spike in the tariff battle between the superpowers - the United States and China. Notably, China levied a round of retaliatory tariffs on U.S. goods worth $75 billion in the range of  5-10%  , which was set to be enacted on Sep 1  . This move by China came on the heels of the U.S. government's announcement on Aug 1 that it is imposing a 10% tariff on $300 billion worth of Chinese goods. Though Washington delayed some of those tariffs on Aug 13 stating that those will be enacted in two tranches  on Sep 1 and Dec 15  , respectively, the declaration prompted China to strike back. As a result, after markets closed in the United States on Aug 23, Trump said that he would \"raise tariffs on $250 billion worth of Chinese exports to  30% from 25% in October  and that the tariffs kicking in next week will now be 15% rather than 10%.\" The first lot of those tariffs kicked in this month (read:  Consumer ETFs in Focus on Fresh Tariff Threats  ). However, on China's part, the government finally enacted higher tariffs on Sep 1 on the proportion of goods that only make up \"about one third of the more than 5,000 product lines  listed in the latest announcement.\" The majority of the duties will be implemented on Dec 15 and \"China's plans to reinstate tariffs on U.S. autos and auto parts  will also not take place until that time.\" Such strained trade ties between the United States and China were sure to hit other emerging economies and their currencies.  Argentina Debt Crisis  Argentina's risk intensified to levels not seen since 2005 after the government announced plans to  protract maturities on about $100 billion in debt  , inducing fears of a massive financial crisis. There was sharp drop in peso due to the debt debacle, which was another reason for the emerging market currency rout. Notably, peso lost about 25% last month.  U.S. Dollar Strength  While emerging market currencies were struggling, the U.S. dollar strengthened. And why not? The U.S. economy has been better-placed in the globe. Though the Fed enacted a 25-bp rate cut in July, it happened after several rate hikes in the recent past. Investors should note that policy tightening gives strength to the concerned currency (read: Dollar Hits 2019 High: More Gains Ahead for ETFs?  ).  What Lies Ahead for Emerging Market Currencies?  Morgan Stanley expects developing nation currencies to fall about 2% against the greenback  in the coming month, per Bloomberg. This is because the research house believes that the prospects of emerging market currencies won't improve if the Fed does not become more dovish and trade tensions recede. So, investors need to be watchful about emerging market and its currency investing.  Want key ETF info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.  Get it free >>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Invesco DB US Dollar Index Bullish Fund (UUP): ETF Research Reports   WisdomTree Emerging Currency Strategy Fund (CEW): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    "Currencies of emerging markets witnessed the worst August on record in 2019  , per Bloomberg. WisdomTree Emerging Currency Strategy Fund CEW  lost about 2% in the month  against 1.1% gain of the Invesco DB US Dollar Index Bullish Fund UUP  . Let's take a look at what led to the slump (read: August ETF Events That Grab Headlines  ).",
    " Re-escalation of US-China Trade War ",
    "The month saw a spike in the tariff battle between the superpowers - the United States and China. Notably, China levied a round of retaliatory tariffs on U.S. goods worth $75 billion in the range of  5-10%  , which was set to be enacted on Sep 1  . This move by China came on the heels of the U.S. government's announcement on Aug 1 that it is imposing a 10% tariff on $300 billion worth of Chinese goods.",
    "Though Washington delayed some of those tariffs on Aug 13 stating that those will be enacted in two tranches  on Sep 1 and Dec 15  , respectively, the declaration prompted China to strike back. As a result, after markets closed in the United States on Aug 23, Trump said that he would \"raise tariffs on $250 billion worth of Chinese exports to  30% from 25% in October  and that the tariffs kicking in next week will now be 15% rather than 10%.\" The first lot of those tariffs kicked in this month (read:  Consumer ETFs in Focus on Fresh Tariff Threats  ).",
    "However, on China's part, the government finally enacted higher tariffs on Sep 1 on the proportion of goods that only make up \"about one third of the more than 5,000 product lines  listed in the latest announcement.\" The majority of the duties will be implemented on Dec 15 and \"China's plans to reinstate tariffs on U.S. autos and auto parts  will also not take place until that time.\"",
    "Such strained trade ties between the United States and China were sure to hit other emerging economies and their currencies.",
    " Argentina Debt Crisis ",
    "Argentina's risk intensified to levels not seen since 2005 after the government announced plans to  protract maturities on about $100 billion in debt  , inducing fears of a massive financial crisis. There was sharp drop in peso due to the debt debacle, which was another reason for the emerging market currency rout. Notably, peso lost about 25% last month.",
    " U.S. Dollar Strength ",
    "While emerging market currencies were struggling, the U.S. dollar strengthened. And why not? The U.S. economy has been better-placed in the globe. Though the Fed enacted a 25-bp rate cut in July, it happened after several rate hikes in the recent past. Investors should note that policy tightening gives strength to the concerned currency (read: Dollar Hits 2019 High: More Gains Ahead for ETFs?  ).",
    " What Lies Ahead for Emerging Market Currencies? ",
    "Morgan Stanley expects developing nation currencies to fall about 2% against the greenback  in the coming month, per Bloomberg. This is because the research house believes that the prospects of emerging market currencies won't improve if the Fed does not become more dovish and trade tensions recede. So, investors need to be watchful about emerging market and its currency investing.",
    " Want key ETF info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.  Get it free >> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:30:00"
}