{
  "url": "https://www.nasdaq.com/article/iart-or-gmed-which-is-the-better-value-stock-right-now-cm1207997",
  "title": "IART or GMED: Which Is the Better Value Stock Right Now? - Nasdaq.com",
  "text": [
    " Investors interested in Medical - Instruments stocks are likely familiar with Integra LifeSciences (IART) and Globus Medical (GMED). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look. Everyone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits. Integra LifeSciences and Globus Medical are sporting Zacks Ranks of #2 (Buy) and #3 (Hold), respectively, right now. This means that IART's earnings estimate revision activity has been more impressive, so investors should feel comfortable with its improving analyst outlook. But this is only part of the picture for value investors. Value investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels. The Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors. IART currently has a forward P/E ratio of 21.42, while GMED has a forward P/E of 28.77. We also note that IART has a PEG ratio of 1.84. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. GMED currently has a PEG ratio of 2.40. Another notable valuation metric for IART is its P/B ratio of 3.52. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, GMED has a P/B of 3.79. These are just a few of the metrics contributing to IART's Value grade of B and GMED's Value grade of C. IART is currently sporting an improving earnings outlook, which makes it stick out in our Zacks Rank model. And, based on the above valuation metrics, we feel that IART is likely the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Integra LifeSciences Holdings Corporation (IART): Free Stock Analysis Report   Globus Medical, Inc. (GMED): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors interested in Medical - Instruments stocks are likely familiar with Integra LifeSciences (IART) and Globus Medical (GMED). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look.",
    "Everyone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits.",
    "Integra LifeSciences and Globus Medical are sporting Zacks Ranks of #2 (Buy) and #3 (Hold), respectively, right now. This means that IART's earnings estimate revision activity has been more impressive, so investors should feel comfortable with its improving analyst outlook. But this is only part of the picture for value investors.",
    "Value investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels.",
    "The Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors.",
    "IART currently has a forward P/E ratio of 21.42, while GMED has a forward P/E of 28.77. We also note that IART has a PEG ratio of 1.84. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. GMED currently has a PEG ratio of 2.40.",
    "Another notable valuation metric for IART is its P/B ratio of 3.52. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, GMED has a P/B of 3.79.",
    "These are just a few of the metrics contributing to IART's Value grade of B and GMED's Value grade of C.",
    "IART is currently sporting an improving earnings outlook, which makes it stick out in our Zacks Rank model. And, based on the above valuation metrics, we feel that IART is likely the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:40:10"
}