{
  "url": "https://www.nasdaq.com/article/mcdonalds-mcd-gains-but-lags-market-what-you-should-know-cm1210786",
  "title": "McDonald's (MCD) Gains But Lags Market: What You Should Know - Nasdaq.com",
  "text": [
    " McDonald's (MCD) closed the most recent trading day at $210.20, moving +0.25% from the previous trading session. This change lagged the S&P 500's 0.72% gain on the day. Elsewhere, the Dow gained 0.85%, while the tech-heavy Nasdaq added 1.06%. Prior to today's trading, shares of the world's biggest hamburger chain had lost 4.57% over the past month. This has lagged the Retail-Wholesale sector's gain of 4.89% and the S&P 500's gain of 2.25% in that time. MCD will be looking to display strength as it nears its nex t earnings  release. On that day, MCD is projected to report earnings of $2.22 per share, which would represent year-over-year growth of 5.71%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $5.49 billion, up 2.31% from the year-ago period. For the full year, our Zacks Consensus Estimates are projecting earnings of $8.01 per share and revenue of $21.12 billion, which would represent changes of +1.39% and +0.47%, respectively, from the prior year. Any recent changes to analyst estimates for MCD should also be noted by investors. These revisions help to show the ever-changing nature of near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Our research shows that these estimate changes are directly correlated with near-term stock prices. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. MCD is currently sporting a Zacks Rank of #3 (Hold). Looking at its valuation, MCD is holding a Forward P/E ratio of 26.19. This valuation marks a premium compared to its industry's average Forward P/E of 23.28. Also, we should mention that MCD has a PEG ratio of 3.11. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. MCD's industry had an average PEG ratio of 2.2 as of yesterday's close. The Retail - Restaurants industry is part of the Retail-Wholesale sector. This group has a Zacks Industry Rank of 144, putting it in the bottom 44% of all 250+ industries. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. To follow MCD in the coming trading sessions, be sure to utilize Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  McDonald's Corporation (MCD): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "McDonald's (MCD) closed the most recent trading day at $210.20, moving +0.25% from the previous trading session. This change lagged the S&P 500's 0.72% gain on the day. Elsewhere, the Dow gained 0.85%, while the tech-heavy Nasdaq added 1.06%.",
    "Prior to today's trading, shares of the world's biggest hamburger chain had lost 4.57% over the past month. This has lagged the Retail-Wholesale sector's gain of 4.89% and the S&P 500's gain of 2.25% in that time.",
    "MCD will be looking to display strength as it nears its nex t earnings  release. On that day, MCD is projected to report earnings of $2.22 per share, which would represent year-over-year growth of 5.71%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $5.49 billion, up 2.31% from the year-ago period.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of $8.01 per share and revenue of $21.12 billion, which would represent changes of +1.39% and +0.47%, respectively, from the prior year.",
    "Any recent changes to analyst estimates for MCD should also be noted by investors. These revisions help to show the ever-changing nature of near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.",
    "Our research shows that these estimate changes are directly correlated with near-term stock prices. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. MCD is currently sporting a Zacks Rank of #3 (Hold).",
    "Looking at its valuation, MCD is holding a Forward P/E ratio of 26.19. This valuation marks a premium compared to its industry's average Forward P/E of 23.28.",
    "Also, we should mention that MCD has a PEG ratio of 3.11. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. MCD's industry had an average PEG ratio of 2.2 as of yesterday's close.",
    "The Retail - Restaurants industry is part of the Retail-Wholesale sector. This group has a Zacks Industry Rank of 144, putting it in the bottom 44% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "To follow MCD in the coming trading sessions, be sure to utilize Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:45:30"
}