{
  "url": "https://www.nasdaq.com/article/whats-next-for-gamestop-after-plunging-nearly-22-wednesday-morning-cm1210623",
  "title": "What's Next for GameStop After Plunging Nearly 22% Wednesday Morning? - Nasdaq.com",
  "text": [
    "Shares of GameStop (NYSE: GME) , a global video game retailer with more than 5,700 stores offering new and used video games, consoles, and accessories, were down 22% early Wednesday before gaining back some of those losses. The drop came after the company's second quarter disappointed investors.",
    "GameStop's second-quarter total sales declined 14.3% to $1.3 billion, failing to match analysts' estimates of $1.34 billion. The weak top line was driven by a 11.6% decline in consolidated comparable-store sales. The bottom line was disappointing no matter how you slice it: GameStop reported a loss of $415 million. Even when you exclude the $400.9 million of goodwill impairment charges and other items, the video game retailer lost an adjusted $0.32 per share, a decline compared to last year's $0.10-per-share loss and below analysts' estimates for an $0.18-per-share loss.",
    "Image source: Getty Images.",
    "\"We are committed to acting with a sense of urgency to address the areas of the business that are critical to achieving long-term success and value creation for all our stakeholders. We will set GameStop on the correct strategic path and fully leverage our unique position and brand in the video game industry,\" said George Sherman, GameStop's CEO, in a press release.",
    "Make no mistake, this was a weak second quarter, and the result inspired no confidence the company is driving a turnaround. But there is one factor worth noting: The slowing comparable-store sales and total sales result are normal trends as hardware consoles near the end of their cycle, which is currently happening. That said, it will take additional strategy on top of new consoles to turn GameStop's struggling business around -- and some argue the upgrade cycle won't help at all .",
    "Management's plan is to drive the core business through efficiency improvements, creating a social and cultural hub within stores, increasing the company's digital presence, and finding ways to unlock new high-margin revenue streams. Through those strategies, management hopes to exceed more than $200 million in annualized operating profit improvement by 2021. GameStop's second quarter was weak, and headwinds could remain indefinitely, but those are some of the risks of owning some consumer stocks .",
    "10 stocks we like better than GameStop\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and GameStop wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Daniel Miller has no position in any of the stocks mentioned. The Motley Fool owns shares of GameStop. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:52:00"
}