{
  "url": "https://www.nasdaq.com/article/exponent-inc-expo-ex-dividend-date-scheduled-for-september-05-2019-cm1207118",
  "title": "Exponent, Inc. (EXPO) Ex-Dividend Date Scheduled for September 05, 2019 - Nasdaq.com",
  "text": [
    "Exponent, Inc. ( EXPO  ) will begin trading ex-dividend on September 05, 2019. A cash dividend payment of $0.16 per share is scheduled to be paid on September 20, 2019. Shareholders who purchased EXPO prior to the ex-dividend date are eligible for the cash dividend payment. This marks the 3rd quarter that EXPO has paid the same dividend. At the current stock price of $70.1, the dividend yield is .91%.",
    "The previous trading day's last sale of EXPO was $70.1, representing a -2.84% decrease from the 52 week high of $72.15 and a 57.74% increase over the 52 week low of $44.44.",
    "EXPO is a part of the Consumer Services sector, which includes companies such as CGI Inc. ( GIB  ) and Booz Allen Hamilton Holding Corporation ( BAH  ). EXPO's current earnings per share, an indicator of a company's profitability, is $1.43. Zacks Investment Research reports EXPO's forecasted earnings growth in 2019 as 17.87%, compared to an industry average of 6.7%.",
    "For more information on the declaration, record and payment dates, visit the EXPO Dividend History  page. Our  Dividend Calendar  has the full list of stocks that have an ex-dividend today.",
    " Interested in gaining exposure to EXPO through an Exchange Traded Fund [ETF]?   The following ETF(s) have EXPO as a top-10 holding:  Invesco S&P SmallCap Industrials ETF (   PSCI    ) Invesco Exchange-Traded Fund Trust II (   XSHQ    ) Invesco S&P SmallCap Momentum ETF (   XSMO    ) SPDR S&P 600 Small Cap Growth ETF (based on S&P   SmallCap 600 G (   SLYG    ) iShares S&P Small-Cap 600 Growth ETF (   IJT    ).  ",
    "The top-performing ETF of this group is XSMO with an decrease of -0.27% over the last 100 days. PSCI has the highest percent weighting of EXPO at 2.86%.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:00:04"
}