{
  "url": "https://www.nasdaq.com/article/steris-ste-down-01-since-last-earnings-report-can-it-rebound-cm1207345",
  "title": "Steris (STE) Down 0.1% Since Last Earnings Report: Can It Rebound? - Nasdaq.com",
  "text": [
    " It has been about a month since the las t earnings  report for Steris (STE). Shares have lost about 0.1% in that time frame, underperforming the S&P 500. Will the recent negative trend continue leading up to its next earnings release, or is Steris due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important catalysts.  STERIS Q1 Earnings Surpass Estimates  STERIS plc reported first-quarter fiscal 2020 adjusted earnings per share (EPS) of $1.23, up 23% year over year. The metric beat the Zacks Consensus Estimate by 10.8%. Reported EPS came in at 99 cents, up 20.7% year over year. Revenues of $696.8 million in the quarter rose 9.1% year over year and topped the Zacks Consensus Estimate by 3.4%.  Quarter in Detail  Organic revenue growth at constant currency was 10% year over year in the first quarter, mainly driven by growth across all segments. The company operates through four segments: Healthcare Products, Healthcare Specialty Services, Applied Sterilization Technologies and Life Sciences. Revenues at Healthcare Products increased 6.1% year over year to $309.8 million (up 6.7% on a constant currency organic basis). In the quarter under review, service revenues grew 2% and capital equipment revenues rose 7%. Meanwhile, consumable revenues grew 8% on divestitures limiting growth. Revenues at the Healthcare Specialty Services segment were up 11.2% to $135.9 million (up 13.2% on a constant currency organic basis). Revenues at Applied Sterilization Technologies rose 10.6% to $154.3 million (up 13.1% at CER organic basis) backed by increased demand from core medical device customers. Revenues at Life Sciences segment rose 13.9% to $96.8 million (up 15.3% at CER organic basis) on 9% growth in consumable revenues along with a 1% rise in service revenues and 40% year-over-year growth in capital equipment revenues.  Margins  Adjusted gross margin (after excluding cost of revenues for restructuring) expanded 177 basis points (bps) year over year to 43.9% in the reported quarter. STERIS witnessed a 12.9% year-over-year rise in selling, general and administrative expenses to $178.8 million. Research and development expenses declined 3.9% to $15.6 million. Overall, adjusted operating margin expanded 122 bps on a year-over-year basis to 15.9% in the reported quarter.  Financial Details  STERIS exited first quarter of fiscal 2020 with cash and cash equivalents of $238.1 million compared with $220.6 million at the end of fiscal 2019. The company had long-term debt of $1.21 billion at the end of the first quarter compared with $1.18 billion at the end of fiscal 2019. Year to date, net cash provided by operations was $109.3 million, compared with $100.8 million at the end of the year-ago period.  2020 Guidance   STERIS has updated its projections for fiscal 2020 constant currency organic revenue growth at around 6-7% compared with the previous projection of 5-6%. The Zacks Consensus Estimate for fiscal 2020 revenues is pegged at $2.94 billion. The company has also raised its projection for fiscal 2020 adjusted EPS in the range of $5.38-5.53 from the earlier-estimated $5.28-5.43. The Zacks Consensus Estimate for fiscal 2020 adjusted EPS lies at $5.37, below the guided range.   How Have Estimates Been Moving Since Then?  In the past month, investors have witnessed a downward trend in estimates review.  VGM Scores  Currently, Steris has a great Growth Score of A, though it is lagging a lot on the Momentum Score front with a D. Charting a somewhat similar path, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy. Overall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Steris has a Zacks Rank #2 (Buy). We expect an above average return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  STERIS plc (STE): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "It has been about a month since the las t earnings  report for Steris (STE). Shares have lost about 0.1% in that time frame, underperforming the S&P 500.",
    "Will the recent negative trend continue leading up to its next earnings release, or is Steris due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important catalysts.  STERIS Q1 Earnings Surpass Estimates  STERIS plc reported first-quarter fiscal 2020 adjusted earnings per share (EPS) of $1.23, up 23% year over year. The metric beat the Zacks Consensus Estimate by 10.8%. Reported EPS came in at 99 cents, up 20.7% year over year. Revenues of $696.8 million in the quarter rose 9.1% year over year and topped the Zacks Consensus Estimate by 3.4%.  Quarter in Detail  Organic revenue growth at constant currency was 10% year over year in the first quarter, mainly driven by growth across all segments. The company operates through four segments: Healthcare Products, Healthcare Specialty Services, Applied Sterilization Technologies and Life Sciences. Revenues at Healthcare Products increased 6.1% year over year to $309.8 million (up 6.7% on a constant currency organic basis). In the quarter under review, service revenues grew 2% and capital equipment revenues rose 7%. Meanwhile, consumable revenues grew 8% on divestitures limiting growth. Revenues at the Healthcare Specialty Services segment were up 11.2% to $135.9 million (up 13.2% on a constant currency organic basis). Revenues at Applied Sterilization Technologies rose 10.6% to $154.3 million (up 13.1% at CER organic basis) backed by increased demand from core medical device customers. Revenues at Life Sciences segment rose 13.9% to $96.8 million (up 15.3% at CER organic basis) on 9% growth in consumable revenues along with a 1% rise in service revenues and 40% year-over-year growth in capital equipment revenues.  Margins  Adjusted gross margin (after excluding cost of revenues for restructuring) expanded 177 basis points (bps) year over year to 43.9% in the reported quarter. STERIS witnessed a 12.9% year-over-year rise in selling, general and administrative expenses to $178.8 million. Research and development expenses declined 3.9% to $15.6 million. Overall, adjusted operating margin expanded 122 bps on a year-over-year basis to 15.9% in the reported quarter.  Financial Details  STERIS exited first quarter of fiscal 2020 with cash and cash equivalents of $238.1 million compared with $220.6 million at the end of fiscal 2019. The company had long-term debt of $1.21 billion at the end of the first quarter compared with $1.18 billion at the end of fiscal 2019. Year to date, net cash provided by operations was $109.3 million, compared with $100.8 million at the end of the year-ago period.  2020 Guidance   STERIS has updated its projections for fiscal 2020 constant currency organic revenue growth at around 6-7% compared with the previous projection of 5-6%. The Zacks Consensus Estimate for fiscal 2020 revenues is pegged at $2.94 billion. The company has also raised its projection for fiscal 2020 adjusted EPS in the range of $5.38-5.53 from the earlier-estimated $5.28-5.43. The Zacks Consensus Estimate for fiscal 2020 adjusted EPS lies at $5.37, below the guided range. ",
    " STERIS Q1 Earnings Surpass Estimates ",
    "STERIS plc reported first-quarter fiscal 2020 adjusted earnings per share (EPS) of $1.23, up 23% year over year. The metric beat the Zacks Consensus Estimate by 10.8%.",
    "Reported EPS came in at 99 cents, up 20.7% year over year.",
    "Revenues of $696.8 million in the quarter rose 9.1% year over year and topped the Zacks Consensus Estimate by 3.4%.",
    " Quarter in Detail ",
    "Organic revenue growth at constant currency was 10% year over year in the first quarter, mainly driven by growth across all segments.",
    "The company operates through four segments: Healthcare Products, Healthcare Specialty Services, Applied Sterilization Technologies and Life Sciences.",
    "Revenues at Healthcare Products increased 6.1% year over year to $309.8 million (up 6.7% on a constant currency organic basis). In the quarter under review, service revenues grew 2% and capital equipment revenues rose 7%. Meanwhile, consumable revenues grew 8% on divestitures limiting growth.",
    "Revenues at the Healthcare Specialty Services segment were up 11.2% to $135.9 million (up 13.2% on a constant currency organic basis).",
    "Revenues at Applied Sterilization Technologies rose 10.6% to $154.3 million (up 13.1% at CER organic basis) backed by increased demand from core medical device customers.",
    "Revenues at Life Sciences segment rose 13.9% to $96.8 million (up 15.3% at CER organic basis) on 9% growth in consumable revenues along with a 1% rise in service revenues and 40% year-over-year growth in capital equipment revenues.",
    " Margins ",
    "Adjusted gross margin (after excluding cost of revenues for restructuring) expanded 177 basis points (bps) year over year to 43.9% in the reported quarter.",
    "STERIS witnessed a 12.9% year-over-year rise in selling, general and administrative expenses to $178.8 million. Research and development expenses declined 3.9% to $15.6 million. Overall, adjusted operating margin expanded 122 bps on a year-over-year basis to 15.9% in the reported quarter.",
    " Financial Details ",
    "STERIS exited first quarter of fiscal 2020 with cash and cash equivalents of $238.1 million compared with $220.6 million at the end of fiscal 2019. The company had long-term debt of $1.21 billion at the end of the first quarter compared with $1.18 billion at the end of fiscal 2019.",
    "Year to date, net cash provided by operations was $109.3 million, compared with $100.8 million at the end of the year-ago period.",
    " 2020 Guidance  ",
    "STERIS has updated its projections for fiscal 2020 constant currency organic revenue growth at around 6-7% compared with the previous projection of 5-6%. The Zacks Consensus Estimate for fiscal 2020 revenues is pegged at $2.94 billion.",
    "The company has also raised its projection for fiscal 2020 adjusted EPS in the range of $5.38-5.53 from the earlier-estimated $5.28-5.43. The Zacks Consensus Estimate for fiscal 2020 adjusted EPS lies at $5.37, below the guided range.",
    " How Have Estimates Been Moving Since Then? ",
    "In the past month, investors have witnessed a downward trend in estimates review.",
    " VGM Scores ",
    "Currently, Steris has a great Growth Score of A, though it is lagging a lot on the Momentum Score front with a D. Charting a somewhat similar path, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Steris has a Zacks Rank #2 (Buy). We expect an above average return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:42"
}