{
  "url": "https://www.nasdaq.com/article/validea-peter-lynch-strategy-daily-upgrade-report-952019-cm1207701",
  "title": "Validea Peter Lynch Strategy Daily Upgrade Report - 9/5/2019 - Nasdaq.com",
  "text": [
    "The following are today's upgrades for Validea's P/E/Growth Investor model based on the published strategy of Peter Lynch . This strategy looks for stocks trading at a reasonable price relative to earnings growth that also possess strong balance sheets.",
    "FONAR CORPORATION ( FONR ) is a small-cap value stock in the Medical Equipment & Supplies industry. The rating according to our strategy based on Peter Lynch changed from 72% to 74% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Fonar Corporation (Fonar) is engaged in the business of designing, manufacturing, selling and servicing magnetic resonance imaging (MRI) scanners, which utilizes MRI technology for the detection and diagnosis of human disease, abnormalities, other medical conditions and injuries. The Company operates its business through two segments: Medical Equipment segment, and Physician Management and Diagnostic Services segment. Its Medical Equipment segment is conducted through Fonar. Its Physician Management and Diagnostic Services segment is conducted through its subsidiary Health Management Company of America (HMCA). It offers Upright MRI, which is used to scan any part of the body. The Upright MRI allows patients to be scanned in various conditions, such as standing, sitting, bending or lying down in any position. The Company offers SMART, where scanning allows for same-scan customization of 63 slices.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "Since its inception, Validea's strategy based on Peter Lynch has returned 346.57% vs. 195.52% for the S&P 500. For more details on this strategy, click here",
    "About Peter Lynch : Perhaps the greatest mutual fund manager of all-time, Lynch guided Fidelity Investment's Magellan Fund to a 29.2 percent average annual return from 1977 until his retirement in 1990, almost doubling the S&P 500's 15.8 percent yearly return over that time. Lynch's common sense approach and quick wit made him one of the most quoted investors on Wall Street. (\"Go for a business that any idiot can run -- because sooner or later, any idiot probably is going to run it,\" is one of his many pearls of wisdom.) Lynch's bestseller One Up on Wall Street is something of a \"stocks for the everyman/everywoman\", breaking his approach down into easy-to-understand concepts.",
    "About Validea : Validea is an investment research service that follows the published strategies of investment legends. Validea offers both stock analysis and model portfolios based on gurus who have outperformed the market over the long-term, including Warren Buffett, Benjamin Graham, Peter Lynch and Martin Zweig. For more information about Validea, click here",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 08:04:23"
}