{
  "url": "https://www.nasdaq.com/article/fortinet-ftnt-to-secure-telenor-swedens-sd-wan-services-cm1210549",
  "title": "Fortinet (FTNT) to Secure Telenor Sweden's SD-WAN Services - Nasdaq.com",
  "text": [
    "  Fortinet FTNT  recently announced that it has been selected by Telenor Sweden, which is part of mobile operator Telenor Group. Per the deal, Telenor Sweden will deliver its own next-generation SD-WAN (Software Defined Wide Area Networking) network.  makeArticleAd();  Fortinet's unique carrier-grade Secure SD-WAN solution will enable Telenor Sweden to deliver advanced WAN technologies, including broadband and 4G/LTE, to meet the changing WAN and application needs of organizations.    Fortinet will consolidate next-generation firewall security and SD-WAN services into a single platform, thereby increasing visibility, control and security to effectively protect data and applications of Telenor Sweden's customers. This will help the customers in the Nordic region to gain more agility, flexibility and security in their digital transformation journey.   Fortinet, Inc. Price and Consensus        Fortinet, Inc. price-consensus-chart    |   Fortinet, Inc. Quote    Growing Need for Branch Security    Organisations are endeavouring to boost digital initiatives throughout their offices, and enhance their WAN infrastructure and connectivity to maximize the performance and user experience for cloud-based applications.    Reportedly, more than 40% of organizations are currently keen on adopting SD-WAN and hybrid WAN technologies by the end of 2019.    Telenor Sweden reported that more than 3,000 companies with employee strength of at least 50 across three locations in Sweden are in need of developing WAN solutions to deliver safer and easier access to internal and external data and applications.    Next-generation branch offices are exposed to the same risks as that of a distributed network. Notably, the burgeoning of IoT and BYOD devices expands the potential attack surface of the branch.    Moreover, as services and applications shift to the cloud, additional network edges are created at each branch, exposing the same to potential security hazards.   Growing Efforts in Network Security    Fortinet is upping efforts to increase presence in the network security market, especially in distributed networks and branch security.    This June, Fortinet launched the Secure SD-Branch comprehensive solution to secure the WAN, and access edge and protect networking for distributed enterprises.    Moreover, in March, Fortinet's FortiGate Secure Software-Define Wide Area Network (SD-WAN) was adopted and deployed by French retail group Volkswagen Groupe Retail France across more than 70 branches.   Competition Rife    As increasing number of enterprises migrate on-premise branch office workloads and applications to software-as-a-service (SaaS) applications, adoption of SD-WAN is also increasing in order to direct more traffic to cloud services.    IDC expects  the SD-WAN market to witness a CAGR of 30.8% over the 2018-2023 period and reach $5.25 billion in 2023. Moreover, Gartner predicts that 50% of new firewall purchases in the distributed network will utilise SD-WAN features by 2023.    Increasing number of security companies are upping their ante in this area to tap the growing number of opportunities in cloud security with growing cloud adoption.    Palo Alto's PANW  enterprise branch security capability by virtue of the Prisma solution is a major contender for Fortinet's solutions.    Last month, Check Point CHKP  launched a Check Point Branch Office Security solution to provide cloud-delivered security services to protect the connection among various enterprise branch offices. This will enable seamless integration with leading SD-WAN providers like VMware VMW  and Silver Peak.    Nonetheless, being the only vendor offering both security and SD-WAN solutions, Fortinet is well positioned to capitalize on increasing opportunities in the market.    Fortinet currently has a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.          Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.       See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Fortinet, Inc. (FTNT): Free Stock Analysis Report   Palo Alto Networks, Inc. (PANW): Free Stock Analysis Report   VMware, Inc. (VMW): Free Stock Analysis Report   Check Point Software Technologies Ltd. (CHKP): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " Fortinet FTNT  recently announced that it has been selected by Telenor Sweden, which is part of mobile operator Telenor Group. Per the deal, Telenor Sweden will deliver its own next-generation SD-WAN (Software Defined Wide Area Networking) network.  makeArticleAd();  Fortinet's unique carrier-grade Secure SD-WAN solution will enable Telenor Sweden to deliver advanced WAN technologies, including broadband and 4G/LTE, to meet the changing WAN and application needs of organizations.    Fortinet will consolidate next-generation firewall security and SD-WAN services into a single platform, thereby increasing visibility, control and security to effectively protect data and applications of Telenor Sweden's customers. This will help the customers in the Nordic region to gain more agility, flexibility and security in their digital transformation journey.",
    "  Fortinet, Inc. Price and Consensus        Fortinet, Inc. price-consensus-chart    |   Fortinet, Inc. Quote  ",
    " Fortinet, Inc. Price and Consensus ",
    " Fortinet, Inc. price-consensus-chart    |   Fortinet, Inc. Quote ",
    " Growing Need for Branch Security    Organisations are endeavouring to boost digital initiatives throughout their offices, and enhance their WAN infrastructure and connectivity to maximize the performance and user experience for cloud-based applications.    Reportedly, more than 40% of organizations are currently keen on adopting SD-WAN and hybrid WAN technologies by the end of 2019.    Telenor Sweden reported that more than 3,000 companies with employee strength of at least 50 across three locations in Sweden are in need of developing WAN solutions to deliver safer and easier access to internal and external data and applications.    Next-generation branch offices are exposed to the same risks as that of a distributed network. Notably, the burgeoning of IoT and BYOD devices expands the potential attack surface of the branch.    Moreover, as services and applications shift to the cloud, additional network edges are created at each branch, exposing the same to potential security hazards.   Growing Efforts in Network Security    Fortinet is upping efforts to increase presence in the network security market, especially in distributed networks and branch security.    This June, Fortinet launched the Secure SD-Branch comprehensive solution to secure the WAN, and access edge and protect networking for distributed enterprises.    Moreover, in March, Fortinet's FortiGate Secure Software-Define Wide Area Network (SD-WAN) was adopted and deployed by French retail group Volkswagen Groupe Retail France across more than 70 branches.   Competition Rife    As increasing number of enterprises migrate on-premise branch office workloads and applications to software-as-a-service (SaaS) applications, adoption of SD-WAN is also increasing in order to direct more traffic to cloud services.    IDC expects  the SD-WAN market to witness a CAGR of 30.8% over the 2018-2023 period and reach $5.25 billion in 2023. Moreover, Gartner predicts that 50% of new firewall purchases in the distributed network will utilise SD-WAN features by 2023.    Increasing number of security companies are upping their ante in this area to tap the growing number of opportunities in cloud security with growing cloud adoption.    Palo Alto's PANW  enterprise branch security capability by virtue of the Prisma solution is a major contender for Fortinet's solutions.    Last month, Check Point CHKP  launched a Check Point Branch Office Security solution to provide cloud-delivered security services to protect the connection among various enterprise branch offices. This will enable seamless integration with leading SD-WAN providers like VMware VMW  and Silver Peak.    Nonetheless, being the only vendor offering both security and SD-WAN solutions, Fortinet is well positioned to capitalize on increasing opportunities in the market.    Fortinet currently has a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.          Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.       See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:40:00"
}