{
  "url": "https://www.nasdaq.com/article/ams-already-has-potential-buyers-for-osrams-digital-business-20190912-00125",
  "title": "AMS already has potential buyers for Osram's digital business - Nasdaq.com",
  "text": [
    "VIENNA, Sept 12 (Reuters) - AMS  already has a list of potential strategic buyers for Osram's  digital business it could talk to if it succeeds in purchasing the German lighting group, the chief executive of the Austrian sensor specialist said.",
    "AMS wants to take over the much bigger leader in automotive lighting to create a heavyweight in sensor solutions and photonics and has said that if it was successful, it would look for a buyer for Osram's digital business. ",
    "\"We do have a list of potential strategic buyers for Osram's digital business,\" Alexander Everke told German weekly Wirtschaftswoche in an interview published on Thursday.",
    "Osram's digital unit includes businesses that focus on electronic components and lighting systems as well as software for lighting management. ",
    "In 2017, it acquired Boston-based Digital Lumens, which specialises in energy-efficient lighting and sensor- and software-based services such as asset tracking. The division also offers stage and studio lighting, façade illumination and lighting for indoor plant cultivation. ",
    "The unit's third quarter revenues fell by 12.5% to 227 million euros ($250 million), but it lost money at the core profit level.",
    "Everke said that AMS and Osram together would go through Osram's product portfolio to decide on future investments. ",
    "A combination of Osram's opto semiconductors unit, which  commissioned an LED chip production site in Kulim, Malaysia, in 2016, with AMS would have implications for the Asian location, the chief executive said.",
    "\"We expect to cut jobs in Kulim, Asia, in this division,\" Everke said. ",
    "Osram's opto semiconductors unit employs around 1,500 staff in Kulim, and around 11,000 in total in Asia, according to a spokesman for the Munich-based group.",
    "Other locations in Asia would be evaluated as well and jobs would probably be cut, the AMS CEO said. He reiterated that no job cuts were planned in Germany.",
    "Osram has around 24,000 staff working in more than 100 countries and more than 20 production facilities worldwide, the spokesman said. Around 6,000 of them are employed in Germany. ",
    "AMS is offering 38.50 euro per share for Osram, which is 10% above the price offered by buyout firms Bain Capital and Carlyle . ",
    "The acceptance period runs until Oct. 1. Either bidder needs to convince 70% of Osram investors to be successful.",
    "($1 = 0.9069 euros)"
  ],
  "published_datetime": "2019-09-12 04:32:00"
}