{
  "url": "https://www.nasdaq.com/article/gain-big-with-these-4-small-cap-growth-funds-cm1210335",
  "title": "Gain Big With These 4 Small-Cap Growth Funds - Nasdaq.com",
  "text": [
    " Small-cap growth funds are natural choices for investors with a high-risk appetite when capital appreciation over the long term takes precedence over dividend payouts. These funds focus on realizing an appreciable amount of capital growth by investing in stocks that are projected to rise in value over the long term. Meanwhile, small-cap funds are good choices for investors seeking diversification across different sectors and companies. Small-cap funds generally invest in companies having market cap lower than $2 billion. The companies, smaller in size, offer growth potential and their market capitalization may increase subsequently. Also, due to their lower international exposure, small-cap funds offer higher protection than their large- and mid-cap counterparts against any global downturn. Below we share with you four top-ranked small-cap growth mutual funds. Each has earned a Zacks Mutual Fund Rank #1  (Strong Buy) and is expected to outperform peers in the future. Investors can click here to see the complete list of funds  .  Lord Abbett Developing Growth Fund Class A LAGWX  aims for capital growth over a long period of time. The fund invests majority of its assets in equity securities of small-capitalization companies. The fund's portfolio mostly consists of developing growth companies. The fund may also invest minority of its assets in foreign companies. LAGWX has returned 35.1% on a year-to-date basis. LAGWX has an expense ratio of 0.93% compared with the category average of 1.21%.  Hartford Small Company HLS Fund Class IB HDMBX  seeks capital appreciation. The fund primarily invests in common stocks of small capitalization companies. The fund may also invest minority of its assets in securities of non-U.S. companies and non-dollar securities. HDMBX has returned 25.6% on a year-to-date basis. Steven C. Angeli is one of the fund managers of HDMBX since 2000.  Franklin Small Cap Growth Fund Class A FSGRX  aims for long-term capital growth.  FSGRX has returned 21.9% on a year-to-date basis. The fund invests majority of its assets in equity securities of small-capitalization companies. The fund primarily invests in common stocks. As of July 2019, FSGRX held 127 issues, with 1.68% of its assets invested in Lattice Semiconductor Corp.  ClearBridge Small Cap Growth Fund Class A SASMX  seeks capital appreciation. The fund invests majority of its assets in equity securities of companies with small market capitalizations. The fund follows a growth-oriented investment style. SASMX has returned 17.9% on a year-to-date basis. SASMX has an expense ratio of 1.19% compared with the category average of 1.21%. To view the Zacks Rank and past performance of all small-cap growth mutual funds, investors can click here to see the complete list of funds  . Want key mutual fund info delivered straight to your inbox? Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing mutual funds, each week. Get it free >>  makeArticleAd();     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Get Your Free (HDMBX): Fund Analysis Report   Get Your Free (FSGRX): Fund Analysis Report   Get Your Free (LAGWX): Fund Analysis Report   Get Your Free (SASMX): Fund Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Small-cap growth funds are natural choices for investors with a high-risk appetite when capital appreciation over the long term takes precedence over dividend payouts. These funds focus on realizing an appreciable amount of capital growth by investing in stocks that are projected to rise in value over the long term.",
    "Meanwhile, small-cap funds are good choices for investors seeking diversification across different sectors and companies. Small-cap funds generally invest in companies having market cap lower than $2 billion. The companies, smaller in size, offer growth potential and their market capitalization may increase subsequently. Also, due to their lower international exposure, small-cap funds offer higher protection than their large- and mid-cap counterparts against any global downturn.",
    "Below we share with you four top-ranked small-cap growth mutual funds. Each has earned a Zacks Mutual Fund Rank #1  (Strong Buy) and is expected to outperform peers in the future. Investors can click here to see the complete list of funds  .",
    " Lord Abbett Developing Growth Fund Class A LAGWX  aims for capital growth over a long period of time. The fund invests majority of its assets in equity securities of small-capitalization companies. The fund's portfolio mostly consists of developing growth companies. The fund may also invest minority of its assets in foreign companies. LAGWX has returned 35.1% on a year-to-date basis.",
    "LAGWX has an expense ratio of 0.93% compared with the category average of 1.21%.",
    " Hartford Small Company HLS Fund Class IB HDMBX  seeks capital appreciation. The fund primarily invests in common stocks of small capitalization companies. The fund may also invest minority of its assets in securities of non-U.S. companies and non-dollar securities. HDMBX has returned 25.6% on a year-to-date basis.",
    "Steven C. Angeli is one of the fund managers of HDMBX since 2000.",
    " Franklin Small Cap Growth Fund Class A FSGRX  aims for long-term capital growth.  FSGRX has returned 21.9% on a year-to-date basis. The fund invests majority of its assets in equity securities of small-capitalization companies. The fund primarily invests in common stocks.",
    "As of July 2019, FSGRX held 127 issues, with 1.68% of its assets invested in Lattice Semiconductor Corp.",
    " ClearBridge Small Cap Growth Fund Class A SASMX  seeks capital appreciation. The fund invests majority of its assets in equity securities of companies with small market capitalizations. The fund follows a growth-oriented investment style. SASMX has returned 17.9% on a year-to-date basis.",
    "SASMX has an expense ratio of 1.19% compared with the category average of 1.21%.",
    "To view the Zacks Rank and past performance of all small-cap growth mutual funds, investors can click here to see the complete list of funds  .",
    "Want key mutual fund info delivered straight to your inbox?",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing mutual funds, each week. Get it free >>  makeArticleAd();  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:37:00"
}