{
  "url": "https://www.nasdaq.com/article/zackscom-featured-highlights-include-mdu-gibraltar-caseys-fti-and-solaredge-cm1207322",
  "title": "Zacks.com featured highlights include: MDU, Gibraltar, Caseys, FTI and SolarEdge - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL - September 4, 2019 - Stocks in this week's article are MDU Resources Group MDU  , Gibraltar Industries ROCK  , Caseys General Stores CASY  , FTI Consulting FCN  and SolarEdge Technologies SEDG  .   Buy These 5 Low Leverage Stocks to Keep Losses at Bay   Leverage is an investment strategy adopted by corporations wherein borrowed capital is used to expand operations and amplify possible returns from risk capital. Per the theory of cost of capital, a company's capital structure reflects a mix of debt and equity that is used to finance capital projects. Now a comparative analysis of the theory of cost of capital reveals that most companies prefer debt financing over equity since debt is cheaper, especially in periods of low interest rates. This is because when a company resorts to debt financing, it takes on fixed expenses in the form of interest payments for a specific time period. However, in case of equity financing, a shareholder not only becomes a partial owner of the company but develops a direct claim on the company's future profits as well. So, debt financing remains the preferred option for corporates. However, debt financing has its share of drawbacks. The problem arises when leverage, referred to as the amount of debt a company bears, becomes exorbitant. A high degree of financial leverage means high interest payments, which affect a company's bottom line. Therefore, choosing a less debt-ridden stock should be an appropriate option for a risk-averse investor.  And here comes the importance of leverage ratios, which can measure the exact amount of debt risk a company bears. Debt-to-equity ratio is one such measure, perhaps the most popular one, to evaluate a company's creditworthiness for potential equity investments.  Analyzing Debt/Equity  Debt-to-Equity Ratio = Total Liabilities/Shareholders' Equity This metric is a liquidity ratio that indicates the amount of financial risk a company bears. A company with a lower debt-to-equity ratio shows improved solvency for a company. Investors must be looking for stocks exhibiting solid earnings growth in the last couple of quarters. However, blindly investing in stocks displaying solid earnings growth, without considering their debt level, is not a wise move.  For the rest of this Screen of the Week article please   visit Zacks.com at:    https://www.zacks.com/stock/news/499667/buy-these-5-low-leverage-stocks-to-keep-losses-at-bay   Disclosure: Officers, directors and/or employees of Zacks   Investment Research may own or have sold short securities and/or   hold long and/or short positions in options that are mentioned in   this material. An affiliated investment advisory firm may own or   have sold short securities and/or hold long and/or short   positions in options that are mentioned in this material.   About Screen of the Week  Zacks.com created the first and best screening system on the web earning the distinction as the \"#1 site for screening stocks\" by Money Magazine.  But powerful screening tools is just the start. That is why Zacks created the Screen of the Week to highlight profitable stock picking strategies that investors can actively use.  Strong Stocks that Should Be in the News  Many are little publicized and fly under the Wall Street radar. They're virtually unknown to the general public. Yet today's 220 Zacks Rank #1 \"Strong Buys\" were generated by the stock-picking system that has more than doubled the market from 1988 through 2016. Its average gain has been a stellar +25% per year. See these high-potential stocks free >>.  Follow us on Twitter:   http://twitter.com/zacksresearch  Join us on Facebook:  http://www.facebook.com/ZacksInvestmentResearch  Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates. Contact: Jim Giaquinto Company: Zacks.com Phone: 312-265-9268 Email: pr@zacks.com  Visit: www.Zacks.com  Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer  . Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  MDU Resources Group, Inc. (MDU): Free Stock Analysis Report   Caseys General Stores, Inc. (CASY): Free Stock Analysis Report   Gibraltar Industries, Inc. (ROCK): Free Stock Analysis Report   SolarEdge Technologies, Inc. (SEDG): Free Stock Analysis Report   FTI Consulting, Inc. (FCN): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " For Immediate Release ",
    "Chicago, IL - September 4, 2019 - Stocks in this week's article are MDU Resources Group MDU  , Gibraltar Industries ROCK  , Caseys General Stores CASY  , FTI Consulting FCN  and SolarEdge Technologies SEDG  .",
    "  Buy These 5 Low Leverage Stocks to Keep Losses at Bay  ",
    "Leverage is an investment strategy adopted by corporations wherein borrowed capital is used to expand operations and amplify possible returns from risk capital. Per the theory of cost of capital, a company's capital structure reflects a mix of debt and equity that is used to finance capital projects.",
    "Now a comparative analysis of the theory of cost of capital reveals that most companies prefer debt financing over equity since debt is cheaper, especially in periods of low interest rates.",
    "This is because when a company resorts to debt financing, it takes on fixed expenses in the form of interest payments for a specific time period. However, in case of equity financing, a shareholder not only becomes a partial owner of the company but develops a direct claim on the company's future profits as well. So, debt financing remains the preferred option for corporates.",
    "However, debt financing has its share of drawbacks. The problem arises when leverage, referred to as the amount of debt a company bears, becomes exorbitant. A high degree of financial leverage means high interest payments, which affect a company's bottom line.",
    "Therefore, choosing a less debt-ridden stock should be an appropriate option for a risk-averse investor.  And here comes the importance of leverage ratios, which can measure the exact amount of debt risk a company bears. Debt-to-equity ratio is one such measure, perhaps the most popular one, to evaluate a company's creditworthiness for potential equity investments.",
    " Analyzing Debt/Equity ",
    "Debt-to-Equity Ratio = Total Liabilities/Shareholders' Equity",
    "This metric is a liquidity ratio that indicates the amount of financial risk a company bears. A company with a lower debt-to-equity ratio shows improved solvency for a company.",
    "Investors must be looking for stocks exhibiting solid earnings growth in the last couple of quarters. However, blindly investing in stocks displaying solid earnings growth, without considering their debt level, is not a wise move.",
    " For the rest of this Screen of the Week article please   visit Zacks.com at:    https://www.zacks.com/stock/news/499667/buy-these-5-low-leverage-stocks-to-keep-losses-at-bay ",
    " Disclosure: Officers, directors and/or employees of Zacks   Investment Research may own or have sold short securities and/or   hold long and/or short positions in options that are mentioned in   this material. An affiliated investment advisory firm may own or   have sold short securities and/or hold long and/or short   positions in options that are mentioned in this material. ",
    " About Screen of the Week ",
    "Zacks.com created the first and best screening system on the web earning the distinction as the \"#1 site for screening stocks\" by Money Magazine.  But powerful screening tools is just the start. That is why Zacks created the Screen of the Week to highlight profitable stock picking strategies that investors can actively use.",
    " Strong Stocks that Should Be in the News ",
    "Many are little publicized and fly under the Wall Street radar. They're virtually unknown to the general public. Yet today's 220 Zacks Rank #1 \"Strong Buys\" were generated by the stock-picking system that has more than doubled the market from 1988 through 2016. Its average gain has been a stellar +25% per year. See these high-potential stocks free >>. ",
    "Follow us on Twitter:   http://twitter.com/zacksresearch ",
    "Join us on Facebook:  http://www.facebook.com/ZacksInvestmentResearch ",
    "Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.",
    "Contact: Jim Giaquinto",
    "Company: Zacks.com",
    "Phone: 312-265-9268",
    "Email: pr@zacks.com ",
    "Visit: www.Zacks.com ",
    "Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer  .",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:44:00"
}