{
  "url": "https://www.nasdaq.com/article/one-day-shipping-could-boost-amazons-stock-by-50-cm1207645",
  "title": "One-Day Shipping Could Boost Amazon's Stock by 50% - Nasdaq.com",
  "text": [
    "  Amazon.com    (NASDAQ: AMZN)    dropped a bombshell    back in April, when it announced that the company planned to   shorten its standard two-day delivery option to just one day for   Prime members. Amazon had been offering two-day (or faster)   shipping to subscribers for years, but said it would offer   one-day shipping on 100 million of its most popular items that   were previously delivered within two days. In the increasingly competitive e-commerce industry, rapid   delivery has been a key differentiator for Amazon, as other   online and brick-and-mortar retailers have scrambled to catch up.   This has helped Amazon remain one of the   top stocks to buy    in recent years, with shares up more than 400% since 2014. Shares of the e-commerce giant could still have significant   upside as a result of this recent move.makeArticleAd();   Image source: Amazon.  Tapping real demand A recent online retail survey by RBC Capital Markets shows   that 64% of U.S. internet users say they are \"extremely\" or   \"very\" interested in next-day shipping, so Amazon's efforts are   fulfilling an existing demand -- which will increase its   likelihood of success. Amazon is expected to roll out Prime   one-day shipping to most of the U.S. within one year and across   its global customer base within two to three years. This could increase the company's already dominant position in   the e-commerce industry. Amazon was responsible for more than   one- third of online sales in the U.S. in 2018, according to data   provided by Digital Commerce 360. Penetration was even   higher during December 2018 -- nabbing 39% of e-commerce sales --   as procrastinating shoppers rushed to get gifts they needed in   time for the holidays. This illustrates how Amazon's speedier   shipping is helping it nab additional market share. Feeding the bulls RBC analyst Mark Mahaney recently completed a \"deep-dive   analysis\" and believes that one-day shipping will be a catalyst   that will accelerate global adoption of Amazon Prime.   Additionally, existing subscribers will likely increase the   amount they purchase by between 5% and 11% annually -- up from   the $1,800 they're already spending. These two factors alone   could boost Amazon's revenue by as much as 15% per year, or an   additional $24 billion. Mahaney also believes one-day delivery will increase Amazon's   flywheel effect related to Fulfillment by Amazon (FBA) and   Shipping with Amazon (SWA). \"One-Day makes Prime more appealing   for consumers, which makes FBA more appealing for vendors, which   increases supply on Prime, which makes Prime more appealing for   consumers.\" At the same time, SWA is targeting the $900 billion   global third-party logistics market. This will help greatly   expand Amazon's addressable market. As a result, the analyst has boosted the company's price   target to a street-high $2,600 per share over the coming 12   months, an increase from its previous estimate of $2,250 per   share and up nearly 50% from the stock's current price.   Image source: Getty Images.  Already bearing fruit Amazon's second-quarter results show that the move is working.   Revenue grew to $63.4 billion, up 20% year over year, reversing a   yearlong trend of slowing revenue growth. Even more telling,   sales went up by $3.7 billion sequentially, nearly double the   $1.9 billion increase during the same period last year -- a clear   indication of the demand for Amazon's speedier delivery. It's still early days for Amazon's faster shipping service, as   the company continues to expand the number of zip codes and   products eligible for one-day delivery. The move has already   pressured other e-commerce providers to match its next-day   shipping. Just weeks after Amazon's announcement,   Walmart    (NYSE: WMT) debuted its own   one-day delivery option    on orders over $35, offering about 220,000 products -- a far cry   from the more than 100 million available from Amazon. Once again, the e-commerce juggernaut has other retailers   playing defense, and Amazon and its investors will be the   ultimate beneficiaries of the move.   10 stocks we like better than Amazon       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amazon wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors.     Danny Vena      owns shares of Amazon. The Motley Fool owns shares of and     recommends Amazon. The Motley Fool has a     disclosure policy      .  ",
    " Amazon.com    (NASDAQ: AMZN)    dropped a bombshell    back in April, when it announced that the company planned to   shorten its standard two-day delivery option to just one day for   Prime members. Amazon had been offering two-day (or faster)   shipping to subscribers for years, but said it would offer   one-day shipping on 100 million of its most popular items that   were previously delivered within two days.",
    "In the increasingly competitive e-commerce industry, rapid   delivery has been a key differentiator for Amazon, as other   online and brick-and-mortar retailers have scrambled to catch up.   This has helped Amazon remain one of the   top stocks to buy    in recent years, with shares up more than 400% since 2014.",
    "Shares of the e-commerce giant could still have significant   upside as a result of this recent move.",
    "  Image source: Amazon. ",
    "Image source: Amazon.",
    "A recent online retail survey by RBC Capital Markets shows   that 64% of U.S. internet users say they are \"extremely\" or   \"very\" interested in next-day shipping, so Amazon's efforts are   fulfilling an existing demand -- which will increase its   likelihood of success. Amazon is expected to roll out Prime   one-day shipping to most of the U.S. within one year and across   its global customer base within two to three years.",
    "This could increase the company's already dominant position in   the e-commerce industry. Amazon was responsible for more than   one- third of online sales in the U.S. in 2018, according to data   provided by Digital Commerce 360. Penetration was even   higher during December 2018 -- nabbing 39% of e-commerce sales --   as procrastinating shoppers rushed to get gifts they needed in   time for the holidays. This illustrates how Amazon's speedier   shipping is helping it nab additional market share.",
    "RBC analyst Mark Mahaney recently completed a \"deep-dive   analysis\" and believes that one-day shipping will be a catalyst   that will accelerate global adoption of Amazon Prime.   Additionally, existing subscribers will likely increase the   amount they purchase by between 5% and 11% annually -- up from   the $1,800 they're already spending. These two factors alone   could boost Amazon's revenue by as much as 15% per year, or an   additional $24 billion.",
    "Mahaney also believes one-day delivery will increase Amazon's   flywheel effect related to Fulfillment by Amazon (FBA) and   Shipping with Amazon (SWA). \"One-Day makes Prime more appealing   for consumers, which makes FBA more appealing for vendors, which   increases supply on Prime, which makes Prime more appealing for   consumers.\" At the same time, SWA is targeting the $900 billion   global third-party logistics market. This will help greatly   expand Amazon's addressable market.",
    "As a result, the analyst has boosted the company's price   target to a street-high $2,600 per share over the coming 12   months, an increase from its previous estimate of $2,250 per   share and up nearly 50% from the stock's current price.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Amazon's second-quarter results show that the move is working.   Revenue grew to $63.4 billion, up 20% year over year, reversing a   yearlong trend of slowing revenue growth. Even more telling,   sales went up by $3.7 billion sequentially, nearly double the   $1.9 billion increase during the same period last year -- a clear   indication of the demand for Amazon's speedier delivery.",
    "It's still early days for Amazon's faster shipping service, as   the company continues to expand the number of zip codes and   products eligible for one-day delivery. The move has already   pressured other e-commerce providers to match its next-day   shipping. Just weeks after Amazon's announcement,   Walmart    (NYSE: WMT) debuted its own   one-day delivery option    on orders over $35, offering about 220,000 products -- a far cry   from the more than 100 million available from Amazon.",
    "Once again, the e-commerce juggernaut has other retailers   playing defense, and Amazon and its investors will be the   ultimate beneficiaries of the move.",
    "  10 stocks we like better than Amazon       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amazon wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Amazon       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amazon wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors.     Danny Vena      owns shares of Amazon. The Motley Fool owns shares of and     recommends Amazon. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 06:40:00"
}