{
  "url": "https://www.nasdaq.com/article/alexandria-raises-capital-prices-senior-notes-offerings-cm1207239",
  "title": "Alexandria Raises Capital, Prices Senior Notes Offerings - Nasdaq.com",
  "text": [
    "  Alexandria Real Estate Equities, Inc. ARE  recently announced the pricing of public offering of two different issues of unsecured senior notes. Specifically, a new issue of 2.75% senior notes with aggregate principal amount of $400 million have been priced at 99.842%. These notes are due in 2029.    Another offering of 4% senior notes, with aggregate principal amount of $200 million, have been priced at 110.38%. These securities will become part of the company's existing series of 4% senior notes due in 2050, of which notes worth $500 million were originally issued on Jul 15, 2019.  The 2.75% notes will have a yield to maturity (YTM) of 2.767%, while the 4% senior notes will offer YTM of 3.441% (including interest accrued since Jul 15, 2019 on the previously-issued notes). The closing of the note offering is subject to satisfaction of customary closing norms and is anticipated to be around Sep 12, 2019. Alexandria intends to use net proceeds from the offering to reduce outstanding balances under its unsecured senior bank term loan and repay borrowings under the company's unsecured senior line of credit. Moreover, the company plans to utilize any excess amounts for general corporate purposes. Alexandria's efforts to tap the debt market amid low interest-rate environment are a strategic fit. Furthermore, since unsecured notes can be borrowed at lower rates, the new debt will result in lower funding cost. Notably, by paying down its debt obligations, this offering is likely to provide financial flexibility to Alexandria. In addition, it reflects the company's focus to address its financial obligations in an efficient way.  The note offering is also anticipated to boost Alexandria's balance sheet and enhance its liquidity position. The company had $3.4 billion of liquidity as of the end of the second quarter. In fact, the previous issuance of $1.25-billion unsecured senior notes in July 2019 has helped Alexandria extend debt maturities. Further, upon completion of refinancing activities, the company's pro forma weighted-average remaining term on its outstanding debt stood at 10.1 years, with no debt maturing until 2023. Currently, Alexandria carries a Zacks Rank #2 (Buy). In the year-to-date period, shares of the company have jumped 30.1%, outperforming the industry  's growth of 24.7%.      Top Picks  OUTFRONT Media Inc. OUT  currently sports a Zacks Rank of 1 (Strong Buy). The Zacks Consensus Estimate for 2019 funds from operations (FFO) per share has been revised marginally upward to $2.34 over the past month.You can see   the complete list of today's Zacks #1 Rank stocks here  .  Crown Castle International Corp. CCI  holds a Zacks Rank of 2, at present. The Zacks Consensus Estimate for the current-year FFO per share remained unchanged at $5.92 in the past month. Extra Space Storage Inc EXR  is another Zacks #2 Ranked company, currently. The Zacks Consensus Estimate for the ongoing year's FFO per share has been revised marginally upward to $4.86 in a month's time. Note:  Anything related to earnings presented in this write-up represent funds from operations (FFO) - a widely used metric to gauge the performance of REITs.   Biggest Tech Breakthrough in a Generation makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Crown Castle International Corporation (CCI): Free Stock Analysis Report   Alexandria Real Estate Equities, Inc. (ARE): Free Stock Analysis Report   OUTFRONT Media Inc. (OUT): Free Stock Analysis Report   Extra Space Storage Inc (EXR): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Alexandria Real Estate Equities, Inc. ARE  recently announced the pricing of public offering of two different issues of unsecured senior notes. Specifically, a new issue of 2.75% senior notes with aggregate principal amount of $400 million have been priced at 99.842%. These notes are due in 2029.   ",
    "Another offering of 4% senior notes, with aggregate principal amount of $200 million, have been priced at 110.38%. These securities will become part of the company's existing series of 4% senior notes due in 2050, of which notes worth $500 million were originally issued on Jul 15, 2019. ",
    "The 2.75% notes will have a yield to maturity (YTM) of 2.767%, while the 4% senior notes will offer YTM of 3.441% (including interest accrued since Jul 15, 2019 on the previously-issued notes).",
    "The closing of the note offering is subject to satisfaction of customary closing norms and is anticipated to be around Sep 12, 2019.",
    "Alexandria intends to use net proceeds from the offering to reduce outstanding balances under its unsecured senior bank term loan and repay borrowings under the company's unsecured senior line of credit. Moreover, the company plans to utilize any excess amounts for general corporate purposes.",
    "Alexandria's efforts to tap the debt market amid low interest-rate environment are a strategic fit. Furthermore, since unsecured notes can be borrowed at lower rates, the new debt will result in lower funding cost.",
    "Notably, by paying down its debt obligations, this offering is likely to provide financial flexibility to Alexandria. In addition, it reflects the company's focus to address its financial obligations in an efficient way. ",
    "The note offering is also anticipated to boost Alexandria's balance sheet and enhance its liquidity position. The company had $3.4 billion of liquidity as of the end of the second quarter. In fact, the previous issuance of $1.25-billion unsecured senior notes in July 2019 has helped Alexandria extend debt maturities. Further, upon completion of refinancing activities, the company's pro forma weighted-average remaining term on its outstanding debt stood at 10.1 years, with no debt maturing until 2023.",
    "Currently, Alexandria carries a Zacks Rank #2 (Buy). In the year-to-date period, shares of the company have jumped 30.1%, outperforming the industry  's growth of 24.7%.",
    "  Top Picks ",
    "OUTFRONT Media Inc. OUT  currently sports a Zacks Rank of 1 (Strong Buy). The Zacks Consensus Estimate for 2019 funds from operations (FFO) per share has been revised marginally upward to $2.34 over the past month.You can see   the complete list of today's Zacks #1 Rank stocks here  . ",
    "Crown Castle International Corp. CCI  holds a Zacks Rank of 2, at present. The Zacks Consensus Estimate for the current-year FFO per share remained unchanged at $5.92 in the past month.",
    "Extra Space Storage Inc EXR  is another Zacks #2 Ranked company, currently. The Zacks Consensus Estimate for the ongoing year's FFO per share has been revised marginally upward to $4.86 in a month's time.",
    "Note:  Anything related to earnings presented in this write-up represent funds from operations (FFO) - a widely used metric to gauge the performance of REITs. ",
    " Biggest Tech Breakthrough in a Generation makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:53:00"
}