{
  "url": "https://www.nasdaq.com/article/usdcny-daily-forecast-mixed-chinese-manufacturing-reports-leave-traders-puzzled-cm1207704",
  "title": "USD/CNY Daily Forecast – Mixed Chinese Manufacturing Reports Leave Traders Puzzled - Nasdaq.com",
  "text": [
    "The trade war has taken its toll on China's economy, with the manufacturing and export sectors being particularly hit hard. Investors were uneasy on Friday, as the Chinese manufacturing PMI for August indicated contraction for a third straight month. However, there was an audible sigh of relief as the Caixin manufacturing PMI improved to 50.4, which was just barely in expansion territory. At the same time, there is a concern that manufacturing is in contraction mode, and the Caixin release was a one-time deviation.",
    "The trade war between China and the U.S. has had a direct effect on the exchange rate. In early August, when the Trump Administration imposed 10% tariffs on $300 billion worth of Chinese goods, China responded by allowing the yuan to breach the 7.00 level, for the first time since 2008. The yuan remains above 7, and if the Chinese feel that the heat from Trump's tariffs is getting too hot, they could easily resort to another devaluation to ease the trade war pain and make their exports more competitive.",
    "USD/CNY has started September with losses, and the downward trend could well continue during the week.",
    "USD/CNY is showing some clear downward trends, which takes us back to mid-August. The trend lines in late August and early September are almost identical, as the pair continues to try and test support at 0.1390.",
    "On the upside, 0.1409 was in a support role until mid-August but shifted to resistance as the yuan weakened. If the pair changes directions and tests this line, the yuan will next set its sights on resistance at 0.1430. This line was breached in early August when the trade war between China and the U.S. was at a fever pitch, and China devalued the yuan below the key 7-level.",
    "On the downside, I'm keeping an eye on 0.1390. This weak line could be breached if the dollar gains some strength.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 03:34:13"
}