{
  "url": "https://www.nasdaq.com/article/us-stocksfutures-gain-as-washington-delays-china-tariffs-20190912-00293",
  "title": "US STOCKS-Futures gain as Washington delays China tariffs - Nasdaq.com",
  "text": [
    " (For a live blog on the U.S. stock market, click LIVE/ ortype LIVE/ in a news window)",
    "* Futures up: Dow 0.19%, S&P 500 0.13%, Nasdaq 0.35% ",
    "By Uday Sampath Kumar",
    "The decision, which Trump called \"a gesture of good will\",came after China moved to exempt some U.S. anti-cancer drugs andother goods from additional tariffs ahead of planned tradenegotiations between the world's two largest economies. urn:newsml:reuters.com:*:nL3N2621DV",
    "The United States will delay increasing tariffs on $250billion worth of Chinese imports from Oct. 1 to Oct. 15, Trumptweeted.",
    "However, lingering concerns of slowing global growth pushedgold prices higher and lifted shares of miners such as BarrickGold CorpGOLD.N , AngloGold Ashanti LtdAU.N and Gold FieldsLtd GFI.N between 1.7% and 4.1%. GOL/",
    "Later on Thursday, the European Central Bank (ECB) isexpected to offer new stimulus measures to help boost the eurozone's flagging economies.",
    "Analysts said while the U.S. economy is largely insulatedfrom the troubles of Europe, investors might sell out in casethe ECB delivered a more hawkish policy decision than expected. ",
    "Data on August U.S. consumer prices is expected at 8:30 a.m.ET, ahead of the Federal Reserve's policy decision on interestrate cuts next week.",
    "The Labor department is expected to report a 0.1% increasein the Consumer Price Index for August, following a 0.3% gain inJuly.",
    "At 7:14 a.m. ET, Dow e-minis 1YMcv1 were up 51 points, or0.19%. S&P 500 e-minis EScv1 were up 4 points, or 0.13% andNasdaq 100 e-minis NQcv1 were up 27.75 points, or 0.35%.",
    "Among other stocks, Caterpillar IncCAT.N and Deere & CoDE.N fell after Wells Fargo downgraded both stocks to \"marketperform\".",
    "Baker Hughes BHGE.N was down 1.8% after General ElectricCo GE.N began divestment of its stake in the oilfield servicesprovider, aiming to raise $2.7 billion. urn:newsml:reuters.com:*:nL2N26301K",
    "Activision Blizzard IncATVI.O rose 2% after twobrokerages raised their price targets on the stock. (Reporting by Uday Sampath in Bengaluru; Editing by ShounakDasgupta) ((UdaySampath.Kumar@thomsonreuters.com; within U.S.+1 646 2238780; Twitter: @sampath_uday; Reuters Messaging:UdaySampath.Kumar.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-12 07:37:00"
}