{
  "url": "https://www.nasdaq.com/article/us-stocksweak-factory-data-trade-frictions-pull-wall-street-lower-20190903-00886",
  "title": "US STOCKS-Weak factory data, trade frictions pull Wall Street lower - Nasdaq.com",
  "text": [
    " (For a live blog on the U.S. stock market, click LIVE/ ortype LIVE/ in a news window.)",
    "* U.S. factory sector shrinks for first time since 2016",
    "* Tech stocks weigh most on S&P 500",
    "* Indexes fall: Dow 1.37%, S&P 500 0.85%, Nasdaq 0.98%  (Updates prices, adds comments)",
    "By Uday Sampath Kumar",
    "Sept 3 (Reuters) - U.S. stocks fell on Tuesday as datashowed factory activity contracted for the first time since 2016in August, renewing fears that a drawn-out trade war between theUnited States and China could tip the world's largest economyinto recession.    ",
    "The Institute for Supply Management said its index ofnational factory activity decreased to 49.1, compared with areading of 51.1 estimated by analysts polled by Reuters. urn:newsml:reuters.com:*:nL2N25R073",
    "The weak data also weighed on U.S. Treasury yields, with thebenchmark 10-year yield US10YT=RR falling to its lowest sinceJuly 2016. Shares of banks .SPXBK , which typically come underpressure in a low interest rate environment, slid 2.1%.",
    "\"A contraction in the manufacturing sector, which we haven'tseen for a very long time, is important because it has atendency to be a leading indicator for the rest of the economyincluding the services sector,\" said Randy Frederick, vicepresident of trading and derivatives for Charles Schwab inAustin.",
    "\"The signals (for a recession) have been lining up and this is one of them,\" Frederick said, adding that a downturn by latenext year is \"very realistic.\" ",
    "U.S. stocks opened lower as the lack of progress onnegotiations between Washington and Beijing amid a new round oftariffs kicking in over the weekend weighed on sentiment.",
    "The United States on Sunday began imposing 15% tariffs on avariety of Chinese goods, and China began imposing new duties onU.S. crude oil.",
    "The energy sector .SPNY tumbled 1.7%, as rising OPEC andRussian crude output also drove a slump in oil prices. O/R",
    "Trade-sensitive industrials .SPLRCI slipped 1.7%, whiletechnology stocks .SPLRCT fell 1.2%. ",
    "Chipmakers, which draw a large portion of their revenue fromChina, also fell, with the Philadelphia Semiconductor index .SOX down 1.9%.",
    "The S&P 500 index fell 1.8% in August, its biggest monthlydrop since May, after escalating trade tensions and theinversion of a key part of the U.S. yield curve, seen as a signof recession, drove investors toward safe-haven assets.",
    "However, trade tensions were dialed down last week followingsignals that Beijing and Washington would meet in September fortalks, but Bloomberg reported on Monday that the two sides werestruggling to agree on a date for the planned meeting.",
    "At 11:23 a.m. ET the Dow Jones Industrial Average .DJI wasdown 361.35 points, or 1.37%, at 26,041.93 and the S&P 500 .SPX was down 24.80 points, or 0.85%, at 2,901.66. ",
    "The Nasdaq Composite .IXIC was down 78.11 points, or0.98%, at 7,884.78.",
    "Weighing the most on the Dow were shares of Boeing CoBA.N , which tumbled 3.4% after the Federal AviationAdministration said on Friday a global panel of experts willneed a few more weeks to finish its review into the company's737 MAX certification. urn:newsml:reuters.com:*:nL2N25Q1EF",
    "U.S. casino operators felt the brunt of slowing economicgrowth in China as gambling hub Macau posted weak August casinorevenue. Shares of Wynn Resorts LtdWYNN.O , Las Vegas SandsCorp LVS.N and MGM Resorts InternationalMGM.N fell between2.4% and 4.5%. urn:newsml:reuters.com:*:nL3N25U2WY",
    "Among few gainers were the defensive utilities .SPLRCU ,real estate .SPLRCR and consumer staples .SPLRCS sectors. ",
    "Declining issues outnumbered advancers for a 2.10-to-1 ratioon the NYSE and for a 2.80-to-1 ratio on the Nasdaq.",
    "The S&P index recorded 33 new 52-week highs and eight newlows, while the Nasdaq recorded 35 new highs and 103 new lows.  (Reporting by Uday Sampath and Shreyashi Sanyal in Bengaluru;Editing by Anil D'Silva and Arun Koyyur) ((UdaySampath.Kumar@thomsonreuters.com; within U.S.+1 646 2238780; Twitter: @sampath_uday; Reuters Messaging:UdaySampath.Kumar.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-03 11:40:00"
}