{
  "url": "https://www.nasdaq.com/article/gold-eases-as-equities-gain-on-brexit-hong-kong-progress-20190904-01236",
  "title": "Gold eases as equities gain on Brexit, Hong Kong progress - Nasdaq.com",
  "text": [
    "Sept 5 (Reuters) - Gold prices fell on early Thursday, with an uptick in equities propped up by positive developments around Brexit deadlock and Hong Kong protests, but prices hovered near over six-year high hit in the last session on persistent concerns about slowing global growth.",
    "FUNDAMENTALS",
    "* U.S. gold futures  were down 0.2% at $1,557.8 an ounce.",
    "* The dollar index , which measures the greenback against a basket of currencies, dipped to a one-week low, while Asian stocks perked up on progress in the political crises in Britain and Hong Kong. USD/MKTS/GLOB",
    "* Hong Kong leader Carrie Lam, in a pre-recorded televised message, on Wednesday formally withdrew the bill, acceding to one of the five demands by pro-democracy protesters, although many demonstrators and lawmakers said the move was too little, too late. ",
    "* The British parliament voted on Wednesday to prevent Prime Minister Boris Johnson taking Britain out of the European Union without a deal on Oct. 31, but rejected his first bid to call a snap election two weeks before the scheduled exit. ",
    "* The U.S. economy grew at a modest pace in recent weeks, with manufacturing buffeted by a global slowdown while consumer purchases gave mixed signals on the strength of household spending, the Federal Reserve reported on Wednesday.  []",
    "* Christine Lagarde took a major step towards becoming the European Central Bank's next president on Wednesday, securing the backing of a European Parliament committee after pledging to keep policy loose while undertaking a broader strategy review. ",
    "* The London Metal Exchange's gold and silver futures are being thrown into doubt, with the imminent resignation of Societe Generale  as a market maker threatening to deepen a decline in trading activity, three sources said. ",
    "* Holdings in SPDR Gold Trust , the world's largest gold-backed exchange-traded fund, rose 0.66% to 895.90 tonnes on Wednesday. ",
    "* India's gold imports plunged 73% in August from a year ago to the lowest level in three years as a rally in local prices to a record high and a hike in import duty discouraged retail buying, a government source said on Wednesday. ",
    "DATA AHEAD",
    "0600   Germany    Industrial Orders MM          July",
    "1230   U.S.       Initial Jobless Claims        Weekly",
    "1345   U.S.       Markit Comp, Svcs Final PMIs  Aug",
    "1400   U.S.       Factory Orders MM             July",
    "1400   U.S.       ISM N-Mfg PMI                 Aug"
  ],
  "published_datetime": "2019-09-04 09:59:00"
}