{
  "url": "https://www.nasdaq.com/article/crescent-point-energy-cpg-in-focus-stock-moves-6-higher-cm1207323",
  "title": "Crescent Point Energy (CPG) in Focus: Stock Moves 6% Higher - Nasdaq.com",
  "text": [
    "  Crescent Point Energy Corp. CPG  was a big mover last session, as the company saw its shares rise more than 6% on the day. The move came on solid volume too with far more shares changing hands than in a normal session. This breaks the recent trend of the company, as the stock is now trading above the volatile price range of $2.7700 to $3.2700 in the past one-month time frame.  makeArticleAd();  The company has seen no changes when it comes to estimate revision over the past few weeks, while the Zacks Consensus Estimate for the current quarter has also remained unchanged. The recent price action is encouraging though, so make sure to keep a close watch on this firm in the near future.    Crescent Point Energy currently has a Zacks Rank #3 (Hold) while its Earnings ESP  is 0.00%.    Crescent Point Energy Corporation Price         Crescent Point Energy Corporation price    |   Crescent Point Energy Corporation Quote   Investors interested in the Oil and Gas - Exploration and Production - Canadian industry may consider Gran Tierra Energy Inc. GTE  , which has a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here.     Is CPG going up? Or down? Predict to see what others think: Up  or Down   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Gran Tierra Energy Inc. (GTE): Free Stock Analysis Report   Crescent Point Energy Corporation (CPG): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " Crescent Point Energy Corp. CPG  was a big mover last session, as the company saw its shares rise more than 6% on the day. The move came on solid volume too with far more shares changing hands than in a normal session. This breaks the recent trend of the company, as the stock is now trading above the volatile price range of $2.7700 to $3.2700 in the past one-month time frame.  makeArticleAd();  The company has seen no changes when it comes to estimate revision over the past few weeks, while the Zacks Consensus Estimate for the current quarter has also remained unchanged. The recent price action is encouraging though, so make sure to keep a close watch on this firm in the near future.    Crescent Point Energy currently has a Zacks Rank #3 (Hold) while its Earnings ESP  is 0.00%.  ",
    " Crescent Point Energy Corporation Price ",
    "       Crescent Point Energy Corporation price    |   Crescent Point Energy Corporation Quote  ",
    " Crescent Point Energy Corporation price    |   Crescent Point Energy Corporation Quote ",
    "Investors interested in the Oil and Gas - Exploration and Production - Canadian industry may consider Gran Tierra Energy Inc. GTE  , which has a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here.     Is CPG going up? Or down? Predict to see what others think: Up  or Down ",
    " Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:42:00"
}