{
  "url": "https://www.nasdaq.com/article/3-burning-questions-investors-have-on-alphabet-stock-cm1210497",
  "title": "3 Burning Questions Investors Have on Alphabet Stock - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Repeatedly, Google parent  Alphabet's  (NASDAQ: GOOG, NASDAQ: GOOGL ) stock price keeps running into resistance in the $1,200-$1,300 per share range. Four times now, dating back to February 2018, rallies have stalled out at this level. Each time, there's been some new reason for concern.",
    "Google has faltered due to trade wars, tech stocks slumping and an earnings worry. Now there's another potential risk in the mix: regulatory crackdowns. Alphabet stock has slumped on regulatory issues before, namely when the European Union hit the firm with a large fine .",
    "However, 2019 has brought more and more trouble on this front domestically, raising various questions for Alphabet stock owners.",
    "It's become apparent that Alphabet is going to face a massive antitrust investigation. Earlier this year, the federal government announced a broad-reaching look into the big tech companies including GOOGL. Now, the states are getting into the act as well.",
    "In fact, on Monday, 50 states and territories announced that their attorneys general are looking into Google's practices. Only California and Alabama are avoiding the investigation, while the District of Columbia and Puerto Rico have gotten involved as well. Previously, Alphabet's backers had pointed to the fact that Texas was leading the inquiry as a sign that it could be a minor concern from a few biased folks. But with nearly every state now involved, Google will have to face critics from across the ideological spectrum.",
    "State attorney generals have historically realized that going after large, controversial companies can be a fast track to political power. And the fact that California isn't taking part is notable. California has enjoyed a ton of job and wealth creation from big tech. The other states have a definite economic incentive to try to loosen Alphabet's hold on the internet and digital advertising industries.",
    "With all the investigations, how will Alphabet stock hold up during the 2020 election cycle? On the one hand, a political election should be good news. There will be more search traffic and opportunities to sell ads as people plug into the election cycle. The last election was no doubt a big plus for rival  Twitter (NYSE: TWTR ).",
    "And don't forget that Google has more than just search advertising. YouTube, for example, hosts a ton of political and related content.",
    "But that starts to get in to the risks to Alphabet stock. Critics in particular have slammed Google for uneven policing of content on the video site. Some popular political content creators have been demonetized and others have been banned altogether. With President Donald Trump repeatedly claiming that Google tried to tip the scales in the last election, everyone will be watching Google closely.",
    "Regardless of the decisions that Alphabet's management makes, some people will be offended. It's inevitable on such a hot-button subject. With nearly all the states and the federal government investigating, Google needs to be on its best behavior during this upcoming election. But that could be expensive. Facebook (NASDAQ: FB ) has certainly had to pay a lot to improve its content policing after scandal.",
    "I've previously suggested that Facebook stock would be worth more as several independent companies rather than one giant one. Alphabet stock could easily rise in value if Google splits up into various entities as well.",
    "Think about it. Android is by far the world's leading operating system, accounting for more than 75% of all smartphones as of July 2019. Google search has a vast majority of the market in nearly all large countries other than China. YouTube is the world's dominant video site. Google's advertising platform has more than 30% market share with only Facebook being on nearly the same competitive level. Waymo could become the dominant self-driving vehicle platform.",
    "The list goes on and on. There are a multitude of highly successful businesses inside Alphabet stock. Right now, investors have to buy high-priced Alphabet stock to get access to any of them. If you split Google up into a few separate operating companies, investors could pick and choose which parts of the empire they wish to own.",
    "It's well known that companies with a large number of operations tend to develop a conglomerate discount. This means that the whole is worth less than the sum of the parts. This is, historically, why firms tend to spin off individual units that they own. Alphabet stock, like Facebook, could well be worth a lot more as many individual companies rather than one massive one. And in this specific case, it would solve most of Google's antitrust problems.",
    "The younger generation of investors seems fairly unconcerned about antitrust efforts. After all, it's been 20 years since the federal government in the U.S. has brought a monumental case against one of the nation's largest companies. And in that case,  Microsoft (NASDAQ: MSFT ) was able to dodge the worst of it, as a change in the U.S. Department of Justice's priorities allowed a path to a favorable settlement.",
    "But now, Google and the other big tech firms face what appears to be a persistent regulatory crackdown. And both political parties seem keen on reducing the power of the tech titans. As we've seen this week, nearly all the state attorneys general want in on the action as well. If you thought Trump was the only worry for Google on the regulation front, you made a mistake. That said, if Alphabet's management team makes wise moves, they could use this obstacle to generate more shareholder value in the long run.",
    "At the time of this writing, the author owned FB stock. You can reach him on Twitter at @irbezek.",
    "The post 3 Burning Questions Investors Have on Alphabet Stock appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:00:48"
}