{
  "url": "https://www.nasdaq.com/article/callaway-is-a-sheep-in-jack-wolfs-clothing-thanks-to-topgolf-cm1206873",
  "title": "Callaway Is a Sheep in Jack Wolf’s Clothing, Thanks to Topgolf - Nasdaq.com",
  "text": [
    "Anyone who enjoys hitting a golf ball or two has heard of Topgolf , a leisure concept that blends the driving range with Las Vegas-style leisure and entertainment. Topgolf launched in the US in 2005, and has grown to include over 50 locations in the US and 41 venues worldwide, and its popularity is spurring a resurgence in golf brands.",
    "Topgolf is making the sport accessible to new demographics and markets, thanks in part to Callaway Golf (NYSE: ELY) , which has helped the new entertainment concept boost its market position. A closer look at Callaway shows a company with a confident outlook buoyed by a growing market.",
    "Image source: Getty Images",
    "Interestingly, the World Golf Federation finds that 8.2 million of golf participants in 2016 never played on a golf course but visited \"alternative\" venues such as driving ranges. Overall, the combined count of those who participated in traditional golf and those hitting a golf ball at alternative venues reached 32 million, a figure that was 3% higher in 2016 than in 2015.",
    "The growth in golf is also a result of a healthier economy as the effects of the 2008/2009 financial crisis are finally subsiding in the consumer market.",
    "Unfortunately for entertainment investors, Topgolf is privately owned by the Joliffe brothers, and an IPO does not seem to be on the cards any time soon. Still, in 2006, the iconic golf brand Callaway become a leading investor in Topgolf  with a 14% stake and is now poised to hit the lottery in the event of a Topgolf IPO. Some estimates suggest that Topgolf could reach 1.8 billion in sales by 2020, up from $500 million in 2016, and Callaway's stake in Topgolf could be worth $600 million by 2020.",
    "The Vegas-style environment of Topgolf blends nightclub cocktails with the latest in digital golf technology, a combination that the Millennial and Gen X-er crowd appreciate. Also, according to the 2018 National Golf Foundation's new Golf Industry Report, thanks to new golf concepts such as Topgolf, the sport is more accessible and appealing to women and minorities; 35% of new players are women and 25% are non-Caucasian.\r\n The appeal of Topgolf and the growth of golf in general is also propelling the athleisure fashion market, and Callaway is in on that too.",
    "In January 2019, Callaway broadened its product line with the acquisition of the Germany-based Jack Wolfskin apparel brand for $476 million. The acquisition was confirmation of Callaway's push into the active lifestyle category after its successful 2017 acquisitions of outdoor gear and apparel companies TravisMathew and Ogio .",
    "Some might consider the company's move into the outdoor clothing and equipment market a risk and a move too far removed from its core competency, but it fits with Callaway's broader strategy of targeting a younger and more global audience.",
    "As for Callaway's recent financials, the company reported a total revenue increase in the second quarter 2019 of 12.72% year on year, which was above the average of its competitors. Sales growth at 4.37% was also above its competitors' average revenue growth recorded in the same quarter. Moreover, Callaway announced a stock buyback announcement of 5.9% per share and for the amount of $100 million in August, which could be indicator that the company feels undervalued by the market.",
    "Although Callaway's share price has lagged that of competitors since it acquired the Jack Wolfskin brand, stock traded higher in June after hedge fund Jana Partners disclosed a 9.5% stake . Jana Partners is the second largest-shareholder of Callaway, and the expectation is that it might encourage divestment of non-core assets to improve the stock's underperformance.",
    "Whatever influence Jana Partners might have on the future of Callaway, the golf brand looks set to gain from its current growth strategy. Callaway seems to be transforming itself from prey to predator at a time when there is plenty of prey to be had.",
    "10 stocks we like better than Callaway Golf\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Callaway Golf wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Caroline Banton has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:45:00"
}