{
  "url": "https://www.nasdaq.com/article/ely-vs-yeti-which-stock-should-value-investors-buy-now-cm1207996",
  "title": "ELY vs. YETI: Which Stock Should Value Investors Buy Now? - Nasdaq.com",
  "text": [
    " Investors interested in stocks from the Leisure and Recreation Products sector have probably already heard of Callaway Golf (ELY) and Yeti (YETI). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look. We have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits. Callaway Golf and Yeti are both sporting a Zacks Rank of # 2 (Buy) right now. Investors should feel comfortable knowing that both of these stocks have an improving earnings outlook since the Zacks Rank favors companies that have witnessed positive analyst estimate revisions. But this is just one factor that value investors are interested in. Value investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels. Our Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use. ELY currently has a forward P/E ratio of 16.59, while YETI has a forward P/E of 26.38. We also note that ELY has a PEG ratio of 0.66. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. YETI currently has a PEG ratio of 1.56. Another notable valuation metric for ELY is its P/B ratio of 2.17. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, YETI has a P/B of 38.08. These are just a few of the metrics contributing to ELY's Value grade of A and YETI's Value grade of C. Both ELY and YETI are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that ELY is the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Callaway Golf Company (ELY): Free Stock Analysis Report   YETI Holdings, Inc. (YETI): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors interested in stocks from the Leisure and Recreation Products sector have probably already heard of Callaway Golf (ELY) and Yeti (YETI). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look.",
    "We have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits.",
    "Callaway Golf and Yeti are both sporting a Zacks Rank of # 2 (Buy) right now. Investors should feel comfortable knowing that both of these stocks have an improving earnings outlook since the Zacks Rank favors companies that have witnessed positive analyst estimate revisions. But this is just one factor that value investors are interested in.",
    "Value investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels.",
    "Our Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use.",
    "ELY currently has a forward P/E ratio of 16.59, while YETI has a forward P/E of 26.38. We also note that ELY has a PEG ratio of 0.66. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. YETI currently has a PEG ratio of 1.56.",
    "Another notable valuation metric for ELY is its P/B ratio of 2.17. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, YETI has a P/B of 38.08.",
    "These are just a few of the metrics contributing to ELY's Value grade of A and YETI's Value grade of C.",
    "Both ELY and YETI are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that ELY is the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:40:10"
}