{
  "url": "https://www.nasdaq.com/article/aurora-cannabis-revenue-misses-on-lower-prices-shares-fall-20190911-00853",
  "title": "Aurora Cannabis revenue misses on lower prices; shares fall - Nasdaq.com",
  "text": [
    "By Debroop Roy",
    "Sept 11 (Reuters) - Canadian company Aurora Cannabis Inc  pushed back its profitability timeline to fiscal 2020 on Wednesday after missing its earlier target of the fourth quarter, blaming the slow roll-out of retail outlets for recreational marijuana.",
    "Canada became the first G7 country to legalize recreational marijuana late last year but sales have been dampened by supply constraints and higher prices than those on the black market.",
    "\"Based on our internal forecast, we are very confident that we are going to reach profitability in fiscal 2020.\"",
    "Cannabis companies in Canada including rivals such as Canopy Growth Corp  have been spending heavily to expand and take a larger share of the nascent market, resulting in some surprising results that have spooked investors waiting for profitability.",
    "Aurora's U.S.-listed shares fell about 10% in after-hours trading after it missed revenue estimates for the quarter due to lower prices. It posted revenue of C$98.9 million ($74.95 million), below the C$108.3 million that analysts had expected, according to IBES data from Refinitiv.",
    "Matt Markiewicz, managing director of The Cannabis ETF which invests in Aurora, called the company's results a \"mixed bag\" and said that given the uncertain outlook heading into the fourth quarter the stock would be volatile for the next few days",
    "Aurora said the average net selling price of cannabis fell by C$1.08 per gram to C$5.32 per gram in the fourth quarter from the third, primarily due to an increase in sales to recreational and wholesale markets that yield lower prices than medical markets.",
    "The Edmonton, Alberta-based company sold 17,793 kgs of cannabis in the quarter ended June 30, up from 9,160 kgs in the preceding quarter.",
    "($1 = 1.3196 Canadian dollars)"
  ],
  "published_datetime": "2019-09-11 05:48:00"
}