{
  "url": "https://www.nasdaq.com/article/why-etsy-fell-212-in-august-cm1210812",
  "title": "Why Etsy Fell 21.2% in August - Nasdaq.com",
  "text": [
    " What happened Shares of   Etsy    (NASDAQ: ETSY) dropped 21.2% in August, according to data from   S&P Global Market Intelligence    , as the market reacted to the vintage- and handmade-centric   e-commerce site's second-quarter results. To be sure, virtually all of Etsy's plunge came at the start   of last month, with the stock down 20% in the two trading days   after its quarterly update hit the wires. But that's not to say   Etsy's performance   looked    bad at first glance.   IMAGE SOURCE: GETTY IMAGES.makeArticleAd();  So what To the contrary, Etsy's second-quarter revenue grew 37% year   over year to $181 million, translating to net income of $18.2   million, or $0.14 per share (up from $0.03 per share a year   earlier). Analysts, on average, were modeling slightly lower   earnings of $0.13 per share, but on slightly higher revenue of   $183 million. Still, Etsy CEO Josh Silverman called the company's growth   last quarter \"excellent,\" crediting \"solid execution across   [Etsy's] portfolio of product and marketing investments and the   strength of [its] core marketplace.\" So why the decline? First, it's worth keeping in mind Etsy stock was already up   45% year to date leading into its announcement, leaving some   traders more than willing to take profits on the heels of a   technically mixed report. It also didn't help that growth in Etsy's services revenue --   up 16.2% year over year to $45.9 million -- decelerated   significantly from the 29% increase the same segment achieved in   Q1. Marketplace revenue, on the other hand, soared a whopping   47.2% to $181.1 million, while gross merchandise sales (GMS) grew   21.4% to $1.095 billion. Now what Etsy also boosted its full-year guidance for both GMS (up 20%   to 22%, versus an 18% to 21% growth target before) and revenue   (up 32% to 34%, an increase from 30% to 32% previously), while   simultaneously reducing its outlook for adjusted   EBITDA    margin to be 22% to 24% (down from its old range of 23% to   25%). To blame for the latter, according to Etsy management during   the   subsequent conference call    , was the \"short-term absorption of zero-margin revenue\" stemming   from the company's new unified advertising platform. Over the   longer term, however, that platform should also allow the company   to make greater investments toward \"upper-funnel\" marketing   channels (think television and digital video) to increase brand   awareness and -- in turn -- drive incremental growth over the   longer term. For investors willing to buy on the pullback and watch this   story play out, I think Etsy could be one of the most compelling   portfolio candidates    our market has to offer today.   10 stocks we like better than Etsy       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Etsy wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Steve Symington      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Etsy. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   Etsy    (NASDAQ: ETSY) dropped 21.2% in August, according to data from   S&P Global Market Intelligence    , as the market reacted to the vintage- and handmade-centric   e-commerce site's second-quarter results.",
    "To be sure, virtually all of Etsy's plunge came at the start   of last month, with the stock down 20% in the two trading days   after its quarterly update hit the wires. But that's not to say   Etsy's performance   looked    bad at first glance.",
    "  IMAGE SOURCE: GETTY IMAGES.makeArticleAd(); ",
    "IMAGE SOURCE: GETTY IMAGES.",
    "To the contrary, Etsy's second-quarter revenue grew 37% year   over year to $181 million, translating to net income of $18.2   million, or $0.14 per share (up from $0.03 per share a year   earlier). Analysts, on average, were modeling slightly lower   earnings of $0.13 per share, but on slightly higher revenue of   $183 million.",
    "Still, Etsy CEO Josh Silverman called the company's growth   last quarter \"excellent,\" crediting \"solid execution across   [Etsy's] portfolio of product and marketing investments and the   strength of [its] core marketplace.\"",
    "So why the decline?",
    "First, it's worth keeping in mind Etsy stock was already up   45% year to date leading into its announcement, leaving some   traders more than willing to take profits on the heels of a   technically mixed report.",
    "It also didn't help that growth in Etsy's services revenue --   up 16.2% year over year to $45.9 million -- decelerated   significantly from the 29% increase the same segment achieved in   Q1. Marketplace revenue, on the other hand, soared a whopping   47.2% to $181.1 million, while gross merchandise sales (GMS) grew   21.4% to $1.095 billion.",
    "Etsy also boosted its full-year guidance for both GMS (up 20%   to 22%, versus an 18% to 21% growth target before) and revenue   (up 32% to 34%, an increase from 30% to 32% previously), while   simultaneously reducing its outlook for adjusted   EBITDA    margin to be 22% to 24% (down from its old range of 23% to   25%).",
    "To blame for the latter, according to Etsy management during   the   subsequent conference call    , was the \"short-term absorption of zero-margin revenue\" stemming   from the company's new unified advertising platform. Over the   longer term, however, that platform should also allow the company   to make greater investments toward \"upper-funnel\" marketing   channels (think television and digital video) to increase brand   awareness and -- in turn -- drive incremental growth over the   longer term.",
    "For investors willing to buy on the pullback and watch this   story play out, I think Etsy could be one of the most compelling   portfolio candidates    our market has to offer today.",
    "  10 stocks we like better than Etsy       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Etsy wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Etsy       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Etsy wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Steve Symington      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Etsy. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:24:00"
}