{
  "url": "https://www.nasdaq.com/article/forexdollar-yen-slip-as-global-tensions-ease-pound-rallies-20190904-01085",
  "title": "FOREX-Dollar, yen slip as global tensions ease, pound rallies - Nasdaq.com",
  "text": [
    "    * Hong Kong, Italy, Britain news helps risk appetite",
    "* Euro lifted away from 28-month lows, Lagarde comments help",
    "* Sterling jumps as UK lower house moves to block no-dealBrexit",
    "By Gertrude Chavez-Dreyfuss",
    "NEW YORK, Sept 4 (Reuters) - The safe-haven dollar and yenfell on Wednesday after global political worries eased with whatmarkets perceived as positive news in Hong Kong, Italy andBritain.",
    "Sterling rallied above $1.22 on Wednesday for the first timesince Aug. 30 as investors grew more optimistic after Britishlawmakers took another step in an attempt to block a no-dealBrexit. urn:newsml:reuters.com:*:nL5N25V1FB",
    "The dollar index slid for a second straight session, whilethe yen, which draws safe-haven bids in times of geopoliticalstress, dropped for the first time in four days against thegreenback.",
    "Risk appetite rose on news that Hong Kong leader Carrie Lamwas withdrawing an extradition bill that triggered months ofoften violent protests. urn:newsml:reuters.com:*:nL3N25V0NC",
    "Edward Moya, senior market analyst at OANDA in New York,said the dollar's weakness was triggered by this \"risk-on movein Hong Kong that gave Hong Kong equities one of the best movesin a few years.\" That has boosted appetite for riskiercurrencies that have generally higher yields, he added.",
    "\"Everyone has been waiting for this major dollar reversalfor quite some time,\" Moya said. \"This is providing a little bitof unwinding of some dollar bullish positions.\"",
    "In Italy, Prime Minister Giuseppe Conte unveiled a newcabinet that united the anti-establishment 5-Star Movement andthe centre-left Democratic Party, an unlikely coalition that isexpected to improve ties with the European Union. urn:newsml:reuters.com:*:nL5N25V42V",
    "In late U.S. trading, the dollar was last down 0.57% againsta basket of major currencies, at 98.438 .DXY .",
    "The yen fell against the dollar, which rose 0.38% to 106.36yenJPY=EBS . It also declined against the euro, which gained0.89% to 117.32 yenEURJPY=EBS .",
    "The euro also rose 0.52% versus the dollar to $1.10295EUR=EBS after comments from Christine Lagarde, who will likelybe the European Central Bank's next president, introduced somedoubt over the scale of an ECB stimulus package expected nextweek.",
    "Lagarde said highly accommodative monetary policy for aprolonged period was necessary but she added that the bankneeded to be mindful of the negative side-effects of such tools. urn:newsml:reuters.com:*:nF9N23X016",
    "Expectations for an interest rate cut, the relaunch of assetpurchases and other ECB measures to stimulate the economy haveweighed on the euro. On Tuesday, it hit a 28-month low around$1.0924.",
    "Meanwhile, sterling jumped 1.15% to $1.2226GBP=D3 , andagainst the euro it rallied 0.65% to 90.22 penceEURGBP=D3 .",
    "The lower house of the British parliament voted on Wednesdayto prevent Prime Minister Boris Johnson taking Britain out ofthe EU without a deal, but he proposed a snap election on Oct.15, just weeks before Brexit, to free his hands. urn:newsml:reuters.com:*:nL5N25V2FD========================================================",
    "Currency bid prices at 4:19PM (2019 GMT) Description      RIC         Last           U.S. Close  Pct Change     YTD Pct     High Bid    Low Bid",
    "                                          Previous                   Change                 ",
    "                                          Session                                            Euro/Dollar      EUR=        $1.1027$1.0972     +0.50%         -3.85%      +1.1037     +1.0969 Dollar/Yen       JPY=        106.3300       105.9200    +0.39%         -3.56%      +106.4300   +105.8400 Euro/Yen         EURJPY=     117.29         116.24      +0.90%         -7.07%      +117.4000   +116.1400 Dollar/Swiss     CHF=        0.9807         0.9866      -0.60%         -0.07%      +0.9883     +0.9799 Sterling/Dollar  GBP=        1.2224         1.2084      +1.16%         -4.18%      +1.2229     +1.2079 Dollar/Canadian  CAD=        1.3225         1.3332      -0.80%         -3.02%      +1.3344     +1.3218 Australian/Doll  AUD=        0.6795         0.6757      +0.56%         -3.60%      +0.6800     +0.6756 ar                                                                                              Euro/Swiss       EURCHF=     1.0816         1.0828      -0.11%         -3.89%      +1.0860     +1.0812 Euro/Sterling    EURGBP=     0.9021         0.9078      -0.63%         +0.41%      +0.9085     +0.9018 NZ               NZD=        0.6359         0.6334      +0.39%         -5.33%      +0.6364     +0.6327 Dollar/Dollar                                                                                   Dollar/Norway    NOK=        9.0300         9.1004      -0.77%         +4.53%      +9.1066     +9.0279 Euro/Norway      EURNOK=     9.9598         9.9889      -0.29%         +0.54%      +9.9935     +9.9605 Dollar/Sweden    SEK=        9.7380         9.8197      -0.33%         +8.64%      +9.8253     +9.7280 Euro/Sweden      EURSEK=     10.7410        10.7771     -0.33%         +4.65%      +10.7771    +10.7320",
    " (Reporting by Gertrude Chavez-Dreyfuss; Additional reporting byTommy Wilkes in London, Richard Leong in New YorkEditing by Paul Simao and Sonya Hepinstall) ((gertrude.chavez@thomsonreuters.com; 646-223-6322; ReutersMessaging: rm://gertrude.chavez.reuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-04 04:27:00"
}