{
  "url": "https://www.nasdaq.com/article/plotting-sterlings-latest-lurch--just-how-low-did-it-go-20190903-00780",
  "title": "Plotting sterling's latest lurch - just how low did it go? - Nasdaq.com",
  "text": [
    "By Tommy Wilkes and Saikat Chatterjee",
    "LONDON, Sept 3 (Reuters) - Britain's currency tumbled below $1.20  on Tuesday, the first time it has breached that level since a \"flash crash\" in October 2016, as fears over Brexit and a possible general election escalated sharply. ",
    "If that flash crash is excluded, sterling is now trading back at levels not seen since 1985, creating confusion on Tuesday about where the pound is now positioned historically and what new lows it clocked as UK political uncertainty deepens.",
    "SO WHAT HAPPENED IN OCTOBER 2016?",
    "Flash crashes are events in which a currency undergoes a sudden, dramatic and often quickly-reversed price swing. They usually occur when market depth is thin and a buy or sell order - sometimes an accidental one - cascades into a violent market move.",
    "Back in October 2016, three months after Britain voted to leave the European Union, sterling lost almost a tenth of its value in minutes in Asia trading, hitting a low on the Refinitiv trading system of $1.1491. It also shed more than 6% versus the euro to 94.03 pence , some way from Tuesday's levels of 91.47 pence.",
    "The flash crash lows were later confirmed by Thomson Reuters, then owner of the foreign exchange trading platform with the biggest market share for trading the pound. That platform is now majority owned by Refinitiv.",
    "Prices on other platforms may differ, but Refinitiv's is the most widely followed for trading in the British currency.",
    "WHY DOES IT MATTER?",
    "Given the flash crash low was so brief and quickly reversed, some might think it would be better to exclude such an event altogether. Doing so would generate headlines that the pound had fallen to levels not seen since the middle of former Conservative leader Margaret Thatcher's 11 years as premier.",
    "But analysts said that the flash crash low is a recognised price used for setting financial derivative contracts. Although inquiries were vague about the triggers for the crash - some cited Brexit-related headlines hitting in highly illiquid trading hours - central bankers who investigated the plunge agreed that the pound traded at the sub-$1.15 level.",
    "Lows and highs matter in the global forex industry, because investors often line up their bets to happen when such levels are breached.",
    "\"I think $1.15 in any case is an obvious magnet for GBP bears in the context of Brexit and the perception/angst of how low cable can drop in the worst case event of a 'no deal' or new elections and a (Labour leader Jeremy) Corbyn government,\" said Kenneth Broux, an FX strategist at Societe Generale.",
    "None of this is to downplay the significance of sterling's recent rout. ",
    "Should the pound plummet further and breach the 2016 low of $1.1491, the British currency would be in territory only seen during a few months in late 1984 and early 1985.",
    "The all-time low was $1.0545 touched in March 1985, just before G7 powers acted to rein in the superdollar of the Reagan era in the so-called \"Plaza Accord\".",
    "It's a level some investors believe would be tested in the panicked aftermath of a no-deal Brexit, with parity against both euro and dollar far from out of the question. "
  ],
  "published_datetime": "2019-09-03 09:33:00"
}