{
  "url": "https://www.nasdaq.com/article/8chan-owner-to-restrict-some-access-during-emergencies-house-panel-testimony-20190905-00917",
  "title": "8chan owner to restrict some access during emergencies -House panel testimony - Nasdaq.com",
  "text": [
    "By David Shepardson",
    "WASHINGTON, Sept 5 (Reuters) - 8chan, the online message board linked to several recent mass shootings, plans to restrict parts of the website during a \"state of emergency,\" the site's owner Jim Watkins told a U.S. House panel in a written statement.",
    "\"If 8chan comes back online, it will be done when 8chan develops additional tools to counter illegal content under United States law,\" Watkins said in the statement released by his lawyer.",
    "The comments were posted ahead of a closed door deposition of Watkins on Wednesday after the U.S. House Homeland Security Committee last month subpoenaed the American living in the Philippines to answer its questions.",
    "Critics last month pressed tech companies to shun 8chan, which in its Twitter profile describes its location as \"The Darkest Reaches of the Internet\" and has become a hotbed for white extremist content.",
    "Representative Bennie Thompson, a Democrat and the panel's chairman, and Mike Rogers, its ranking Republican, said in a joint statement that the shooting deaths of 22 people at an El Paso Walmart store was \"at least the third act of supremacist violence linked to your website this year.\"",
    "\"Receiving testimony from Mr. Watkins is critical to our oversight on this matter,\" they added.",
    "Benjamin Barr, a lawyer for Watkins, said in a statement to the committee, that \"8chan has never tolerated illegal speech and has a consistent track record of working with law enforcement agencies when appropriate.\"",
    "Watkins said 8chan \"has worked responsibly with law enforcement agencies when unprotected speech is discovered on its platform. No single platform can sensibly prevent all hateful, illegal, or threatening speech - it can only act in due time to remove it.\"",
    "The company did remove some posts soon after mass shootings in Texas, California and New Zealand, he said.",
    "But Watkins added \"my company has no intention of deleting constitutionally protected hate speech. I feel the remedy for this type of speech is counter speech, and I'm certain that this is the view of the American justice system.\"",
    "The message board has been voluntarily down since late August."
  ],
  "published_datetime": "2019-09-05 01:44:00"
}