{
  "url": "https://www.nasdaq.com/article/sp-dow-retake-milestones-and-get-within-1-of-new-highs-cm1210834",
  "title": "S&P, Dow Retake Milestones and Get Within 1% of New Highs - Nasdaq.com",
  "text": [
    "SPECIAL ALERT: Remember, the September episode of the Zacks Ultimate Strategy Session is now available for viewing! Don't miss your chance to hear:",
    "• Tracey Ryniec and Neena Mishra, CFA, FRM, Agree to Disagree on whether the Fed should cut rates at its September meeting\r\n • Kevin Matras answers questions covering China and tariffs, inverted yield curve, threat of recession and interest rates\r\n • Sheraz Mian and John Blank, PhD, choose one portfolio to give feedback for improvement\r\n • Market conditions from both fundamental and technical views\r\n • The full list of top-performing stocks over the past 30 days\r\n • New stocks added to the Zacks Ultimate portfolio\r\n • And much more\r\n Simply log on to Zacks.com and view the September episode here. And please let us know what you think of these monthly episodes. Email all feedback to mailbag@zacks.com.\r\n The market is partying like its late July as stocks continued their steady trek to new highs on Wednesday. The major indices rallied right into the close and finished at their highs of the session.\r\n The Dow got back above 27,000 with an advance of 0.85% (or 227 points) to 27,137.04. It has now closed in the green for six straight sessions.\r\n The S&P rose 0.72% to 3000.93, putting it above 3000 for the first time in months.\r\n These indies are now within 1% of making new highs last reached in July, which is pretty impressive for a market that was petrified of a recession just a few weeks ago.  \r\n The NASDAQ saw the best performance on a percentage basis and broke its three-day losing streak. The index jumped 1.06% today (or about 85 points) to 8169.68.  \r\n Tech had a few rough sessions lately, but Apple is helping the space get back on track. Shares jumped 3.2% in the wake of yesterday's investor event, which included several new products with price points that the market appreciated.\r\n Most importantly perhaps, its upcoming Apple TV+ streaming service will be much cheaper than competitors at $4.99 a month.\r\n Stocks have two things to look forward to in the near term. Firstly, the Fed has a meeting next week that is widely expected to include another rate cut. The odds are high for a quarter-point easing, though some are still hoping for a half-point.\r\n And early next month, U.S. and Chinese negotiators are scheduled for meetings in Washington D.C. Investors have been more encouraged about trade ever since the new talks were announced last Thursday, though they're likely to remain skeptical until a real deal is reached.\r\n We should all remember, though, that these good times could be spoiled at a moment's notice by a news headline or presidential tweet. But let's worry about that if (or when) it happens! Today's Portfolio Highlights:Home Run Investor: The portfolio got a bit more diversified on Wednesday when Brian added Hanger (HNGR), a Zacks Rank #1 (Strong Buy) orthotic and prosthetic patient care company that distributes O&P products and rehabilitative solutions. The company beat by 16% in its most recen t report and has an attractive valuation. Furthermore, as its Zacks Rank attests, earnings estimates are moving slowly by surely higher. The editor also got out of construction plays Construction Partners (ROAD) and Quanex Building Products (NX) with gains of 9% and 4.4%, respectively. Get more specifics on today's moves in the full write-up.Counterstrike: The recent selloff in momentum has finally provided Jeremy with enough reason to get involved. On Wednesday, the editor added three names with small positions and plans to add more when support is confirmed. He picked up Smartsheet (SMAR), Paycom (PAYC) and Fortinet (FTNT) with 4% allocations each. SMAR is a Zacks Rank #1 (Strong Buy) software solutions provider, while the other two are Zacks Rank #2s (Buys). The complete commentary has specifics on each of the new buys. Surprise Trader:\"The bid that showed up late yesterday continued on throughout the session today. What's even more encouraging is the late day rally which showed up again for the third day in a row. That sort of systematic buying is what bull markets are made of.\r\n \"This feels similar to the last rally the market had to all-time highs where it felt like nobody thought it was coming and couldn't believe it lasted as long as it did. Of course, this could all change with next week's FOMC meeting.\r\n \"Retail sales data on the way, along with some ECB action. I doubt the ECB will move the needle much as the FOMC will next week. This rally could keep chugging along ahead of that.\" -- Dave Bartosiak\r\n Until Tomorrow,\r\n Jim Giaquinto",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 02:00:19"
}