{
  "url": "https://www.nasdaq.com/article/schlumberger-ceo-outlines-digital-strategy-plans-q3-writedown-20190904-01173",
  "title": "Schlumberger CEO outlines digital strategy, plans Q3 writedown - Nasdaq.com",
  "text": [
    "By Liz Hampton and Nishara Karuvalli Pathikkal",
    "Sept 3 (Reuters) - Schlumberger NV's  newly-appointed Chief Executive Officer Olivier Le Peuch on Wednesday outlined his vision for the world's largest oilfield services company, vowing to exit unprofitable businesses, restructure some units and focus on returns.",
    "In his first public remarks since taking office in July, the 32-year company veteran also warned the company would record a sizeable, non-cash charge to write down assets in the current quarter. He did not specify the size of the writedown.",
    "\"We are setting an ambition to more than double the contribution of our digital businesses within the foreseeable future,\" said Le Peuch.",
    "The costly investments in customer projects and the recent $430 million acquisition of hydraulic fracturing equipment unsettled investors and contributed to Schlumberger's 69% share declined over the last five years.",
    "\"The Schlumberger of tomorrow will not be the Schlumberger of today,\" Le Peuch told investors at the Barclays CEO Energy-Power Conference in New York. Improved returns will take priority over revenue growth, he said.",
    "Schlumberger will exit unprofitable businesses and continue to try to sell stakes in ventures under the Schlumberger Production Management group, which was seen by some as competing with customers. SPM staff will form a new asset performance solutions group, Le Peuch said.",
    "Kibsgaard last year said the company wanted to sell stakes in some projects including in Canada and Argentina.",
    "\"We are committing not to take equity positions in oil and gas assets,\" Le Peuch said.",
    "Analysts and investors are looking to Le Peuch to steer Schlumberger back to its roots, and navigate through a new era of digitalization underway in the oil and gas industry. ",
    "\"Former CEO Paal Kibsgaard was engaged in an almost dizzying array of initiatives,\" analysts for Jefferies wrote in a note this week ahead of Le Peuch's presentation. ",
    "\"We expect new CEO Le Peuch just to emphasize fewer things and so portray a more focused organization,\" they added. ",
    "The North American business has faced \"significant pressure\" and \"unsustainable margin compression down to mid-single digits,\" Le Peuch also said. He said he would prioritize strategic review of the North American portfolio.",
    "Schlumberger shares were up 4% at $33.11 in afternoon trading."
  ],
  "published_datetime": "2019-09-04 02:50:00"
}