{
  "url": "https://www.nasdaq.com/article/huntington-hban-displays-organic-growth-time-to-hold-cm1210399",
  "title": "Huntington (HBAN) Displays Organic Growth: Time to Hold? - Nasdaq.com",
  "text": [
    "  Huntington Bancshares Incorporated HBAN  has been benefiting from rising fee income, improving credit quality, rising margins and strategic investments through mergers and acquisitions (M&A). However, significant exposure to commercial loans, along with rising expenses, is on the downside.  makeArticleAd();  Diversified fee-income base, strategic acquisitions, and rising loans and deposits balance aided the company to rally 20.6% year to date compared with 8.2% growth recorded by the industry  .    The company's earnings estimates for the current year and the next year have remained unchanged, in the last 30 days. Therefore, it currently carries a Zacks Rank #3 (Hold).      Huntington has witnessed continued growth in deposit balance in the last few years. Also, loans improved backed by its commendable performance in the commercial and consumer portfolio. Management predicts average loans and leases to escalate about 4-5% on an annual basis, while average total deposits will likely be up around 2-3%. The company remains particularly focused on growing core deposits through acquiring core checking accounts and strengthening customer relationships.    Supported by its strong liquidity position, Huntington continues to expand through acquisitions. In 2016, the company completed its acquisition of FirstMerit Corporation, resulting in a larger market presence and more diversified loan portfolio, along with a wider core deposit funding base.    Huntington's non-interest expenses witnessed a CAGR of 8.9% over the last five years (ended 2018), with the trend continuing in the first six months of 2019 as well. The company is making investments in digital, data and technology enhancements that will bolster its existing capabilities and infrastructure. Therefore, a persistent uptrend in expenses is expected, which might limit the company's profitability and operational efficiency. Notably, management expects expenses to rise 2-4% this year.    Additionally, Huntington's loan portfolio consists of nearly 50% of commercial loans. Such high exposure to commercial loans depicts lack of diversification, which can be risky for the company amid challenging economy and competitive markets.   Stocks to Consider    First Business Financial Services, Inc. FBIZ  has been witnessing upward estimate revisions, for the past 60 days. Moreover, this Zacks #2 (Buy) Ranked stock has rallied more than 17%, year to date. You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .    MidWestOne Financial Group, Inc. MOFG  has been witnessing upward estimate revisions, for the past 60 days. Also, the company's shares have gained nearly 23.6% year to date. At present, it carries a Zacks Rank of 2.    Mackinac Financial Corporation MFNC  has been witnessing upward estimate revisions for the past 60 days. Additionally, the stock has jumped around 10.5%, year to date. It currently holds a Zacks Rank #2.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   First Business Financial Services, Inc. (FBIZ): Free Stock Analysis Report   MidWestOne Financial Group, Inc. (MOFG): Free Stock Analysis Report   Huntington Bancshares Incorporated (HBAN): Free Stock Analysis Report   Mackinac Financial Corporation (MFNC): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Huntington Bancshares Incorporated HBAN  has been benefiting from rising fee income, improving credit quality, rising margins and strategic investments through mergers and acquisitions (M&A). However, significant exposure to commercial loans, along with rising expenses, is on the downside.  makeArticleAd();  Diversified fee-income base, strategic acquisitions, and rising loans and deposits balance aided the company to rally 20.6% year to date compared with 8.2% growth recorded by the industry  .    The company's earnings estimates for the current year and the next year have remained unchanged, in the last 30 days. Therefore, it currently carries a Zacks Rank #3 (Hold).",
    "     Huntington has witnessed continued growth in deposit balance in the last few years. Also, loans improved backed by its commendable performance in the commercial and consumer portfolio. Management predicts average loans and leases to escalate about 4-5% on an annual basis, while average total deposits will likely be up around 2-3%. The company remains particularly focused on growing core deposits through acquiring core checking accounts and strengthening customer relationships.    Supported by its strong liquidity position, Huntington continues to expand through acquisitions. In 2016, the company completed its acquisition of FirstMerit Corporation, resulting in a larger market presence and more diversified loan portfolio, along with a wider core deposit funding base.    Huntington's non-interest expenses witnessed a CAGR of 8.9% over the last five years (ended 2018), with the trend continuing in the first six months of 2019 as well. The company is making investments in digital, data and technology enhancements that will bolster its existing capabilities and infrastructure. Therefore, a persistent uptrend in expenses is expected, which might limit the company's profitability and operational efficiency. Notably, management expects expenses to rise 2-4% this year.    Additionally, Huntington's loan portfolio consists of nearly 50% of commercial loans. Such high exposure to commercial loans depicts lack of diversification, which can be risky for the company amid challenging economy and competitive markets.   Stocks to Consider    First Business Financial Services, Inc. FBIZ  has been witnessing upward estimate revisions, for the past 60 days. Moreover, this Zacks #2 (Buy) Ranked stock has rallied more than 17%, year to date. You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .    MidWestOne Financial Group, Inc. MOFG  has been witnessing upward estimate revisions, for the past 60 days. Also, the company's shares have gained nearly 23.6% year to date. At present, it carries a Zacks Rank of 2.    Mackinac Financial Corporation MFNC  has been witnessing upward estimate revisions for the past 60 days. Additionally, the stock has jumped around 10.5%, year to date. It currently holds a Zacks Rank #2.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:03:00"
}