{
  "url": "https://www.nasdaq.com/article/forextrade-talk-plans-cheer-risk-currencies-hit-safehaven-yen-20190904-01244",
  "title": "FOREX-Trade talk plans cheer risk currencies, hit safe-haven yen - Nasdaq.com",
  "text": [
    "    * Trade-exposed currencies jump on U.S.-China trade talksdate",
    "* Yen sold as risk-on mood returns",
    "* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh",
    "SINGAPORE, Sept 5 (Reuters) - Risk-sensitive currencies suchas the Aussie and yuan rallied on Thursday as investors cheeredthe announcement of U.S.-China trade talks for next month andabandoned safe haven assets such as yen.",
    "The Australian and New Zealand dollars, AUD=D3NZD=D3 Chinese yuan CNY= and South Korean won KRW= all jumpedagainst the dollar, while the yen JPY=EBS fell nearly 0.4% to106.75 per dollar, its cheapest in more than three weeks.",
    "The early-October talks will be held in Washington, China'scommerce ministry announced, following a phone call betweenChina's Vice Premier Liu He, U.S. Treasury Secretary StevenMnuchin and U.S. Trade Representative Robert Lighthizer. urn:newsml:reuters.com:*:nB9N25400R",
    "The news followed optimism that a no-deal Brexit could beavoided, which sent the pound GBP=D3 sharply higher, and apotential breakthrough for the Hong Kong political crisis.",
    "Those political developments, seen as positive forinvestment, also fueled a jump in Asian equities and bondyields. urn:newsml:reuters.com:*:nL3N25V12H",
    "\"We've seen markets hold up relatively well overnight, this(trade) news has injected a fair amount of optimism in markets,\"said Prashant Newnaha, senior rates strategist at TD Securitiesin Singapore.",
    "\"It does seem that the markets were positioning morebearishly, and now we've gotten this potential good news and themarkets are running with it,\" he said, adding global economicindicators had also recently been showing some green shoots.",
    " The Australian dollar rose to a one-month high of $0.6825,seen as a technical resistance level while the New Zealanddollar hit a one-week peak of $0.6377. The trade-exposed wonclimbed the most of Asia's currencies to 1198.00 per dollar.",
    "Against a basket of currencies, the dollar .DXY lifted alittle from a one-week low to 98.492.",
    "The Canadian dollar CAD= spiked sharply to C$1.3344 perdollar after the Bank of Canada left interest rates on hold andsounded less dovish than the market had expected.",
    "The pound sat around $1.2245 and euro EUR=EBS at $1.1030,holding overnight gains.",
    "They had climbed after British parliament voted on Wednesdayto prevent Johnson from taking Britain out of the European Unionwithout a deal on Oct. 31, but rejected his first bid to call asnap election two weeks before the scheduled exit. urn:newsml:reuters.com:*:nL5N25V2FD",
    "That still leaves Brexit up in the air, with possibleoutcomes ranging from a no-deal exit to abandoning the wholeendeavour, prompting some to sound a note of caution.",
    "\"It's important to keep in mind that the situation continuesto look pretty bad,\" J.P. Morgan analysts reminded investors ina market note, pointing out that Johnson, a staunch Brexiteer,leads opinion polls.",
    "Nevertheless, the fact that a hard Brexit has, for now, beenremoved as an immediate risk gave markets some cheer, as didHong Kong leader Carrie Lam's move to withdraw the bill thattriggered months of violent protests in the city. urn:newsml:reuters.com:*:nL3N25V0NC",
    "\"While there is no 'all clear' on market concerns, investorsentiment pulled back from extremes...the deferral of a no-dealBrexit, soothed nerves,\" said Michael McCarthy, chief marketstrategist at brokerage CMC Markets in Sydney.     (Reporting by Tom Westbrook; Editing by Kim Coghill and SamHolmes) ((tom.westbrook@tr.com; +61466355340;))"
  ],
  "published_datetime": "2019-09-04 11:21:00"
}