{
  "url": "https://www.nasdaq.com/article/ab-inbev-set-to-revive-budweiser-asia-ipo-with-5-bln-float-20190912-00056",
  "title": "AB InBev set to revive Budweiser Asia IPO with $5 bln float - Nasdaq.com",
  "text": [
    "By Julie  Zhu",
    "HONG KONG, Sept 12 (Reuters) - Anheuser-Busch InBev  is planning to raise about $5 billion from a revived float of its Asian operations after the world's largest beer maker shelved a Hong Kong IPO in July, people with knowledge of the matter said.",
    "AB InBev, which had aimed to raise as much as $9.8 billion through an IPO of Budweiser Brewing Company APAC Ltd  to help with its heavy debt burden of over $100 billion, aims to re-launch the float as soon as next week, the sources said.",
    "The listing would be a boost for the Hong Kong Stock Exchange after Reuters reported last month that China's biggest e-commerce company Alibaba Group Holding Ltd  had delayed a Hong Kong listing worth up to $15 billion amid growing political unrest there. ",
    "\"The market conditions in recent days have improved and provided a good window, in which we should seize the opportunity to go ahead,\" said one of the sources.",
    "Last Wednesday, Hong Kong leader Carrie Lam formally withdrew an extradition bill, part of measures she hoped would help the city move forward from months of unrest.",
    "The benchmark Hang Seng Index  has surged more than 6% since then.",
    "The development also comes after Hong Kong Exchanges and Clearing Ltd  announced a $39 billion takeover approach to the London Stock Exchange Plc  on Wednesday that received a cool response from investors concerned about regulatory and financial hurdles. ",
    "AB InBev said in a statement on Thursday that it was continuing to explore an IPO in Hong Kong of Budweiser APAC, two months after shelving the planned listing of up to $9.8 billion in what would have been the largest IPO of 2019.",
    "Budweiser APAC has resumed its application for the listing of a minority stake of its shares on the Hong Kong Stock Exchange, excluding its Australian operations, which the parent agreed to sell to Japan'sAsahi Group  for $11 billion shortly after the IPO was shelved in July.",
    "Without Australia, a large but mature market, AB InBev's Asia-Pacific operations would be more focused on faster growth markets such as China, India and Vietnam, which in a way could make the IPO more attractive, sources said.",
    "The brewer, which had billed the IPO as a means to drive regional consolidation, failed to secure enough solid orders from top-class U.S. \"long only\" fund managers as investors were unwilling to accept its $54 billion-$64 billion valuation for Budweiser APAC in July. ",
    "Another source, however, said Budweiser APAC stripped on the profitable Australia business would be worth less than $54 billion, the bottom of the previous range.",
    "In the latest prospectus filed with the stock exchange, the company booked a first-quarter normalised EBITDA of $558 million, up 23% from a year earlier.",
    "The growth rate including the Australian unit over the same period was 13.4%, filings showed.",
    "Budweiser APAC declined to comment on the IPO details. AB InBev did not respond to a request for comment. ",
    "JPMorgan and Morgan Stanley are the sponsors of the float."
  ],
  "published_datetime": "2019-09-12 02:50:00"
}