{
  "url": "https://www.nasdaq.com/article/dollar-edges-higher-on-trade-brexit-worries-20190903-00911",
  "title": "Dollar edges higher on trade, Brexit worries - Nasdaq.com",
  "text": [
    "By Richard Leong",
    "NEW YORK, Sept 3 (Reuters) - The dollar climbed on Tuesday to its strongest level in over two years against a basket of currencies as traders favored the greenback on worries about U.S.-China trade tensions and a chaotic British exit from the European Union.",
    "The dollar's initial gains abated in the wake of a private report that showed the U.S. manufacturing sector recorded its first monthly contraction since 2016 in August. ",
    "\"This is a safe-haven trade rather than a rate-differential trade,\" said Steven Englander, global head of G10 FX research at Standard Chartered in New York.",
    "Bloomberg News reported that Chinese and U.S. officials are struggling to agree on a schedule for a round of trade negotiations that had been expected this month.",
    "UK Prime Minister Boris Johnson lost his working majority in parliament when one of his Conservative lawmakers defected to the pro-European Union Liberal Democrats. ",
    "At 11:44 a.m. (1544 GMT), an index that tracks the dollar versus six major currencies  was up 0.11% at 99.022. It hit 99.37 earlier Tuesday, which was its highest since May 2017.",
    "The euro stabilized after tumbling to a 28-month low against the dollar earlier Tuesday as investors priced in deeper negative interest rates for longer in the euro zone.",
    "Money markets have increased to more than 80% the probability that the European Central Bank will cut its benchmark rate by 20 basis points when it meets next week.",
    "The ECB benchmark rate now stands at minus 0.40% and it has  all but promised a monetary policy stimulus package as economic growth falters. Monday's PMI survey showed European manufacturing contracted for seven straight months.",
    "The euro  was little changed on the day at  $1.09645. It fell to $1.0926 earlier, its lowest since mid-May 2017. A break below the key $1.1000 level last week had sparked heavier sell-offs.",
    "The dollar weakened against the yen and the Swiss franc in the aftermath of disappointing ISM manufacturing data.",
    "The greenback fell 0.37% to 105.87 yen and decreased 0.31% to 0.98735 franc.",
    "Sterling was last up 0.2% at $1.2087 after falling to $1.1959, the lowest since October 2016, when it plunged to $1.1491 in a flash crash. Against the euro, sterling rose to  90.7 pence, rebounding from a two-week low of 91.47 pence .",
    "========================================================",
    "Currency bid prices at 11:43AM (1543 GMT)"
  ],
  "published_datetime": "2019-09-03 11:59:00"
}