{
  "url": "https://www.nasdaq.com/article/effort-to-disqualify-lawyer-part-of-us-campaign-against-huawei-counsel-20190904-01140",
  "title": "Effort to disqualify lawyer part of U.S. campaign against Huawei: counsel - Nasdaq.com",
  "text": [
    "By Karen Freifeld",
    "Sept 4 (Reuters) - The effort to stop a former U.S. Justice Department official from representing Huawei is another step in a broader U.S. government campaign against the Chinese company, a lawyer for Huawei argued on Wednesday.",
    "Lawyer Michael Levy said the company has not been given any material information as to why its counsel, James Cole, should be removed.",
    "U.S. prosecutors have asked the judge in the case to disqualify Cole, claiming his work as the No. 2 official in the Justice Department created \"irresolvable conflicts of interest.\"  Prosecutors say Cole, who served as former deputy attorney general until 2015, had access to confidential information that he could use against the government.",
    "In oral arguments in Brooklyn federal court, Levy told U.S. District Court Judge Ann Donnelly that the decision to try to disqualify Cole was part of a \"barrage\" against the company that also includes a separate Justice Department case alleging trade secret theft and a decision to place Huawei on a Commerce Department blacklist that bans most U.S. sales to the firm.",
    "\"This case is quite clearly part of an overall agenda by the government against Huawei,\" Levy argued. The move to disqualify Cole, Levy said, \"can be seen as one more tactical step.\"",
    "Assistant U.S. Attorney David Kessler told the judge the matter related to \"a single criminal case,\" and that Huawei had numerous other lawyers.",
    "Much of the government's argument is confidential and classified. Prosecutors say Cole supervised and participated in aspects of an investigation related to the Huawei case which has not been made public.",
    "\"The ultimate question is whether Mr. Cole has the government's confidences,\" Kessler said. \"We don't think it's a close call.\"",
    "Cole claims he has no recollection of matters referenced as the basis for him to be disqualified from the case, according to another court filing. He served as deputy attorney general until 2015, and he has represented Huawei for at least two years. ",
    "On Wednesday, Cole said he would make his case to the judge after she closed her courtroom to the public because of the classified information involved.",
    "The judge did not indicate when she would rule on whether to disqualify Cole, and set the next court hearing for December 12.",
    "The case against Huawei is proceeding as Beijing and Washington engage in an escalating trade war.",
    "It also is taking place as the United States has pressured other countries to drop Huawei from their cellular networks, worried its equipment could be used by Beijing for spying, which the company says are unfounded.",
    "Huawei's chief financial officer, Meng Wanzhou, the daughter of Huawei's founder, was arrested in Canada in December at the request of the United States in connection with the case.",
    "Meng and others are accused of conspiring to defraud HSBC and other banks by misrepresenting Huawei's relationship with a company that operated in Iran, putting them at risk of violating U.S. sanctions.  ",
    "Meng has said she is innocent and is fighting extradition.",
    "Cole entered a not guilty plea on behalf of Huawei and its U.S. subsidiary in Brooklyn in March."
  ],
  "published_datetime": "2019-09-04 05:34:00"
}