{
  "url": "https://www.nasdaq.com/article/why-stampscom-stmp-might-be-well-poised-for-a-surge-cm1207285",
  "title": "Why Stamps.com (STMP) Might be Well Poised for a Surge - Nasdaq.com",
  "text": [
    " Investors might want to bet on Stamps.com (STMP), as earnings estimates for this company have been showing solid improvement lately. The stock has already gained solid short-term price momentum, and this trend might continue with its still improving earnings outlook. The upward trend in estimate revisions for this online postage provider reflects growing optimism of analysts on its earnings prospects, which should get reflected in its stock price. After all, empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements. Our stock rating tool -- the Zacks Rank -- is principally built on this insight. The five-grade Zacks Rank system, which ranges from a Zacks Rank #1 (Strong Buy) to a Zacks Rank #5 (Strong Sell), has an impressive  externally-audited track record of outperformance  , with Zacks #1 Ranked stocks generating an average annual return of +25% since 2008. Consensus earnings estimates for the next quarter and full year have moved considerably higher for Stamps.com, as there has been strong agreement among the covering analysts in raising estimates. The chart below shows the evolution of forward 12-month Zacks Consensus EPS estimate:  12 Month EPS      Current-Quarter Estimate Revisions  The company is expected to earn $0.77 per share for the current quarter, which represents a year-over-year change of -72.1%. Over the last 30 days, two estimates have moved higher for Stamps.com while one has gone lower. As a result, the Zacks Consensus Estimate has increased 5.05%.  Current-Year Estimate Revisions  For the full year, the earnings estimate of $4.14 per share represents a change of -64.86% from the year-ago number. In terms of estimate revisions, the trend for the current year also appears quite encouraging for Stamps.com. Over the past month, three estimates have moved higher compared to no negative revisions, helping the consensus estimate increase 13.55%.  Favorable Zacks Rank  The promising estimate revisions have helped Stamps.com earn a Zacks Rank #1 (Strong Buy). The Zacks Rank is a tried-and-tested rating tool that helps investors effectively harness the power o f earnings  estimate revisions and make the right investment decision. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  . Our research shows that stocks with Zacks Rank #1 (Strong Buy) and 2 (Buy) significantly outperform the S&P 500.  Bottom Line  Investors have been betting on Stamps.com because of its solid estimate revisions, as evident from the stock's 39.3% gain over the past four weeks. As its earnings growth prospects might push the stock higher, you may consider adding it to your portfolio right away.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Stamps.com Inc. (STMP): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors might want to bet on Stamps.com (STMP), as earnings estimates for this company have been showing solid improvement lately. The stock has already gained solid short-term price momentum, and this trend might continue with its still improving earnings outlook.",
    "The upward trend in estimate revisions for this online postage provider reflects growing optimism of analysts on its earnings prospects, which should get reflected in its stock price. After all, empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements. Our stock rating tool -- the Zacks Rank -- is principally built on this insight.",
    "The five-grade Zacks Rank system, which ranges from a Zacks Rank #1 (Strong Buy) to a Zacks Rank #5 (Strong Sell), has an impressive  externally-audited track record of outperformance  , with Zacks #1 Ranked stocks generating an average annual return of +25% since 2008.",
    "Consensus earnings estimates for the next quarter and full year have moved considerably higher for Stamps.com, as there has been strong agreement among the covering analysts in raising estimates.",
    "The chart below shows the evolution of forward 12-month Zacks Consensus EPS estimate:",
    " 12 Month EPS ",
    " Current-Quarter Estimate Revisions ",
    "The company is expected to earn $0.77 per share for the current quarter, which represents a year-over-year change of -72.1%.",
    "Over the last 30 days, two estimates have moved higher for Stamps.com while one has gone lower. As a result, the Zacks Consensus Estimate has increased 5.05%.",
    " Current-Year Estimate Revisions ",
    "For the full year, the earnings estimate of $4.14 per share represents a change of -64.86% from the year-ago number.",
    "In terms of estimate revisions, the trend for the current year also appears quite encouraging for Stamps.com. Over the past month, three estimates have moved higher compared to no negative revisions, helping the consensus estimate increase 13.55%.",
    " Favorable Zacks Rank ",
    "The promising estimate revisions have helped Stamps.com earn a Zacks Rank #1 (Strong Buy). The Zacks Rank is a tried-and-tested rating tool that helps investors effectively harness the power o f earnings  estimate revisions and make the right investment decision. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .",
    "Our research shows that stocks with Zacks Rank #1 (Strong Buy) and 2 (Buy) significantly outperform the S&P 500.",
    " Bottom Line ",
    "Investors have been betting on Stamps.com because of its solid estimate revisions, as evident from the stock's 39.3% gain over the past four weeks. As its earnings growth prospects might push the stock higher, you may consider adding it to your portfolio right away.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:20:10"
}