{
  "url": "https://www.nasdaq.com/article/what-is-driving-a-4x-jump-in-beyond-meats-revenue-by-2020-cm1206637",
  "title": "What Is Driving A 4x Jump In Beyond Meat’s Revenue By 2020? - Nasdaq.com",
  "text": [
    "Beyond Meat ( BYND  ), one of the fastest growing food companies in the US, offering a portfolio of plant-based meat, has seen its total revenue increase by 5.4x in the last two years, from $16.2 million in 2016 to $87.9 million in 2018. Beyond Meat's revenue is expected to increase another 4x from the current level, from $87.9 million in 2018 to $358 million in 2020, thus adding a whopping $270 million to its revenue base over the next two years, compared to an addition of $71 million over the previous two years.",
    "You can view the Trefis interactive dashboard -  Beyond Meat Revenues: How Does Beyond Meat Make   Money?   - to better understand the revenue trends and division-wise revenue performance, and alter the assumptions to arrive at your own estimate for the company's revenues. In addition, here is more  Consumer Staples data   .",
    "As Beyond Meat offers a very unique and innovative product (plant-based meat), let us first understand its business.",
    " What Need Does It Serve? ",
    " What Are The Alternatives? ",
    " Has Two Operating Segments ",
    " Segment Revenue Performance ",
    " Retail Chains ",
    " Restaurant & Foodservice Outlets ",
    " Conclusion ",
    "As per  Beyond Meat Valuation   by Trefis, we have a price estimate of $128 per share for Beyond Meat's Stock  .",
    "What's behind Trefis? See How it's Powering New Collaboration and What-Ifs",
    "For CFOs and Finance Teams   | Product, R&D, and Marketing Teams ",
    " All Trefis Data ",
    "Like our charts? Explore example interactive dashboards   and create your own.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:47:27"
}