{
  "url": "https://www.nasdaq.com/article/heres-why-investors-should-retain-hr-block-hrb-stock-now-cm1206766",
  "title": "Here's Why Investors Should Retain H&R Block (HRB) Stock Now - Nasdaq.com",
  "text": [
    " A prudent investment decision involves buying stocks that have solid prospects and selling those that carry risks. At times, it is rational to hold certain stocks that have enough potential but are weighed down by tough market conditions. We believe H&R Block, Inc. HRB  with long-term expected EPS growth rate of 10% and a market cap of $4.9 billion is one such stock and investors should retain it in their portfolios.  Factors That Bode Well  The U.S. government's tax reform that led to lower tax rates and simpler codes reduced the demand for H&R Block's assisted tax preparation services. The business suffered post tax reform, leaving an adverse impact on the stock price, which has declined 5.9% in a year.    Currently, management expects betterment in the tax business, which along with contribution from the acquisition of Wave Financial, is expected to help the company grow its top line by 1.5% to 3.5% in the current fiscal year. The Wave Acquisition has expanded H&R Block's product and client portfolio and strengthened its position in the large and expanding small business market. Additionally, cost reductions are expected to offset operating losses from Wave acquisition, thus positively impacting margin. Expansion of digital offerings in new areas is helping the company to attract and retain new clients, positively impacting earnings growth.  Zacks Rank and Stocks to Consider  H&R Block currently carries a Zacks Rank #3 (Hold). Some better-ranked stocks in the broader Zacks  Business Services   sector include Fiserv FISV  , Booz Allen Hamilton BAH  and Charles River Associates CRAI  , each carrying a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   . The long-term expected EPS (three to five years) growth rate for Fiserv, Booz Allen and Charles River is 12%, 13% and 13%, respectively.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Charles River Associates (CRAI): Free Stock Analysis Report   Fiserv, Inc. (FISV): Free Stock Analysis Report   Booz Allen Hamilton Holding Corporation (BAH): Free Stock Analysis Report   H&R Block, Inc. (HRB): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "A prudent investment decision involves buying stocks that have solid prospects and selling those that carry risks. At times, it is rational to hold certain stocks that have enough potential but are weighed down by tough market conditions.",
    "We believe H&R Block, Inc. HRB  with long-term expected EPS growth rate of 10% and a market cap of $4.9 billion is one such stock and investors should retain it in their portfolios.",
    " Factors That Bode Well ",
    "The U.S. government's tax reform that led to lower tax rates and simpler codes reduced the demand for H&R Block's assisted tax preparation services. The business suffered post tax reform, leaving an adverse impact on the stock price, which has declined 5.9% in a year.",
    "Currently, management expects betterment in the tax business, which along with contribution from the acquisition of Wave Financial, is expected to help the company grow its top line by 1.5% to 3.5% in the current fiscal year. The Wave Acquisition has expanded H&R Block's product and client portfolio and strengthened its position in the large and expanding small business market.",
    "Additionally, cost reductions are expected to offset operating losses from Wave acquisition, thus positively impacting margin. Expansion of digital offerings in new areas is helping the company to attract and retain new clients, positively impacting earnings growth.",
    " Zacks Rank and Stocks to Consider ",
    "H&R Block currently carries a Zacks Rank #3 (Hold).",
    "Some better-ranked stocks in the broader Zacks  Business Services   sector include Fiserv FISV  , Booz Allen Hamilton BAH  and Charles River Associates CRAI  , each carrying a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "The long-term expected EPS (three to five years) growth rate for Fiserv, Booz Allen and Charles River is 12%, 13% and 13%, respectively.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:46:00"
}