{
  "url": "https://www.nasdaq.com/article/irish-beef-price-dispute-sparks-layoffs-threatens-exports-20190911-00560",
  "title": "Irish beef price dispute sparks layoffs, threatens exports - Nasdaq.com",
  "text": [
    "DUBLIN, Sept 11 (Reuters) - A dispute between Irish farmers and processors over beef prices that has cut production and caused a wave of temporary layoffs could hit exports from one of the world's largest suppliers, the Irish Food Board warned on Wednesday.",
    "The row, which began in late July with the picketing of meat factories by a grassroots group of farmers, deepened on Monday when representatives of processors walked away from government initiated talks to resolve the impasse.",
    "Meat Industry Ireland said on Tuesday that its members had temporarily laid off 3,000 employees after the blockading of their factories resulted in the closure of some 80% of overall processing capacity.",
    "However it is the world's fifth largest net exporter of beef and keen to increase the footprint of the 2.5 billion euro worth sold abroad last year due to the threat Brexit poses to the 50% of beef exports that end up in the United Kingdom.",
    "\"Disruption has been occurring, we are running at about two-third of normal production. If you look at the scale of this issue, I would suggest that many of our international customers will be let down first and that is really disappointing,\" McCarthy told Irish national broadcaster RTE.",
    "The Beef Plan Movement, the group behind the protests, has said it will go to the picket line to speak to farmers if processors lift legal threats against the blockades. They say farm gate prices have fallen to unsustainably low levels.",
    "Figures from Bord Bia showed that while beef production rose by 3% last year, the value of exports increase by just 1%.",
    "The escalation also comes amid strong opposition from Irish farmers to June's draft trade deal between the European Union and the Mercosur bloc of South American countries. The farmers fear an influx of cheaper South American cuts could decimate Irish producers. ",
    "\"The real risk here is that we lose export markets that have been hard won over the last 30 years,\" Kevin Hanrahan, chief economist at Teagasc, the state body responsible for research and development in the agri-food sector, said of the dispute.",
    "\"Facing into Brexit, we are trying to persuade buyers in the rest of Europe to buy the beef that heretofore has been shipped to the UK. What's happening now is not a good way to advertise our reliability as a supplier.\""
  ],
  "published_datetime": "2019-09-11 11:05:00"
}