{
  "url": "https://www.nasdaq.com/article/california-truckers-brace-for-new-gig-worker-rules-20190911-00656",
  "title": "California truckers brace for new 'gig worker' rules - Nasdaq.com",
  "text": [
    "By Lisa Baertlein",
    "LOS ANGELES, Sept 11 (Reuters) - California trucking companies that haul everything from summer strawberries to cars and Christmas toys say they are under threat from a bill that could turn so-called gig workers into employees.",
    "California state senators late on Tuesday passed AB5, proposed legislation that would set tougher standards for determining which workers can be properly classified as independent contractors.  Democratic Governor Gavin Newsom has signaled support for the measure, which would take effect on Jan. 1.",
    "\"It's going to hit all trucking firms small and large,\" said Joseph Rajkovacz, director of governmental affairs for the Western States Trucking Association.",
    "Trucking companies of all stripes call on the roughly 70,000 California independent big rig owners to haul loads in the state and around the country.",
    "Experts say California's mostly small 137,000 trucking firms are vulnerable to upheaval wrought by AB5.",
    "\"We have a lot of peaks and valleys. It takes all the flexibility away from us,\" said Bill Aboudi, whose eight-truck company serves the Port of Oakland.",
    "Most drivers who ferry goods to and from massive cargo ships at the port are independent, he said.",
    "\"If nobody can use them, we're going to have a nightmare,\" said Aboudi, who employs seven drivers and said switching to a different employee model would not happen overnight.",
    "Los Angeles-based Sandra Alzate hires independent owner-operators when her customers, which include Los Angeles Unified School District, have more work than her four-truck company can handle on its own.",
    "\"I'm going to lose clients because I can't provide the trucks they need for their jobs,\" said Alzate, who already planned to invest $400,000 on two truck upgrades and cannot afford to hire additional drivers or buy additional rigs.",
    "\"I don't think they understand what the impact will be,\" Alzate said of AB5 supporters.",
    "Proponents of the union-supported bill say it would address employment abuses in the transportation industry, where companies like Uber, XPO Logistics Inc  and trucking firm Swift Transportation Holdings Inc  have paid millions of dollars in overtime and wage claims to settle worker misclassification lawsuits.",
    "Representatives from XPO and Knight-Swift did not respond to requests for comment. Oakland's Aboudi said he is currently settling a misclassification lawsuit involving meal and rest breaks."
  ],
  "published_datetime": "2019-09-11 01:43:00"
}