{
  "url": "https://www.nasdaq.com/article/coca-cola-ko-gains-but-lags-market-what-you-should-know-cm1210801",
  "title": "Coca-Cola (KO) Gains But Lags Market: What You Should Know - Nasdaq.com",
  "text": [
    " Coca-Cola (KO) closed at $54.77 in the latest trading session, marking a +0.68% move from the prior day. This move lagged the S&P 500's daily gain of 0.72%. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%. Prior to today's trading, shares of the world's largest beverage maker had gained 1.68% over the past month. This has outpaced the Consumer Staples sector's gain of 1.08% and lagged the S&P 500's gain of 2.25% in that time. Wall Street will be looking for positivity from KO as it approaches its nex t earnings  report date. On that day, KO is projected to report earnings of $0.56 per share, which would represent a year-over-year decline of 3.45%. Meanwhile, our latest consensus estimate is calling for revenue of $9.52 billion, up 15.46% from the prior-year quarter. KO's full-year Zacks Consensus Estimates are calling for earnings of $2.10 per share and revenue of $36.85 billion. These results would represent year-over-year changes of +0.96% and +15.68%, respectively. It is also important to note the recent changes to analyst estimates for KO. Recent revisions tend to reflect the latest near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Based on our research, we believe these estimate revisions are directly related to near-team stock moves. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. KO is holding a Zacks Rank of #2 (Buy) right now. In terms of valuation, KO is currently trading at a Forward P/E ratio of 25.86. Its industry sports an average Forward P/E of 22.3, so we one might conclude that KO is trading at a premium comparatively. It is also worth noting that KO currently has a PEG ratio of 3.78. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Beverages - Soft drinks was holding an average PEG ratio of 2.72 at yesterday's closing price. The Beverages - Soft drinks industry is part of the Consumer Staples sector. This group has a Zacks Industry Rank of 158, putting it in the bottom 39% of all 250+ industries. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. To follow KO in the coming trading sessions, be sure to utilize Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Coca-Cola Company (The) (KO): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Coca-Cola (KO) closed at $54.77 in the latest trading session, marking a +0.68% move from the prior day. This move lagged the S&P 500's daily gain of 0.72%. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%.",
    "Prior to today's trading, shares of the world's largest beverage maker had gained 1.68% over the past month. This has outpaced the Consumer Staples sector's gain of 1.08% and lagged the S&P 500's gain of 2.25% in that time.",
    "Wall Street will be looking for positivity from KO as it approaches its nex t earnings  report date. On that day, KO is projected to report earnings of $0.56 per share, which would represent a year-over-year decline of 3.45%. Meanwhile, our latest consensus estimate is calling for revenue of $9.52 billion, up 15.46% from the prior-year quarter.",
    "KO's full-year Zacks Consensus Estimates are calling for earnings of $2.10 per share and revenue of $36.85 billion. These results would represent year-over-year changes of +0.96% and +15.68%, respectively.",
    "It is also important to note the recent changes to analyst estimates for KO. Recent revisions tend to reflect the latest near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.",
    "Based on our research, we believe these estimate revisions are directly related to near-team stock moves. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.",
    "The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. KO is holding a Zacks Rank of #2 (Buy) right now.",
    "In terms of valuation, KO is currently trading at a Forward P/E ratio of 25.86. Its industry sports an average Forward P/E of 22.3, so we one might conclude that KO is trading at a premium comparatively.",
    "It is also worth noting that KO currently has a PEG ratio of 3.78. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Beverages - Soft drinks was holding an average PEG ratio of 2.72 at yesterday's closing price.",
    "The Beverages - Soft drinks industry is part of the Consumer Staples sector. This group has a Zacks Industry Rank of 158, putting it in the bottom 39% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "To follow KO in the coming trading sessions, be sure to utilize Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:45:21"
}