{
  "url": "https://www.nasdaq.com/article/hurricane-dorian-brings-spirit-airlines-worst-nightmare-to-life-cm1207528",
  "title": "Hurricane Dorian Brings Spirit Airlines' Worst Nightmare to Life - Nasdaq.com",
  "text": [
    " As Hurricane Dorian has moved slowly through the Bahamas over   the past few days -- hovering just off the shore of Florida --   flight cancellations have started to pile up in the Sunshine   State. Lots of airlines have felt some level of impact from the   destructive hurricane, but   JetBlue Airways    (NASDAQ: JBLU) and   Spirit Airlines    (NYSE: SAVE) have been the worst hit, due to their big footprints   in the state. This hurricane is hitting at a particularly inopportune time   for Spirit Airlines. The budget carrier had already experienced a   big jump in flight cancellations    during the spring and summer, due to an unfortunate combination   of overly aggressive flight schedules (leaving little margin for   error), runway construction in Fort Lauderdale, and bad weather.   As a result, management expects the carrier's profit margin to   sink this quarter. A hurricane-related surge in flight   cancellations to end the Labor Day long weekend will only add to   its woes. Why JetBlue and Spirit Airlines are feeling the biggest   impacts High winds forced numerous airports in Florida to close while   Hurricane Dorian paused offshore. This included two of the three   busiest airports in the state: Orlando International Airport and   Fort Lauderdale-Hollywood International Airport. (Miami   International Airport, despite its proximity to Fort Lauderdale,   was able to remain open.)makeArticleAd(); Both airports are low-cost carrier meccas. Fort Lauderdale and   Orlando are JetBlue focus cities, although they are smaller than   the carrier's main bases in New York and Boston. Meanwhile,   Spirit Airlines is headquartered near Fort Lauderdale, where it   maintains its largest focus city. (Indeed, JetBlue and Spirit --   in that order -- are the two largest airlines in Fort   Lauderdale.) And in recent years, Spirit Airlines has built up a   sizable operation in Orlando.   Fort Lauderdale and Orlando are two of Spirit Airlines' most     important focus cities. Image source: Spirit Airlines.  Nearly 150 flights into and out of Orlando were canceled on   Sunday, according to FlightAware. This may have been due to   airlines trying to get their planes out of the path of the storm   ahead of the airport's planned closure at 2 a.m. on Monday.   Ultimately, Orlando International Airport stayed open on Monday   due to a change in the storm's path, closing at 2 a.m. on Tuesday   instead. Nevertheless, about a third of the airport's scheduled   flights were canceled on Monday. The airport didn't reopen until   around noon on Wednesday. The airport in Fort Lauderdale closed at noon on Monday and   reopened 24 hours later, at noon on Tuesday. Consequently, nearly   three-quarters of its scheduled flights were canceled on Monday,   followed by the cancellation of about 40% of its flights on   Tuesday. Assessing the damage The net result of all these airport closures and other   disruption was that Spirit Airlines canceled 150 flights on   Sunday, 272 flights on Monday, and 192 flights on Tuesday. That   accounted for approximately 20%, 37%, and 26% of its scheduled   flights on each day. Due to this high volume of flight   cancellations -- and its lack of interline agreements with other   carriers -- Spirit could be forced to spend huge sums of money to   buy full-price tickets on other airlines to get its customers   where they need to be. JetBlue is in slightly better shape, so far. It canceled 16   flights on Sunday, 247 flights on Monday, and 274 flights on   Tuesday. However, due to its larger size (compared to Spirit),   this represented less than 2% of its scheduled flights on Sunday,   20% of its flights on Monday, and roughly a quarter of its   flights on Tuesday. Hurricane Dorian is expected to move up the East Coast over   the next few days, potentially impacting air travel in other   coastal cities. That could potentially turn the tables: Depending   on the exact storm trajectory, JetBlue's heavy focus on the   Northeast raises the risk of another significant wave of flight   cancellations, particularly in Boston Recovering quickly is the key One of the biggest challenges for airlines following a weather   disruption is returning to normal operations quickly. After a   major storm, airplanes and crews are typically out of position,   and getting them back to where they need to be can take days. As of noon EDT on Wednesday, Spirit Airlines had canceled 96   flights for Wednesday (13% of its schedule) and JetBlue had   canceled 72 (about 7% of its schedule). Both carriers had also   canceled about 2% of their schedules for Thursday. These totals   could continue to rise, but it appears that JetBlue and Spirit --   especially the former -- are bouncing back from the storm   relatively well. Even so, both carriers'   profitability will take a hit    this quarter due to the substantial number of flights they have   canceled over the past few days. Spirit Airlines and JetBlue Airways will always be vulnerable   to hurricanes or other major storm systems impacting Florida, due   to their having lots of flights there. However, Spirit Airlines   has made matters worse for itself by overscheduling its aircraft   this summer. The good news is that management seems determined to   avoid making the same mistake next year. That should pave the way   for better financial results in 2020.   10 stocks we like better than Spirit Airlines       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Spirit Airlines wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Adam Levine-Weinberg      owns shares of JetBlue Airways and Spirit Airlines. The Motley     Fool owns shares of and recommends Spirit Airlines. The Motley     Fool recommends JetBlue Airways. The Motley Fool has a     disclosure policy      .  ",
    "As Hurricane Dorian has moved slowly through the Bahamas over   the past few days -- hovering just off the shore of Florida --   flight cancellations have started to pile up in the Sunshine   State. Lots of airlines have felt some level of impact from the   destructive hurricane, but   JetBlue Airways    (NASDAQ: JBLU) and   Spirit Airlines    (NYSE: SAVE) have been the worst hit, due to their big footprints   in the state.",
    "This hurricane is hitting at a particularly inopportune time   for Spirit Airlines. The budget carrier had already experienced a   big jump in flight cancellations    during the spring and summer, due to an unfortunate combination   of overly aggressive flight schedules (leaving little margin for   error), runway construction in Fort Lauderdale, and bad weather.   As a result, management expects the carrier's profit margin to   sink this quarter. A hurricane-related surge in flight   cancellations to end the Labor Day long weekend will only add to   its woes.",
    "High winds forced numerous airports in Florida to close while   Hurricane Dorian paused offshore. This included two of the three   busiest airports in the state: Orlando International Airport and   Fort Lauderdale-Hollywood International Airport. (Miami   International Airport, despite its proximity to Fort Lauderdale,   was able to remain open.)",
    "Both airports are low-cost carrier meccas. Fort Lauderdale and   Orlando are JetBlue focus cities, although they are smaller than   the carrier's main bases in New York and Boston. Meanwhile,   Spirit Airlines is headquartered near Fort Lauderdale, where it   maintains its largest focus city. (Indeed, JetBlue and Spirit --   in that order -- are the two largest airlines in Fort   Lauderdale.) And in recent years, Spirit Airlines has built up a   sizable operation in Orlando.",
    "  Fort Lauderdale and Orlando are two of Spirit Airlines' most     important focus cities. Image source: Spirit Airlines. ",
    "Fort Lauderdale and Orlando are two of Spirit Airlines' most     important focus cities. Image source: Spirit Airlines.",
    "Nearly 150 flights into and out of Orlando were canceled on   Sunday, according to FlightAware. This may have been due to   airlines trying to get their planes out of the path of the storm   ahead of the airport's planned closure at 2 a.m. on Monday.   Ultimately, Orlando International Airport stayed open on Monday   due to a change in the storm's path, closing at 2 a.m. on Tuesday   instead. Nevertheless, about a third of the airport's scheduled   flights were canceled on Monday. The airport didn't reopen until   around noon on Wednesday.",
    "The airport in Fort Lauderdale closed at noon on Monday and   reopened 24 hours later, at noon on Tuesday. Consequently, nearly   three-quarters of its scheduled flights were canceled on Monday,   followed by the cancellation of about 40% of its flights on   Tuesday.",
    "The net result of all these airport closures and other   disruption was that Spirit Airlines canceled 150 flights on   Sunday, 272 flights on Monday, and 192 flights on Tuesday. That   accounted for approximately 20%, 37%, and 26% of its scheduled   flights on each day. Due to this high volume of flight   cancellations -- and its lack of interline agreements with other   carriers -- Spirit could be forced to spend huge sums of money to   buy full-price tickets on other airlines to get its customers   where they need to be.",
    "JetBlue is in slightly better shape, so far. It canceled 16   flights on Sunday, 247 flights on Monday, and 274 flights on   Tuesday. However, due to its larger size (compared to Spirit),   this represented less than 2% of its scheduled flights on Sunday,   20% of its flights on Monday, and roughly a quarter of its   flights on Tuesday.",
    "Hurricane Dorian is expected to move up the East Coast over   the next few days, potentially impacting air travel in other   coastal cities. That could potentially turn the tables: Depending   on the exact storm trajectory, JetBlue's heavy focus on the   Northeast raises the risk of another significant wave of flight   cancellations, particularly in Boston",
    "One of the biggest challenges for airlines following a weather   disruption is returning to normal operations quickly. After a   major storm, airplanes and crews are typically out of position,   and getting them back to where they need to be can take days.",
    "As of noon EDT on Wednesday, Spirit Airlines had canceled 96   flights for Wednesday (13% of its schedule) and JetBlue had   canceled 72 (about 7% of its schedule). Both carriers had also   canceled about 2% of their schedules for Thursday. These totals   could continue to rise, but it appears that JetBlue and Spirit --   especially the former -- are bouncing back from the storm   relatively well. Even so, both carriers'   profitability will take a hit    this quarter due to the substantial number of flights they have   canceled over the past few days.",
    "Spirit Airlines and JetBlue Airways will always be vulnerable   to hurricanes or other major storm systems impacting Florida, due   to their having lots of flights there. However, Spirit Airlines   has made matters worse for itself by overscheduling its aircraft   this summer. The good news is that management seems determined to   avoid making the same mistake next year. That should pave the way   for better financial results in 2020.",
    "  10 stocks we like better than Spirit Airlines       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Spirit Airlines wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Spirit Airlines       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Spirit Airlines wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Adam Levine-Weinberg      owns shares of JetBlue Airways and Spirit Airlines. The Motley     Fool owns shares of and recommends Spirit Airlines. The Motley     Fool recommends JetBlue Airways. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 03:07:00"
}