{
  "url": "https://www.nasdaq.com/article/duke-realty-dre-is-up-134-in-one-week-what-you-should-know-cm1207983",
  "title": "Duke Realty (DRE) Is Up 1.34% in One Week: What You Should Know - Nasdaq.com",
  "text": [
    " Momentum investing revolves around the idea of following a stock's recent trend in either direction. In the 'long' context, investors will be essentially be \"buying high, but hoping to sell even higher.\" With this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving that way. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades. Even though momentum is a popular stock characteristic, it can be tough to define. Debate surrounding which are the best and worst metrics to focus on is lengthy, but the Zacks Momentum Style Score, part of the Zacks Style Scores  , helps address this issue for us. Below, we take a look at Duke Realty (DRE)  , which currently has a Momentum Style Score of A. We also discuss some of the main drivers of the Momentum Style Score, like price change and earnings estimate revisions. It's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Duke Realty currently has a Zacks Rank of #2 (Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of A or B outperform the market over the following one-month period. You can see the current list of Zacks #1 Rank Stocks here >>>   Set to Beat the Market?  Let's discuss some of the components of the Momentum Style Score for DRE that show why this real estate development company shows promise as a solid momentum pick. A good momentum benchmark for a stock is to look at its short-term price activity, as this can reflect both current interest and if buyers or sellers currently have the upper hand. It is also useful to compare a security to its industry, as this can help investors pinpoint the top companies in a particular area. For DRE, shares are up 1.34% over the past week while the Zacks REIT and Equity Trust - Other industry is up 1.53% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 3.28% compares favorably with the industry's 3.06% performance as well. Considering longer term price metrics, like performance over the last three months or year, can be advantageous as well. Shares of Duke Realty have increased 6.64% over the past quarter, and have gained 19.01% in the last year. In comparison, the S&P 500 has only moved 5.35% and 3.45%, respectively. Investors should also take note of DRE's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. Right now, DRE is averaging 1,451,920 shares for the last 20 days.  Earnings Outlook  The Zacks Momentum Style Score encompasses many things, including estimate revisions and a stock's price movement. Investors should note tha t earnings  estimates are also significant to the Zacks Rank, and a nice path here can be promising. We have recently been noticing this with DRE. Over the past two months, 2 earnings estimates moved higher compared to none lower for the full year. These revisions helped boost DRE's consensus estimate, increasing from $1.42 to $1.43 in the past 60 days. Looking at the next fiscal year, 3 estimates have moved upwards while there have been 1 downward revision in the same time period.  Bottom Line  Given these factors, it shouldn't be surprising that DRE is a #2 (Buy) stock and boasts a Momentum Score of A. If you're looking for a fresh pick that's set to soar in the near-term, make sure to keep Duke Realty on your short list.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Duke Realty Corporation (DRE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Momentum investing revolves around the idea of following a stock's recent trend in either direction. In the 'long' context, investors will be essentially be \"buying high, but hoping to sell even higher.\" With this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving that way. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades.",
    "Even though momentum is a popular stock characteristic, it can be tough to define. Debate surrounding which are the best and worst metrics to focus on is lengthy, but the Zacks Momentum Style Score, part of the Zacks Style Scores  , helps address this issue for us.",
    "Below, we take a look at Duke Realty (DRE)  , which currently has a Momentum Style Score of A. We also discuss some of the main drivers of the Momentum Style Score, like price change and earnings estimate revisions.",
    "It's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Duke Realty currently has a Zacks Rank of #2 (Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of A or B outperform the market over the following one-month period.",
    "You can see the current list of Zacks #1 Rank Stocks here >>> ",
    " Set to Beat the Market? ",
    "Let's discuss some of the components of the Momentum Style Score for DRE that show why this real estate development company shows promise as a solid momentum pick.",
    "A good momentum benchmark for a stock is to look at its short-term price activity, as this can reflect both current interest and if buyers or sellers currently have the upper hand. It is also useful to compare a security to its industry, as this can help investors pinpoint the top companies in a particular area.",
    "For DRE, shares are up 1.34% over the past week while the Zacks REIT and Equity Trust - Other industry is up 1.53% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 3.28% compares favorably with the industry's 3.06% performance as well.",
    "Considering longer term price metrics, like performance over the last three months or year, can be advantageous as well. Shares of Duke Realty have increased 6.64% over the past quarter, and have gained 19.01% in the last year. In comparison, the S&P 500 has only moved 5.35% and 3.45%, respectively.",
    "Investors should also take note of DRE's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. Right now, DRE is averaging 1,451,920 shares for the last 20 days.",
    " Earnings Outlook ",
    "The Zacks Momentum Style Score encompasses many things, including estimate revisions and a stock's price movement. Investors should note tha t earnings  estimates are also significant to the Zacks Rank, and a nice path here can be promising. We have recently been noticing this with DRE.",
    "Over the past two months, 2 earnings estimates moved higher compared to none lower for the full year. These revisions helped boost DRE's consensus estimate, increasing from $1.42 to $1.43 in the past 60 days. Looking at the next fiscal year, 3 estimates have moved upwards while there have been 1 downward revision in the same time period.",
    " Bottom Line ",
    "Given these factors, it shouldn't be surprising that DRE is a #2 (Buy) stock and boasts a Momentum Score of A. If you're looking for a fresh pick that's set to soar in the near-term, make sure to keep Duke Realty on your short list.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:00:06"
}