{
  "url": "https://www.nasdaq.com/article/china-co2-emissions-to-peak-in-2022-ahead-of-schedule-govt-researcher-20190905-00434",
  "title": "China CO2 emissions to peak in 2022, ahead of schedule -govt researcher - Nasdaq.com",
  "text": [
    "By David Stanway",
    "FUXIAN LAKE, China, Sept 5 (Reuters) - China's emissions of climate-warming greenhouse gases are likely to peak by 2022 even without the introduction of tougher policies, well ahead of an original target of \"around\" 2030, a senior government researcher said on Thursday.",
    "China's pledge to bring emissions to a peak by \"around 2030\" was a key component of a global pact to tackle climate change drawn up in Paris in 2015.",
    "But Jiang Kejun, research professor with the Energy Research Institute, a unit of the National Development and Reform Commission (NDRC), China's top planning body, said he had \"extreme confidence\" in Beijing's ability to bring emissions to a peak by 2022 on just a \"business as usual\" trajectory.",
    "\"China already has very strong policies and for me, just continuing to do that could be enough,\" he told Reuters on the sidelines of the Fortune Sustainability Forum at the Fuxian Lake in the southwestern province of Yunnan.",
    "Any change in the official targets of the world's biggest CO2 emitter is likely to have big implications for the global fight against climate change, but Chinese government officials have remained cautious about revising their forecasts.",
    "Li Gao, head of the climate department at the environment ministry, warned last week that the 2030 target was already at risk from the trade war with the United States. ",
    "After slowing from 2014 to 2016, China's total carbon emissions are believed to have rebounded starting from 2017.",
    "According to estimates published on Thursday by Lauri Myllyvirta, senior energy analyst with environmental group Greenpeace, emissions rose by as much as 4% in the first half of this year, driven by rising coal, steel and cement consumption.",
    "One major concern has been the rebound in coal consumption and the possible approval of new coal-fired power projects, with officials now debating whether more capacity is required to meet future electricity shortages, said Yang Fuqiang, senior adviser with the Natural Resources Defense Council, a U.S.-based environmental group.",
    "An industry group has forecast China's coal-fired capacity to peak at 1,300 gigawatts (GW), an increase of nearly 300 GW compared to the end of last year. ",
    "Eric Luo, chief executive of Chinese renewable energy manufacturer GCL, said it was unlikely another 300 GW would be necessary, adding that a 2022 peak in carbon emissions was plausible.",
    "\"After 2022, coal emissions should slow down, with the number of new coal plants falling,\" he told Reuters. \"Even if they have approved another 200GW... it doesn't make sense to build so much.\""
  ],
  "published_datetime": "2019-09-05 07:56:00"
}