{
  "url": "https://www.nasdaq.com/article/cloudera-inc-cldr-q2-2020-earnings-call-transcript-cm1207662",
  "title": "Cloudera, Inc. (CLDR) Q2 2020 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   Cloudera, Inc.    (NYSE: CLDR)        Q2 2020 Earnings Call       Sep 4, 2019 ,   5:00 p.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Good afternoon. My name is Elaine and I will be your   conference operator today. Welcome to the Cloudera Second Quarter   Fiscal 2020 Quarterly Results Conference Call. [Operator   Instructions] Your host is Kevin Cook, Vice President, Corporate Development   and Investor Relations. Kevin, you may begin your conference.  Kevin Cook    --   Vice President, Corporate Development and Investor   Relations.  Thank you, Elaine. Good afternoon, and welcome to Cloudera's   second quarter fiscal 2020 conference call. We will be discussing   the results announced in our press release issued after market   close today. From Cloudera with me are Marty Cole, Chairman and   Interim Chief Executive Officer; and Jim Frankola, Chief   Financial Officer. During the course of this call, we will make forward-looking   statements regarding future events and the future financial   performance of the Company, including those as merged with   Hortonworks. Generally, these statements are identified by the   use of words such as expect, believe, anticipate, intend, and   other words that denote future events. These forward-looking   statements are subject to material risks and uncertainties that   could cause actual results to differ materially from those in the   forward-looking statements. We caution you to consider the   important risk factors that could cause actual results to differ   materially from those in the forward-looking statements, in the   press release and on this conference call. These risk factors are   described in our press release and are more fully detailed under   the caption Risk Factors in our Annual Report on Form 10-K, our   Quarterly Report on Form 10-Q and our other filings with the   SEC. During this call, we will present both GAAP and non-GAAP   financial measures. Non-GAAP financial measures exclude   stock-based compensation expense and amortization of acquired   intangible assets. In addition, we provide a non-GAAP weighted   average share count for fiscal 2020. These non-GAAP measures are   not intended to be considered in isolation from, a substitute   for, superior to our GAAP results. And we encourage you to   consider all measures when analyzing Cloudera's performance. All   numbers reported for prior periods are presented for Cloudera on   a stand-alone basis since the merger with Hortonworks closed on   January 3rd 2019, and as such, there is no comparative   year-over-year financial information for the combined   company. For complete information regarding our non-GAAP financial   information, the most directly comparable GAAP measures and   quantitative reconciliation of those figures, please refer to   today's press release regarding our second quarter results. The   press release has also been furnished to the SEC as part of our   Form 8-K. In addition, please note the date of this conference call is   September 4th 2019, and any forward-looking statements that we   make today are based on assumptions that we believe to be   reasonable as of this date. We undertake no obligation to update   these statements as a result of new information or future   events. Now, Marty Cole, Chairman and Interim CEO.  Martin Cole    --   Chairman and Interim Chief Executive Officer  Thank you, Kevin. Hello, everyone, and thank you for joining   us to discuss our second quarter fiscal 2020 financial results.   It has been an exciting month, since I became Interim CEO on   August 1st. I am pleased to report that we executed well in Q2. I   want to thank my team for its continued focus on our customers   and people during this period. Among our recent accomplishments,   we delivered, as promised, an initial release of our cloud-native   data management and analytics offering, Cloudera Data platform.   We also entered into an agreement to acquire certain assets of   Arcadia Data, including technology that accelerates time to   insight for data analytics. And we welcome two new Board members   as a result of the large stake that Icahn Capital accumulated in   Cloudera stock. During this call, we'll cover these topics as   well as important changes in our licensing and distribution   strategies. Beginning with Q2 financial performance, total revenue in the   second quarter was $197 million. Subscription revenue was $164   million and operating cash flow was negative $33 million.   Although the year-over-year comparisons on these numbers are not   meaningful, as a consequence of the merger with Hortonworks, each   of these results exceeded expectations. Annualized recurring revenue was $682 million at the   conclusion of the quarter, representing 16% year-over-year   organic growth, again ahead of expectations. Finally, we had a   good quarter in terms of adding new customers. We now have 953   customers, who exceed $100,000 of ARR, a net increase of 24 for   the quarter. With that quick overview of our results, let me spend a moment   on my priorities as Interim CEO. First, I am focused on improving   execution, In particular, the execution of our enterprise data   cloud strategy. This strategy begins with the phased roll-out of   our new Cloudera Data Platform. We met the first milestone in the   current quarter as last week, we delivered initial releases of   our CDP public cloud services. I'm also very focused on the execution of our financial plans.   We are deliberately balancing our investments in continued growth   and disciplined expense management through improved cash   flow. Second, I am focused on retaining and growing as many of our   customers as possible. Cloudera's base of large ARR customer is   stable and has continued to expand each quarter, including in Q2.   I've gotten increasingly active with our customer base, as was my   practice at Accenture, and all of my interactions have been   positive. Customers are enthusiastic about CDP and the Enterprise   Data Cloud. Third, I am focused on our employees and our culture. We have   a very talented group of people at Cloudera, distributed across   the globe who are driving real innovation for the benefit of our   customers. I'm working with the leadership team to create a more   disciplined and action-oriented culture and to make Cloudera a   great place for current and future employees to advance their   careers while solving some of the world's biggest challenges   through data. And last, but not least, I'm focused on delivering greater   value for our shareholders. As we get the first three right and   succeed in producing hybrid and multi-cloud solutions, delighting   customers and inspiring employees, we truly believe that our   shareholders will benefit. The Board and I are committed to   enhancing shareholder value. Let me turn to some of the highlights for the second quarter   and in recent weeks. Since it was a feature of last quarter's   conference call, I'd like to follow up on customer buying   behavior and industry trends. Our internal metrics and pipeline   generation have materially improved from Q1 levels. Together with   solid execution in our second quarter, we are on plan for   achieving our objectives for this fiscal year. For example, basic   renewal activity rebounded in Q2. We executed better, resulting   in fewer slip renewals than in Q1. We believe the improvement in   renewals was helped in part by more clarity regarding the new   Cloudera technology roadmap and greater certainty as to the   composition and functionality of CDP. We demonstrated these capabilities to our customers publicly   in mid-June. In particular, our class of $1 million plus ARR   customers and its associated revenue remain stable. In spite of   already being at revenue scale, this group continues to expand on   a net basis. As far as competition, in the second quarter, our   metrics improved across the board and we saw an increase in our   win rates against the cloud service providers as compared to Q1.   As CDP gets established, we expect to gain further across this   competitive dynamic. That said, the hyperscale cloud providers remain our primary   competitors. This is all reflected in continued pipeline growth.   As discussed in connection with Q1 results, in Q1, we experienced   a booking shortfall due to weaker than expected pipeline entering   the quarter and the impact of the merger integration. The   improvement we saw in pipeline generation at the conclusion of Q1   has persisted. And we believe that we are building pipeline at a   rate that supports our financial plans. Overall, I'm pleased with our execution in Q2. But, we've got   more work to do to restore higher top line growth. In addition to   better execution, we are focused on meeting customers' demands   for hybrid and multi-cloud solutions that support use cases from   the edge to AI. That is the promise of the enterprise data cloud   and CDP. I am very grateful to our team for its tremendous effort in   releasing our initial CDP Cloud Native Services. We already have   a select group of customers evaluating our CDP Data Hub, data   warehouse, and machine learning services. These are the first in   a regular cadence of cloud services we expect to roll out over   the next year. We plan to launch CDP at the Strata Data Conference in New   York later this month. It is a groundbreaking set of offerings   that lay the foundation for the Enterprise Data Cloud, spanning   multiple public and private clouds as well as data centers. We   believe CDP's consistent data security, governance, and metadata   management across all of these environments is a significant   competitive advantage. CDP offers broad functionality including Edge, IoT, Data   Warehouse, Machine Learning and AI and makes it easy for diverse   sets of business users to apply them across shared data. CDP will   enable enterprise IT to say yes to business use cases that were   simply not possible before. CDP will enable enterprise IT to say   yes, to getting control over short sighted and costly shadow IT   projects that put the business at risk. And yes, CDP will be the   industry's first enterprise data cloud. The other major development in Q2 was the announcement of   changes in our licensing and distribution model. We've aligned   our model with the industry standards set by Red Hat. Red Hat's   practices are well understood and have been broadly accepted by   enterprise customers in the Open Source community. As a result of   these changes, all Cloudera software will be licensed under an   OSI validated Open Source license. We expect the proprietary Cloudera software offerings will be   provided under an Open Source license beginning early next year.   Applied to former proprietary products and new product   innovation, the terms of its license will serve to protect our   intellectual property investments from encroachment by public   cloud providers. Secondly, the distribution of our compiled software, the   binaries, will be limited. Specifically, access to these   binaries, as well as support services and technical expertise   will be available only with the current subscription agreement.   The binaries contain Cloudera-specific intellectual property, the   testing, securing, and integration of various Open Source   projects into an enterprise grade system that meets the   requirements of our customers. Consistent with the Red Hat model, our binaries will no longer   be freely available to non-paying customers. These changes to   licensing and distribution will affect all subsequent versions of   our current products as well as new products, ensuring their   future development by Cloudera and the community is better   protected. The net of our new licensing models that will be more open   with respect to the customer and developer use of the software   and more restrictive concerning non-paying customers and efforts   by others to take our innovation for their own commercial   purposes. We believe that this licensing and distribution   framework will have a material benefit on Cloudera's business   over time. With that update on product and licensing, let me quickly   touch on a couple of other important strategic matters. Some of   you will recall that we expanded our partnership with IBM in Q2.   We are very excited to be working much more strategically with   IBM. We had our best customer bookings quarter ever with IBM in   Q2 and believe that the launch of CDP will further the momentum   of the partnership. CDP and the Enterprise Data Cloud is a   natural complement to IBM's and Red Hat's enterprise cloud   initiatives. Today, we also issued a press release on our agreement to   acquire certain assets, customers, and intellectual property of   Arcadia Data. Arcadia was a partner and we had many joint   customers. Its technology will greatly improve productivity and   time to insight for business users when utilizing CDP with cloud   object stores such as S3, ADLS and with Apache Kafka. Arcadia's ArcEngine software uses machine learning to   anticipate and pre-compute common queries and reports for   self-service access to data and accelerated analytic response   times. We expect Arcadia's technology to enhance the usability of   our platforms and the experience for business users to higher   performance and dramatic increases in user concurrency on large   data volumes. In addition, I'm pleased to welcome the entire   Arcadia Engineering Organization to Cloudera. Finally, as you likely know, Icahn Capital built a large   position in our stock. We work constructively with Carl Icahn and   his associates to develop a standstill agreement with a number of   important terms. Consistent with that agreement, we're pleased to   welcome Nick Graziano and Jesse Lynn to our Board of Directors.   We look forward to working with Nick and Jesse to enhance value   for all of our shareholders. Let's now turn to Jim for the detailed financial discussion,   before I return for some concluding remarks. Jim, over to   you.  Jim Frankola    --   Chief Financial Officer  Thanks, Marty. Hello, everyone. As Marty indicated, Q2 was   better than planned and positions us well for the remainder of   the year. Total revenue for the second quarter was $197 million   and subscription revenue was $164 million. Operating cash flow   for the quarter was negative $33 million. Because of the merger,   comparative year-over-year information on these items is not   meaningful. As always, details concerning definitions and trends   can be found in the supplemental materials on Cloudera's Investor   Relations website. Annual recurring revenue for fiscal Q2 was $682 million, up   16% year-over-year. ARR growth is driven primarily by existing   customers renewing and expanding agreements. It is encouraging   that every ARR size cohort expanded in Q2 as compared with the   second quarter of last year. Revenue and ARR benefited from   stronger operational execution and improved field level   functioning. In Q2, we had fewer slip renewals and converted some   of Q1 slip renewals. Dollar-based churn was in line with Q1 as   forecasted. With improved execution and the launch of CDP, we   expect churn to decline to a 12% to 13% annualized rate in the   second half of the year. We concluded Q2 with 953 customers who started at or have   grown to more than $100,000 of ARR. This was a net increase of 24   over the prior quarter. As Marty highlighted, our greatest   customers remain -- our largest customers remain stable and   continue to expand consumption of our offering, with more than   140 customers spending in excess of $1 million of ARR. As I review the remainder of the income statement, note unless   otherwise stated, all references to expenses and operating   results are on a non-GAAP basis. Historical non-GAAP results are   reconciled to GAAP results in the press release issued earlier   today. Our adjustments from GAAP to non-GAAP are limited to   stock-based compensation and amortization of M&A-related   intangibles. Total gross margin for Q2 was 77%, driven by subscription   gross margin of 86%. Operating expenses were $158 million for the   second quarter or 80% of revenue, an improvement of -- from 84%   of revenue in Q2 of fiscal 2019, including an operating expenses   are $13 million of merger-related spending. Excluding these   amounts, operating expenses were 74% of revenue in Q2. These   results reflect the rapid achievement of our planned cost   synergies and increased operating leverage since the merger. In   particular, sales and marketing expense declined from 45% of   revenue in the year-ago period to 41% of revenue in Q2. And   R&D fell from 28% of revenue to 24%. The $13 million of   merger-related expenses include severance and retention costs, as   well as third-party fees associated with integrating the systems   and processes of the combined company. Overall, operating loss was $7 million in Q2, representing an   operating margin of negative 4%, burdened by seven percentage   points of merger-related expenses. Excluding these expenses,   operating margin would have been positive 3% for the second   quarter, a substantial improvement from Q2 '19's operating   margins of negative 7%. Loss per share was $0.02 in the second   quarter based on 277 million weighted average shares outstanding   compared to a loss of $0.05 in the second quarter fiscal '19. Now turning to the balance sheet and cash flow. We exited Q2   with $509 million in cash, cash equivalents, marketable   securities and restricted cash, down from $547 million at the   conclusion of Q1. Operating cash flow for the second quarter was   negative $33 million , which includes $13 million of   merger-related payments. Cash flow performance was better than   expected due to strong execution on merger synergies in both   headcount and non-headcount related spending. As you may recall, we had planned to reach $125 million of   annualized cost savings by the end of this fiscal year. We are   ahead of schedule and have already achieved this annualized   target in Q2. Capital expenditures were $2 million in the quarter. Total   contract liabilities, which comprised deferred revenue and other   contract liabilities were $464 million at the end of the second   quarter, RPO was $707 million. I will conclude by providing initial guidance for fiscal Q3   and updated guidance for fiscal 2020. We expect Q3 total revenue   to be between $187 million and $190 million and subscription   revenue in the range of $162 million to $164 million. Net loss   per share is projected to be $0.08 to $0.06, based on 283 million   weighted average shares outstanding. For fiscal year 2020, we expect total revenue to be between   $765 million and $775 million and subscription revenue in the   range of $645 million to $655 million. Since we are ahead of plan   in capturing merger cost synergies, we now expect operating cash   flow for fiscal year 2020 to be negative $80 million to negative   $65 million and net loss per share to be $0.28 to $0.24 based on   280 million weighted average shares outstanding. Projected operating cash flow for fiscal year 2020 includes   approximately $60 million of merger-related payments. Adjusting   for these non-recurring merger-related expenses, the business is   expected to be nearly OCF break even for the fiscal year. As   discussed last quarter, soft Q1 bookings and pipeline will weigh   on revenue and ARR growth rates in the second half. We believe   that we have turned the corner from Q1 and we'll continue to   consistently build pipeline in Q3 and Q4. Given our typical sales   cycle, we believe that the pipeline growth that we saw in Q2 will   yield bookings in Q4 and Q1 of fiscal '21. As such, we are   raising our subscription revenue and ARR guidance in the second   half. Specifically, we anticipate Q3 ARR to be in the range of   $685 million to $695 million and Q4 ARR to be in the range of   $685 million to $720 million. With respect to components of revenue, we expect a continued   mix shift in the second half of fiscal 2020 in favor of   subscription revenue. Services revenue should decline as a   percentage of total revenue, as subscription revenue outperforms,   and as some of our services personnel are deployed to assist with   a smooth CDP rollout. As a reminder, our fiscal '20 financial   plans do not depend on CDP customer adoption. We believe the   value of CDP in fiscal 2020 is the assurance that it provides to   customers and prospective customers in the exact composition,   functionality, and performance of the next generation   platform. We expect our financial plans to be achieved through the   purchase and expansion of our existing offerings through the   balance of the fiscal year. The revenue impact of CDP from   specifically CDP sales will occur primarily in fiscal 2021. I will now return the call to Marty.  Martin Cole    --   Chairman and Interim Chief Executive Officer  Thanks, Jim. We are pleased to provide a straightforward,   clean report for the second quarter and to offer an improving   outlook for the year. We are executing according to our plans and   exceeded expectations in Q2. I've been on the ground over the   past few months and have been pleased that our employees are   responding well to the call to action. Our team is focused on   delivery and execution. We completed a major milestone in August   with the delivery of the first release of the CDP public cloud   service. And we're encouraged by the early reception of CDP by   customers. And apart from customer adoption, the launch of CDP   has instilled confidence in our buyers, as they now know that   they can invest toward an enterprise data cloud. While recognizing the challenges ahead, I am optimistic that   we are on better footing today than when we entered the fiscal   year. Anticipating the question, I have no news to share   regarding a permanent CEO. As discussed previously, the Board has   formed a search committee and that committee is actively   evaluating candidates. These placements take time and we're   focused on finding the right individual for the job. Until that   process concludes, I'm on the ground acting as Interim CEO and   keeping the team focused on executing our plans. So let's pause   here and take some questions. Operator, please begin the Q&A   portion of the call. Questions and Answers:  Operator  [Operator Instructions] And you'll have a question from Jack   Andrews from Needham.  Jack Andrews    --   Needham -- Analyst  Good afternoon. Thanks for taking my question. I always wonder   if you could shed some light on the messaging to customers around   CDP. This seems like clearly a superior product to what you have   currently been offering. So is this considered an upgrade to   their existing solution and may therefore command a higher price?   Or are you aiming to perhaps hold pricing steady through a   different consumption-based pricing models? Or any sort of   thoughts you can share about this dynamic?  Martin Cole    --   Chairman and Interim Chief Executive Officer  Yeah. Thank you. The -- we're going to certainly describe a   lot more at Strata later this month, particularly with respect to   pricing and how that's going to be positioned. But let me just   take a moment and talk about why we're excited about the offering   and the capabilities. As we talked about, this will be the only   -- the first and only enterprise cloud in the marketplace --   enterprise data cloud in the marketplace. We're creating   capabilities that support both hybrid and multi-cloud needs.   Well, we're going to address the multifunction analytics from the   edge to the AI. And also using our Shared Data Experience, SDX,   we're going to have a consistent security in governance, all of   that on an open source environment. So I think, in our view is it's unique. It's what our   customers are looking for and we're delivering it.  Jack Andrews    --   Needham -- Analyst  Great, well, thank you for that. We'll look forward to some   more details, I guess, in a couple of weeks. Just as quick   follow-up, you talked about the internal metrics and pipeline   generation have improved markedly from 1Q, could you drill into   that a little bit more? Outside of the clarity on the technology   roadmap, is there something else that's driving that improvement?   Whether it's, you know, a different approach you've taken on the   sales front, or is it just you've got everybody -- is the merger   integration is more complete and everyone is just executing   better overall?  Martin Cole    --   Chairman and Interim Chief Executive Officer  Yeah, our view is that certainly in Q2 we've seen an   increasing pipeline. We believe our execution is better than it   had been coming out of the early days of the merger. And just as   important, we have clarity regarding the roadmap, we've been able   to demonstrate CDP to customers, we did that in mid-June, which   gave them more confidence as to the direction and capabilities we   were delivering. So it's -- and I would summarize it, it's around   delivery and execution is leading to better results.  Jack Andrews    --   Needham -- Analyst  Great. Thanks for taking my questions.  Martin Cole    --   Chairman and Interim Chief Executive Officer  Thank you.  Operator  And your next question comes from Chad Bennett from   Craig-Hallum.  Chad Bennett    --   Craig-Hallum -- Analyst  Great. Thanks for taking my questions. So, Marty. I just want   to drill down into something you talked about in the new   licensing and pricing model that I think is pretty important,   just the whole binary functionality. And I'm not sure how many   people understand how important that is. But can you give us a   sense for just how much of the base, especially with your larger   ARR base, how important that binary functionality is? And maybe   even how important that binary functionality is broadly to the   open source community?  Martin Cole    --   Chairman and Interim Chief Executive Officer  Yes. So, Chad, thanks for asking the question. Because this is   an important area around licensing and I sort of give you the   context. As the two companies came together, we needed to make a   decision. And one of the decisions we made in this quarter was   that we were going to go and adopt the Red Hat model. We believe   that was industry best practice, and so we've done that. And what   happens in the binaries, is this is where the proprietary   capabilities, sort of the stickiness, the security, the   governance all comes together. And as we spend time with   customers, even in the quarter, we've had some who've said, OK,   this is important, we want that capability, we want your support,   we want your services. And so we believe that does create an   element of stickiness that was beyond what was previously   available. And in particular, it also -- it recognizes that the public   cloud providers can't just take the capability and commercialize   it in an open source world without the capabilities that we're   delivering. So we do believe this makes a difference. And we've   had customers who have been appreciative of sort of the direction   we're taking. While being open source, it yet moved beyond that   and with the binaries behind a paywall.  Chad Bennett    --   Craig-Hallum -- Analyst  Right. No, that's perfect. Thank you. And then maybe one   follow-up for Jim. So, Jim, you know, it's good to see the   guidance improvement incrementally for the year. And just   thinking about the drivers of that, I mean, you mentioned you're   not really factoring in anything for CDP cloud. And then it   sounds like the churn rate really didn't improve much, at least   in this quarter. And you're expecting some improvement in the   second half, which I think you probably would expect it on the   prior guide. So I'm just wondering kind of what -- kind of was   the main or couple of main drivers of you guys upping the target   a little bit? Thank you.  Jim Frankola    --   Chief Financial Officer  Yeah. Thanks, Chad. I'll echo Marty's point on execution. So   solid execution in Q2 really helped us out financially. So in Q1,   we were still operating through the fog of the merger. Many Q1   deals that were set to renew in Q1 slipped into Q2. We had   forecasted that some of that fog would continue into Q2. And   quite frankly, we're back to normal operations with respect to   new renewal cycles. So we were able to renew many of those   slipped ones -- slipped Q1 deals. Our Q2 renewal cycles were   essentially on our historical averages. We executed to our   internal plans, actually beat our internal plans on new and   expansion bookings. So across the board, we basically executed to   our objectives and that is what drove the performance in the   quarter and allowed us to raise the software numbers for the back   part of the year. And an element of that is, as Marty said, our   pipeline generation got back on track.  Chad Bennett    --   Craig-Hallum -- Analyst  Great. Perfect. Thank you.  Operator  And your next question comes from Dan Ives from Wedbush   Securities.  Dan Ives    --   Wedbush Securities -- Analyst  Yeah. Thank you and solid quarter. Just my question is, in   regards to customers sales force, what you're seeing. Talk about   maybe some of the changes in conversation that you're having   today versus maybe even three months, four months ago. I mean,   just more clarity in terms of the product roadmap and just the   type of conversations you're having with customers?  Martin Cole    --   Chairman and Interim Chief Executive Officer  Dan, it's Marty. So, you know, as we talked about last quarter   and that some of the challenges coming out of the merger, we had   less visibility to our product roadmap. It was less clear where   we were going with the enterprise data cloud vision and   capabilities. So we continue to have strength with our on-premise   customers, and what I would characterize as our current   offerings. And now we're able to advance those conversations to   talk about where we are going and what will come next. And so our   ability to demonstrate it, to show what those capabilities are,   to understand what the migration path will be. And we're in that   -- those are individual conversations with individual customers   as to where do they go from their HDP or CDH capabilities   products to where does that go with CDP. And so I think that that   clarity, that availability of information is very powerful.   Because we're no longer -- they are no longer speculating,   they're no longer wondering whether our future will be as bright   as we believe it to be as they can now see it. And then in   particular, getting it out there in for demonstrations and   releasing it as promised to customers -- some customers over the   last couple of weeks, has been a very powerful reinforcement.  Dan Ives    --   Wedbush Securities -- Analyst  Thanks. And the second question. What -- on a day-to-day   basis, as you've gone through pipeline and just going through the   integration process, what's maybe surprising you guys both on the   positive and negative side? You know, one of each, if I just   think that where we are today, going back to maybe the last three   months.  Martin Cole    --   Chairman and Interim Chief Executive Officer  Yeah, I -- surprises -- we are pleasantly surprised feeling   very good about customer adoption of our current products. As we   said our -- certainly our customers over $1 million remain very   strong, well, north of 140 customers. Our overall number of   customers we said has gone up. So that's a very positive   statement. And what I've been working to reinforce is, the   customers are extremely important. It's kind of a tourism,   obviously, without it, there's not much in the business. One of the things we did in the quarter is we put in place a   Chief Customer Officer to further emphasize the importance of   customer success and to work around the adoption from here   forward with CDP. Probably the one area that maybe has surprised   us a bit as well and I probably wouldn't say surprised, because   we saw this coming. As we continue to compete with the public   cloud providers, and on the one hand, our customers say to us   that we don't want lock in. So we appreciate where you guys are   taking us. But yet there's still some adoption that's occurring   there among large enterprises. And so, we expect that there will   be some normalization, rationalization that occurs over time as   companies go to multi-cloud, they want that capability, they want   to go hybrid, somethings will be on-prem, somethings will be   private, somethings will be public. And we like that, so maybe at   a point in time that is viewed as less positive, but we're   actually playing right into that position, that's where we're   targeting our solution.  Dan Ives    --   Wedbush Securities -- Analyst  Thank you.  Martin Cole    --   Chairman and Interim Chief Executive Officer  Thanks, Dan.  Operator  And your next question comes from the line of Mark Murphy from   JPMorgan.  Matthew Coss    --   JPMorgan -- Analyst  Good afternoon. This is Matt Coss on behalf of Mark Murphy.   Jim, guidance for Q2 revenue implies a sequential decline in Q3   total revenue. And I believe annual guidance would imply a   single-digit sequential increase in Q4 total revenue. I know   we're not sort of apples-to-apples comparing last year's   seasonality, but it also sounds like you're a little bit more   bullish coming out of Q2. And I'm wondering, you know, is this   too conservative or is the level of conservatism you're baking   into your guidance is similar to the levels that you shared with   us in your guidance last quarter?  Jim Frankola    --   Chief Financial Officer  Yeah, Matt. What I'll say is, our forecasts are prudent and   reflect our best view of what the world looks like. The level of   conservatism hasn't changed much in terms of   quarter-over-quarter. Our visibility to the business has   improved. As you expect, another quarter post merger, our systems   and processes are more mature and we have greater visibility.   What I'll say is, in terms of all the metrics you mentioned, ARR   is the single best metric to look at what is going on in the   business year-over-year or quarter-over-quarter. Because it   normalizes for purchase price adjustments, merger effects. One of   the dynamics that are going on is our recurring software revenue   is growing faster than the non-recurring software revenue or   professional services revenue. So you have all those dynamics in   play that, that factor into the revenue numbers that are cleansed   out of the ARR number.  Matthew Coss    --   JPMorgan -- Analyst  Got it, that's helpful. Thanks, Jim. And maybe can you drill   down a little bit into what you've seen in a way of contribution   from IBM? I think this agreement might have flown under the radar   a couple months ago. But is there any comment or color you can   give us on the lead generation, maybe what IP by -- what IBM   customers are seeing in CDP versus some of your other   partners?  Martin Cole    --   Chairman and Interim Chief Executive Officer  Yeah, this is Marty, Matt. So as I referenced earlier, we had   a very strong quarter with IBM in Q2. It was our best quarter   ever. And at the same time, we also -- our announcement, the   significance of our announcement is the relationship has expanded   significantly. Now, all of our products, all of the Cloudera   products are available to the IBM sales force to take to market.   So that is significant and we went from a limited set of products   to all products. And as well -- as we work with IBM, we share a   sort of common bias toward large enterprise customers. I mean,   we're working together there. So we now have the benefit of more   of their feet on the street on a global basis. We also have the   ability to take their products into the market. And so we'll be   looking over time as to what's best for our customers, is it's   something that we have build, something that they traditionally   built. Now there are ways to merge or integrate them together.   But it's a very powerful relationship, and at this point, it's a   unique relationship. The other part that's very exciting to us,   as you look at IBM's strategy, particularly around the hybrid   environment, clearly there -- I'll say in my words, clearly,   their decision to move forward with Red Hat around the enterprise   cloud is very complementary to what we're building with the   Enterprise Data Cloud and thus we're very excited by that.  Matthew Coss    --   JPMorgan -- Analyst  Thank you.  Operator  And your next question comes from the line of Pat Walravens   from JMP Securities.  Martin Cole    --   Chairman and Interim Chief Executive Officer  Pat, are you on the line?  Pat Walravens    --   JMP Securities -- Analyst  Sorry, sorry, I was muted. So here's a big picture question   for you. So if you look at MongoDB, they were an open source   database company, right? Three years ago, they introduced the   cloud-based product Atlas, now it's doing $150 million revenue,   it's 30% -- 37% total revenue grew 255% this quarter. So how is   your situation with the Cloudera data platform similar and how is   it different?  Martin Cole    --   Chairman and Interim Chief Executive Officer  Well, in terms of -- let me start with the Cloudera Data   Platform. Sort of --  Pat Walravens    --   JMP Securities -- Analyst  And I hope that's fair margin, right. You've given your   background, you know that you could take a shot at it.  Martin Cole    --   Chairman and Interim Chief Executive Officer  Well, I'm not going to spend a lot of time. I learned a long   time ago, don't spend a lot of time talking about specific   competitors. But I will tell you sort of what we're doing and   maybe the areas where there's some differences. I think in terms   of -- hopefully, we are making it clear in terms of where we're   going with Cloudera Data Platform, in terms of the enterprise   data cloud. In terms of similarities, we think the opportunity is   big. You know, there's both -- for us, we have been in a very   strong position on-prem. As we deliver CDP and particularly the   first set of release was around the public cloud. We've now   opening up that market to us as well, so that's significant for   us. In terms of timing, maybe they're a bit ahead of where we have   been. But we believe that our ability to catch up is significant   and sort of an adoption, because of the unique capabilities we're   offering, which is beyond just the database. We have the Data   Hub, the Data Warehouse, machine learning. All of these   capabilities are part of our CDP offering. So I think the other   aspect is, we're going to be a similar experience and ease of   use, whether you're on-prem, public cloud, eventually private   cloud, so that's unique aspects. And I think just as I sit in and   thank you for suggesting my experience is relevant. But just as I   reflect on it and understanding big enterprise customers, they'd   like that flexibility, they don't want to lock in, they want the   ability to move across platforms, that's what we're focused   on.  Pat Walravens    --   JMP Securities -- Analyst  All right. Thank you. And then Frankola, one for you. I mean,   just as you sort of sit back and look at all this, what part of   this story do you think is most misunderstood by investors?  Jim Frankola    --   Chief Financial Officer  I think the thing that's most misunderstood is that, a lot of   folks think there is a binary outcome is that, there will either   be a winner in the cloud or on-prem. And the real answer is, it's   going to be both. There are some customers and workloads that   naturally belong in the cloud, there are some that belong on   premises, there's some that belong in private cloud. And where   our target market, the largest 2,000 enterprises in the world, we   believe, based on what we hear from them, that they will have   hybrid solutions in all places and they'll value a vendor that   brings that altogether. So I think the fact that it's -- a lot of   people think that it's binary, a win or lose versus a much more   nuance, how big is this market is the most misunderstood   thing.  Pat Walravens    --   JMP Securities -- Analyst  All right. Thank you guys.  Operator  And your next question comes from the line of Michael Turits   from Raymond James.  Unidentified Participant  Good afternoon, this is actually Robert Magic [Phonetic] on   for Michael. You made it clear that the pipeline improved. How   much of that benefit is due to the acquisition of MapR or   alternatively, do you see an opportunity within those customers   down the line?  Martin Cole    --   Chairman and Interim Chief Executive Officer  At this point, the HPEs acquisition of MapR, we view as a   positive. But it has not yet become a material impact in the   pipeline. There are select customers that we're focusing on, as   well focusing with our partners. So we're optimistic that that   will lead to improved results. Certainly, more wins for us, but   it's not something that we have modeled as material at this   time.  Robert Magic    --   Raymond James -- Analyst  And then just perhaps one more from -- [Speech Overlap] That's   great. Thank you. And then just perhaps one more for me. You   touched on earlier, but can you give us some more color on some   specific initial customers feedback you've received on CDP?  Martin Cole    --   Chairman and Interim Chief Executive Officer  Yeah, it's -- they're accessing it, they're working with it,   they're starting to use the use cases or deploy use cases. And   it's -- the reaction is very positive. We're spending a lot of   time and energy on the experience. I think the key part is that,   the fact that they can have a common security and governance   using the S -- what we refer to as SDX is really powerful, right,   so they actually have the ability to do our capabilities, they've   historically done on-prem, now move those to the clouds,   provision clusters, much quicker, that is like, you know, really,   really cool stuff to them and they want more of it. And so   directionally, it's been very exciting. Our engineering team has   done a phenomenal job getting us to this point. Very   positive.  Robert Magic    --   Raymond James -- Analyst  Thanks a lot.  Operator  And your last question comes from Sanjit Singh from Morgan   Stanley.  Sanjit Singh    --   Morgan Stanley -- Analyst  Thank you for taking the questions and nice to see you back to   sort of beaten [Indecipherable] territory after a couple of   quarters. I guess, I just have another similar basic question   similar to Pat's, which is, what does Cloudera want to be, in the   sense of who is going to be the target customer going forward?   And related to that, what is that, given the focus on whatever   target segment of the market you're looking at, what should we   expect in terms of profitability and cash flow? I mean, coming   out of this transition, should we expect Cloudera to be focused   on a narrow set of customers with better profitability and cash   flow that should be expected? I just try to get a sense of what   the longer term strategy here is in terms of how you want   balancing profitability and cash flow versus the opportunities   you see in front of you?  Martin Cole    --   Chairman and Interim Chief Executive Officer  Yeah. So let me start and then I'll have Jim add some thoughts   as well. Let me begin with -- our strategy has not changed. We so   -- even as I've moved into the post and been running the company   for a period here, we've made the same strategy. We're investing   in growth. But at the same time, as I commented in my prepared   remarks, we're also going to be more disciplined on the cost   side. So we're going to determine where is the right place to   make investments and where is the right place to be more   efficient or optimize our cost structure. We're focused on the   Global 2,000, that has been our target market. The largest global   enterprise with complex multifunction use cases. We go from the   edge to AI, we have the capabilities in between in terms of Data   Warehouse, Data Hub. So the strategy remains the same. And our   focus is on restoring the greater top line growth. At the same   time, managing our costs in a diligent fashion. And as I think   and Jim can certainly comment, hopefully you will have seen in   our Q2 results, we've done a better job of that in Q2 and   certainly improving on operating cash flow. And Jim, maybe you   can add just a little additional color.  Jim Frankola    --   Chief Financial Officer  Yeah. So we believe that our target customer set, large   customers still represent a market opportunity measured in the   tens of billions of dollars. So from a market opportunity   standpoint, it's enormous. The segments that we play in are   naturally growing 15%, 20%, 25% a year, depending on which   analyst survey you look at. So with a large market rapidly   growing, which bodes well for us once we have CDP out the market.   From a financial model standpoint, be careful, it's still way   premature to start giving guidance. But the way we think about   the business model is, if our top line is growing at 15% or 20%   or even slightly more than 20%, we believe that we now have the   leverage and the scale to throw off 20% or so cash flow margins.   So once we get through the transition, once we get CDP out there   and gaining traction, we think the opportunity is to grow   substantially and throw off very healthy margins.  Sanjit Singh    --   Morgan Stanley -- Analyst  And I have one follow-up, Jim, on the cloud side. So in the   scenario that CDP does get well received by market, you're   starting to see demand build over multiple quarters, what's the   implications for the model? Are you going to use CDP to grow   within your target market, call it the Global 2,000 or is that   going to be as a (inaudible) to service other parts of the   market? I guess that's part one of the question. But then, what   else are the model implications in terms of -- if the cloud CDP   becomes a larger portion of revenue, what does that do that to   the model in terms of your customer acquisition costs, your gross   margin, so that the longer term impact as we think about the   potential for CDP over time?  Martin Cole    --   Chairman and Interim Chief Executive Officer  Yeah. So first of all CDP encompasses several products. It   encompasses a public cloud product and encompass products that   work on premises, whether it's (inaudible) or the private cloud.   So we're focused right now on talking about the public cloud.   That is going to create new market opportunities for us. So we   think that will stimulate growth over time. And to the extent it   is -- if it impacts our model, it will be generally additive. Now, with that said, as you'd expect in a public cloud   environment, we think that form of purchase will be primarily in   some form of prepaid credits, that by definition have a contract   duration or billings duration less than a typically subscription   term. So we do expect our durations to gradually fall over time.   But we think that's going to be very gradual because our billings   duration is already roughly 13 months today. So we've moved from   a multiyear prepaid model to an annual upfront model. So we don't   think the billings model impacts would be negative, we think the   economic benefits will be positive with increased growth. And   then it's very hard to predict, but we believe that it will also   help us in terms of gross margins. Our gross margins are close to   90% today, we see this helping us take a path toward 90%. And we   think that over time it will help us with our engineering and   sales ratios as well.  Sanjit Singh    --   Morgan Stanley -- Analyst  Thanks for taking my question. Appreciate it.  Martin Cole    --   Chairman and Interim Chief Executive Officer  Thank you. Well, I think that concludes our call today. I want   to thank you all for joining us. Appreciate your questions. And   we're on to Q3. See you all on our next call. Thank you.  Operator  [Operator Closing Remarks]  Duration: 53 minutes  Call participants:  Kevin Cook    --   Vice President, Corporate Development and Investor   Relations.   Martin Cole    --   Chairman and Interim Chief Executive Officer   Jim Frankola    --   Chief Financial Officer   Jack Andrews    --   Needham -- Analyst   Chad Bennett    --   Craig-Hallum -- Analyst   Dan Ives    --   Wedbush Securities -- Analyst   Matthew Coss    --   JPMorgan -- Analyst   Pat Walravens    --   JMP Securities -- Analyst   Unidentified Participant   Robert Magic    --   Raymond James -- Analyst   Sanjit Singh    --   Morgan Stanley -- Analyst     More CLDR analysis   All earnings call transcripts        10 stocks we like better than Cloudera,   Inc.     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Cloudera,   Inc. wasn't one of them! That's right -- they think   these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " Cloudera, Inc.    (NYSE: CLDR)        Q2 2020 Earnings Call       Sep 4, 2019 ,   5:00 p.m. ET ",
    " Operator ",
    "Good afternoon. My name is Elaine and I will be your   conference operator today. Welcome to the Cloudera Second Quarter   Fiscal 2020 Quarterly Results Conference Call. [Operator   Instructions]",
    "Your host is Kevin Cook, Vice President, Corporate Development   and Investor Relations. Kevin, you may begin your conference.",
    " Kevin Cook    --   Vice President, Corporate Development and Investor   Relations. ",
    "Thank you, Elaine. Good afternoon, and welcome to Cloudera's   second quarter fiscal 2020 conference call. We will be discussing   the results announced in our press release issued after market   close today. From Cloudera with me are Marty Cole, Chairman and   Interim Chief Executive Officer; and Jim Frankola, Chief   Financial Officer.",
    "During the course of this call, we will make forward-looking   statements regarding future events and the future financial   performance of the Company, including those as merged with   Hortonworks. Generally, these statements are identified by the   use of words such as expect, believe, anticipate, intend, and   other words that denote future events. These forward-looking   statements are subject to material risks and uncertainties that   could cause actual results to differ materially from those in the   forward-looking statements. We caution you to consider the   important risk factors that could cause actual results to differ   materially from those in the forward-looking statements, in the   press release and on this conference call. These risk factors are   described in our press release and are more fully detailed under   the caption Risk Factors in our Annual Report on Form 10-K, our   Quarterly Report on Form 10-Q and our other filings with the   SEC.",
    "During this call, we will present both GAAP and non-GAAP   financial measures. Non-GAAP financial measures exclude   stock-based compensation expense and amortization of acquired   intangible assets. In addition, we provide a non-GAAP weighted   average share count for fiscal 2020. These non-GAAP measures are   not intended to be considered in isolation from, a substitute   for, superior to our GAAP results. And we encourage you to   consider all measures when analyzing Cloudera's performance. All   numbers reported for prior periods are presented for Cloudera on   a stand-alone basis since the merger with Hortonworks closed on   January 3rd 2019, and as such, there is no comparative   year-over-year financial information for the combined   company.",
    "For complete information regarding our non-GAAP financial   information, the most directly comparable GAAP measures and   quantitative reconciliation of those figures, please refer to   today's press release regarding our second quarter results. The   press release has also been furnished to the SEC as part of our   Form 8-K.",
    "In addition, please note the date of this conference call is   September 4th 2019, and any forward-looking statements that we   make today are based on assumptions that we believe to be   reasonable as of this date. We undertake no obligation to update   these statements as a result of new information or future   events.",
    "Now, Marty Cole, Chairman and Interim CEO.",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Thank you, Kevin. Hello, everyone, and thank you for joining   us to discuss our second quarter fiscal 2020 financial results.   It has been an exciting month, since I became Interim CEO on   August 1st. I am pleased to report that we executed well in Q2. I   want to thank my team for its continued focus on our customers   and people during this period. Among our recent accomplishments,   we delivered, as promised, an initial release of our cloud-native   data management and analytics offering, Cloudera Data platform.   We also entered into an agreement to acquire certain assets of   Arcadia Data, including technology that accelerates time to   insight for data analytics. And we welcome two new Board members   as a result of the large stake that Icahn Capital accumulated in   Cloudera stock. During this call, we'll cover these topics as   well as important changes in our licensing and distribution   strategies.",
    "Beginning with Q2 financial performance, total revenue in the   second quarter was $197 million. Subscription revenue was $164   million and operating cash flow was negative $33 million.   Although the year-over-year comparisons on these numbers are not   meaningful, as a consequence of the merger with Hortonworks, each   of these results exceeded expectations.",
    "Annualized recurring revenue was $682 million at the   conclusion of the quarter, representing 16% year-over-year   organic growth, again ahead of expectations. Finally, we had a   good quarter in terms of adding new customers. We now have 953   customers, who exceed $100,000 of ARR, a net increase of 24 for   the quarter.",
    "With that quick overview of our results, let me spend a moment   on my priorities as Interim CEO. First, I am focused on improving   execution, In particular, the execution of our enterprise data   cloud strategy. This strategy begins with the phased roll-out of   our new Cloudera Data Platform. We met the first milestone in the   current quarter as last week, we delivered initial releases of   our CDP public cloud services.",
    "I'm also very focused on the execution of our financial plans.   We are deliberately balancing our investments in continued growth   and disciplined expense management through improved cash   flow.",
    "Second, I am focused on retaining and growing as many of our   customers as possible. Cloudera's base of large ARR customer is   stable and has continued to expand each quarter, including in Q2.   I've gotten increasingly active with our customer base, as was my   practice at Accenture, and all of my interactions have been   positive. Customers are enthusiastic about CDP and the Enterprise   Data Cloud.",
    "Third, I am focused on our employees and our culture. We have   a very talented group of people at Cloudera, distributed across   the globe who are driving real innovation for the benefit of our   customers. I'm working with the leadership team to create a more   disciplined and action-oriented culture and to make Cloudera a   great place for current and future employees to advance their   careers while solving some of the world's biggest challenges   through data.",
    "And last, but not least, I'm focused on delivering greater   value for our shareholders. As we get the first three right and   succeed in producing hybrid and multi-cloud solutions, delighting   customers and inspiring employees, we truly believe that our   shareholders will benefit. The Board and I are committed to   enhancing shareholder value.",
    "Let me turn to some of the highlights for the second quarter   and in recent weeks. Since it was a feature of last quarter's   conference call, I'd like to follow up on customer buying   behavior and industry trends. Our internal metrics and pipeline   generation have materially improved from Q1 levels. Together with   solid execution in our second quarter, we are on plan for   achieving our objectives for this fiscal year. For example, basic   renewal activity rebounded in Q2. We executed better, resulting   in fewer slip renewals than in Q1. We believe the improvement in   renewals was helped in part by more clarity regarding the new   Cloudera technology roadmap and greater certainty as to the   composition and functionality of CDP.",
    "We demonstrated these capabilities to our customers publicly   in mid-June. In particular, our class of $1 million plus ARR   customers and its associated revenue remain stable. In spite of   already being at revenue scale, this group continues to expand on   a net basis. As far as competition, in the second quarter, our   metrics improved across the board and we saw an increase in our   win rates against the cloud service providers as compared to Q1.   As CDP gets established, we expect to gain further across this   competitive dynamic.",
    "That said, the hyperscale cloud providers remain our primary   competitors. This is all reflected in continued pipeline growth.   As discussed in connection with Q1 results, in Q1, we experienced   a booking shortfall due to weaker than expected pipeline entering   the quarter and the impact of the merger integration. The   improvement we saw in pipeline generation at the conclusion of Q1   has persisted. And we believe that we are building pipeline at a   rate that supports our financial plans.",
    "Overall, I'm pleased with our execution in Q2. But, we've got   more work to do to restore higher top line growth. In addition to   better execution, we are focused on meeting customers' demands   for hybrid and multi-cloud solutions that support use cases from   the edge to AI. That is the promise of the enterprise data cloud   and CDP.",
    "I am very grateful to our team for its tremendous effort in   releasing our initial CDP Cloud Native Services. We already have   a select group of customers evaluating our CDP Data Hub, data   warehouse, and machine learning services. These are the first in   a regular cadence of cloud services we expect to roll out over   the next year.",
    "We plan to launch CDP at the Strata Data Conference in New   York later this month. It is a groundbreaking set of offerings   that lay the foundation for the Enterprise Data Cloud, spanning   multiple public and private clouds as well as data centers. We   believe CDP's consistent data security, governance, and metadata   management across all of these environments is a significant   competitive advantage.",
    "CDP offers broad functionality including Edge, IoT, Data   Warehouse, Machine Learning and AI and makes it easy for diverse   sets of business users to apply them across shared data. CDP will   enable enterprise IT to say yes to business use cases that were   simply not possible before. CDP will enable enterprise IT to say   yes, to getting control over short sighted and costly shadow IT   projects that put the business at risk. And yes, CDP will be the   industry's first enterprise data cloud.",
    "The other major development in Q2 was the announcement of   changes in our licensing and distribution model. We've aligned   our model with the industry standards set by Red Hat. Red Hat's   practices are well understood and have been broadly accepted by   enterprise customers in the Open Source community. As a result of   these changes, all Cloudera software will be licensed under an   OSI validated Open Source license.",
    "We expect the proprietary Cloudera software offerings will be   provided under an Open Source license beginning early next year.   Applied to former proprietary products and new product   innovation, the terms of its license will serve to protect our   intellectual property investments from encroachment by public   cloud providers.",
    "Secondly, the distribution of our compiled software, the   binaries, will be limited. Specifically, access to these   binaries, as well as support services and technical expertise   will be available only with the current subscription agreement.   The binaries contain Cloudera-specific intellectual property, the   testing, securing, and integration of various Open Source   projects into an enterprise grade system that meets the   requirements of our customers.",
    "Consistent with the Red Hat model, our binaries will no longer   be freely available to non-paying customers. These changes to   licensing and distribution will affect all subsequent versions of   our current products as well as new products, ensuring their   future development by Cloudera and the community is better   protected.",
    "The net of our new licensing models that will be more open   with respect to the customer and developer use of the software   and more restrictive concerning non-paying customers and efforts   by others to take our innovation for their own commercial   purposes. We believe that this licensing and distribution   framework will have a material benefit on Cloudera's business   over time.",
    "With that update on product and licensing, let me quickly   touch on a couple of other important strategic matters. Some of   you will recall that we expanded our partnership with IBM in Q2.   We are very excited to be working much more strategically with   IBM. We had our best customer bookings quarter ever with IBM in   Q2 and believe that the launch of CDP will further the momentum   of the partnership. CDP and the Enterprise Data Cloud is a   natural complement to IBM's and Red Hat's enterprise cloud   initiatives.",
    "Today, we also issued a press release on our agreement to   acquire certain assets, customers, and intellectual property of   Arcadia Data. Arcadia was a partner and we had many joint   customers. Its technology will greatly improve productivity and   time to insight for business users when utilizing CDP with cloud   object stores such as S3, ADLS and with Apache Kafka.",
    "Arcadia's ArcEngine software uses machine learning to   anticipate and pre-compute common queries and reports for   self-service access to data and accelerated analytic response   times. We expect Arcadia's technology to enhance the usability of   our platforms and the experience for business users to higher   performance and dramatic increases in user concurrency on large   data volumes. In addition, I'm pleased to welcome the entire   Arcadia Engineering Organization to Cloudera.",
    "Finally, as you likely know, Icahn Capital built a large   position in our stock. We work constructively with Carl Icahn and   his associates to develop a standstill agreement with a number of   important terms. Consistent with that agreement, we're pleased to   welcome Nick Graziano and Jesse Lynn to our Board of Directors.   We look forward to working with Nick and Jesse to enhance value   for all of our shareholders.",
    "Let's now turn to Jim for the detailed financial discussion,   before I return for some concluding remarks. Jim, over to   you.",
    " Jim Frankola    --   Chief Financial Officer ",
    "Thanks, Marty. Hello, everyone. As Marty indicated, Q2 was   better than planned and positions us well for the remainder of   the year. Total revenue for the second quarter was $197 million   and subscription revenue was $164 million. Operating cash flow   for the quarter was negative $33 million. Because of the merger,   comparative year-over-year information on these items is not   meaningful. As always, details concerning definitions and trends   can be found in the supplemental materials on Cloudera's Investor   Relations website.",
    "Annual recurring revenue for fiscal Q2 was $682 million, up   16% year-over-year. ARR growth is driven primarily by existing   customers renewing and expanding agreements. It is encouraging   that every ARR size cohort expanded in Q2 as compared with the   second quarter of last year. Revenue and ARR benefited from   stronger operational execution and improved field level   functioning. In Q2, we had fewer slip renewals and converted some   of Q1 slip renewals. Dollar-based churn was in line with Q1 as   forecasted. With improved execution and the launch of CDP, we   expect churn to decline to a 12% to 13% annualized rate in the   second half of the year.",
    "We concluded Q2 with 953 customers who started at or have   grown to more than $100,000 of ARR. This was a net increase of 24   over the prior quarter. As Marty highlighted, our greatest   customers remain -- our largest customers remain stable and   continue to expand consumption of our offering, with more than   140 customers spending in excess of $1 million of ARR.",
    "As I review the remainder of the income statement, note unless   otherwise stated, all references to expenses and operating   results are on a non-GAAP basis. Historical non-GAAP results are   reconciled to GAAP results in the press release issued earlier   today. Our adjustments from GAAP to non-GAAP are limited to   stock-based compensation and amortization of M&A-related   intangibles.",
    "Total gross margin for Q2 was 77%, driven by subscription   gross margin of 86%. Operating expenses were $158 million for the   second quarter or 80% of revenue, an improvement of -- from 84%   of revenue in Q2 of fiscal 2019, including an operating expenses   are $13 million of merger-related spending. Excluding these   amounts, operating expenses were 74% of revenue in Q2. These   results reflect the rapid achievement of our planned cost   synergies and increased operating leverage since the merger. In   particular, sales and marketing expense declined from 45% of   revenue in the year-ago period to 41% of revenue in Q2. And   R&D fell from 28% of revenue to 24%. The $13 million of   merger-related expenses include severance and retention costs, as   well as third-party fees associated with integrating the systems   and processes of the combined company.",
    "Overall, operating loss was $7 million in Q2, representing an   operating margin of negative 4%, burdened by seven percentage   points of merger-related expenses. Excluding these expenses,   operating margin would have been positive 3% for the second   quarter, a substantial improvement from Q2 '19's operating   margins of negative 7%. Loss per share was $0.02 in the second   quarter based on 277 million weighted average shares outstanding   compared to a loss of $0.05 in the second quarter fiscal '19.",
    "Now turning to the balance sheet and cash flow. We exited Q2   with $509 million in cash, cash equivalents, marketable   securities and restricted cash, down from $547 million at the   conclusion of Q1. Operating cash flow for the second quarter was   negative $33 million , which includes $13 million of   merger-related payments. Cash flow performance was better than   expected due to strong execution on merger synergies in both   headcount and non-headcount related spending.",
    "As you may recall, we had planned to reach $125 million of   annualized cost savings by the end of this fiscal year. We are   ahead of schedule and have already achieved this annualized   target in Q2.",
    "Capital expenditures were $2 million in the quarter. Total   contract liabilities, which comprised deferred revenue and other   contract liabilities were $464 million at the end of the second   quarter, RPO was $707 million.",
    "I will conclude by providing initial guidance for fiscal Q3   and updated guidance for fiscal 2020. We expect Q3 total revenue   to be between $187 million and $190 million and subscription   revenue in the range of $162 million to $164 million. Net loss   per share is projected to be $0.08 to $0.06, based on 283 million   weighted average shares outstanding.",
    "For fiscal year 2020, we expect total revenue to be between   $765 million and $775 million and subscription revenue in the   range of $645 million to $655 million. Since we are ahead of plan   in capturing merger cost synergies, we now expect operating cash   flow for fiscal year 2020 to be negative $80 million to negative   $65 million and net loss per share to be $0.28 to $0.24 based on   280 million weighted average shares outstanding.",
    "Projected operating cash flow for fiscal year 2020 includes   approximately $60 million of merger-related payments. Adjusting   for these non-recurring merger-related expenses, the business is   expected to be nearly OCF break even for the fiscal year. As   discussed last quarter, soft Q1 bookings and pipeline will weigh   on revenue and ARR growth rates in the second half. We believe   that we have turned the corner from Q1 and we'll continue to   consistently build pipeline in Q3 and Q4. Given our typical sales   cycle, we believe that the pipeline growth that we saw in Q2 will   yield bookings in Q4 and Q1 of fiscal '21. As such, we are   raising our subscription revenue and ARR guidance in the second   half. Specifically, we anticipate Q3 ARR to be in the range of   $685 million to $695 million and Q4 ARR to be in the range of   $685 million to $720 million.",
    "With respect to components of revenue, we expect a continued   mix shift in the second half of fiscal 2020 in favor of   subscription revenue. Services revenue should decline as a   percentage of total revenue, as subscription revenue outperforms,   and as some of our services personnel are deployed to assist with   a smooth CDP rollout. As a reminder, our fiscal '20 financial   plans do not depend on CDP customer adoption. We believe the   value of CDP in fiscal 2020 is the assurance that it provides to   customers and prospective customers in the exact composition,   functionality, and performance of the next generation   platform.",
    "We expect our financial plans to be achieved through the   purchase and expansion of our existing offerings through the   balance of the fiscal year. The revenue impact of CDP from   specifically CDP sales will occur primarily in fiscal 2021.",
    "I will now return the call to Marty.",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Thanks, Jim. We are pleased to provide a straightforward,   clean report for the second quarter and to offer an improving   outlook for the year. We are executing according to our plans and   exceeded expectations in Q2. I've been on the ground over the   past few months and have been pleased that our employees are   responding well to the call to action. Our team is focused on   delivery and execution. We completed a major milestone in August   with the delivery of the first release of the CDP public cloud   service. And we're encouraged by the early reception of CDP by   customers. And apart from customer adoption, the launch of CDP   has instilled confidence in our buyers, as they now know that   they can invest toward an enterprise data cloud.",
    "While recognizing the challenges ahead, I am optimistic that   we are on better footing today than when we entered the fiscal   year. Anticipating the question, I have no news to share   regarding a permanent CEO. As discussed previously, the Board has   formed a search committee and that committee is actively   evaluating candidates. These placements take time and we're   focused on finding the right individual for the job. Until that   process concludes, I'm on the ground acting as Interim CEO and   keeping the team focused on executing our plans. So let's pause   here and take some questions. Operator, please begin the Q&A   portion of the call.",
    " Operator ",
    "[Operator Instructions] And you'll have a question from Jack   Andrews from Needham.",
    " Jack Andrews    --   Needham -- Analyst ",
    "Good afternoon. Thanks for taking my question. I always wonder   if you could shed some light on the messaging to customers around   CDP. This seems like clearly a superior product to what you have   currently been offering. So is this considered an upgrade to   their existing solution and may therefore command a higher price?   Or are you aiming to perhaps hold pricing steady through a   different consumption-based pricing models? Or any sort of   thoughts you can share about this dynamic?",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Yeah. Thank you. The -- we're going to certainly describe a   lot more at Strata later this month, particularly with respect to   pricing and how that's going to be positioned. But let me just   take a moment and talk about why we're excited about the offering   and the capabilities. As we talked about, this will be the only   -- the first and only enterprise cloud in the marketplace --   enterprise data cloud in the marketplace. We're creating   capabilities that support both hybrid and multi-cloud needs.   Well, we're going to address the multifunction analytics from the   edge to the AI. And also using our Shared Data Experience, SDX,   we're going to have a consistent security in governance, all of   that on an open source environment.",
    "So I think, in our view is it's unique. It's what our   customers are looking for and we're delivering it.",
    " Jack Andrews    --   Needham -- Analyst ",
    "Great, well, thank you for that. We'll look forward to some   more details, I guess, in a couple of weeks. Just as quick   follow-up, you talked about the internal metrics and pipeline   generation have improved markedly from 1Q, could you drill into   that a little bit more? Outside of the clarity on the technology   roadmap, is there something else that's driving that improvement?   Whether it's, you know, a different approach you've taken on the   sales front, or is it just you've got everybody -- is the merger   integration is more complete and everyone is just executing   better overall?",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Yeah, our view is that certainly in Q2 we've seen an   increasing pipeline. We believe our execution is better than it   had been coming out of the early days of the merger. And just as   important, we have clarity regarding the roadmap, we've been able   to demonstrate CDP to customers, we did that in mid-June, which   gave them more confidence as to the direction and capabilities we   were delivering. So it's -- and I would summarize it, it's around   delivery and execution is leading to better results.",
    " Jack Andrews    --   Needham -- Analyst ",
    "Great. Thanks for taking my questions.",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Thank you.",
    " Operator ",
    "And your next question comes from Chad Bennett from   Craig-Hallum.",
    " Chad Bennett    --   Craig-Hallum -- Analyst ",
    "Great. Thanks for taking my questions. So, Marty. I just want   to drill down into something you talked about in the new   licensing and pricing model that I think is pretty important,   just the whole binary functionality. And I'm not sure how many   people understand how important that is. But can you give us a   sense for just how much of the base, especially with your larger   ARR base, how important that binary functionality is? And maybe   even how important that binary functionality is broadly to the   open source community?",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Yes. So, Chad, thanks for asking the question. Because this is   an important area around licensing and I sort of give you the   context. As the two companies came together, we needed to make a   decision. And one of the decisions we made in this quarter was   that we were going to go and adopt the Red Hat model. We believe   that was industry best practice, and so we've done that. And what   happens in the binaries, is this is where the proprietary   capabilities, sort of the stickiness, the security, the   governance all comes together. And as we spend time with   customers, even in the quarter, we've had some who've said, OK,   this is important, we want that capability, we want your support,   we want your services. And so we believe that does create an   element of stickiness that was beyond what was previously   available.",
    "And in particular, it also -- it recognizes that the public   cloud providers can't just take the capability and commercialize   it in an open source world without the capabilities that we're   delivering. So we do believe this makes a difference. And we've   had customers who have been appreciative of sort of the direction   we're taking. While being open source, it yet moved beyond that   and with the binaries behind a paywall.",
    " Chad Bennett    --   Craig-Hallum -- Analyst ",
    "Right. No, that's perfect. Thank you. And then maybe one   follow-up for Jim. So, Jim, you know, it's good to see the   guidance improvement incrementally for the year. And just   thinking about the drivers of that, I mean, you mentioned you're   not really factoring in anything for CDP cloud. And then it   sounds like the churn rate really didn't improve much, at least   in this quarter. And you're expecting some improvement in the   second half, which I think you probably would expect it on the   prior guide. So I'm just wondering kind of what -- kind of was   the main or couple of main drivers of you guys upping the target   a little bit? Thank you.",
    " Jim Frankola    --   Chief Financial Officer ",
    "Yeah. Thanks, Chad. I'll echo Marty's point on execution. So   solid execution in Q2 really helped us out financially. So in Q1,   we were still operating through the fog of the merger. Many Q1   deals that were set to renew in Q1 slipped into Q2. We had   forecasted that some of that fog would continue into Q2. And   quite frankly, we're back to normal operations with respect to   new renewal cycles. So we were able to renew many of those   slipped ones -- slipped Q1 deals. Our Q2 renewal cycles were   essentially on our historical averages. We executed to our   internal plans, actually beat our internal plans on new and   expansion bookings. So across the board, we basically executed to   our objectives and that is what drove the performance in the   quarter and allowed us to raise the software numbers for the back   part of the year. And an element of that is, as Marty said, our   pipeline generation got back on track.",
    " Chad Bennett    --   Craig-Hallum -- Analyst ",
    "Great. Perfect. Thank you.",
    " Operator ",
    "And your next question comes from Dan Ives from Wedbush   Securities.",
    " Dan Ives    --   Wedbush Securities -- Analyst ",
    "Yeah. Thank you and solid quarter. Just my question is, in   regards to customers sales force, what you're seeing. Talk about   maybe some of the changes in conversation that you're having   today versus maybe even three months, four months ago. I mean,   just more clarity in terms of the product roadmap and just the   type of conversations you're having with customers?",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Dan, it's Marty. So, you know, as we talked about last quarter   and that some of the challenges coming out of the merger, we had   less visibility to our product roadmap. It was less clear where   we were going with the enterprise data cloud vision and   capabilities. So we continue to have strength with our on-premise   customers, and what I would characterize as our current   offerings. And now we're able to advance those conversations to   talk about where we are going and what will come next. And so our   ability to demonstrate it, to show what those capabilities are,   to understand what the migration path will be. And we're in that   -- those are individual conversations with individual customers   as to where do they go from their HDP or CDH capabilities   products to where does that go with CDP. And so I think that that   clarity, that availability of information is very powerful.   Because we're no longer -- they are no longer speculating,   they're no longer wondering whether our future will be as bright   as we believe it to be as they can now see it. And then in   particular, getting it out there in for demonstrations and   releasing it as promised to customers -- some customers over the   last couple of weeks, has been a very powerful reinforcement.",
    " Dan Ives    --   Wedbush Securities -- Analyst ",
    "Thanks. And the second question. What -- on a day-to-day   basis, as you've gone through pipeline and just going through the   integration process, what's maybe surprising you guys both on the   positive and negative side? You know, one of each, if I just   think that where we are today, going back to maybe the last three   months.",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Yeah, I -- surprises -- we are pleasantly surprised feeling   very good about customer adoption of our current products. As we   said our -- certainly our customers over $1 million remain very   strong, well, north of 140 customers. Our overall number of   customers we said has gone up. So that's a very positive   statement. And what I've been working to reinforce is, the   customers are extremely important. It's kind of a tourism,   obviously, without it, there's not much in the business.",
    "One of the things we did in the quarter is we put in place a   Chief Customer Officer to further emphasize the importance of   customer success and to work around the adoption from here   forward with CDP. Probably the one area that maybe has surprised   us a bit as well and I probably wouldn't say surprised, because   we saw this coming. As we continue to compete with the public   cloud providers, and on the one hand, our customers say to us   that we don't want lock in. So we appreciate where you guys are   taking us. But yet there's still some adoption that's occurring   there among large enterprises. And so, we expect that there will   be some normalization, rationalization that occurs over time as   companies go to multi-cloud, they want that capability, they want   to go hybrid, somethings will be on-prem, somethings will be   private, somethings will be public. And we like that, so maybe at   a point in time that is viewed as less positive, but we're   actually playing right into that position, that's where we're   targeting our solution.",
    " Dan Ives    --   Wedbush Securities -- Analyst ",
    "Thank you.",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Thanks, Dan.",
    " Operator ",
    "And your next question comes from the line of Mark Murphy from   JPMorgan.",
    " Matthew Coss    --   JPMorgan -- Analyst ",
    "Good afternoon. This is Matt Coss on behalf of Mark Murphy.   Jim, guidance for Q2 revenue implies a sequential decline in Q3   total revenue. And I believe annual guidance would imply a   single-digit sequential increase in Q4 total revenue. I know   we're not sort of apples-to-apples comparing last year's   seasonality, but it also sounds like you're a little bit more   bullish coming out of Q2. And I'm wondering, you know, is this   too conservative or is the level of conservatism you're baking   into your guidance is similar to the levels that you shared with   us in your guidance last quarter?",
    " Jim Frankola    --   Chief Financial Officer ",
    "Yeah, Matt. What I'll say is, our forecasts are prudent and   reflect our best view of what the world looks like. The level of   conservatism hasn't changed much in terms of   quarter-over-quarter. Our visibility to the business has   improved. As you expect, another quarter post merger, our systems   and processes are more mature and we have greater visibility.   What I'll say is, in terms of all the metrics you mentioned, ARR   is the single best metric to look at what is going on in the   business year-over-year or quarter-over-quarter. Because it   normalizes for purchase price adjustments, merger effects. One of   the dynamics that are going on is our recurring software revenue   is growing faster than the non-recurring software revenue or   professional services revenue. So you have all those dynamics in   play that, that factor into the revenue numbers that are cleansed   out of the ARR number.",
    " Matthew Coss    --   JPMorgan -- Analyst ",
    "Got it, that's helpful. Thanks, Jim. And maybe can you drill   down a little bit into what you've seen in a way of contribution   from IBM? I think this agreement might have flown under the radar   a couple months ago. But is there any comment or color you can   give us on the lead generation, maybe what IP by -- what IBM   customers are seeing in CDP versus some of your other   partners?",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Yeah, this is Marty, Matt. So as I referenced earlier, we had   a very strong quarter with IBM in Q2. It was our best quarter   ever. And at the same time, we also -- our announcement, the   significance of our announcement is the relationship has expanded   significantly. Now, all of our products, all of the Cloudera   products are available to the IBM sales force to take to market.   So that is significant and we went from a limited set of products   to all products. And as well -- as we work with IBM, we share a   sort of common bias toward large enterprise customers. I mean,   we're working together there. So we now have the benefit of more   of their feet on the street on a global basis. We also have the   ability to take their products into the market. And so we'll be   looking over time as to what's best for our customers, is it's   something that we have build, something that they traditionally   built. Now there are ways to merge or integrate them together.   But it's a very powerful relationship, and at this point, it's a   unique relationship. The other part that's very exciting to us,   as you look at IBM's strategy, particularly around the hybrid   environment, clearly there -- I'll say in my words, clearly,   their decision to move forward with Red Hat around the enterprise   cloud is very complementary to what we're building with the   Enterprise Data Cloud and thus we're very excited by that.",
    " Matthew Coss    --   JPMorgan -- Analyst ",
    "Thank you.",
    " Operator ",
    "And your next question comes from the line of Pat Walravens   from JMP Securities.",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Pat, are you on the line?",
    " Pat Walravens    --   JMP Securities -- Analyst ",
    "Sorry, sorry, I was muted. So here's a big picture question   for you. So if you look at MongoDB, they were an open source   database company, right? Three years ago, they introduced the   cloud-based product Atlas, now it's doing $150 million revenue,   it's 30% -- 37% total revenue grew 255% this quarter. So how is   your situation with the Cloudera data platform similar and how is   it different?",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Well, in terms of -- let me start with the Cloudera Data   Platform. Sort of --",
    " Pat Walravens    --   JMP Securities -- Analyst ",
    "And I hope that's fair margin, right. You've given your   background, you know that you could take a shot at it.",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Well, I'm not going to spend a lot of time. I learned a long   time ago, don't spend a lot of time talking about specific   competitors. But I will tell you sort of what we're doing and   maybe the areas where there's some differences. I think in terms   of -- hopefully, we are making it clear in terms of where we're   going with Cloudera Data Platform, in terms of the enterprise   data cloud. In terms of similarities, we think the opportunity is   big. You know, there's both -- for us, we have been in a very   strong position on-prem. As we deliver CDP and particularly the   first set of release was around the public cloud. We've now   opening up that market to us as well, so that's significant for   us.",
    "In terms of timing, maybe they're a bit ahead of where we have   been. But we believe that our ability to catch up is significant   and sort of an adoption, because of the unique capabilities we're   offering, which is beyond just the database. We have the Data   Hub, the Data Warehouse, machine learning. All of these   capabilities are part of our CDP offering. So I think the other   aspect is, we're going to be a similar experience and ease of   use, whether you're on-prem, public cloud, eventually private   cloud, so that's unique aspects. And I think just as I sit in and   thank you for suggesting my experience is relevant. But just as I   reflect on it and understanding big enterprise customers, they'd   like that flexibility, they don't want to lock in, they want the   ability to move across platforms, that's what we're focused   on.",
    " Pat Walravens    --   JMP Securities -- Analyst ",
    "All right. Thank you. And then Frankola, one for you. I mean,   just as you sort of sit back and look at all this, what part of   this story do you think is most misunderstood by investors?",
    " Jim Frankola    --   Chief Financial Officer ",
    "I think the thing that's most misunderstood is that, a lot of   folks think there is a binary outcome is that, there will either   be a winner in the cloud or on-prem. And the real answer is, it's   going to be both. There are some customers and workloads that   naturally belong in the cloud, there are some that belong on   premises, there's some that belong in private cloud. And where   our target market, the largest 2,000 enterprises in the world, we   believe, based on what we hear from them, that they will have   hybrid solutions in all places and they'll value a vendor that   brings that altogether. So I think the fact that it's -- a lot of   people think that it's binary, a win or lose versus a much more   nuance, how big is this market is the most misunderstood   thing.",
    " Pat Walravens    --   JMP Securities -- Analyst ",
    "All right. Thank you guys.",
    " Operator ",
    "And your next question comes from the line of Michael Turits   from Raymond James.",
    " Unidentified Participant ",
    "Good afternoon, this is actually Robert Magic [Phonetic] on   for Michael. You made it clear that the pipeline improved. How   much of that benefit is due to the acquisition of MapR or   alternatively, do you see an opportunity within those customers   down the line?",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "At this point, the HPEs acquisition of MapR, we view as a   positive. But it has not yet become a material impact in the   pipeline. There are select customers that we're focusing on, as   well focusing with our partners. So we're optimistic that that   will lead to improved results. Certainly, more wins for us, but   it's not something that we have modeled as material at this   time.",
    " Robert Magic    --   Raymond James -- Analyst ",
    "And then just perhaps one more from -- [Speech Overlap] That's   great. Thank you. And then just perhaps one more for me. You   touched on earlier, but can you give us some more color on some   specific initial customers feedback you've received on CDP?",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Yeah, it's -- they're accessing it, they're working with it,   they're starting to use the use cases or deploy use cases. And   it's -- the reaction is very positive. We're spending a lot of   time and energy on the experience. I think the key part is that,   the fact that they can have a common security and governance   using the S -- what we refer to as SDX is really powerful, right,   so they actually have the ability to do our capabilities, they've   historically done on-prem, now move those to the clouds,   provision clusters, much quicker, that is like, you know, really,   really cool stuff to them and they want more of it. And so   directionally, it's been very exciting. Our engineering team has   done a phenomenal job getting us to this point. Very   positive.",
    " Robert Magic    --   Raymond James -- Analyst ",
    "Thanks a lot.",
    " Operator ",
    "And your last question comes from Sanjit Singh from Morgan   Stanley.",
    " Sanjit Singh    --   Morgan Stanley -- Analyst ",
    "Thank you for taking the questions and nice to see you back to   sort of beaten [Indecipherable] territory after a couple of   quarters. I guess, I just have another similar basic question   similar to Pat's, which is, what does Cloudera want to be, in the   sense of who is going to be the target customer going forward?   And related to that, what is that, given the focus on whatever   target segment of the market you're looking at, what should we   expect in terms of profitability and cash flow? I mean, coming   out of this transition, should we expect Cloudera to be focused   on a narrow set of customers with better profitability and cash   flow that should be expected? I just try to get a sense of what   the longer term strategy here is in terms of how you want   balancing profitability and cash flow versus the opportunities   you see in front of you?",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Yeah. So let me start and then I'll have Jim add some thoughts   as well. Let me begin with -- our strategy has not changed. We so   -- even as I've moved into the post and been running the company   for a period here, we've made the same strategy. We're investing   in growth. But at the same time, as I commented in my prepared   remarks, we're also going to be more disciplined on the cost   side. So we're going to determine where is the right place to   make investments and where is the right place to be more   efficient or optimize our cost structure. We're focused on the   Global 2,000, that has been our target market. The largest global   enterprise with complex multifunction use cases. We go from the   edge to AI, we have the capabilities in between in terms of Data   Warehouse, Data Hub. So the strategy remains the same. And our   focus is on restoring the greater top line growth. At the same   time, managing our costs in a diligent fashion. And as I think   and Jim can certainly comment, hopefully you will have seen in   our Q2 results, we've done a better job of that in Q2 and   certainly improving on operating cash flow. And Jim, maybe you   can add just a little additional color.",
    " Jim Frankola    --   Chief Financial Officer ",
    "Yeah. So we believe that our target customer set, large   customers still represent a market opportunity measured in the   tens of billions of dollars. So from a market opportunity   standpoint, it's enormous. The segments that we play in are   naturally growing 15%, 20%, 25% a year, depending on which   analyst survey you look at. So with a large market rapidly   growing, which bodes well for us once we have CDP out the market.   From a financial model standpoint, be careful, it's still way   premature to start giving guidance. But the way we think about   the business model is, if our top line is growing at 15% or 20%   or even slightly more than 20%, we believe that we now have the   leverage and the scale to throw off 20% or so cash flow margins.   So once we get through the transition, once we get CDP out there   and gaining traction, we think the opportunity is to grow   substantially and throw off very healthy margins.",
    " Sanjit Singh    --   Morgan Stanley -- Analyst ",
    "And I have one follow-up, Jim, on the cloud side. So in the   scenario that CDP does get well received by market, you're   starting to see demand build over multiple quarters, what's the   implications for the model? Are you going to use CDP to grow   within your target market, call it the Global 2,000 or is that   going to be as a (inaudible) to service other parts of the   market? I guess that's part one of the question. But then, what   else are the model implications in terms of -- if the cloud CDP   becomes a larger portion of revenue, what does that do that to   the model in terms of your customer acquisition costs, your gross   margin, so that the longer term impact as we think about the   potential for CDP over time?",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Yeah. So first of all CDP encompasses several products. It   encompasses a public cloud product and encompass products that   work on premises, whether it's (inaudible) or the private cloud.   So we're focused right now on talking about the public cloud.   That is going to create new market opportunities for us. So we   think that will stimulate growth over time. And to the extent it   is -- if it impacts our model, it will be generally additive.",
    "Now, with that said, as you'd expect in a public cloud   environment, we think that form of purchase will be primarily in   some form of prepaid credits, that by definition have a contract   duration or billings duration less than a typically subscription   term. So we do expect our durations to gradually fall over time.   But we think that's going to be very gradual because our billings   duration is already roughly 13 months today. So we've moved from   a multiyear prepaid model to an annual upfront model. So we don't   think the billings model impacts would be negative, we think the   economic benefits will be positive with increased growth. And   then it's very hard to predict, but we believe that it will also   help us in terms of gross margins. Our gross margins are close to   90% today, we see this helping us take a path toward 90%. And we   think that over time it will help us with our engineering and   sales ratios as well.",
    " Sanjit Singh    --   Morgan Stanley -- Analyst ",
    "Thanks for taking my question. Appreciate it.",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    "Thank you. Well, I think that concludes our call today. I want   to thank you all for joining us. Appreciate your questions. And   we're on to Q3. See you all on our next call. Thank you.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 53 minutes ",
    " Kevin Cook    --   Vice President, Corporate Development and Investor   Relations. ",
    " Martin Cole    --   Chairman and Interim Chief Executive Officer ",
    " Jim Frankola    --   Chief Financial Officer ",
    " Jack Andrews    --   Needham -- Analyst ",
    " Chad Bennett    --   Craig-Hallum -- Analyst ",
    " Dan Ives    --   Wedbush Securities -- Analyst ",
    " Matthew Coss    --   JPMorgan -- Analyst ",
    " Pat Walravens    --   JMP Securities -- Analyst ",
    " Unidentified Participant ",
    " Robert Magic    --   Raymond James -- Analyst ",
    " Sanjit Singh    --   Morgan Stanley -- Analyst ",
    " More CLDR analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than Cloudera,   Inc.     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Cloudera,   Inc. wasn't one of them! That's right -- they think   these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:23:27"
}