{
  "url": "https://www.nasdaq.com/article/amazon-introduces-new-fire-tv-cube-partners-with-anker-on-fire-tv-powered-soundbar-cm1207488",
  "title": "Amazon Introduces New Fire TV Cube, Partners With Anker on Fire TV-Powered Soundbar - Nasdaq.com",
  "text": [
    "   Amazon    is revamping its   Fire   TV    Cube streaming device, and has partnered with a number of   consumer electronics companies for   Fire TV    -powered devices. In addition to smart TVs, this also for the   first time includes a smart soundbar that doubles as a Fire TV   streamer. The new Fire TV Cube   looks pretty much like its predecessor    , and offers the same kind of features: It's capable of bringing   video from apps like Netflix, YouTube and   Amazon    's own Prime TV service to your TV, and comes with integrated   far-field microphones for voice control. There's even a small speaker built into the device itself to   help Alexa answer queries when the TV is off. And if effectively   combining an Amazon Echo with a TV streaming device wasn't   enough, Amazon also crammed an IR blaster and a bunch of other   types of device control into the Cube, allowing consumers to tune   their TV, turn on accessories and more with voice commands.makeArticleAd(); The 2019 version of the Fire TV Cube does come with a faster   processor, and Amazon also added something the company likes to   call local voice control. Essentially, simple commands for   on-screen navigation and similar features are being recognized on   the device itself, without the need to send the audio to Amazon's   servers, which should vastly improve the response time. The new Fire TV Cube became available for preorder in the   United States, Canada, the U.K. and Germany Wednesday, and is   coming to Japan in November. In the U.S., the device costs   $119.99, the same as last year's model. Amazon also used a press event at IFA in Berlin Wednesday to   announce a number of new partnerships with consumer electronics   companies for Fire TV-powered devices. Perhaps the most notable   team-up is a new smart soundbar made by Anker that doubles as a   Fire TV streaming device.    Officially called the Nebula Soundbar - Fire TV Edition, the   device can be used to stream video, and listen to music,   including when paired with other compatible Echo speakers for   multi-room audio. The soundbar doesn't come with far-field voice   contol, but the included remote control does have a mic button.   The Nebula soundbar became available for pre-order in the States,   Canada, the U.K and Germany Wednesday, and is supposed to start   shipping on November 21. Stateside, it costs $229.99. The Nebula is Amazon's first foray into smart soundbars, but   it's not the first product of its kind. Earlier today,   Roku announced its very own smart soundbar,    and JBL   began shipping a long-ago announced Android TV   soundbar    in July. And if Amazon's press release is any indication, we'll   likely see more Fire TV-powered soundbars in the future as   well. Amazon also announced a number of TV partnerships Wednesday,   with a primary focus on the European market. The company will   begin selling Grundig-made TVs with built-in Fire TV software in   Austria and Germany in November, and is bringing a JVC-made TV   with Fire TV software to Currys in the U.K. MediaMarkt and   Saturn, two big electronics retailers in Germany, will begin   selling house-brand Fire TV sets next year. And just for good   measure, Amazon also announced a new 65-inch Toshiba Fire TV set   for the U.S. market as well. Among all those TVs, one stands out for a new feature: Grundig   will be making the first TV set with far-field voice control.   Officially named Grundig OLED - Fire TV Edition Hands-Free with   Alexa, that product may be a mouthful, but it won't require a   remote for voice control.   More from Variety    'Homecoming' Season 2 Casts Chris         Cooper   'Lord of The Rings' Series at Amazon Casts         Will Poulter (EXCLUSIVE)   'Wheel of Time' Amazon Series Casts Daniel         Henney     ",
    " Amazon    is revamping its   Fire   TV    Cube streaming device, and has partnered with a number of   consumer electronics companies for   Fire TV    -powered devices. In addition to smart TVs, this also for the   first time includes a smart soundbar that doubles as a Fire TV   streamer.",
    "The new Fire TV Cube   looks pretty much like its predecessor    , and offers the same kind of features: It's capable of bringing   video from apps like Netflix, YouTube and   Amazon    's own Prime TV service to your TV, and comes with integrated   far-field microphones for voice control.",
    "There's even a small speaker built into the device itself to   help Alexa answer queries when the TV is off. And if effectively   combining an Amazon Echo with a TV streaming device wasn't   enough, Amazon also crammed an IR blaster and a bunch of other   types of device control into the Cube, allowing consumers to tune   their TV, turn on accessories and more with voice commands.",
    "The 2019 version of the Fire TV Cube does come with a faster   processor, and Amazon also added something the company likes to   call local voice control. Essentially, simple commands for   on-screen navigation and similar features are being recognized on   the device itself, without the need to send the audio to Amazon's   servers, which should vastly improve the response time.",
    "The new Fire TV Cube became available for preorder in the   United States, Canada, the U.K. and Germany Wednesday, and is   coming to Japan in November. In the U.S., the device costs   $119.99, the same as last year's model.",
    "Amazon also used a press event at IFA in Berlin Wednesday to   announce a number of new partnerships with consumer electronics   companies for Fire TV-powered devices. Perhaps the most notable   team-up is a new smart soundbar made by Anker that doubles as a   Fire TV streaming device.",
    "Officially called the Nebula Soundbar - Fire TV Edition, the   device can be used to stream video, and listen to music,   including when paired with other compatible Echo speakers for   multi-room audio. The soundbar doesn't come with far-field voice   contol, but the included remote control does have a mic button.   The Nebula soundbar became available for pre-order in the States,   Canada, the U.K and Germany Wednesday, and is supposed to start   shipping on November 21. Stateside, it costs $229.99.",
    "The Nebula is Amazon's first foray into smart soundbars, but   it's not the first product of its kind. Earlier today,   Roku announced its very own smart soundbar,    and JBL   began shipping a long-ago announced Android TV   soundbar    in July. And if Amazon's press release is any indication, we'll   likely see more Fire TV-powered soundbars in the future as   well.",
    "Amazon also announced a number of TV partnerships Wednesday,   with a primary focus on the European market. The company will   begin selling Grundig-made TVs with built-in Fire TV software in   Austria and Germany in November, and is bringing a JVC-made TV   with Fire TV software to Currys in the U.K. MediaMarkt and   Saturn, two big electronics retailers in Germany, will begin   selling house-brand Fire TV sets next year. And just for good   measure, Amazon also announced a new 65-inch Toshiba Fire TV set   for the U.S. market as well.",
    "Among all those TVs, one stands out for a new feature: Grundig   will be making the first TV set with far-field voice control.   Officially named Grundig OLED - Fire TV Edition Hands-Free with   Alexa, that product may be a mouthful, but it won't require a   remote for voice control.",
    "  More from Variety    'Homecoming' Season 2 Casts Chris         Cooper   'Lord of The Rings' Series at Amazon Casts         Will Poulter (EXCLUSIVE)   'Wheel of Time' Amazon Series Casts Daniel         Henney   ",
    " More from Variety ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:40:31"
}