{
  "url": "https://www.nasdaq.com/article/canada-appoints-former-mckinsey-consultant-as-new-envoy-to-china-20190904-00944",
  "title": "Canada appoints former McKinsey consultant as new envoy to China - Nasdaq.com",
  "text": [
    "By David Ljunggren",
    "OTTAWA, Sept 4 (Reuters) - Canada has appointed veteran business consultant Dominic Barton as ambassador to China, Prime Minister Justin Trudeau said on Wednesday, as the government grapples with a major diplomatic and trade dispute between the nations.",
    "Barton, 56, a Ugandan-born Canadian who stepped down as global managing partner of consulting firm McKinsey & Co last year, has extensive experience in China and is close to Trudeau's Liberal government.",
    "Barton replaces John McCallum, who Trudeau fired in January for commenting on the case of a Huawei Technologies Co  executive who was arrested in Canada and is fighting extradition to the United States. ",
    "Beijing, which has demanded Canada return Huawei Chief Financial Officer Meng Wanzhou, has blocked imports of Canadian canola seed and pork and beef products. It has also charged two Canadian men with spying.",
    "Canada's Foreign Minister Chrystia Freeland, noting \"some significant challenges in the relationship,\" said it was vital to choose an envoy who Beijing knew would have direct access to Trudeau.",
    "She also told reporters in Toronto that Barton would be expected to stress the importance of human rights, a highly sensitive topic for the Chinese government.",
    "Business and agricultural groups welcomed the announcement. In 2016, the Canadian government appointed Barton as head of an advisory council on economic growth.",
    "\"We are pleased with the appointment and the signal that both sides see the importance of returning to normal bilateral relations,\" said Goldy Hyder, President and chief executive officer of the Business Council of Canada.",
    "The news indicates the two governments are still talking despite months of fraught ties. The Chinese embassy in Ottawa had no immediate comment.",
    "\"This is the outcome of a months-long diplomatic process,\"  a Canadian government official said earlier on Wednesday.",
    "Gary Stordy, director of government and corporate affairs at the Canadian Pork Council, said the appointment was \"the next step to normalizing relations between the two countries.\"",
    "\"We're looking to regain market access into China,\" he added.",
    "The dispute could become an issue in a federal election set for Oct 21. The Liberals face a tough fight against the Conservatives of Andrew Scheer, who complain Trudeau has not been tough enough on Beijing.",
    "Conservative foreign policy spokesman Erin O'Toole accused Trudeau of \"replacing one Liberal insider with another Liberal insider at a time that we should have a professional diplomat ... to secure the swift release of Canadian citizens and stabilization of export trade.\""
  ],
  "published_datetime": "2019-09-04 02:42:00"
}