{
  "url": "https://www.nasdaq.com/article/as-hurricanes-bear-down-lock-down-your-financial-emergency-kit-cm1206892",
  "title": "As Hurricanes Bear Down, Lock Down Your Financial Emergency Kit - Nasdaq.com",
  "text": [
    "A major hurricane is bearing down on the East Coast, and others likely will follow. As millions scramble to prepare for this latest natural disaster, it pays to assemble a financial emergency kit now.",
    "Before we go into the contents of a financial emergency kit, here are a few pointers on disaster planning.",
    "First, make your financial kit part of an overall disaster plan. You can get started on the planning process by going to the Department of Homeland Security's Ready.gov  website.",
    "Image Source: FINRA",
    "Second, while you can't guarantee that your kit will survive a disaster, you should keep it in an easily accessible-and easy to remember-location so you can access it quickly during an emergency. If you deplete items from your kit, replace them as soon as possible.",
    "Finally, discuss with your family what you will do if you are separated, such as an agreed upon place to meet and how you will communicate with each other (phone, a shared voice mail or email box, social media, some other means).",
    "You can decide how much you want to store in your financial emergency kit-and whether you want to make duplicates of contents and keep them in additional locations-but your kit should include these five items:",
    "Your kit should contain enough ready money to facilitate daily life for a few days. How much is up to you, but think about what you would need to pay for food, lodging and other necessities. Cash is king in most emergencies since you may not be able to access ATMs or other electronic forms of payment. Also pack a set of essential keys (including a spare to a safe deposit box, if you have one).",
    "Tip:  You can put a credit card in your kit for good measure, but don't depend on it.",
    "Create a list with telephone numbers, emails or other contact information that includes family members, as well as key medical, financial and business contacts. All of this information can be stored electronically, too (with proper security precautions ), but keep a paper copy in your emergency kit as well.",
    "Tip:  Now's the time to check with your bank or credit union to see if they offer disaster assistance, which may include flexible loan payment options, forgiveness of late charges and other services.",
    "After a disaster strikes, you may have to confirm your identity to obtain disaster relief services, file insurance claims, or get access to your property and financial assets. Keep essential documents that help establish who you and your family are. These include extra originals or copies of passports, driver's licenses, birth and marriage certificates, adoption decrees, Social Security cards and military records.",
    "Tip:  Check your financial account information periodically to ensure that your financial professional will be able to contact you in case of a disaster. If you have notified your broker or advisor of any changes to your name or address, confirm that the correct change has been made to your account by examining the notification your broker will send you within 30 days of the change. Also, some firms may ask whether you would like to designate a secondary or emergency contact for the account whom the firm could contact if it cannot get in touch with you, or has concerns about the your whereabouts or health.",
    "A short list of financial documents to put in your kit includes mortgages, property deeds, legal documents such as a Power of Attorney and insurance policies. Also include recent financial statements for bank accounts, credit cards, brokerage accounts and statements related to investments that might be held outside a brokerage firm (such mutual funds or 529 college savings). If you access accounts or documents online, include a list of password hints. Also pack recent retirement account statements and your most recent tax return. A password-protected flash drive or file might be safer (and lighter) than hard copies-as long as you have a way to access the files.",
    "Tip:  Get information about how to keep your tax records safe from the IRS's helpful resource Prepare for Hurricanes, Natural Disasters by Safeguarding Tax Records .",
    "This will help you maximize the benefit from your insurance policies and will expedite the claims process. Assemble a paper, photo or video inventory, or a combination of these, and put it into your emergency kit. Save purchase receipts for major items or appraisals for valuable belongings. For your household items, walk through your house and write down what's in every room. For major items, record make and serial numbers. While you're at it, record the cost. Take close-up pictures of valuables, including details such as serial number tags. You can also videotape your belongings with a narrative description of the relevant information.",
    "Tip:  Understand what your insurance covers and what will be required to make a claim in the event disaster strikes. Your policy may treat disasters differently (for example, flood damage may be handled differently than fire or hurricane damage). Do you have the right kind of insurance to cover what you own? Do you have enough coverage? And if you have completed major modifications to your house or other real estate property, does your present policy cover them?",
    "Subscribe to FINRA's The Alert Investor newsletter  for more information about saving and investing.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:36:53"
}