{
  "url": "https://www.nasdaq.com/article/why-grupo-financiero-galicia-stock-dropped-10-this-morning-cm1206944",
  "title": "Why Grupo Financiero Galicia Stock Dropped 10% This Morning - Nasdaq.com",
  "text": [
    "  What happened  Shares of   Grupo Financiero Galicia    (NASDAQ: GGAL) , by some measures the   largest financial institution    in Argentina, got a bit   smaller    today -- and investors probably have that country's president to   thank for it. Grupo Financiero Galicia stock dropped 10.1% in early trading   Tuesday and remain down 9.6% as of 3:33 p.m. EDT after Argentine   President Mauricio Macri's administration shocked stock markets   with an announcement of \"a series of extraordinary measures to   ensure the normal functioning of the economy, to sustain the   level of activity and employment and protect the consumers.\"   Image source: Getty Images.makeArticleAd();   So what  So what is Argentina up to   this week    ? According to the announcement, through the end of this year,   the government will be requiring that individuals desiring to   make foreign currency purchases obtain permission from the   central bank in order to buy more than $10,000 worth in a month.   Corporations will similarly need to seek government permission to   sell pesos in order to make foreign currency purchases and also   to transfer foreign currency abroad. These measures are intended to make it harder to bet against   the Argentine peso, stem the outflow of foreign currency, husband   the central bank's own foreign currency reserves, and thus shore   up the local currency's strength.  Now what  They're also, in all likelihood, intended to help improve   President Mauricio Macri's chances of winning reelection in   October. But as the economy deteriorates and the president shows   signs of panic by reversing policies he was elected to implement   four years ago, these measures increasingly resemble grasping at   straws. Worse, the relatively high threshold on the new currency   controls -- $10,000 is more than the average Argentine earns in a   year    -- could perversely encourage   more    buying of foreign currency and more selling of the peso and thus   weaken the local currency these measures were implemented to   support. That's bad news for banks like Grupo Financiero Galicia and   bad news for Argentina in general.   10 stocks we like better than Grupo Financiero     Galicia       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Grupo Financiero Galicia     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Rich Smith      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   Grupo Financiero Galicia    (NASDAQ: GGAL) , by some measures the   largest financial institution    in Argentina, got a bit   smaller    today -- and investors probably have that country's president to   thank for it.",
    "Grupo Financiero Galicia stock dropped 10.1% in early trading   Tuesday and remain down 9.6% as of 3:33 p.m. EDT after Argentine   President Mauricio Macri's administration shocked stock markets   with an announcement of \"a series of extraordinary measures to   ensure the normal functioning of the economy, to sustain the   level of activity and employment and protect the consumers.\"",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "So what is Argentina up to   this week    ? According to the announcement, through the end of this year,   the government will be requiring that individuals desiring to   make foreign currency purchases obtain permission from the   central bank in order to buy more than $10,000 worth in a month.   Corporations will similarly need to seek government permission to   sell pesos in order to make foreign currency purchases and also   to transfer foreign currency abroad.",
    "These measures are intended to make it harder to bet against   the Argentine peso, stem the outflow of foreign currency, husband   the central bank's own foreign currency reserves, and thus shore   up the local currency's strength.",
    "They're also, in all likelihood, intended to help improve   President Mauricio Macri's chances of winning reelection in   October. But as the economy deteriorates and the president shows   signs of panic by reversing policies he was elected to implement   four years ago, these measures increasingly resemble grasping at   straws.",
    "Worse, the relatively high threshold on the new currency   controls -- $10,000 is more than the average Argentine earns in a   year    -- could perversely encourage   more    buying of foreign currency and more selling of the peso and thus   weaken the local currency these measures were implemented to   support.",
    "That's bad news for banks like Grupo Financiero Galicia and   bad news for Argentina in general.",
    "  10 stocks we like better than Grupo Financiero     Galicia       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Grupo Financiero Galicia     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Grupo Financiero     Galicia       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Grupo Financiero Galicia     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Rich Smith      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:01:00"
}