{
  "url": "https://www.nasdaq.com/article/heres-why-therapeuticsmd-jumped-34-in-august-cm1207256",
  "title": "Here's Why TherapeuticsMD Jumped 34% in August - Nasdaq.com",
  "text": [
    " What happened Shares of   TherapeuticsMD    (NASDAQ: TXMD) jumped 34% in August, according to data provided   by      S&P Global Market Intelligence    , after the drugmaker reported   solid second-quarter earnings    and increased its guidance for the year. So what Part of the August jump had to do with the   disappointing    first quarter that TherapeuticsMD posted. Shares were priced for   more of the same. Instead, sales of Imvexxy, the company's estradiol inserts for   menopause-related dyspareunia, bounced back, with prescriptions   up 41% quarter over quarter. More importantly, July was even   stronger with about 45,500 prescriptions dispensed and paid for   by patients, compared to approximately 106,000 prescriptions in   all of the second quarter.makeArticleAd(); The launch of Bijuva, the company's estradiol and progesterone   capsules, is off to a decent start, with approximately 8,900   prescriptions during its first partial quarter on the market.   Image source: Getty Images.  Now what With momentum behind it, management increased 2019 revenue   guidance and now expects to bring in $29.45 million to $34.20   million, up from the previous guidance range of $27.10 million to   $33.10 million. The increase is nice, but keep in mind   TherapeuticsMD's revenue is still pretty small compared to other   biotechs that investors can choose    . The key to TherapeuticsMD hitting its numbers -- or even   exceeding them -- is for the company to continue signing up   additional insurers and Medicare Part D payers to cover Imvexxy   and Bijuva. For example,   United Healthcare    signed up to cover Bijuva starting in August, and management   thinks it'll get additional payers to cover Imvexxy in the third   and fourth quarters. Looking further ahead, investors should watch Annovera, a   contraception product, that's due to launch in the first quarter   of 2020.   10 stocks we like better than TherapeuticsMD       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and TherapeuticsMD wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Brian Orelli      has no position in any of the stocks mentioned. The Motley Fool     recommends UnitedHealth Group. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   TherapeuticsMD    (NASDAQ: TXMD) jumped 34% in August, according to data provided   by      S&P Global Market Intelligence    , after the drugmaker reported   solid second-quarter earnings    and increased its guidance for the year.",
    "Part of the August jump had to do with the   disappointing    first quarter that TherapeuticsMD posted. Shares were priced for   more of the same.",
    "Instead, sales of Imvexxy, the company's estradiol inserts for   menopause-related dyspareunia, bounced back, with prescriptions   up 41% quarter over quarter. More importantly, July was even   stronger with about 45,500 prescriptions dispensed and paid for   by patients, compared to approximately 106,000 prescriptions in   all of the second quarter.",
    "The launch of Bijuva, the company's estradiol and progesterone   capsules, is off to a decent start, with approximately 8,900   prescriptions during its first partial quarter on the market.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "With momentum behind it, management increased 2019 revenue   guidance and now expects to bring in $29.45 million to $34.20   million, up from the previous guidance range of $27.10 million to   $33.10 million. The increase is nice, but keep in mind   TherapeuticsMD's revenue is still pretty small compared to other   biotechs that investors can choose    .",
    "The key to TherapeuticsMD hitting its numbers -- or even   exceeding them -- is for the company to continue signing up   additional insurers and Medicare Part D payers to cover Imvexxy   and Bijuva. For example,   United Healthcare    signed up to cover Bijuva starting in August, and management   thinks it'll get additional payers to cover Imvexxy in the third   and fourth quarters.",
    "Looking further ahead, investors should watch Annovera, a   contraception product, that's due to launch in the first quarter   of 2020.",
    "  10 stocks we like better than TherapeuticsMD       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and TherapeuticsMD wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than TherapeuticsMD       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and TherapeuticsMD wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Brian Orelli      has no position in any of the stocks mentioned. The Motley Fool     recommends UnitedHealth Group. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:05:00"
}