{
  "url": "https://www.nasdaq.com/article/heres-why-you-should-hold-on-to-thermo-fisher-tmo-for-now-cm1206528",
  "title": "Here's Why You Should Hold on to Thermo Fisher (TMO) for Now - Nasdaq.com",
  "text": [
    "  Thermo Fisher Scientific Inc. TMO  has been gaining investors' confidence on consistently positive results. Over the past year, the company's shares have outperformed its industry  . The stock has gained 28.3% compared with 13.7% growth of the industry. Also, the company has outperformed the S&P 500's 15.3% rise during this period.  makeArticleAd();  The renowned medical and laboratory equipment provider has a market cap of $110.56 billion. The company's five-year projected growth rate looks impressive at 12.5%. It is expected to scale new highs in the near term. The company has average positive earnings surprise of 2.1% for the trailing four quarters.    With solid prospects, the Zacks Rank #3 (Hold) company is worth the wait for now.   What Makes the Stock an Attractive Pick?   Product Launches:  The company has been progressing well in terms of new-generation product development. Within mass spectrometry, it introduced new instruments, workflows and software, highlighted by two new-generation Orbitrap systems - the Exploris 480 and Eclipse Tribrid. Also, a new workflow (HR Multi-Attribute Method) has been introduced to make progress in biotherapeutics.        In genetic analysis, Thermo Fisher recently launched the Applied Biosystems QuantStudio 6 and 7 Pro Real-Time PCR systems to automate qPCR workflows. The company is also in the process of expanding its bioproduction capabilities to meet customer demand for biologics.   Acquisitions and Partnerships to Add Value:  We are looking forward to Thermo Fisher's recently-formed alliance with GlaxoSmithKline in the second quarter, where Thermo Fisher stated that it will acquire a site in Cork, Ireland, from GlaxoSmithKline. This will add to the existing capacities of Thermo Fisher's Active Pharmaceutical Ingredients (\"API\") network.    This apart, the Brammer Bio deal also seems to work in the company's favor as this will likely expand opportunities in gene therapy and set a revised standard for viral vector manufacturing.   Strong End-Market Growth:  Thermo Fisher is experiencing strong growth in the pharma and biotech sector. Although in the last-reported quarter, growth in industrial and applied segments was in low single-digits, the company performed well due to strong demand for its chemical analysis, chromatography and mass spectrometry products. It also maintained its growth momentum in clinical diagnostics and immunodiagnostic businesses, and also witnessed strong demand in its health care market channel.   Raised Guidance Buoys Optimism    Thermo Fisher recently raised its 2019 adjusted earnings per share guidance to $12.16-$12.26 from $12.08-$12.22 mentioned earlier. The Zacks Consensus Estimate for earnings of $12.24 remains within the company's projected range. This indicates that it will likely be able to maintain its ongoing bullish momentum for the rest of the year.   Downsides   Bottom Line Pressure on Business Divestment:  Thermo Fisher completed the divestiture of the Anatomical Pathology business to PHC Holdings Corporation for $1.14 billion in cash in the second quarter. This sector was one of the major contributors to the company's revenues. The subsequent closure of this sector is expected to put pressure on Thermo Fisher's financials.   Competitive Landscape:    On account of its diversified portfolio, Thermo Fisher faces competition from different types of companies - including a broad range of manufacturers and third-party distributors. The competitive landscape is quite tough with changing technology and customer demand, which require continuous research and development.   Which Way Are Estimates Heading?    The estimate revision trend for the current year is impressive. Over the past 60 days, the Zacks Consensus Estimate for the company's earnings has inched up 0.33% to $12.24.    The Zacks Consensus Estimate for 2019 revenues is pegged at $25.42 billion, suggesting a 4.4% increase from the year-ago reported number.  Stocks to Consider  Some better-ranked stocks in the broader medical space are Baxter International Inc. BAX  , Medtronic PLC MDT  and Abbott Laboratories ABT  . Baxter's long-term earnings growth rate is estimated at 12.8%. The stock carries a Zacks Rank #2 (Buy) at present. You can see  the complete list of today's Zacks #1 (Strong Buy) Rank   stocks here  .  Medtronic, with a Zacks Rank #2, has a long-term estimated earnings growth rate of 7.3%. Abbott's long-term earnings growth rate is projected at 11%. The stock currently carries a Zacks Rank of 2.  Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Abbott Laboratories (ABT): Free Stock Analysis Report   Thermo Fisher Scientific Inc. (TMO): Free Stock Analysis Report   Medtronic PLC (MDT): Free Stock Analysis Report   Baxter International Inc. (BAX): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Thermo Fisher Scientific Inc. TMO  has been gaining investors' confidence on consistently positive results. Over the past year, the company's shares have outperformed its industry  . The stock has gained 28.3% compared with 13.7% growth of the industry. Also, the company has outperformed the S&P 500's 15.3% rise during this period.  makeArticleAd();  The renowned medical and laboratory equipment provider has a market cap of $110.56 billion. The company's five-year projected growth rate looks impressive at 12.5%. It is expected to scale new highs in the near term. The company has average positive earnings surprise of 2.1% for the trailing four quarters.    With solid prospects, the Zacks Rank #3 (Hold) company is worth the wait for now.   What Makes the Stock an Attractive Pick?   Product Launches:  The company has been progressing well in terms of new-generation product development. Within mass spectrometry, it introduced new instruments, workflows and software, highlighted by two new-generation Orbitrap systems - the Exploris 480 and Eclipse Tribrid. Also, a new workflow (HR Multi-Attribute Method) has been introduced to make progress in biotherapeutics.",
    "In genetic analysis, Thermo Fisher recently launched the Applied Biosystems QuantStudio 6 and 7 Pro Real-Time PCR systems to automate qPCR workflows. The company is also in the process of expanding its bioproduction capabilities to meet customer demand for biologics.   Acquisitions and Partnerships to Add Value:  We are looking forward to Thermo Fisher's recently-formed alliance with GlaxoSmithKline in the second quarter, where Thermo Fisher stated that it will acquire a site in Cork, Ireland, from GlaxoSmithKline. This will add to the existing capacities of Thermo Fisher's Active Pharmaceutical Ingredients (\"API\") network.    This apart, the Brammer Bio deal also seems to work in the company's favor as this will likely expand opportunities in gene therapy and set a revised standard for viral vector manufacturing.   Strong End-Market Growth:  Thermo Fisher is experiencing strong growth in the pharma and biotech sector. Although in the last-reported quarter, growth in industrial and applied segments was in low single-digits, the company performed well due to strong demand for its chemical analysis, chromatography and mass spectrometry products. It also maintained its growth momentum in clinical diagnostics and immunodiagnostic businesses, and also witnessed strong demand in its health care market channel.   Raised Guidance Buoys Optimism    Thermo Fisher recently raised its 2019 adjusted earnings per share guidance to $12.16-$12.26 from $12.08-$12.22 mentioned earlier. The Zacks Consensus Estimate for earnings of $12.24 remains within the company's projected range. This indicates that it will likely be able to maintain its ongoing bullish momentum for the rest of the year.   Downsides   Bottom Line Pressure on Business Divestment:  Thermo Fisher completed the divestiture of the Anatomical Pathology business to PHC Holdings Corporation for $1.14 billion in cash in the second quarter. This sector was one of the major contributors to the company's revenues. The subsequent closure of this sector is expected to put pressure on Thermo Fisher's financials.   Competitive Landscape:    On account of its diversified portfolio, Thermo Fisher faces competition from different types of companies - including a broad range of manufacturers and third-party distributors. The competitive landscape is quite tough with changing technology and customer demand, which require continuous research and development.   Which Way Are Estimates Heading?    The estimate revision trend for the current year is impressive. Over the past 60 days, the Zacks Consensus Estimate for the company's earnings has inched up 0.33% to $12.24.    The Zacks Consensus Estimate for 2019 revenues is pegged at $25.42 billion, suggesting a 4.4% increase from the year-ago reported number.",
    " Stocks to Consider ",
    "Some better-ranked stocks in the broader medical space are Baxter International Inc. BAX  , Medtronic PLC MDT  and Abbott Laboratories ABT  .",
    "Baxter's long-term earnings growth rate is estimated at 12.8%. The stock carries a Zacks Rank #2 (Buy) at present. You can see  the complete list of today's Zacks #1 (Strong Buy) Rank   stocks here  . ",
    "Medtronic, with a Zacks Rank #2, has a long-term estimated earnings growth rate of 7.3%.",
    "Abbott's long-term earnings growth rate is projected at 11%. The stock currently carries a Zacks Rank of 2.",
    " Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:11:00"
}