{
  "url": "https://www.nasdaq.com/article/bear-of-the-day-autodesk-adsk-cm1210341",
  "title": "Bear of the Day: Autodesk (ADSK) - Nasdaq.com",
  "text": [
    "   Sometimes, stocks get beat down for no reason at all. It can be very confusing and frustrating for investors when their favorite stock is going down for seemingly no reason. If you pay close attention to earnings estimates from analysts, often times, you can get a warning ahead of impending doom. I don't want to sound like the harbinger of bad news here, I'm just setting up the reasoning for today's Bear of the Day. It's Zacks Rank #5 (Strong Sell) Autodesk (ADSK).  Autodesk, Inc. operates as a design software and services company worldwide. The company offers AutoCAD, a professional design, drafting, detailing, and visualization software; AutoCAD Civil 3D, a surveying, design, analysis, and documentation solution for civil engineering, including land development, transportation, and environmental projects; AutoCAD LT, a professional drafting and detailing software; BIM 360, a construction management cloud-based software; computer-aided manufacturing (CAM) software for computer numeric control machining, inspection, and modelling for manufacturing; Fusion 360, a 3D CAD, CAM, and computer-aided engineering tool; and Industry Collections software products for professionals in architecture, engineering and construction, product design and manufacturing, and media and entertainment industries. The reason for the unfavorable Zacks Rank is the series o f earnings  estimate revisions coming in to the downside recently. Over the last thirty days, eight analysts have cut their earnings estimates for the next quarter and next year. The bearish sentiment has dropped our Zacks Consensus Estimate from 99 cents to 94 cents for next quarter, while next year's number has come down from $4.78 to $4.53. I don't want to lead on as if Autodesk is tumbling down to zero. In fact, even with these negative estimates, next quarter's EPS growth is slated to come in at 104%, while next year's growth number is set to hit 63.7%. Revenue is still set to grow at 21.89% next quarter and 21.7% next year. Growth has slowed some, which has caused Autodesk's earnings multiple to shrink a bit. The stock is trading at a PE of 54.5x earnings, above the industry average of 41.7x and well above the broad market average of 17.8x.  Autodesk, Inc. Price and Consensus     Autodesk, Inc. price-consensus-chart    |   Autodesk, Inc. Quote   Investors looking for other stocks in the Computer Software industry, which ranks in the Top 21% of our Zacks Industry Rank, should check out Zacks Rank #1 (Strong Buy) Simulations Plus (SLP)  and Smith Micro Software (SMSI).   More Stock News: This Is Bigger than the iPhone!  makeArticleAd();  It could become the mother of all technological revolutions. Apple sold a mere 1 billion iPhones in 10 years but a new breakthrough is expected to generate more than 27 billion devices in just 3 years, creating a $1.7 trillion market.    Zacks has just released a Special Report that spotlights this fast-emerging phenomenon and 6 tickers for taking advantage of it. If you don't buy now, you may kick yourself in 2020.    Click here for the 6 trades >>      Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Smith Micro Software, Inc. (SMSI): Free Stock Analysis Report   Simulations Plus, Inc. (SLP): Free Stock Analysis Report   Autodesk, Inc. (ADSK): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Sometimes, stocks get beat down for no reason at all. It can be very confusing and frustrating for investors when their favorite stock is going down for seemingly no reason. If you pay close attention to earnings estimates from analysts, often times, you can get a warning ahead of impending doom. I don't want to sound like the harbinger of bad news here, I'm just setting up the reasoning for today's Bear of the Day.",
    "It's Zacks Rank #5 (Strong Sell) Autodesk (ADSK).  Autodesk, Inc. operates as a design software and services company worldwide. The company offers AutoCAD, a professional design, drafting, detailing, and visualization software; AutoCAD Civil 3D, a surveying, design, analysis, and documentation solution for civil engineering, including land development, transportation, and environmental projects; AutoCAD LT, a professional drafting and detailing software; BIM 360, a construction management cloud-based software; computer-aided manufacturing (CAM) software for computer numeric control machining, inspection, and modelling for manufacturing; Fusion 360, a 3D CAD, CAM, and computer-aided engineering tool; and Industry Collections software products for professionals in architecture, engineering and construction, product design and manufacturing, and media and entertainment industries.",
    "The reason for the unfavorable Zacks Rank is the series o f earnings  estimate revisions coming in to the downside recently. Over the last thirty days, eight analysts have cut their earnings estimates for the next quarter and next year. The bearish sentiment has dropped our Zacks Consensus Estimate from 99 cents to 94 cents for next quarter, while next year's number has come down from $4.78 to $4.53.",
    "I don't want to lead on as if Autodesk is tumbling down to zero. In fact, even with these negative estimates, next quarter's EPS growth is slated to come in at 104%, while next year's growth number is set to hit 63.7%. Revenue is still set to grow at 21.89% next quarter and 21.7% next year. Growth has slowed some, which has caused Autodesk's earnings multiple to shrink a bit. The stock is trading at a PE of 54.5x earnings, above the industry average of 41.7x and well above the broad market average of 17.8x.",
    " Autodesk, Inc. Price and Consensus     Autodesk, Inc. price-consensus-chart    |   Autodesk, Inc. Quote  ",
    " Autodesk, Inc. price-consensus-chart    |   Autodesk, Inc. Quote ",
    "Investors looking for other stocks in the Computer Software industry, which ranks in the Top 21% of our Zacks Industry Rank, should check out Zacks Rank #1 (Strong Buy) Simulations Plus (SLP)  and Smith Micro Software (SMSI). ",
    " More Stock News: This Is Bigger than the iPhone!  makeArticleAd();  It could become the mother of all technological revolutions. Apple sold a mere 1 billion iPhones in 10 years but a new breakthrough is expected to generate more than 27 billion devices in just 3 years, creating a $1.7 trillion market.    Zacks has just released a Special Report that spotlights this fast-emerging phenomenon and 6 tickers for taking advantage of it. If you don't buy now, you may kick yourself in 2020.    Click here for the 6 trades >>   ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:00:00"
}