{
  "url": "https://www.nasdaq.com/article/is-hasbro-has-outperforming-other-consumer-discretionary-stocks-this-year-cm1210452",
  "title": "Is Hasbro (HAS) Outperforming Other Consumer Discretionary Stocks This Year? - Nasdaq.com",
  "text": [
    " Investors focused on the Consumer Discretionary space have likely heard of Hasbro (HAS), but is the stock performing well in comparison to the rest of its sector peers? Let's take a closer look at the stock's year-to-date performance to find out. Hasbro is a member of our Consumer Discretionary group, which includes 248 different companies and currently sits at #12 in the Zacks Sector Rank. The Zacks Sector Rank considers 16 different sector groups. The average Zacks Rank of the individual stocks within the groups is measured, and the sectors are listed from best to worst. The Zacks Rank is a proven system that emphasizes earnings estimates and estimate revisions, highlighting a variety of stocks that are displaying the right characteristics to beat the market over the next one to three months. HAS is currently sporting a Zacks Rank of #1 (Strong Buy). Over the past three months, the Zacks Consensus Estimate for HAS's full-year earnings has moved 5.28% higher. This shows that analyst sentiment has improved and the company's earnings outlook is stronger. Our latest available data shows that HAS has returned about 43.45% since the start of the calendar year. Meanwhile, the Consumer Discretionary sector has returned an average of 20.46% on a year-to-date basis. This means that Hasbro is outperforming the sector as a whole this year. Looking more specifically, HAS belongs to the Toys - Games - Hobbies industry, a group that includes 8 individual stocks and currently sits at #61 in the Zacks Industry Rank. Stocks in this group have gained about 22.12% so far this year, so HAS is performing better this group in terms of year-to-date returns. HAS will likely be looking to continue its solid performance, so investors interested in Consumer Discretionary stocks should continue to pay close attention to the company.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Hasbro, Inc. (HAS): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors focused on the Consumer Discretionary space have likely heard of Hasbro (HAS), but is the stock performing well in comparison to the rest of its sector peers? Let's take a closer look at the stock's year-to-date performance to find out.",
    "Hasbro is a member of our Consumer Discretionary group, which includes 248 different companies and currently sits at #12 in the Zacks Sector Rank. The Zacks Sector Rank considers 16 different sector groups. The average Zacks Rank of the individual stocks within the groups is measured, and the sectors are listed from best to worst.",
    "The Zacks Rank is a proven system that emphasizes earnings estimates and estimate revisions, highlighting a variety of stocks that are displaying the right characteristics to beat the market over the next one to three months. HAS is currently sporting a Zacks Rank of #1 (Strong Buy).",
    "Over the past three months, the Zacks Consensus Estimate for HAS's full-year earnings has moved 5.28% higher. This shows that analyst sentiment has improved and the company's earnings outlook is stronger.",
    "Our latest available data shows that HAS has returned about 43.45% since the start of the calendar year. Meanwhile, the Consumer Discretionary sector has returned an average of 20.46% on a year-to-date basis. This means that Hasbro is outperforming the sector as a whole this year.",
    "Looking more specifically, HAS belongs to the Toys - Games - Hobbies industry, a group that includes 8 individual stocks and currently sits at #61 in the Zacks Industry Rank. Stocks in this group have gained about 22.12% so far this year, so HAS is performing better this group in terms of year-to-date returns.",
    "HAS will likely be looking to continue its solid performance, so investors interested in Consumer Discretionary stocks should continue to pay close attention to the company.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:30:11"
}