{
  "url": "https://www.nasdaq.com/article/here-and-now-indias-auto-industry-urges-government-action-to-fight-slowdown-20190905-00826",
  "title": "'Here and now': India's auto industry urges government action to fight slowdown - Nasdaq.com",
  "text": [
    "By Aditi Shah and Sudarshan Varadhan",
    "NEW DELHI, Sept 5 (Reuters) - India's top auto industry executives called for the government on Thursday to take urgent steps to revive a sector crippled by plunging sales, leading to hundreds of thousands of job losses and lower production.",
    "Indian auto sales are set to drop for the 10th straight month in August, marking one of the worst slowdowns in the history of the industry, which contributes more than 7% of India's GDP. ",
    "Tata Motors  managing director Guenter Butschek warned of dire consequences if the government didn't act.",
    "\"The Indian automotive growth story is about to collapse,\" he said during a panel discussion.",
    "Automakers, component manufacturers and dealers have laid off about 350,000 workers in India since the start of the financial year. ",
    "'HERE AND NOW'",
    "Butschek said the government needed to let the industry know \"here and now,\" whether it planned to cut taxes on automobiles to give carmakers enough time to plan for India's upcoming festival season, which usually sees a surge in demand.",
    "Tata separately said in a statement it had slashed vehicle production in August by 52% - its steepest cut in at least a  decade, according to Reuters calculations. ",
    "Nitin Gadkari, India's Road Transport and Highways Minister, told the conference the government was working to help the sector and said he had asked the finance ministry to consider cutting taxes on petrol and diesel, as well as hybrid vehicles.",
    "Indian auto stocks ended higher following Gadkari's remarks, with Tata Motors Ltd gaining 8% and Maruti Suzuki India Ltd  rising 2.5%.",
    "Pawan Goenka, managing director of Mahindra and Mahindra Ltd , echoed Butschek's call for urgent action.",
    "\"There are concerns that the industry could face deeper problems if it does not recover before migration to BS VI,\" he said, referring to the requirement for new cars to use less polluting Euro VI fuel from the fiscal year starting April 2020.",
    "If inventories of older Euro IV vehicles exceed demand in  March, it could lead to \"very significant\" damage to the industry, he said.",
    "Both Tata and Mahindra warned of steeper production cuts if the industry slowdown continues.",
    "Mahindra, a manufacturer of SUVs and agricultural tractors, would defer some 10% of its annual capital spending, Goenka said. Separately, the company said on Thursday its production fell 37% in August.",
    "India's largest automaker Maruti Suzuki Ltd  said on Wednesday it was shutting passenger vehicle manufacturing factories in Gurugram and Manesar in northern India for two days this month. ",
    "That's the first time the company has halted production due to lack of demand at both those plants, a source familiar with the matter told Reuters on Thursday.",
    "Goenka said he expected more job cuts in he industry this fiscal year if the slowdown continued, adding Mahindra had already shed 1,500 temporary workers, or 5% of its workforce.",
    "India's economy is cooling, with growth slowing to a more than five year low in April-June, and many key sectors including real estate and agriculture witnessing a slowdown."
  ],
  "published_datetime": "2019-09-05 12:05:00"
}