{
  "url": "https://www.nasdaq.com/article/why-amazon-prime-video-will-keep-amzn-stock-on-an-upward-path-cm1206963",
  "title": "Why Amazon Prime Video Will Keep AMZN Stock on an Upward Path - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Fall means football. It hopefully means cooler weather. It also means a new TV season. While we once waited breathlessly for the latest from CBS (NYSE: CBS ),  Disney's (NYSE: DIS ) ABC or Comcast's (NASDAQ: CMCSA ) NBC, we're now more likely to focus on what's coming from Netflix (NASDAQ: NFLX ), Alphabet's (NASDAQ: GOOG , NASDAQ: GOOGL ) YouTube and Amazon's  (NASDAQ: AMZN ) Prime.",
    "The season has already begun  as Amazon begins streaming Carnival Row . This is either a gritty version of Sherlock Holmes meets Tinker Bell , another liberal bashing of immigration laws  or Orlando Bloom's big comeback.",
    "Maybe it's all three.",
    "Carnival Row also proves that AMZN is not only a TV network, but a big Hollywood studio and the new home for executive intrigue.",
    "While first launched as an add-on to free shipping, Amazon's Prime Video is becoming a key stand-alone business for the company. As the cost of building clouds drops, and more companies build their own, Cloud Czars like Amazon face the challenge of filling their clouds with must-have services.",
    "Amazon's Prime efforts, including its free IMDb service, which it's turning into something more like cable , are having their effect. Amazon is even gaining traction against Netflix in the race for America's attention.",
    "Amazon is pressing its advantage.",
    "Amazon stepped up when Disney offered its Yes Network , which televises sports teams, including the New York Yankees. Amazon is buying exclusive content at film festivals  and burying the hatchet with Google. It's offering programming deals on its streaming stick to take share from Roku (NASDAQ: ROKU ).",
    "Video works for Amazon because, unlike all its competitors, it is its own advertiser. Consumers watch Amazon lingerie shows , or concerts, then stay to buy clothes or back to school items.",
    "Competitors like Disney clearly see that Amazon can monetize its content like no one else.",
    "With its Fire Stick, Fire TV and Prime Video, Amazon has bypassed all the old gatekeepers of media and commerce. It's a platform. It's a host of programming services riding that platform. As in the case of the Taylor Swift concert, it's the store these services advertise. It's an ecosystem unique in the history of business.",
    "That may be why Disney+ won't launch on the Amazon Fire Stick , although it's launching on every other streaming platform. It's not a technology issue.  It's a deliberate business choice , one that could help Roku and Apple (NASDAQ: AAPL ) take share in the platform derby.",
    "That may also be why the sabbatical of Amazon executive vice president Jeff Blackburn is being covered like a Hollywood scandal. Not that AMZN hasn't had its share of Hollywood scandals, including a me-too scandal that took down its head of content two years ago.",
    "But none of this may matter. Amazon is the platform that re-sells its competitors services. Amazon Prime is not just a streaming product, but a whole host of channels. Amazon can enter into, and even dominate, the European market at no incremental cost. Amazon is the advertiser that makes money from advertising.",
    "While Berkshire Hathaway (NYSE: BRK.A , NYSE: BRK.B ) has been lightening up on stocks this year, it has been increasing its purchases of Amazon. So have hedge funds like William Ackman's Pershing Square. So have I.",
    "This is happening despite two failures to hold the $2,000 per share level, or the $1 trillion valuation Microsoft (NASDAQ: MSFT ) flew past without looking back at early this year. Amazon now trades at 13% less than it did a year ago, and it pays no dividend .",
    "Yet at its opening price of $1,772 per share, Amazon stock remains a great bargain for any investor with a five-year time horizon. Video is one reason why.",
    "Dana Blankenhornis a financial and technology journalist. He is the author of the environmental story, Bridget O'Flynn and the Bear, available at the Amazon Kindle store. Write him at danablankenhorn@gmail.comor follow him on Twitter at @danablankenhorn . As of this writing he owned shares in AAPL, MSFT and AMZN.",
    "The post Why Amazon Prime Video Will Keep AMZN Stock on an Upward Path appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:01:00"
}