{
  "url": "https://www.nasdaq.com/article/new-cannabis-research-will-be-bittersweet-for-tilray-stock-cm1210385",
  "title": "New Cannabis Research Will Be Bittersweet for Tilray Stock - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Tilray (NASDAQ: TLRY ) shareholders have had a harsh buzz over the past year. Last year, investors had high hopes for this cannabis grower. It was the first company in this industry to go public and list on the Nasdaq exchange. Within months of hitting the market at $17, Tilray stock was trading above $200.",
    "Since then, the stock has trended lower to current levels around $31.",
    "Despite the lack of media coverage, a recent news event will undoubtedly have an effect on Tilray stock. The U.S. Drug Enforcement Administration announced that it will begin processing applications for scientific and medical research on cannabis.",
    "As of right now, there is only one institution in the United States that can legally produce marijuana for research purposes - the University of Mississippi. This federal contract was awarded over 50 years ago.",
    "This news is important because it shows that the DEA is accepting the fact cannabis can be a legitimate medicine. For a medicine to be considered \"legitimate,\" it must be backed by extensive research. The DEA is taking steps here to improve access to marijuana research. I believe this is a large step on the path to becoming legal on a federal level.",
    "One of the things that has held back the growth of the medical cannabis industry is the process that it takes to become a legal medicine. The U.S. Food and Drug Administration has extensive rules and regulations governing this process. It can be extremely expensive and literally take years to complete. This move at the very least opens the door for more thorough and high-quality research.",
    "How will this affect Tilray stock ? Obviously it its too soon to tell, but I believe that it may be both bad and good for the company.",
    "The bad side is the company will see increased competition. Tilray was one of the early players in the industry and because of this, it has some strategic advantages with regards to patents and research capabilities. Now that the ability to perform research will become more widespread, it will inevitably increase competition.",
    "The good side for Tilray and other companies in the cannabis industry is that this action will eventually lead to significant growth in the medical marijuana market.",
    "TLRY stock has been consolidating over the past week. If it heads lower, there may be some short-term support around the $25 level. This is where the recent lows were last week. And because it is a nice round number, it is also important psychologically. If this level breaks there will probably be some meaningful support around the $22 level. This is because it near where the stock hit the market when it went public last year.",
    "If the stock rallies, look for resistance around the $35 level. There could be resistance here because it was the support level and the low in June. Support levels become resistance levels the stock moves lower, causing those who purchased it at the support level to lose money. These investors tell themselves that if the stock rallies, they will sell it at $35 so they can get out and break even.",
    "As of this writing, Mark Putrino did not hold any of the aforementioned securities. ",
    "The post New Cannabis Research Will Be Bittersweet for Tilray Stock appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 06:00:57"
}