{
  "url": "https://www.nasdaq.com/article/axta-vs-ngvt-which-stock-should-value-investors-buy-now-cm1210431",
  "title": "AXTA vs. NGVT: Which Stock Should Value Investors Buy Now? - Nasdaq.com",
  "text": [
    " Investors with an interest in Chemical - Specialty stocks have likely encountered both Axalta Coating Systems (AXTA) and Ingevity Corporation (NGVT). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look. The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits. Currently, Axalta Coating Systems has a Zacks Rank of #2 (Buy), while Ingevity Corporation has a Zacks Rank of #3 (Hold). The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that AXTA has an improving earnings outlook. But this is only part of the picture for value investors. Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels. The Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P/E ratio, P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value. AXTA currently has a forward P/E ratio of 17.11, while NGVT has a forward P/E of 17.75. We also note that AXTA has a PEG ratio of 1.27. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. NGVT currently has a PEG ratio of 1.77. Another notable valuation metric for AXTA is its P/B ratio of 5.46. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, NGVT has a P/B of 8.97. These metrics, and several others, help AXTA earn a Value grade of B, while NGVT has been given a Value grade of C. AXTA sticks out from NGVT in both our Zacks Rank and Style Scores models, so value investors will likely feel that AXTA is the better option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Axalta Coating Systems Ltd. (AXTA): Free Stock Analysis Report   Ingevity Corporation (NGVT): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors with an interest in Chemical - Specialty stocks have likely encountered both Axalta Coating Systems (AXTA) and Ingevity Corporation (NGVT). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look.",
    "The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits.",
    "Currently, Axalta Coating Systems has a Zacks Rank of #2 (Buy), while Ingevity Corporation has a Zacks Rank of #3 (Hold). The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that AXTA has an improving earnings outlook. But this is only part of the picture for value investors.",
    "Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels.",
    "The Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P/E ratio, P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value.",
    "AXTA currently has a forward P/E ratio of 17.11, while NGVT has a forward P/E of 17.75. We also note that AXTA has a PEG ratio of 1.27. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. NGVT currently has a PEG ratio of 1.77.",
    "Another notable valuation metric for AXTA is its P/B ratio of 5.46. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, NGVT has a P/B of 8.97.",
    "These metrics, and several others, help AXTA earn a Value grade of B, while NGVT has been given a Value grade of C.",
    "AXTA sticks out from NGVT in both our Zacks Rank and Style Scores models, so value investors will likely feel that AXTA is the better option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:40:16"
}