{
  "url": "https://www.nasdaq.com/article/lululemon-q2-earnings-preview-report-thursday-after-the-bell-cm1207633",
  "title": "Lululemon Q2 Earnings Preview: Report Thursday After The Bell - Nasdaq.com",
  "text": [
    " Lululemon LULU  has been on an absolute tear for the past 2 years, with its share price appreciating almost 200% and year-to-date growth of 48.5%. This retail gem has been able to defy the retail apocalypse, through its ability to meet the evolving millennial consumers' demands.  lululemon athletica inc. Price and Consensus     lululemon athletica inc.   price-consensus-chart    |   lululemon athletica inc. Quote   Lululemon is reporting its Q2 earnings after the bell Thursday, August 5 th  and analysts are anticipating robust growth figures. Zacks Consensus estimates consist of an EPS of $0.89 on sales of $844 million, which would represent growth of 25.4% and 16.6%, respectively. These estimates are above management guidance range due to their investor relations team being routinely conservative. LULU is typically a big mover on earnings releases with an average price action of 10.4% over the past 8 quarters (7 up, 1 down). This company has demonstrated a positive top and bottom-line surprise on its last 9 quarterly postings. Investors have already priced in a beat to Thursday's earnings report so anticipate a considerable downside if they are unable to hit their targets.    The Business  Lululemon pioneered the retail trend of what is known today as 'athleisure'. As the name suggests, athleisure is a fashion trend that makes clothing quite versatile, giving consumer's fashionable athletic clothing that can be worn in almost any setting. Athleisure is being considered as a fashion evolution more than a trend by fashion professionals. Society and fashion are evolving together to a trend that is progressively casual and comfort-based. Even in the workplace, companies are becoming increasingly lax in their dress codes. Many people are wearing these athleisure clothes into the office. Lululemon is well-positioned to continue to ride the athleisure wave as their innovative designers spearhead new fashion trends. As the retail apocalypse wipes malls and closes thousands of brick-and-mortar retailers, Lululemon has been able to expand its omnichannel offering. The company opened 44 new stores in the US and abroad during Q1 alone (10.7% year-over-year increase). Lulu's e-commerce presence is growing at an even faster rate making up roughly 26.8% of the firm's total revenues, up from 24.3% last year.   Sales growth has been accelerating over the past 2 years, while margins expand. LULU analysts have been progressively optimistic about this stock with robust double-digit topline growth estimated over the next few years along with ballooning margins. Top competitors include Nike NKE  , Adidas ADDYY  , and Under Armor UA  . Lululemon is unquestionably the leader in the space with competitors attempting to adopt Lulu's strategy and design.  Take Away  Lululemon is a groundbreaking fashion innovator that is going to continue to grow with the athleisure revolution but is it a good buy? LULU is not cheap right now, trading at a forward P/E of 34.8x, which is exceptionally high for a retail stock, even with its strong growth expectations. Thursday evening's report should validate or reject LULU's high valuation. Look for a top and bottom-line beat with a miss on either likely to cause a significant share price decline. As always, focus on changes in management's full-year guidance as well as any economic or trade concerns that the management team may voice.    Biggest Tech Breakthrough in a Generation  makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.        See 7 breakthrough stocks now>>       Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   lululemon athletica inc. (LULU): Free Stock Analysis Report   Adidas AG (ADDYY): Free Stock Analysis Report   NIKE, Inc. (NKE): Free Stock Analysis Report   Under Armour, Inc. (UA): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Lululemon LULU  has been on an absolute tear for the past 2 years, with its share price appreciating almost 200% and year-to-date growth of 48.5%. This retail gem has been able to defy the retail apocalypse, through its ability to meet the evolving millennial consumers' demands.",
    " lululemon athletica inc. Price and Consensus     lululemon athletica inc.   price-consensus-chart    |   lululemon athletica inc. Quote  ",
    " lululemon athletica inc.   price-consensus-chart    |   lululemon athletica inc. Quote ",
    "Lululemon is reporting its Q2 earnings after the bell Thursday, August 5 th  and analysts are anticipating robust growth figures. Zacks Consensus estimates consist of an EPS of $0.89 on sales of $844 million, which would represent growth of 25.4% and 16.6%, respectively. These estimates are above management guidance range due to their investor relations team being routinely conservative.",
    "LULU is typically a big mover on earnings releases with an average price action of 10.4% over the past 8 quarters (7 up, 1 down). This company has demonstrated a positive top and bottom-line surprise on its last 9 quarterly postings. Investors have already priced in a beat to Thursday's earnings report so anticipate a considerable downside if they are unable to hit their targets.  ",
    " The Business ",
    "Lululemon pioneered the retail trend of what is known today as 'athleisure'. As the name suggests, athleisure is a fashion trend that makes clothing quite versatile, giving consumer's fashionable athletic clothing that can be worn in almost any setting. Athleisure is being considered as a fashion evolution more than a trend by fashion professionals.",
    "Society and fashion are evolving together to a trend that is progressively casual and comfort-based. Even in the workplace, companies are becoming increasingly lax in their dress codes. Many people are wearing these athleisure clothes into the office.",
    "Lululemon is well-positioned to continue to ride the athleisure wave as their innovative designers spearhead new fashion trends.",
    "As the retail apocalypse wipes malls and closes thousands of brick-and-mortar retailers, Lululemon has been able to expand its omnichannel offering. The company opened 44 new stores in the US and abroad during Q1 alone (10.7% year-over-year increase). Lulu's e-commerce presence is growing at an even faster rate making up roughly 26.8% of the firm's total revenues, up from 24.3% last year.  ",
    "Sales growth has been accelerating over the past 2 years, while margins expand. LULU analysts have been progressively optimistic about this stock with robust double-digit topline growth estimated over the next few years along with ballooning margins.",
    "Top competitors include Nike NKE  , Adidas ADDYY  , and Under Armor UA  . Lululemon is unquestionably the leader in the space with competitors attempting to adopt Lulu's strategy and design.",
    " Take Away ",
    "Lululemon is a groundbreaking fashion innovator that is going to continue to grow with the athleisure revolution but is it a good buy? LULU is not cheap right now, trading at a forward P/E of 34.8x, which is exceptionally high for a retail stock, even with its strong growth expectations.",
    "Thursday evening's report should validate or reject LULU's high valuation. Look for a top and bottom-line beat with a miss on either likely to cause a significant share price decline. As always, focus on changes in management's full-year guidance as well as any economic or trade concerns that the management team may voice.",
    " Biggest Tech Breakthrough in a Generation  makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.        See 7 breakthrough stocks now>>    ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:45:00"
}