{
  "url": "https://www.nasdaq.com/article/gnc-holdings-inks-retail-partnership-deal-to-grow-in-brazil-cm1208139",
  "title": "GNC Holdings Inks Retail Partnership Deal to Grow in Brazil - Nasdaq.com",
  "text": [
    "GNC Holdings Inc.'sGNC international expansion continues strongly. In line with this, the company has formed an alliance with Brazil-based professional retail operator BFG Brasil Comercial de Vitaminas LTDA. This contract will allow GNC to fortify its franchise presence outside the United States and broaden its consumer base in the emerging economy of Latin America.",
    "The tie-up is aimed at specializing in the operation and management of major retail brands in Brazil. This will help Brazilian consumers get high quality products in the vitamin and supplement sector. In this regard, Banco de Franquias - the management organization backing BFG Brasil - has entrepreneurs operating GNC in Argentina and Uruguay as well.",
    "Expansion in Populous Brazil Seems Strategic",
    "We consider this Brazilian deal to be a perfect strategic fit for the company as it makes an all-out effort to widen its global footprint. The consumer health market in Brazil is currently on a positive growth trajectory with consistent progress noticed in the vitamins and dietary supplements categories. The nutritional supplements market alone is worth an estimated $3 billion.",
    "Needless to say that with the largest population base in Latin America, Brazil has been a key target market for GNC.",
    "Management noted that both partners of this coalition have vast knowledge of the market in Brazil with more than 30 years of experience in retail management. Therefore, the two entities are specialists in developing international brands in Brazil boasting a proven track record in business management, retail, e-commerce, distribution, and marketing.",
    "This partnership is expected to allow GNC to effectively tap the consumer market, providing an opportunity for multi-channel growth.",
    "Other Recent International Endeavours of GNC",
    "GNCs' global business has been a key catalyst in recent years. Management expects to continue capitalizing on the international revenue growth opportunities through the addition of franchise stores in the existing markets, extension into new high-growth markets and the growth of product distribution in both the prevalent and new markets.\r\n Of late, GNC is gaining traction in India and also delivered initial product shipments to its Japanese and Australian partners. Revenues from international operations excluding China, inched up 1.3%, led by a robust franchisee performance in the Middle East and Asia.",
    "As a major development, the company recently launched a joint venture (JV) with Harbin Pharmaceutical Group, which will consolidate its base in China that has $25 billion of market opportunity.\r\n As GNC is beginning to leverage Harbin's distribution network and regulatory, operational and manufacturing expertisethrough the JV, it hopes to generate additional momentum in the same. The company expects its business in China to reach a $200-million mark in revenues over the next three years.",
    "Share Price Performance",
    "Shares of the company have underperformed its  industry in the past three months. The stock has surged 42.3% compared with the industry's 5.5% rise.",
    "Zacks Rank and Key Picks",
    "GNC currently carries a Zacks Rank #3 (Hold). Some better-ranked stocks in the broader medical space are Valeritas Holdings, Inc. VLRX , Myomo, Inc. MYO and National Vision Holdings, Inc. EYE . You can see  the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.",
    "Valeritas Holdings currently holds a Zacks Rank #2 (Buy). Its third-quarter earnings growth rate is projected at 43.8%.",
    "Myomo's long-term expected earnings growth rate is 25%. The stock currently carries a Zacks Rank of 2.",
    "National Vision's long-term expected earnings growth rate is 17.2%. The stock is Zacks #2 Ranked at present.",
    "It's Illegal in 42 States, But Investors Will Make Billions Legally\r\n In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.\r\n That's twice as much as they spend on marijuana, legally or otherwise.\r\n Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:39:00"
}