{
  "url": "https://www.nasdaq.com/article/hong-kong-concession-sparks-market-rebound-cm1207669",
  "title": "Hong Kong Concession Sparks Market Rebound - Nasdaq.com",
  "text": [
    "SPECIAL NOTE: Remember, we need your input to make next week's new Zacks Ultimate Strategy Session episode the best it can be. There are two ways you can participate:",
    "1) Zacks Mailbag: In this regular segment, Kevin Matras answers your questions ranging from current market conditions, general investing wisdom, usage of the Zacks Rank or any resources of Zacks.com and more. Pretty much anything goes.",
    "2) Portfolio Makeover: Sheraz Mian and John Blank, PhD, review a customer portfolio to give feedback for improvement. No need to send us personal information such as dollar value of holdings. Simply email us with all of the tickers you own.",
    "Just make sure to email your submissions for either one, or both, by Thursday morning, September 5. Email now to mailbag@zacks.com.\r\n The market had a nice rebound Wednesday on hopes for a calmer Hong Kong moving forward.\r\n The NASDAQ jumped by 1.3% (or nearly 103 points) in the session to 7976.88, while the S&P was up 1.08% to 2937.78.\r\n These indices both made up for yesterday's losses and then some. On Tuesday, they were down 1.11% and 0.69%, respectively.\r\n The Dow didn't completely recover the other day's deficit, but it came pretty close! The index rose 0.91% (or about 237 points) to 26,355.47. It lost 1.08% on Tuesday.\r\n Well, we've been hoping for a bit of good news in this headline-obsessed market… and today we got some.\r\n Hong Kong will withdraw the controversial extradition bill that sparked months of huge protests and fears of another Tiananmen Square. \r\n It's unlikely that this concession will completely end the protests, but hopefully it can bring the temperature down a bit and reassure skittish investors.\r\n The protests were never really a direct threat to the U.S. economy. However, we all know how much the market hates uncertainty, and there's a lot of it in this country and around the world right now. So the chance for clarity on anything is reason to celebrate.\r\n Plus, many were concerned that the ongoing protests playing on the news every night would complicate any possible trade talks between the U.S. and China.\r\n Given all the ups and downs in this conflict, we can't afford any obstacles toward getting a deal done.  \r\n Maybe this is just the start in a long string of positive headlines for the market. If that's the case, then the major indices could be back at all-time highs in short order despite all the recent challenges.\r\n But let's not get ahead of ourselves!Today's Portfolio Highlights:Home Run Investor: When you're on a cruise, you don't have many options when it comes to haircuts, massages or manicures. Therefore, a company like OneSpaWorld (OSW), which operates spas on cruise ships and at resorts, has a captive audience. Brian really appreciates this company's business model and \"wonderful\" chart. He feels that this Zacks Rank #2 (Buy) has a lot of promise but is under the radar right now. Plus, the \"monstrous\" 25% short position means this stock could be on the verge of a major breakout if it continues to advance. The portfolio added OSW on Wednesday. Read the full write-up for a lot more on this new addition.  TAZR Trader: Even before Elastic (ESTC) reported earnings last Wednesday, Kevin was telling you to keep an eye on this big data analytics provider. The editor liked that this company searches for \"dark data\", which companies need to gather and analyze if they hope to stay competitive. And now, ESTC has reported strong first-quarter results, including total revenue that beat expectations and soared 58% from last year. Kevin likes the way this stock is \"digging into support on its 6-week old 200-day moving average at $82\". With price targets as high as $137, he decided to put some of the portfolio's 64% cash position to work. ESTC was added on Wednesday with a 10% allocation. Read the complete commentary for a lot more on this new addition, including a look at what analysts are saying. \r\n Counterstrike:\"A lot of fear was sucked out of the market after the mayor of Hong Kong killed the extradition bill that caused the protests in the first place. This will likely calm a lot of the protestors, as it signals that both the Chinese government and the leaders of Hong Kong recognize what's best for the city is to keep it separate from the mainland.\r\n \"The signal to the markets was to buy, sending the Hang Seng almost 4%. This led global market s and the S&P futures higher, causing stocks to gap up.\"The news from china takes away the risk of the PLA going into Hong Kong, which in turn takes the risk of the White House condemning China and ruining the trade deal. For that reason, the quants will up their odds of a trade deal and buy stocks.\" -- Jeremy Mullin\r\n Have a Great Evening,\r\n Jim Giaquinto",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 01:14:46"
}