{
  "url": "https://www.nasdaq.com/article/thailand-to-unveil-relocation-package-to-woo-firms-hurt-by-trade-war-20190905-00240",
  "title": "Thailand to unveil 'relocation package' to woo firms hurt by trade war - Nasdaq.com",
  "text": [
    "By Orathai Sriring and Kitiphong Thaichareon",
    "BANGKOK, Sept 5 (Reuters) - Thailand is planning a \"relocation package\" of incentives to attract foreign companies looking to move production from China, officials said, seeking to compete with Vietnam to woo manufacturers looking to steer clear of the Sino-U.S. trade war.",
    "Possible tax breaks, eased regulations and expedited licenses and permits will be discussed by economic ministers on Friday.",
    "Facilitating speedier approvals for foreign investors will be important, said Nattapol Rangsitpol, a director general in an Industry Ministry office that works closely with the Board of Investment (BOI).",
    "In seeking to attract investors affected by the trade war, \"we have to understand that they are escaping death, so speed is important,\" he said.",
    "\"We have to enable them to set up factories quickly, produce quickly and sell quickly,\" Nattapol added.",
    "Strict immigration and reporting rules have affected investors, who complained they were treated like criminals, he said.",
    "The BOI is looking at more tax breaks, particularly to targeted industries, to boost attractiveness, Nattapol said, adding that at present Thailand and Vietnam's incentives were about the same.",
    "The BOI has said it is aiming to attract 100 companies, mostly Chinese firms. ",
    "Thailand already offers firms in the Eastern Economic Corridor (EEC) a corporate income tax (CIT) exemption of up to 13 years and a 50% tax reduction of up to five years. The current CIT is 20%.",
    "Vietnam's standard corporate tax is 20%, but targeted firms will be offered a 10% tax for 15 years, a tax exemption for four years and a 50% tax reduction for nine years.",
    "Thai Deputy Prime Minister Somkid Jatusripitak said there would also be a special package on personnel development for companies to train Thai workers, or learning on the job, such as Google's plan to set up an academy in Thailand.",
    "Thailand is already attracting some foreign firms looking to relocate production from China to escape U.S. tariffs on Chinese goods. ",
    "TOP DESTINATION",
    "But Vietnam appears to be the top destination for firms hit by the trade war, due to lower wages and land prices.",
    "In 2019's first half, Thailand's foreign direct investment (FDI) applications totalled 147 billion baht ($4.8 billion), while Vietnam's new FDI pledges were $18.74 billion.",
    "Nattapol said Thailand's labour skills and infrastructure are better, and investment privileges are clear and stable despite a change in government.",
    "\"Vietnam's wages look lower, but there will be unstated additional costs,\" he asserted.",
    "Thailand's daily minimum wage is 308 baht($10)-330 baht($10.78), while Vietnam's wages range from 97,333 dong($4.2) to 139,000 dong($6.0) per day.",
    "Thailand ranked 38th in overall competitiveness while  Vietnam ranked 77th, according to the World Economic Forum's Global Competitiveness Report 2018.",
    "Supant Mongkolsuthree, chairman of the Federation of Thai Industries, said strength of the baht  is a major obstacle for drawing foreign investment and the government should take measures to tackle the problem.",
    "The baht has strengthened 6.5% against the dollar this year.",
    "($1 = 30.60 baht)",
    "($1 = 23,198 dong)",
    "Thailand and Vietnam ease of doing business rank (graphic)."
  ],
  "published_datetime": "2019-09-05 06:32:00"
}