{
  "url": "https://www.nasdaq.com/article/japan-stocks-reach-1mth-high-on-news-uschina-trade-talks-to-resume-20190905-00062",
  "title": "Japan stocks reach 1-mth high on news US-China trade talks to resume - Nasdaq.com",
  "text": [
    "    * Nikkei ends up 2.12%, brushes highest level since Aug. 2",
    "* Beijing, Washington to hold trade talks, boosts risksentiment",
    "By Tomo Uetake",
    " The benchmark Nikkei average .N225 ended the day up 2.12%at 21,085.94, the highest close since Aug. 2. During the day, ittouched 21,164.61, also a peak since Aug. 2. ",
    " On the Nikkei index, there were 207 advancers and 18decliners.",
    "Japanese shares were boosted after Beijing said China andthe United States agreed to hold trade talks in Washington inearly October. urn:newsml:reuters.com:*:nB9N25400R",
    "The market was already on a solid footing after Hong Kongleader Carrie Lam on Wednesday withdrew an extradition bill that triggered months of sometimes violent protests and as Britishlawmakers voted to prevent a no-deal Brexit on Oct. 31. urn:newsml:reuters.com:*:nL3N25V0NCurn:newsml:reuters.com:*:nL5N25V2FD",
    "\"There was a variety of positive factors for the market,with the news of Sino-U.S. trade negotiations having a notablybig impact,\" said Hiroaki Kuramochi, chief market analyst atCapital Partners Securities.",
    "All of the Tokyo Stock Exchange's 33 subsectors were inpositive territory as the market attracted hefty purchasesacross the board.",
    "Cyclical sectors were particularly in demand, with precisionmachinery .IPRCS.T and sea transport .ISHIP.T the top twoperforming subindexes on the broader Topix, up 3.73% and 3.72%,respectively.",
    "The broader Topix .TOPX added 1.84% to 1,534.46.",
    "Other notable movers included the TSE REIT index .TREIT ,edging up 0.44% to a fresh 12-year high. urn:newsml:reuters.com:*:nL4N25G1P8urn:newsml:reuters.com:*:nL4N24D238",
    "Medical-related service provider M3 Inc2413.T soared 10%and baseball stadium operator Tokyo Dome Corp9681.T fell 8.4%after index provider Nikkei announced it will drop the latterfrom the Nikkei 225 share average and replace it with theformer, from Oct 1.",
    "Candidates that did not make the index list slipped.Kakaku.com 2371.T , Zozo3092.T and Nintendo7974.T shed5.4%, 1% and 1.5%, respectively.",
    "Nissan Motor Co7201.T gained 2% despite media reportsquoting its chief executive as admitting to improperly receivingstock-related compensation, in the latest case of financialmisconduct among executives at Japan's second-largest automaker. urn:newsml:reuters.com:*:nL3N25V4QI",
    "The stocks that gained the most among the top 30 core Topixnames were Hitachi Ltd6501.T which gained 5.1%, followed byShin-Etsu Chemical Co's 4063.T 4.7% rise.",
    "The underperformers among the Topix 30 were Nintendo Co7974.T , which lost 1.5%, followed by Nippon Telegraph andTelephone Corp 9432.T , which declined 0.8%.",
    "The volume of shares traded on Topix was 1.35 billion,compared to the average 1.1 billion yen in the past 30 days. ",
    " (Additional reporting by the Tokyo markets team; Editing byRichard Borsuk) ((shinichi.saoshiro@thomsonreuters.com; +813-6441-1774))"
  ],
  "published_datetime": "2019-09-05 02:37:00"
}