{
  "url": "https://www.nasdaq.com/article/us-ipos-hope-for-stock-market-volatility-reprieve-20190903-00296",
  "title": "U.S. IPOs hope for stock market volatility reprieve - Nasdaq.com",
  "text": [
    "By Joshua Franklin",
    "NEW YORK, Sept 3 (Reuters) - U.S. companies planning to launch initial public offerings (IPOs) in the coming weeks are hoping that August's bout of stock market volatility will subside this month, according to investment bankers and capital markets lawyers advising them.",
    "The U.S. trade war with China caused the stock market to seesaw in August. The CBOE Volatility index , Wall Street's fear gauge, rose around 17.7% last month, the second-biggest monthly jump so far in 2019. Last month was also the worst August for U.S. stocks in four years.",
    "By contrast, almost 70 companies have registered with the U.S. Securities and Exchange Commission for an IPO, according to research firm Renaissance Capital, which estimates companies could raise more than $15 billion from September until the end of 2019.",
    "WeWork owner The We Company, food delivery platform Postmates Inc and fitness startup Peloton Interactive are among the companies expected to launch IPOs by the end of the year. Representatives for the three companies declined to comment on their IPO plans.",
    "\"I can safely say that this has been one of busiest Augusts we have ever had in terms of IPOs getting geared up for September,\" said David Goldschmidt, global head of capital markets at U.S. law firm Skadden, Arps, Slate, Meagher & Flom.",
    "The U.S. market for IPOs typically gets back up to full speed once dealmakers and investors return to work after the Monday Labor Day holiday.",
    "So far in 2019, companies have raised $36.5 billion through IPOs, down slightly on the same point in 2018 but the third most active year since the 2008 financial crisis, according to financial data provider Refinitiv.",
    "While the shares of this year's two most high-profile IPOs, Uber Technologies Inc  and Lyft Inc , have performed poorly after their flotation, most IPOs have fared well in 2019.",
    "Renaissance Capital's IPO-focused exchange-traded fund /IPO is up more than 30 percent so far in 2019, around double the rise in the S&P 500 Index over the same period. Strong IPO performers have included plant-based burger maker Beyond Meat Inc  and video conferencing company Zoom Video Communications Inc .",
    "\"Conditions could all change with a tweet (such as from U.S. President Donald Trump) but, when you look at the overall market backdrop, it feels maybe not perfect but still very good for IPOs,\" said Mike O'Donovan, partner in investment bank PJT Partners Inc's  strategic advisory business.",
    "UNPREDICTABLE IPO WINDOW",
    "In the background for companies weighing the timing of their IPO, is whether or not political rhetoric from U.S. presidential candidates could make for even rougher conditions.",
    "The run-up to a U.S. presidential election has typically not had a major impact on prospective IPOs, though the November 2020 face-off between Republican Trump and a Democratic challenger is expected by market participants to trigger more volatility, given the polarization in U.S. politics.",
    "\"We are urging companies to be ready as soon as possible because the IPO windows have been so unpredictable,\" said Andrew Fabens, partner at Gibson, Dunn & Crutcher and co-chair of the law firm's capital markets practice.",
    "The likes of home-sharing company Airbnb Inc, payments startup Stripe and job search platform ZipRecruiter are expected to pursue IPOs next year, and it is unclear how close their IPOs would be to the presidential election.",
    "Spokesman for Airbnb and ZipRecruiter declined to comment on a possible IPO. Stripe did respond to a request for comment.",
    "\"It would be incorrect to say the IPO window closes around elections,\" said Alex Wellins, co-founder of IPO advisory and investor relations firm Blueshirt Group LLC.",
    "\"That said,\" Wellins added, \"most people expect very high levels of volatility around this particular election.\""
  ],
  "published_datetime": "2019-09-03 07:00:00"
}