{
  "url": "https://www.nasdaq.com/article/trump-administration-announces-plans-to-ban-flavored-ecigarettes-from-market-20190911-00643",
  "title": "Trump administration announces plans to ban flavored e-cigarettes from market - Nasdaq.com",
  "text": [
    "By Jeff Mason and Chris Kirkham",
    "WASHINGTON/LOS ANGELES, Sept 11 (Reuters) - The Trump administration announced plans on Wednesday to remove all flavored e-cigarettes from store shelves in a widening crackdown on vaping, as officials warned that sweet flavors had drawn millions of children into nicotine addiction.",
    "President Donald Trump and top U.S. officials expressed concern about surging teenage use of e-cigarettes, and the move  comes as health officials are investigating a handful of deaths and potentially hundreds of lung illnesses tied to vaping.",
    "\"Once the FDA would finalize this guidance, we would begin enforcement actions to remove all such products from the marketplace,\" Azar told reporters during a meeting with the president and first lady Melania Trump in the Oval Office.",
    "The ban would include mint and menthol flavoring as well as bubble gum, candy, fruit, alcohol and other flavors, he said.",
    "Tobacco flavoring would be allowed to remain, subject to companies' filing for approval from the FDA. Even that would be at risk if the government determined children were attracted to it or that it was being marketed to them, Azar said.",
    "The move is the most sweeping action yet by the U.S. government to crack down on what it has called an \"epidemic\" of youth e-cigarette usage.",
    "The FDA in March formally proposed guidelines that would prohibit the sale of flavored e-cigarette products, except mint and menthol, in traditional retail outlets. Under that proposal, which had not been finalized, e-cigarette makers could still sell flavored products online and in age-restricted stores, such as vape shops.",
    "Wednesday's proposal goes much further, banning the sale of all flavored e-cigarette products across all retail channels, aside from tobacco-flavored products.",
    "Despite the increased public attention around teenage e-cigarette use over the last year, HHS on Wednesday pointed to data showing that the problem has worsened. Preliminary data shows more than a quarter of U.S. high school students used e-cigarettes in the past 30 days. That is up from 20.8% last year and 11.7% in 2017.",
    "Six deaths have been linked to vaping and U.S. public health officials are investigating 450 cases of potential vaping-related lung illness across 33 states and one U.S. territory. Health officials have cited patients' use of cannabis liquids in many, though not all, of those cases, some of which only involved nicotine vaping. ",
    "\"We have a problem in our country, it's a new problem ... and it's called vaping, especially vaping as it pertains to innocent children,\" Trump told reporters in the Oval Office.  \"There have been deaths and there have been a lot of other problems.\"",
    "SURGE IN USE BY ADOLESCENTS",
    "Juul Labs Inc, which dominates the U.S. e-cigarette market, has faced withering criticism over the last two years after becoming wildly popular among teenagers. The company has taken steps to try to reduce its appeal among youth, including pulling flavors except mint and menthol from traditional retail stores, suspending its social media accounts and toughening age verification online.",
    "In December, Marlboro maker Altria Group Inc  made a $12.8 billion investment in Juul, taking a 35% stake.",
    "Juul spokesman Ted Kwong said \"we strongly agree with the need for aggressive category-wide action on flavored products,\" adding the company \"will fully comply with the final FDA policy when effective.\"",
    "A spokesman for Imperial Brands Plc , which sells the Blu line of e-cigarettes, declined to comment.",
    "Kaelan Hollon, a spokeswoman for R.J. Reynolds Tobacco Co  , which sells Vuse e-cigarettes in the United States, did not directly address the proposed flavor ban but said the company shares the administration's goal of keeping products away from youth.",
    "Wednesday's move by the White House comes after more than a year of mounting pressure from lawmakers, public health advocates and parents looking to end marketing of products aimed at youth.",
    "In recent months state and local governments have also stepped in. In June, San Francisco approved a ban on the sale of all e-cigarette products, and last week Michigan Governor Gretchen Whitmer announced plans to ban flavored e-cigarettes in her state.",
    "A nationwide investigation led by the U.S. Centers for Disease Control and Prevention and the FDA has not definitively linked the illnesses to any specific e-cigarette product or ingredient, although health officials have expressed suspicions about the effects of inhaling vitamin E acetate, which is contained in some THC vaping products. ",
    "The FDA has urged consumers to avoid inhaling vitamin E acetate, buying vaping products on the street, using marijuana-derived oil with the products or modifying a store-bought vape product.",
    "While e-cigarettes are marketed as tools to help smokers quit, health officials believe some companies are attracting a new generation of nicotine users.",
    "Azar said recent data showed a surge in adolescent usage of e-cigarettes and that youth were drawn to flavors including mint and menthol. About 8 million U.S. adults use such cigarettes and 5 million children were doing so as well.",
    "\"This is exceptionally harmful to our children,\" he said. \"An entire generation of children risk becoming addicted to nicotine because of the attractiveness ... and availability of these vaping products.\"",
    "E-cigarette makers will still have the chance to demonstrate their flavored products serve a public health purpose.",
    "All such companies are required to submit applications to the FDA by next May demonstrating their products and proposed flavors provide a net public health benefit. The FDA, after reviewing those applications, could authorize companies to sell flavored products if the agency is satisfied with the proposals."
  ],
  "published_datetime": "2019-09-11 01:30:00"
}