{
  "url": "https://www.nasdaq.com/article/msci-set-to-buy-carbon-delta-boosts-climate-risk-management-revised-cm1210859",
  "title": "MSCI Set to Buy Carbon Delta, Boosts Climate Risk Management (Revised) - Nasdaq.com",
  "text": [
    "MSCI Inc.MSCI recently announced that it has signed an agreement to acquire data analytics firm Carbon Delta AG through its subsidiary MSCI Barra Sarl, riding on the wave of consolidation among climate risk data providers.\r\n While the terms of the deal were not disclosed, the business is expected to add approximately $4 million to $5 million of yearly recurring expenses. The purchase will be funded through existing cash on hand.\r\n Per the announcement, the transaction is expected to close by the end of the next month, subject to fulfillment of customary closing conditions. MSCI's Climate Risk Center in Zurich will be the focal point for the development of climate change risk analytics and tools.",
    "MSCI Inc Price and Consensus",
    "MSCI Inc price-consensus-chart | MSCI Inc Quote",
    "Growing Demand for Climate Scenario Analysis\r\n Demand for climate scenario analysis is expected increase as more companies and investors adopt the recommendations of the Financial Stability Board-appointed Task Force on Climate-related Financial Disclosures (TCFD).\r\n The TCFD called for scenario analysis to help assess the physical risks of climate change and transition risks caused by changes in shift to a low-carbon economy.\r\n Per Principles for Responsible Investment (PRI) report , 591 investors signatories with $49 trillion in asset voluntarily reported indicators to risk related to climate change, an increase of 111 investor signatories reporting and describing their work in 2018.\r\n Zurich-based Carbon Delta, which was founded in 2015, uses scenario analysis to generate data that helps assess the physical and transition climate risks faced by listed companies. Carbon Delta is the only provider in the market assessing both climate and transition risks.\r\n Per another PRI report , Carbon Delta's database with climate change analysis for over 22,000 publicly-listed companies covers equities and corporate bonds with a total of over 300,000 securities. Carbon Delta's climate change scenario modelling uses a hybrid top-down and bottom-up approach.\r\n MSCI, which is one of the biggest providers of environmental, social and governance (ESG) data, will add Carbon Delta's Carbon Value at Risk (CVaR) model to its range of Climate Solutions, which include carbon footprinting, exposure to cleantech, and an analysis of transition risks.Other Consolidations in ESG Data Market\r\n Per a Bloomberg report , Moody's recently bought California-based provider of physical climate risk, Four Twenty Seven after acquiring ESG data provider Vigeo-Eiris.\r\n Other recent examples of consolidation in the ESG data space include London Stock Exchange Group's (LSE) acquisition of France-based sovereign bond specialist Beyond Ratings. Per a Reuters report , the deal was aimed at meeting the growing demand for ESG products.\r\n Additionally, Institutional Shareholder Services purchased Oekom Research last year while Morningstar acquired a substantial stake in Sustainalytics.Wrapping Up\r\n We note that the series of acquisitions reflects the growing demand for related solutions in ESG data market. MSCI's acquisition of Carbon Delta is expected to help it provide extensive climate risk assessment and reporting capabilities to institutional market and assist investors with climate risk disclosure requirements.Zacks Rank & Stocks to Consider\r\n Currently, MSCI carries a Zacks Rank #3 (Hold).\r\n A few better-ranked stocks that can be considered in the broader technology sector include Paylocity Holding PCTY , RingCentral RNG and Cirrus Logic CRUS . All the stocks sport a Zacks Rank #1 (Strong Buy). You can see the complete list of today's Zacks #1 Rank stocks here .\r\n Long-term earnings growth rate for Paylocity, RingCentral and Cirrus Logic is currently pegged at 20%, 16.32% and 15%, respectively.(We are reissuing this article to correct a mistake. The original article, issued on September 10, 2019, should no longer be relied upon.)",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 06:26:00"
}