{
  "url": "https://www.nasdaq.com/article/blackberrys-patent-cases-against-facebook-and-snap-are-crumbling-cm1210627",
  "title": "BlackBerry’s Patent Cases Against Facebook and Snap Are Crumbling - Nasdaq.com",
  "text": [
    "Back in early 2018, BlackBerry (NYSE: BB) sued Facebook (NASDAQ: FB) and Snap (NYSE: SNAP) over allegedly violating seven patents for BlackBerry Messenger (BBM), which cover timestamps, message notifications, push notifications for ads, tagging photos, and mapping activities. Facebook and Snap filed motions to invalidate BlackBerry's patents last June, and all the independent claims for one of the patents (regarding time stamps) were invalidated two months later.",
    "On Sept. 5, a district court in Los Angeles tentatively ruled that two of BlackBerry's other disputed patents (involving targeted ads) were ineligible for protection because they were merely \"dressing up the abstract concept of collecting and compiling information.\" The court also invalidated two additional claims for location-based patents, which were only aimed at Snapchat.",
    "Image source: Getty Images.",
    "Facebook still needs to deal with BlackBerry's other claims, including two patents for user interfaces. Snap still faces two claims, but one of them is the time stamps claim that was crippled last August. However, BlackBerry is clearly losing its firepower in both cases, and that could be bad news for one of its biggest businesses.",
    "Under CEO John Chen, who took the top job in 2013, BlackBerry gradually phased out its dying smartphone business and licensed its brand and designs to Chinese smartphone maker TCL . It focused on expanding its enterprise software ecosystem with new products and acquisitions; that strategy paid off as its revenue growth turned positive again over the past two quarters.",
    "To boost its margins throughout that transition, BlackBerry aggressively monetized its portfolio of about 44,000 patents by launching a flurry of lawsuits against Facebook, Snap, Twitter , Nokia , Cisco , and even Ryan Seacrest (over the creation of an iPhone case with a BlackBerry keyboard).",
    "Therefore, BlackBerry's cases against Facebook and Snap aren't about protecting BBM. BlackBerry already discontinued the consumer version of the app earlier this year due to tough competition from rivals like Facebook Messenger. Instead, BlackBerry is suing Facebook and Snap to feed the growth of its licensing and IP business, which has become a high-margin growth engine in recent quarters:",
    "Source: BlackBerry quarterly reports. *Non-GAAP.",
    "BlackBerry likely knew that the court would invalidate some of its patent claims against Facebook and Snap. But if it lands just one or two blows, the payout could easily offset the legal costs and boost its licensing and IP revenue.",
    "Facebook's net income fell 49% annually to $2.62 billion last quarter due to FTC and SEC fines, associated legal expenses, and a tax hit from new IRS rules. Those troubles could continue over the next few quarters, as Facebook faces fresh antitrust probes in the U.S. and overseas. The ongoing battle with BlackBerry could exacerbate that pain.",
    "Image source: Getty Images.",
    "Snap, which hasn't ever posted a profit, posted a net loss of $255 million last quarter -- which was still an improvement from its loss of $353 million a year earlier.",
    "Snap doesn't face as many legal headwinds as Facebook, but many analysts wonder if the social network can achieve profitability before running out of cash. Snap allayed some concerns in recent quarters with its accelerating user growth and narrowing losses, but a BlackBerry victory could cause its losses to widen again.",
    "Facebook and Snap would also be forced to either pay royalties to BlackBerry or remove key features in their apps. In other words, they could be forced to choose between losing money or alienating users with redesigned apps.",
    "BlackBerry's decision to sue Facebook and Snap makes sense, even if it caused critics to denounced it as a \"patent troll.\" However, the tentative ruling indicates that BlackBerry's cases are losing steam, and investors shouldn't get their hopes up for big licensing payments from the two social media companies.",
    "10 stocks we like better than BlackBerry\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and BlackBerry wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to its CEO, Mark Zuckerberg, is a member of The Motley Fool's board of directors. Leo Sun owns shares of Cisco Systems, Facebook, and Snap Inc. The Motley Fool owns shares of and recommends BlackBerry, Facebook, and Twitter. The Motley Fool owns shares of Nokia. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:51:55"
}