{
  "url": "https://www.nasdaq.com/article/canadas-trudeau-kicks-off-tough-reelection-campaign-faces-ethics-questions-20190911-00620",
  "title": "Canada's Trudeau kicks off tough re-election campaign, faces ethics questions - Nasdaq.com",
  "text": [
    "By David Ljunggren",
    "OTTAWA, Sept 11 (Reuters) - Canadian Prime Minister Justin Trudeau kicked off a challenging six-week re-election campaign on Wednesday and immediately faced new questions about a nagging ethics scandal that could cut support for his Liberal Party.",
    "Trudeau, who swept to office in November 2015 promising \"sunny ways\" and stressing the importance of gender equality and the environment, faces an electorate more focused on the economy and affordability when it votes on Oct 21.",
    "The 47-year-old married father of three, whose colorful socks and classic good looks are often splashed across the international media, may have history on his side. Not since 1935 has a Canadian prime minister who won a parliamentary majority in his first term been booted from office in the next election.",
    "But polls strongly suggest Trudeau may not win enough seats to govern by himself after a series of missteps that called into question his leadership while cutting into his once sky-high popularity. That would leave him weakened, relying on opposition members of parliament to push through legislation.",
    "Last month, a top watchdog ruled the prime minister had breached ethics rules by pressuring the former justice minister to ensure a major construction firm avoid a corruption trial. ",
    "The Royal Canadian Mounted Police are probing whether there is enough evidence to lay charges. The Globe and Mail said on Wednesday that Ottawa was limiting what potential witnesses could say.",
    "Trudeau side-stepped repeated questions about the matter on Wednesday, repeating the government's line that witnesses already had plenty of freedom to speak.",
    "Andrew Scheer, leader of the official opposition Conservative Party, said the Globe and Mail report showed Trudeau could not be trusted.",
    "\"He has lied. He has looked Canadians in the eyes and said things that he knew were not true,\" he told reporters.",
    "A Nanos Research poll released on Tuesday showed the Liberals at 34.6% and the Conservatives at 30.7%. That margin would not be enough to guarantee a majority of seats in the House of Commons. ",
    "'PUNISH THE BUMS'",
    "Liberals say they are quietly confident of victory and predict Trudeau will campaign much more effectively than Scheer, 40, who is fighting his first election as Conservative leader.",
    "But Canadian campaigns can produce major surprises. The Liberals trailed in third place when the 2015 election was called but steadily improved to pull off an outright victory.",
    "\"This is not a 'Throw the bums out' election. This is a 'Punish the bums' election,\" said Nik Nanos, head of Nanos Research.",
    "Trudeau, the son of former Liberal Prime Minister Pierre Trudeau, has broken major campaign promises by scrapping plans to introduce voter reform and allowing budget deficits to mushroom. He also angered environmentalists by buying an oil pipeline to ensure crude exports could increase. ",
    "\"For average Canadians, the key takeaway ... is that Justin Trudeau is not an exception, he's like other politicians,\" said Nanos.",
    "Liberals cite near-record low jobless numbers, booming growth and lower levels of poverty as grounds for re-election.",
    "WORLD IS WATCHING",
    "Although rivals may dismiss Trudeau's achievements, diplomats in allied countries say his focus on feminism, the environment and the need for multilateral organizations is important at a time when populism is on the rise and the United States seems intent on shrinking its global ambitions.",
    "\"We are paying very close attention. What will it mean if one of the few remaining progressive leaders is defeated?\" said an official at one major Western embassy in Ottawa.",
    "Scheer had surged after the SNC-Lavalin affair, but he appears to be struggling in Ontario, the most populous of Canada's 10 provinces, where a conservative premier is pushing through unpopular spending cuts.",
    "Major planks of the Liberal platform will include measures to address cellphone and internet bills and a limited expansion to the universal healthcare system to cover part of the cost of prescription drugs, say party insiders. "
  ],
  "published_datetime": "2019-09-11 12:18:00"
}