{
  "url": "https://www.nasdaq.com/article/why-navistar-international-michaels-companies-and-box-jumped-today-cm1207549",
  "title": "Why Navistar International, Michaels Companies, and Box Jumped Today - Nasdaq.com",
  "text": [
    " The stock market rebounded on Wednesday as investors responded   favorably to news that Hong Kong officials would back down from   hard-line positions taken against protestors. A big bounce in   crude    oil   prices    also helped lift   key players in the energy sector    . Yet some of the best gainers had special circumstances fueling   their moves higher.   Navistar International    (NYSE: NAV) ,   Michaels Companies    (NASDAQ: MIK) , and   Box    (NYSE: BOX) were among the top performers. Here's why they did so   well. Navistar drives higher Shares of Navistar International climbed 13% after the truck   and heavy equipment manufacturer reported favorable fiscal   third-quarter financials. Revenue jumped 17% compared to   year-earlier levels, with Navistar saying that a big boost to   core sales of trucks and buses in the U.S. and Canada contributed   the most to its performance. Adjusted net income soared by more   than half, and CEO Troy Clarke pointed to increases in market   share as further evidence that the company is doing well. Having   built up momentum throughout the year,   Navistar looks poised to keep benefiting    as long as economic activity remains robust in key markets.   Image source: Navistar International.makeArticleAd();  Michaels stays crafty  Michaels Companies saw its stock pick up 12%    following the arts and crafts retailer's second-quarter financial   report. Revenue fell 2% year over year on a tepid 0.3% increase   in comparable-store sales, but adjusted net income was up 12%   from year-ago levels after accounting for the charges associated   with the closing of the company's Pat Catan's store locations.   However, the stock gave up much larger gains from earlier in the   day after comments from CEO Mark Cosby suggested that Michaels   remains exposed to Chinese tariffs. With uncertainty over the   possibility of yet more trade duties coming into effect later   this year, Michaels will have to prepare for whatever happens on   that front. Box attracts activists Finally,   shares of Box rose 12%    . The cloud storage company got interest from activist investors   at Starboard Value, which disclosed that it had taken a 7.5%   equity stake in Box. Starboard didn't go into great detail about   its plans for Box, simply saying that it believes that the cloud   company isn't fully valued at current prices. Box was equally   terse about its anticipated reaction to the news, only saying   that it's looking to keep building up its presence in cloud   content management. Even after the move, shares essentially   haven't done anything since the beginning of 2015, and that could   explain why Starboard thinks there's potential upside to taking   action.   Offer from The Motley Fool: The 10 best stocks to buy     now            Motley Fool co-founders Tom and David Gardner have spent more     than a decade beating the market. In fact, the newsletter they     run,     Motley Fool Stock Advisor      , has quadrupled the S&P 500!* Tom and David just revealed their ten top stock picks for     investors to buy right now.  Click here to get access to the full       list!   *      Stock Advisor     returns as of June 1, 2019.     Dan Caplinger      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Box. The Motley Fool recommends     The Michaels Companies. The Motley Fool has a     disclosure policy      .  ",
    "The stock market rebounded on Wednesday as investors responded   favorably to news that Hong Kong officials would back down from   hard-line positions taken against protestors. A big bounce in   crude    oil   prices    also helped lift   key players in the energy sector    . Yet some of the best gainers had special circumstances fueling   their moves higher.   Navistar International    (NYSE: NAV) ,   Michaels Companies    (NASDAQ: MIK) , and   Box    (NYSE: BOX) were among the top performers. Here's why they did so   well.",
    "Shares of Navistar International climbed 13% after the truck   and heavy equipment manufacturer reported favorable fiscal   third-quarter financials. Revenue jumped 17% compared to   year-earlier levels, with Navistar saying that a big boost to   core sales of trucks and buses in the U.S. and Canada contributed   the most to its performance. Adjusted net income soared by more   than half, and CEO Troy Clarke pointed to increases in market   share as further evidence that the company is doing well. Having   built up momentum throughout the year,   Navistar looks poised to keep benefiting    as long as economic activity remains robust in key markets.",
    "  Image source: Navistar International.makeArticleAd(); ",
    "Image source: Navistar International.",
    " Michaels Companies saw its stock pick up 12%    following the arts and crafts retailer's second-quarter financial   report. Revenue fell 2% year over year on a tepid 0.3% increase   in comparable-store sales, but adjusted net income was up 12%   from year-ago levels after accounting for the charges associated   with the closing of the company's Pat Catan's store locations.   However, the stock gave up much larger gains from earlier in the   day after comments from CEO Mark Cosby suggested that Michaels   remains exposed to Chinese tariffs. With uncertainty over the   possibility of yet more trade duties coming into effect later   this year, Michaels will have to prepare for whatever happens on   that front.",
    "Finally,   shares of Box rose 12%    . The cloud storage company got interest from activist investors   at Starboard Value, which disclosed that it had taken a 7.5%   equity stake in Box. Starboard didn't go into great detail about   its plans for Box, simply saying that it believes that the cloud   company isn't fully valued at current prices. Box was equally   terse about its anticipated reaction to the news, only saying   that it's looking to keep building up its presence in cloud   content management. Even after the move, shares essentially   haven't done anything since the beginning of 2015, and that could   explain why Starboard thinks there's potential upside to taking   action.",
    "  Offer from The Motley Fool: The 10 best stocks to buy     now            Motley Fool co-founders Tom and David Gardner have spent more     than a decade beating the market. In fact, the newsletter they     run,     Motley Fool Stock Advisor      , has quadrupled the S&P 500!* Tom and David just revealed their ten top stock picks for     investors to buy right now.  Click here to get access to the full       list!   *      Stock Advisor     returns as of June 1, 2019.  ",
    " Offer from The Motley Fool: The 10 best stocks to buy     now            Motley Fool co-founders Tom and David Gardner have spent more     than a decade beating the market. In fact, the newsletter they     run,     Motley Fool Stock Advisor      , has quadrupled the S&P 500!*",
    "Tom and David just revealed their ten top stock picks for     investors to buy right now.",
    " Click here to get access to the full       list! ",
    " *      Stock Advisor     returns as of June 1, 2019. ",
    "  Dan Caplinger      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Box. The Motley Fool recommends     The Michaels Companies. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 04:30:00"
}