{
  "url": "https://www.nasdaq.com/article/how-mall-operator-pennsylvania-reit-has-weathered-the-retail-apocalypse-cm1206894",
  "title": "How Mall Operator Pennsylvania REIT Has Weathered the Retail Apocalypse - Nasdaq.com",
  "text": [
    "Pennsylvania Real Estate Investment Trust (NYSE: PEI) or PREIT, has been hit particularly hard by the wave of retail bankruptcies commonly referred to as the retail apocalypse . It's a shopping mall operator with ownership interests in properties across the United States, and significant exposure to chains including SearsHoldings , Macy's , and J.C. Penney . As such, it's had to use creative means to adjust for the current retail reality.",
    "Shareholders may have caught a lucky break. Back in 2012, a new management team took control and had the foresight to divest its lower-value mall assets. The idea was to focus on properties with higher sales per square foot, which are more attractive to retailers and can garner better rental rates.",
    "When this divestment process started in 2013, PREIT managed 38 malls with average sales per square foot of $379. After years of selling properties, the company now manages 21 properties with average sales per square foot of $525.",
    "It still lists three malls as \"noncore\" and could also sell these assets in part or whole. It owns the Valley View Mall and the Wyoming Valley Mall in Wilkes-Barre, Pennsylvania, which both have significant vacancies that it has been unable to fill, and the Exton Square Mall in Exton, Pennsylvania, where it was able to sell a land parcel to be developed into an apartment complex. Given the poor state of these three malls, it is also possible that they will just be written off or abandoned entirely.",
    "Pennsylvania REIT has actively managed its portfolio to adjust to where it sees the most value accruing. Shareholders should continue to expect the company to monetize its assets through a sale where it can.",
    "Image source: Getty Images.",
    "Industrywide disruption at retailers has led to a number of bankruptcies from department stores and niche chains. Other retailers such as Macy's and Chico's  have also pulled back by closing stores.",
    "To replace its lost tenants, PREIT has redeveloped much of what formerly was occupied by department stores into gyms, movie theaters, grocery stores, and smaller retail spaces. Over the past few years, the company has successfully repositioned 13 former department stores with over 25 new occupants.",
    "Examples of redeveloped stores include turning a former JCPenny into a movie theater complex at the Willow Grove Park complex in Willow Grove, Pennsylvania, and turning a former Sears into three new stores at the Moorestown Mall in Moorestown, N.J.",
    "But such redevelopment requires capital investment; the JC Penny project at Willow Grove Park cost the company approximately $28 million, while redeveloping the Sears at Moorestown Mall cost $29 million.",
    "Cash isn't plentiful for PREIT. The company has had to borrow aggressively to fund its redevelopment activity in addition to selling its noncore malls, and it is betting that it will be able to generate an attractive rate of return on these new developments. Many projects are still underway, so it is too early to judge if the strategy will bear fruit.",
    "Densification is yet another tool for shopping mall operators to maximize the value of their assets. It refers to a shopping mall redeveloping some of its real estate into other types of property, including residential apartments, hotels, or offices.",
    "Those who have been paying attention to the REIT section are probably aware of the significant push that mall operators includingSimon Property Group  have made into densification. These projects generally involve partnering with a specialized developer or just selling the land to another real estate company in order to get a project done and monetize some real estate value.",
    "In the case of PREIT, the company has used joint ventures or sold land to redevelop for nonretail purposes.",
    "PREIT has a 50/50 joint venture with fellow shopping center REIT Macerich  to redevelop a mall in downtown Philadelphia formerly known as The Gallery into the Fashion District Philadephia. It is adjacent to a convention center and popular tourist attractions and will contain various entertainment facilities in addition to a shopping mall. PREIT has also sold land at its Exton Square Mall to a developer to build apartments.",
    "The company has more densification plans and expects to yield as much as $300 million in potential asset sales as part of these projects.",
    "Image source: Getty Images.",
    "It is not in an enviable position. The company has seen its occupancy rate decline and has had to pony up to invest in redeveloping several former anchor spaces. This has put pressure on cash flows, which have also declined, and on its balance sheet, which has seen leverage increase.",
    "Although the company has attracted new tenants with its redevelopment efforts, the driving factor of success will be shoppers coming back to once-vacant malls. Densification efforts are also interesting but still too early to judge.",
    "Executing a turnaround won't be easy given the broader industry trends that the company is fighting. But PREIT has laid out a cogent plan to reposition itself for the future of retail, and it has a good shot at coming out the other end as a stronger company.",
    "10 stocks we like better than Pennsylvania REIT\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Pennsylvania REIT wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Luis Sanchez has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:32:00"
}