{
  "url": "https://www.nasdaq.com/article/focusglencores-risk-appetite-dwindles-fueling-focus-on-safer-regions-20190905-00020",
  "title": "FOCUS-Glencore's risk appetite dwindles, fueling focus on safer regions - Nasdaq.com",
  "text": [
    "By Ernest Scheyder and Barbara Lewis",
    "Sept 5 (Reuters) - Glencore Inc's  penchant for risk has long been mining industry lore, but the company is quickly expanding into a part of the world that would have been improbable just a few years ago: Minnesota.",
    "The Swiss-based commodity trader took majority control last June of PolyMet Mining Corp , which is developing a mine in the Midwest state near the Canadian border estimated to hold a century's worth of copper and nickel, critical to the development of electric vehicles.",
    "Glencore for years has operated in regions considered high-risk, high-reward, making its shares a draw for some investors who saw the more conservative investing policies of peers, including BHP Group PLC , as too tame.",
    "But displeasure from institutional investors and the electric vehicle industry with cobalt mining techniques and dangerous conditions has risen. In June, at least 41 illegal miners were killed at Glencore's Congo operations. For a FACTBOX, click ",
    "In the last year, Glencore's shares have underperformed global peers BHP and Rio Tinto , which have largely avoided the fray in part by sticking with higher margin bulk commodities, including iron ore and coking coal, both ingredients for steel-making. ",
    "\"It's hard to tell if Glencore is doing enough to mitigate risk, but they seem to be taking initiative,\" said David Neuhauser of Livermore Partners, which holds Glencore shares.",
    "Alongside Minnesota's PolyMet, Glencore has invested in Canada'sFirst Cobalt Corp  to restart an Ontario refinery, started a new copper concentrates blending facility in Taiwan, and also is searching for non-Russian sources of aluminum, expressing an interest in buying Rio's operations in Iceland.",
    "Glencore has also held very early discussions about cobalt in Kazakhstan, industry sources said, talks that come after the company said it will halt output of the metal in Congo for at least two years. ",
    "That's a sign that \"the (automakers) are paying more attention to the geography and reputation risk of their supply chain,\" forcing change at Glencore, said Frances Hudson of Aberdeen Standard, which holds the company's shares.",
    "A Glencore spokesman declined to comment for this article.",
    "A BMO Capital Markets analyst earlier this week cut its price target on Glencore, citing in part uncertainty around the company's Congo operations.",
    "Glencore said last month that its profit in the first half of the year fell 32 percent due weakness in the company's cobalt operations and sliding prices for the metal, results that sent its shares to their lowest level since 2016. ",
    "To be sure, Glencore has operated for years in Australia and other countries considered safe havens for miners.",
    "The company inked a deal this year to supply cobalt to BMW , but only cobalt produced from its Murrin Murrin mine in Australia.",
    "IRON RANGE",
    "Glencore took majority control of PolyMet in a debt-for-equity swap that boost its stake from about 30 percent of the smaller miner's shares to about 72 percent. That transaction made PolyMet debt-free.",
    "PolyMet earlier this year received the last of the permits it needs to begin construction of the open pit Northmet mine in the state's Iron Range, a rural region about 200 miles (322 km north of Minneapolis. Once operational, the mine is expected to produce 255 million tonnes of copper and nickel over the next century.",
    "A former steel mill near the deposit is being renovated to hold processing equipment. PolyMet had previously committed to providing all of its ore to Glencore.",
    "\"PolyMet has potential and has the right zip code,\" said Neuhauser of Livermore Partners.",
    "PolyMet will remain the mine's developer and operator. The company plans to produce 310 million pounds of copper annually when fully operational, about 3 percent of the copper that Glencore produced in 2018.",
    "Glencore is moving to incorporate PolyMet into its financial reporting and having it use Glencore's own auditor, Deloitte . PolyMet had previously used PricewaterhouseCoopers.",
    "Glencore, which added its longtime executive Peter Freyberg to the PolyMet board, has also begun organizing meetings with potential financiers for the project, with PolyMet needing about $1 billion to develop Northmet.",
    "Operating in the United States does present its own set of challenges. The United Steelworkers union, which represents miners in the country, has given Glencore a \"silver medal\" in \"corporate irresponsibility\" due in part to what it has labeled tax evasion and anti union-intimidation. The union says it represents 850,000 workers in the United States, though it does not break that figure down by industry.",
    "The Minnesota Center for Environmental Advocacy said Glencore's safety record \"should concern every Minnesotan.\"",
    "PolyMet Chief Executive Jon Cherry said opponents to mining were putting up a \"false choice between environment and technology.\"",
    "\"These metals will be mined somewhere in the world,\" he told Reuters. \"The discussion should be around how you mine and making sure it's done responsibly.\""
  ],
  "published_datetime": "2019-09-05 01:00:00"
}