{
  "url": "https://www.nasdaq.com/article/5-top-stock-trades-for-thursday-roku-sbux-slv-lyft-sq-cm1207653",
  "title": "5 Top Stock Trades for Thursday: ROKU, SBUX, SLV, LYFT, SQ - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Global equity markets were in a good mood on Wednesday. As tensions eased in Hong Kong, equities took flight. It leaves investors wondering if the markets can start to go higher or if the seasonally tough September will still cause some swoons. Let's look at a few top stock trades.",
    "One stock that hasn't felt any swoon? Roku (NASDAQ: ROKU ). This name has rallied so much this year it's incredible. The stock is up almost 450% in 2019 and many are wondering when the rally will end.",
    "That speculation likely only fuels the fire, but at some point it has to be true.",
    "Roku added another 8% at one point in Wednesday's session, surging to new all-time highs. The stock is now in nosebleed territory. I couldn't justify buying the name after this type of run, but that's easier to say after we've been pounding the table about Roku on InvestorPlace all year.",
    "On a pullback, ROKU may be worth a stab.",
    "Buyers stepped in at $130 last time. But when the stock is this hot, we just have to see where it ends up after it secures a high. Let's see if that comes this session, or in the next few.",
    "Roku has been a relative strength machine, as has Starbucks (NASDAQ: SBUX ). However, the latter was slipping in early Wednesday trading after the company's outlook disappointed investors.",
    "This one is interesting. On the plus side, investors bid up the name off its lows, which came on a near test of the 50-day moving average. On the downside, its ascending triangle pattern has failed to materialize.",
    "SBUX can still be friendly to longs, but will need to take out $97.50 on the upside. On the downside, watch the 50-day moving average and Wednesday's lows.",
    "Shares of Lyft (NASDAQ: LYFT ) were all over the place on Wednesday, but in a good way. The stock opened higher on the day, but quickly took out Tuesday's low, making new 52-week lows.",
    "This was an excellent green-to-red trade, and one we were watching ahead of the open.",
    "However, LYFT then went positive on the day, giving investors an excellent two-way trade as it reversed higher. Nimble traders could short the green-to-red move and then buy the reversal.",
    "Investors who are long can use Wednesday's low as their stop and look for a rebound up toward $47.50, where it will find a notable level as well as channel resistance. Above it and a move to the 20-day moving average is possible.",
    "The iShares Silver Trust (NYSEARCA: SLV ) ripped another 2% on Wednesday and while \"ripped\" may seem like an exaggerated description, consider the move over the past few weeks.",
    "Up eight of the last nine weeks, SLV has been a beast. Over $17.50 is significant, and opens the door to $18.90+. However, the ETF is quite overbought. That's not to say momentum can't continue, but it's something to consider for those looking at new positions.",
    "Those who are long may consider raising their stop losses.",
    "Despite a bevy of upgrades, Square (NYSE: SQ ) stock isn't trading all that well. The stock is now forming a series of lower highs (blue line), while support is noted at $60.",
    "Below $60 opens up the door to a decline down to $50, although buyers could step in before then too.",
    "If SQ can push through downtrend resistance, the 20-day moving average is the first upside target, followed by the 200-day near $70.",
    "Bret Kenwell is the manager and author of Future Blue Chips and is on Twitter @BretKenwell . As of this writing, Bret Kenwell was long SBUX. ",
    "The post 5 Top Stock Trades for Thursday: ROKU, SBUX, SLV, LYFT, SQ appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 04:10:09"
}