{
  "url": "https://www.nasdaq.com/article/oxford-industries-inc-oxm-q2-2019-earnings-call-transcript-cm1210823",
  "title": "Oxford Industries Inc (OXM) Q2 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   Oxford Industries Inc    (NYSE: OXM)        Q2 2019 Earnings Call       Sep 11, 2019 ,   4:30 p.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Greetings. And welcome to the Oxford Industries Second Quarter   Fiscal 2019 Earnings Conference Call. At this time, all   participants are in a listen-only mode. A question-and-answer   session will follow the formal presentation [Operator   instructions]. As a reminder, this conference is being   recorded. I would now like to turn the conference over to your host,   Anne Shoemaker, Treasurer. Please go ahead.  Anne M. Shoemaker    --   Vice President of Capital Markets and Treasurer  Thank you and good afternoon. Before we begin, I would like to   remind participants that certain statements made on today's call   and in the Q&A session may constitute forward-looking   statements within the meaning of the federal securities laws.   Forward-looking statements are not guarantees, and the actual   results may differ materially from those expressed or implied in   the forward-looking statements. Important factors that could   cause actual results of operations or our financial condition to   differ are discussed in our press release issued earlier today,   and in documents filed by us with the SEC, including the risk   factors contained in our Form 10-K. We undertake no duty to update any forward-looking statements.   During this call, we will be discussing certain non-GAAP   financial measures. You can find a reconciliation of non-GAAP to   GAAP financial measures in our press release issued earlier   today, which is posted under the Investor Relations tab of our   website at oxfordinc.com. Please note that all financial results   and outlook information discussed on this call, unless otherwise   noted, are from continuing operations, and all per-share amounts   are on a diluted basis. Our disclosures about comparable sales include sales from our   full-price stores and e-commerce sites, and excludes sales   associated with outlet stores and e-commerce/clearance sales. And   now I'd like to introduce today's calls participants. With me   today are Tom Chubb, Chairman and CEO; and Scott Grassmyer, CFO.   Thank you for your attention. And now I'd like to turn the call   over to Tom Chubb.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Thank you for joining us this afternoon. I want to start   today's call by taking a moment to remember and honor the victims   of 9/11, their families, as well as the survivors and first   responders. That tragic day will always serve as a reminder of   our country's resilience and the strength of the American   spirit. Our second quarter performance included top and bottom line   results that were within our guidance ranges, despite some   marketplace headwinds. Our strategy of operating a powerful   portfolio of lifestyle brands like Tommy Bahama, Lilly Pulitzer   and Southern Tide and emphasizing full price direct-to-consumer   channels continues to produce, enhance profitability and drive   long term shareholder value. I am pleased to report that for the   10th consecutive quarter, we posted consolidated comparable sales   growth and expanded consolidated gross margin and operating   margin in the quarter. To win with today's highly informed and empowered consumer,   you need to have a brand that stands for something, a lifestyle   or culture that resonates with your target audience. And you have   to reinforce that lifestyle and culture in everything you do from   product and marketing to service and distribution. This is the   Oxford approach and the foundation for the company's ongoing   success. Looking at each of our channels in more detail, the growth of   our e-commerce business continues to be a highlight of Oxford's   modern distribution network. Our high average ticket, high gross   margin, modest return rates and efficient distribution centers   make this a very profitable channel. E-commerce represents 22% of   our consolidated sales on a trailing 12 month basis, up from 20%   this time a year ago, and remains our fastest growing channel of   distribution. At the same time, our unique combination of bricks and mortar   retail stores, restaurants and bars remain strategically   important. These physical assets allow us to showcase the true   nature of our brands through a very compelling in-store   experience that features beautiful brand appropriate build-outs   and friendly staff that provide superior service levels. For   these reasons, our stores are very important to not only driving   sales, but also communicating our brand message and acquiring new   customers. We continue to invest in carefully curated brick and mortar   locations, and late in 2019, we will be opening two new Tommy   Bahama Marlin Bar locations, a Lilly Pulitzer store in Palm   Desert, California, and our first company owned Southern Tide   retail store in Jacksonville, Florida. As part of our strategy to strengthen our brands for the long   term, we continue to cultivate relationships with select   specialty retailers, licensed Signature Stores and online   retailers who are helping elevate our wholesale presence. At the   same time, we are finding fewer opportunities for mutually   beneficial relationships with department stores, which excluding   Lanier Apparel, now represent only 10% of consolidated sales. As   department stores continue to adjust to changes in the   marketplace, we believe our lack and dependence on this channel   for our Tommy Bahama, Lilly Pulitzer and Southern Tide brands   further differentiates Oxford from its peers. On the communications front, we continue to evolve our tactics   to stay front and center of our consumer. It is a multipronged   approach. While digital and social media, anchored by our   beautiful websites, have moved to the forefront of our marketing   strategy, our catalogs continue to energize our consumers and act   as measurable calls to action. Meanwhile, events such as Lilly   Pulitzer's three days flash clearance sale, which ends tonight,   generate a lot of brand excitement for both existing customers   and those just getting to know the brand. We plan this year's   sale to be comparable to last year, and while results are not   final yet, we are happy with the results to this point. Regardless of how well we position our brands or how clear and   compelling our messaging is, without great product, the operating   model simply does not work. Therefore, we have purposefully   constructed Tommy Bahama, Lilly Pulitzer and Southern Tide as   commercially informed but design-led businesses. Being design-led   allows us to generate the compelling, innovative and   differentiated product that resonates with our consumer and   ultimately gets her to open her wallet. 2019 has been a particularly strong year in terms of new   products and collections. Highlights have included the emerging   strengths of key high performing styles like the Palm Coast Polo   or brocade pants and shorts at Tommy Bahama, the application of   Lilly Pulitzer's beautiful prints to Luxletic wear and new and   fresh dress and sportswear silhouettes, and the expansion of   performance fabrications across Southern Tide's coastal   collection. We are quite pleased with the consumer response to   this year's offerings, which has helped fuel strong full price   selling across our brands and channels. As we move into the second half of 2019, the fundamentals of   our business remain strong. We continue to focus on executing our   consumer centric growth strategies, while working to minimize the   impact of additional tariffs on both our consumers and our   financial results. As I mentioned on our last call, we have had   success in negotiating price reductions on goods produced in   China and will continue to shift production to other   countries. We were also able to accelerate deliveries of some product   ahead of the September first tariff increase and have made a   handful of carefully selected pricing increases. While we have   revised our outlook for the year to reflect the increased cost of   goods associated with these tariffs on the back half of the year,   we are still on track to deliver solid results in 2019. I am   confident that the strength of our dynamic portfolio of iconic   brands, our talented people and our balance sheet and capital   structure have Oxford well positioned to deliver sustained   success over the long term. I'll now turn the call over to Scott for more details on our   results and plans for the rest of 2019.  K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller  Thanks, Tom. As Tom mentioned, our full price direct business   continues to be healthy and growing. Lilly Pulitzer's top line   growth was fueled by double digit e-commerce comps and the   addition of three stores since the end of the second quarter last   year. Tommy Bahama's full price direct business also remain   strong, with a 3% comp increase on top of an 8% comp increase in   the second quarter of last year. And Southern Tide's revenue   increased 6% year-over-year, driven by growth in e-commerce.   These increases were offset by reductions in wholesale sales at   Tommy Bahama and Lanier Apparel, as well as softness in our   outlet stores, as traffic in outlet malls continues to   decline. We achieved a 40 basis point improvement in our consolidated   adjusted gross margin in the second quarter with modest expansion   in both Tommy Bahama and Lilly Pulitzer. This includes a change   in sales mix as the higher margin direct-to-consumer businesses   represented a larger portion of sales in the quarter. Adjusted   operating profit increased from $40.6 million to $41.7 million.   Our adjusted operating margin expanded at 13.8% in the second   quarter, compared to 13.4% in the second -- in the same period   last year. A higher year-over-year tax rate resulted in adjusted   ne   t earnings    increase of only 1% as compared to a 3% increase in adjusted   operating profit. Our balance sheet and capital structure remain   very strong to support our growth initiatives and   investments. On July 31st, we amended our $325 million credit facility.   This amendment extended the maturity to 2024, added a lower   pricing tier, reduced our unused line fee and other favorable   changes. As of August 3rd, 2019, we had no borrowings outstanding   compared to $25 million at the end of the second quarter of   fiscal 2018. Our cash balance increased to $31 million compared   to $7 million in the prior year. These changes were attributable   to our strong cash flow from operations. I also want to spend some time walking you through our   inventory position at the end of the second quarter. On a FIFO   basis, after adding back our $62 million of LIFO reserve to both   years, the increase was 16%. We increased stock levels on high   volume key items and replenishment programs, and accelerated the   receipt of some goods ahead of the September 1st tariffs. We   believe our increased inventory levels are appropriate for our   plans for the back half of the year. Turning to our outlook. As Tom mentioned, we have modified our   earnings estimates for the back half of the year to reflect the   impact of the recently enacted tariffs. We have estimated the   impact to be approximately $0.20 per share, with about $0.05   impacting the third quarter, and about $0.15 impacting the fourth   quarter. For the third quarter, which is our smallest quarter due to   the seasonality of our direct-to-consumer businesses, we expect   net sales in the range from $235 million to $245 million,   compared to net sales of $234 million in the prior year. On an   adjusted basis, earnings per share for the third quarter of   fiscal 2019 was expected to be between $1.11 compared to adjusted   earnings per share of $0.14 in the third quarter of fiscal   2018. For the full year, adjusted earnings per share are now   expected to be between $4.25 and $4.45. We expect net sales to   grow between $1.135 billion and $1.155 billion. This compares to   net sales of $1.107 billion in fiscal 2018, and adjusted earnings   of $4.32 per share. For fiscal 2019, our interest expense is expected to be   approximately $1.5 million, and our effective tax rate is   expected to be approximately 26% compared to 25% in fiscal 2018.   Capital expenditures in fiscal 2019, including $16 million in the   first half, are expected to be between $45 million and $50   million, primarily reflecting investments in information   technology initiatives, new retail stores and Marlin Bars and   investments to remodel existing retail stores and   restaurants. Free cash flow for fiscal 2019 is expected to cede [phonetic]   $50 million. Finally, our Board of Directors has approved a   quarterly cash dividend of $0.37 per share. Oxford has paid a   dividend every quarter since becoming a public company in   1960. Dana, we're now ready for questions. Questions and Answers:  Operator  At this time, we'll be conducting a question and answer   session. [Operator Instructions]. Our first question comes from the line of Paul Lejuez with   Citi. Please proceed with your question.  Paul Lejuez    --   Citigroup -- Analyst  Hey, thanks, guys. You mentioned the $0.20 tariff hit. I'm   curious if that is a gross number that you will still try to   offset -- you're not sure if you'll be able to? Or is it a net   number, in which case I'd be curious to know what the gross   number was and how much you were able to, to offset it? And then second, just curious if you could maybe talk a little   bit more about performance at mall versus off mall locations. You   mentioned some weakness, and outlet to be curious if you could   provide any sort of quantification as to how much the outlets   underperformed the rest of the business? Thanks.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Okay. So with respect to tariffs, that's an estimated net   impact of the higher tariffs. And that's sort of taking   everything into account. As we referred to in the call, we have   been able to get price reductions that were offsetting a   significant portion of the gross amount. I think it would be in   the neighborhood of 40%. But we are also continuing to push for   more. So the various levers that we're addressing are moving   production out of China, which we've done a lot already. We'll   continue to do more of that where we're staying in China, trying   to get the price concessions to offset some of the impact. And   then in some cases, you know, we have done some select price   increases and there will be more of that, more of that to come.   Then in terms of outlet stores. Scott, you want to.  K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller  Yeah. The outlet stores were certainly negative comps and the   traffic was weak at the outlet store. So we're certainly, I   think, feeling, you know what I think which most people in the   industry. The good news is, [indecipherable] 34 outlets in the   US. So we're not heavily outlet dependent, our outlets are mainly   clearance vehicles. So we never went down to making a lot of   goods for outlets to primary clearance vehicles. And they're   pretty small fleet of outlets, but we are seeing some   traffic.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  And Paul, you relatively known to the story that we going back   several years ago, we really curtailed any future growth of   outlets. There's still a good channel for us to clear indices and   merchandise. But we have not grown that channel. In fact, we've   actually dropped a couple over the last couple of years. So we   like our position on outlets. We don't think we're overexposed   there. We did see some weakness there. But I think that's one of   the strengths of our model, is that we're not overly dependent on   outlets.  Paul Lejuez    --   Citigroup -- Analyst  Yeah. Thank you. And how about mall versus off mall   performance?  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Well, certainly in malls, we see the traffic and off mall, you   don't necessarily see the traffic counts for the venue the same   way, but mall traffic continues to decline, as you know. And that   is one of the reasons that we're glad that we're not overly   stored and also not over represented in malls, for example. And   Tommy Bahama, less than 40% of our retail locations are mall   locations.  Paul Lejuez    --   Citigroup -- Analyst  Got you. And then if I can just one follow up. Tom, where are   you going to be at the end of the year in terms of China   sourcing? And where do you expect that number to go to the next   year?  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Scott, you want to give him --  K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller  Yeah. We were 54% last year and we begun shifting, but I think   that we'll really feel the most of the shifting in next year.   Certainly, next spring and summer, sourcing plans at China is   much smaller. So yeah, hopefully we will -- by next year we'll be   in -- more in the 40% range, maybe even less. We're continuing to   look for other countries. And we are -- we do have our China   factories, and they want to keep the business. So they are -- and   also as the dollar is getting stronger against the China   currency. You know, I think concessions will continue to come. So   that will weigh into how much we move, but we do want to   de-emphasize China more than we have so far.  Paul Lejuez    --   Citigroup -- Analyst  Okay. Thanks Scott, good luck.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Thanks, Paul.  K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller  Thanks.  Operator  Our next question comes from the line of Rak [phonetic] Patel   with Needham & Company. Please proceed with your   question.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Hi, Rak.  Rakesh Babarbhai Patel    --   Needham & Company -- Analyst  Hey, guys. Hey Tom, congrats on comping the comp.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Thank you.  Rakesh Babarbhai Patel    --   Needham & Company -- Analyst  I have a question. I have a follow up to Paul's question on   tariffs as we think about how to model 2020. On the last call,   you touched on what the impact would be on prices at the retail   level. But given the business also has wholesale and restaurant,   it's a bit tricky to back into the impact on cost. So I'm   curious, is there any way to characterize how much of your cost   of goods these tariffs will be touching?  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Well, I think the response is pretty easy. I don't believe   we're using any Chinese food resources there or liquor to speak   of. So I don't think it will impact restaurants much at all. In   the wholesale, that is one of the challenges of addressing   pricing is that we got to move that channel or try to as much as   possible and sync with retail. And that means you've got a little   longer lead time on changing prices that show up both -- on   products that show up in both wholesale and retail. But we think   we got room to move there and do what we need to do as well.  K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller  And Rak, I think if you back out our restaurants and then of   the payroll, you know, about 75% of the cost is dutiable. You   know, when you pull off the non-dutiable aspects and as the China   percent keeps coming down, now it's just under 50% that will come   down next year. And then some of the price increases we're doing,   there'll be you know, there'll be more price increases that will   affect next year. Very little is affecting this year, more will   affect next year. So that will lower the impact also, will help   mitigate the impact.  Rakesh Babarbhai Patel    --   Needham & Company -- Analyst  Can you also help us on how to think about comp share in Tommy   and Lilly in 3Q versus 4Q? Tommy, you lapped a very tough   comparison in 2Q, so I'm assuming that you still expect higher   comps in the back half. And please correct me if I'm wrong there.   And for Lilly, you're lapping a plus 15 in the third quarter from   last year. So should we be modeling a step down in 3Q and any   thoughts on 4Q?  K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller  I think our -- you know, our plan assumes for the back half of   the year sort of low single digit comp in Q3 and then mid singles   in Q4 is we -- well we got right in there.  Rakesh Babarbhai Patel    --   Needham & Company -- Analyst  Great. And my last one is on Southern Tide. So interesting   development with the owned retail strategy. What gives you   conviction that now is the right time to expand and any high   level thoughts on what you see as the market opportunity for   stores?  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  You know, I think well you don't want to get too far ahead of   ourselves on what the market opportunity is, although a guy like   you can pretty easily imagine, you know, what it might be. I   think where our confidence is coming and why we've decided now is   the time is that, we have had good success with the Signature   Stores. The line has developed and matured to the point where we   think it can fill out a retail store nicely. And then you look at   the strength of our e-commerce business and the fact that the   guest is responding to us. They love the brand. They love the   product. And when we give them an opportunity to buy it direct   from us, that becomes another important channel for them.   Wholesale will still be important. E-commerce will still be   important. But we think there is a good opportunity there in   company-owned retail as well.  Rakesh Babarbhai Patel    --   Needham & Company -- Analyst  Thanks very much. Good luck this fall.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Thanks a lot, Rak.  Operator  Our next question comes from the line of Susan Anderson with   B. Riley FBR. Please proceed with your question.  Carlin Lynch    --   B. Riley FBR, Inc. -- Analyst  Hi, guys. This is Carlin Lynch on for Susan. I just wanted to   follow up on something you had just said on the Tommy comps in   the back half. With the business, you know, being as strong as it   is, how much more room do you see for margin improvement? And   what are the steps that the company is taking to kind of drive   that expansion, especially in the fourth quarter with the mid   single digit comp?  K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller  Yeah. Yeah, Tommy Bahama operating margin improvement has been   -- continues to be a high priority. First, you know, we've made   some progress in a cleaning up [indecipherable] last year, we   have gotten our initial gross margins. We continue to work on   trying to get those higher. Obviously, the tariff situation puts   a, you know, a little pause on that as we're navigating through   that. And we continue to grow a really healthy,   direct-to-consumer business. So I think Tommy Bahama's operating   margins have room to expand. And yeah, hopefully each year we   will make some steady progress toward that goal.  Carlin Lynch    --   B. Riley FBR, Inc. -- Analyst  Got it. Got it. And I just wanted to kind of touch on some of   the new categories that you guys have been adding to or expanding   over the course of the last year, whether it's golf, swim,   tennis. How are those performing relative to your initial   expectations? You know, is tariffs kind of impacting that in any   way? And as you think about the broader portfolio, are there any   other gaps in the merchandise that you see the need to fill in or   kind of glaring holes? Thanks.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  So we've been really pleased with the performance. I think   you're talking about Lilly Pulitzer in specific, where we've   added swim, golf and tennis within the last year. That's part of   a broader category really that we would think of, as we call it   Luxletic that's really activewear. Within Lilly Pulitzer, we'd   been thrilled with the way it's performed. Golf and tennis and   swim, each of those by themselves are pretty small, but when you   look at that whole activewear round within Lilly Pulitzer, it's   become a, you know, pretty meaningful piece of the overall pie.   And then to answer the second part of your question, I don't   think that's been impacted any worse than any other part of the   business by the China tariff situation. It's certainly not exempt   from it. But I don't think it's necessarily been hit any harder   than that. And then in terms of new categories, we're always looking for   opportunities and white spaces that we think we can fill, not   prepared to announce anything at the moment. But that's always an   objective in all of our businesses, is to look for new areas that   we can go into and a great example of that is Tommy Bahama, where   it's great as that business is, and it's great as it had been for   a very long time. We've never had the strongest sort of key item   type business. And now with things like the brocade pants and   shorts, which is really our whole family of bottoms products, we   really built a franchise there. The Palm Coast Polo was our first foray into a true   performance Polo, and I believe it's become our number one   selling Polo and is, you know, it's just got tremendous legs. And   then over the last couple of years, we build another of others in   Tommy Bahama. So we're always looking for those opportunities.   And I think we'll continue to discover new ones each year.  Carlin Lynch    --   B. Riley FBR, Inc. -- Analyst  All right. Thanks, guys.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Thanks a lot.  Operator  Our next question comes from the line of Dana Telsey with   Telsey Advisory Group. Please proceed with your question.  Dana Telsey    --   Telsey Advisory Group -- Analyst  Good afternoon, everyone. As you think of the current retail   environment beyond tariffs going into the balance of the third   quarter and into the fourth quarter, what are the biggest puts   and takes that you see could be the differences between this year   and last year, in relation to the consumer, and in relation to   your business initiative? Thank you.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  So in relation to the consumer, look we know there's a lot of   noise out there about, you know, where the economy is headed. But   if you look at the consumer themselves, unemployment numbers are   still incredibly good and favorable. A number of people working   full time is the highest it's been since, you know, before the   Great Recession. Wage growth is over 4% on a trailing 12 month   basis. You look at all these things, the savings rates are   actually still quite high. Gas prices are favorable. You just   look and the list goes on and on and on. So I believe there's   significant reason to believe that the economy is going to remain   strong for the next 12 months, and that the consumers are going   to remain strong. And that's certainly what we've factored in to,   you know, our plans for the fourth quarter. I'm not sure if that   answered everything you asked.  Dana Telsey    --   Telsey Advisory Group -- Analyst  And as you think of each brand in terms of whether it's Lilly,   whether it's Tommy, is there marketing, is there a new product   that we should look to in terms of driving the excitement as we   go through the balance of the year? And then how do you think   about inventory levels as we move through the year?  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Yes. I'll let Scott comment on the inventory levels in a   minute. But in terms of marketing and new products, we do have   and we'll talk about this more on our December call, as we're   closer to the heart of the holiday season. But in Tommy in   particular in women's, we have a number of new products coming   this fall. We've got some that are already out, some that are   coming a little bit later that we're very excited about. They're   more seasonally appropriate than I think we've ever been in Tommy   Bahama women. So we've got more things with sleeves, more warm   and kind of cozy product that's on the way. So we're very excited about that. And in terms of marketing, I   don't think we have any initiative that's like a new technique.   But we are going to be doing some things a little bit   differently. Not all of that is fully crystallized at the moment,   but we would anticipate having at least one extra mail I think in   Tommy Bahama during the fall holiday season. You know, those are   very important for us. And then, you know, we're going to mix up   the cadence a little bit and make some tweaks to our marketing   activities. But we've got lots of things that we're excited about   in terms of what we're doing. And then we still think there's   good reason to believe that the consumer is in a good position to   spend money at holiday time.  K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller  As far as inventory, Dana, inventory is up 16% year-over-year.   But if you really build the inventory back, it's not an aged   inventory increase. It's really mostly key items in replenishment   type program, things like the [indecipherable] where we were   breaking some last year, we're in good stock there where we can   replenish our stores and we're in stock on e-comm. We've got some   other key items and merchandising wise, we're trying to stress   key items in both men's and women's at Tommy and that is a   healthy inventory to be up some. But we feel good about the   inventory levels and compensation out of the inventory.  Dana Telsey    --   Telsey Advisory Group -- Analyst  And is there anything besides -- besides -- excluding tariffs,   anything on the expense pockets in the back half of the year and   what do you think is comparable to last year?  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Yeah, we got arrived a couple of things in the second quarter.   If you -- in case you missed it, as Scott told out, we had a   higher tax rate that created about a $0.045 drag and I think the   way we'd think about that tax rate is it's more than normal. Last   year was unusual, but it was favorable to us. And then in Q3 and   Q4, we got some of the Marlin Bars pre-opening expenses that are   what Scott --  K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller  $0.04 in Q3 and about $0.05 in Q4. And the Marlin Bars is it's   not just the two where I mean this year it's about a six month   lead time. So that round, even if we're in a free rent period,   the rent goes to our P&L from the time we take possession. So   we're going to have five different Marlin Bars running through   some pre-opening expense through this fiscal year. So that's   causing a little bit of a headwind expense wise.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Yeah. So, you know, it's all baked into the guidance. But to   answer your question, there are a couple of things that are   year-over-year drags on the bottom line.  Dana Telsey    --   Telsey Advisory Group -- Analyst  Thank you.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Thank you, Dana.  Operator  Our next question comes from the line of Steve Marotta with   CLK & Associates. Please proceed with your question.  Steven Louis Marotta    --   CL King & Associates, Inc. -- Analyst  Good afternoon, Tom and Scott. As far as the discretionary   spend expectations go for the balance of the year, were there any   changes in the annual guidance associated with deltas in   discretionary spend either up or down? Or was that $0.20, 100%   wholly tariffs?  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  That's all tariffs. That $0.20 is all tariffs.  Steven Louis Marotta    --   CL King & Associates, Inc. -- Analyst  And so there again, there was no changes in discretionary   spend from the last time you spoke to the Street on guidance.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Correct.  K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller  That's right.  Steven Louis Marotta    --   CL King & Associates, Inc. -- Analyst  Great. And my second question is, as it pertains specifically   to the Q3 comp guidance, is there any acceleration in the   business expected between now and the balance of the quarter? Or   is it more or less it's steady as she goes?  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Not really. It's steady as she goes. I think right now we're   tracking really right where we would -- what we would need to do   for the quarter.  Steven Louis Marotta    --   CL King & Associates, Inc. -- Analyst  Yeah. Helpful. Thank you very much.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  You got it. Thank you.  Operator  Our next question comes from the line of Edward Yruma with   KeyBanc Capital Markets. Please proceed with your question.  K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller  Hi, Eric.  Edward Yruma    --   KeyBanc Capital Markets -- Analyst  Hey, how are you guys? Thanks very much for taking the   questions today. I guess first, since you used outlets as your   promotional vehicle or your disposition vehicle, I guess, you   know, are you seeing inventory backing up in outlets, given some   of the commentary you had? Or do you expect a kind of clearance   for them in due course? And then second, as we step back and   think about the overall promotional strategy, either the Bounce   Back or the Lilly sale, I know you indicated you may make some   tweaks to marketing or some strategies? Are you changing   promotional strategy at all? And how does that impact your back   half to you? Thank you.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  So I would say, first of all, with respect to the outlets,   they are still an important clearance channel for us. But as you   know, we've developed some others over the last couple of years,   including twice a year, doing some clearance within the Tommy   Bahama stores, which has made us less reliant on outlets. And   overall has allowed us to get better realization on our end of   season, you know, sort of residual inventory. But with respect to   the inventory levels in outlets are actually quite low right now,   they're clean as a whistle, as we would say. And that actually   gives us some room. You know, if needed there's room to press   additional inventory through the outlets. And then in terms of   basic strategies and, you know, all our basic strategies, we have   the gift with purchase, the catalogs, the Tommy Bahama gift   cards, the Bounce Back or the flip side sale, as we call it. I   don't think there's any real change in strategy, but we will make   some tweaks in some of the timing of some of those events. And of   course, those are all designed to enhance results in the fourth   quarter. That's certainly the plan.  Edward Yruma    --   KeyBanc Capital Markets -- Analyst  I got it. Maybe if you can take one final one. Any interesting   commentary on tourism that we should consider and particularly as   you think about Hawaii and California, given some unique emphasis   on that state? Thank you.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  You know, I don't think we're seeing a -- what we view is a   big impact one way or the other from tourism right now and that   what I would say. Well, you know, there have been times where we   felt like it was either a strong positive or a strong negative.   And I don't think that's the case at the moment.  Edward Yruma    --   KeyBanc Capital Markets -- Analyst  Great. Thank you.  Operator  Ladies and gentlemen, there are no further questions at this   time. And I'd like to turn the call back to Tom Chubb for closing   remarks.  Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President  Okay. Thank you, Dana. And thank you very much to all of you   for your interest. We look forward to talking to you again in   December.  Operator  [Operator Closing Remarks]  Duration: 39 minutes  Call participants:  Anne M. Shoemaker    --   Vice President of Capital Markets and Treasurer   Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President   K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller   Paul Lejuez    --   Citigroup -- Analyst   Rakesh Babarbhai Patel    --   Needham & Company -- Analyst   Carlin Lynch    --   B. Riley FBR, Inc. -- Analyst   Dana Telsey    --   Telsey Advisory Group -- Analyst   Steven Louis Marotta    --   CL King & Associates, Inc. -- Analyst   Edward Yruma    --   KeyBanc Capital Markets -- Analyst   More OXM analysis   All earnings call transcripts        10 stocks we like better than Oxford   Industries     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Oxford   Industries wasn't one of them! That's right --   they think these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " Oxford Industries Inc    (NYSE: OXM)        Q2 2019 Earnings Call       Sep 11, 2019 ,   4:30 p.m. ET ",
    " Operator ",
    "Greetings. And welcome to the Oxford Industries Second Quarter   Fiscal 2019 Earnings Conference Call. At this time, all   participants are in a listen-only mode. A question-and-answer   session will follow the formal presentation [Operator   instructions]. As a reminder, this conference is being   recorded.",
    "I would now like to turn the conference over to your host,   Anne Shoemaker, Treasurer. Please go ahead.",
    " Anne M. Shoemaker    --   Vice President of Capital Markets and Treasurer ",
    "Thank you and good afternoon. Before we begin, I would like to   remind participants that certain statements made on today's call   and in the Q&A session may constitute forward-looking   statements within the meaning of the federal securities laws.   Forward-looking statements are not guarantees, and the actual   results may differ materially from those expressed or implied in   the forward-looking statements. Important factors that could   cause actual results of operations or our financial condition to   differ are discussed in our press release issued earlier today,   and in documents filed by us with the SEC, including the risk   factors contained in our Form 10-K.",
    "We undertake no duty to update any forward-looking statements.   During this call, we will be discussing certain non-GAAP   financial measures. You can find a reconciliation of non-GAAP to   GAAP financial measures in our press release issued earlier   today, which is posted under the Investor Relations tab of our   website at oxfordinc.com. Please note that all financial results   and outlook information discussed on this call, unless otherwise   noted, are from continuing operations, and all per-share amounts   are on a diluted basis.",
    "Our disclosures about comparable sales include sales from our   full-price stores and e-commerce sites, and excludes sales   associated with outlet stores and e-commerce/clearance sales. And   now I'd like to introduce today's calls participants. With me   today are Tom Chubb, Chairman and CEO; and Scott Grassmyer, CFO.   Thank you for your attention. And now I'd like to turn the call   over to Tom Chubb.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Thank you for joining us this afternoon. I want to start   today's call by taking a moment to remember and honor the victims   of 9/11, their families, as well as the survivors and first   responders. That tragic day will always serve as a reminder of   our country's resilience and the strength of the American   spirit.",
    "Our second quarter performance included top and bottom line   results that were within our guidance ranges, despite some   marketplace headwinds. Our strategy of operating a powerful   portfolio of lifestyle brands like Tommy Bahama, Lilly Pulitzer   and Southern Tide and emphasizing full price direct-to-consumer   channels continues to produce, enhance profitability and drive   long term shareholder value. I am pleased to report that for the   10th consecutive quarter, we posted consolidated comparable sales   growth and expanded consolidated gross margin and operating   margin in the quarter.",
    "To win with today's highly informed and empowered consumer,   you need to have a brand that stands for something, a lifestyle   or culture that resonates with your target audience. And you have   to reinforce that lifestyle and culture in everything you do from   product and marketing to service and distribution. This is the   Oxford approach and the foundation for the company's ongoing   success.",
    "Looking at each of our channels in more detail, the growth of   our e-commerce business continues to be a highlight of Oxford's   modern distribution network. Our high average ticket, high gross   margin, modest return rates and efficient distribution centers   make this a very profitable channel. E-commerce represents 22% of   our consolidated sales on a trailing 12 month basis, up from 20%   this time a year ago, and remains our fastest growing channel of   distribution.",
    "At the same time, our unique combination of bricks and mortar   retail stores, restaurants and bars remain strategically   important. These physical assets allow us to showcase the true   nature of our brands through a very compelling in-store   experience that features beautiful brand appropriate build-outs   and friendly staff that provide superior service levels. For   these reasons, our stores are very important to not only driving   sales, but also communicating our brand message and acquiring new   customers.",
    "We continue to invest in carefully curated brick and mortar   locations, and late in 2019, we will be opening two new Tommy   Bahama Marlin Bar locations, a Lilly Pulitzer store in Palm   Desert, California, and our first company owned Southern Tide   retail store in Jacksonville, Florida.",
    "As part of our strategy to strengthen our brands for the long   term, we continue to cultivate relationships with select   specialty retailers, licensed Signature Stores and online   retailers who are helping elevate our wholesale presence. At the   same time, we are finding fewer opportunities for mutually   beneficial relationships with department stores, which excluding   Lanier Apparel, now represent only 10% of consolidated sales. As   department stores continue to adjust to changes in the   marketplace, we believe our lack and dependence on this channel   for our Tommy Bahama, Lilly Pulitzer and Southern Tide brands   further differentiates Oxford from its peers.",
    "On the communications front, we continue to evolve our tactics   to stay front and center of our consumer. It is a multipronged   approach. While digital and social media, anchored by our   beautiful websites, have moved to the forefront of our marketing   strategy, our catalogs continue to energize our consumers and act   as measurable calls to action. Meanwhile, events such as Lilly   Pulitzer's three days flash clearance sale, which ends tonight,   generate a lot of brand excitement for both existing customers   and those just getting to know the brand. We plan this year's   sale to be comparable to last year, and while results are not   final yet, we are happy with the results to this point.",
    "Regardless of how well we position our brands or how clear and   compelling our messaging is, without great product, the operating   model simply does not work. Therefore, we have purposefully   constructed Tommy Bahama, Lilly Pulitzer and Southern Tide as   commercially informed but design-led businesses. Being design-led   allows us to generate the compelling, innovative and   differentiated product that resonates with our consumer and   ultimately gets her to open her wallet.",
    "2019 has been a particularly strong year in terms of new   products and collections. Highlights have included the emerging   strengths of key high performing styles like the Palm Coast Polo   or brocade pants and shorts at Tommy Bahama, the application of   Lilly Pulitzer's beautiful prints to Luxletic wear and new and   fresh dress and sportswear silhouettes, and the expansion of   performance fabrications across Southern Tide's coastal   collection. We are quite pleased with the consumer response to   this year's offerings, which has helped fuel strong full price   selling across our brands and channels.",
    "As we move into the second half of 2019, the fundamentals of   our business remain strong. We continue to focus on executing our   consumer centric growth strategies, while working to minimize the   impact of additional tariffs on both our consumers and our   financial results. As I mentioned on our last call, we have had   success in negotiating price reductions on goods produced in   China and will continue to shift production to other   countries.",
    "We were also able to accelerate deliveries of some product   ahead of the September first tariff increase and have made a   handful of carefully selected pricing increases. While we have   revised our outlook for the year to reflect the increased cost of   goods associated with these tariffs on the back half of the year,   we are still on track to deliver solid results in 2019. I am   confident that the strength of our dynamic portfolio of iconic   brands, our talented people and our balance sheet and capital   structure have Oxford well positioned to deliver sustained   success over the long term.",
    "I'll now turn the call over to Scott for more details on our   results and plans for the rest of 2019.",
    " K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller ",
    "Thanks, Tom. As Tom mentioned, our full price direct business   continues to be healthy and growing. Lilly Pulitzer's top line   growth was fueled by double digit e-commerce comps and the   addition of three stores since the end of the second quarter last   year. Tommy Bahama's full price direct business also remain   strong, with a 3% comp increase on top of an 8% comp increase in   the second quarter of last year. And Southern Tide's revenue   increased 6% year-over-year, driven by growth in e-commerce.   These increases were offset by reductions in wholesale sales at   Tommy Bahama and Lanier Apparel, as well as softness in our   outlet stores, as traffic in outlet malls continues to   decline.",
    "We achieved a 40 basis point improvement in our consolidated   adjusted gross margin in the second quarter with modest expansion   in both Tommy Bahama and Lilly Pulitzer. This includes a change   in sales mix as the higher margin direct-to-consumer businesses   represented a larger portion of sales in the quarter. Adjusted   operating profit increased from $40.6 million to $41.7 million.   Our adjusted operating margin expanded at 13.8% in the second   quarter, compared to 13.4% in the second -- in the same period   last year. A higher year-over-year tax rate resulted in adjusted   ne   t earnings    increase of only 1% as compared to a 3% increase in adjusted   operating profit. Our balance sheet and capital structure remain   very strong to support our growth initiatives and   investments.",
    "On July 31st, we amended our $325 million credit facility.   This amendment extended the maturity to 2024, added a lower   pricing tier, reduced our unused line fee and other favorable   changes. As of August 3rd, 2019, we had no borrowings outstanding   compared to $25 million at the end of the second quarter of   fiscal 2018. Our cash balance increased to $31 million compared   to $7 million in the prior year. These changes were attributable   to our strong cash flow from operations.",
    "I also want to spend some time walking you through our   inventory position at the end of the second quarter. On a FIFO   basis, after adding back our $62 million of LIFO reserve to both   years, the increase was 16%. We increased stock levels on high   volume key items and replenishment programs, and accelerated the   receipt of some goods ahead of the September 1st tariffs. We   believe our increased inventory levels are appropriate for our   plans for the back half of the year.",
    "Turning to our outlook. As Tom mentioned, we have modified our   earnings estimates for the back half of the year to reflect the   impact of the recently enacted tariffs. We have estimated the   impact to be approximately $0.20 per share, with about $0.05   impacting the third quarter, and about $0.15 impacting the fourth   quarter.",
    "For the third quarter, which is our smallest quarter due to   the seasonality of our direct-to-consumer businesses, we expect   net sales in the range from $235 million to $245 million,   compared to net sales of $234 million in the prior year. On an   adjusted basis, earnings per share for the third quarter of   fiscal 2019 was expected to be between $1.11 compared to adjusted   earnings per share of $0.14 in the third quarter of fiscal   2018.",
    "For the full year, adjusted earnings per share are now   expected to be between $4.25 and $4.45. We expect net sales to   grow between $1.135 billion and $1.155 billion. This compares to   net sales of $1.107 billion in fiscal 2018, and adjusted earnings   of $4.32 per share.",
    "For fiscal 2019, our interest expense is expected to be   approximately $1.5 million, and our effective tax rate is   expected to be approximately 26% compared to 25% in fiscal 2018.   Capital expenditures in fiscal 2019, including $16 million in the   first half, are expected to be between $45 million and $50   million, primarily reflecting investments in information   technology initiatives, new retail stores and Marlin Bars and   investments to remodel existing retail stores and   restaurants.",
    "Free cash flow for fiscal 2019 is expected to cede [phonetic]   $50 million. Finally, our Board of Directors has approved a   quarterly cash dividend of $0.37 per share. Oxford has paid a   dividend every quarter since becoming a public company in   1960.",
    "Dana, we're now ready for questions.",
    " Operator ",
    "At this time, we'll be conducting a question and answer   session. [Operator Instructions].",
    "Our first question comes from the line of Paul Lejuez with   Citi. Please proceed with your question.",
    " Paul Lejuez    --   Citigroup -- Analyst ",
    "Hey, thanks, guys. You mentioned the $0.20 tariff hit. I'm   curious if that is a gross number that you will still try to   offset -- you're not sure if you'll be able to? Or is it a net   number, in which case I'd be curious to know what the gross   number was and how much you were able to, to offset it?",
    "And then second, just curious if you could maybe talk a little   bit more about performance at mall versus off mall locations. You   mentioned some weakness, and outlet to be curious if you could   provide any sort of quantification as to how much the outlets   underperformed the rest of the business? Thanks.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Okay. So with respect to tariffs, that's an estimated net   impact of the higher tariffs. And that's sort of taking   everything into account. As we referred to in the call, we have   been able to get price reductions that were offsetting a   significant portion of the gross amount. I think it would be in   the neighborhood of 40%. But we are also continuing to push for   more. So the various levers that we're addressing are moving   production out of China, which we've done a lot already. We'll   continue to do more of that where we're staying in China, trying   to get the price concessions to offset some of the impact. And   then in some cases, you know, we have done some select price   increases and there will be more of that, more of that to come.   Then in terms of outlet stores. Scott, you want to.",
    " K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller ",
    "Yeah. The outlet stores were certainly negative comps and the   traffic was weak at the outlet store. So we're certainly, I   think, feeling, you know what I think which most people in the   industry. The good news is, [indecipherable] 34 outlets in the   US. So we're not heavily outlet dependent, our outlets are mainly   clearance vehicles. So we never went down to making a lot of   goods for outlets to primary clearance vehicles. And they're   pretty small fleet of outlets, but we are seeing some   traffic.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "And Paul, you relatively known to the story that we going back   several years ago, we really curtailed any future growth of   outlets. There's still a good channel for us to clear indices and   merchandise. But we have not grown that channel. In fact, we've   actually dropped a couple over the last couple of years. So we   like our position on outlets. We don't think we're overexposed   there. We did see some weakness there. But I think that's one of   the strengths of our model, is that we're not overly dependent on   outlets.",
    " Paul Lejuez    --   Citigroup -- Analyst ",
    "Yeah. Thank you. And how about mall versus off mall   performance?",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Well, certainly in malls, we see the traffic and off mall, you   don't necessarily see the traffic counts for the venue the same   way, but mall traffic continues to decline, as you know. And that   is one of the reasons that we're glad that we're not overly   stored and also not over represented in malls, for example. And   Tommy Bahama, less than 40% of our retail locations are mall   locations.",
    " Paul Lejuez    --   Citigroup -- Analyst ",
    "Got you. And then if I can just one follow up. Tom, where are   you going to be at the end of the year in terms of China   sourcing? And where do you expect that number to go to the next   year?",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Scott, you want to give him --",
    " K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller ",
    "Yeah. We were 54% last year and we begun shifting, but I think   that we'll really feel the most of the shifting in next year.   Certainly, next spring and summer, sourcing plans at China is   much smaller. So yeah, hopefully we will -- by next year we'll be   in -- more in the 40% range, maybe even less. We're continuing to   look for other countries. And we are -- we do have our China   factories, and they want to keep the business. So they are -- and   also as the dollar is getting stronger against the China   currency. You know, I think concessions will continue to come. So   that will weigh into how much we move, but we do want to   de-emphasize China more than we have so far.",
    " Paul Lejuez    --   Citigroup -- Analyst ",
    "Okay. Thanks Scott, good luck.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Thanks, Paul.",
    " K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller ",
    "Thanks.",
    " Operator ",
    "Our next question comes from the line of Rak [phonetic] Patel   with Needham & Company. Please proceed with your   question.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Hi, Rak.",
    " Rakesh Babarbhai Patel    --   Needham & Company -- Analyst ",
    "Hey, guys. Hey Tom, congrats on comping the comp.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Thank you.",
    " Rakesh Babarbhai Patel    --   Needham & Company -- Analyst ",
    "I have a question. I have a follow up to Paul's question on   tariffs as we think about how to model 2020. On the last call,   you touched on what the impact would be on prices at the retail   level. But given the business also has wholesale and restaurant,   it's a bit tricky to back into the impact on cost. So I'm   curious, is there any way to characterize how much of your cost   of goods these tariffs will be touching?",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Well, I think the response is pretty easy. I don't believe   we're using any Chinese food resources there or liquor to speak   of. So I don't think it will impact restaurants much at all. In   the wholesale, that is one of the challenges of addressing   pricing is that we got to move that channel or try to as much as   possible and sync with retail. And that means you've got a little   longer lead time on changing prices that show up both -- on   products that show up in both wholesale and retail. But we think   we got room to move there and do what we need to do as well.",
    " K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller ",
    "And Rak, I think if you back out our restaurants and then of   the payroll, you know, about 75% of the cost is dutiable. You   know, when you pull off the non-dutiable aspects and as the China   percent keeps coming down, now it's just under 50% that will come   down next year. And then some of the price increases we're doing,   there'll be you know, there'll be more price increases that will   affect next year. Very little is affecting this year, more will   affect next year. So that will lower the impact also, will help   mitigate the impact.",
    " Rakesh Babarbhai Patel    --   Needham & Company -- Analyst ",
    "Can you also help us on how to think about comp share in Tommy   and Lilly in 3Q versus 4Q? Tommy, you lapped a very tough   comparison in 2Q, so I'm assuming that you still expect higher   comps in the back half. And please correct me if I'm wrong there.   And for Lilly, you're lapping a plus 15 in the third quarter from   last year. So should we be modeling a step down in 3Q and any   thoughts on 4Q?",
    " K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller ",
    "I think our -- you know, our plan assumes for the back half of   the year sort of low single digit comp in Q3 and then mid singles   in Q4 is we -- well we got right in there.",
    " Rakesh Babarbhai Patel    --   Needham & Company -- Analyst ",
    "Great. And my last one is on Southern Tide. So interesting   development with the owned retail strategy. What gives you   conviction that now is the right time to expand and any high   level thoughts on what you see as the market opportunity for   stores?",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "You know, I think well you don't want to get too far ahead of   ourselves on what the market opportunity is, although a guy like   you can pretty easily imagine, you know, what it might be. I   think where our confidence is coming and why we've decided now is   the time is that, we have had good success with the Signature   Stores. The line has developed and matured to the point where we   think it can fill out a retail store nicely. And then you look at   the strength of our e-commerce business and the fact that the   guest is responding to us. They love the brand. They love the   product. And when we give them an opportunity to buy it direct   from us, that becomes another important channel for them.   Wholesale will still be important. E-commerce will still be   important. But we think there is a good opportunity there in   company-owned retail as well.",
    " Rakesh Babarbhai Patel    --   Needham & Company -- Analyst ",
    "Thanks very much. Good luck this fall.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Thanks a lot, Rak.",
    " Operator ",
    "Our next question comes from the line of Susan Anderson with   B. Riley FBR. Please proceed with your question.",
    " Carlin Lynch    --   B. Riley FBR, Inc. -- Analyst ",
    "Hi, guys. This is Carlin Lynch on for Susan. I just wanted to   follow up on something you had just said on the Tommy comps in   the back half. With the business, you know, being as strong as it   is, how much more room do you see for margin improvement? And   what are the steps that the company is taking to kind of drive   that expansion, especially in the fourth quarter with the mid   single digit comp?",
    " K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller ",
    "Yeah. Yeah, Tommy Bahama operating margin improvement has been   -- continues to be a high priority. First, you know, we've made   some progress in a cleaning up [indecipherable] last year, we   have gotten our initial gross margins. We continue to work on   trying to get those higher. Obviously, the tariff situation puts   a, you know, a little pause on that as we're navigating through   that. And we continue to grow a really healthy,   direct-to-consumer business. So I think Tommy Bahama's operating   margins have room to expand. And yeah, hopefully each year we   will make some steady progress toward that goal.",
    " Carlin Lynch    --   B. Riley FBR, Inc. -- Analyst ",
    "Got it. Got it. And I just wanted to kind of touch on some of   the new categories that you guys have been adding to or expanding   over the course of the last year, whether it's golf, swim,   tennis. How are those performing relative to your initial   expectations? You know, is tariffs kind of impacting that in any   way? And as you think about the broader portfolio, are there any   other gaps in the merchandise that you see the need to fill in or   kind of glaring holes? Thanks.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "So we've been really pleased with the performance. I think   you're talking about Lilly Pulitzer in specific, where we've   added swim, golf and tennis within the last year. That's part of   a broader category really that we would think of, as we call it   Luxletic that's really activewear. Within Lilly Pulitzer, we'd   been thrilled with the way it's performed. Golf and tennis and   swim, each of those by themselves are pretty small, but when you   look at that whole activewear round within Lilly Pulitzer, it's   become a, you know, pretty meaningful piece of the overall pie.   And then to answer the second part of your question, I don't   think that's been impacted any worse than any other part of the   business by the China tariff situation. It's certainly not exempt   from it. But I don't think it's necessarily been hit any harder   than that.",
    "And then in terms of new categories, we're always looking for   opportunities and white spaces that we think we can fill, not   prepared to announce anything at the moment. But that's always an   objective in all of our businesses, is to look for new areas that   we can go into and a great example of that is Tommy Bahama, where   it's great as that business is, and it's great as it had been for   a very long time. We've never had the strongest sort of key item   type business. And now with things like the brocade pants and   shorts, which is really our whole family of bottoms products, we   really built a franchise there.",
    "The Palm Coast Polo was our first foray into a true   performance Polo, and I believe it's become our number one   selling Polo and is, you know, it's just got tremendous legs. And   then over the last couple of years, we build another of others in   Tommy Bahama. So we're always looking for those opportunities.   And I think we'll continue to discover new ones each year.",
    " Carlin Lynch    --   B. Riley FBR, Inc. -- Analyst ",
    "All right. Thanks, guys.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Thanks a lot.",
    " Operator ",
    "Our next question comes from the line of Dana Telsey with   Telsey Advisory Group. Please proceed with your question.",
    " Dana Telsey    --   Telsey Advisory Group -- Analyst ",
    "Good afternoon, everyone. As you think of the current retail   environment beyond tariffs going into the balance of the third   quarter and into the fourth quarter, what are the biggest puts   and takes that you see could be the differences between this year   and last year, in relation to the consumer, and in relation to   your business initiative? Thank you.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "So in relation to the consumer, look we know there's a lot of   noise out there about, you know, where the economy is headed. But   if you look at the consumer themselves, unemployment numbers are   still incredibly good and favorable. A number of people working   full time is the highest it's been since, you know, before the   Great Recession. Wage growth is over 4% on a trailing 12 month   basis. You look at all these things, the savings rates are   actually still quite high. Gas prices are favorable. You just   look and the list goes on and on and on. So I believe there's   significant reason to believe that the economy is going to remain   strong for the next 12 months, and that the consumers are going   to remain strong. And that's certainly what we've factored in to,   you know, our plans for the fourth quarter. I'm not sure if that   answered everything you asked.",
    " Dana Telsey    --   Telsey Advisory Group -- Analyst ",
    "And as you think of each brand in terms of whether it's Lilly,   whether it's Tommy, is there marketing, is there a new product   that we should look to in terms of driving the excitement as we   go through the balance of the year? And then how do you think   about inventory levels as we move through the year?",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Yes. I'll let Scott comment on the inventory levels in a   minute. But in terms of marketing and new products, we do have   and we'll talk about this more on our December call, as we're   closer to the heart of the holiday season. But in Tommy in   particular in women's, we have a number of new products coming   this fall. We've got some that are already out, some that are   coming a little bit later that we're very excited about. They're   more seasonally appropriate than I think we've ever been in Tommy   Bahama women. So we've got more things with sleeves, more warm   and kind of cozy product that's on the way.",
    "So we're very excited about that. And in terms of marketing, I   don't think we have any initiative that's like a new technique.   But we are going to be doing some things a little bit   differently. Not all of that is fully crystallized at the moment,   but we would anticipate having at least one extra mail I think in   Tommy Bahama during the fall holiday season. You know, those are   very important for us. And then, you know, we're going to mix up   the cadence a little bit and make some tweaks to our marketing   activities. But we've got lots of things that we're excited about   in terms of what we're doing. And then we still think there's   good reason to believe that the consumer is in a good position to   spend money at holiday time.",
    " K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller ",
    "As far as inventory, Dana, inventory is up 16% year-over-year.   But if you really build the inventory back, it's not an aged   inventory increase. It's really mostly key items in replenishment   type program, things like the [indecipherable] where we were   breaking some last year, we're in good stock there where we can   replenish our stores and we're in stock on e-comm. We've got some   other key items and merchandising wise, we're trying to stress   key items in both men's and women's at Tommy and that is a   healthy inventory to be up some. But we feel good about the   inventory levels and compensation out of the inventory.",
    " Dana Telsey    --   Telsey Advisory Group -- Analyst ",
    "And is there anything besides -- besides -- excluding tariffs,   anything on the expense pockets in the back half of the year and   what do you think is comparable to last year?",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Yeah, we got arrived a couple of things in the second quarter.   If you -- in case you missed it, as Scott told out, we had a   higher tax rate that created about a $0.045 drag and I think the   way we'd think about that tax rate is it's more than normal. Last   year was unusual, but it was favorable to us. And then in Q3 and   Q4, we got some of the Marlin Bars pre-opening expenses that are   what Scott --",
    " K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller ",
    "$0.04 in Q3 and about $0.05 in Q4. And the Marlin Bars is it's   not just the two where I mean this year it's about a six month   lead time. So that round, even if we're in a free rent period,   the rent goes to our P&L from the time we take possession. So   we're going to have five different Marlin Bars running through   some pre-opening expense through this fiscal year. So that's   causing a little bit of a headwind expense wise.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Yeah. So, you know, it's all baked into the guidance. But to   answer your question, there are a couple of things that are   year-over-year drags on the bottom line.",
    " Dana Telsey    --   Telsey Advisory Group -- Analyst ",
    "Thank you.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Thank you, Dana.",
    " Operator ",
    "Our next question comes from the line of Steve Marotta with   CLK & Associates. Please proceed with your question.",
    " Steven Louis Marotta    --   CL King & Associates, Inc. -- Analyst ",
    "Good afternoon, Tom and Scott. As far as the discretionary   spend expectations go for the balance of the year, were there any   changes in the annual guidance associated with deltas in   discretionary spend either up or down? Or was that $0.20, 100%   wholly tariffs?",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "That's all tariffs. That $0.20 is all tariffs.",
    " Steven Louis Marotta    --   CL King & Associates, Inc. -- Analyst ",
    "And so there again, there was no changes in discretionary   spend from the last time you spoke to the Street on guidance.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Correct.",
    " K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller ",
    "That's right.",
    " Steven Louis Marotta    --   CL King & Associates, Inc. -- Analyst ",
    "Great. And my second question is, as it pertains specifically   to the Q3 comp guidance, is there any acceleration in the   business expected between now and the balance of the quarter? Or   is it more or less it's steady as she goes?",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Not really. It's steady as she goes. I think right now we're   tracking really right where we would -- what we would need to do   for the quarter.",
    " Steven Louis Marotta    --   CL King & Associates, Inc. -- Analyst ",
    "Yeah. Helpful. Thank you very much.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "You got it. Thank you.",
    " Operator ",
    "Our next question comes from the line of Edward Yruma with   KeyBanc Capital Markets. Please proceed with your question.",
    " K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller ",
    "Hi, Eric.",
    " Edward Yruma    --   KeyBanc Capital Markets -- Analyst ",
    "Hey, how are you guys? Thanks very much for taking the   questions today. I guess first, since you used outlets as your   promotional vehicle or your disposition vehicle, I guess, you   know, are you seeing inventory backing up in outlets, given some   of the commentary you had? Or do you expect a kind of clearance   for them in due course? And then second, as we step back and   think about the overall promotional strategy, either the Bounce   Back or the Lilly sale, I know you indicated you may make some   tweaks to marketing or some strategies? Are you changing   promotional strategy at all? And how does that impact your back   half to you? Thank you.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "So I would say, first of all, with respect to the outlets,   they are still an important clearance channel for us. But as you   know, we've developed some others over the last couple of years,   including twice a year, doing some clearance within the Tommy   Bahama stores, which has made us less reliant on outlets. And   overall has allowed us to get better realization on our end of   season, you know, sort of residual inventory. But with respect to   the inventory levels in outlets are actually quite low right now,   they're clean as a whistle, as we would say. And that actually   gives us some room. You know, if needed there's room to press   additional inventory through the outlets. And then in terms of   basic strategies and, you know, all our basic strategies, we have   the gift with purchase, the catalogs, the Tommy Bahama gift   cards, the Bounce Back or the flip side sale, as we call it. I   don't think there's any real change in strategy, but we will make   some tweaks in some of the timing of some of those events. And of   course, those are all designed to enhance results in the fourth   quarter. That's certainly the plan.",
    " Edward Yruma    --   KeyBanc Capital Markets -- Analyst ",
    "I got it. Maybe if you can take one final one. Any interesting   commentary on tourism that we should consider and particularly as   you think about Hawaii and California, given some unique emphasis   on that state? Thank you.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "You know, I don't think we're seeing a -- what we view is a   big impact one way or the other from tourism right now and that   what I would say. Well, you know, there have been times where we   felt like it was either a strong positive or a strong negative.   And I don't think that's the case at the moment.",
    " Edward Yruma    --   KeyBanc Capital Markets -- Analyst ",
    "Great. Thank you.",
    " Operator ",
    "Ladies and gentlemen, there are no further questions at this   time. And I'd like to turn the call back to Tom Chubb for closing   remarks.",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    "Okay. Thank you, Dana. And thank you very much to all of you   for your interest. We look forward to talking to you again in   December.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 39 minutes ",
    " Anne M. Shoemaker    --   Vice President of Capital Markets and Treasurer ",
    " Thomas Caldecot Chubb    --   Chairman, Chief Executive Officer and President ",
    " K. Scott Grassmyer    --   Executive Vice President of Finance, Chief Financial Officer   and Controller ",
    " Paul Lejuez    --   Citigroup -- Analyst ",
    " Rakesh Babarbhai Patel    --   Needham & Company -- Analyst ",
    " Carlin Lynch    --   B. Riley FBR, Inc. -- Analyst ",
    " Dana Telsey    --   Telsey Advisory Group -- Analyst ",
    " Steven Louis Marotta    --   CL King & Associates, Inc. -- Analyst ",
    " Edward Yruma    --   KeyBanc Capital Markets -- Analyst ",
    " More OXM analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than Oxford   Industries     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Oxford   Industries wasn't one of them! That's right --   they think these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:23:22"
}