{
  "url": "https://www.nasdaq.com/article/sc-or-cacc-which-is-the-better-value-stock-right-now-cm1207181",
  "title": "SC or CACC: Which Is the Better Value Stock Right Now? - Nasdaq.com",
  "text": [
    " Investors interested in Financial - Consumer Loans stocks are likely familiar with Santander Consumer (SC) and Credit Acceptance (CACC). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look. Everyone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits. Both Santander Consumer and Credit Acceptance have a Zacks Rank of # 2 (Buy) right now. Investors should feel comfortable knowing that both of these stocks have an improving earnings outlook since the Zacks Rank favors companies that have witnessed positive analyst estimate revisions. But this is just one piece of the puzzle for value investors. Value investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels. The Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors. SC currently has a forward P/E ratio of 9.09, while CACC has a forward P/E of 12.69. We also note that SC has a PEG ratio of 0.76. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. CACC currently has a PEG ratio of 1.27. Another notable valuation metric for SC is its P/B ratio of 1.21. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, CACC has a P/B of 3.77. These are just a few of the metrics contributing to SC's Value grade of A and CACC's Value grade of C. Both SC and CACC are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that SC is the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Santander Consumer USA Holdings Inc. (SC): Free Stock Analysis Report   Credit Acceptance Corporation (CACC): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors interested in Financial - Consumer Loans stocks are likely familiar with Santander Consumer (SC) and Credit Acceptance (CACC). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look.",
    "Everyone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits.",
    "Both Santander Consumer and Credit Acceptance have a Zacks Rank of # 2 (Buy) right now. Investors should feel comfortable knowing that both of these stocks have an improving earnings outlook since the Zacks Rank favors companies that have witnessed positive analyst estimate revisions. But this is just one piece of the puzzle for value investors.",
    "Value investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels.",
    "The Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors.",
    "SC currently has a forward P/E ratio of 9.09, while CACC has a forward P/E of 12.69. We also note that SC has a PEG ratio of 0.76. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. CACC currently has a PEG ratio of 1.27.",
    "Another notable valuation metric for SC is its P/B ratio of 1.21. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, CACC has a P/B of 3.77.",
    "These are just a few of the metrics contributing to SC's Value grade of A and CACC's Value grade of C.",
    "Both SC and CACC are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that SC is the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:11"
}