{
  "url": "https://www.nasdaq.com/article/why-shares-of-smartsheet-are-down-today-cm1208199",
  "title": "Why Shares of Smartsheet Are Down Today - Nasdaq.com",
  "text": [
    "Shares of Smartsheet (NYSE: SMAR) fell more than 9% on Thursday morning after the maker of cloud-based business software reported a fiscal second-quarter loss that actually came in ahead of what analysts had expected, but warned that the third quarter would be more difficult than analysts had hoped. On what was already shaping up as a difficult day for the sector after Slack Technologies (NYSE: WORK) underwhelmed, investors saw the glass half-empty with Smartsheet.",
    "After markets closed Wednesday, Smartshee t report ed a fiscal second-quarter loss of $0.08 per share, well ahead of the $0.16 loss analysts had been expecting. Revenue for the quarter came in at $64.6 million, up 52% year over year and slightly ahead of expectations.",
    "Image source: Getty Images.",
    "But investors were more focused on the outlook for the current quarter. Smartsheet said it expects revenue of $69 million to $70 million in its fiscal third quarter, and a loss of $0.18 or $0.19 per share. Analysts had been expecting about $70 million in revenue but were hoping for a loss closer to $0.15 per share. Smartsheet has been an active acquirer , taking advantage of market turbulence, but the jitters seem to be catching up with it.",
    "Factor in the negative free cash flow of $7 million in the quarter -- and the high-profile loss and tepid guidance from fellow cloud business software vendor Slack -- and investors concerned about the near-term outlook for the sector are punishing valuations on Thursday.",
    "Despite the sell-off, there is a lot to like about Smartsheet's quarter. Subscription revenue grew 56%, and revenue guidance was within range of analyst expectations. The profit guidance is an indication this company continues to invest in its business. Assuming that investment can be used to continue growth, it will be money well spent even if it affects near-term results.",
    "Tech stocks do tend to be volatile, and an argument can be made that it is late in the cycle for Smartsheet to be investing for growth and not focused on profitability. It still needs to execute and this remains a risky stock, but investors could look back on today's reaction as a rare discount for a company that is still up 70% year to date.",
    "10 stocks we like better than Smartsheet Inc.\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Smartsheet Inc. wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Lou Whiteman has no position in any of the stocks mentioned. The Motley Fool owns shares of Slack Technologies and Smartsheet Inc. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 01:21:00"
}