{
  "url": "https://www.nasdaq.com/article/expectations-are-rising-again-at-rh-cm1210632",
  "title": "Expectations Are Rising Again at RH - Nasdaq.com",
  "text": [
    "There have been a lot of questions about the retail space lately, and especially among high-end retailers like luxury home furnishings retailer RH (NYSE: RH) , the question of whether a recession is coming for the U.S. economy looms large. RH has been a big winner during the current economic expansion, as the company has figured out how to appeal to its most promising customer base and has focused on delivering the most favorable shopping experience to its loyal shoppers.",
    "Coming into Tuesday's fiscal second-quarter financial report, RH investors fully expected that the retailer would be able to match the goals it had set. RH's numbers were generally even stronger than that, and the company boosted its projections for the rest of the year once again.",
    "RH's fiscal second-quarter results continued a long trend of encouraging performance from the home furnishings specialist. Revenue jumped 10% to $706.5 million, accelerating from the previous quarter and topping the 9% growth rate that most of those following the stock had anticipated. Adjusted net income soared 31% year over year to $71.4 million, and that boosted adjusted earnings to $3.20 per share. That was far above the $2.70-per-share consensus forecast among analysts.",
    "Image source: RH.",
    "Efficiency and profitability remained RH's key focus. Adjusted operating margin soared more than 3 percentage points to 14.9%, building even further on past improvements. Investors also can't ignore the huge impact that stock buybacks have had on per-share performance figures. RH had just 18.5 million shares outstanding on average during the quarter, down from more than 21.9 million in the year-ago period.",
    "Expansion efforts are also paying off for RH. The company's new RH New York Gallery is still on pace to see annualized revenue of more than $100 million this year, and cash flow projections are also favorable. RH plans to open top-end gallery locations in the Minneapolis, Columbus, and Marin County areas during the second half of the year. Longer-term, RH expects to open five to seven new galleries in fiscal 2020, and seven or more in fiscal 2021.",
    "Part of RH's strategic plan has been to eliminate unprofitable non-core businesses. Eliminating its holiday business, ending fringe promotions, and changing the source model for its rug business will hit revenue by about 3 percentage points this year. However, it should help boost profits in the long run.",
    "CEO Gary Friedman was happy with how things are going. \"We continue to demonstrate our ability to grow earnings significantly faster than revenues,\" Friedman said, \"illustrating the desirability of our differentiated product offering and the emergence of RH as a luxury brand generating luxury margins.\"",
    "RH thinks it can overcome any difficulties ahead. In Friedman's words, \"Despite the increase in tariffs and some negative macro trends, we remain optimistic that our business momentum will continue.\" The CEO pointed to the Fall Interiors and Modern Source books, as well as contributions from the Beach House and Ski House concepts, in pushing RH forward. He also emphasized that Chinese trade won't stop it from reaching its financial goals.",
    "As it's done in several past quarters, RH once again boosted its guidance for the full year. The company now believes that sales will be between $2.68 billion and $2.694 billion, up $20 million to $22 million from its previous range. Adjusted earnings projections soared by $1.24 to $1.45 per share to a new range of $10.53 to $10.76 per share.",
    "Interestingly, though, RH paused on its stock buybacks. The company repeated its past assertion that its stock remains undervalued, but it didn't add any further repurchases to the 2.2 million shares it bought back during the first quarter. RH will still evaluate future moves.",
    "RH investors had a lot of conflicting thoughts about the report, as the stock moved sharply in both directions following the announcement before moving slightly higher Wednesday morning. There might be concerns about whether the economy will continue to cooperate  with RH, but at least for now, the luxury retailer seems to have the right recipe for bottom-line success.",
    "10 stocks we like better than RH\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and RH wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Dan Caplinger has no position in any of the stocks mentioned. The Motley Fool recommends RH. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:50:00"
}