{
  "url": "https://www.nasdaq.com/article/why-splunk-stock-dropped-174-in-august-cm1210526",
  "title": "Why Splunk Stock Dropped 17.4% in August - Nasdaq.com",
  "text": [
    " What happened Shares of   Splunk    (NASDAQ: SPLK) fell 17.4% in August, according to data from   S&P Global Market Intelligence.     The operational intelligence platform specialist   absolutely crushed estimates    for its fiscal second quarter, but followed by significantly   reducing its cash flow expectations for the rest of this   year. Before you go tapping that sell button yourself, you should   note that Splunk's quarterly results were just as incredible as   they looked on paper: Revenue climbed 33% year over year to   $516.6 million, translating to adjusted net income of $46.6   million, or $0.30 per share. Analysts on average were looking for   earnings of only $0.12 per share, and Splunk's outlook called for   revenue of just $485 million.   Image source: Getty Images.makeArticleAd();  So what Within Splunk's top line, license revenue grew 39.2% to $279.3   million, and maintenance & services revenue soared 26.5% to   $237.3 million. Within those totals, however, management noted   that cloud business grew an incredible 80% year over year and now   commands over $300 million of annual recurring revenue   (ARR). Splunk also announced it has agreed to acquire   cloud-monitoring company SignalFX for $1.05 billion in a cash   (60%) and stock (40%) deal -- a move that should significantly   expand its reach and value proposition to clients. If that wasn't enough, Splunk increased its full-year outlook   for revenue to $2.3 billion -- up $50 million from its old   target. During the subsequent conference call, CEO Doug Merritt   insisted    Splunk is \"firing on all cylinders,\" adding almost 500 new   enterprise customers. And by the end of the year, he said,   essentially all of Splunk's new software sales will be cloud- or   term-license based as it transitions away from a perpetual   license model. So what's the problem? That transition is happening much   faster than Splunk expected -- it previously thought as much as   15% of total sales at the end of the year would be perpetual --   which hurts the timing of Splunk's cash collections as its   perpetual-license sales base wanes. Now what To be fair, Splunk saw the   exact same response in May    , when it lowered its operating cash-flow expectation for this   year by $100 million to \"just\" $350 million. But as renewable   license sales continued to soar, as of last month's update Splunk   now expects   negative    operating cash flow of $300 million this fiscal year. Over the long term, however, I'm intrigued by Splunk's   potential as it begins to lap this jaw-dropping transition and   collects more of the recurring revenue it's putting into place   today. For investors willing to buy now and   watch this growth story    play out, I think the pullback is an enticing opportunity to open   or add to a position.   10 stocks we like better than Splunk       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Splunk wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Steve Symington      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Splunk. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   Splunk    (NASDAQ: SPLK) fell 17.4% in August, according to data from   S&P Global Market Intelligence.     The operational intelligence platform specialist   absolutely crushed estimates    for its fiscal second quarter, but followed by significantly   reducing its cash flow expectations for the rest of this   year.",
    "Before you go tapping that sell button yourself, you should   note that Splunk's quarterly results were just as incredible as   they looked on paper: Revenue climbed 33% year over year to   $516.6 million, translating to adjusted net income of $46.6   million, or $0.30 per share. Analysts on average were looking for   earnings of only $0.12 per share, and Splunk's outlook called for   revenue of just $485 million.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Within Splunk's top line, license revenue grew 39.2% to $279.3   million, and maintenance & services revenue soared 26.5% to   $237.3 million. Within those totals, however, management noted   that cloud business grew an incredible 80% year over year and now   commands over $300 million of annual recurring revenue   (ARR). Splunk also announced it has agreed to acquire   cloud-monitoring company SignalFX for $1.05 billion in a cash   (60%) and stock (40%) deal -- a move that should significantly   expand its reach and value proposition to clients.",
    "If that wasn't enough, Splunk increased its full-year outlook   for revenue to $2.3 billion -- up $50 million from its old   target.",
    "During the subsequent conference call, CEO Doug Merritt   insisted    Splunk is \"firing on all cylinders,\" adding almost 500 new   enterprise customers. And by the end of the year, he said,   essentially all of Splunk's new software sales will be cloud- or   term-license based as it transitions away from a perpetual   license model.",
    "So what's the problem? That transition is happening much   faster than Splunk expected -- it previously thought as much as   15% of total sales at the end of the year would be perpetual --   which hurts the timing of Splunk's cash collections as its   perpetual-license sales base wanes.",
    "To be fair, Splunk saw the   exact same response in May    , when it lowered its operating cash-flow expectation for this   year by $100 million to \"just\" $350 million. But as renewable   license sales continued to soar, as of last month's update Splunk   now expects   negative    operating cash flow of $300 million this fiscal year.",
    "Over the long term, however, I'm intrigued by Splunk's   potential as it begins to lap this jaw-dropping transition and   collects more of the recurring revenue it's putting into place   today. For investors willing to buy now and   watch this growth story    play out, I think the pullback is an enticing opportunity to open   or add to a position.",
    "  10 stocks we like better than Splunk       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Splunk wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Splunk       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Splunk wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Steve Symington      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Splunk. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:00:00"
}