{
  "url": "https://www.nasdaq.com/article/the-7-stocks-hedge-funds-are-buying-big-cm1210777",
  "title": "The 7 Stocks Hedge Funds Are Buying Big - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "One of the most widely used phrases in the investment world is \"follow the smart money,\" and it broadly means that investors would be wise to follow the investments of hedge funds and institutional investors (the \"smart money\").",
    "As hedge fund tracking site Whale Wisdom shows us, following the smart money over the past several years has been a very profitable thing to do. Whale Wisdom has comprised what it calls the WhaleIndex , which is a portfolio of the 100 highest-conviction stocks held by leading hedge fund managers, as shown in quarterly 13-F filings. Since 2006, the WhaleIndex has returned about 370%, crushing the 200% S&P 500 return over that same time frame.",
    "Clearly, following the smart money has been the smart move. No pun intended.",
    "With that in mind, let's take a look at seven stocks that Whale Wisdom says hedge funds love . That is, the seven highest-conviction stocks that hedge funds own the most of, as of second-quarter 13-F filings.",
    "The most owned stock among hedge funds is technology giant Microsoft (NASDAQ: MSFT ), with an aggregate second quarter 13-F holding value of $735 billion.",
    "This seems like an obvious choice for smart money. Microsoft is a blue chip technology giant which has been around forever, has a huge ecosystem of products and services, and most importantly, has found its growth stride again through enterprise cloud services migration and expansion. The company consistently beats Street estimates, has a long track record of cloud-driven double-digit revenue growth, and is benefiting from upside margin drivers which are driving even bigger profit growth.",
    "There's a lot to like about the fundamentals supporting MSFT stock. Perhaps the best thing to like is the valuation. Even with all these favorable attributes, MSFT stock still trades at just just 22.8-times forward earnings - a bargain for a mega-cap, big-growth cloud stock.",
    "All in all, then, it makes sense that the smart money loves Microsoft stock. This is a big company with big growth drivers trading at a very reasonable valuation. That's a winning combination that has propelled the stock 100% higher over the past three years. It should propel similarly large gains going forward, too.",
    "The second-most owned stock among hedge funds is consumer technology giant Apple (NADSAQ: APPL ), with an aggregate second quarter 13-F holding value of $550 billion.",
    "Another obvious choice for smart money, Apple has many of the same winning characteristics as Microsoft. This is a blue-chip technology giant with a long track record of growth, and which has created an ecosystem of consumer technology hardware products that over a billion people around the world use every day. The first part of the Apple growth narrative was all about building out that hardware ecosystem. The second part - which the company is transitioning to now - is all about monetizing that ecosystem with software subscription services, like Apple TV+ and Apple Music.",
    "In other words, this company has a history of a big growth, and a very smart game-plan to sustain that big growth for the foreseeable future. At the same time, software businesses carry higher margins than hardware businesses, so this pivot to software-focused growth is also additive to margins and should super-charge profit growth.",
    "Apple has a robust profit growth trajectory ahead of it. Even with that robust profit growth outlook, AAPL stock still trades at less than 18-times forward earnings - the lowest multiple in the entire mega-cap technology group.",
    "As such, with Apple (much like Microsoft) you have a host of favorable characteristics on top of a reasonable valuation. This has driven big gains in the stock over the past several years, and should continue to do so.",
    "The third most owned stock among hedge funds is e-commerce and cloud giant Amazon (NADSAQ: AMZN ), with an aggregate second quarter 13-F holding value of $515 billion.",
    "Hedge funds have fallen in love with Amazon stock for two big reasons. One, we live in the era of the growth trade, supported by the fact that interest rates are very low and Treasury yields globally are near record lows (and often in negative territory). When rates are low, the growth trade works. That's because growth stocks derive most of their value from future profits, and when rates are low, the present value of those future profits increases because the discount rate used to discount back those future profits goes down.",
    "Two, Amazon is the king of the growth stocks. This is a company which consistently fires off 20%-plus revenue growth rates on anemic margins, under the promise that one day, the company will dominate its addressable markets, ease its growth spend, and expand margins on a huge revenue base. As such, this company is all about deriving its value from future profits. Given the company's huge revenue base, those future profits could one day be very, very big. Thus, we live in a low rate world that is perfect for Amazon stock to succeed.",
    "All in all, it should be no surprise that AMZN stock has turned into a hedge fund favorite. This is the king of the growth stocks, in an era where growth stocks rule the land.",
    "The reality is that so long as rates remain depressed, growth stocks should continue to out-perform, and AMZN stock will continue to grind higher.",
    "The fourth most owned stock among hedge funds is social media giant Facebook (NADSAQ: FB ), with an aggregate second quarter 13-F holding value of $345 billion.",
    "Facebook being a hedge fund favorite likely has to do with the fact that Facebook is the ideal GARP, or growth-at-a-reasonable-price, stock. Consider this: Facebook has largely been for its entire history as a public company a 20%-plus revenue growth company. It remains so today, and projects to remain in 20%-plus revenue growth territory for the next few years.",
    "At the same time, operating margins used to be at 50%. Sure, they have come down dramatically since the Cambridge Analytica scandal forced the company to spend more on data security. But, margins are bottoming in the mid-30% range, and should move higher going forward.",
    "Thus, this is a 20%-plus revenue growth company with upside margin drivers. That combination implies 25%-plus profit growth potential here. FB stock trades at just 23-times forward earnings for that 25%-plus profit growth potential. That's a bargain which hedge funds clearly love.",
    "Even further, Facebook's 25%-plus profit growth potential is supported by the fact that 2.7 billion globally use one of the company's four apps every single month, and that the 2.7 billion number has never done anything besides go up. In other words, it's a very well-supported 25%-plus profit growth company, trading at a discounted valuation. That's a recipe for big share price gains.",
    "The fifth most owned stock among hedge funds is global payments giant Visa (NYSE: V ), with an aggregate second quarter 13-F holding value of $275 billion.",
    "Hedge funds love Visa for six very simple reasons. One, Visa operates in the secular growth card payments space. In 2018, payment cards generated 368.92 billion purchase transactions for goods and services, up nearly 25% year-over-year from 2017. Two, Visa dominates this 25% growth space, accounting for nearly 45% of those 369 billion transactions in 2018. Three, Visa's dominance in the secular growth card payments space has consistently powered high single-digit to double-digit volume, transaction, and revenue growth over the past few years.",
    "Four, margins are stable and big. Five, healthy revenue growth plus stable and big margins has powered and continues to power robust profit growth. Six, for that robust profit growth, Visa stock trades at just 33-times forward earnings - which, while not cheap, is certainly reasonable for a company that is as dominant and has as much visibility and growth potential as Visa.",
    "As such, it makes sense that hedge funds love Visa stock. This company has all the attributes of a long term winning investments. Those attributes aren't going anywhere anytime soon. Thus, Visa stock will continue to look and act like a long term winner.",
    "The sixth most owned stock among hedge funds is banking giant JP Morgan (NYSE: JPM ), with an aggregate second quarter 13-F holding value of $255 billion.",
    "The first five stocks on this list were arguably all technology companies. But, hedge funds can't exclusively love technology stocks - they, like every other investor, need to diversify their exposure to the market. One way to do that? Buy a bank stock for financial sector exposure. When buying bank stocks, hedge funds have most often opted for JP Morgan.",
    "Why? A few reasons. For starter's, JP Morgan is the largest bank in the U.S., so it's an obvious choice when seeking financial sector exposure. Also, JP Morgan has consistently operated at a higher clip than its peers over the past several years. Over the past three years, JPM stock is up more than 60%, versus a 35% gain for the Financial Select Sector SPDR ETF (NYSEARCA: XLF ). Even further, JPM has been exceptionally innovative on the technology front, doing things like partnering with Amazon on a credit card.",
    "Big picture, hedge funds need bank exposure, too, and when seeking that bank exposure, they have most often bought JPM stock because JPM is bigger, better, and innovating faster than its peers.",
    "Does that mean JPM stock will continue to move higher? Probably not. So long as the yield curve remains inverted and \"lower for longer\" remains the theme in the yields world, JPM stock will struggle to move higher. Those conditions simply are not favorable for bank stocks.",
    "The seventh most owned stock among hedge funds is digital ad and cloud giant Alphabet (NADSAQ: GOOGL , NASDAQ: GOOG ), with an aggregate second quarter 13-F holding value of $250 billion.",
    "To be fair, Whale Wisdom separates GOOG and GOOGL into two different entries, each of which had an aggregate second quarter 13-F holding value of $250 billion. Thus, the total holding value in all of Alphabet stock (GOOG and GOOGL) is about $500 billion, which would peg it as the fourth - not seventh - most owned stock among hedge funds.",
    "It makes sense that Alphabet would be so high on hedge funds' buy list. This is a company which has built the backbone of the internet with Google Search. Everyone and their best friend in the world uses that backbone. Alphabet has leveraged the utility of Google Search to develop a broad ecosystem of widely used software services (Gmail, YouTube, Google Docs, etc), and has monetized that ecosystem with ads, ads, and more ads.",
    "This strategy has worked. Now, Alphabet is the unchallenged titan in the global digital ad industry. That industry is growing at a 20%-plus pace. On top of that, Alphabet has also created a leading cloud infrastructure services business that operates in the 20%-plus growth cloud sector, is building out an ecosystem of consumer technology hardware products that are rapidly gaining, and has turned into the clear leader in the self-driving space with its Waymo unit.",
    "In other words, there are multiple growth drivers here, all of which have the potential to produce huge profits at scale. As such, Alphabet remains a big growth company. For all that growth, GOOG stock trades at just 22-times forward earnings.",
    "That's a combination that has powered big gains in GOOG stock over the past several years. It should continue to do for the next several years, too.",
    "As of this writing, Luke Lango was long AMZN, FB, and GOOG.",
    "The post The 7 Stocks Hedge Funds Are Buying Big appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:55:26"
}