{
  "url": "https://www.nasdaq.com/article/chronic-cough-biotech-bellus-health-files-and-sets-terms-for-60-million-us-ipo-cm1206590",
  "title": "Chronic cough biotech BELLUS Health files and sets terms for $60 million US IPO - Nasdaq.com",
  "text": [
    " BELLUS Health, a Phase 2 biotech developing an oral small molecule therapy for chronic cough, filed on Tuesday with the SEC to raise up to $60 million in an initial public offering in the US. The company is currently listed in Toronto under the symbol BLU.    The Quebec, Canada-based company plans to raise $60 million. Based on the last close on the TSX ($C9.34; $7.03 as-converted), this implies a roughly 8.5 million share offering, and a post-IPO fully diluted market value of $394 million.    The Quebec, Canada-based company traces its roots to 1993, and plans to list on the Nasdaq under the symbol BLU. Jefferies, Cowen and Guggenheim Securities are the joint bookrunners on the deal. It is expected to price later this week.  The article Chronic cough biotech BELLUS Health files and sets terms for $60 million US IPO  originally appeared on IPO investment manager Renaissance Capital's web site renaissancecapital.com.   Investment Disclosure:  The information and opinions expressed herein were prepared by Renaissance Capital's research analysts and do not constitute an offer to buy or sell any security. Renaissance Capital's Renaissance IPO ETF (symbol: IPO)  , Renaissance International ETF (symbol: IPOS)  , or separately managed institutional accounts may have investments in securities of companies mentioned.",
    "BELLUS Health, a Phase 2 biotech developing an oral small molecule therapy for chronic cough, filed on Tuesday with the SEC to raise up to $60 million in an initial public offering in the US. The company is currently listed in Toronto under the symbol BLU.    The Quebec, Canada-based company plans to raise $60 million. Based on the last close on the TSX ($C9.34; $7.03 as-converted), this implies a roughly 8.5 million share offering, and a post-IPO fully diluted market value of $394 million.    The Quebec, Canada-based company traces its roots to 1993, and plans to list on the Nasdaq under the symbol BLU. Jefferies, Cowen and Guggenheim Securities are the joint bookrunners on the deal. It is expected to price later this week.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:00:00"
}