{
  "url": "https://www.nasdaq.com/article/lrn-vs-bfam-which-stock-should-value-investors-buy-now-cm1207169",
  "title": "LRN vs. BFAM: Which Stock Should Value Investors Buy Now? - Nasdaq.com",
  "text": [
    " Investors interested in stocks from the Schools sector have probably already heard of K12 (LRN) and Bright Horizons Family Solutions (BFAM). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look. The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits. K12 has a Zacks Rank of #1 (Strong Buy), while Bright Horizons Family Solutions has a Zacks Rank of #2 (Buy) right now. The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that LRN has an improving earnings outlook. However, value investors will care about much more than just this. Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels. The Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P/E ratio, P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value. LRN currently has a forward P/E ratio of 27.43, while BFAM has a forward P/E of 44.96. We also note that LRN has a PEG ratio of 1.83. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. BFAM currently has a PEG ratio of 4.45. Another notable valuation metric for LRN is its P/B ratio of 1.66. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, BFAM has a P/B of 10.83. These metrics, and several others, help LRN earn a Value grade of B, while BFAM has been given a Value grade of D. LRN has seen stronger estimate revision activity and sports more attractive valuation metrics than BFAM, so it seems like value investors will conclude that LRN is the superior option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  K12 Inc (LRN): Free Stock Analysis Report   Bright Horizons Family Solutions Inc. (BFAM): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors interested in stocks from the Schools sector have probably already heard of K12 (LRN) and Bright Horizons Family Solutions (BFAM). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look.",
    "The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits.",
    "K12 has a Zacks Rank of #1 (Strong Buy), while Bright Horizons Family Solutions has a Zacks Rank of #2 (Buy) right now. The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that LRN has an improving earnings outlook. However, value investors will care about much more than just this.",
    "Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels.",
    "The Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P/E ratio, P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value.",
    "LRN currently has a forward P/E ratio of 27.43, while BFAM has a forward P/E of 44.96. We also note that LRN has a PEG ratio of 1.83. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. BFAM currently has a PEG ratio of 4.45.",
    "Another notable valuation metric for LRN is its P/B ratio of 1.66. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, BFAM has a P/B of 10.83.",
    "These metrics, and several others, help LRN earn a Value grade of B, while BFAM has been given a Value grade of D.",
    "LRN has seen stronger estimate revision activity and sports more attractive valuation metrics than BFAM, so it seems like value investors will conclude that LRN is the superior option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:12"
}