{
  "url": "https://www.nasdaq.com/article/g-iii-apparel-group-ltd-giii-q2-2020-earnings-call-transcript-cm1208193",
  "title": "G-III Apparel Group Ltd (GIII) Q2 2020 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "Image source: The Motley Fool.",
    "G-III Apparel Group Ltd (NASDAQ: GIII)\r\n Q2 2020 Earnings Call\r\n Sep 5, 2019 , 8:30 a.m. ET",
    "Operator",
    "Welcome to the G-III Apparel Group Second Quarter Fiscal 2020 Earnings Conference Call. My name is Paulette, and I will be your operator for today's call. [Operator Instructions]",
    "I will now turn the call over to Neal Nackman, the Company's CFO. Sir, you may begin.",
    "Neal S. Nackman -- Chief Financial Officer",
    "Thank you. Good morning and thank you for joining us. Before we begin, I would like to remind participants that certain statements made on today's call and in the Q&A session may constitute forward-looking statements within the meaning of federal securities laws. Forward-looking statements are not guarantees, and actual results may differ materially from those expressed or implied in forward-looking statements. Important factors that could cause actual results of operations or the financial condition of the Company to differ are discussed in the documents filed by the Company with the SEC. The Company undertakes no duty to update any forward-looking statements.",
    "In addition, during the call, we will refer to non-GAAP net income, non-GAAP net income per share and to adjusted EBITDA, which are all non-GAAP financial measures. We have provided reconciliations of these non-GAAP financial measures to GAAP measures in our press release, which is also available on our website.",
    "I will now turn the call over to our Chairman and Chief Executive Officer, Morris Goldfarb.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "Good morning, and thank you for joining us. With me today are Sammy Aaron, our Vice Chairman and President; Wayne Miller, our Chief Operating Officer; Neal Nackman, our Chief Financial Officer; and Jeff Goldfarb, Executive Vice President; and Priya Trivedi, Vice president of Investor Relations.",
    "Let's review the results of our second quarter. Our results were in line with our bottom line expectations and were led by continued outperformance in our wholesale business, which was more than offset -- which more than offset heightened challenges in our own retail operations. Second quarter net sales were up 3% to $644 million. Our second quarter wholesale net sales increased 8% to $589 million. Our second quarter non-GAAP net income per diluted share was $0.23 compared to $0.22 in last year's second quarter.",
    "Let me provide you some details on our own retail operations. By the end of this year, we will have eliminated over 140 stores, down from over 350 stores, which represents approximately a 40% decrease of our Bass and Wilsons stores. We're being aggressive in finding a solution for the remainder of our own retail operations. In July, we engaged outside advisors to assist us with this process. Our own DKNY and Karl Lagerfeld stores reflected low single-digit positive sales comps for the quarter despite the reduced traffic and high volume tourist centers, which is where many of these stores are located. For the second half of the year, we anticipate performance benefits at DKNY and Karl Lagerfeld stores as a result of improved product and store design. We remain committed to eliminating the losses in our own retail operations as swiftly and as efficiently as possible.",
    "Before we get to our wholesale business, I'd like to provide you with an update on our sourcing operations and tariffs. For many years we've emphasized that proficiency in our global sourcing capabilities and our strong vendor relationships. Our strength has always been to deliver great quality product that's priced competitively and delivered on time. As we've shifted production globally, we've historically moved with our long standing vendors who've overseen new factory development. We believe that consistent management oversight and expertise are essential, regardless of the country of origin. Four years ago, we sourced about 80% of our production from China. In spite of the fact that our overall business has grown dramatically, we estimate production in China will be down to less than 50% this year. Most importantly, we've done so with the comfort of knowing that we are in the right countries with the right partners. We believe we have significant additional sourcing opportunities outside of China over the next several years.",
    "Now let me address tariffs. As the risk of tariffs have increased over the past six months, we strategically accelerated inventory receipts from our suppliers, which is reflected in our higher inventory balances as compared to the second quarter of last year. I just recently met with several of our largest Chinese vendors who continue to be extremely supportive in sharing the tariff cost implemented today. Our ability to accelerate inventory receipts, as well as obtain vendor support are expected to minimize the impact of tariffs on our financial results for this fiscal year.",
    "Looking ahead to next year, while the effect of trade negotiations and tariffs between the US and China remains uncertain, we expect to be able to mitigate the impact of tariffs through continued expansion of our sourcing alternatives, obtaining further price concessions from our vendor partners in China and implementing selective wholesale price increases where we deem appropriate.",
    "Our wholesale business remains a key driver of our results. Calvin Klein, our largest business and one of the dominant resources in the women's apparel market, had another solid quarter of growth. I'm also pleased to report that the extension of our partnership with PVH as a result of the new women's CK Jeans license is off to a very strong start. Our partnership with PVH is something we do not take for granted. We appreciate the fact that they continue to provide us with new opportunities. The newly developed CK Jeans product line has garnered significant interest and generated a strong initial order book. Shipments will begin from this holiday season. We believe that we can build a substantial lifestyle women CK Jeans business that will grow to $250 million in annual sales over the next several years.",
    "We continue to develop our product base to increase the diversification of our classification businesses. Over the last year, we developed an internal strategy to make denim a significant classification for the Company. With the launch of CK Jeans, the expansion of our Tommy Jeans collection and the future launch of DKNY Jeans, we will become a very important resource in the denim space. These denim initiatives, with some of the world's most recognized brands will enable us to dominate the category. This is exactly what we've accomplished in our other classification such as outerwear, dresses, performance and women's suits.",
    "Moving on to our Tommy Hilfiger business. Second quarter performance continued to reflect the strength of this brand and our product with greater than 30% sales growth compared to the second quarter last year. The growth in the business was once again broad based. We continue to find multiple ways to create product line extensions to appeal to a wider consumer. For example, within the Tommy Hilfiger sportswear business, we've expanded our distribution to Dillard's and Nordstrom's for this fall. We're excited by new developments in the Tommy Hilfiger Jeans business.",
    "For spring 2020, we've created a completely new collection named Tommy Jeans, which will be housed in the jeans area in department stores and also be sold to better specialty stores. Featuring jeans with multiple fits and washes, as well as tops that are softer, this line is designed to appeal to a more casual and younger customer. We believe Tommy Jeans has the potential to be a significant growth area for us. Our team's strong execution and expertise in design, merchandising, sourcing and selling are an integral part of the continued success of our Tommy Hilfiger business. Additionally, PVH's brand management expertise and compelling marketing capabilities have made Tommy Hilfiger a powerful global brand with far reaching appeal.",
    "Our Karl Lagerfeld business had a good quarter and we continue to experience traction in building this brand that we introduce to the North American market. We positioned Karl Lagerfeld Paris with an elevated brand status, as well as expanding the lifestyle appeal of the brand to incorporate a more casual element. To honor Karl Lagerfeld's Creative Design Legacy, the brand is launching a tribute to Karl, the White Shirt Project. Actors, models, fashion designers and friends of Karl have been invited to create a version of his iconic white shirt. The line of shirts will be sold exclusively on karl.com and farfetch.com with all proceeds of sales going to charity.",
    "Our own DKNY and Donna Karan brands registered another strong quarter with greater than 20% sales growth compared to last year's second quarter. We're making good progress with our international distribution. We're now operating our own shops in Spain and Portugal in El Corte Ingles, one of Europe's largest department stores. Overall for DKNY, we continue to create synergies and are looking forward to moving the brand's teams from their 120,000 square foot legacy office space to a newly designed, modern and highly efficient 70,000 square foot space within the same building as G-III's headquarters.",
    "On the DKNY marketing front, building upon the success and momentum of last year's digital first 100% DKNY campaign, we're excited to elevate this year's fall campaign to feature a global megastar Halsey. With roots in New York City, Halsey is a global power with endless talent as a singer, songwriter and artist, making her an ideal match as a brand ambassador for the DKNY brand. Halsey has a strong social media presence with over 36 million fans and followers across all social media platforms. The fall ad campaign will also include extensive media, digital, print and outdoor placements in major cities throughout the world.",
    "Additionally, next Monday, during the heart of New York Fashion Week, DKNY will host a birthday party in Brooklyn to celebrate its 30th anniversary. The festivities will include a performance by Halsey. Licensing continues to be another great opportunity for the brand. It is an important profit driver and a great way to expand our global presence through the introduction of additional lifestyle product categories. This past quarter, we entered into a long-term exclusive global license for DKNY intimate apparel, with world class partner Komar, who has also been DKNY's sleepwear partner since 2008. Komar will transition the license from HanesBrands in January 2020. Capitalizing on continued success of our DKNY home business, we also signed the license agreement for DKNY Furniture with Living Style Group, a leading pure play online furniture company and are looking forward to the launch this fall.",
    "Based on all these initiatives and the strength of the order book, we are now anticipating DKNY brands wholesale net sales growth to be approximately 25% for this fiscal year. Our successful management, product development and distribution capabilities have set the stage for many years of meaningful growth for the DKNY brand.",
    "Lastly, in spite of a global tourist travel headwinds, Vilebrequin, our status swimwear and resort brand, continues to perform well with mid-single digit comp sales increases. We continue to expand the brand's footprint. This quarter we opened four stores including Las Vegas, Rome and Capri, as well as two pop-up stores in Macao and Paris. Also this quarter, the brand launched a highly anticipated collaboration with Off-White, designed by Virgil Ablow, who also is the artistic director for Louis Vuitton menswear. The collaboration sold out very quickly and gained significant global fashion press. We will continue to find creative ways to expand the awareness of this iconic status brand.",
    "Corporatewide online sales continue to be a focus for us. We see this as an opportunity to gain market share and sure that our brands and product are well represented and showcased in our -- on our retail partners websites as well as our own. We will continue to invest in personnel and systems in the online space.",
    "I'll now pass it on to Neal for a detailed discussion for our second quarter results and our guidance for fiscal 2020.",
    "Neal S. Nackman -- Chief Financial Officer",
    "Thank you, Morris. Net sales for the second quarter ended July 31, 2019 increased approximately 3% to $644 million from $625 million in the same period last year. Net sales of our wholesale operations segment increased 8% to $589 million from $545 million, and the Tommy Hilfiger, DKNY and Calvin Klein brands were the main drivers of this increase.",
    "Net sales of our retail operations segment for the quarter were $84 million, approximately 22% lower compared to last year sales of $107 million. We reported same-store sales decreases of approximately 21% for our Wilson stores, 16% for our G. H. Bass stores, and an increase of 3% to DKNY. Net sales of our retail operations segment were also negatively affected by the decrease of approximately 55 stores operated by us as compared to the second quarter of last year.",
    "Our gross margin percentage was 36% in the second quarter of fiscal 2020 as compared to 37.1% in the prior year period. Part of this decrease in gross margin is a result of the decreasing penetration of the retail segment, which operates at a higher gross margin and impacting gross margin rates by approximately 50 basis points. The gross margin percentage in our wholesale operation segment was 32.8% compared to 33.4% in last year's quarter. The gross margin percentage in our retail operation segment was 46.5% compared to 46.6% in the prior year's quarter. SG&A expenses were $196 million in the fiscal quarter compared to $199 million in the same period last year.",
    "Net income for the second quarter of this fiscal year was $11 million or $0.23 per diluted share compared to $10 million or $0.20 per diluted share from last year's quarter. Non-GAAP net income per diluted share was $0.23 for the quarter compared to $0.22 per share in the prior year. Non-GAAP results in this quarter exclude the impact of non-cash imputed interest and a gain on lease terminations.",
    "Looking at our balance sheet. Accounts receivable increased to $465 million from $448 million at the end of the second quarter, up approximately 4% and in line with our wholesale sales growth. Inventory increased approximately 24% to $842 million. As we discussed in last quarter's call, we had expected inventories to continue to build. As Morris mentioned earlier, this increase is higher than our forecasted sales growth as a result of accelerated inventory receipts in anticipation of the fourth tranche of tariffs, as well as the normalization of the post-launch year inventory balances for the DKNY brand.",
    "We anticipate inventories will be back in line at the end of this fiscal year. We spent approximately $18 million on capital expenditures this year-to-date. We have long-term debt outstanding of approximately $554 million at the end of this quarter compared to $494 million at the end of the second quarter last year. We also purchased approximately 1.3 million shares with $35 million and have 2.9 million shares outstanding under our authorized share repurchase program. Our quarter ending cash balance was $40 million this year compared to $42 million a year ago.",
    "As for our guidance, we are revising our fiscal year ending January 31, 2020 guidance to include the impact of the fourth tranche of tariffs, which we estimate will cost us approximately $12 million for this fiscal year. We are now forecasting net sales of approximately $3.3 billion. Net income between $154 million and $159 million, or between $3.10 and $3.20 per diluted share. This compares to net sales of $3.08 billion and net income of $138 million or $2.75 per diluted share in fiscal 2019. On an adjusted basis, excluding non-cash imputed interest expense of $5 million and a $2 million gain on lease terminations, we are anticipating non-GAAP net income between $156 million and $161 million or between $3.15 and $3.25 per diluted share compared to non-GAAP net income of $144 million or $2.86 per diluted share in the previous year. Our guidance continues to assume a weighted average diluted share count of approximately 50 million shares.",
    "We are projecting full year adjusted EBITDA for fiscal 2020 between $295 million to $300 million compared to $269 million in fiscal 2019. We now anticipate the non-GAAP retail losses in our retail operations segment in fiscal 2020 will be approximately $5 million higher than the loss in fiscal 2019. This assumes a high single-digit comp declines at both Wilsons and Bass for the full year.",
    "DKNY retail sales are planned about flat to the prior year as the average comp store count is down. As for DKNY wholesale and licensing operations, revenues are now planned to grow by approximately 25%. For our third fiscal quarter ending October 31, 2019, we are forecasting net sales of approximately $1.17 billion and net income between $90 million and $95 million or between a $1.85 and $1.95 per diluted share. This compares to net sales of $1.07 billion and net income of $94 million or $1.86 for diluted share reported in the third quarter of fiscal 2019.",
    "On an adjusted basis, we are forecasting non-GAAP net income between $91 million and $96 million or between a $1.87 and $1.97 per diluted share as compared to non-GAAP net income of $95 million or $1.88 per diluted share in the previous year's quarter. And as for our retail operations, we are assuming a high single-digit comp decline in total for the quarter.",
    "That concludes my comments. I will now turn the call back to Morris for closing remarks.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "Thank you, Neal. Our winning formula for success is unwavering in what remains a difficult retail environment. Thanks to a world class team. We have a track record of being able to adapt and thrive in any environment. We will continue to strategically leverage the strength of our global power brands, DKNY, Donna Karan, Calvin Klein, Tommy Hilfiger and Karl Lagerfeld, through brand right design and development to create great commercial product. We continue to grow our capabilities and elevate our position as a supplier of choice for our retail partners.",
    "Backed by our strong financial position, G-III remains poised to achieve significant growth over the next several years. I'd like to thank our shareholders, partners and stakeholders for their continued support.",
    "Thank you, operator. We're now ready to take some questions.",
    "Operator",
    "Thank you. We will now begin the question-and-answer session. [Operator Instructions] And our first question comes from Ed Yruma from KeyBanc Capital Markets. Please go ahead.",
    "Edward Yruma -- KeyBanc Capital Markets -- Analyst",
    "Hey, good morning, and thanks for taking the questions. I guess, first on the net impact of tariffs, I know there are a couple of moving pieces in guidance, including just kind of continued weakness in your owned retail operations. Can you give us what the incremental impact from tariffs was with the revision of guidance and what the implied loss is on the retail business given the updated numbers?",
    "Neal S. Nackman -- Chief Financial Officer",
    "Yeah, so the -- it's about a $12 million impact that we are absorbing for the forecasted period. And with respect to the retail operations, I would tell you that we took down -- we took down top line sales essentially in the low-single digit zone incrementally so that we're now really looking at high-single digit negative comps for the second half. It's approximately $4 million of additional losses in the back half.",
    "Edward Yruma -- KeyBanc Capital Markets -- Analyst",
    "Got it. And Morris it sounds like you've got some really exciting momentum in the denim business. I guess if you step back, I know you gave some of the components of denim, but kind of if we look out longer term, what is denim as a percent of sales or kind of what's the total denim opportunity and how does the denim business differ in from margin perspective from some of your other kind of wholesale warehouses? Thank you.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "Thanks for the question. And we look at denim as as a huge opportunity for the Company. Uniquely, we again have the best brands for giving us the ability of marketing denim with each one of them and what hopefully would be housed in denim classification where we're working closely with our retailers. We believe, clearly, I said that the CK Jeans opportunity over the next several years is possibly $250 million. If you take Tommy, I think Tommy is in that zone as well. And I believe that with the DNA of DKNY hitting another customer base, we again have a similar $200 million to $250 million possibility. So the entire classification has the ability of reaching $500 million to $750 million in sales. We can clearly look at -- we're approaching the business a little differently than call it a pure play denim vendors. The Levi's model is different than each one of ours. Ours will be more focused on tops than denim as a fabrication. It will be young, it will be active, it will be spirited in a similar fashion, but I believe that you'll see a definitive difference in how we market when we finally hit the stores which is soon to come. We will be poised in the fourth quarter for you to get a good view of what we will look like for the future and it is unique, it is exciting, and our retailers share the same -- the same attitude that we do. The bookings are strong. The margins on the denim side of the business should be pretty much in the same zone as our performance area. So we're excited. It again is another platform for us to pursue and it's consistent with everything that we've built from the coat business on dominating classification as I've said earlier in the prepared script is what we do best.",
    "Edward Yruma -- KeyBanc Capital Markets -- Analyst",
    "Great. Thank you so much.",
    "Operator",
    "Our next question comes from Erinn Murphy from Piper Jaffray. Please go ahead.",
    "Erinn Murphy -- Piper Jaffray -- Analyst",
    "Great. Thanks, good morning. Morris, I was hoping if you could talk a little bit more about, kind of, some of your mitigation strategies against raising tariffs. It sounds like you believe you have some flexibility, particularly into next year as well. So maybe to speak to the regions you've been diversifying into and then what is your general view on price increases? Do you have any plan for the back half and do you think the consumer out there is strong enough to take them generally? Thanks.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "Thanks for your question, Erin. It's a good one. It's not a surprising one. It is clearly the topic of choice, but people forget that different companies have different strengths. We were known to be incredibly strong on our sourcing capabilities. Each one of our leaders is really an entrepreneur who pretty much owned the zone business, traveled overseas, developed the country of choice for that given period and moved on. That's basically who we are. We were initially poised to run our business for a lifetime out of South Korea, that changed. We moved to Indonesia, we then moved to Outer Mongolia of all places, we then moved into China. And then we have satellites in Vietnam, we have satellites in today still in Jakarta, Jordan. We're in the Caribbean based countries. There is not a country that we are not well positioned in with significant talents sitting in all those countries.",
    "Our main office is in Hangzhou, China. And in Hangzhou, it's not led by a Chinese executive, it happens to be an Irishman supported with Chinese, South Koreans, French, Indonesians, Indians and we are poised to move anywhere that we need to move. We've proved that out historically. We're doing what is absolutely prudent. If we were to move all our production out of China overnight, we would be a bad risk for an investor. I think we solidify our ability to produce product in quality forum on time for our retailer, and that's what we need to do primarily as we solve the problem of sourcing in the best country necessary. So right now, the call out has been from pretty much every institution or every analyst, have you gotten all your production out of China? Once you get your production out of China, you're terminal. You can't bring it back. Those factories will go out of business. The G-III factories will go out of business, because they're highly dependent on G-III.",
    "You can't make a U-turn if all the trade issues are solved, then say, you know, I made a mistake, I'm going back to where it's best for me. So you still need to keep a foothold to -- till we fully recognize the depth of the problem and the term of the problem. So we are exactly where we want to be. If it was necessary for us to take another 50% of the 50% out of China, which would leave us with maybe a 25% dependency and that would be primarily because of what we believe is a shoe issue, which we're not able to source efficiently today. All our needs for issues outside of China, short [Phonetic] of that we can move much more out of China if we believe it's necessary. We don't believe it's prudent today and we still operate our business for long-term sustainability and not for a quarter. So it's where we are.",
    "As far as price adjustments, we've tested price adjustments in our own stores. We've raised our retails. And quite honestly, we took the promotional signage of our DKNY stores and our business is better. There is no resistance to price increase on good product. Price is very helpful and you need to promote product or you need to dispose of product, but if you're constantly delivering new fashion products, there is the ability of raising your prices. We don't produce commodities, we don't produce underwear, we don't produce dress shirts as a commodity. We produce fashion apparel with primary brands. So I think that gives us the ability in select areas of raising our prices as needed. We are a fashion company. We are not a hard commodity company.",
    "I hope that answers your question a little bit if you -- if I can help you any further, please ask.",
    "Erinn Murphy -- Piper Jaffray -- Analyst",
    "Yeah. Just one clarification on the price increases. You said you increased your retail pricing in store. Is that just DKNY stores and...",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "Just DKNY, because we believe our product is appropriate for it.",
    "Erinn Murphy -- Piper Jaffray -- Analyst",
    "Got it. And any planned price increases on the wholesale side in the back half of this year?",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "We've done it already.",
    "Erinn Murphy -- Piper Jaffray -- Analyst",
    "Okay.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "We've raised prices moderately where we believe it's effective and our early indicators are that is working as well. Now it's a little bit too early. Our shipments just began for fall, but the early indicators are whatever we shift has worked.",
    "Erinn Murphy -- Piper Jaffray -- Analyst",
    "Got it. And then just last question for me is just generally how are you feeling about the fall holiday season? Can you comment on your order book? I think it was 75% completed at the end of the last quarter. And any kind of trends on back-to-school thus far? Thank you.",
    "Neal S. Nackman -- Chief Financial Officer",
    "Erin, our order book today is over 85% complete. So we're happy with where we sit. We're happy with the inventory that we hold to support reorders. Our inventory is current. Our inventory is really solid good inventory. So I don't think this company has been -- ever been in a better position. We're poised for growth. We're poised for prosperity and we have the best brands in the industry to support that and we have the best team in the industry. As you walk through our company, you'd be amazed as the talent pool that we've amassed in the last three or four years. It's clearly best-in-class.",
    "Erinn Murphy -- Piper Jaffray -- Analyst",
    "Great. Thank you so much.",
    "Operator",
    "Our next question comes from John Kernan from Cowen. Please go ahead.",
    "John Kernan -- Cowen & Company -- Analyst",
    "Hey, good morning, Morris and Neal. Thanks for taking my question.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "Thanks, John. Thanks for being here",
    "John Kernan -- Cowen & Company -- Analyst",
    "Sure. Neal, just the $12 million that you provided us in terms of the tariff this year, obviously that's assuming 15% for the remainder of the year. I'm just wondering if you can help us with math into next year. There seems to be a pretty wide range of estimates out there right now in terms of what the P&L impact is for you. Is there anything you can do to help us understand what the overall impact would be in a 15% tariff scenario for next year? We can obviously do some back of the envelope math on what you're giving us now, but just wondering if there's anything more substantial you can give us in terms of tariffs for next year and what the plans are?",
    "Neal S. Nackman -- Chief Financial Officer",
    "Yeah, John, it's -- look, it's hard for us to give you a specific number for next year. Like Morris said, we're reacting to what's happening. Our ability to move product and reduce the product that we have subject to tariffs we think is significant. The impact of price increases that we take could also be significant. So it's very hard to give you a specific number. I would just -- just in terms of a lot of the mechanics that analysts have been going through, keep a few things in mind, we do have about 14% of the goods that we import or ship directly in terms of our disclosures. We have disclosed in the prior year that we imported -- that we purchased about 61% of our product from China. So some of the analysts have gotten this correct. The math would be that you would want to subtract anything that's actually an exported item. So that's about 15% of our product.",
    "The other key factor, probably to give you a little more framing is that when you think about FOB or merchandise costs, I think if you use the 75% figure as far -- as far our cost of goods sold, that's a reasonable barometer. I think as far as you know, specifically what will be coming in from tariffs, like I said, it's a little bit early for us to give you specific guidance on that. And also lastly, as we mentioned, the vendor support has been significant as we expected and we hope that that will continue as well.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "So John it's relatively -- [Speech Overlap] John, it's relatively easy to take total import number and tack on 15% and say that's a liability. What we're getting is great participation with vendor partners. We believe there is opportunity to raise some prices where as I said were appropriate. So it's hard to come back to you and give you a fixed number. We believe that we're in good shape. We believe that we can provide earnings growth for the coming year and we've gone through crises many times. We've gone through areas where we didn't lose just our vendors, we lost our customers and we turned it around and found new customers, new opportunities that's what this company is. We've been around from 1956 on this. This is not a company that went out and tacked on a brand and created some success for short periods of time. We're a proved out provider of product into the wholesale industry. Our failure today is the retail piece of it. That's where the frustration in our world exist today and we're trying to get better at it. But I don't have a lot of concerns for the future of our wholesale.",
    "John Kernan -- Cowen & Company -- Analyst",
    "That's actually very helpful. Thank you. Just a follow-up on the retail business. Morris, you did mention that you're working aggressively toward a solution. You will restart some advisors to assist you in strategic alternatives. Any update in terms of the lease expirations into next year and how we model the store base over the next two to three years?",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "I don't think you're going to be satisfied with my answer on lease expirations. We're far more aggressive than purely the lease expirations. You know, we have three directions to approach. Right now, there's a little sensitivity in discussing them, but there are three opportunities that exist for our retail solutions, and they're all pretty good. As far as store count, we've eliminated about 40% of our store base in the last year -- three years. I'm sorry, in the last three years. So I can assure you that there'll be a continued reduction or possibly elimination of some of our retail. We're on it. It's not taking a pill and disposing of it. We've hired outside consultants to help us in the areas that we're struggling with and we will get there.",
    "John Kernan -- Cowen & Company -- Analyst",
    "Got it. Thank you. Just my last question would be. We can obviously see your success on the floor of many of your top wholesale partners. Just any comments on how is the performance digitally, any initiatives that you're pursuing in the digital space with your top wholesale partners? Thank you.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "We're successful in all our brick and mortar stores that have an online component. We're at least equally successful as they grow their online business, our business with them grows. And we -- in most cases, I believe I can comfortably say we lead the charge in performance in women's apparel on those sites. We do have -- we have a strong business with Amazon that we were jointly trying to build a little bit more aggressively. They -- we've pulled back a little bit for a good reason for our company, and now we've stepped on the gas a little bit for an effort to build Amazon and the pure play online businesses as well.",
    "John Kernan -- Cowen & Company -- Analyst",
    "Excellent. Thank you.",
    "Neal S. Nackman -- Chief Financial Officer",
    "Thank you.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "Thanks for your question.",
    "Operator",
    "Our next question comes from Rick Patel from Needham & Company. Please go ahead.",
    "Rick Patel -- Needham & Company -- Analyst",
    "Thank you. Good morning, everyone. Just a follow-up to John's question on tariff. So I understand it's very tough to pinpoint the exact impact, but as we think about this from a very high level, is your general thinking that the pain will be shared evenly among G-III, the manufacturers and wholesale partners or do you think you can offset more than that? Just some broad context would be helpful, because obviously it causes big swings to next year's projections?",
    "Neal S. Nackman -- Chief Financial Officer",
    "So, we -- I don't think we've ever stated it was an equal swing between our wholesale partners and ourselves. It -- strongly it's got three elements that it affects. It affects our vendors, our wholesale partners and ourselves. So our job is to make sure that the product to retail at whatever price we put it out at. If the product doesn't retail, we've done something wrong. It's generally not the retailer. We've positioned it wrong, we designed it wrong or we sourced it inefficiently. So as of now, we've not determined we've done anything wrong, the product is selling, we've increased some pricing where we believe the consumer can accept it and will modify it as time goes on. We're not going in and saying, all of the increase has to be contributed by the consumer -- the direct consumer. She's not paying for it. We are -- initially, we're paying for part of it, our vendors are paying for part of it, and to a lesser degree, our wholesale partners are beginning to pay for it.",
    "Rick Patel -- Needham & Company -- Analyst",
    "That's helpful. And as far as the outlook goes, your second quarter came in a little bit softer versus your expectations where your annual guidance was taken up by about $20 million. Can you help us understand the mechanics of that? Did timing shifts come into play or is it all CK Jeans, just curious on what's driving the change versus the implied back half from prior guidance?",
    "Neal S. Nackman -- Chief Financial Officer",
    "Yeah, Rick, the second quarter top line, this is where really about half of that attributable to the retail business and the comp coming in higher than we had planned. If you looked at the top line message [Phonetic] the wholesale part of the business, it was probably less than 1% impact. And if you looked at the performance of our wholesale businesses by brand, they were really strong across the Board. So there was no particular category or brand to suggest let us down in the second quarter.",
    "With respect to the second half, the strength is primarily driven by Calvin Klein Jeans business being new being. It showed well. We've got an order book that's been developed. We rolled that into the forecast. And then in addition to that, our DKNY order book has also strengthened and we've rolled that into the forecast. And as I mentioned earlier, we did take down some of the retail sales for the second half. So those are the main moving pieces in terms of top line, both for the second quarter and the second half.",
    "Rick Patel -- Needham & Company -- Analyst",
    "Thanks a lot. Good luck as well.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "Thank you.",
    "Operator",
    "Our next question comes from Dana Telsey from Telsey Advisory Group. Please go ahead.",
    "Dana Telsey -- Telsey Advisory Group -- Analyst",
    "Hi. Good morning, everyone. As you think about the Denim Jeans business with the Calvin business that you have into the category overall, are you getting additional square footage in your wholesale accounts given the improvement in the products that you've put together? And then lastly, on the retail component, what did you see in the outlets this quarter, traffic, how did it compare to prior quarters tourism? What did you see as the change there? Thank you.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "Thanks for your question, Dana. Dana, not only do we get additional footage, we get additional budget for a new classification. So in most cases, the pad is a denim pad, where difficult, it shares some space, but generally it's additional footage, it's additional signage, it's specific marketing that goes toward it. And in many cases, it's a different floor. If it's a -- if it's a multiple floor department store, you might find denim on an active floor or denim floor, and our products -- our Calvin products spread out through the store in many different locations.",
    "As far as your question on traffic, traffic has been down. Traffic in tourist inspired centers is down dramatically. And I think I addressed it in my presentation, in spite of that, tourist centers that are pretty much occupied with tenancy of DKNY, Karl Lagerfeld and Vilebrequin are doing well. All of them are posting positive increases. The rationale for it, I believe, is a much better product than we've historically had for DKNY. The introduction of Karl Lagerfeld and the unique events that we've done with Vilebrequin. So those centers -- those brands in those centers are doing well.",
    "Traffic in some of the other centers is -- in the centers that we have Bass and Wilsons in, they're much broader, their door count is much more aggressive. The traffic is not our only problem. Product was was an issue, management was an issue, fixture has been an issue. So we have a host of problems in the core piece of our retail. We call it the more luxury segment of what we provide and the globally recognized brands are doing much better.",
    "Dana Telsey -- Telsey Advisory Group -- Analyst",
    "Thank you.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "Thank you, Dana.",
    "Operator",
    "And our next question comes from Heather Balsky from Bank of America. Please go ahead.",
    "Heather Balsky -- Bank of America Merrill Lynch -- Analyst",
    "Hi. Thank you for taking my questions. First, can you talk about what you're seeing from an input cost perspective outside of trade? And then, also it looks like you bought back some stock. Can you talk about your plans for free cash flow this year and how you're thinking about buybacks and -- debt pay down for the rest of the year? Thanks.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "Heather, I'm starting with the back part of your question. Look, the cash flow and the business continues to accelerate. So we're very bullish about that. We did step into the market before prices being where they are. We may do that again. If we don't do stock buybacks, the first -- the most pressing use of our free cash flow will be to pay down our term loans, which are the highest interest rate piece of the capital structure. And as far -- and then as far as the input cost, sorry, we were actually not seeing any significant pressure on input costs. I think the biggest challenge we have is obviously the tariff issue.",
    "Heather Balsky -- Bank of America Merrill Lynch -- Analyst",
    "Thank you very much.",
    "Operator",
    "And our next question comes from Jim Duffy from Stifel. Please go ahead.",
    "Peter McGoldrick -- Stifel Financial Corp. -- Analyst",
    "Hi. This is Peter McGoldrick on for Jim. Thanks for taking my question. I've got a quick one on wholesale margins. If you were to split the license and -- if you just split the licensed brands led by CK, how did those operating margins compared to that of your own brands as you see DKI margins improving from low-mid single digits. Could you share the trends in that business?",
    "Neal S. Nackman -- Chief Financial Officer",
    "Yeah, I would say that overall the -- we're down about 60 basis points and that was pretty evenly spread -- between our own brands and the licensed brands.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "But clearly, Peter, our own brands are providing -- they will provide this year a better margin. We have international capabilities with our own brands. With Calvin Klein and Tommy Hilfiger, we're limited to North America, and our margin is far better in Europe with DKNY than it is in the States. Our product is getting better. The breadth of our product is improving, where we're beginning to operate shop-in-shops. As I stated in El Corte Ingles, we will have to assume that recapture on margin in shops that we run is going to be better than just providing -- just providing wholesale product. So the brands that we own were bought with the intention of providing better margin for ourselves and our investors, and I believe we're operating consistent with what our plan was.",
    "Peter McGoldrick -- Stifel Financial Corp. -- Analyst",
    "Okay. Thank you. And then just a point of clarification on that. The licensed brands despite having the royalty payment, do you have a higher operating margin than the own brands right now?",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "No...",
    "Neal S. Nackman -- Chief Financial Officer",
    "We've tripled that actually. The owned brands have a higher gross margin and operating margin than the license, because of the -- primarily because of the royalty.",
    "Peter McGoldrick -- Stifel Financial Corp. -- Analyst",
    "Okay. Thank you. And then in terms of the outlook, as you look into 4Q, it looks like there's a margin improvement built in there. Could you shed light on the key drivers of improvement? Are there any one-time pieces or any other key call-outs?",
    "Neal S. Nackman -- Chief Financial Officer",
    "Yeah, Peter, primarily the -- we think that compares in the fourth quarter are actually in our favor that last year's Q4 was a little more significant versus the other quarters and certainly versus what we're expecting for this fourth quarter.",
    "Peter McGoldrick -- Stifel Financial Corp. -- Analyst",
    "Okay. Thank you very much.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "Thank you, Peter.",
    "Operator",
    "And our last question comes from Susan Anderson from B. Riley FBR. Please go ahead.",
    "Susan Anderson -- B. Riley FBR -- Analyst",
    "Hi, good morning. Thanks for taking my question. I was curious on the DKNY wholesale growth. Maybe if you could talk about performance in the department store channel, particularly the new department store doors versus the Macy's doors?",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "Sure. It takes a little while to launch a brand, particularly the way that we do it. We have about a dozen different classifications of product with a dozen management teams and a dozen different locations within the stores. So they don't all work parallel. You know, sometimes the dress business launches is very strong, the sportswear business is a little slower, performances of the shorts is great and footwear is weak. I'm using those as an example, please don't take me literally, because that's really not the case. But we launch -- we try to launch as many classifications simultaneously to make an impact in the store. We derive a benefit of broader distribution within the retail box and more attention if the brand is obvious in a multitude of locations. So we're getting good. Our business is is growing dramatically.",
    "As I said earlier, we're -- we will have 25% growth in DKNY this year. The expansion of door count is very important, and the expansion of our customer base really creates the door count expansion. We originally bought DKNY as Macy's Exclusive. As the brand matured, the decision was made that it would not be a Macy's Exclusive any longer, and the brand was adopted by pretty much every department store. We're distributing it now. The delegates [Phonetic] is supportive of the brand. There is distribution in pretty much all of the department stores. It's a good launch in Europe. So we're where we expect to be. We were fortunate to find an acceptance for the brand and some of the elements of the brand in places like Foot Locker and DICK'S",
    "is a potential customer of the brand. So we're in a good space. Quite honestly, I would tell you surprisingly good space as it relates to distribution.",
    "Thank you for your question, Susan.",
    "Susan Anderson -- B. Riley FBR -- Analyst",
    "Great. That's helpful. If I could just add one follow-up on the China tariff, not to beat a dead horse, but I may have missed this, did you guys say if there is a third quarter impact or is it all in fourth quarter? And then, I guess, I was kind of curious how much of the product were you able to ship in early? I guess, just trying to figure out the $12 million impact. Is that like one quarter's worth of tariff impact?",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "Yeah. So we think it impacts both Q3 and Q4. It'll be more toward Q4. Obviously, we've got the significant inventory increase in terms of bringing inventory in early. So that will help directly offset the Q3 impact, but it'll impact Q4 more than Q3, but it will impact them both.",
    "Susan Anderson -- B. Riley FBR -- Analyst",
    "Great. Thank you. Thank you so much. Good luck for next quarter.",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "With that, thank you very much for listening in. Thanks for your questions and have a great day.",
    "Operator",
    "[Operator Closing Remarks].",
    "Duration: 57 minutes",
    "Neal S. Nackman -- Chief Financial Officer",
    "Morris Goldfarb -- Chairman & Chief Executive Officer",
    "Edward Yruma -- KeyBanc Capital Markets -- Analyst",
    "Erinn Murphy -- Piper Jaffray -- Analyst",
    "John Kernan -- Cowen & Company -- Analyst",
    "Rick Patel -- Needham & Company -- Analyst",
    "Dana Telsey -- Telsey Advisory Group -- Analyst",
    "Heather Balsky -- Bank of America Merrill Lynch -- Analyst",
    "Peter McGoldrick -- Stifel Financial Corp. -- Analyst",
    "Susan Anderson -- B. Riley FBR -- Analyst",
    "More GIII analysis",
    "All earnings call transcripts",
    "10 stocks we like better than G-III Apparel Group\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks  for investors to buy right now... and G-III Apparel Group wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "This article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.",
    "Motley Fool Transcribers has no position in any of the stocks mentioned. The Motley Fool owns shares of G-III Apparel Group. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 01:23:34"
}