{
  "url": "https://www.nasdaq.com/article/why-are-families-starting-to-run-like-businesses-cm1206955",
  "title": "Why Are Families Starting to Run Like Businesses? - Nasdaq.com",
  "text": [
    "  This article was     first published by MyWallSt.   Which 2 pot stocks will beat the market? Find out in our       free guide!   Workplace communication software has doubtlessly changed the   face of modern business. The advent of   Slack    (NYSE: WORK) ,   Atlassian    's (NASDAQ: TEAM) Trello, and   Microsoft    's (NASDAQ: MSFT) Teams has enacted such a transformation on how   coworkers interact that even email has begun to look like a dusty   old technology. However, people have increasingly grasped the value these   tools can have outside of the office. More and more, households   across the country are adopting the likes of Slack and Trello to   better run their family lives. The data is not yet in, but with   features that allow for task management, event organization,   project planning, and real-time communication, these apps could   soon prove as invaluable to modern domestic life as microwaves   and air conditioning.makeArticleAd(); The need for smart technology in the household has been   growing as family dynamics have changed. With as many as 65% of   college-educated parents admitting to having trouble balancing   work and family life, a tool like Slack --   which permits a great deal of organization and   planning    , as well as individual and group chats -- has proven invaluable   to some parents.   Image source: Unsplash.  A recent piece published in   The Atlantic    , entitled \"The Slackification of the American Home,\"   investigated the phenomenon of using work   software    to better organize the household. One interviewee revealed that   her home life had been utterly changed by the adoption of Trello   and other tools: \"We do family meetings every Sunday where we   review goals for the week, our to-do list, and activities coming   up. ... I track notes for the meeting [in Trello]. I have   different sections, goals for the week, a to-do list.\" Mentioned by many of the families interviewed in the piece,   Trello is a particularly interesting case. Unveiled in 2011, the   app -- whose interface was inspired by the famous Kanban   scheduling system pioneered by   Toyota    's Taiichi Ohno -- allows users to visualize and manage projects   by dragging virtual cards between three categories: to do, doing,   and done. Trello really took off in 2017   when it was acquired by Atlassian    and incorporated into the larger software company's suite of   workplace apps. However, Trello's value in the home has not gone unnoticed by   Atlassian. \"We think of Trello as a tool you can use across work   and life,\" said Stella Garber, Atlassian's head of marketing.   \"The example we had on our homepage for a long time was a kitchen   remodel. On our mobile app, the example was a Hawaiian vacation.   We know humans have a lot of things they need organized, not just   what they have at work.\" Indeed, Atlassian's promotional material seems to reflect this   broadening market. Once billed more or less exclusively for   office workers and freelancers, the company's apps now emphasize   their utility in any sort of project planning. \"Whether it's for   work, a side project or even the next family vacation, Trello   helps your team stay organized,\" reads the app's current download   page. \"All happy families are alike,\" goes the opening sentence of   Anna Karenina    , \"but each unhappy family is unhappy in its own way.\" The rise   of tools such as Slack and Trello in the context of a household   may compel us to update Tolstoy's statement. In the future,   unproductive families may be unproductive in their own ways, but   the ones that function efficiently will all look about the same,   which is to say, something like a small -- and hopefully   successful -- business.   Image source: MyWallSt.     One of these pot stocks is         already +100% this year. What are you waiting for?     MyWallSt operates a full disclosure policy. MyWallSt staff     currently hold long positions in Atlassian, Microsoft and     Slack. Read our  full disclosure policy here  .    10 stocks we like better than Microsoft       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Microsoft wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       Teresa Kersten, an employee of LinkedIn, a Microsoft     subsidiary, is a member of The Motley Fool's board of     directors. The Motley Fool owns shares of and recommends     Atlassian and Microsoft. The Motley Fool owns shares of Slack     Technologies and has the following options: long January 2021     $85 calls on Microsoft. The Motley Fool has a     disclosure policy      .  ",
    " This article was     first published by MyWallSt.   Which 2 pot stocks will beat the market? Find out in our       free guide!  ",
    "Workplace communication software has doubtlessly changed the   face of modern business. The advent of   Slack    (NYSE: WORK) ,   Atlassian    's (NASDAQ: TEAM) Trello, and   Microsoft    's (NASDAQ: MSFT) Teams has enacted such a transformation on how   coworkers interact that even email has begun to look like a dusty   old technology.",
    "However, people have increasingly grasped the value these   tools can have outside of the office. More and more, households   across the country are adopting the likes of Slack and Trello to   better run their family lives. The data is not yet in, but with   features that allow for task management, event organization,   project planning, and real-time communication, these apps could   soon prove as invaluable to modern domestic life as microwaves   and air conditioning.",
    "The need for smart technology in the household has been   growing as family dynamics have changed. With as many as 65% of   college-educated parents admitting to having trouble balancing   work and family life, a tool like Slack --   which permits a great deal of organization and   planning    , as well as individual and group chats -- has proven invaluable   to some parents.",
    "  Image source: Unsplash. ",
    "Image source: Unsplash.",
    "A recent piece published in   The Atlantic    , entitled \"The Slackification of the American Home,\"   investigated the phenomenon of using work   software    to better organize the household. One interviewee revealed that   her home life had been utterly changed by the adoption of Trello   and other tools: \"We do family meetings every Sunday where we   review goals for the week, our to-do list, and activities coming   up. ... I track notes for the meeting [in Trello]. I have   different sections, goals for the week, a to-do list.\"",
    "Mentioned by many of the families interviewed in the piece,   Trello is a particularly interesting case. Unveiled in 2011, the   app -- whose interface was inspired by the famous Kanban   scheduling system pioneered by   Toyota    's Taiichi Ohno -- allows users to visualize and manage projects   by dragging virtual cards between three categories: to do, doing,   and done. Trello really took off in 2017   when it was acquired by Atlassian    and incorporated into the larger software company's suite of   workplace apps.",
    "However, Trello's value in the home has not gone unnoticed by   Atlassian. \"We think of Trello as a tool you can use across work   and life,\" said Stella Garber, Atlassian's head of marketing.   \"The example we had on our homepage for a long time was a kitchen   remodel. On our mobile app, the example was a Hawaiian vacation.   We know humans have a lot of things they need organized, not just   what they have at work.\"",
    "Indeed, Atlassian's promotional material seems to reflect this   broadening market. Once billed more or less exclusively for   office workers and freelancers, the company's apps now emphasize   their utility in any sort of project planning. \"Whether it's for   work, a side project or even the next family vacation, Trello   helps your team stay organized,\" reads the app's current download   page.",
    "\"All happy families are alike,\" goes the opening sentence of   Anna Karenina    , \"but each unhappy family is unhappy in its own way.\" The rise   of tools such as Slack and Trello in the context of a household   may compel us to update Tolstoy's statement. In the future,   unproductive families may be unproductive in their own ways, but   the ones that function efficiently will all look about the same,   which is to say, something like a small -- and hopefully   successful -- business.",
    "  Image source: MyWallSt. ",
    "Image source: MyWallSt.",
    "   One of these pot stocks is         already +100% this year. What are you waiting for?   ",
    " MyWallSt operates a full disclosure policy. MyWallSt staff     currently hold long positions in Atlassian, Microsoft and     Slack. Read our  full disclosure policy here  . ",
    "  10 stocks we like better than Microsoft       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Microsoft wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Microsoft       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Microsoft wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " Teresa Kersten, an employee of LinkedIn, a Microsoft     subsidiary, is a member of The Motley Fool's board of     directors. The Motley Fool owns shares of and recommends     Atlassian and Microsoft. The Motley Fool owns shares of Slack     Technologies and has the following options: long January 2021     $85 calls on Microsoft. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 15:43:00"
}