{
  "url": "https://www.nasdaq.com/article/roku-launches-more-home-audio-products-cm1207532",
  "title": "Roku Launches More Home Audio Products - Nasdaq.com",
  "text": [
    " In a somewhat puzzling move, streaming TV platform   Roku    (NASDAQ: ROKU) launched wireless speakers in 2018 as its first   foray   into the speaker market    . The entry was peculiar because Roku has been slowly moving away   from first-party hardware for its core   tech platform    , relying increasingly on third-party Roku TVs for user   acquisition. Regardless, the company is expanding its home audio   offerings with a pair of new products announced this   morning. Here's what investors need to know.   Roku's new Smart Soundbar doubles as a streaming media     player. Image source: Roku.makeArticleAd();  Two new low-cost audio products Roku is introducing a Smart Soundbar and Wireless Subwoofer,   each of which costs $180. The sound bar will include four drivers   and automatic volume leveling in order to deliver uniform audio   levels. The device doubles as a streaming player as well,   supporting streaming up to 4K. Virtual assistants like Google   Assistant and   Amazon    (NASDAQ: AMZN)  Alexa are supported. The subwoofer has a 10-inch driver and will offer more   powerful bass performance and integrate with the aforementioned   wireless speakers from last year. The devices can now be   pre-ordered and are expected to hit retail stores in October. A noisy market Roku is expanding into a crowded market but following the same   strategy of offering low-cost hardware likely sold with little to   no gross profit. Competing sound bars from established rivals   such as Bose or   Sonos    can be priced as high as $800, although both companies offer more   affordable models. Speaking of Amazon, the e-commerce giant is also expected to   announce a slew of new Fire TV devices at IFA 2019, according to   a TechCrunch article that has since been deleted, possibly   because it was published prematurely. IFA is one of the biggest   consumer tech trade shows in Europe. Many of the new gadgets   license Amazon's Fire TV platform and are made by third-party   manufacturers. Included in the mix is a new Nebula Soundbar made by Anker   that similarly doubles as a streaming player for Fire TV and   supports 4K resolution. That gadget will be priced at $230 in the   U.S. and ship in November, according to the report. Still top dog in the U.S. Roku is the No. 1 streaming platform in the U.S., with market   researcher Strategy Analytics   recently estimating    that the company has over 41 million devices in use in the   States. Roku grabbed 30% of connected TV device sales in the   first quarter, with Amazon coming in No. 2 with 12%. However,   Amazon boasts more users globally, with the company saying it now   has over 37 million monthly active users. At the end of the   second quarter, Roku had 30.5 million active accounts. Including streaming capabilities makes more sense than   audio-only products, as the new Smart Soundbar will run Roku OS   and actually contribute to growing the streaming TV platform.   10 stocks we like better than Roku       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Roku wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. Suzanne Frey, an executive at Alphabet, is a member     of The Motley Fool's board of directors.     Evan Niu, CFA      owns shares of Amazon. The Motley Fool owns shares of and     recommends GOOGL, GOOG, Amazon, and Roku. The Motley Fool has a     disclosure policy      .  ",
    "In a somewhat puzzling move, streaming TV platform   Roku    (NASDAQ: ROKU) launched wireless speakers in 2018 as its first   foray   into the speaker market    . The entry was peculiar because Roku has been slowly moving away   from first-party hardware for its core   tech platform    , relying increasingly on third-party Roku TVs for user   acquisition. Regardless, the company is expanding its home audio   offerings with a pair of new products announced this   morning.",
    "Here's what investors need to know.",
    "  Roku's new Smart Soundbar doubles as a streaming media     player. Image source: Roku.makeArticleAd(); ",
    "Roku's new Smart Soundbar doubles as a streaming media     player. Image source: Roku.",
    "Roku is introducing a Smart Soundbar and Wireless Subwoofer,   each of which costs $180. The sound bar will include four drivers   and automatic volume leveling in order to deliver uniform audio   levels. The device doubles as a streaming player as well,   supporting streaming up to 4K. Virtual assistants like Google   Assistant and   Amazon    (NASDAQ: AMZN)  Alexa are supported.",
    "The subwoofer has a 10-inch driver and will offer more   powerful bass performance and integrate with the aforementioned   wireless speakers from last year. The devices can now be   pre-ordered and are expected to hit retail stores in October.",
    "Roku is expanding into a crowded market but following the same   strategy of offering low-cost hardware likely sold with little to   no gross profit. Competing sound bars from established rivals   such as Bose or   Sonos    can be priced as high as $800, although both companies offer more   affordable models.",
    "Speaking of Amazon, the e-commerce giant is also expected to   announce a slew of new Fire TV devices at IFA 2019, according to   a TechCrunch article that has since been deleted, possibly   because it was published prematurely. IFA is one of the biggest   consumer tech trade shows in Europe. Many of the new gadgets   license Amazon's Fire TV platform and are made by third-party   manufacturers.",
    "Included in the mix is a new Nebula Soundbar made by Anker   that similarly doubles as a streaming player for Fire TV and   supports 4K resolution. That gadget will be priced at $230 in the   U.S. and ship in November, according to the report.",
    "Roku is the No. 1 streaming platform in the U.S., with market   researcher Strategy Analytics   recently estimating    that the company has over 41 million devices in use in the   States. Roku grabbed 30% of connected TV device sales in the   first quarter, with Amazon coming in No. 2 with 12%. However,   Amazon boasts more users globally, with the company saying it now   has over 37 million monthly active users. At the end of the   second quarter, Roku had 30.5 million active accounts.",
    "Including streaming capabilities makes more sense than   audio-only products, as the new Smart Soundbar will run Roku OS   and actually contribute to growing the streaming TV platform.",
    "  10 stocks we like better than Roku       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Roku wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Roku       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Roku wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. Suzanne Frey, an executive at Alphabet, is a member     of The Motley Fool's board of directors.     Evan Niu, CFA      owns shares of Amazon. The Motley Fool owns shares of and     recommends GOOGL, GOOG, Amazon, and Roku. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:44:00"
}