{
  "url": "https://www.nasdaq.com/article/us-stockstrade-optimism-apple-push-wall-street-slightly-higher-20190911-00547",
  "title": "US STOCKS-Trade optimism, Apple push Wall Street slightly higher - Nasdaq.com",
  "text": [
    " (For a live blog on the U.S. stock market, click LIVE/ ortype LIVE/ in a news window.)",
    "* Apple biggest boost on all three major indexes",
    "* Energy stocks lead gains on S&P 500",
    "By Uday Sampath Kumar",
    "Sept 11 (Reuters) - U.S. stocks rose slightly on Wednesdayas China's move to ease trade tensions with the United Statessoothed investor nerves, while shares of Apple gained a dayafter the launch of its latest iPhones.",
    "Apple IncAAPL.O rose 1.79% and provided the biggest boostto all three major indexes, a day after it unveiled new iPhonesand rolled out a streaming TV service at a price that undercutsDisney DIS.N and NetflixNFLX.O . urn:newsml:reuters.com:*:nL2N2610X7",
    "The gains took the Silicon Valley giant's market valuationjust shy of $1 trillion and lifted the wider technology sector .SPLRCT .",
    "Adding to the positive momentum, China's finance ministryexempted 16 types of U.S. goods from additional retaliatorytariffs, ahead of a planned meeting between trade negotiators. urn:newsml:reuters.com:*:nL3N2621DV",
    "While the move is seen as a friendly gesture to thawrelations with the United States, analysts are skeptical abouthow much it will move the needle in resolving a trade war thathas hurt the global economy.",
    "\"The exemption could be seen as a gesture of sinceritytowards the US ahead of negotiations in October, but is probablymore a means of supporting the (Chinese) economy,\" Iris Pang, aGreater China economist with ING, wrote in a note.",
    "Comments from a senior White House adviser on Tuesday urginginvestors to be patient about resolving the dispute furtherdownplayed expectations that a trade deal would be agreed thisyear. urn:newsml:reuters.com:*:nL2N2611SF",
    "Markets were largely subdued as investors held out on bigbets ahead of stimulus decisions from central banks to stem aglobal slowdown. The U.S. Federal Reserve and the EuropeanCentral Bank are expected to cut interest rates at their policymeetings over the next two weeks.",
    "U.S. President Donald Trump on Wednesday renewed his attackson Fed Chairman Jerome Powell, saying that the central bankshould get interest rates down to \"ZERO, or less.\"",
    "\"People will be interested to hear what is going to be said(by the Fed) next week, so until then, barring somethingunexpected, things will be quiet,\" said Andre Bakhos, managingdirector at Janlyn Capital LLC in Bernardsville, New Jersey.",
    "At 10:15 a.m. ET, the Dow Jones Industrial Average .DJI was up 26.56 points, or 0.10%, at 26,935.99, the S&P 500 .SPX was up 6.69 points, or 0.22%, at 2,986.08 and the NasdaqComposite .IXIC was up 46.24 points, or 0.57%, at 8,130.40.",
    "Energy stocks .SPNY led gains on the S&P 500, with ExxonMobil CorpXOM.N and Chevron CorpCVX.N providing thebiggest boost to the sector.",
    "Among other stocks, shares of Micron Technology IncMU.O rose 3.10% after Longbow Research upgraded its stock to\"buy\". urn:newsml:reuters.com:*:nL3N2622HJ",
    "Wynn Resorts LtdWYNN.O fell 2.44% and was among thebiggest losers on the S&P 500 after the hotel operator announceda $750 million debt offering.",
    "Advancing issues outnumbered decliners by a 2.09-to-1 ratioon the NYSE and by a 2.34-to-1 ratio on the Nasdaq.",
    "The S&P index recorded 13 new 52-week highs and no new low,while the Nasdaq recorded 28 new highs and eight new lows. (Reporting by Uday Sampath in BengaluruEditing by Saumyadeb Chakrabarty and Arun Koyyur) ((UdaySampath.Kumar@thomsonreuters.com; within U.S.+1 646 2238780; Twitter: @sampath_uday; Reuters Messaging:UdaySampath.Kumar.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-11 10:47:00"
}