{
  "url": "https://www.nasdaq.com/article/stock-market-today-small-caps-are-back-cm1210815",
  "title": "Stock Market Today: Small Caps Are Back? - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "It was another positive day on Wall Street, with stocks closing near their highs on Wednesday. Again, small-cap stocks stole the show in the stock market today.",
    "All week, we've been pointing out the outperformance of the Russell 2000 . That strength was on display as the iShares Russell 2000 ETF (NYSEARCA: IWM ) closed higher by 2%.",
    "That easily outpaced the SPDR S&P 500 ETF (NYSEARCA: SPY ) and the SPDR Dow Jones Industrial Average (NYSEARCA: DIA ), which rallied 0.7% and 0.9%, respectively. It also topped the 0.9% rally in the PowerShares QQQ ETF (NASDAQ: QQQ ).",
    "The IWM is now up almost 5% just this week, easily topping the roughly 50 basis appreciation in the S&P 500 . The ETF has also seen a few strong days of accumulation, causing some to wonder whether small caps are set to start closing that gap.",
    "While the IWM may be coming into some possible resistance, continued momentum could kick-start a breakout.",
    "Shares of Apple (NASDAQ: AAPL ) barreled to their highest level in about a year, rising 3.2% to $223.59. The move comes on a two-fold catalyst. First, the company introduced its new iPhone and other products set to launch over the next few weeks. Second, the stock was on the cusp of a big breakout, which is taking place now .",
    "If only Zscaler (NASDAQ: ZS ) could say the same thing. Shares were down 20% on the day, despite the company beating on earnings and revenue expectations. However, the midpoint of management's full-year guidance came up short of consensus estimates for both revenue and earnings.",
    "Restoration Hardware (NYSE: RH ) initially opened lower, but then jumped 4.8% to new highs. The move comes after the company reported yet another beat-and-raise quarter.",
    "Side note: RH and IWM are two stocks on Wednesday's Top Stock Trades column .",
    "Dave & Buster's Entertainment (NASDAQ: PLAY ) shares fell more than 4% after the company reported earnings. The company beat on earnings, reported in-line revenue and missed on comp store sales results.",
    "GameStop (NYSE: GME ) took it on the chin, falling more than 10% after the company missed on earnings and revenue estimates, and provided worse-than-expected guidance. The only seemingly good news is that shares rallied hard off the lows and did not make new 52-week lows.",
    "Another retailer that's struggling? Forever 21, which is expected to file for bankruptcy as early as this weekend.",
    "Cisco Systems (NASDAQ: CSCO ) climbed 1.7% and is looking to reclaim $50 after it was initiated with an \"outperform\" rating and $60 price target from the analysts at Evercore ISI .",
    "Hilton Worldwide Holdings (NYSE: HLT ) jumped about 1.7% on the day, closing at $95.21. The move came after Bernstein analysts initiated shares with an \"outperform\" rating and $108 price target. It implies almost 14% upside from Wednesday's close.",
    "Finally, shares of Callaway Golf (NYSE: ELY ) were upgraded to \"outperform\" at Raymond James . The analysts are using a $21 price target, implying more than 10% upside from current levels. That's even after the stock's nearly 26% rally so far this year and 5.5% rally on Wednesday.",
    "Bret Kenwell is the manager and author of Future Blue Chips and is on Twitter @BretKenwell . As of this writing, Bret Kenwell was long AAPL.",
    "The post Stock Market Today: Small Caps Are Back?  appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 04:15:06"
}