{
  "url": "https://www.nasdaq.com/article/babcock-wins-frigate-deal-as-uk-bids-to-restore-shipbuilding-industry-20190912-00082",
  "title": "Babcock wins frigate deal as UK bids to restore shipbuilding industry - Nasdaq.com",
  "text": [
    "By Alistair Smout",
    "LONDON, Sept 12 (Reuters) - Babcock International  won a contract to design new Type 31 frigates on Thursday as Britain seeks to revive its once-mighty shipbuilding industry.",
    "The frigates will be assembled at Babcock's facility in Rosyth, Scotland, and the programme will support over 2,500 jobs across the Britain, including its supply chain.",
    "Babcock's Arrowhead 140 design beat rival bids from BAE Systems  and Atlas Elektronik UK, and a formal contract award is expected later this year, Babcock said.",
    "\"Arrowhead 140 is a modern warship that will meet the maritime threats of today and tomorrow,\" Babcock Chief Executive Archie Bethel said.",
    "\"It provides a flexible, adaptable platform that delivers value for money and supports the UK's National Shipbuilding Strategy.\"",
    "The government will buy at least five of the frigates and has said the first ship is set to be in the water by 2023.",
    "Babcock said detailed design work would start immediately, with manufacturing beginning in 2021 and finishing in 2027. The ships will have an average production cost of 250 million pounds ($308 million) a ship.",
    "The government has committed to keeping up a fleet of at least 19 frigates and destroyers with the aim of growing the fleet in the 2030s. Type 31 frigates will replace Type 23 ships.",
    "\"(The) UK is an outward-looking island nation, and we need a shipbuilding industry and Royal Navy that reflect the importance of the seas to our security and prosperity,\" Prime Minister Boris Johnson said in a statement.",
    "\"I am convinced that by working together we will see a renaissance in this industry which is so much part of our island story - so let's bring shipbuilding home.\"",
    "Britain is building patrol vessels and new Type 26 frigates at BAE Systems' Govan shipyard on the Clyde river in Glasgow.",
    "But the country's shipbuilding industry has suffered a catastrophic decline in the last 40 years, with shipyards in places from Sunderland to Portsmouth closing.",
    "Belfast's Harland and Wolff shipyard, where the Titanic was built, went into administration last month.",
    "($1 = 0.8113 pounds)"
  ],
  "published_datetime": "2019-09-12 03:24:00"
}