{
  "url": "https://www.nasdaq.com/article/okta-earnings-3-big-takeaways-cm1206885",
  "title": "Okta Earnings: 3 Big Takeaways - Nasdaq.com",
  "text": [
    "Given the stock's 100%-plus increase to date in 2019, investors had high expectations around Okta 's (NASDAQ: OKTA) second-quarter report. The digital identity management specialist raised its outlook in late May after posting surprisingly strong sales growth, especially among its high-value contracts.",
    "Okta this past week again boosted that outlook after trouncing its latest sales targets. Investors who have been worried about its streak of net losses, meanwhile, could celebrate the fact that the cybersecurity software company is marching closer to the breakeven point. With those big-picture trends in mind, let's look at a few key takeaways from Okta's recen t earnings report.",
    "The company reported sales of $141 million, representing 49% growth year over year. CEO Todd McKinnon and his team had predicted $131 million of sales and a 38% growth rate, and so the actual result was again far above expectations.",
    "Image source: Getty Images.",
    "Management credited its large-client niche for the speedy sales gains, with annual contracts valued at over $100,000 growing 46% to pass 1,200 companies. \"Our momentum is powered by the massive and inevitable shifts that are enveloping companies today,\" McKinnon said in a conference call .",
    "Executives went on to note that Okta won several large new customers in the period thanks to its flexible platform of solutions that help manage identities in complex, cloud-based tech environments. These partnerships are getting bigger, too, with the top 25 contracts doubling in average size as compared to a year ago.",
    "Okta achieved notable profitability wins, including higher gross and operating profit margin. Cash burn improved to $1 million, or 1% of revenue, compared to $5 million, or 6% of revenue a year ago. Operating loss landed at 31% of sales, compared with 41% last year.",
    "The company is still firmly in growth investment mode, though, as those hefty losses demonstrate. Okta added 40% to its headcount, year-over-year, with most of the hires focused on areas like sales and marketing. Overall operating expenses rose to $145 million from $105 million, mainly thanks to its attempts to broaden its reach to larger enterprises. \"We continue to invest in our business as we scale for durable growth,\" CFO Bill Losch told investors.",
    "Okta has the benefit of a robust sales outlook to support those aggressive spending plans. To that end, executives lifted their outlook for the second straight quarter and are now targeting fiscal-year sales of between $560 million and $563 million. That forecast stood at between $543 million and $548 million in late May and ranged from $530 million to $535 million at the start of the year.",
    "Okta's non- GAAP (adjusted) earnings outlook is improving, too, but investors still aren't likely to see the software specialist earn a stable profit anytime soon. Non-GAAP net losses are on track to land at between $0.44 and $0.42 per share this year, compared with $0.32 per share last year.",
    "Sure, it's usually a bad sign for investors to see a company's losses balloon higher. But, in this case, there's plenty of evidence supporting management's claim of strengthening its position in an industry that has a long runway for growth ahead. That success should lay the groundwork for significant profit generation, perhaps as early as fiscal 2020.",
    "10 stocks we like better than Okta\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the 10 best stocks for investors to buy right now... and Okta wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Demitrios Kalogeropoulos owns shares of Okta. The Motley Fool owns shares of and recommends Okta. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:45:00"
}