{
  "url": "https://www.nasdaq.com/article/yuan-hits-3week-high-on-trumps-goodwill-tariff-delay-20190912-00017",
  "title": "Yuan hits 3-week high on Trump's 'goodwill' tariff delay - Nasdaq.com",
  "text": [
    "HONG KONG, Sept 12 (Reuters) - The yuan rose to its strongest level in three weeks on Thursday after U.S. President Donald Trump postponed ramping up tariffs on Chinese goods \"as a gesture of good will\", after Beijing spared duties on some U.S. exports hours earlier.",
    "The onshore yuan  was up 0.4% at 7.0848 per dollar at midday, its strongest level since August 23. The offshore  made gains of a similar margin on the day, trading a touch stronger at 7.0786 and its firmest since August 22.",
    "\"These goodwill gestures exchanged… has induced hope for a respite in U.S.-China tensions even as structural differences between U.S. and China persist,\" Citi's analysts wrote in a note.",
    "That deadline has now been pushed back to Oct. 15 to avoid clashing with the National Day at the request of Liu He, China's vice premier and top negotiator in the talks with Washington, Trump said on Twitter on Wednesday. ",
    "Earlier, China announced its first batch of tariff exemptions for 16 types of U.S. products, including some anti-cancer drugs and lubricants. ",
    "As the tariff delay helped strengthened the yuan, clients seeking foreign currencies held off buying, especially as Chinese markets are set to close on Friday for Mid-Autumn Festival, said one trader with a foreign bank in Shanghai.",
    "Another Shanghai-based doubted whehter the delay to tariffs would support the yuan for long.",
    "\"The Sino-U.S. trade war has not ended. (Tariff delay) hasn't had much impact on (turning around) the market's pessimistic sentiment,\" said the trader.",
    "In recent weeks the People's Bank of China has prevented the yuan's decline from steepening, by anchoring the currency with its midpoint guidance rate , from which the onshore yuan can trade 2% on either side.",
    "The PBOC set the fixing at 7.0846 per dollar on Thursday, a touch stronger than Reuters' estimate of 7.0929. ",
    "The protracted trade war has slowed Chinese growth and policymakers have ratcheted up support for the economy. Official data on Wednesday showed that China's banks extended new yuan loans in August. ",
    "The central bank slashed the amount of cash banks must hold as reserves last week, releasing 900 billion yuan ($126.35 billion). Analysts expect it to go further and cut one or more of its key policy interest rates this month. ",
    "Lower interest rates often transmit into currency weakness as investors take flight to higher-yielding markets. But since China's is not the only central bank to trim rates, the yuan will likely run unscathed, said Stefan Hofer, chief investment strategist at LGT Bank Asia.",
    "\"It's very natural for China to be part of the crowd,\" he said. \"I don't think it will impact the currency.\"",
    "The yuan market at 4:02AM GMT:",
    "ONSHORE SPOT:",
    "Key indexes:",
    "*Divergence of the dollar/yuan exchange rate. Negative number indicates that spot yuan is trading stronger than the midpoint. The People's Bank of China (PBOC) allows the exchange rate to rise or fall 2 percent from official midpoint rate it sets each morning.",
    "OFFSHORE CNH MARKET",
    "*Premium for offshore spot over onshore ",
    "**Figure reflects difference from PBOC's official midpoint, since non-deliverable forwards are settled against the midpoint. ."
  ],
  "published_datetime": "2019-09-12 12:43:00"
}