{
  "url": "https://www.nasdaq.com/article/this-cannabis-stock-is-all-about-growth-cm1207643",
  "title": "This Cannabis Stock Is All About Growth - Nasdaq.com",
  "text": [
    " Marijuana may not be legal across the country just yet, but   that doesn't mean the hemp craze hasn't been taking off. Many   companies have been getting in on cannabidiol-derived hemp   products, which currently offer companies the best way to get   into the cannabis market without having to worry about crossing   state lines. From beverages to food products to personal care,   cannabis companies    have been looking for ways to offer a variety of CBD products to   as many customers as possible. One company that has done a terrific job of expanding its   reach this year is   Green Growth Brands    (OTC: GGBXF) . Last year, the Toronto-based company made a name   for itself when it made a bid to buy Canadian producer   Aphria    (NYSE: APHA) .   Although that deal didn't end up panning out    , the company has gone on to grow its business and expand into   several areas.  Opened its 100th store        Unlike many other cannabis companies, Green Growth has   strategically focused on placing its Seventh Sense branded CBD   shops in shopping malls throughout the country. It took the   company just seven months to reach 100 mall-based locations, and   it's planning to open even more. The company's Seventh Sense   stores sell personal-care and beauty products infused with CBD.   In addition to launching its own stores, Green Growth has   partnered with   Abercrombie & Fitch    ,   American Eagle    , and DSW, which is owned by   Designer Brands    . The moves have positioned the company in strategic locations   frequented by younger consumers to help reach a key   demographic.makeArticleAd();   IMAGE SOURCE: GETTY IMAGES.   Multistate expansion continues  The passing of the   farm bill    late last year paved the way for hemp-based CBD to be sold across   the country, and nearly all the states have enacted some sort of   hemp legislation. In addition to just hemp, Green Growth has been expanding into   new marijuana markets as well and has a presence in Nevada and   Massachusetts. Most recently, Green Growth acquired Florida-based   Spring Oaks for an approximate value of $54.65 million. The   acquisition gives Green Growth the opportunity to expand into the   Florida market and would allow the company to open as many as 35   dispensaries through Spring Oaks' medical marijuana dispensary   license. Florida has been a hot market, with more than 300,000   patients already enrolled in the state's medical marijuana   program.  Results are pouring in  Green Growth has already seen its strategy translate into   significant sales: In its most recent quarterly results, for the   period ending March 31, the company's sales reached $5.6 million.   Although profitability isn't in sight just yet, with the   company's loss reaching more than $15 million, that shouldn't   come as much of a surprise given how quickly and how aggressively   Green Growth has been expanding. In the trailing nine months, the   company's revenues have topped $8.6 million.    Key takeaways for investors  With a market cap of around $250 million, Green Growth is   still a fairly small player in the industry, but its growth   initiatives could quickly make it much bigger. By tapping into   some large markets and the hemp hype, Green Growth is in a good   position to succeed, especially in light of the strong   partnerships it has secured thus far. The company has put itself   in a unique position that could carve out a strong niche for   itself, especially among younger, health-conscious consumers. However, the stock needs some positive results to help turn   things around, as it has fallen more than 60% this year. That's   likely been due to the company's inability to turn a profit and   also investors simply   no longer being as optimistic about pot   stocks  Here's The Marijuana Stock You've Been Waiting For        A little-known Canadian company just unlocked what some experts   think could be the key to profiting off the coming marijuana   boom.       And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10   states plus Washington, D.C., have all legalized recreational   marijuana over the last few years, and full legalization came to   Canada in October 2018. And one under-the-radar Canadian company is poised to explode   from this coming marijuana revolution. Because a game-changing deal just went down between the   Ontario government and this powerhouse company...and you need to   hear this story today if you have even considered investing in   pot stocks. Simply click here to get the full story now.  Learn more     David Jagielski      has no position in any of the stocks mentioned. The Motley Fool     recommends Designer Brands Inc. The Motley Fool has a     disclosure policy      .  ",
    "Marijuana may not be legal across the country just yet, but   that doesn't mean the hemp craze hasn't been taking off. Many   companies have been getting in on cannabidiol-derived hemp   products, which currently offer companies the best way to get   into the cannabis market without having to worry about crossing   state lines. From beverages to food products to personal care,   cannabis companies    have been looking for ways to offer a variety of CBD products to   as many customers as possible.",
    "One company that has done a terrific job of expanding its   reach this year is   Green Growth Brands    (OTC: GGBXF) . Last year, the Toronto-based company made a name   for itself when it made a bid to buy Canadian producer   Aphria    (NYSE: APHA) .   Although that deal didn't end up panning out    , the company has gone on to grow its business and expand into   several areas.",
    "Unlike many other cannabis companies, Green Growth has   strategically focused on placing its Seventh Sense branded CBD   shops in shopping malls throughout the country. It took the   company just seven months to reach 100 mall-based locations, and   it's planning to open even more. The company's Seventh Sense   stores sell personal-care and beauty products infused with CBD.   In addition to launching its own stores, Green Growth has   partnered with   Abercrombie & Fitch    ,   American Eagle    , and DSW, which is owned by   Designer Brands    . The moves have positioned the company in strategic locations   frequented by younger consumers to help reach a key   demographic.",
    "  IMAGE SOURCE: GETTY IMAGES. ",
    "IMAGE SOURCE: GETTY IMAGES.",
    "The passing of the   farm bill    late last year paved the way for hemp-based CBD to be sold across   the country, and nearly all the states have enacted some sort of   hemp legislation.",
    "In addition to just hemp, Green Growth has been expanding into   new marijuana markets as well and has a presence in Nevada and   Massachusetts. Most recently, Green Growth acquired Florida-based   Spring Oaks for an approximate value of $54.65 million. The   acquisition gives Green Growth the opportunity to expand into the   Florida market and would allow the company to open as many as 35   dispensaries through Spring Oaks' medical marijuana dispensary   license. Florida has been a hot market, with more than 300,000   patients already enrolled in the state's medical marijuana   program.",
    "Green Growth has already seen its strategy translate into   significant sales: In its most recent quarterly results, for the   period ending March 31, the company's sales reached $5.6 million.   Although profitability isn't in sight just yet, with the   company's loss reaching more than $15 million, that shouldn't   come as much of a surprise given how quickly and how aggressively   Green Growth has been expanding. In the trailing nine months, the   company's revenues have topped $8.6 million.",
    "With a market cap of around $250 million, Green Growth is   still a fairly small player in the industry, but its growth   initiatives could quickly make it much bigger. By tapping into   some large markets and the hemp hype, Green Growth is in a good   position to succeed, especially in light of the strong   partnerships it has secured thus far. The company has put itself   in a unique position that could carve out a strong niche for   itself, especially among younger, health-conscious consumers.",
    "However, the stock needs some positive results to help turn   things around, as it has fallen more than 60% this year. That's   likely been due to the company's inability to turn a profit and   also investors simply   no longer being as optimistic about pot   stocks  Here's The Marijuana Stock You've Been Waiting For        A little-known Canadian company just unlocked what some experts   think could be the key to profiting off the coming marijuana   boom.       And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10   states plus Washington, D.C., have all legalized recreational   marijuana over the last few years, and full legalization came to   Canada in October 2018. And one under-the-radar Canadian company is poised to explode   from this coming marijuana revolution. Because a game-changing deal just went down between the   Ontario government and this powerhouse company...and you need to   hear this story today if you have even considered investing in   pot stocks. Simply click here to get the full story now.  Learn more  ",
    " Here's The Marijuana Stock You've Been Waiting For        A little-known Canadian company just unlocked what some experts   think could be the key to profiting off the coming marijuana   boom.      ",
    "And make no mistake - it is coming.",
    "Cannabis legalization is sweeping over North America - 10   states plus Washington, D.C., have all legalized recreational   marijuana over the last few years, and full legalization came to   Canada in October 2018.",
    "And one under-the-radar Canadian company is poised to explode   from this coming marijuana revolution.",
    "Because a game-changing deal just went down between the   Ontario government and this powerhouse company...and you need to   hear this story today if you have even considered investing in   pot stocks.",
    "Simply click here to get the full story now.",
    " Learn more ",
    "  David Jagielski      has no position in any of the stocks mentioned. The Motley Fool     recommends Designer Brands Inc. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 06:45:06"
}