{
  "url": "https://www.nasdaq.com/article/zackscom-featured-highlights-include-syneos-carlisle-united-technologies-ares-capital-and-principal-financial-cm1206569",
  "title": "Zacks.com featured highlights include: Syneos, Carlisle, United Technologies, Ares Capital and Principal Financial - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL - September 3, 2019 - Stocks in this week's article are Syneos Health, Inc. SYNH  , Carlisle Companies Inc. CSL  , United Technologies Corp. UTX  , Ares Capital Corp. ARCC  and Principal Financial Group, Inc. PFG  .   Add These 5 Stocks with Solid Sales Growth to Your     Portfolio   Strong sales growth is one of the most important characteristics of potential winners in the stock market. The companies putting more emphasis on sales management have a competitive advantage, as strong sales generally get converted to growth. Revenues are often more closely monitored than earnings when assessing growth of a business. This is because investors want to make sure whether a business has the capability of generating more sales over time to cater to an expanding customer base. Flat or declining sales rise indicates obstacles for the company and offers limited scope for sustained growth. Stagnant companies may generate near-term profit, but do not ensure enough growth to attract new investors. Without impressive top-line growth, bottom-line improvement may not be sustainable over the long term. While a company can show earnings strength by reducing expenses, a sustainable bottom-line recovery usually requires robust sales growth.    However, sales growth in isolation doesn't indicate much about a company's future performance. Though it provides investors an insight into product demand and pricing power, a huge sales number is not necessarily translated into profits. Hence, taking into consideration a company's cash position along with its sales number can prove to be a more dependable strategy. Substantial cash in hand and a steady cash flow give a company more flexibility with respect to business decisions and potential investments. Most importantly, an adequate cash position suggests that revenues are being channelized in the right direction.  For the rest of this Screen of the Week article please   visit Zacks.com at:    https://www.zacks.com/stock/news/495831/add-these-5-stocks-with-solid-sales-growth-to-your-portfolio   Disclosure: Officers, directors and/or employees of Zacks   Investment Research may own or have sold short securities and/or   hold long and/or short positions in options that are mentioned in   this material. An affiliated investment advisory firm may own or   have sold short securities and/or hold long and/or short   positions in options that are mentioned in this material.   About Screen of the Week  Zacks.com created the first and best screening system on the web earning the distinction as the \"#1 site for screening stocks\" by Money Magazine.  But powerful screening tools is just the start. That is why Zacks created the Screen of the Week to highlight profitable stock picking strategies that investors can actively use.  Strong Stocks that Should Be in the News  Many are little publicized and fly under the Wall Street radar. They're virtually unknown to the general public. Yet today's 220 Zacks Rank #1 \"Strong Buys\" were generated by the stock-picking system that has more than doubled the market from 1988 through 2016. Its average gain has been a stellar +25% per year. See these high-potential stocks free >>.  Follow us on Twitter:   http://twitter.com/zacksresearch  Join us on Facebook:  http://www.facebook.com/ZacksInvestmentResearch  Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates. Contact: Jim Giaquinto Company: Zacks.com Phone: 312-265-9268 Email: pr@zacks.com  Visit: www.Zacks.com  Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer  . Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release. makeArticleAd();  Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Carlisle Companies Incorporated (CSL): Free Stock Analysis Report   United Technologies Corporation (UTX): Free Stock Analysis Report   Ares Capital Corporation (ARCC): Free Stock Analysis Report   Principal Financial Group, Inc. (PFG): Free Stock Analysis Report   INC Research Holdings, Inc. (SYNH): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL - September 3, 2019 - Stocks in this week's article are Syneos Health, Inc. SYNH  , Carlisle Companies Inc. CSL  , United Technologies Corp. UTX  , Ares Capital Corp. ARCC  and Principal Financial Group, Inc. PFG  .",
    "  Add These 5 Stocks with Solid Sales Growth to Your     Portfolio  ",
    "Strong sales growth is one of the most important characteristics of potential winners in the stock market. The companies putting more emphasis on sales management have a competitive advantage, as strong sales generally get converted to growth.",
    "Revenues are often more closely monitored than earnings when assessing growth of a business. This is because investors want to make sure whether a business has the capability of generating more sales over time to cater to an expanding customer base.",
    "Flat or declining sales rise indicates obstacles for the company and offers limited scope for sustained growth. Stagnant companies may generate near-term profit, but do not ensure enough growth to attract new investors.",
    "Without impressive top-line growth, bottom-line improvement may not be sustainable over the long term. While a company can show earnings strength by reducing expenses, a sustainable bottom-line recovery usually requires robust sales growth.",
    "   However, sales growth in isolation doesn't indicate much about a company's future performance. Though it provides investors an insight into product demand and pricing power, a huge sales number is not necessarily translated into profits.",
    "Hence, taking into consideration a company's cash position along with its sales number can prove to be a more dependable strategy. Substantial cash in hand and a steady cash flow give a company more flexibility with respect to business decisions and potential investments. Most importantly, an adequate cash position suggests that revenues are being channelized in the right direction.",
    " For the rest of this Screen of the Week article please   visit Zacks.com at:    https://www.zacks.com/stock/news/495831/add-these-5-stocks-with-solid-sales-growth-to-your-portfolio ",
    " Disclosure: Officers, directors and/or employees of Zacks   Investment Research may own or have sold short securities and/or   hold long and/or short positions in options that are mentioned in   this material. An affiliated investment advisory firm may own or   have sold short securities and/or hold long and/or short   positions in options that are mentioned in this material. ",
    " About Screen of the Week ",
    "Zacks.com created the first and best screening system on the web earning the distinction as the \"#1 site for screening stocks\" by Money Magazine.  But powerful screening tools is just the start. That is why Zacks created the Screen of the Week to highlight profitable stock picking strategies that investors can actively use.",
    " Strong Stocks that Should Be in the News ",
    "Many are little publicized and fly under the Wall Street radar. They're virtually unknown to the general public. Yet today's 220 Zacks Rank #1 \"Strong Buys\" were generated by the stock-picking system that has more than doubled the market from 1988 through 2016. Its average gain has been a stellar +25% per year. See these high-potential stocks free >>. ",
    "Follow us on Twitter:   http://twitter.com/zacksresearch ",
    "Join us on Facebook:  http://www.facebook.com/ZacksInvestmentResearch ",
    "Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.",
    "Contact: Jim Giaquinto",
    "Company: Zacks.com",
    "Phone: 312-265-9268",
    "Email: pr@zacks.com ",
    "Visit: www.Zacks.com ",
    "Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer  .",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:29:00"
}