{
  "url": "https://www.nasdaq.com/article/stocks-fall-on-us-china-trade-and-tariff-fears-buy-allegiant-stock-free-lunch-cm1206915",
  "title": "Stocks Fall on U.S.-China Trade and Tariff Fears & Buy Allegiant Stock - Free Lunch - Nasdaq.com",
  "text": [
    "   On today's episode of Free Lunch here at Zacks, Associate Stock Strategist Ben Rains breaks down the U.S. and China trade war as September's tariffs kick in. Stocks, including giants such as Boeing BA  , Caterpillar CAT  , and 3M MMM  , all fell as global economic slowdown fears start to impact the U.S. We also dive into why Allegiant Travel Company ALGT  is a Zacks Rank #1 (Strong Buy) stock. The first official trading day of September saw all three major U.S. indexes fall. Tuesday's downturn came after a volatile August and followed the new round of tariffs that were imposed on Sunday. These new U.S. tariffs are set to impact more consumer-related goods, which could hurt retail spending in the vital holiday shopping period. For instance, J.P. Morgan JPM  estimates the new consumer-facing tariffs will cost the average American household $1,000 a year. Meanwhile, retaliatory Chinese tariffs on everything from soybeans to crude oil also went into effect. Plus, the Institute for Supply Management's purchasing managers index fell to 49.1 in August. Investors should note that anything below 50 signals contraction. On top of that, the U.S. trucking industry has been hit by the broader economic slowdown. And the Wall Street Journal  reported that economic confidence for small U.S. companies slipped to its lowest levels since 2012. Moving on, Wall Street might turn its attention to Slack WORK  Wednesday afternoon. Shares of newly public work-based communication tech firm have fallen, in similar fashion to Uber UBER  and Lyft LYFT  and in contrast to Pinterest PINS  and Beyond Meat BYND  . This episode of Free Lunch then closes with a look at why discount airline and travel company Allegiant Travel is a Zacks Rank #1 (Strong Buy) stock.  Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();   Americans spend an estimated $150 billion in this industry every year… more than twice as much as they   spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Allegiant Travel Company (ALGT): Free Stock Analysis Report   JPMorgan Chase & Co. (JPM): Free Stock Analysis Report   The Boeing Company (BA): Free Stock Analysis Report   3M Company (MMM): Free Stock Analysis Report   Caterpillar Inc. (CAT): Free Stock Analysis Report   Lyft, Inc. (LYFT): Free Stock Analysis Report   Slack Technologies, Inc. (WORK): Free Stock Analysis Report   Pinterest, Inc. (PINS): Free Stock Analysis Report   Beyond Meat, Inc. (BYND): Free Stock Analysis Report   Uber Technologies, Inc. (UBER): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "On today's episode of Free Lunch here at Zacks, Associate Stock Strategist Ben Rains breaks down the U.S. and China trade war as September's tariffs kick in. Stocks, including giants such as Boeing BA  , Caterpillar CAT  , and 3M MMM  , all fell as global economic slowdown fears start to impact the U.S. We also dive into why Allegiant Travel Company ALGT  is a Zacks Rank #1 (Strong Buy) stock.",
    "The first official trading day of September saw all three major U.S. indexes fall. Tuesday's downturn came after a volatile August and followed the new round of tariffs that were imposed on Sunday. These new U.S. tariffs are set to impact more consumer-related goods, which could hurt retail spending in the vital holiday shopping period. For instance, J.P. Morgan JPM  estimates the new consumer-facing tariffs will cost the average American household $1,000 a year.",
    "Meanwhile, retaliatory Chinese tariffs on everything from soybeans to crude oil also went into effect. Plus, the Institute for Supply Management's purchasing managers index fell to 49.1 in August. Investors should note that anything below 50 signals contraction.",
    "On top of that, the U.S. trucking industry has been hit by the broader economic slowdown. And the Wall Street Journal  reported that economic confidence for small U.S. companies slipped to its lowest levels since 2012.",
    "Moving on, Wall Street might turn its attention to Slack WORK  Wednesday afternoon. Shares of newly public work-based communication tech firm have fallen, in similar fashion to Uber UBER  and Lyft LYFT  and in contrast to Pinterest PINS  and Beyond Meat BYND  .",
    "This episode of Free Lunch then closes with a look at why discount airline and travel company Allegiant Travel is a Zacks Rank #1 (Strong Buy) stock.",
    " Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();   Americans spend an estimated $150 billion in this industry every year… more than twice as much as they   spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 15:08:00"
}