{
  "url": "https://www.nasdaq.com/article/groningen-gas-field-to-be-phased-out-8-years-before-schedule-cm1210614",
  "title": "Groningen Gas Field to be Phased Out 8 Years Before Schedule - Nasdaq.com",
  "text": [
    " The government of the Netherlands recently stated that gas production from the Groningen field, once biggest in Europe, will be gradually phased out by mid-2022 (eight years earlier than planned) to lower the risk and damages from the earthquakes caused by drilling. Nederlandse Aardolie Maatschappij BV or NAM, a joint venture between Royal Dutch Shell PLC RDS.A  and Exxon Mobil Corporation XOM  is the operator of the field. Earlier-than-planned halt of the Groningen gas field resulted from the frequently felt earth tremors with 3.4 magnitude earthquakes hitting the region in January 2018 as well as earlier in 2019, thereby coercing a dip in the extraction levels and a vow by the government to stop production as early as possible. Back in 2013, before the field was detected to cause drilling-related tremors that damaged buildings, Groningen extracted nearly 54 billion cubic metres (bcm) of gas. Following the earthquake at the start of this year, an immediate step was taken by the gas sector regulator to cut the production by 40%. The Dutch government capped the production to 11.8 bcm for a year through October 2020. The fall in the production will induce a $441-million expense for the Dutch state. The final settlement on the costs associated with the closure of Groningen production will be completed by the first half of 2020. This once Europe's main supplier of natural gas will be operational until 2026, provided the commodity witnesses high demand during extreme cold winters. Both Shell and Exxon Mobil with a Zacks Rank #5 (Strong Sell) and a Zacks Rank #3 (Hold), respectively, have a number of energy assets on the European continent. Therefore, the gradual decline in production from the Groningen field is not expected to be a headache for the oil majors in the long run. You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   . If you are interested in the oil and energy sector, you may consider a couple of better-ranked stocks like Dril-Quip, Inc. DRQ  and World Fuel Services Corporation INT  , each carrying a Zacks Rank #2 (Buy). Dril-Quip earnings beat the Zacks Consensus Estimate in three of the previous four quarters. World Fuel Services earnings beat the Zacks Consensus Estimate in all the last four quarters.  Looking for Stocks with Skyrocketing Upside?  makeArticleAd();  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Dril-Quip, Inc. (DRQ): Free Stock Analysis Report   World Fuel Services Corporation (INT): Free Stock Analysis Report   Exxon Mobil Corporation (XOM): Free Stock Analysis Report   Royal Dutch Shell PLC (RDS.A): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "The government of the Netherlands recently stated that gas production from the Groningen field, once biggest in Europe, will be gradually phased out by mid-2022 (eight years earlier than planned) to lower the risk and damages from the earthquakes caused by drilling. Nederlandse Aardolie Maatschappij BV or NAM, a joint venture between Royal Dutch Shell PLC RDS.A  and Exxon Mobil Corporation XOM  is the operator of the field.",
    "Earlier-than-planned halt of the Groningen gas field resulted from the frequently felt earth tremors with 3.4 magnitude earthquakes hitting the region in January 2018 as well as earlier in 2019, thereby coercing a dip in the extraction levels and a vow by the government to stop production as early as possible.",
    "Back in 2013, before the field was detected to cause drilling-related tremors that damaged buildings, Groningen extracted nearly 54 billion cubic metres (bcm) of gas. Following the earthquake at the start of this year, an immediate step was taken by the gas sector regulator to cut the production by 40%. The Dutch government capped the production to 11.8 bcm for a year through October 2020.",
    "The fall in the production will induce a $441-million expense for the Dutch state. The final settlement on the costs associated with the closure of Groningen production will be completed by the first half of 2020.",
    "This once Europe's main supplier of natural gas will be operational until 2026, provided the commodity witnesses high demand during extreme cold winters.",
    "Both Shell and Exxon Mobil with a Zacks Rank #5 (Strong Sell) and a Zacks Rank #3 (Hold), respectively, have a number of energy assets on the European continent. Therefore, the gradual decline in production from the Groningen field is not expected to be a headache for the oil majors in the long run. You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "If you are interested in the oil and energy sector, you may consider a couple of better-ranked stocks like Dril-Quip, Inc. DRQ  and World Fuel Services Corporation INT  , each carrying a Zacks Rank #2 (Buy).",
    "Dril-Quip earnings beat the Zacks Consensus Estimate in three of the previous four quarters.",
    "World Fuel Services earnings beat the Zacks Consensus Estimate in all the last four quarters.",
    " Looking for Stocks with Skyrocketing Upside?  makeArticleAd();  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:14:00"
}