{
  "url": "https://www.nasdaq.com/article/dont-worry-the-near-term-pain-in-best-buy-stock-will-pass-cm1206835",
  "title": "Don’t Worry, the Near Term Pain in Best Buy Stock Will Pass - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Shares of Best Buy (NYSE: BBY ) plummeted in late August after the consumer electronics retailer pointed to signs of slowing top-line momentum in its second-quarter earnings report. It's probably not a reason to dump Best Buy stock, though.",
    "Best Buy missed revenue and comparable sales estimates in Q2. Management also delivered a below-consensus revenue and comp guide for Q3, while cutting its full-year revenue and comp guide to below-consensus marks. The rationale? A lot of uncertainty surrounding the trade war and its impact on consumption trends in the back-half of 2019. Investors freaked out. Best Buy stock dropped 10%.",
    "This pain is temporary. Zooming out, the big picture fundamentals supporting Best Buy remain favorable. The valuation is dirt cheap. And, the trade war headwinds which are complicating results today, will cool off over the next few months and quarters.",
    "As such, the recent big plunge in Best Buy stock price is a one-off issue. This weakness will pass. When it does, it will be replaced secular strength.",
    "The heart of the recent sell-off in BBY stock is the trade war.",
    "Long story short, the trade war is having an adverse impact of global economic expansion. That is resulting in slowing consumption trends. Those slowing consumption trends are causing Best Buy to put up weaker-than-expected comparable sales numbers, both domestically and internationally.",
    "Management doesn't have much clarity as to when all this trade war noise will end. Thus, they are guiding for comps to remain relatively depressed into the end of the year.",
    "One way of looking at this is that so long as trade war volatility sticks around, Best Buy will struggle to impress with its top-line results, and BBY stock will remain weak. But, the other way of looking at this is that if the trade war cools down, Best Buy will get back to firing off impressive comps, and BBY stock will rebound in a big way.",
    "At the current moment, I think the latter is far more likely.",
    "China is playing the long game with trade. U.S. President Donald Trump isn't the type of guy to surrender. Thus, there won't be any trade war resolution anytime soon. But, China is also very keen on keeping its economic expansion alive and well, and U.S.-China trade accounts for a sizable 5% of China's GDP - so China doesn't want things to get too ugly on the trade war front.",
    "Meanwhile, Trump is going into an election year, so it's in his best interest to keep trade tensions subdued (and the U.S. economic expansion alive) for the time being.",
    "Consequently, it seems likely that while the trade war isn't going away anytime soon, trade tensions between the U.S. and China should materially cool over the next few weeks. As they do cool, consumer confidence globally will regain momentum, and Best Buy's top-line numbers will rebound - as will BBY stock.",
    "Zooming out, the big picture fundamentals underlying Best Buy stock remain favorable and point to a healthy upside over the next few quarters and years.",
    "Best Buy just reported its tenth consecutive quarter of positive comparable sales growth. That is two and a half years of positive comps. During those two and a half years, Best Buy has developed into an omnichannel giant in the consumer electronics space.",
    "That is, not only has Best Buy built out a robust ecommerce business, but the company has also leveraged its huge physical real estate footprint to offer things which online-only players have a really tough time offering - like product Q&A, professional installation services, big-ticket appliance and home theater sales, etc.",
    "As Best Buy has leaned into these alternative offerings, the company has increasingly differentiated itself in the eye of the consumer. The numbers speak for themselves. Again, ten straight quarters of positive comps. On top of that, sales, margins, and profits have all moved higher over the past few years, too.",
    "This growth trend will persist. The consumer electronics space is a secular growth one, since the world is becoming more and more digital every day, and consumers are dedicating more and more of their wallet share to buying these consumer electronics products. Best Buy is a distinguished and leading player in that space with attractive and defensible attributes.",
    "Net net, Best Buy projects as a steady revenue and profit grower over the next few years. At just 11-times forward earnings, Best Buy does not seem priced for that growth. This disconnect ultimately implies that the long term upside potential in Best Buy from current levels is compelling.",
    "I say buy the dip. Near term pain will stick around for a little while longer, but not much longer. Trade war tensions should cool over the next few months.",
    "That cooling should recharge the global consumer heading into the holiday season. That recharging should flow into big holiday numbers for Best Buy, the likes of which should spark a healthy recovery rally in Best Buy stock from today's dirt-cheap levels.",
    "As of this writing, Luke Lango was long BBY.",
    "The post Don't Worry, the Near Term Pain in Best Buy Stock Will Pass appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:07:54"
}