{
  "url": "https://www.nasdaq.com/article/bristol-myers-bmy-opdivo-shows-long-term-survival-benefit-cm1210615",
  "title": "Bristol-Myers' (BMY) Opdivo Shows Long-Term Survival Benefit - Nasdaq.com",
  "text": [
    "  Bristol-Myers Squibb Company  BMY   announced long-term pooled efficacy and safety results from the phase III CheckMate-017 and CheckMate-057 studies in patients with previously-treated, advanced non-small cell lung cancer (NSCLC). Shares of the company have lost 3.2% in the year so far against the  industry  's growth of 1.9%.    At five years, patients treated with Opdivo (nivolumab) continuedto experience long-term overall survival (OS) benefit versus docetaxel. Treatment with Opdivo was associated with a 5-year OS rate of 13.4% compared with 2.6% with docetaxel in previously-treated NSCLC patients. The OS benefit with the drug was observed across all patient subgroups, including those with PD-L1 expression on <1% of tumor cells. Further, the safety profile for Opdivo was consistent with prior findings in the second-line setting, and no new safety signals were observed with the longer follow-up. Only two of the 70 patients currently on study experienced a new treatment-related select adverse event (AE) between years 3 and 4. There were no new treatment-related select AEs reported between years 4 and 5 among the 55 patients still on study. This pooled analysis represents the longest follow-up of previously-treated NSCLC patients treated with Immuno-Oncology therapy in phase III randomized studies. Opdivo is Bristol-Myers' primary growth driver. It is currently approved in the United States, the EU, Japan and other countries for several cancer indications. The company is working on expanding the label of the drug further. Nevertheless, competition is stiff in the NSCLC market. Merck's MRK  PD-L1 inhibitor, Keytruda, commands a strong place in the first-line NSCLC market. Other PD-L1 inhibitors available in the market are AstraZeneca's AZN  Imfinzi and Roche's RHHBY  Tecentriq. Bristol-Myers currently sports a Zacks Rank #1 (Strong Buy). You can see   the complete list of today's Zacks #1 Rank stocks   here  .   Bristol-Myers Squibb Company Price           Bristol-Myers Squibb Company price    |   Bristol-Myers Squibb Company Quote    Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana. Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Roche Holding AG (RHHBY): Free Stock Analysis Report   Bristol-Myers Squibb Company (BMY): Free Stock Analysis Report   AstraZeneca PLC (AZN): Free Stock Analysis Report   Merck & Co., Inc. (MRK): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Bristol-Myers Squibb Company  BMY   announced long-term pooled efficacy and safety results from the phase III CheckMate-017 and CheckMate-057 studies in patients with previously-treated, advanced non-small cell lung cancer (NSCLC).",
    "Shares of the company have lost 3.2% in the year so far against the  industry  's growth of 1.9%.",
    "At five years, patients treated with Opdivo (nivolumab) continuedto experience long-term overall survival (OS) benefit versus docetaxel. Treatment with Opdivo was associated with a 5-year OS rate of 13.4% compared with 2.6% with docetaxel in previously-treated NSCLC patients.",
    "The OS benefit with the drug was observed across all patient subgroups, including those with PD-L1 expression on <1% of tumor cells. Further, the safety profile for Opdivo was consistent with prior findings in the second-line setting, and no new safety signals were observed with the longer follow-up. Only two of the 70 patients currently on study experienced a new treatment-related select adverse event (AE) between years 3 and 4. There were no new treatment-related select AEs reported between years 4 and 5 among the 55 patients still on study.",
    "This pooled analysis represents the longest follow-up of previously-treated NSCLC patients treated with Immuno-Oncology therapy in phase III randomized studies.",
    "Opdivo is Bristol-Myers' primary growth driver. It is currently approved in the United States, the EU, Japan and other countries for several cancer indications. The company is working on expanding the label of the drug further.",
    "Nevertheless, competition is stiff in the NSCLC market. Merck's MRK  PD-L1 inhibitor, Keytruda, commands a strong place in the first-line NSCLC market. Other PD-L1 inhibitors available in the market are AstraZeneca's AZN  Imfinzi and Roche's RHHBY  Tecentriq.",
    "Bristol-Myers currently sports a Zacks Rank #1 (Strong Buy). You can see   the complete list of today's Zacks #1 Rank stocks   here  . ",
    " Bristol-Myers Squibb Company Price ",
    "         Bristol-Myers Squibb Company price    |   Bristol-Myers Squibb Company Quote  ",
    " Bristol-Myers Squibb Company price    |   Bristol-Myers Squibb Company Quote ",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana. Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:13:00"
}