{
  "url": "https://www.nasdaq.com/article/heres-why-you-should-invest-in-edwards-lifesciences-ew-now-cm1207716",
  "title": "Here's Why You Should Invest in Edwards Lifesciences (EW) Now - Nasdaq.com",
  "text": [
    "Edwards Lifesciences CorporationEW has been gaining investors' confidence on consistently positive results. Over the past year, the company's shares have outperformed its industry . The stock has gained 56.4% against a 5.7% decline of the industry. Also, the company has outperformed the S&P 500's 0.2% fall during this period.\r\n The renowned global aortic valve replacement devices provider has a market cap of $45.72 billion. The company's five-year projected growth rate looks impressive at 14.9%. It is expected to scale new highs in the near term. The company has average positive earnings surprise of 4.3% for the trailing four quarters.\r\n Per our Style Score , Edwards Lifesciences has Growth Score of A, which is reflective of its solid prospects. Our research shows that stocks with a Growth Style Score of A or B, combined with a Zacks Rank #1 (Strong Buy) or #2 (Buy), offer the best upside potential.\r\n With solid prospects, the Zacks Rank #2 company is a worthy investment choice right now.What Makes the Stock an Attractive Pick?Robust TAVR Growth: We are upbeat about the company, which once again witnessed robust growth within its core transcatheter aortic valve replacement (TAVR) arm in the second quarter of 2019 on strong worldwide sales. It is expecting to hold on to this growth momentum on the continuous expansion of patient access, actively leveraging current valve platforms for additional indications and the development of next-generation valve platforms.",
    "Recent Approvals Seem Strategic: Edwards Lifesciences recently announced receiving the FDA nod for the expanded use of the Edwards SAPIEN 3 and SAPIEN 3 Ultra transcatheter heart valve systems for the treatment of patients with severe symptomatic aortic stenosis (AS), who are at low risk of open-heart surgery.\r\n The company also received FDA approval for CLASP IIF, which is a potential multicenter, randomized, controlled pivotal trial, studying the PASCAL system. This is expected to give a tough competition to Abbott Laboratories' MitraClip device. The two approvals are expected to increase Edwards Lifesciences' customer base.Acquisitions and Partnerships to Add Value: We are looking forward to the company's recently-formed alliance with CAS Medical Systems, Inc. (CASMED). After the acquisition, Edwards Lifesciences plans to use CASMED's FORE-SIGHT non-invasive cerebral oxygenation technology with its HemoSphere advanced hemodynamic monitoring platform. This partnership will likely offer a unique blend of enhanced recovery tools and predictive analytics capabilities for medical professionals.Raised Guidance Buoys Optimism: Banking on strong second-quarter performance, Edwards Lifesciences recently raised its 2019 adjusted earnings per share guidance to $5.20-$5.40 from $5.10-$5.35 mentioned earlier. The Zacks Consensus Estimate for earnings of $5.34 remains within the company's projected range. This indicates that Edwards Lifesciences will likely be able to maintain the ongoing bullish momentum for the rest of the year.Which Way Are Estimates Heading?\r\n The estimate revision trend of the company for the current year is impressive. Over the past 60 days, the Zacks Consensus Estimate for its earnings has inched up 1.4% to $1.41.\r\n The Zacks Consensus Estimate for its 2019 revenues is pegged at $4.24 billion, suggesting a 13.9% increase from the year-ago reported number.",
    "Other Key Picks",
    "Some other top-ranked stocks in the broader medical space are Baxter International Inc. BAX , GW Pharmaceuticals plc GWPH and LeMaitre Vascular, Inc. LMAT .",
    "Baxter's long-term earnings growth rate is estimated at 12.8%. The stock carries a Zacks Rank #2 at present. You can see  the complete list of today's Zacks #1 Rank stocks here .",
    "GW Pharmaceuticals, with a Zacks Rank #1, has an estimated earnings growth rate of 72.8% for the third quarter 2019.",
    "LeMaitre Vascular's long-term earnings growth rate is projected at 10%. The stock currently sports a Zacks Rank of 1.",
    "It's Illegal in 42 States, But Investors Will Make Billions Legally\r\n In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.\r\n That's twice as much as they spend on marijuana, legally or otherwise.\r\n Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 07:17:00"
}