{
  "url": "https://www.nasdaq.com/article/tuesdays-vital-data-ulta-workday-and-shopify-cm1206822",
  "title": "Tuesday’s Vital Data: Ulta, Workday and Shopify - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "U.S. stock futures are trading lower this morning, continuing the weakness saw on Friday. Overhead resistance near $2,940 in the S&P 500 has rejected every rally since July's breakdown and last week proved no different. Until buyers can muster the strength to vault back above it, the technical picture will remain bearish.",
    "Ahead of the bell, futures on the Dow Jones Industrial Average are down 0.76%, and S&P 500 futures are lower by 0.62%. Nasdaq-100 futures have lost 0.60%.",
    "In the options pits, Friday's slide propelled put volume ahead of calls on the session, while overall volume settled near average levels. Approximately 16.1 million calls and 16.5 million puts changed hands.",
    "The pop in put demand spilled over to the CBOE, where the single-session equity put/call volume ratio jumped to 0.68 - a one-week high. Meanwhile, the 10-day moving average slipped to 0.67.",
    "Options traders zeroed in on earnings reports Friday. Ulta Beauty (NASDAQ: ULTA ) shares plunged 30% after the company slashed forward guidance. Workday (NASDAQ: WDAY ) slipped below support despite beating earnings estimates. Finally, Shopify (NYSE: SHOP ) saw its third down day in a row, offering an attractive buy-the-dip opportunity.",
    "Let's take a closer look:",
    "Ulta Beauty rose from obscurity over the past decade to become one of the biggest gainers of the bull market. But Friday's 30% plunge revealed all is not well with the American chain of beauty stores. As with many high-flying momentum stocks that fail to live up to lofty expectations, ULTA stock was beaten mercilessly after reporting worse-than-expected second-quarter earnings and lowering full-year guidance.",
    "Ulta's earnings-per-share grew to $2.76 on $1.67 billion in revenue. While both metrics marked modest growth, the uptick wasn't good enough. Analyst estimates were looking for $2.80 in EPS on $1.75 billion in sales. Citing \"headwinds\" in the cosmetics market, the company lowered its full-year EPS forecast by almost a buck, from $12.83-$13.03 to $11.86-$12.06.",
    "Time will tell if Friday's 30% haircut was sufficient to price in the earnings downshift. The next major support zones to watch are $220, then $200.",
    "Options trading exploded with calls outpacing puts on the day. Total activity rocketed to 17x the average daily volume, with 128,030 contracts traded. Calls accounted for 59% of the take.",
    "Premiums were pricing in a gap of just under 7%, so the 30% slashing was a monster move. Traders harnessing long volatility plays like straddles or strangles came out massive winners for the event.",
    "The trend of selling earnings results continued with Workday ahead of the weekend. The provider of human resources software slipped 5.5% despite reporting better-than-expected numbers.",
    "For the quarter, Workday posted earnings of 44 cents per share on revenue of $887.75 million. Both measures bested estimates, but investors wanted even more. With Friday's beatdown, WDAY stock has now fallen 22% off its highs. It now rests below all major moving averages with the 50-day and 20-day both trending lower. Volume patterns aren't helping the bull case either, with multiple distribution days cropping up over the past six weeks.",
    "On the options trading front, calls slightly edged out puts in popularity. Activity swelled to 629% of the average daily volume, with 80,254 total contracts traded; 52% of the total came from calls.",
    "With the uncertainty of earnings in the rearview mirror, implied volatility plunged to 36% or the 25th percentile of its one-year range. Premiums are now baking in daily moves of $3.97 or 2.2%.",
    "Shopify shares suffered their third straight down day ahead of the weekend amid well-deserved profit-taking. Chart watchers shouldn't be concerned one bit over the bout of selling. It was perfectly benign and was likely due to garden variety register ringing after a substantial $100 rise in SHOP stock.",
    "After rallying almost $14 off the lows, SHOP only ended the day down 1.6%. Volume was slightly above average, but nothing high enough to scare the children. All-in-all, I'm taking Shopify's appearance atop the most-active options leaderboard as an excuse to highlight its beautiful uptrend and rock star 2019 performance. The shares are up 178% year-to-date.",
    "The cloud-based commerce company saw a sharp uptick in options trading. Total activity swelled to 213% of the average daily volume, with 80,270 contracts traded; 52% of the trading came from call options.",
    "Implied volatility ticked up to 29%, landing it at the 26th percentile of its one-year range. Premiums are baking in daily moves of $11.89 or 3.1%. Bull call spreads are my strategy of choice here.",
    "As of this writing, Tyler Craig didn't hold a position in any of the aforementioned securities. Check out his recently releasedBear Market Survival Guideto learn how to defend your portfolio against market volatility.",
    "The post Tuesday's Vital Data: Ulta, Workday and Shopify appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:34:30"
}