{
  "url": "https://www.nasdaq.com/article/has-enphase-energy-enph-outpaced-other-oils-energy-stocks-this-year-cm1207174",
  "title": "Has Enphase Energy (ENPH) Outpaced Other Oils-Energy Stocks This Year? - Nasdaq.com",
  "text": [
    " For those looking to find strong Oils-Energy stocks, it is prudent to search for companies in the group that are outperforming their peers. Has Enphase Energy (ENPH) been one of those stocks this year? A quick glance at the company's year-to-date performance in comparison to the rest of the Oils-Energy sector should help us answer this question. Enphase Energy is one of 310 companies in the Oils-Energy group. The Oils-Energy group currently sits at #14 within the Zacks Sector Rank. The Zacks Sector Rank considers 16 different sector groups. The average Zacks Rank of the individual stocks within the groups is measured, and the sectors are listed from best to worst. The Zacks Rank is a proven system that emphasizes earnings estimates and estimate revisions, highlighting a variety of stocks that are displaying the right characteristics to beat the market over the next one to three months. ENPH is currently sporting a Zacks Rank of #2 (Buy). Within the past quarter, the Zacks Consensus Estimate for ENPH's full-year earnings has moved 51.11% higher. This shows that analyst sentiment has improved and the company's earnings outlook is stronger. Based on the latest available data, ENPH has gained about 485.62% so far this year. At the same time, Oils-Energy stocks have lost an average of 2.85%. This shows that Enphase Energy is outperforming its peers so far this year. To break things down more, ENPH belongs to the Solar industry, a group that includes 12 individual companies and currently sits at #32 in the Zacks Industry Rank. On average, stocks in this group have gained 77.81% this year, meaning that ENPH is performing better in terms of year-to-date returns. ENPH will likely be looking to continue its solid performance, so investors interested in Oils-Energy stocks should continue to pay close attention to the company.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Enphase Energy, Inc. (ENPH): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "For those looking to find strong Oils-Energy stocks, it is prudent to search for companies in the group that are outperforming their peers. Has Enphase Energy (ENPH) been one of those stocks this year? A quick glance at the company's year-to-date performance in comparison to the rest of the Oils-Energy sector should help us answer this question.",
    "Enphase Energy is one of 310 companies in the Oils-Energy group. The Oils-Energy group currently sits at #14 within the Zacks Sector Rank. The Zacks Sector Rank considers 16 different sector groups. The average Zacks Rank of the individual stocks within the groups is measured, and the sectors are listed from best to worst.",
    "The Zacks Rank is a proven system that emphasizes earnings estimates and estimate revisions, highlighting a variety of stocks that are displaying the right characteristics to beat the market over the next one to three months. ENPH is currently sporting a Zacks Rank of #2 (Buy).",
    "Within the past quarter, the Zacks Consensus Estimate for ENPH's full-year earnings has moved 51.11% higher. This shows that analyst sentiment has improved and the company's earnings outlook is stronger.",
    "Based on the latest available data, ENPH has gained about 485.62% so far this year. At the same time, Oils-Energy stocks have lost an average of 2.85%. This shows that Enphase Energy is outperforming its peers so far this year.",
    "To break things down more, ENPH belongs to the Solar industry, a group that includes 12 individual companies and currently sits at #32 in the Zacks Industry Rank. On average, stocks in this group have gained 77.81% this year, meaning that ENPH is performing better in terms of year-to-date returns.",
    "ENPH will likely be looking to continue its solid performance, so investors interested in Oils-Energy stocks should continue to pay close attention to the company.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:11"
}