{
  "url": "https://www.nasdaq.com/article/gamestop-outlines-its-rebound-plan-as-sales-declines-accelerate-cm1210590",
  "title": "GameStop Outlines Its Rebound Plan as Sales Declines Accelerate - Nasdaq.com",
  "text": [
    "  GameStop    (NYSE: GME) shares were volatile in the weeks leading up to its   second-quarter earnings release. The price swings reflected major   shareholder questions about how the business might endure the   accelerating shift toward digital-game purchasing and the winding   down of the current generation of video game consoles. On Tuesday, the specialty retailer demonstrated that these   issues are likely to reduce sales and profits at least over the   next year. Executives expressed confidence, though, that their   transformation plan will turn things around. Let's take a   closer look.  Data source: GameStop's financial filing.       What happened this quarter?  GameStop's sales declines accelerated as gamers pulled back   their spending across hardware and software categories. Gross   profitability held up, but that modest success was overwhelmed by   a $400 million goodwill impairment charge in connection with the   company's turnaround strategy.   Image source: Getty Images.  Highlights of the quarter include:  Comparable-store sales fell 11%, compared to 10% in the     previous quarter. That decline included a 41% slump in new     hardware sales, 5% lower new software sales, and an 18% drop in     GameStop's pre-owned gaming segment. The collectibles unit was the only one of GameStop's six     divisions to grow during the period as sales rose 21%, thanks     to strong demand across domestic and international stores. Gross profit margin held steady at 31% of sales, mainly     thanks to the fact that new hardware revenue collapsed. That     segment is GameStop's least profitable, so declines there tend     to help profitability. Accessory sales, lifted by the     popularity of games like     Fortnite      , continued to attract strong margins. Selling expenses rose, pushing the     consumer discretionary      business deeper into the red. That operating loss was magnified     by a $400 million impairment writedown. GameStop paid off $50 million of debt and has now roughly     cut its debt burden in half this year, down to $419     million.   What management had to say  CEO George Sherman and his team said they weren't surprised by   the sharp drop in customer traffic and sales volumes. \"We   experienced sales declines across a number of our categories,\"   CFO Jim Bell said in a press release. \"These trends are   consistent with what we have historically observed toward the end   of a hardware cycle,\" Bell explained, referring to the recent   announcement of new gaming consoles coming in 2020. As for the updated operating structure, Sherman said GameStop   is \"committed to acting with a sense of urgency to address the   areas of the business that are critical to achieving long-term   success and value creation for our stakeholders.\" Management   outlined the key tenants of that rebound plan, which include   slashing costs and reducing the store base, in addition to a   sharper focus on high-margin categories like accessories.  Looking forward  With next-generation console launches still about a year away   and gamer spending quickly moving online, GameStop is operating   in an especially difficult selling environment as it heads into   the holiday-shopping season. Last quarter's decision to   suspend the dividend    helped shore up capital in preparation for this tough   situation. Looking further out, management's hope is to improve its   annual profit generation by $200 million by fiscal 2021. But   investors will likely see falling sales and subpar earnings in   the meantime.   10 stocks we like better than GameStop       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and GameStop wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Demitrios Kalogeropoulos      has no position in any of the stocks mentioned. The Motley Fool     owns shares of GameStop. The Motley Fool has a     disclosure policy      .  ",
    " GameStop    (NYSE: GME) shares were volatile in the weeks leading up to its   second-quarter earnings release. The price swings reflected major   shareholder questions about how the business might endure the   accelerating shift toward digital-game purchasing and the winding   down of the current generation of video game consoles.",
    "On Tuesday, the specialty retailer demonstrated that these   issues are likely to reduce sales and profits at least over the   next year. Executives expressed confidence, though, that their   transformation plan will turn things around. Let's take a   closer look.",
    "Data source: GameStop's financial filing.     ",
    "GameStop's sales declines accelerated as gamers pulled back   their spending across hardware and software categories. Gross   profitability held up, but that modest success was overwhelmed by   a $400 million goodwill impairment charge in connection with the   company's turnaround strategy.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Highlights of the quarter include:",
    "CEO George Sherman and his team said they weren't surprised by   the sharp drop in customer traffic and sales volumes. \"We   experienced sales declines across a number of our categories,\"   CFO Jim Bell said in a press release. \"These trends are   consistent with what we have historically observed toward the end   of a hardware cycle,\" Bell explained, referring to the recent   announcement of new gaming consoles coming in 2020.",
    "As for the updated operating structure, Sherman said GameStop   is \"committed to acting with a sense of urgency to address the   areas of the business that are critical to achieving long-term   success and value creation for our stakeholders.\" Management   outlined the key tenants of that rebound plan, which include   slashing costs and reducing the store base, in addition to a   sharper focus on high-margin categories like accessories.",
    "With next-generation console launches still about a year away   and gamer spending quickly moving online, GameStop is operating   in an especially difficult selling environment as it heads into   the holiday-shopping season. Last quarter's decision to   suspend the dividend    helped shore up capital in preparation for this tough   situation.",
    "Looking further out, management's hope is to improve its   annual profit generation by $200 million by fiscal 2021. But   investors will likely see falling sales and subpar earnings in   the meantime.",
    "  10 stocks we like better than GameStop       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and GameStop wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than GameStop       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and GameStop wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Demitrios Kalogeropoulos      has no position in any of the stocks mentioned. The Motley Fool     owns shares of GameStop. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:09:00"
}