{
  "url": "https://www.nasdaq.com/article/the-chief-executive-has-to-serve-two-masters---hk-leader-carrie-lam--full-transcript-20190912-00206",
  "title": "The Chief Executive ‘has to serve two masters' - HK leader Carrie Lam – full transcript - Nasdaq.com",
  "text": [
    "HONG KONG, Sept 12 (Reuters) - This is a transcript of a talk given in late August by Hong Kong Chief Executive Carrie Lam to a group of businesspeople in the city. The transcript is taken from an audio recording of Lam's remarks that was obtained by Reuters. Last week, Reuters published most of Lam's remarks and is now able to publish them in full.",
    "People who attended the talk say she spoke for about a half hour. The recording, which runs 24 minutes, captures the bulk of the event. Reuters has redacted the transcript in a few spots to remove names mentioned by Lam and questions asked by the audience.",
    "CARRIE LAM:",
    "In less than three months' time, Hong Kong has been turned upside down, and my life has been turned upside down. But this is not the moment for self-pitifulness, although I shared with [name redacted] that nowadays it's extremely difficult for me to go out. I have not been on the streets, not in the shopping malls, can't go to a hair salon, can't do anything because my whereabouts will be spread around the social media, the Telegram, the LIHKG, and you could expect a big crowd of black T-shirts and black-masked young people waiting for me.",
    "I'm still brave enough to go and this afternoon, I'm still planning to go if my security guards tell me later on that I can still go. But it's really, I don't want to cause disruption, inconvenience to the organisers. But as I said, this is not the time for me to self-pity myself. This is a time I come here, and I do other closed-door sessions from time to time with people from all walks of life, and the two things I said is, it's not about self-pityness, it's about making a plea for forgiveness and then appeal for love.",
    "I don't want to spend your time, or waste your time, for you to ask me what went wrong, and why it went wrong. But for a chief executive to have caused this huge havoc to Hong Kong is unforgivable. It's just unforgivable. If I have a choice, the first thing is to quit, having made a deep apology, is to step down. So I make a plea to you for your forgiveness.",
    "This is something that no matter how well intended, I just want to put this message across. This is not something malicious. This is not something instructed, coerced by the central government. This is out of a good intention, myself and some of my key colleagues to try to plug legal loopholes in Hong Kong's system, very much prompted by our compassion for a single case, and this has proven to be very unwise given the circumstances. And this huge degree of fear and anxiety amongst people of Hong Kong vis-a-vis the mainland of China, which we were not sensitive enough to feel and grasp. And, of course, it has been exaggerated and misrepresented through very effective propaganda, if I may say so.",
    "Now I want to make an appeal for love. It's not to pity me, or to sympathise with me, but love for Hong Kong. And I'm sure [name redacted] have that strong passion and love for Hong Kong.",
    "Then the question we need to ask, each one of us, is how to fix it, how to fix it? I have to say that I have no sort of ready solutions, because the scene changes so quickly. A week ago, we thought - ‘we' means the core group within the government with some of our advisers - we thought that we have a relatively peaceful weekend, perhaps that's the time to start a dialogue with sincerity, with humility, and trying to get some of Hong Kong's fundamental issues resolved. But, unfortunately, the last two days have again totally thrown that away and we are seeing escalated violence to the degree of being insane. If you look at some of these TV footage and videos of how policemen have been attacked and so on.",
    "But, of course, I'm sure in your hearts you will feel, and I'm sure a large number of people feel that I do have a solution, that is a political one. But I have to tell you that this is where the crux of the matter lies. Once an issue has been elevated to the situation - I'm sure [name redacted] has a better feel of that - to a national level, to a sort of sovereignty and security level, let alone in the midst of this sort of unprecedented tension between the two big economies in the world. The room, the political room for the chief executive who, unfortunately, has to serve two masters by constitution, that is the central people's government and the people of Hong Kong, that political room for maneuvering is very, very, very limited. Because we were not trained to have that sort of national perspectives, and I could only keep on putting in what I feel is the Hong Kong situation and the Hong Kong sentiments. But whether those Hong Kong sentiments could override the national perspective and the national sentiments? I'm sure you know that now 1.4 billion mainland people already have formed a view about what is happening in Hong Kong. So, without going into a lot more details, I can only share with you discreetly that the room for me to offer a political situation in order to relieve the tension, nor to reduce the pressure on my frontline police officers in order to at least respond, or pacify the large number of peaceful protesters who are so angry with the government, with me in particular, of absolutely dead silence despite repeated participation in the protests, is what causes me the biggest sadness.",
    "So without that, what other means we have is Hong Kong's core value, that is the rule of law. The rule of law takes several forms, of course law enforcement, our police officers who have been suffering tremendously this time, especially on an occasion when they are supposed to celebrate 175 years of police establishment, and especially at a time when they were so proud of the crime figures which are still coming down. In fact, the first half year we still saw a drop of four percent in total crimes in Hong Kong, and that was the best seen in Hong Kong since 1972. And also they have commissioned a survey to commemorate this occasion done not by a pro-establishment group but by [name redacted], which indicated that confidence in the police after Occupy Central has rebounced to a historic high. That was the sort of background to how much the police have suffered.",
    "So the rule of law requires law enforcement, so we have to tackle this escalating violence by arresting those offenders and then put them through the justice system, whether it's prosecution by the Department of Justice in an impartial manner without any interference from myself or from the Central People's government, and then finally in the courts.",
    "With a little bit of hope that may help because we are seeing the numbers reducing. We started off by an estimate of about one to two thousand protesters who are very violent. Or put it that way, they are very willing to resort to violence. They may not be violent by nature but they are very willing to resort to violence, so, as described by one expert, this is the, sort of, early signs of anarchism, that they don't trust the establishment, they don't mind destroying things even if they don't know what destruction will bring.",
    "And if you look at yesterday's various protests, it's not only in the Tsuen Wan, Kwai Chung area, but then it spread to Tsim Sha Tsui, Sham Shui Po, Wong Tai Sin. Every spot of confrontations, we're talking about 50 to 300 at least, and they, actually because they were flowing so there could be some duplicates, so we might be seeing a smaller number. Whether it's because of the 700-plus arrests that we have made has a bit of deterrent effect, or removed some of these factions, we have not had a full analysis, but we hope that with those efforts we may be able, as I said, I'll be very honest with you, it would be naïve for me to paint you a rosy picture, that things will be fine or I have a deadline. But I can assure you that Beijing does not have a deadline. They know this will ripple on. So we have made special arrangements and there will be a 1st of October National Day celebrations but still having a lot of disruptions. So we are going for a modest, but solemn type of celebrations on the 1st of October, which means that they and ourselves have no expectations that we could clear up this thing before the 1st of October.",
    "Another thing I want to assure you, that is my own feeling the pulse and through discussions, CPG (Central People's Government) has absolutely no plan to send in the PLA. They are now doing, sort of, acts which I'm sure you're quite aware of amongst the Communist Party, they're just quite scared now. Because they know that the price would be too huge to pay. Maybe they don't care about Hong Kong, but they care about ‘one country, two systems.' They care about the country's international profile. It has taken China a long time to build up to that sort of international profile and to have some say, not only being a big economy but a responsible big economy, so to forsake all those positive developments is clearly not on their agenda. But they're willing to play long, they are willing to play long, so you have no short-term solution, Hong Kong suffers, you lose tourism, economy, you lose your IPOs and so, but you can't do much about it. But after everything has been settled the country will be there to help with maybe positive measures especially in the Greater Bay Area. So our work on the Greater Bay Area has actually not stopped. We are still putting in proposals to the Greater Bay Area, especially something markets would love to hear, is a major ecological conservation plan which was drawn up by [name redacted]. She has left the government, I have brought her in on a part-time basis to draw up this ecological conservation plan for the entire Greater Bay Area in terms of biodiversity, air standards, water and so on.",
    "So what could [name redacted] help us. Of course, every one of you has your own circle, you have your own friends, you have your own connections, you have your business contacts, so try to impress upon them that we really need to put an end to the violence, this is totally alien to Hong Kong and try to, as I said, appeal for understanding and love. We love this place, we love the people here. People used to be very peaceful and inclusive and so on. Instead of taking a position on every issue, either your friend or your foe, and so on.",
    "When the time comes, now Hong Kong has survived the death pronounced by some people before 1997. At this point in time, although I'm actually pessimistic, but Hong Kong is not dead yet. Maybe she is very, very sick but she is not dead yet. We still have fundamentals here, we still have the nation behind us. So Hong Kong will have to go through several stages. The first is stamping out the violence, maybe doing other things in time to come which at the moment are not very available. Having gone through this stage, the next stage will be, in accordance with the bible, would be resurrection. We will need to come back to life, some life. So thereafter we want a reborn Hong Kong and a relaunching of this Hong Kong brand. [name redacted]",
    "After her talk, Lam answered questions.",
    "In answer to a question about the impact of the protests on schools and universities, Lam said:",
    "Well, thank you very much [name redacted]. We will continue to help the schools. I am meeting a group of school principals within this week together with the secretary for education. Let me just answer your question in a very general way. I know certain factions in society have the feeling that we are not firm and strong enough vis-a-vis these protesters. But the difficulty is, of course, is always coming up with an argument that in the light of the majority of the public views and the people's sentiments, this anger and this fear and so on, too strong a position of the government could be counterproductive. Although our research into overseas experiences in combating riots did require that sort of forcefulness. For example, in 2011, in Tottenham riots 15,000 rioters involved, 2,000 were arrested, 1,000 put to prison following a very quick process. From start to finish is 5-6 weeks, through special courts, night courts, 24 hours. What would you imagine to be the Chief Justice's reaction if I were to tell him, ‘could you have special courts, night courts, in order to clear all these cases?' We have arrested 700-plus now. So there are solutions that will be readily deployed in other countries that cannot be used in Hong Kong.",
    "The second factor is apart from the 30,000 men and women in the force we have nothing. Really. We have nothing. I have nothing. That's something, is something we avoid. So that means that whatever we do we have to take into full account the police assessment and reactions, so to give them some powers which they could not enforce because they're outnumbered. They're outnumbered not necessarily just by the violent protesters, they're outnumbered just by people, which makes enforcement extremely difficult in terms of crowd management and crowd dispersal. So I'm not saying that we are not thinking about some of those firmer measures but just to explain to you that in the Hong Kong situation it's very difficult, especially with the media. And this is perhaps one of Hong Kong's weakest links, or the government's weakest links, that we don't have a strong enough, sort of, I wouldn't say propaganda, I dare not say government carries out propaganda, but at least in terms of dissemination of factual information we are very, very weak. If we survive this crisis, well there will be a large number of revamping that I need to do in order to leave behind a better situation for my successor because there are so many weak parts in the government, which we have not fully realized. We did realize a bit, but we did not fully realize that it could be that bad, when we are going into, or right into, a crisis.",
    "In answer to a suggestion from the audience related to the government's public relations efforts:",
    "I'm not aware of that 120-page document [name redacted]. But what I have asked for, but that is a little bit overtaken by events, that was almost a month ago, when we optimistically thought that we would have some sort of peaceful moments, that we could start to think about relaunching Hong Kong. So we sent out something by the information services department and invited eight such global PR companies, but unfortunately four immediately declined because that would be a detriment to their reputation to support the Hong Kong SAR government now, and two subsequently also turned away a request for meetings. So we're left with two. I'm happy to meet with these two remaining personally, to see what advice they have, but their advice will only be more relevant after we have gone through this period.",
    "This is also a very difficult moment for us because people take sides, and people are very worried about what they call this ‘white terror,' this harassment on them. The revealing of details [in Cantonese]. And so it's not even very difficult for us to get a production house, a design studio to do things for us, so things have to be done in-house or in the mainland. In the mainland then this causes problems. The smart lamp posts, somebody discovered that the raw parts came from a Shanghai factory and then they made a big story out of it again. But when the time comes, I certainly take up your advice that we should remove some of this bureaucracy and start talking to the people who could help, if they are willing to help.",
    "Special Report: Hong Kong leader says she would 'quit' if she could, fears her ability to resolve crisis now 'very limited'",
    "(Transcript by James Pomfret and Greg Torode in Hong Kong. Edited by Peter Hirschberg.)"
  ],
  "published_datetime": "2019-09-12 04:00:00"
}