{
  "url": "https://www.nasdaq.com/article/should-investors-buy-ibm-stock-this-month-cm1210763",
  "title": "Should Investors Buy IBM Stock This Month? - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "As a component of the Dow Jones Industrial Average,  International Business Machines  (NYSE: IBM ) stock gets a lot of attention due to its high dividend yield, which is currently about 4.5%. In 2019, IBM was ranked by Forbes magazine as the world's twentieth most valuable brand.",
    "Year-to-date, IBM stock is up about 27%. Now may be time for investors to take some of the impressive paper profits they have made in IBM stock.",
    "In the next several weeks, I expect the IBM stock price to be volatile and decline. However, long-term investors may regard a decline as an opportunity to buy into IBM shares. Here is why.",
    "On July 17, IBM reported its second-quarter  earnings . Its earnings per share beat analysts' average outlook, but its top line came in below their average estimate. Overall, Wall Street's reaction to Big Blue's quarterly results has been muted.",
    "IBM's top line continued to fall in Q2, declining to $19.16 billion from the $20 billion it took in during the same period a year earlier. The average top-line estimate was $19.17 billion. Q2 was IBM's fourth straight quarter without revenue growth.",
    "Net income was $2.5 billion, compared with $2.4 billion a year ago. Adjusted earnings of $3.17 per share was significantly ahead of the market's estimated earnings of $3.07 per share.",
    "The earnings result signaled to investors that the corporation would likely continue its generous dividend policy, as dividends reach 60% of free cash flow.",
    "In recent years IBM has become a diversified company with a wide range of worldwide offerings, including IT hardware, software, and services. Five segments generate revenue for IBM:",
    "Currently, IBM's largest business segment is GTS. Going forward, management is aiming for Cloud & Cognitive Software to become a leading driver of the company's revenue.",
    "In Q2 results, IBM CEO Ginni Rometty highlighted the growth of the company's Cloud & Cognitive Software segment, whose revenue increased 3.2% to $5.6 billion. The market forecast was $5.55 billion.",
    "However, the revenue of Microsoft's  (NASDAQ: MSFT ) Intelligent Cloud unit jumped  19%  year-over-year, indicating that IBM is not yet able to compete with other dominant companies in this lucrative area.",
    "IBM's management has been looking to revitalize the company by making it a dominant force in open source and the cloud. In October 2018, IBM announced that it would acquireRed Hat  (NYSE: RHT ), a  well-respected , open-source, enterprise-software maker for $34 billion.",
    "Earlier in the year, IBM finalized the purchase, but it has not yet included Red Hat's performance in IBM's most recent financials.",
    "Investors are hoping that IBM's acquisition of Red Hat will put IBM stock en-route to becoming a leader in the hybrid cloud sphere.",
    "Cloud computing has become a disruptive force in technology. Hybrid cloud environment uses a mix of on-premises, private cloud and third-party cloud services. By 2023, the global hybrid cloud market is expected to reach $138.63 billion .",
    "Well-known for its corporate version of Linux, Red Hat generates a great deal of revenue from the cloud. But will Red Hat improve IBM's fundamentals ?",
    "Red Hat has significant  competitive advantages. In several quarters, it may become a catalyst that will contribute to the growth of IBM's cloud business .",
    "However, a prolonged trade war between the U.S. and China could  adversely affect the IBM  stock price. Wall Street has also voiced concern that the global economy could be headed for a downturn .",
    "Therefore, the rest of 2019 could prove somewhat bumpy for IBM stock. Don't forget that IBM paid a hefty premium for Red Hat, and that the deal was one of the largest tech acquisitions of all time. On Aug. 2, IBM lowered its 2019 earnings guidance , citing an adjustment to its deferred revenue as a result of the Red Hat deal.",
    "Additionally, IBM now plans to  suspend its share buybacks in 2020 and 2021 while it works on decreasing the debt it accumulated from the purchase of Red Hat.",
    "Going forward, investors are likely to pay attention to IBM stock's margins. If this acquisition does not translate into healthier margins, then the IBM share price could suffer.",
    "When investors look back at the earlier part of this decade, they may realize that IBM was not fully on top of developments in the tech space. Namely, International Business Machines did not take enough steps to participate in the cloud, an industry that is projected to grow exponentially  in the next few years.",
    "Instead, management continued to concentrate on  Enterprise IT , whose growth was and likely will be limited. IBM has also  blamed external developments for the failure of its turnaround. As a result, IBM has generated plenty of investor skepticism of late. And the IBM stock price has reflected the sub-par decisions of its management.",
    "From April 2014 to December 2015, the IBM stock price fell from $200 to $120. In February 2017, IBM went back up to $180, only to hit $105.94 in December 2018.",
    "Then came the rally of 2019. On Aug. 2, IBM shares reached a 2019-high of $152.95.",
    "To the dismay of long-term shareholders, IBM shares suffered for the most part of August. On Aug. 23, IBM stock price hit an intra-day low of  $128.83. This low was followed by a rapid move up in the past two weeks. Currently IBM stock is around $145.",
    "If you are an investor who pays attention to short-term technical charts, you may be interested to know that the charts of International Business Machines stock are painting an overbought picture and telling investors to be cautious. In other words, the shorter-term IBM stock chart points to volatility and some potential declines, possibly quite soon.",
    "Considering how much IBM stock is up so far in 2019 and especially in the past few trading sessions, owners of IBM stock should probably not hesitate to take some money off the table.",
    "The most likely scenario is that until the next earnings report in mid-October, IBM stock will trade between $125 and $145. I'd expect the $125 level to act as major support. On the other hand, $147.5 and then $152.5 are likely to act as near-term resistance.",
    "Over the past several decades. IBM has transformed itself from maker of computers to technology consultants. Now management is working hard to make the group a major cloud competitor. I am of the opinion that management will succeed in its quest in the long-term. However, it may be a few quarters before IBM generates consistent revenue and earnings growth again.",
    "In the near-term, I believe IBM stock price is likely to become increasingly volatile. As a result, if you are one of the investors with paper profits in the IBM stock, you may want to consider taking some of your profits. However, if you do not want to sell your IBM stock due to its dividends, then you may want to stay the course and ride out any short-term volatility.",
    "Alternatively, you may consider hedging your position. As for hedging strategies, covered calls or put spreads that expire on Oct. 18 could be appropriate, as straight put purchases are likely to be expensive due to the stock's heightened volatility.",
    "Finally, if you aren't already long IBM shares, you may want to remain on the sidelines until you see a better opportunity to buy the shares on weakness. That strategy would also enable investors to benefit from higher dividend yields.",
    "As of this writing, Tezcan Gecgil did not hold a position in any of the aforementioned securities.",
    "The post Should Investors Buy IBM Stock This Month? appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 12:51:38"
}