{
  "url": "https://www.nasdaq.com/article/cango-inc-cang-q2-2019-earnings-call-transcript-cm1207442",
  "title": "Cango Inc. (CANG) Q2 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   Cango Inc.    (NYSE: CANG)        Q2 2019 Earnings Call       September 3, 2019,   9:00 p.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Good morning and good evening, everyone. Welcome to the Cango   Inc. second quarter 2019       earnings conference call    . At this time, all participants are in a listen-only mode. This   call is also being broadcast live on the company's IR website.   Joining us today are Mr. Jiayuan Lin, Chief Executive Officer,   and Mr. Zhang Yongyi, Chief Financial Officer of the company.   Following management's prepared remarks, we will conduct a   Q&A session. Before we begin, I refer you to the safe harbor statement in   the company's earnings release, which also applies to the   conference call today, as management will make forward-looking   statements. Please note, this call is being recorded. I would now   like to turn the conference over to Mr. Jiayuan Lin, CEO of   Cango. Please go ahead, sir.  Jiayuan Lin    --   Chief Executive Officer   [Through Translator] Hello, everyone. Welcome to Cango's   second quarter 2019       earnings call    today. During the first half of 2019, China's automotive industry   continued to underwhelm into the decelerating macroeconomic   environment, escalating China/US trade disputes, decreasing   demand and industry uncertainties caused by new national emission   standards, despite introduction of some regulatory changes to   stimulate car sales by the government, the Chinese auto market is   still operating at historic lows and has yet to recover. Facing external pressure, we remain committed to our growth   strategy and as a result, our businesses continued steady   improvement over the past several months. During Q2, we continued   to focus on strengthening our core competencies in auto loan   facilitation services by refining our product offerings and   expanding our channels.   10 stocks we like better than Cango Inc       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Cango Inc wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019      We also accelerated the development of our after-market   services while driving our auto insurance facilitation business   to a [inaudible]. In addition, we further deepened our   cooperation with our core strategic partners and our partnership   with ICBC has yielded significant results. Moreover, we continue   to establish new partnerships with founding partners and   OEMs. As a result of our efforts in these areas, our total revenue   increased by 42.3% year on year to 336 million RMB in the second   quarter. Our after-market services facilitation business, which   mainly consists of insurance-related products contributed 35.9   million RMB to our total revenue. The significant contribution   from our cooperation with ICBC was a vital driver of our strong   financial performance in the second quarter. Now, I will provide you with an update from the progress we   achieved this quarter as well as the year's growth prospects of   our core auto loan facilitation business, after-market services,   and strategic partner initiatives. First, as our primary growth driver, our auto loan   facilitation business continued to deliver solid results. In Q2,   the total amount of financing transactions facilitated reached   6.155 billion RMB with the outstanding balance standing at 36.394   billion RMB. On the funding side, we are currently in active   negotiations for potential collaborations with multiple financial   institutions, including Bank of China, China Construction Bank,   China CITIC Bank, Shanghai Pudong Bank, [inaudible], and China   Merchants Bank, etc. We also continue to optimize and expand our dealership network   while improving our service quality. As of the end of the second   quarter, our dealership network includes more than 48,000   registered dealers across 353 cities in China. We continue to   lead the market as the largest auto financing service platform in   the country in terms of new car dealership coverage. Notably, we   continue to penetrate lower-tier markets with almost 70% of   dealerships that we cover allocated now in the tier 3 or lower   tiers. At the same time, we continue to implement our direct coverage   model. By the second quarter, our sales team directly covered   91.6% of our dealers. The direct coverage model allows us to gain   real insights into our dealers' specific needs and knowledge to   provide dealers with solutions that back fit their demand to   improve our channel. As we expand our business and dealership network, we have   prioritized risk management in our operation. Using machine   learning algorithms, AI, and big data technologies, we have   developed a proprietary risk management system. The system is   capable of implementing a comprehensive multifaceted risk control   mechanism to ensure that our auto loans could achieve solid   performance. As of the end of the second quarter, the M1 and M3   overdue ratios were 0.72% and 0.3%, respectively. We continued to expand our after-market services while driving   our auto insurance facilitation business to the next level. In   Q2, our after-market services business contributed 35.9 million   RMB for 10.7% of our total revenue. The auto insurance   facilitation business in particular, accident insurance, and   anti-theft assurance services performed very well, completing   5,817 transactions in the quarter, up 88.2% sequentially. Thirdly, we made further progress in our cooperation with our   core strategic partners. Cango is the first auto financing   service platform to complete interfacing with the bank's new   system for car loans, that is with ICBC. As a result, we saw a   significant increase in the loan volume made through our   cooperation with ICBC's loan volume surpassing 580 million RMB in   the second quarter. In addition, through our partnerships with ICBC, we have also   established collaborations with eight OEMs. These collaborations   have enabled us to leverage our nationwide offline channels to   launch OEMs subsidized auto financing and promotion services   throughout China. We are now actively engaging with more OEMs for   further collaboration. For Didi, we facilitated over 250 car purchase transactions   for licensed Didi drivers in the second quarter. We also provided   Didi drivers with a complete suite of auto solutions, including   car sourcing, auto financing, insurance, and licensing. Moreover, we continued to push for strategic partnerships with   OEMs, including leveraging Cango's extensive dealership network   with strong penetration in lower-tier cities to expand the sales   channels for OEMs, helping OEMs further diversify their product   offerings in dealerships to address the needs of different   consumer segments as well as retail and wholesale car   sourcing. During the second quarter, we signed collaboration agreements   with BAIC Group, 51, [inaudible] and Chery Automobile. We are   also currently in the process of negotiating partnerships with   additional domestic and foreign OEMs. It is also worth highlighting that we were recently certified   by the Ministry of Science and Technology as a high and new   technology enterprise. This is a powerful endorsement of our   ongoing efforts in auto financing technology innovation. Going   forward, we remain committed to advancing our auto financing   services with data and technologies. Although the auto industry is still facing challenges and   macroeconomic uncertainties do exist, we are confident that as we   continue to execute our growth strategies, efficiency while   actively provide high-quality services to our partners and car   buyers and effectively utilize our ample cash reserves, we will   further consolidate our market-leading position going   forward. With that, I will now turn the call over to our CFO, Michael   Zhang, to take you through our financial performance in the   second quarter.  Yongyi Zhang    --   Chief Financial Officer  Thanks, Jiayuan. Hello, everyone and welcome to our second   quarter 2019 earnings call. Before I start to review our   financials for the quarter, please know that unless otherwise   stated, all numbers are in RMB terms and all comparators are on a   year-over-year basis. Although car sales in China continue to plunge due to   uncertainty in the macroeconomic environment and escalation of   the China/US trade war, we successful run through the tape,   maintaining our strong growth momentum and delivering another   quarter of solid financial results. Our total revenue in the   second quarter 2019 was 336.3 million RMB, representing a   year-over-year increase of 42.3%, outperforming the high end of   the company's guidance by 6.8%. Our after-market service facilitation business also continued   to rev up, with our revenues growing to 35.9 million RMB. Cost of   revenue in the second quarter was 125.8 million RMB. As a   percentage of total revenue, cost of revenue in the second   quarter increased to 37.4% from 34.4% in the prior year period.   This increase was primarily driven by a higher amount of   incentives paid to employees for each financing transaction. Sales and marketing expansion in the second quarter increased   to 44.5 million RMB from 37 million RMB in the prior year period,   mainly due to increases in travel expenses as we further expanded   our operations and share-based compensation expenses. As a percentage of total revenue, sales and marketing expenses   in the second quarter decreased to 13.2% from 15.7% in the prior   year period. General and administrative expenses were 43.4   million RMB or 15.9% of total revenues. In the second quarter,   compared with 31.4 million RMB or 13.3% of the revenue in the   prior year period. This increase was mainly driven by higher   share-based compensation expenses during the quarter. Research and development expenses in the second quarter   increased to 12.3 million RMB from 9.5 million RMB in the prior   year period as we continued to expand our R&D efforts at   investing in product innovation. As a result of our strong   revenue growth and a successful optimization of cost structures,   our income for operations in the second quarter increased by   17.3% to 84.3 million RMB from 71.8 million RMB in the prior year   period. Our net income in the second quarter was 94.6 million RMB,   increasing 46.4% from 64.6 million RMB in the prior year period.   Our non-GAAP adjusted net income, which excludes the impact of   share-based compensation expenses increased by 66.7% to 116.9   million RMB in the second quarter. On a per share basis, our   diluted net income for ADS was 0.6 RMB and our diluted non-GAAP   adjusted income per ADS was 0.75 RMB in the second quarter of   2019. Moving on to our balance sheet, as of June 30th, 2019, we had   cash and cash equivalents of 1,609.6 million RMB compared with   2,178 million RMB as of March 31st, 2019. The change was due to   that the company invested a certain amount of cash in term   deposits over three months for better cash on cash return. Looking forward to the third quarter of 2019, we expect our   total revenue to be between 300 million RMB and 325 million RMB.   Please note that this forecast reflects our preliminary review on   the market and operational conditions, which are subject to   change. This concludes our prepared remarks. Operator, we are now   ready to take questions. Questions and Answers:  Operator  Thank you. We will now begin the question and answer session.   To ask a question, you may press * then 1 on your touch tone   telephone. If you're using a speakerphone, please pick up your   handset before pressing the keys. To withdraw your question,   please press * then 2. In addition, for everyone's convenience,   if you wish to ask a question, please ask your question first in   Chinese and then immediately repeat your question in English. We   will pause momentarily to assemble our roster. The first question today comes from [inaudible] with   Cango.  Unidentified Speaker    --   Cango -- Analyst  So, my question is regarding our partnership with ICBC. I'm   wondering how its related product and [inaudible] that we   facilitate with ICBC. And [inaudible] also mentioned about other   partnerships with some new banks. How is this proceeding? Can   management give some guidance or outlook for the second half of   the year regarding the car sales and our product development?   Thank you.  Jiayuan Lin    --   Chief Executive Officer  [Through Translator] Thank you for your questions. I will   answer your questions one-by-one. Regarding your first question,   our partnership with ICBC -- we have been working with ICBC on   the subsidized and non-subsidized front. Right now, the 1 billion   RMB loans are all based on the non-subsidized loan products. For   non-subsidized products, right now, the take rate is about   5%. As I said, the ICBC loan volumes, the non-subsidized loan   products, right now, the amount is over 1 billion RMB. Regarding   the subsidized, we have signed agreements with eight OEMs and we   have completed system configuration as well as product launch   training with our OEM partners and we are now engaging with more   OEMs. Regarding with our engagement with the banks, with ICBC we are   working very actively on non-subsidized products, but we are also   working on subsidized products as well. The other banks in the   market, they have witnessed the successful results of our   partnerships, for example, like Bank of China and the   Construction Bank of China, they have a strong interest. These banks, they also boast very strong subsidized products,   resources, especially already offering some subsidized products   for OEMs in the China market. That's why we are now engaging with   them and hope that with better incentives and better conditions   for collaboration, we will be able to establish our partnerships   with these other banks very soon. Regarding your third question, our outlook for the second   half, there are a lot of negative factors impacting the industry   so far, like the slowdown in the macroeconomy and trade frictions   between China and US, decreasing in consumption, a switch over   from the national five emission centers, that's a reduction of   the subsidy for new energy costs. All these factors now are impacting massively on China's auto   market in the second half of 2019. Although the government has   launched some policies to stimulate car sales, we have not seen   any turning point in the market yet. China's market has yet to   recover. We are not very optimistic about China's auto market in   the second half. Facing these challenges in the second half will continue to   impact expanding our dealership network, optimizing our service   quality and efficiency, and advancing our technology through   innovation as we continue to deepen our collaboration with more   financial institutions and OEMs, we are confident we will sustain   our approach despite the persisting industry challenges.  Operator  The next question comes from Joey Xu with Morgan Stanley.   Please go ahead.  Joey Xu    --   Morgan Stanley    --   Analyst  Currently, the car dealer growth has already slowed down.   Going forward, what's the management plan on the operating   efficiency improvement front, such as increased dealer coverage   efficiency of the salesperson or increase the number of credit   applications per dealer? Thank you.  Jiayuan Lin    --   Chief Executive Officer  [Through Translator] To answer your question, yes, as you   describe, we are facing a lot of challenges in the external   environment. What we can do right now, of course, is to improve   our internal capabilities. How do we do that? You probably know   last month, we already launched the new sales management system,   what we call the sales management system 3.0. With this new sales   management system, we will be able to improve the productivity of   our salespeople. That's the first point. The second point, we are now working very closely with ICBC   and other major banks in China to further penetrate our coverage   of dealers across different regions. In other words, we are   working on improving the density of our dealership coverage. We   believe that with higher density, we will also be able to improve   the operating efficiency. Thirdly, we are also focusing a lot of   our efforts right now on after-market services. With that, I   think we will also improve the productivity and operating   efficiency very successfully. Thank you. There is one other point I would like to add. That is right   now, we are implementing a small-scale pilot program in the lower   tier cities. That is we are providing supply chain financing   solutions for the [inaudible] dealerships in the lower-tier   cities because 70% of our dealers, they actually are located in   the lower-tier cities. In these lower-tier cities, they have   strong demand for car sourcing and also, for funding services.   So, Cango has a strong competitive advantage in all these   areas. That's why we are trying to leverage these advantages to meet   these dealers' demands for car sourcing and funding. Right now,   this pilot program is still on a small scale, but we are   confident that as the pilot program expands, we will be able to   further expand our dealership network successfully and also, this   program will help improve the dealers' stickiness with Cango.   With that, we are confident that our business will further grow   very strongly.  Operator  The next question comes from Michael Lee with Bank of America   Merrill Lynch. Please go ahead.  Michael Lee    --   Bank of America Merrill Lynch -- Managing Director  I'll repeat my question in English. This is Michael Lee from   Bank of America Merrill Lynch. So, my question is in the first   half, the overall auto market in China was quite weak but we   still see quite strong growth of Cango's revenue in the first   half, even except for part of the after-market service growth,   the major business growth was quite strong. So, could management   explain what Cango did right in the first half to outperform the   car market in China? Thanks.  Jiayuan Lin    --   Chief Executive Officer  [Through Translator] Thank you, Michael, for your question. I   think the reason for our strong growth in Q2 in the first half,   actually, there are several contributors or drivers. The first   one is from the product side -- Cango has [inaudible] to optimize   our product portfolio. For example, for last year, we have   increased our business with Bank of Shanghai. Bank of Shanghai as a funding partner, in fact, offers a much   lower cost of funding for Cango. So, that means we have a better   or are in a more advantageous position in our partnership with   Bank of Shanghai than with other funding partners. That's why we   are more competitive than our industry peers in terms of cost   funding in this regard. Also, from the product side, there is another piece of   information that our CEO touched upon earlier. That is in June,   our non-subsidized products with ICBC increased strongly in   volume. That's why on the product side, we have strong   advantages. The second reason is that in the first half, the auto   market in China underperformed, was not -- auto sales were not   very high. However, in this state, we are also experiencing both peaks   and troughs. For example, in Q1, in January, we saw a small-sized   rebound in the auto market. That is, the auto sales picked up for   a brief period of time. I think the reason was mainly because of   the lacking -- because some consumptions that should have taken   place in 2018 now were postponed to January and Q1 for 2019. So,   this lacking effect has led to this rebound in the car market.   Cango has successfully taken advantage of this rebound. In addition, we have earlier improved our dealership network   management. That is, we are now focusing more on direct coverage.   So, this is another reason that we can take advantage of this   opportunity to achieve better market performance. In addition, in   June of this year, we noticed another rebound in the market. I think this rebound was triggered by a switch from national   emission standard five to national emission standard six. Because   of this switchover, a lot of OEMs started promotional programs   for their national car products. That's why there was this brief   period of strong sales in the market again. Again, Cango was able   to catch this opportunity in improve our business. The third reason is that since 2018, Cango has made a lot of   efforts to better manage our channels. For example, we have   changed our channel management model. We have also impacted a lot   of to improve the dealerships with Cango. Despite the lower sales   in the car market, we are able to improve our market share   through our dealership network. Our single dealer or single store   penetration rate has successfully improved, thereby improving our   market share. All these reasons are drivers of our strong growth   in the first half of this year. In addition, there also is   contribution from our after-market service as well.  Michael Lee    --   Bank of America Merrill Lynch -- Managing Director  [Through Translator] You described your partnership with the   Bank of Shanghai and talked about lower cost of funding and it's   a major contributor to your revenue growth in the first half   because Cango's business model is acting as a facilitator. So,   the bank provides the funding for the customers and the bank pays   a take rate to Cango. So, lower cost of funding doesn't mean that the take rate   received by Cango from the banks will increase. In addition, we   expect the inter-bank interest rate to go down in the second   half. Actually, it has gone down in the past few periods. What is   your outlook for the second half in terms of the cost funding?   The cost of funding, will it continue to go down and will that   lead to higher to take rate for Cango?  Jiayuan Lin    --   Chief Executive Officer  [Through Translator] The answer follows -- first of all,   indeed, as you have described, the lower funding cost means that   higher take rate for Cango. The second point I would like to make   is that lower cost of funding is bringing another benefit. That   is to the customers. The APR we offer to customers go down with   the lower funding cost. That improves the Cango competitors on the product side as   well as on the channel side. So, higher take rate means higher   revenue for Cango and lower cost of funding means we are more   competitive on the channel side as well. That's why we have seen   growth both on the price side and also, on the volume side for   Cango. The second point I'd like to make is that indeed, we expect   the overall market cost of funding in the second half and   regarding our partnership with ICBC and the Bank of Shanghai,   yes, indeed, as the market cost of funding is going down, our   cost of funding with these partners will go down as well.  Operator  The next question comes from Tian Hou with T.H. Capital.   Please go ahead.  Tian Hou    --   T.H. Capital    --   Analyst  So, the recent trade war, China increased tariffs importing   components from the US. How is that going to impact dealers and   how is that going to impact you? That's the number one question.   Number two, recently we see China's financial system [inaudible].   So, in your future development, how can you make sure you're not   -- work together with some [inaudible] local regional bank.   That's the second question. Third question, recently, we saw some   higher delinquency rates from consumers borrowing and lending. I   wonder, in your cooperation with the state bank, what's the term   you will enter into with them for those delinquent loans? Thank   you.  Jiayuan Lin    --   Chief Executive Officer  [Through Translator] Thank you for your questions. The first   question about the impact of China-US trade frictions and the   higher tariffs on imported auto parts from the US and the impact   on that -- right now, we haven't seen the impact on that yet.   While we do expect see impact, so far, we have not yet seen the   real impact. The reason, I think, is mostly because most of our   customers, they are buyers of domestically produced cars and they   are located in the lower-tier cities. I think that takes time for such an impact to transfer to such   customer segments and to such market segments. So far, we have   not seen substantial impact yet. Also, a slowdown in China's   economy does have an impact on the market. For example, while   Cango indeed has outperformed the market as a whole, however we   have not seen the growth rate, especially in terms of sales as   high as we expect it to be, despite the heavy investment we have   made in improving our sales product and improving our   channel. So, the growth rate is not as high as we have expected it to   be. In addition, to control risk, we have rejected a lot of   applications from our customers. The rejection rate from Cango   has increased. This also shows the impact of the economic   slowdown of our business, on Cango, in order to better control   risk. We have more customers than many of our peers. Regarding   our partnership with the smaller banks, our partners are all   major banks in China. We have no small bank partners.  Yongyi Zhang    --   Chief Financial Officer  [Through Translator] I would like to add something to the   answers. First of all, regarding our funding partners, first of   all, as Mr. Lin described, we are working with the major banks so   far. So, in terms of size, we only work with the big banks. In   addition, we are diversifying our funding sources. That is, we   are now working with the different types of different funding   partners. Regarding funding, we are very safe. About your   question on overdue rates, this also has something to do with our   business model. For our loan facilitation services, there are two types of   loan facilitation services. The first one is Cango takes the   credit risk and the second one is that Cango does not take the   credit risk. We have started our collaboration with ICBC and   Shanghai Bank, not for long. We are still at the beginning of our   partnership. Cango decides to take on the guaranteed   responsibilities. We take on the credit risk. In other words, if   the loans are overdue, Cango has to buy back the loans.  Jiayuan Lin    --   Chief Executive Officer  [Through Translator] As I said, for some of these loan   collaborations with the banks, Cango takes the buyback   obligations. Cango takes the credit risk. But in turn, Cango gets   a higher take rate from the banks for such products in order to   compensate for the credit risk that we take on. But such a model,   as I described, is just for the beginning of our   partnerships. Our strategy is that as we show, our banking partners, our   strong performance, then we will be able to renegotiate with our   founding partners on these terms, especially when we reveal our   performance after a series of collaborations. Our plan is that in   the future, then Cango will focus more on products on which we do   not take any credit risk.  Operator  This concludes our question and answer session. I would now   like to turn the conference back over to management for any   closing remarks.  Jiayuan Lin    --   Chief Executive Officer  [Through Translator] If you have no more questions, then   that's it for today. Thank you very much.  Yongyi Zhang    --   Chief Financial Officer  Thank you, everyone.  Operator  This conference has now concluded. Thank you for attending   today's presentation. You may now disconnect.  Duration: 61 minutes  Call participants:  Jiayuan Lin    --   Chief Executive Officer   Yongyi Zhang    --   Chief Financial Officer   Unidentified Speaker    --   Cango -- Analyst   Joey Xu    --   Morgan Stanley    --   Analyst   Michael Lee    --   Bank of America Merrill Lynch -- Managing Director   Tian Hou    --   T.H. Capital    --   Analyst   More CANG analysis   All earnings call transcripts   This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions   for additional details, including our Obligatory     Capitalized Disclaimers of Liability.      Motley Fool Transcription      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " Cango Inc.    (NYSE: CANG)        Q2 2019 Earnings Call       September 3, 2019,   9:00 p.m. ET ",
    " Operator ",
    "Good morning and good evening, everyone. Welcome to the Cango   Inc. second quarter 2019       earnings conference call    . At this time, all participants are in a listen-only mode. This   call is also being broadcast live on the company's IR website.   Joining us today are Mr. Jiayuan Lin, Chief Executive Officer,   and Mr. Zhang Yongyi, Chief Financial Officer of the company.   Following management's prepared remarks, we will conduct a   Q&A session.",
    "Before we begin, I refer you to the safe harbor statement in   the company's earnings release, which also applies to the   conference call today, as management will make forward-looking   statements. Please note, this call is being recorded. I would now   like to turn the conference over to Mr. Jiayuan Lin, CEO of   Cango. Please go ahead, sir.",
    " Jiayuan Lin    --   Chief Executive Officer ",
    " [Through Translator] Hello, everyone. Welcome to Cango's   second quarter 2019       earnings call    today. During the first half of 2019, China's automotive industry   continued to underwhelm into the decelerating macroeconomic   environment, escalating China/US trade disputes, decreasing   demand and industry uncertainties caused by new national emission   standards, despite introduction of some regulatory changes to   stimulate car sales by the government, the Chinese auto market is   still operating at historic lows and has yet to recover.",
    "Facing external pressure, we remain committed to our growth   strategy and as a result, our businesses continued steady   improvement over the past several months. During Q2, we continued   to focus on strengthening our core competencies in auto loan   facilitation services by refining our product offerings and   expanding our channels.",
    "  10 stocks we like better than Cango Inc       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Cango Inc wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Cango Inc       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Cango Inc wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "We also accelerated the development of our after-market   services while driving our auto insurance facilitation business   to a [inaudible]. In addition, we further deepened our   cooperation with our core strategic partners and our partnership   with ICBC has yielded significant results. Moreover, we continue   to establish new partnerships with founding partners and   OEMs.",
    "As a result of our efforts in these areas, our total revenue   increased by 42.3% year on year to 336 million RMB in the second   quarter. Our after-market services facilitation business, which   mainly consists of insurance-related products contributed 35.9   million RMB to our total revenue. The significant contribution   from our cooperation with ICBC was a vital driver of our strong   financial performance in the second quarter.",
    "Now, I will provide you with an update from the progress we   achieved this quarter as well as the year's growth prospects of   our core auto loan facilitation business, after-market services,   and strategic partner initiatives.",
    "First, as our primary growth driver, our auto loan   facilitation business continued to deliver solid results. In Q2,   the total amount of financing transactions facilitated reached   6.155 billion RMB with the outstanding balance standing at 36.394   billion RMB. On the funding side, we are currently in active   negotiations for potential collaborations with multiple financial   institutions, including Bank of China, China Construction Bank,   China CITIC Bank, Shanghai Pudong Bank, [inaudible], and China   Merchants Bank, etc.",
    "We also continue to optimize and expand our dealership network   while improving our service quality. As of the end of the second   quarter, our dealership network includes more than 48,000   registered dealers across 353 cities in China. We continue to   lead the market as the largest auto financing service platform in   the country in terms of new car dealership coverage. Notably, we   continue to penetrate lower-tier markets with almost 70% of   dealerships that we cover allocated now in the tier 3 or lower   tiers.",
    "At the same time, we continue to implement our direct coverage   model. By the second quarter, our sales team directly covered   91.6% of our dealers. The direct coverage model allows us to gain   real insights into our dealers' specific needs and knowledge to   provide dealers with solutions that back fit their demand to   improve our channel.",
    "As we expand our business and dealership network, we have   prioritized risk management in our operation. Using machine   learning algorithms, AI, and big data technologies, we have   developed a proprietary risk management system. The system is   capable of implementing a comprehensive multifaceted risk control   mechanism to ensure that our auto loans could achieve solid   performance. As of the end of the second quarter, the M1 and M3   overdue ratios were 0.72% and 0.3%, respectively.",
    "We continued to expand our after-market services while driving   our auto insurance facilitation business to the next level. In   Q2, our after-market services business contributed 35.9 million   RMB for 10.7% of our total revenue. The auto insurance   facilitation business in particular, accident insurance, and   anti-theft assurance services performed very well, completing   5,817 transactions in the quarter, up 88.2% sequentially.",
    "Thirdly, we made further progress in our cooperation with our   core strategic partners. Cango is the first auto financing   service platform to complete interfacing with the bank's new   system for car loans, that is with ICBC. As a result, we saw a   significant increase in the loan volume made through our   cooperation with ICBC's loan volume surpassing 580 million RMB in   the second quarter.",
    "In addition, through our partnerships with ICBC, we have also   established collaborations with eight OEMs. These collaborations   have enabled us to leverage our nationwide offline channels to   launch OEMs subsidized auto financing and promotion services   throughout China. We are now actively engaging with more OEMs for   further collaboration.",
    "For Didi, we facilitated over 250 car purchase transactions   for licensed Didi drivers in the second quarter. We also provided   Didi drivers with a complete suite of auto solutions, including   car sourcing, auto financing, insurance, and licensing.",
    "Moreover, we continued to push for strategic partnerships with   OEMs, including leveraging Cango's extensive dealership network   with strong penetration in lower-tier cities to expand the sales   channels for OEMs, helping OEMs further diversify their product   offerings in dealerships to address the needs of different   consumer segments as well as retail and wholesale car   sourcing.",
    "During the second quarter, we signed collaboration agreements   with BAIC Group, 51, [inaudible] and Chery Automobile. We are   also currently in the process of negotiating partnerships with   additional domestic and foreign OEMs.",
    "It is also worth highlighting that we were recently certified   by the Ministry of Science and Technology as a high and new   technology enterprise. This is a powerful endorsement of our   ongoing efforts in auto financing technology innovation. Going   forward, we remain committed to advancing our auto financing   services with data and technologies.",
    "Although the auto industry is still facing challenges and   macroeconomic uncertainties do exist, we are confident that as we   continue to execute our growth strategies, efficiency while   actively provide high-quality services to our partners and car   buyers and effectively utilize our ample cash reserves, we will   further consolidate our market-leading position going   forward.",
    "With that, I will now turn the call over to our CFO, Michael   Zhang, to take you through our financial performance in the   second quarter.",
    " Yongyi Zhang    --   Chief Financial Officer ",
    "Thanks, Jiayuan. Hello, everyone and welcome to our second   quarter 2019 earnings call. Before I start to review our   financials for the quarter, please know that unless otherwise   stated, all numbers are in RMB terms and all comparators are on a   year-over-year basis.",
    "Although car sales in China continue to plunge due to   uncertainty in the macroeconomic environment and escalation of   the China/US trade war, we successful run through the tape,   maintaining our strong growth momentum and delivering another   quarter of solid financial results. Our total revenue in the   second quarter 2019 was 336.3 million RMB, representing a   year-over-year increase of 42.3%, outperforming the high end of   the company's guidance by 6.8%.",
    "Our after-market service facilitation business also continued   to rev up, with our revenues growing to 35.9 million RMB. Cost of   revenue in the second quarter was 125.8 million RMB. As a   percentage of total revenue, cost of revenue in the second   quarter increased to 37.4% from 34.4% in the prior year period.   This increase was primarily driven by a higher amount of   incentives paid to employees for each financing transaction.",
    "Sales and marketing expansion in the second quarter increased   to 44.5 million RMB from 37 million RMB in the prior year period,   mainly due to increases in travel expenses as we further expanded   our operations and share-based compensation expenses.",
    "As a percentage of total revenue, sales and marketing expenses   in the second quarter decreased to 13.2% from 15.7% in the prior   year period. General and administrative expenses were 43.4   million RMB or 15.9% of total revenues. In the second quarter,   compared with 31.4 million RMB or 13.3% of the revenue in the   prior year period. This increase was mainly driven by higher   share-based compensation expenses during the quarter.",
    "Research and development expenses in the second quarter   increased to 12.3 million RMB from 9.5 million RMB in the prior   year period as we continued to expand our R&D efforts at   investing in product innovation. As a result of our strong   revenue growth and a successful optimization of cost structures,   our income for operations in the second quarter increased by   17.3% to 84.3 million RMB from 71.8 million RMB in the prior year   period.",
    "Our net income in the second quarter was 94.6 million RMB,   increasing 46.4% from 64.6 million RMB in the prior year period.   Our non-GAAP adjusted net income, which excludes the impact of   share-based compensation expenses increased by 66.7% to 116.9   million RMB in the second quarter. On a per share basis, our   diluted net income for ADS was 0.6 RMB and our diluted non-GAAP   adjusted income per ADS was 0.75 RMB in the second quarter of   2019.",
    "Moving on to our balance sheet, as of June 30th, 2019, we had   cash and cash equivalents of 1,609.6 million RMB compared with   2,178 million RMB as of March 31st, 2019. The change was due to   that the company invested a certain amount of cash in term   deposits over three months for better cash on cash return.",
    "Looking forward to the third quarter of 2019, we expect our   total revenue to be between 300 million RMB and 325 million RMB.   Please note that this forecast reflects our preliminary review on   the market and operational conditions, which are subject to   change.",
    "This concludes our prepared remarks. Operator, we are now   ready to take questions.",
    " Operator ",
    "Thank you. We will now begin the question and answer session.   To ask a question, you may press * then 1 on your touch tone   telephone. If you're using a speakerphone, please pick up your   handset before pressing the keys. To withdraw your question,   please press * then 2. In addition, for everyone's convenience,   if you wish to ask a question, please ask your question first in   Chinese and then immediately repeat your question in English. We   will pause momentarily to assemble our roster.",
    "The first question today comes from [inaudible] with   Cango.",
    " Unidentified Speaker    --   Cango -- Analyst ",
    "So, my question is regarding our partnership with ICBC. I'm   wondering how its related product and [inaudible] that we   facilitate with ICBC. And [inaudible] also mentioned about other   partnerships with some new banks. How is this proceeding? Can   management give some guidance or outlook for the second half of   the year regarding the car sales and our product development?   Thank you.",
    " Jiayuan Lin    --   Chief Executive Officer ",
    "[Through Translator] Thank you for your questions. I will   answer your questions one-by-one. Regarding your first question,   our partnership with ICBC -- we have been working with ICBC on   the subsidized and non-subsidized front. Right now, the 1 billion   RMB loans are all based on the non-subsidized loan products. For   non-subsidized products, right now, the take rate is about   5%.",
    "As I said, the ICBC loan volumes, the non-subsidized loan   products, right now, the amount is over 1 billion RMB. Regarding   the subsidized, we have signed agreements with eight OEMs and we   have completed system configuration as well as product launch   training with our OEM partners and we are now engaging with more   OEMs.",
    "Regarding with our engagement with the banks, with ICBC we are   working very actively on non-subsidized products, but we are also   working on subsidized products as well. The other banks in the   market, they have witnessed the successful results of our   partnerships, for example, like Bank of China and the   Construction Bank of China, they have a strong interest.",
    "These banks, they also boast very strong subsidized products,   resources, especially already offering some subsidized products   for OEMs in the China market. That's why we are now engaging with   them and hope that with better incentives and better conditions   for collaboration, we will be able to establish our partnerships   with these other banks very soon.",
    "Regarding your third question, our outlook for the second   half, there are a lot of negative factors impacting the industry   so far, like the slowdown in the macroeconomy and trade frictions   between China and US, decreasing in consumption, a switch over   from the national five emission centers, that's a reduction of   the subsidy for new energy costs.",
    "All these factors now are impacting massively on China's auto   market in the second half of 2019. Although the government has   launched some policies to stimulate car sales, we have not seen   any turning point in the market yet. China's market has yet to   recover. We are not very optimistic about China's auto market in   the second half.",
    "Facing these challenges in the second half will continue to   impact expanding our dealership network, optimizing our service   quality and efficiency, and advancing our technology through   innovation as we continue to deepen our collaboration with more   financial institutions and OEMs, we are confident we will sustain   our approach despite the persisting industry challenges.",
    " Operator ",
    "The next question comes from Joey Xu with Morgan Stanley.   Please go ahead.",
    " Joey Xu    --   Morgan Stanley    --   Analyst ",
    "Currently, the car dealer growth has already slowed down.   Going forward, what's the management plan on the operating   efficiency improvement front, such as increased dealer coverage   efficiency of the salesperson or increase the number of credit   applications per dealer? Thank you.",
    " Jiayuan Lin    --   Chief Executive Officer ",
    "[Through Translator] To answer your question, yes, as you   describe, we are facing a lot of challenges in the external   environment. What we can do right now, of course, is to improve   our internal capabilities. How do we do that? You probably know   last month, we already launched the new sales management system,   what we call the sales management system 3.0. With this new sales   management system, we will be able to improve the productivity of   our salespeople. That's the first point.",
    "The second point, we are now working very closely with ICBC   and other major banks in China to further penetrate our coverage   of dealers across different regions. In other words, we are   working on improving the density of our dealership coverage. We   believe that with higher density, we will also be able to improve   the operating efficiency. Thirdly, we are also focusing a lot of   our efforts right now on after-market services. With that, I   think we will also improve the productivity and operating   efficiency very successfully. Thank you.",
    "There is one other point I would like to add. That is right   now, we are implementing a small-scale pilot program in the lower   tier cities. That is we are providing supply chain financing   solutions for the [inaudible] dealerships in the lower-tier   cities because 70% of our dealers, they actually are located in   the lower-tier cities. In these lower-tier cities, they have   strong demand for car sourcing and also, for funding services.   So, Cango has a strong competitive advantage in all these   areas.",
    "That's why we are trying to leverage these advantages to meet   these dealers' demands for car sourcing and funding. Right now,   this pilot program is still on a small scale, but we are   confident that as the pilot program expands, we will be able to   further expand our dealership network successfully and also, this   program will help improve the dealers' stickiness with Cango.   With that, we are confident that our business will further grow   very strongly.",
    " Operator ",
    "The next question comes from Michael Lee with Bank of America   Merrill Lynch. Please go ahead.",
    " Michael Lee    --   Bank of America Merrill Lynch -- Managing Director ",
    "I'll repeat my question in English. This is Michael Lee from   Bank of America Merrill Lynch. So, my question is in the first   half, the overall auto market in China was quite weak but we   still see quite strong growth of Cango's revenue in the first   half, even except for part of the after-market service growth,   the major business growth was quite strong. So, could management   explain what Cango did right in the first half to outperform the   car market in China? Thanks.",
    " Jiayuan Lin    --   Chief Executive Officer ",
    "[Through Translator] Thank you, Michael, for your question. I   think the reason for our strong growth in Q2 in the first half,   actually, there are several contributors or drivers. The first   one is from the product side -- Cango has [inaudible] to optimize   our product portfolio. For example, for last year, we have   increased our business with Bank of Shanghai.",
    "Bank of Shanghai as a funding partner, in fact, offers a much   lower cost of funding for Cango. So, that means we have a better   or are in a more advantageous position in our partnership with   Bank of Shanghai than with other funding partners. That's why we   are more competitive than our industry peers in terms of cost   funding in this regard.",
    "Also, from the product side, there is another piece of   information that our CEO touched upon earlier. That is in June,   our non-subsidized products with ICBC increased strongly in   volume. That's why on the product side, we have strong   advantages. The second reason is that in the first half, the auto   market in China underperformed, was not -- auto sales were not   very high.",
    "However, in this state, we are also experiencing both peaks   and troughs. For example, in Q1, in January, we saw a small-sized   rebound in the auto market. That is, the auto sales picked up for   a brief period of time. I think the reason was mainly because of   the lacking -- because some consumptions that should have taken   place in 2018 now were postponed to January and Q1 for 2019. So,   this lacking effect has led to this rebound in the car market.   Cango has successfully taken advantage of this rebound.",
    "In addition, we have earlier improved our dealership network   management. That is, we are now focusing more on direct coverage.   So, this is another reason that we can take advantage of this   opportunity to achieve better market performance. In addition, in   June of this year, we noticed another rebound in the market.",
    "I think this rebound was triggered by a switch from national   emission standard five to national emission standard six. Because   of this switchover, a lot of OEMs started promotional programs   for their national car products. That's why there was this brief   period of strong sales in the market again. Again, Cango was able   to catch this opportunity in improve our business.",
    "The third reason is that since 2018, Cango has made a lot of   efforts to better manage our channels. For example, we have   changed our channel management model. We have also impacted a lot   of to improve the dealerships with Cango. Despite the lower sales   in the car market, we are able to improve our market share   through our dealership network. Our single dealer or single store   penetration rate has successfully improved, thereby improving our   market share. All these reasons are drivers of our strong growth   in the first half of this year. In addition, there also is   contribution from our after-market service as well.",
    " Michael Lee    --   Bank of America Merrill Lynch -- Managing Director ",
    "[Through Translator] You described your partnership with the   Bank of Shanghai and talked about lower cost of funding and it's   a major contributor to your revenue growth in the first half   because Cango's business model is acting as a facilitator. So,   the bank provides the funding for the customers and the bank pays   a take rate to Cango.",
    "So, lower cost of funding doesn't mean that the take rate   received by Cango from the banks will increase. In addition, we   expect the inter-bank interest rate to go down in the second   half. Actually, it has gone down in the past few periods. What is   your outlook for the second half in terms of the cost funding?   The cost of funding, will it continue to go down and will that   lead to higher to take rate for Cango?",
    " Jiayuan Lin    --   Chief Executive Officer ",
    "[Through Translator] The answer follows -- first of all,   indeed, as you have described, the lower funding cost means that   higher take rate for Cango. The second point I would like to make   is that lower cost of funding is bringing another benefit. That   is to the customers. The APR we offer to customers go down with   the lower funding cost.",
    "That improves the Cango competitors on the product side as   well as on the channel side. So, higher take rate means higher   revenue for Cango and lower cost of funding means we are more   competitive on the channel side as well. That's why we have seen   growth both on the price side and also, on the volume side for   Cango.",
    "The second point I'd like to make is that indeed, we expect   the overall market cost of funding in the second half and   regarding our partnership with ICBC and the Bank of Shanghai,   yes, indeed, as the market cost of funding is going down, our   cost of funding with these partners will go down as well.",
    " Operator ",
    "The next question comes from Tian Hou with T.H. Capital.   Please go ahead.",
    " Tian Hou    --   T.H. Capital    --   Analyst ",
    "So, the recent trade war, China increased tariffs importing   components from the US. How is that going to impact dealers and   how is that going to impact you? That's the number one question.   Number two, recently we see China's financial system [inaudible].   So, in your future development, how can you make sure you're not   -- work together with some [inaudible] local regional bank.   That's the second question. Third question, recently, we saw some   higher delinquency rates from consumers borrowing and lending. I   wonder, in your cooperation with the state bank, what's the term   you will enter into with them for those delinquent loans? Thank   you.",
    " Jiayuan Lin    --   Chief Executive Officer ",
    "[Through Translator] Thank you for your questions. The first   question about the impact of China-US trade frictions and the   higher tariffs on imported auto parts from the US and the impact   on that -- right now, we haven't seen the impact on that yet.   While we do expect see impact, so far, we have not yet seen the   real impact. The reason, I think, is mostly because most of our   customers, they are buyers of domestically produced cars and they   are located in the lower-tier cities.",
    "I think that takes time for such an impact to transfer to such   customer segments and to such market segments. So far, we have   not seen substantial impact yet. Also, a slowdown in China's   economy does have an impact on the market. For example, while   Cango indeed has outperformed the market as a whole, however we   have not seen the growth rate, especially in terms of sales as   high as we expect it to be, despite the heavy investment we have   made in improving our sales product and improving our   channel.",
    "So, the growth rate is not as high as we have expected it to   be. In addition, to control risk, we have rejected a lot of   applications from our customers. The rejection rate from Cango   has increased. This also shows the impact of the economic   slowdown of our business, on Cango, in order to better control   risk. We have more customers than many of our peers. Regarding   our partnership with the smaller banks, our partners are all   major banks in China. We have no small bank partners.",
    " Yongyi Zhang    --   Chief Financial Officer ",
    "[Through Translator] I would like to add something to the   answers. First of all, regarding our funding partners, first of   all, as Mr. Lin described, we are working with the major banks so   far. So, in terms of size, we only work with the big banks. In   addition, we are diversifying our funding sources. That is, we   are now working with the different types of different funding   partners. Regarding funding, we are very safe. About your   question on overdue rates, this also has something to do with our   business model.",
    "For our loan facilitation services, there are two types of   loan facilitation services. The first one is Cango takes the   credit risk and the second one is that Cango does not take the   credit risk. We have started our collaboration with ICBC and   Shanghai Bank, not for long. We are still at the beginning of our   partnership. Cango decides to take on the guaranteed   responsibilities. We take on the credit risk. In other words, if   the loans are overdue, Cango has to buy back the loans.",
    " Jiayuan Lin    --   Chief Executive Officer ",
    "[Through Translator] As I said, for some of these loan   collaborations with the banks, Cango takes the buyback   obligations. Cango takes the credit risk. But in turn, Cango gets   a higher take rate from the banks for such products in order to   compensate for the credit risk that we take on. But such a model,   as I described, is just for the beginning of our   partnerships.",
    "Our strategy is that as we show, our banking partners, our   strong performance, then we will be able to renegotiate with our   founding partners on these terms, especially when we reveal our   performance after a series of collaborations. Our plan is that in   the future, then Cango will focus more on products on which we do   not take any credit risk.",
    " Operator ",
    "This concludes our question and answer session. I would now   like to turn the conference back over to management for any   closing remarks.",
    " Jiayuan Lin    --   Chief Executive Officer ",
    "[Through Translator] If you have no more questions, then   that's it for today. Thank you very much.",
    " Yongyi Zhang    --   Chief Financial Officer ",
    "Thank you, everyone.",
    " Operator ",
    "This conference has now concluded. Thank you for attending   today's presentation. You may now disconnect.",
    " Duration: 61 minutes ",
    " Jiayuan Lin    --   Chief Executive Officer ",
    " Yongyi Zhang    --   Chief Financial Officer ",
    " Unidentified Speaker    --   Cango -- Analyst ",
    " Joey Xu    --   Morgan Stanley    --   Analyst ",
    " Michael Lee    --   Bank of America Merrill Lynch -- Managing Director ",
    " Tian Hou    --   T.H. Capital    --   Analyst ",
    " More CANG analysis ",
    " All earnings call transcripts ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions   for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcription      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:46:40"
}