{
  "url": "https://www.nasdaq.com/article/stmp-or-zlndy-which-is-the-better-value-stock-right-now-cm1207988",
  "title": "STMP or ZLNDY: Which Is the Better Value Stock Right Now? - Nasdaq.com",
  "text": [
    " Investors interested in stocks from the Internet - Commerce sector have probably already heard of Stamps.com (STMP) and ZALANDO SE ADRS (ZLNDY). But which of these two stocks is more attractive to value investors? We'll need to take a closer look to find out. The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits. Stamps.com has a Zacks Rank of #1 (Strong Buy), while ZALANDO SE ADRS has a Zacks Rank of #3 (Hold) right now. This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that STMP is likely seeing its earnings outlook improve to a greater extent. But this is only part of the picture for value investors. Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels. Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years. STMP currently has a forward P/E ratio of 15.98, while ZLNDY has a forward P/E of 137.56. We also note that STMP has a PEG ratio of 1.07. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. ZLNDY currently has a PEG ratio of 6.88. Another notable valuation metric for STMP is its P/B ratio of 1.87. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, ZLNDY has a P/B of 7.18. These are just a few of the metrics contributing to STMP's Value grade of A and ZLNDY's Value grade of D. STMP has seen stronger estimate revision activity and sports more attractive valuation metrics than ZLNDY, so it seems like value investors will conclude that STMP is the superior option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Stamps.com Inc. (STMP): Free Stock Analysis Report   ZALANDO SE ADRS (ZLNDY): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors interested in stocks from the Internet - Commerce sector have probably already heard of Stamps.com (STMP) and ZALANDO SE ADRS (ZLNDY). But which of these two stocks is more attractive to value investors? We'll need to take a closer look to find out.",
    "The best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits.",
    "Stamps.com has a Zacks Rank of #1 (Strong Buy), while ZALANDO SE ADRS has a Zacks Rank of #3 (Hold) right now. This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that STMP is likely seeing its earnings outlook improve to a greater extent. But this is only part of the picture for value investors.",
    "Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels.",
    "Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years.",
    "STMP currently has a forward P/E ratio of 15.98, while ZLNDY has a forward P/E of 137.56. We also note that STMP has a PEG ratio of 1.07. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. ZLNDY currently has a PEG ratio of 6.88.",
    "Another notable valuation metric for STMP is its P/B ratio of 1.87. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, ZLNDY has a P/B of 7.18.",
    "These are just a few of the metrics contributing to STMP's Value grade of A and ZLNDY's Value grade of D.",
    "STMP has seen stronger estimate revision activity and sports more attractive valuation metrics than ZLNDY, so it seems like value investors will conclude that STMP is the superior option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:40:23"
}