{
  "url": "https://www.nasdaq.com/article/australias-myer-swings-to-profit-as-turnaround-strategy-bears-fruit-20190904-01186",
  "title": "Australia's Myer swings to profit as turnaround strategy bears fruit - Nasdaq.com",
  "text": [
    "By Nikhil Nainan and Byron Kaye",
    "Sept 5 (Reuters) - Australian department store operator Myer Holdings Ltd  swung back to an annual profit on Thursday as a turnaround strategy of ditching low-margin brands and cutting floorspace put the struggling retailer back on track.",
    "In the year since John King took over as Myer's chief executive, he has overseen an overhaul of the high street mainstay that involves cutting jobs, reducing store size and closing some stores entirely, while focusing on higher-margin brands.",
    "The result included a 25.6% jump in online sales, even though the company's overall sales were the lowest in about a decade at A$2.99 billion. Myer says it now sells more online than through any of its individual stores.",
    "Traditional department stores have been playing catch-up to online giants like Amazon.com Inc  who have undercut their business models by selling more products for less.",
    "Myer shares jumped as much as 14% to A$0.650, their highest level in nearly two months, although the stock was still half its price two years ago and a fraction of its A$4.10 issue price when it listed in 2009.",
    "King said, after the results, that brick-and-mortar retailing was struggling but he did not share some economists' concern about recession after official figures showed the Australian economy grew at its slowest in a decade. ",
    "\"There is a changing environment going on in terms of our customer (but) I wouldn't use the 'r' word at the moment, in terms of the economy,\" King said on a call with analysts.",
    "While Myer was shutting underperforming outlets and cutting deals with landlords to reduce floorspace, stores that the company was refurbishing were experiencing higher sales, he added.",
    "\"The online sales growth is positive, but if investors are looking at that and thinking that it's going to be the thing that will save Myer, I don't think it will,\" said Christopher Conway, a senior investment adviser at Marcus Today",
    "\"They're not an online business. They are still a bricks and mortar business, they've got leases with long-term properties that they can't get out of,\" he added.",
    "Myer suspended its final dividend for a second straight year.",
    "($1 = 1.4806 Australian dollars)"
  ],
  "published_datetime": "2019-09-04 07:01:00"
}