{
  "url": "https://www.nasdaq.com/article/cronos-groups-deal-with-altria-presents-esg-concerns-for-cron-stock-cm1206986",
  "title": "Cronos Group’s Deal with Altria Presents ESG Concerns for CRON Stock - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "When Cronos Group (NASDAQ: CRON ) first announced its partnership with Altria (NYSE: MO ) last year, management discussed the various advantages that the company gained. Mentioned were Altria's proven expertise in brand management and product development, its ability to plan and capitalize on emerging market opportunities, and its research, development and technological capabilities.",
    "Of course the biggest advantage was probably the huge cash infusion that Altria made into Cronos. Because of this, Cronos still has almost $1.6 billion in cash and cash equivalents on its balance sheet.",
    "This puts CRON stock in a strong position.",
    "However, what Cronos' management didn't discuss is how this partnership effectively makes CRON stock a sin stock. If there ever was a sin stock, it's big MO. As one of the tens of millions of people who have seen loved ones die due to the effects of smoking, I have no problem expressing my belief that Altria, aka Philip Morris (NYSE: PM ), is an unethical company and I would never invest my personal funds in it.",
    "But regardless of whether or not you share my beliefs, if you are interested in CRON stock this is something that you should be aware of. So-called sin stocks are stocks of companies that engage in what some people would consider immoral or unethical practices. This would include companies such as weapons makers and companies in the alcohol business. Of course, stocks involved in the production and sale of tobacco would also be included.",
    "This is the issue that should concern shareholders. Some of the largest institutions with money managers are state and union pension plans. Religious and educational endowments also have money which needs to be managed. Many of these institutions are focusing greater attention on ESG - environmental, social and governance - concerns when developing their investment strategies.",
    "ESG stands for environmental, social and governance. Institutions that are focusing on these concerns are considering not just the financials of a company when they perform their analysis. They are also considering the company's overall effect on the well being of society as part of the research process. Clearly, many of the business practices of Altria would not be acceptable to pass the ESG screening procedures that these institutions are implementing.",
    "Because of this, many of these wealthy institutions will not be able to invest in CRON stock. This could put the company at a serious disadvantage against its competitors. If an institution wants to invest in the cannabis market, many of the other growers would be much more attractive to them because they aren't considered to be sin stocks or have ESG concerns. This will lower demand for CRON stock, making it harder for the stock price to rise.",
    "CRON stock has trended lower since breaking support at the $14 level. There may be some support around the $10 level because it is where its lows were in December. It is also an important level psychologically.",
    "At the time of this writing, Mark Putrino did not hold a position in any of the aforementioned securities.",
    "The post Cronos Group's Deal with Altria Presents ESG Concerns for CRON Stock appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:51:17"
}