{
  "url": "https://www.nasdaq.com/article/7-strong-buy-stocks-hedge-funds-are-buying-now-cm1210729",
  "title": "7 Strong-Buy Stocks Hedge Funds Are Buying Now - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Hedge funds are a valuable source of investing inspiration. And by taking a step back and looking at the collective fund activity, we can discover the most popular fund picks for the current climate. RBC Capital recently carried out a study of over 350 hedge fund portfolios, based on the latest 13f forms filed by funds with the SEC.",
    "Portfolio managers and sector analysts \"will gain color on where crowded trades have been located and how positioning has been set up and changing among an impactful category of active investors,\" wrote the firm.",
    "With that in mind, let's dive deeper into what makes seven of the strong-buy stocks highlighted by RBC worthy of your consideration. And as we take a closer look at each, remember that all seven of these stocks are not just hedge fund picks - they also boast the Street's seal of approval, as reflected in the \"Strong Buy\" consensus for each stock (based on the last three months of analyst ratings).",
    "The No. 1 stock for hedge funds right now is Microsoft  (NASDAQ: MSFT ). Indeed, we can see that funds have a total of $18,131 million invested in MSFT stock right now. That makes it easily more popular than the No. 2 pick - Amazon  (NASDAQ: AMZN ) - where hedge funds own a total of $16,406 million.",
    "What's more, out of 363 major funds studied by RBC Capital, a sizable proportion (29%) hold MSFT stock in their portfolio.",
    "Luckily for these funds, the Street also has a very bullish outlook on MSFT right now. Out of 23 analysts recently polled, 21 rate the stock a buy, with only one analyst calling it a hold and another saying sell. That gives MSFT its \"Strong Buy\" Street consensus. Meanwhile, the $154 average analyst price target indicates 10% upside potential lies ahead. Shares have already surged 37% year-to-date.",
    "KeyBanc analyst Brent Bracelin points out that Microsoft has just scored a major $7.6 billion contract award for Pentagon's cloud migration to Office365. \"We view some of these broader government modernization plans and cloud initiatives as another growth vector for Microsoft's commercial cloud segment ($38B run-rate growing 43% y/y) and reiterate our Overweight rating on MSFT,\" cheered the analyst. He notes that this is the second-largest cloud computing contract from the Pentagon behind the JEDI deal. Interested in Microsoft?",
    "Get a free MSFT Stock Research Report .",
    "One of the largest industrial companies in the world, United Technologies  (NYSE: UTX ), is a new hot pick for hedge funds. In other words, hedge fund ownership rose significantly during Q2 2019, in terms of the net number of funds that added new positions. According to RBC Capital, 14 funds initiated positions in UTX stock in Q2 versus Q1. As a result, 16% of the funds scanned by RBC now hold UTX in their portfolio.",
    "As far as the Street is concerned, these moves seem to make sense. Four out of five analysts rate UTX stock a buy, while the price target indicates 15% upside lies ahead. Analysts are excited about the proposed merger with Raytheon Company  (NYSE: RTN ). The all-stock transaction will create a new aerospace and defense powerhouse and should close in the first half of 2020.",
    "Five-star Cowen & Co analyst Cai Rumohr is a fan of UTX with, or without, Raytheon. \"We like the proposed RTN merger for technology synergies and enhanced financial flexibility to bolster CFPS [cash flow per share] by 2021. Shareholder approval seems likely this fall given diminished activist resistance, and DoD appears to support the deal,\" says the analyst. \"If the merger doesn't complete, we see UTX moving closer to its est. SOTP [sum of the parts] of ~$155-160/sh. since UTX Aero will be the last large cap commercial aero systems \"pure\" play.\" UTX stock currently trades at $134.",
    "However, the analyst also adds: \"With separation/merger on track, transactional overhang should abate, offering upside to our $150 price target.\" He notes that UTX derives 35%+ of total revenue from aftermarket activities, giving it above-average recession resistance.",
    "Get the UTX Stock Research Report .",
    "UnitedHealth Group  (NYSE: UNH ) is the largest healthcare company in the world by revenue. It is also one of the Top 20 most popular hedge fund stocks. The latest SEC filings reveal that hedge funds have invested $5,248 million in UNH. Even though shares have struggled recently, the company still boasts a \"Strong Buy\" Street consensus. In fact, over the last three months only one analyst has decided to stay sidelined on UNH. Thanks to recent stock weakness, the $302 average analyst price target suggests 32% upside potential.",
    "\"After an almost 28% upside move off its mid-April \"Bernie tweet\" low, it's really not a surprise to see some profit taking in UNH on yesterday's print\" explained RBC's Frank Morgan following Q2 results. \"If one really wanted to sell, one could rationalize the quarter as only a modest beat, under the most conservative scenario - but in reality, the quarter was fine and the outlook remains attractive, in our opinion\" he added.",
    "Most recently, Credit Suisse analyst A.J. Rice paid a visit to UNH headquarters. \"UNH says YTD trends are largely tracking expectations, and we left believing 2H19 EPS ests still have modest upside potential\" the analyst told investors following the event.",
    "Rice wrote \"Our current 2020 ests anticipate 10% Y/Y growth. If UNH posts modest upside relative to our Q3 and Q4 2019 ests, our 2020 $16.30 EPS est could then represent roughly 8-10% growth. This type of growth seems a reasonable initial target that UNH could offer (UNH typically guides conservatively)\".",
    "Get the UNH Stock Research Report .",
    "Roper Technologies  (NYSE: ROP ) is a diversified growth company that designs, manufactures and distributes a wide variety of goods. We are talking everything from medical and scientific imaging products and software, to radio frequency (RF) products and energy controls.",
    "Shares in Roper have soared 40% year-to-date. That's excellent news for the hedge funds loading up on ROP stock. RBC Capital shows that Roper is one of the new top picks for hedge funds in Q2. To be precise, 13 hedge funds started ROP positions, bringing the total hedge fund holding to $381 million.",
    "No doubt RBC Capital's Deane Dray would approve of these latest moves. \"In our view, Roper is indisputably one of the highest-quality names within the Multi-Industry sector,\" exclaims Dray. \"It leads the pack in EBIT margin and free cash flow conversion thanks to its portfolio of low- capital-intensity and profitable SaaS and network businesses.\"",
    "He has a $404 price target on ROP stock, advising that M&A is an ongoing potential catalyst for the company. For instance, Roper's strong free cash flow generation should be enough to fund +$5 billion of acquisitions over the next four years. Indeed, Roper just completed its $1.6 billion acquisition of iPipeline on Aug. 22. \"We believe this network cloud-based subscription business fits right in Roper's wheelhouse, with attractive negative working capital and high-single-digit growth\" Dray wrote.",
    "Get the ROP Stock Research Report .",
    "Streaming giant Netflix  (NASDASQ: NFLX ) remains a favorite stock for funds. In fact, it is currently the fifth most popular hedge fund stock. The total dollar valued owned by hedge funds now stands at $10,504 million.",
    "Despite the company's shocking recent earnings report, NFLX is clinging on to its Strong Buy Street consensus. That's with an average analyst price target of $411, indicating upside potential of over 40%. Shares cratered in July after Netflix missed Q2 domestic and international paid net subscriber add expectations. Paid memberships also declined quarter-over-quarter in the U.S.",
    "However, early reads into Q3 suggest faster gross adds growth and improving retention. \"It's still early in the quarter, but data through July looks solid (rebound from 2Q),\" states SunTrust Robinson analyst Matthew Thornton wrote.",
    "He has just carried out a deep dive into the company's recent performance and reveals \"Google searches (on keyword \"Netflix\") and mobile app downloads for the month also show nice upticks vs 2Q19 and back toward or above the 1Q19 high-water-mark.\" August content slate is 2H-weighted, says the analyst, but Sacred Games (8/15) season 2 search interest so far is up ~1.7x vs season 1 (peak daily India app downloads up 1.4x).",
    "Looking out to 4Q (slate not fully known), key returning titles should include The Crown and Peaky Blinders and could include Insatiable, You, Narcos, and Fuller House.",
    "Get the NFLX Stock Research Report .",
    "Align Technology  (NASDAQ: ALGN ) is a leading manufacturer in orthodontics. The company is a pioneer of the Invisalign clear aligner system to replace traditional orthodontic brackets/wires. And hedge funds are taking note. Fourteen hedge funds initiated positions in the stock in Q2, with 15% of funds studied by RBC Capital now investing in ALGN. As a result, the total hedge fund holding now works out at $1,805 million.",
    "\"We believe the clear aligner market is growing 30%+ annually and will continue to take share from the $1B brackets and wires segment of orthodontics for a number of years given the aesthetic benefits, faster treatment times, and more efficient follow-up schedules these aligners provide relative to standard braces\" sums up Baird analyst Jeff Johnson .",
    "Interestingly the overall analyst consensus for ALGN is a cautiously optimistic Moderate Buy. However if we only include the ratings of best-performing analysts the rating shifts to a more bullish Strong Buy. And its $264 average price target suggests shares can surge an impressive 50% from current levels.",
    "China macro uncertainty is an area of concern for investors, accepts Johnson. However he still believes that \"ALGN's large clear aligner market TAMs and strong competitive positioning should allow for 20%+ revenue and similar/faster earnings growth for the company over the next few years.\" That makes the current valuation for such a high-quality, high-growth company look particularly compelling, says the analyst. Plus as Piper Jaffray's Matthew O'Brien writes, Align \"has much better products that will win in the marketplace.\"",
    "Get the ALGN Stock Research Report .",
    "Last but certainly not least - especially as far as funds are concerned - comes Amazon. As I mentioned above, Amazon is the second-most popular hedge fund stock. At the same time, the e-commerce giant may just be the Street's favorite stock right now.",
    "We are talking about 26 consecutive buy ratings from analysts over the last three months. Meanwhile the average analyst price target of $2,287 indicates that Amazon can still rally 25% in the coming months. Indeed, five-star RBC Capital analyst Mark Mahaney has just reiterated his positive take on AMZN stock. Citing a deep-dive analysis into Amazon's new Prime One-Day Shipping initiative the analyst ramps up his price target to $2,600.",
    "In late April, Amazon announced that it would begin rolling out One-Day Shipping to all its Prime members. Looking forward, Mahaney believes that AMZN will roll out One-Day Prime across the U.S. within one year and globally within two to three years.",
    "\"Our 7-year survey on Online Retail indicates that a very high & rising 64% of U.S. Internet users are \"Extremely\" or \"Very Interested\" in next-day shipping. So AMZN is tapping into real demand here\" the analyst explained. With One-Day as the catalyst, he is now modelling for 2021 estimated revenue to soar 22% to $411 billion (6% upside to Street).",
    "Get the AMZN Stock Research Report .",
    "TipRanks  offers investors the latest insight into eight different sectors by tracking the activity of over 5,000 Wall Street analysts. As of this writing, Harriet Lefton did not hold a position in any of the aforementioned securities.",
    "The post 7 Strong-Buy Stocks Hedge Funds Are Buying Now appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:59:02"
}