{
  "url": "https://www.nasdaq.com/article/why-is-regal-beloit-rbc-down-6-since-last-earnings-report-cm1207350",
  "title": "Why Is Regal Beloit (RBC) Down 6% Since Last Earnings Report? - Nasdaq.com",
  "text": [
    " A month has gone by since the las t earnings  report for Regal Beloit (RBC). Shares have lost about 6% in that time frame, underperforming the S&P 500. Will the recent negative trend continue leading up to its next earnings release, or is Regal Beloit due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important drivers.  Regal Beloit Q2 Earnings and Revenues Miss   Estimates  Regal Beloi t report  ed weaker-than-expected second-quarter 2019 results, missing earnings estimates by 6.8%. Also, the company's sales lagged estimates by 3.9%. Regal Beloit's adjusted earnings were $1.52 per share, missing the Zacks Consensus Estimate of $1.63. Further, the bottom line declined from $1.60 per share reported a year ago.  Core Sales, Divestments and Forex Woes Affect   Revenues  In the reported quarter, Regal Beloit's net sales were $873.7 million, decreasing 9% year over year. Adverse impact of 2.2% from organic sales, 5.3% from divestments and 1.5% from forex woes hurt results. The top line lagged the Zacks Consensus Estimate of $909 million. Excluding the impact of divested business, the company's adjusted net sales were $868.1 million, down 3.7% year over year. The company reports results under three segments - Climate Solutions, Commercial and Industrial Systems and Power Transmission Solutions. The quarterly segmental results are briefly discussed below: Revenues from Climate Solutions  totaled $267.9 million, decreasing 3.4% year over year. Organic sales jumped 2.3% on account of positive impact from the FER pre-buy and residential HVAC growth. Forex woes and divestments had an adverse impact of 0.7% and 5%, respectively.  Commercial and Industrial Systems  ' revenues were $401.8 million, down 14.3% year over year. Organic sales in the reported quarter decreased 5.5% while divestments resulted in adverse impact of 6.6%. Also, forex woes hurt sales by 2.2%.  Power Transmission Solutions  ' revenues were $204 million, down 4.4% year over year. Organic sales declined 0.8% on account of softness in North American industrial end markets and de-stocking of inventory. Forex woes and divestments had an adverse impact of 1% and 2.6%, respectively.  Margins  In the reported quarter, Regal Beloit's cost of sales decreased 10.2% year over year to $639.7 million. It represented 73.2% of net sales compared with 74.2% in the year-ago quarter. Gross margin increased 100 basis points (bps) to 26.8%. Operating expenses of $138 million decreased 6.6% and represented 15.8% of net sales. Adjusted operating profit was $95.4 million, down 5.4% year over year, while margin dropped 20 bps to 11%. Adjusted effective tax rate in the quarter was 20.4% compared with 21.4% in the year-ago quarter.  Balance Sheet and Cash Flow  Exiting the second quarter of 2019, Regal Beloit had cash and cash equivalents of $291.3 million, reflecting 17.2% growth from the figure reported on Dec 29, 2018. Long-term debt decreased 6.4%, to $1,222.7 million. Notably, the company repaid $0.1 million of debt during the quarter. In the second quarter, Regal Beloit generated net cash of $112.3 million from operating activities, reflecting a year-over-year increase of 10.3%. The company raised capital investment for purchasing property, plant and equipment by 69.8% over the year-ago figure to $36 million. Free cash flow was $76.3 million compared with cash flow of $80.6 million in the year-ago quarter. During the quarter, the company paid dividends totaling $12 million to shareholders and repurchased shares worth $55.9 million.  Outlook  For 2019, adjusted earnings per share are expected to be $5.50-$5.80, lower from $6.15-$6.55 guided earlier.   How Have Estimates Been Moving Since Then?  In the past month, investors have witnessed a downward trend in fresh estimates. The consensus estimate has shifted -15.12% due to these changes.  VGM Scores  At this time, Regal Beloit has a nice Growth Score of B, though it is lagging a lot on the Momentum Score front with a D. However, the stock was allocated a grade of A on the value side, putting it in the top quintile for this investment strategy. Overall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. It's no surprise Regal Beloit has a Zacks Rank #4 (Sell). We expect a below average return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Regal Beloit Corporation (RBC): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "A month has gone by since the las t earnings  report for Regal Beloit (RBC). Shares have lost about 6% in that time frame, underperforming the S&P 500.",
    "Will the recent negative trend continue leading up to its next earnings release, or is Regal Beloit due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important drivers.  Regal Beloit Q2 Earnings and Revenues Miss   Estimates  Regal Beloi t report  ed weaker-than-expected second-quarter 2019 results, missing earnings estimates by 6.8%. Also, the company's sales lagged estimates by 3.9%. Regal Beloit's adjusted earnings were $1.52 per share, missing the Zacks Consensus Estimate of $1.63. Further, the bottom line declined from $1.60 per share reported a year ago.  Core Sales, Divestments and Forex Woes Affect   Revenues  In the reported quarter, Regal Beloit's net sales were $873.7 million, decreasing 9% year over year. Adverse impact of 2.2% from organic sales, 5.3% from divestments and 1.5% from forex woes hurt results. The top line lagged the Zacks Consensus Estimate of $909 million. Excluding the impact of divested business, the company's adjusted net sales were $868.1 million, down 3.7% year over year. The company reports results under three segments - Climate Solutions, Commercial and Industrial Systems and Power Transmission Solutions. The quarterly segmental results are briefly discussed below: Revenues from Climate Solutions  totaled $267.9 million, decreasing 3.4% year over year. Organic sales jumped 2.3% on account of positive impact from the FER pre-buy and residential HVAC growth. Forex woes and divestments had an adverse impact of 0.7% and 5%, respectively.  Commercial and Industrial Systems  ' revenues were $401.8 million, down 14.3% year over year. Organic sales in the reported quarter decreased 5.5% while divestments resulted in adverse impact of 6.6%. Also, forex woes hurt sales by 2.2%.  Power Transmission Solutions  ' revenues were $204 million, down 4.4% year over year. Organic sales declined 0.8% on account of softness in North American industrial end markets and de-stocking of inventory. Forex woes and divestments had an adverse impact of 1% and 2.6%, respectively.  Margins  In the reported quarter, Regal Beloit's cost of sales decreased 10.2% year over year to $639.7 million. It represented 73.2% of net sales compared with 74.2% in the year-ago quarter. Gross margin increased 100 basis points (bps) to 26.8%. Operating expenses of $138 million decreased 6.6% and represented 15.8% of net sales. Adjusted operating profit was $95.4 million, down 5.4% year over year, while margin dropped 20 bps to 11%. Adjusted effective tax rate in the quarter was 20.4% compared with 21.4% in the year-ago quarter.  Balance Sheet and Cash Flow  Exiting the second quarter of 2019, Regal Beloit had cash and cash equivalents of $291.3 million, reflecting 17.2% growth from the figure reported on Dec 29, 2018. Long-term debt decreased 6.4%, to $1,222.7 million. Notably, the company repaid $0.1 million of debt during the quarter. In the second quarter, Regal Beloit generated net cash of $112.3 million from operating activities, reflecting a year-over-year increase of 10.3%. The company raised capital investment for purchasing property, plant and equipment by 69.8% over the year-ago figure to $36 million. Free cash flow was $76.3 million compared with cash flow of $80.6 million in the year-ago quarter. During the quarter, the company paid dividends totaling $12 million to shareholders and repurchased shares worth $55.9 million.  Outlook  For 2019, adjusted earnings per share are expected to be $5.50-$5.80, lower from $6.15-$6.55 guided earlier. ",
    " Regal Beloit Q2 Earnings and Revenues Miss   Estimates ",
    "Regal Beloi t report  ed weaker-than-expected second-quarter 2019 results, missing earnings estimates by 6.8%. Also, the company's sales lagged estimates by 3.9%.",
    "Regal Beloit's adjusted earnings were $1.52 per share, missing the Zacks Consensus Estimate of $1.63. Further, the bottom line declined from $1.60 per share reported a year ago.",
    " Core Sales, Divestments and Forex Woes Affect   Revenues ",
    "In the reported quarter, Regal Beloit's net sales were $873.7 million, decreasing 9% year over year. Adverse impact of 2.2% from organic sales, 5.3% from divestments and 1.5% from forex woes hurt results.",
    "The top line lagged the Zacks Consensus Estimate of $909 million.",
    "Excluding the impact of divested business, the company's adjusted net sales were $868.1 million, down 3.7% year over year.",
    "The company reports results under three segments - Climate Solutions, Commercial and Industrial Systems and Power Transmission Solutions. The quarterly segmental results are briefly discussed below:",
    "Revenues from Climate Solutions  totaled $267.9 million, decreasing 3.4% year over year. Organic sales jumped 2.3% on account of positive impact from the FER pre-buy and residential HVAC growth. Forex woes and divestments had an adverse impact of 0.7% and 5%, respectively.",
    " Commercial and Industrial Systems  ' revenues were $401.8 million, down 14.3% year over year. Organic sales in the reported quarter decreased 5.5% while divestments resulted in adverse impact of 6.6%. Also, forex woes hurt sales by 2.2%.",
    " Power Transmission Solutions  ' revenues were $204 million, down 4.4% year over year. Organic sales declined 0.8% on account of softness in North American industrial end markets and de-stocking of inventory. Forex woes and divestments had an adverse impact of 1% and 2.6%, respectively.",
    " Margins ",
    "In the reported quarter, Regal Beloit's cost of sales decreased 10.2% year over year to $639.7 million. It represented 73.2% of net sales compared with 74.2% in the year-ago quarter. Gross margin increased 100 basis points (bps) to 26.8%. Operating expenses of $138 million decreased 6.6% and represented 15.8% of net sales.",
    "Adjusted operating profit was $95.4 million, down 5.4% year over year, while margin dropped 20 bps to 11%. Adjusted effective tax rate in the quarter was 20.4% compared with 21.4% in the year-ago quarter.",
    " Balance Sheet and Cash Flow ",
    "Exiting the second quarter of 2019, Regal Beloit had cash and cash equivalents of $291.3 million, reflecting 17.2% growth from the figure reported on Dec 29, 2018. Long-term debt decreased 6.4%, to $1,222.7 million.",
    "Notably, the company repaid $0.1 million of debt during the quarter.",
    "In the second quarter, Regal Beloit generated net cash of $112.3 million from operating activities, reflecting a year-over-year increase of 10.3%. The company raised capital investment for purchasing property, plant and equipment by 69.8% over the year-ago figure to $36 million. Free cash flow was $76.3 million compared with cash flow of $80.6 million in the year-ago quarter.",
    "During the quarter, the company paid dividends totaling $12 million to shareholders and repurchased shares worth $55.9 million.",
    " Outlook ",
    "For 2019, adjusted earnings per share are expected to be $5.50-$5.80, lower from $6.15-$6.55 guided earlier.",
    " How Have Estimates Been Moving Since Then? ",
    "In the past month, investors have witnessed a downward trend in fresh estimates. The consensus estimate has shifted -15.12% due to these changes.",
    " VGM Scores ",
    "At this time, Regal Beloit has a nice Growth Score of B, though it is lagging a lot on the Momentum Score front with a D. However, the stock was allocated a grade of A on the value side, putting it in the top quintile for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. It's no surprise Regal Beloit has a Zacks Rank #4 (Sell). We expect a below average return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:41"
}