{
  "url": "https://www.nasdaq.com/article/why-home-depots-second-quarter-was-better-than-it-looked-cm1210668",
  "title": "Why Home Depot's Second Quarter Was Better Than It Looked - Nasdaq.com",
  "text": [
    " Despite a   rough second-quarter     earnings report last month,   Home Depot    's (NYSE: HD) stock price has risen about 7.5% since Aug. 21 --   as if it were a high-flying   growth stock    -- while the   S&P 500    index is up about 3.2% over the same period. In Q2, the giant   home improvement retailer saw revenue rise to $30.8 billion, an   increase of only 1.2% year over year, and   earnings per share    (EPS) grow to $3.19, a 3.9% increase over last year's second   quarter. On top of the tepid growth, the company lowered its 2019   full-year guidance from an approximate 5%   same-store sales    growth to only 4% growth in this key metric. It's only natural   for investors to wonder why shares have shown so much strength in   the wake of such mediocre results. While any stock fluctuation over a short time is fairly   meaningless, I believe a strong case can be made that Home   Depot's shares are up precisely because the long-term picture is   still intact. Allow me to explain.makeArticleAd();   Home Depot is refurbishing its store layouts and introducing     pickup lockers to its stores. Image source: Home Depot.   What went wrong?  In the company's quarterly   conference call    , Home Depot's management credited two factors for the tepid   growth: wet weather and    lumber   prices    . CFO Carol Tome said weather squeezed comparable sales by about   0.5 percentage points, and lumber prices had a   1.1-percentage-point downward impact. As for the weather,   management said that for some categories, once the weather   improves, pent-up consumer demand is released and sales are made   up in later weeks and months. For other categories, however,   opportunities are lost forever, not just delayed. Lumber price deflation also hurt Home Depot's quarter and was   mentioned a whopping 23 times during the call. To illustrate just   how much the lumber price decreases were hurting sales,   management explained that a 4-foot-by-8-foot oriented strand   board sold for about $8 in 2019's first quarter, more than 50%   below 2018's prices. In Q2, the price dropped another 5% to an   average of $7.60. The nature of these factors, essentially bad weather and   commodity price deflation, are far outside of Home Depot's   control. The things that Home Depot could control in the quarter   looked much better.  What went right?  Home Depot continues to invest heavily in removing friction   from its omnichannel shopping experience, where the lines between   online and in-store shopping are increasingly blurred. For   stores, the company has concentrated on improving checkout times   and ease of navigation. In this effort, the company has now:  Introduced pickup lockers for online orders in 1,100     locations. Made front-end store improvements designed to get the     customer in and out quicker in 400 store locations. Incorporated digital price tags in the appliances     department, allowing customers to see product reviews and     ratings before making a large purchase.  As these improvements are implemented, Home Depot continues to   see customer satisfaction scores increase in cleanliness,   customer service, and checkout time. On the digital front, the home improvement retailer has   improved its site's search and functionality, resulting in higher   traffic and better sales conversion. Of course, the biggest   e-commerce hurdle is an effective logistics infrastructure. To   this point, CEO Craig Menear stated:  During the quarter, we completed the retrofit of our     Hagerstown [Maryland] facility into a parcel direct fulfillment     center, which expands our one-day delivery capabilities on     stock parcel goods from approximately 30% to approximately 50%     of the U.S. population. We also drove productivity and cost out     through our mechanization efforts in our upstream supply chain.     We are on track with our plans to create the fastest, most     efficient delivery network in home improvement and are pleased     with the progress that we have made thus far.  Both the digital and physical improvements seem to be paying   off, as online sales in Q2 increased 20% year over year. About   50% of online orders were picked up in stores, pointing to an   effective omnichannel shopping experience.  What's the verdict?  There are numerous macroeconomic factors far outside of Home   Depot's control, many of which can easily affect the company's   share price -- over the short term. These factors can range from   the housing market and interest rates to tariffs and weather.   This quarter, commodity prices bit the company's performance.   Next quarter, it could be tariffs or interest rates, things that   are nearly impossible to know or predict. These factors have always played a role in the company's stock   price, and yet, over the last 10 years, Home Depot's stock is up   more than 720% -- an undeniably incredible performance. With few   exceptions, great businesses usually excel over the long term.   Home Depot is making the right investments, thinking of the   shopping experience across its mobile, digital, and physical   channels. Based on the company's full-year guidance, shares are trading   at a forward P/E ratio of about 22.7. For a company investing   heavily in its customer shopping experience even though it's   already the top business in its industry, that doesn't seem to be   too much of a premium. As a shareholder, I am happy to hold my   shares through these short-term concerns, as long as the company   continues to do so well with those things it can control.   10 stocks we like better than Home Depot       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Home Depot wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Matthew Cochrane      owns shares of Home Depot. The Motley Fool has the following     options: short February 2020 $205 calls on Home Depot and long     January 2021 $120 calls on Home Depot. The Motley Fool     recommends Home Depot. The Motley Fool has a     disclosure policy      .  ",
    "Despite a   rough second-quarter     earnings report last month,   Home Depot    's (NYSE: HD) stock price has risen about 7.5% since Aug. 21 --   as if it were a high-flying   growth stock    -- while the   S&P 500    index is up about 3.2% over the same period. In Q2, the giant   home improvement retailer saw revenue rise to $30.8 billion, an   increase of only 1.2% year over year, and   earnings per share    (EPS) grow to $3.19, a 3.9% increase over last year's second   quarter.",
    "On top of the tepid growth, the company lowered its 2019   full-year guidance from an approximate 5%   same-store sales    growth to only 4% growth in this key metric. It's only natural   for investors to wonder why shares have shown so much strength in   the wake of such mediocre results.",
    "While any stock fluctuation over a short time is fairly   meaningless, I believe a strong case can be made that Home   Depot's shares are up precisely because the long-term picture is   still intact. Allow me to explain.",
    "  Home Depot is refurbishing its store layouts and introducing     pickup lockers to its stores. Image source: Home Depot. ",
    "Home Depot is refurbishing its store layouts and introducing     pickup lockers to its stores. Image source: Home Depot.",
    "In the company's quarterly   conference call    , Home Depot's management credited two factors for the tepid   growth: wet weather and    lumber   prices    . CFO Carol Tome said weather squeezed comparable sales by about   0.5 percentage points, and lumber prices had a   1.1-percentage-point downward impact. As for the weather,   management said that for some categories, once the weather   improves, pent-up consumer demand is released and sales are made   up in later weeks and months. For other categories, however,   opportunities are lost forever, not just delayed.",
    "Lumber price deflation also hurt Home Depot's quarter and was   mentioned a whopping 23 times during the call. To illustrate just   how much the lumber price decreases were hurting sales,   management explained that a 4-foot-by-8-foot oriented strand   board sold for about $8 in 2019's first quarter, more than 50%   below 2018's prices. In Q2, the price dropped another 5% to an   average of $7.60.",
    "The nature of these factors, essentially bad weather and   commodity price deflation, are far outside of Home Depot's   control. The things that Home Depot could control in the quarter   looked much better.",
    "Home Depot continues to invest heavily in removing friction   from its omnichannel shopping experience, where the lines between   online and in-store shopping are increasingly blurred. For   stores, the company has concentrated on improving checkout times   and ease of navigation. In this effort, the company has now:",
    "As these improvements are implemented, Home Depot continues to   see customer satisfaction scores increase in cleanliness,   customer service, and checkout time.",
    "On the digital front, the home improvement retailer has   improved its site's search and functionality, resulting in higher   traffic and better sales conversion. Of course, the biggest   e-commerce hurdle is an effective logistics infrastructure. To   this point, CEO Craig Menear stated:",
    "During the quarter, we completed the retrofit of our     Hagerstown [Maryland] facility into a parcel direct fulfillment     center, which expands our one-day delivery capabilities on     stock parcel goods from approximately 30% to approximately 50%     of the U.S. population. We also drove productivity and cost out     through our mechanization efforts in our upstream supply chain.     We are on track with our plans to create the fastest, most     efficient delivery network in home improvement and are pleased     with the progress that we have made thus far.",
    "Both the digital and physical improvements seem to be paying   off, as online sales in Q2 increased 20% year over year. About   50% of online orders were picked up in stores, pointing to an   effective omnichannel shopping experience.",
    "There are numerous macroeconomic factors far outside of Home   Depot's control, many of which can easily affect the company's   share price -- over the short term. These factors can range from   the housing market and interest rates to tariffs and weather.   This quarter, commodity prices bit the company's performance.   Next quarter, it could be tariffs or interest rates, things that   are nearly impossible to know or predict.",
    "These factors have always played a role in the company's stock   price, and yet, over the last 10 years, Home Depot's stock is up   more than 720% -- an undeniably incredible performance. With few   exceptions, great businesses usually excel over the long term.   Home Depot is making the right investments, thinking of the   shopping experience across its mobile, digital, and physical   channels.",
    "Based on the company's full-year guidance, shares are trading   at a forward P/E ratio of about 22.7. For a company investing   heavily in its customer shopping experience even though it's   already the top business in its industry, that doesn't seem to be   too much of a premium. As a shareholder, I am happy to hold my   shares through these short-term concerns, as long as the company   continues to do so well with those things it can control.",
    "  10 stocks we like better than Home Depot       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Home Depot wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Home Depot       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Home Depot wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Matthew Cochrane      owns shares of Home Depot. The Motley Fool has the following     options: short February 2020 $205 calls on Home Depot and long     January 2021 $120 calls on Home Depot. The Motley Fool     recommends Home Depot. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:23:14"
}