{
  "url": "https://www.nasdaq.com/article/singapore-court-names-deloitte-as-manager-for-interpacific-group-debt-restructuring-20190905-00060",
  "title": "Singapore court names Deloitte as manager for Inter-Pacific Group debt restructuring - Nasdaq.com",
  "text": [
    "SINGAPORE, Sept 5 (Reuters) - Accountancy firm Deloitte & Touche said on Thursday it has been appointed by Singapore's high court to act as interim judicial manager for marine fuel supplier Inter-Pacific Group Pte (IPG) in an application for a court-led debt restructuring process.",
    "The appointment, following a nomination by IPG, comes more than two months after IPG unit Inter-Pacific Petroleum Pte (IPP) had a licence to operate bunker fuel tankers suspended by Singapore'sMaritime Port Authority (MPA). The MPA detected operational irregularities during an inspection. ",
    "Following the suspension, \"There was a significant cash flow crunch, such that there is insufficient cash to sustain (IPP) operations,\" according to an affidavit reviewed by Reuters, filed to the court on Aug. 20 on behalf of the company's director and majority shareholder, Hong Kong-based Cheung Lai Na.",
    "Contacted by Reuters, Cheung declined to comment.",
    "Deloitte didn't confirm the scale of IPP's liabilities.",
    "IPP's directors were hopeful that placing the company under judicial management would, among others, give it time to negotiate with the MPA to lift the suspension of the bunker licence and resume cash flows, the document said.",
    "Responding to a Reuters' request for comment, the MPA said it is not in negotiation with IPP and is still investigating the case.",
    "\"While Inter-Pacific's bunker craft operator licence has been temporarily suspended by MPA, the company can continue to operate their bunker supplier business by engaging other licensed bunker craft operators to supply bunker to buyers,\" the MPA said.",
    "Inter-Pacific also holds a bunker fuel supplier licence in Singapore, the world's largest bunkering hub. In 2018, the company was the 26th-largest supplier by volumes delivered out of 51 other operators, according to the MPA."
  ],
  "published_datetime": "2019-09-05 02:32:00"
}