{
  "url": "https://www.nasdaq.com/article/yirendai-ltd-yrd-q2-2019-earnings-call-transcript-cm1207648",
  "title": "Yirendai Ltd. (YRD) Q2 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   Yirendai Ltd.    (NYSE: YRD)        Q2 2019 Earnings Call       Sep 5, 2019 ,   8:00 p.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Ladies and gentlemen, thank you for standing by, and welcome   to the Yirendai Second Quarter 2019 Earnings Conference Call.   [Operator Instructions] I would now like to hand the conference   over to your first speaker today, Ms. Lydia Yu. Thank you. Please   go ahead.  Lydia Yu    --   Investor Relations Manager  Thank you, and welcome to Yirendai's second quarter 2019       earnings conference call    . Today's call features a presentation by the Founder, Chairman,   and CEO of CreditEase and CEO of Yirendai, Mr. Ning Tang; our   Senior VP of Corporate Business Development, Mr. Dennis Cong; our   Board of Director and CRO, Mr. Huan Chen; Ms. Wei Wang, our CEO   of Yiren Credit; Ms. Xiao Shang, our CEO of Yiren Wealth; and Ms.   Joanne Liu, our CFO of Yirendai will join the presenters in the   Q&A session. Before beginning, we will like to remind you that the   discussions during this call contain forward-looking statements   made under the safe harbor provisions of the US Private   Securities and Litigation Reform Act of 1995. Such statements are   subject to risks, uncertainties, and factors that can cause   actual results to differ materially from those contained in any   such statements. Further information regarding potential risks,   uncertainties or factors is included in Yirendai's filing with   the US Securities and Exchange Commission. Yirendai does not   undertake any obligation to update any forward-looking   statements, except as required under applicable law. During the call, we will be referring to several non-GAAP   financial measures as supplemental measures to review and assess   our operating performance. These non-GAAP financial measures are   not intended to be considered in isolation or as a substitute for   the financial information prepared and presented in accordance   with the US GAAP. For information about these non-GAAP measures   and a reconciliation to GAAP measures, please refer to our   earnings press release. I will now pass it on for our CEO, Ning, for opening   remarks.  Ning Tang    --   Chief Executive Officer  Thank you all for attending our second quarter 2019 earnings   conference call. I'm pleased to announce that we have achieved   another solid quarter of operation in both credit and wealth   management businesses. In particular, we gained strong momentum   in working with our bank partners to diversify our funding   sources. This quarter, on the credit side, quarter-over-quarter loan   originations remained flat as we maintained our focus on asset   quality. As of September 2019, the line of credit we have   obtained from our institutional partners has increased from RMB19   billion in Q1 2019 to close to RMB30 billion. We are now working   with approximately 10 partners, including leading joint stock and   city commercial banks. We expect loan origination funded by   institutional partners to reach approximately 30% by the end of   this year. In addition, we have also started to gain access to PBOC   credit system through our institutional funding partners, which   will not only allow us to obtain detailed credi   t report    s on the real-time basis to enhance our loan application   underwriting efficiency, but will also significantly improve our   delinquency management and collection efforts. To further expand our institutional relationships, we have   started to offer online lending solutions to our bank partners.   We have delivered our first online lending enabling solution to   Bank of Ningxia, in which, using our fintech expertise in online   lending and risk management, qualified customers can easily apply   for and obtain a loan online through the bank's mobile app. In   the second half of 2019, we will focus on high-quality asset   growth, expanding institutional partnerships, as well as   diversifying our product portfolio to better serve the   consumption needs of our borrowers. On wealth management, I'm pleased to note that we have   achieved significant milestones this quarter. We launched our new   brand, Yiren Wealth, this July. As part of our rebranding   campaign, we also released a detailed asset allocation guide for   the mass affluent population at first in China. The guide is   based on experience and knowledge that we've accumulated in the   wealth management industry over the past 10 years. This year, a   top strategic initiative for us is driving GMV of non-P2P   products, including bank wealth management products, mutual funds   and insurance. I'm pleased to note that in just over 60 days, our GMV for   bank wealth management products past RMB100 million mark. For   mutual fund, we newly launched the various mutual fund portfolios   targeted for different investor needs. In the first half of 2019   compared to 2018, we noted a significant transition in the   investment of money market funds to mutual fund portfolios. In   insurance, we have started to offer more one-on-one consultation   and have noted an increase in longer term and the larger ticket   size insurance products. We expect to see further traction of our   investors AUM into non-P2P products. Finally, on regulatory update, we have increased our   registered capital to RMB1 billion to prepare ourselves for the   potential upcoming regulatory trial program. At the same time, we   will also explore opportunities to strategically invest or   acquire financial licenses to hedge regulatory uncertainties. Thank you all. Now, I'll turn the call over to Dennis, our   Senior VP of Corporate Development, to review our second   quarter's business results.  Yu Cong    --   Chief Financial Officer  Thanks, Ning. Hello, everyone. On the credit business side,   total volume of loan origination for the quarter was RMB9.7   billion with about 35.9% of loan volume coming from repeat   borrowers. In terms of product mix, about 97.9% of the loan sales   are unsecured consumer loans and the rest are secured loans and   SME lending. The accumulated number of registered borrowers we   served reached 83 million and cumulative number of borrowers   served is close to 4.5 million as of June 30, 2019. On institutional funding, currently close to 20% of new loan   originations are funded through bank partners and we expect that   close to 30% of loans originated to be funded by our institution   partner by the end of the year. Our wealth management business as   of June 30, 2019, we have served close to 2.2 million investors   cumulatively. Total number of active investors in second quarter   of 2019 was close to 680,000 with total AUMs for Yiren Wealth at   RMB43.6 million as of June 30, 2019. Average AUM per investor   reached RMB149,000 and average investment term for P2P product   has increased to 15.1 month, indicating a highly speaking and   loyal Investor Day despite persistent industry uncertainties.   We're also seeing good traction with non-P2P wealth management   products. AUM of non-P2P products was RMB354 million in the   second quarter of 2019. In the third quarter of 2019, we will   launch a pilot telemarketing program to provide professional   investment insurance and wealth management advice to our   investors and further grow our non-P2P business. For our financial update, our focus on the key items of our   business operation and financial performance, you can refer the   detailed financial results to our earnings release. Total net   revenue was RMB2.2 billion during the quarter. Net revenue take   rate, which refers to total net revenue net of allowance for   contract asset, is 17.7% for second quarter 2019 as compared to   16.4% in the last quarter. The increase in revenue take rate is   mainly due to our product mix shift, as well as some of the   wealth management business we assumed through the Ocean   acquisition. This quarter, we maintain our contribution to the   credit assurance program at 14% to ensure adequate coverage. Our   credit assurance fund is funded with the total balance of RMB7   billion as of June 30, 2019, which is equivalent to 13% of total   performing loans covered by the credit assurance program. On the balance sheet side, as of June 30, 2009, our cash and   cash equivalents were RMB 2.7 billion, the balance of health to   maturity investment RMB9.5 million and the balance available for   self-investment were RMB387.5 million. As of June 30, 2019, our   usable cash maintained at a healthy level of RMB 3.1 billion. For business outlook, the uncertain industry environment makes   it difficult to provide an accurate outlook for loan origination   for the full year; however, we do expect loan origination to ramp   up in the third and fourth quarter of 2019 as institutional   funding increase. Now, I will pass it on to Huan, our CRO and Board of Director,   for an update on our risk business.  Chen Huan    --   Chief Risk Officer  Thanks, Dennis. From a credit performance and risk management   side, we always saw a slight volatility in early delinquency this   quarter due to industry environments, as well as declining loan   balance. Our vintage data shows that the risk performance of new   loans originated the post of Q3 2018 continuously improved with   M3 Plus net charge-off rate declining in the second half of 2018   due to origination of more stringent risk policies in August of   last year. To stabilize risk levels, we have been actively   managing our product portfolio to reduce risk exposure, and using   more data sets to lower [Indecipherable] indebted risk. This   quarter, we successfully used litigations [Phonetic] to collect   back defaulted [Phonetic] loans. We also expected our lease   performances will keep improving when we are using more   institutional funding, which makes PBOC credit bureau data   available for underwriting. This concludes our prepared remarks. We are ready for   Q&A. Questions and Answers:  Operator  [Operator Instructions] Your first question comes from the   line of Joe Shu [Phonetic] from Morgan Stanley. Please go ahead.   Excuse me, Joe, your line is now open, please go ahead.  Joe Shu    --   Morgan Stanley -- Analyst  Hello. Yeah. Good morning, management. And my first -- I have   two questions, the first question, can the management share some   more information on the online lending solution for Ningxia Bank,   like what kind of services are included in this package, and any   other banks were negotiating at this moment regarding to this   kind of business, and when does the management expect to see some   meaningful revenue contribution from this business segment? And   my second question is on the regulatory front. As I noticed in a   report that we have raised the registration capital to RMB1   billion [Phonetic], and is there anything else we need to do to   get prepared for that registration, and any other updates from   the regulator -- yes, any other updates from the regulator   recently? Thank you.  Ning Tang    --   Chief Executive Officer  Let me first address the regulatory environment question. Yes,   and we've increased our registered capital in preparation for   upcoming -- now it's called the trial program, yes, not   registration, but it's similar, meaning, a regulatory system for   online lending industry, and we believe we've been in full   compliance since -- yes, when the regulatory measures came out,   and we are ready for this trial program and we expect it will be   later this year or next year.  Chen Huan    --   Chief Risk Officer  And for Bank of Ningxia operations [Phonetic], when we met   them one year ago, they have less strong [Phonetic] demand to the   consumer lending business online, and the problem with us on to   -- we are also providing the whole package, the turnkey solutions   for lend -- to online consumer lending. So we're providing the   whole system, the whole underwriting capability and the whole   lifecycle management capabilities to Bank of Ningxia through   online lending. And the service is online in early this year and   after several months of testing in Q3 this year, already they   start to do more acting for this product and we see very   significant increase of the sales warrants in Q3 this year, and   from bank they also want to do more marketing for this product   and make it some big consumer loan product for customers, and   currently we -- because this is also a new business for us, so we   will take more time focusing on optimize and improve our   capabilities to cooperate with bank. So I think Bank of Ningxia   is only bank products for us to providing this project.  Yu Cong    --   Chief Financial Officer  So from revenue contribution perspective, the collaboration   with Ningxia Bank is more strategic approach. We will not look   for revenue volume for this business, but rather due to   relationship, so that we can bring Ningxia Bank as our   institutional funding partners. So the service itself won't be   significant revenue contribution, but rather potentially build   stronger strategic relationship with the bank institutions that   would really help us when we expand our funding sources into   these leading banks.  Joe Shu    --   Morgan Stanley -- Analyst  Okay. Thank you. That's very helpful.  Operator  [Operator Instructions] Thank you. Your next question comes   from the line of Alex Ye from UBS. Please go ahead.  Alex Ye    --   UBS -- Analyst  Hi. Good morning, management. Thanks for taking my questions.   I have a question on asset quality outlook. So we have seen   year-to-date many banks have commented that they are seeing an   uptick in their credit asset quality within the whole industry   due to the increasing risk of borrowers taking multiple loans   from different process. So I'm wondering is there any new trend   that we have seen in this front, and given many of our borrowers   properly shared [Indecipherable] with those of the bank customers   like they're also credit cardholders. So I wonder is there any   measure we can take to better control the asset quality and   potential deterioration in asset quality. Thanks.  Chen Huan    --   Chief Risk Officer  Yes. I think last year we already see that our -- there might   be some decelerating industry environment. So in Q3 last year, we   already start to take more stringent quality control, and so we   do see that some market risk let more and more borrowers, they   are taking multiple loans from different lenders, and some   borrowers may go into [Indecipherable]. So we picked some more   data facts including we also are assessing to the National   Internet Finance Association; they have a data sharing platform.   We are also taking these data from the platform to identify the   quality of the number of the loans the borrowers taken in less   than one month or three months. So we will proactively reject   some of borrowers who will take too much loans and make too many   applications in different platforms. So that's why we could see   some improvement things, Q3 last year, we see the early sequence   rates based on linked data, the income rate -- the delinquency   data is equating [Phonetic]. So that give us more confidence that   we can keep our risk performance and our asset quality track and   it can be even better in the second half of this year.  Alex Ye    --   UBS -- Analyst  Okay. Thank you.  Operator  [Operator Instructions] Thank you. There are no further   questions at this time. I would like to hand the conference back   to today's presenters. Please continue.  Lydia Yu    --   Investor Relations Manager  Thanks, everyone, for joining us. This concludes our call for   today.  Operator  [Operator Closing Remarks]  Duration: 21 minutes  Call participants:  Lydia Yu    --   Investor Relations Manager   Ning Tang    --   Chief Executive Officer   Yu Cong    --   Chief Financial Officer   Chen Huan    --   Chief Risk Officer   Joe Shu    --   Morgan Stanley -- Analyst   Alex Ye    --   UBS -- Analyst   More YRD analysis   All earnings call transcripts        10 stocks we like better than Yirendai     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Yirendai wasn't   one of them! That's right -- they think these 10 stocks   are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " Yirendai Ltd.    (NYSE: YRD)        Q2 2019 Earnings Call       Sep 5, 2019 ,   8:00 p.m. ET ",
    " Operator ",
    "Ladies and gentlemen, thank you for standing by, and welcome   to the Yirendai Second Quarter 2019 Earnings Conference Call.   [Operator Instructions] I would now like to hand the conference   over to your first speaker today, Ms. Lydia Yu. Thank you. Please   go ahead.",
    " Lydia Yu    --   Investor Relations Manager ",
    "Thank you, and welcome to Yirendai's second quarter 2019       earnings conference call    . Today's call features a presentation by the Founder, Chairman,   and CEO of CreditEase and CEO of Yirendai, Mr. Ning Tang; our   Senior VP of Corporate Business Development, Mr. Dennis Cong; our   Board of Director and CRO, Mr. Huan Chen; Ms. Wei Wang, our CEO   of Yiren Credit; Ms. Xiao Shang, our CEO of Yiren Wealth; and Ms.   Joanne Liu, our CFO of Yirendai will join the presenters in the   Q&A session.",
    "Before beginning, we will like to remind you that the   discussions during this call contain forward-looking statements   made under the safe harbor provisions of the US Private   Securities and Litigation Reform Act of 1995. Such statements are   subject to risks, uncertainties, and factors that can cause   actual results to differ materially from those contained in any   such statements. Further information regarding potential risks,   uncertainties or factors is included in Yirendai's filing with   the US Securities and Exchange Commission. Yirendai does not   undertake any obligation to update any forward-looking   statements, except as required under applicable law.",
    "During the call, we will be referring to several non-GAAP   financial measures as supplemental measures to review and assess   our operating performance. These non-GAAP financial measures are   not intended to be considered in isolation or as a substitute for   the financial information prepared and presented in accordance   with the US GAAP. For information about these non-GAAP measures   and a reconciliation to GAAP measures, please refer to our   earnings press release.",
    "I will now pass it on for our CEO, Ning, for opening   remarks.",
    " Ning Tang    --   Chief Executive Officer ",
    "Thank you all for attending our second quarter 2019 earnings   conference call. I'm pleased to announce that we have achieved   another solid quarter of operation in both credit and wealth   management businesses. In particular, we gained strong momentum   in working with our bank partners to diversify our funding   sources.",
    "This quarter, on the credit side, quarter-over-quarter loan   originations remained flat as we maintained our focus on asset   quality. As of September 2019, the line of credit we have   obtained from our institutional partners has increased from RMB19   billion in Q1 2019 to close to RMB30 billion. We are now working   with approximately 10 partners, including leading joint stock and   city commercial banks. We expect loan origination funded by   institutional partners to reach approximately 30% by the end of   this year.",
    "In addition, we have also started to gain access to PBOC   credit system through our institutional funding partners, which   will not only allow us to obtain detailed credi   t report    s on the real-time basis to enhance our loan application   underwriting efficiency, but will also significantly improve our   delinquency management and collection efforts.",
    "To further expand our institutional relationships, we have   started to offer online lending solutions to our bank partners.   We have delivered our first online lending enabling solution to   Bank of Ningxia, in which, using our fintech expertise in online   lending and risk management, qualified customers can easily apply   for and obtain a loan online through the bank's mobile app. In   the second half of 2019, we will focus on high-quality asset   growth, expanding institutional partnerships, as well as   diversifying our product portfolio to better serve the   consumption needs of our borrowers.",
    "On wealth management, I'm pleased to note that we have   achieved significant milestones this quarter. We launched our new   brand, Yiren Wealth, this July. As part of our rebranding   campaign, we also released a detailed asset allocation guide for   the mass affluent population at first in China. The guide is   based on experience and knowledge that we've accumulated in the   wealth management industry over the past 10 years. This year, a   top strategic initiative for us is driving GMV of non-P2P   products, including bank wealth management products, mutual funds   and insurance.",
    "I'm pleased to note that in just over 60 days, our GMV for   bank wealth management products past RMB100 million mark. For   mutual fund, we newly launched the various mutual fund portfolios   targeted for different investor needs. In the first half of 2019   compared to 2018, we noted a significant transition in the   investment of money market funds to mutual fund portfolios. In   insurance, we have started to offer more one-on-one consultation   and have noted an increase in longer term and the larger ticket   size insurance products. We expect to see further traction of our   investors AUM into non-P2P products.",
    "Finally, on regulatory update, we have increased our   registered capital to RMB1 billion to prepare ourselves for the   potential upcoming regulatory trial program. At the same time, we   will also explore opportunities to strategically invest or   acquire financial licenses to hedge regulatory uncertainties.",
    "Thank you all. Now, I'll turn the call over to Dennis, our   Senior VP of Corporate Development, to review our second   quarter's business results.",
    " Yu Cong    --   Chief Financial Officer ",
    "Thanks, Ning. Hello, everyone. On the credit business side,   total volume of loan origination for the quarter was RMB9.7   billion with about 35.9% of loan volume coming from repeat   borrowers. In terms of product mix, about 97.9% of the loan sales   are unsecured consumer loans and the rest are secured loans and   SME lending. The accumulated number of registered borrowers we   served reached 83 million and cumulative number of borrowers   served is close to 4.5 million as of June 30, 2019.",
    "On institutional funding, currently close to 20% of new loan   originations are funded through bank partners and we expect that   close to 30% of loans originated to be funded by our institution   partner by the end of the year. Our wealth management business as   of June 30, 2019, we have served close to 2.2 million investors   cumulatively. Total number of active investors in second quarter   of 2019 was close to 680,000 with total AUMs for Yiren Wealth at   RMB43.6 million as of June 30, 2019. Average AUM per investor   reached RMB149,000 and average investment term for P2P product   has increased to 15.1 month, indicating a highly speaking and   loyal Investor Day despite persistent industry uncertainties.   We're also seeing good traction with non-P2P wealth management   products. AUM of non-P2P products was RMB354 million in the   second quarter of 2019. In the third quarter of 2019, we will   launch a pilot telemarketing program to provide professional   investment insurance and wealth management advice to our   investors and further grow our non-P2P business.",
    "For our financial update, our focus on the key items of our   business operation and financial performance, you can refer the   detailed financial results to our earnings release. Total net   revenue was RMB2.2 billion during the quarter. Net revenue take   rate, which refers to total net revenue net of allowance for   contract asset, is 17.7% for second quarter 2019 as compared to   16.4% in the last quarter. The increase in revenue take rate is   mainly due to our product mix shift, as well as some of the   wealth management business we assumed through the Ocean   acquisition. This quarter, we maintain our contribution to the   credit assurance program at 14% to ensure adequate coverage. Our   credit assurance fund is funded with the total balance of RMB7   billion as of June 30, 2019, which is equivalent to 13% of total   performing loans covered by the credit assurance program.",
    "On the balance sheet side, as of June 30, 2009, our cash and   cash equivalents were RMB 2.7 billion, the balance of health to   maturity investment RMB9.5 million and the balance available for   self-investment were RMB387.5 million. As of June 30, 2019, our   usable cash maintained at a healthy level of RMB 3.1 billion.",
    "For business outlook, the uncertain industry environment makes   it difficult to provide an accurate outlook for loan origination   for the full year; however, we do expect loan origination to ramp   up in the third and fourth quarter of 2019 as institutional   funding increase.",
    "Now, I will pass it on to Huan, our CRO and Board of Director,   for an update on our risk business.",
    " Chen Huan    --   Chief Risk Officer ",
    "Thanks, Dennis. From a credit performance and risk management   side, we always saw a slight volatility in early delinquency this   quarter due to industry environments, as well as declining loan   balance. Our vintage data shows that the risk performance of new   loans originated the post of Q3 2018 continuously improved with   M3 Plus net charge-off rate declining in the second half of 2018   due to origination of more stringent risk policies in August of   last year. To stabilize risk levels, we have been actively   managing our product portfolio to reduce risk exposure, and using   more data sets to lower [Indecipherable] indebted risk. This   quarter, we successfully used litigations [Phonetic] to collect   back defaulted [Phonetic] loans. We also expected our lease   performances will keep improving when we are using more   institutional funding, which makes PBOC credit bureau data   available for underwriting.",
    "This concludes our prepared remarks. We are ready for   Q&A.",
    " Operator ",
    "[Operator Instructions] Your first question comes from the   line of Joe Shu [Phonetic] from Morgan Stanley. Please go ahead.   Excuse me, Joe, your line is now open, please go ahead.",
    " Joe Shu    --   Morgan Stanley -- Analyst ",
    "Hello. Yeah. Good morning, management. And my first -- I have   two questions, the first question, can the management share some   more information on the online lending solution for Ningxia Bank,   like what kind of services are included in this package, and any   other banks were negotiating at this moment regarding to this   kind of business, and when does the management expect to see some   meaningful revenue contribution from this business segment? And   my second question is on the regulatory front. As I noticed in a   report that we have raised the registration capital to RMB1   billion [Phonetic], and is there anything else we need to do to   get prepared for that registration, and any other updates from   the regulator -- yes, any other updates from the regulator   recently? Thank you.",
    " Ning Tang    --   Chief Executive Officer ",
    "Let me first address the regulatory environment question. Yes,   and we've increased our registered capital in preparation for   upcoming -- now it's called the trial program, yes, not   registration, but it's similar, meaning, a regulatory system for   online lending industry, and we believe we've been in full   compliance since -- yes, when the regulatory measures came out,   and we are ready for this trial program and we expect it will be   later this year or next year.",
    " Chen Huan    --   Chief Risk Officer ",
    "And for Bank of Ningxia operations [Phonetic], when we met   them one year ago, they have less strong [Phonetic] demand to the   consumer lending business online, and the problem with us on to   -- we are also providing the whole package, the turnkey solutions   for lend -- to online consumer lending. So we're providing the   whole system, the whole underwriting capability and the whole   lifecycle management capabilities to Bank of Ningxia through   online lending. And the service is online in early this year and   after several months of testing in Q3 this year, already they   start to do more acting for this product and we see very   significant increase of the sales warrants in Q3 this year, and   from bank they also want to do more marketing for this product   and make it some big consumer loan product for customers, and   currently we -- because this is also a new business for us, so we   will take more time focusing on optimize and improve our   capabilities to cooperate with bank. So I think Bank of Ningxia   is only bank products for us to providing this project.",
    " Yu Cong    --   Chief Financial Officer ",
    "So from revenue contribution perspective, the collaboration   with Ningxia Bank is more strategic approach. We will not look   for revenue volume for this business, but rather due to   relationship, so that we can bring Ningxia Bank as our   institutional funding partners. So the service itself won't be   significant revenue contribution, but rather potentially build   stronger strategic relationship with the bank institutions that   would really help us when we expand our funding sources into   these leading banks.",
    " Joe Shu    --   Morgan Stanley -- Analyst ",
    "Okay. Thank you. That's very helpful.",
    " Operator ",
    "[Operator Instructions] Thank you. Your next question comes   from the line of Alex Ye from UBS. Please go ahead.",
    " Alex Ye    --   UBS -- Analyst ",
    "Hi. Good morning, management. Thanks for taking my questions.   I have a question on asset quality outlook. So we have seen   year-to-date many banks have commented that they are seeing an   uptick in their credit asset quality within the whole industry   due to the increasing risk of borrowers taking multiple loans   from different process. So I'm wondering is there any new trend   that we have seen in this front, and given many of our borrowers   properly shared [Indecipherable] with those of the bank customers   like they're also credit cardholders. So I wonder is there any   measure we can take to better control the asset quality and   potential deterioration in asset quality. Thanks.",
    " Chen Huan    --   Chief Risk Officer ",
    "Yes. I think last year we already see that our -- there might   be some decelerating industry environment. So in Q3 last year, we   already start to take more stringent quality control, and so we   do see that some market risk let more and more borrowers, they   are taking multiple loans from different lenders, and some   borrowers may go into [Indecipherable]. So we picked some more   data facts including we also are assessing to the National   Internet Finance Association; they have a data sharing platform.   We are also taking these data from the platform to identify the   quality of the number of the loans the borrowers taken in less   than one month or three months. So we will proactively reject   some of borrowers who will take too much loans and make too many   applications in different platforms. So that's why we could see   some improvement things, Q3 last year, we see the early sequence   rates based on linked data, the income rate -- the delinquency   data is equating [Phonetic]. So that give us more confidence that   we can keep our risk performance and our asset quality track and   it can be even better in the second half of this year.",
    " Alex Ye    --   UBS -- Analyst ",
    "Okay. Thank you.",
    " Operator ",
    "[Operator Instructions] Thank you. There are no further   questions at this time. I would like to hand the conference back   to today's presenters. Please continue.",
    " Lydia Yu    --   Investor Relations Manager ",
    "Thanks, everyone, for joining us. This concludes our call for   today.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 21 minutes ",
    " Lydia Yu    --   Investor Relations Manager ",
    " Ning Tang    --   Chief Executive Officer ",
    " Yu Cong    --   Chief Financial Officer ",
    " Chen Huan    --   Chief Risk Officer ",
    " Joe Shu    --   Morgan Stanley -- Analyst ",
    " Alex Ye    --   UBS -- Analyst ",
    " More YRD analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than Yirendai     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Yirendai wasn't   one of them! That's right -- they think these 10 stocks   are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:23:37"
}