{
  "url": "https://www.nasdaq.com/article/history-favors-the-bulls-as-bitcoin-trades-sideways-at-10k-cm1210845",
  "title": "History Favors the Bulls as Bitcoin Trades Sideways at $10K - Nasdaq.com",
  "text": [
    "Bitcoin's (BTC) price rally has stalled in the last 10 weeks, but the bullish case remains intact with prices hovering well above a historically strong price support.",
    "The leading cryptocurrency broke into the latest bull market on April 2 with a high-volume rise from $4,000 to $5,000. It subsequently went on to hit a 17-month high of $13,880 on Bitstamp on June 26.",
    "Since then, however, the cryptocurrency has charted a narrowing price range with lower highs above $12,000 and higher lows below $10,000, as seen in the chart below.",
    "Related: Bear Trap? Bitcoin Price Dips Below $10K on Low Volumes",
    "The consolidation is reminiscent of a contracting triangle near $6,000 seen in the August to October period last year. That narrowing price range had ended with a downside break in November.",
    "The latest consolidation, therefore, may force investors to question the validity of the bullish breakout confirmed in April.",
    "However, it is too early to call an end of the bull market and the risks will remain skewed to the upside as long as the cryptocurrency is defending the three-day chart's 55-candle exponential moving average.",
    "Related: New Data Gives Unprecedented Insight Into How Iranians Use Bitcoin",
    "That EMA line served as a strong base during the 2016-2017 bull run. As of writing, the EMA is located at $8,972, while at press time BTC is changing hands at $10,145 on Bitstamp, representing a nearly 1 percent gain on a 24-hour basis.",
    "At the end of October 2015, bitcoin's outlook turned bullish with prices rising above $300. The cryptocurrency then formed a series of higher lows and higher highs to hit a record high of $20,000 in December 2017.",
    "Notably, the higher lows (marked by arrows) were established along the ascending (bullish) 55-candle EMA and almost every bounce ended up setting a higher high.",
    "For instance, bitcoin's pullback from the June 2016 high above $770 ran out of steam below the 55-candle EMA at $542 in August 2016 following which prices rallied to $1,100 by January 2017.",
    "On similar lines, pullbacks to the 55-candle EMA in April 2016 and March, July, and September 2017 fueled stronger rallies. Not once were sellers strong enough to force a convincing close below the 55-candle EMA.",
    "Hence, the bullish case put forward by 2019's second-quarter price rise is likely to weaken only if and when the three-candle finds acceptance under the 55-candle EMA, currently at $8,972.",
    "In fact, any pullback to the crucial average will be the biggest test for the bulls. A strong bounce from that level will likely cement expectations of a rally to fresh record highs above $20,000.",
    "As for the next 24 hours, the odds appear stacked in favor of a move higher for BTC.",
    "BTC is trapped in a falling-wedge pattern, a bullish continuation setup, as discussed yesterday. Trading volumes have dropped throughout the pullback from $10,949 to $9,855 (Tuesday's low).",
    "So, the probability of BTC witnessing a wedge breakout is high - more so, as the widely-tracking trend-following moving average convergence divergence (MACD) histogram has crossed above zero, confirming a bullish reversal.",
    "The Chaikin money flow index, which incorporates both prices and trading volumes, is also reporting a bullish divergence - higher lows contradicting lower lows on price.",
    "A wedge breakout, if confirmed, would open the doors for a retest of recent highs above $10,900.",
    "The bullish case would weaken if prices drop below Wednesday's low of $9,855 with a solid rise in selling volumes.",
    "Disclosure:  The author holds no cryptocurrency assets at the time of writing.",
    "Bitcoin  image via Shutterstock; charts by Trading View",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 07:00:56"
}