{
  "url": "https://www.nasdaq.com/article/can-value-investors-consider-sinopec-shangai-shi-stock-cm1206725",
  "title": "Can Value Investors Consider SINOPEC Shangai (SHI) Stock? - Nasdaq.com",
  "text": [
    " Value investing is easily one of the most popular ways to find great stocks in any market environment. After all, who wouldn't want to find stocks that are either flying under the radar and are compelling buys, or offer up tantalizing discounts when compared to fair value? One way to find these companies is by looking at several key metrics and financial ratios, many of which are crucial in the value stock selection process. Let's put SINOPEC Shangai Petrochemical Company, Ltd. SHI  stock into this equation and find out if it is a good choice for value-oriented investors right now, or if investors subscribing to this methodology should look elsewhere for top picks:  PE Ratio  A key metric that value investors always look at is the Price to Earnings Ratio, or PE for short. This shows us how much investors are willing to pay for each dollar o f earnings  in a given stock, and is easily one of the most popular financial ratios in the world. The best use of the PE ratio is to compare the stock's current PE ratio with: a) where this ratio has been in the past; b) how it compares to the average for the industry/sector; and c) how it compares to the market as a whole. On this front, SINOPEC Shangai has a trailing twelve months PE ratio of 7.23, as you can see in the chart below:    This level actually compares quite favorably with the market at large, as the PE for the S&P 500 stands at about 18.02. Also, if we focus on the long-term PE trend, SINOPEC Shangai's current PE level puts it slightly below its midpoint of 7.36 over the past five years.    The stock's PE compares quite favorably with the Basic Materials Market's trailing twelve months PE ratio, which stands at 13.98. This indicates that the stock is undervalued right now, compared to its peers.    Meanwhile, SINOPEC Shangai has a forward PE ratio (price relative to this year's earnings) of 3.70, which much lower than the current level. So, it is fair to say that a slightly more value-oriented path may be ahead for SINOPEC Shangai stock in the near term too.  P/S Ratio  Another key metric to note is the Price/Sales ratio. This approach compares a given stock's price to its total sales, where a lower reading is generally considered better. Some people like this metric more than other value-focused ones because it looks at sales, something that is far harder to manipulate with accounting tricks than earnings. Right now, SINOPEC Shangai has a P/S ratio of just 0.2. This is quite lower than the S&P 500 average, which comes in at 3.17x right now. Also, as we can see in the chart below, this is below the highs for this stock in particular over the past few years.     Broad Value Outlook  In aggregate, SINOPEC Shangai currently has a Value Score of A, putting it into the top 20% of all stocks we cover from this look. This makes SINOPEC Shangai a solid choice for value investors.  What About the Stock Overall?  Though SINOPEC Shangai might be a good choice for value investors, there are plenty of other factors to consider before investing in this name. In particular, it is worth noting that the company has a Growth Score of C and a Momentum Score of A. This gives SHI a Zacks VGM score - or its overarching fundamental grade - of A. (You can read more about the Zacks Style Scores here >>  ) Meanwhile, the company's recen t earnings  estimates have been bullish. The current year has seen no estimate go down in the past sixty days compared to one upward revision, while the next year estimate has seen no down and one up in the same time period. This has had a positive effect on the consensus estimate. While the current-year consensus estimate shot up 9.7% over the past two months, the next-year estimate has climbed 12.7%. You can see the consensus estimate trend and recent price action for the stock in the chart below:   SINOPEC Shangai Petrochemical Company, Ltd. Price and     Consensus      SINOPEC Shangai Petrochemical Company, Ltd.   price-consensus-chart    |   SINOPEC Shangai Petrochemical Company, Ltd.   Quote   Such bullish analyst sentiments is the reason why the stock has a Zacks Rank #1 (Strong Buy) and it is the reason why we are looking for outperformance from the company in the near term.  Bottom Line  SINOPEC Shangai is an inspired choice for value investors, as it is hard to beat its incredible lineup of statistics on this front. Despite a sluggish industry rank (among Bottom 13% of more than 250 industries), a Zacks Rank #1 instils optimism in the stock. However, over the past two years, the broader industry has clearly underperformed the market at large, as you can see below:    We believe, despite an unsatisfactory past industry performance and a sluggish industry rank, a good Zacks rank and bullish analyst sentiments signal that the stock is likely to benefit from favorable broader factors in the immediate future. Add to this robust value metrics, and we believe that we have a strong value contender in SINOPEC Shangai.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  SINOPEC Shangai Petrochemical Company, Ltd. (SHI): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Value investing is easily one of the most popular ways to find great stocks in any market environment. After all, who wouldn't want to find stocks that are either flying under the radar and are compelling buys, or offer up tantalizing discounts when compared to fair value?",
    "One way to find these companies is by looking at several key metrics and financial ratios, many of which are crucial in the value stock selection process. Let's put SINOPEC Shangai Petrochemical Company, Ltd. SHI  stock into this equation and find out if it is a good choice for value-oriented investors right now, or if investors subscribing to this methodology should look elsewhere for top picks:",
    " PE Ratio ",
    "A key metric that value investors always look at is the Price to Earnings Ratio, or PE for short. This shows us how much investors are willing to pay for each dollar o f earnings  in a given stock, and is easily one of the most popular financial ratios in the world. The best use of the PE ratio is to compare the stock's current PE ratio with: a) where this ratio has been in the past; b) how it compares to the average for the industry/sector; and c) how it compares to the market as a whole.",
    "On this front, SINOPEC Shangai has a trailing twelve months PE ratio of 7.23, as you can see in the chart below:",
    "This level actually compares quite favorably with the market at large, as the PE for the S&P 500 stands at about 18.02. Also, if we focus on the long-term PE trend, SINOPEC Shangai's current PE level puts it slightly below its midpoint of 7.36 over the past five years.",
    "The stock's PE compares quite favorably with the Basic Materials Market's trailing twelve months PE ratio, which stands at 13.98. This indicates that the stock is undervalued right now, compared to its peers.",
    "Meanwhile, SINOPEC Shangai has a forward PE ratio (price relative to this year's earnings) of 3.70, which much lower than the current level. So, it is fair to say that a slightly more value-oriented path may be ahead for SINOPEC Shangai stock in the near term too.",
    " P/S Ratio ",
    "Another key metric to note is the Price/Sales ratio. This approach compares a given stock's price to its total sales, where a lower reading is generally considered better. Some people like this metric more than other value-focused ones because it looks at sales, something that is far harder to manipulate with accounting tricks than earnings.",
    "Right now, SINOPEC Shangai has a P/S ratio of just 0.2. This is quite lower than the S&P 500 average, which comes in at 3.17x right now. Also, as we can see in the chart below, this is below the highs for this stock in particular over the past few years.",
    " Broad Value Outlook ",
    "In aggregate, SINOPEC Shangai currently has a Value Score of A, putting it into the top 20% of all stocks we cover from this look. This makes SINOPEC Shangai a solid choice for value investors.",
    " What About the Stock Overall? ",
    "Though SINOPEC Shangai might be a good choice for value investors, there are plenty of other factors to consider before investing in this name. In particular, it is worth noting that the company has a Growth Score of C and a Momentum Score of A. This gives SHI a Zacks VGM score - or its overarching fundamental grade - of A. (You can read more about the Zacks Style Scores here >>  )",
    "Meanwhile, the company's recen t earnings  estimates have been bullish. The current year has seen no estimate go down in the past sixty days compared to one upward revision, while the next year estimate has seen no down and one up in the same time period.",
    "This has had a positive effect on the consensus estimate. While the current-year consensus estimate shot up 9.7% over the past two months, the next-year estimate has climbed 12.7%. You can see the consensus estimate trend and recent price action for the stock in the chart below:",
    "  SINOPEC Shangai Petrochemical Company, Ltd. Price and     Consensus      SINOPEC Shangai Petrochemical Company, Ltd.   price-consensus-chart    |   SINOPEC Shangai Petrochemical Company, Ltd.   Quote  ",
    " SINOPEC Shangai Petrochemical Company, Ltd. Price and     Consensus ",
    " SINOPEC Shangai Petrochemical Company, Ltd.   price-consensus-chart    |   SINOPEC Shangai Petrochemical Company, Ltd.   Quote ",
    "Such bullish analyst sentiments is the reason why the stock has a Zacks Rank #1 (Strong Buy) and it is the reason why we are looking for outperformance from the company in the near term.",
    " Bottom Line ",
    "SINOPEC Shangai is an inspired choice for value investors, as it is hard to beat its incredible lineup of statistics on this front. Despite a sluggish industry rank (among Bottom 13% of more than 250 industries), a Zacks Rank #1 instils optimism in the stock.",
    "However, over the past two years, the broader industry has clearly underperformed the market at large, as you can see below:",
    "We believe, despite an unsatisfactory past industry performance and a sluggish industry rank, a good Zacks rank and bullish analyst sentiments signal that the stock is likely to benefit from favorable broader factors in the immediate future. Add to this robust value metrics, and we believe that we have a strong value contender in SINOPEC Shangai.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:40:00"
}