{
  "url": "https://www.nasdaq.com/article/annaly-capital-management-nly-outpaces-stock-market-gains-what-you-should-know-cm1210779",
  "title": "Annaly Capital Management (NLY) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " In the latest trading session, Annaly Capital Management (NLY) closed at $8.65, marking a +0.93% move from the previous day. This change outpaced the S&P 500's 0.72% gain on the day. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%. Prior to today's trading, shares of the real estate investment trust had lost 6.95% over the past month. This has lagged the Finance sector's gain of 2.13% and the S&P 500's gain of 2.25% in that time. Wall Street will be looking for positivity from NLY as it approaches its nex t earnings  report date. On that day, NLY is projected to report earnings of $0.25 per share, which would represent a year-over-year decline of 16.67%. Investors should also note any recent changes to analyst estimates for NLY. These revisions typically reflect the latest short-term business trends, which can change frequently. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook. Based on our research, we believe these estimate revisions are directly related to near-team stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. NLY is currently a Zacks Rank #3 (Hold). Valuation is also important, so investors should note that NLY has a Forward P/E ratio of 8.28 right now. For comparison, its industry has an average Forward P/E of 9.74, which means NLY is trading at a discount to the group. The REIT and Equity Trust industry is part of the Finance sector. This group has a Zacks Industry Rank of 83, putting it in the top 33% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Annaly Capital Management Inc (NLY): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "In the latest trading session, Annaly Capital Management (NLY) closed at $8.65, marking a +0.93% move from the previous day. This change outpaced the S&P 500's 0.72% gain on the day. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%.",
    "Prior to today's trading, shares of the real estate investment trust had lost 6.95% over the past month. This has lagged the Finance sector's gain of 2.13% and the S&P 500's gain of 2.25% in that time.",
    "Wall Street will be looking for positivity from NLY as it approaches its nex t earnings  report date. On that day, NLY is projected to report earnings of $0.25 per share, which would represent a year-over-year decline of 16.67%.",
    "Investors should also note any recent changes to analyst estimates for NLY. These revisions typically reflect the latest short-term business trends, which can change frequently. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.",
    "Based on our research, we believe these estimate revisions are directly related to near-team stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. NLY is currently a Zacks Rank #3 (Hold).",
    "Valuation is also important, so investors should note that NLY has a Forward P/E ratio of 8.28 right now. For comparison, its industry has an average Forward P/E of 9.74, which means NLY is trading at a discount to the group.",
    "The REIT and Equity Trust industry is part of the Finance sector. This group has a Zacks Industry Rank of 83, putting it in the top 33% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:50:13"
}