{
  "url": "https://www.nasdaq.com/article/as-tensions-ease-between-the-us-and-china-its-all-eyes-on-the-ecb-cm1210833",
  "title": "As Tensions Ease Between the U.S and China, it’s all Eyes on the ECB - Nasdaq.com",
  "text": [
    "The economic calendar was on the lighter side through the Asian session this morning. Economic data was limited to August house price figures out of the UK.",
    "There were no material stats to influence the Asian pairings on the day.",
    "A lack of stats left the markets to look ahead to this afternoon's ECB monetary policy decision. There's plenty of uncertainty on just how far Draghi will be able to go ahead of his departure…",
    "Outside of the stats, Wednesday's news of China exempting a range of U.S products from retaliatory tariffs provided hope of progress on trade talks next month.",
    "In the early hours of this morning, news also hit the wires of the U.S delaying the latest round of tariffs to 15 th October.  On 1 st October the U.S was scheduled to roll out tariffs on $250bn worth of Chinese goods.",
    "At the time of writing, the Japanese Yen was down by 0.11% to ¥107.94 against the U.S Dollar. The Aussie Dollar was up by 0.13% to $0.6871, with the Kiwi Dollar up by 0.11% to $0.6420.",
    "Direction for the majors came from the positive news from the trade war front.",
    "It's a busy day ahead on the economic calendar . Key stats include finalized August inflation figures out of France and July industrial production numbers from the Eurozone.",
    "While we can expect the EUR to respond to the industrial production figures, any moves will be short-lived.",
    "The main event of the day is the ECB's monetary policy decision and press conference later this afternoon.",
    "Expect plenty of EUR reaction to the monetary policy statement and throughout the ECB press conference.",
    "There is some uncertainty over how far the ECB will go. Draghi has faced some opposition from other ECB members over reintroducing the QE program. It remains to be seen whether Draghi gets his way…",
    "If all goes the way the markets hope, a return to $1.09 levels would be reasonable when factoring the FED's likely rate cut next week.",
    "At the time of writing, the EUR was up by 0.03% to $1.1013.",
    "It's a quiet day ahead on the data front. There are no material stats to provide the Pound with direction through the day.",
    "The lack of stats will leave the market focus on Brexit throughout the day. Will the Tories give the Pound a boost by making progress in Brexit talks in Brussels?",
    "British Prime Minister Boris Johnson certainly has had a rough time of it, with yesterday's ruling on the suspension of Parliament being unlawful yet another blow…",
    "The tougher it gets for the British PM, the better it is for the Pound…",
    "At the time of writing, the Pound was up by 0.04% to $1.2331.",
    "It's a relatively busy day ahead on the economic calendar , with data due out of the U.S including August inflation and weekly jobless claims figures.",
    "Barring an unexpected jump in initial jobless claims, inflation figures will have the greatest impact on the day.",
    "Dire numbers may raise expectations of a larger than 25 basis point rate cut by the FED. The numbers would need to be quite dire, however…",
    "The Dollar Spot Index rose by 0.32% to 98.645 on Wednesday. At the time of writing, the Dollar Spot Index was down by 0.02% to 98.623.",
    "It's a quiet day ahead on the economic calendar , with key stats due out of Canada limited to July housing sector figures.",
    "We would expect the numbers to have a muted impact on the Loonie, however.",
    "For now, the outlook for the Loonie remains positive as central banks elsewhere u-turn on monetary policy.",
    "An easing in tensions between the U.S and China will also provide support.",
    "The Loonie was up by 0.03% at C$1.3190, against the U.S Dollar, at the time of writing.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:07:08"
}