{
  "url": "https://www.nasdaq.com/article/aerovironment-inc-avav-q1-2020-earnings-call-transcript-cm1207659",
  "title": "Aerovironment Inc (AVAV) Q1 2020 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   Aerovironment Inc    (NASDAQ: AVAV)        Q1 2020 Earnings Call       Sep 4, 2019 ,   4:30 p.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Steven A. Gitlin    --   Vice President of Investor Relations  Good afternoon, ladies and gentlemen, and welcome to   AeroVironment's First Quarter Fiscal Year 2020 Earnings Call.   This is Steven Gitlin, Vice President of Investor Relations for   Aerovironment. At this time, all participants are in a   listen-only mode. We will conduct a question-and-answer session   after management's remarks. As a reminder, this conference is being recorded for replay   purposes. Before we begin, please note that on this call, certain   information presented contains forward-looking statements within   the meaning of the Private Securities Litigation Reform Act of   1995. Forward-looking statements include, without limitation, any   statement that may predict, forecast, indicate or imply future   results, performance or achievements and may contains words such   as believe, anticipate, expect, estimate, intend, project, plan   or words or phrases with similar meaning. Forward-looking statements are based on current expectations,   forecasts and assumptions that involve risks and uncertainties,   including but not limited to, economic, competitive, governmental   and technological factors outside of our control that may cause   our business strategy or actual results to differ materially from   the forward-looking statements. For further information on these   risks, we encourage you to review the risk factors discussed in   AeroVironment's periodic reports on Form 10-K and Form 10-Q filed   with the SEC, and the Form 8-K filed today with the SEC, along   with the associated earnings release and the safe harbor   statement contained therein. This afternoon we also filed a slide presentation with our   earnings release and posted a presentation on our website at   avinc.com, in the Events and Presentations section. The content   of this conference call contains time-sensitive information that   is accurate only as of today, September 4, 2019. The Company   undertakes no obligation to make any revision to any   forward-looking statements contained in our remarks today or to   update them to reflect the events or circumstances occurring   after this conference call. Joining me today from AeroVironment are President and Chief   Executive Officer, Mr. Wahid Nawabi; and Senior Vice President   and Chief Financial Officer, Mrs. Teresa Covington. We will now begin with remarks from Wahid Nawabi. Wahid?  Wahid Nawabi    --   President and Chief Executive Officer  Thank you, Steve, and welcome to our first quarter fiscal year   2020       earnings conference call    . Today, I will refer to the supplemental charts, we filed with   our earnings release and posted to our website to highlight   important messages. On today's call, I will emphasize three key messages that   appear on Slide number 3 of our supplemental charts. First, our   team delivered outstanding first quarter results. Second, we're   successfully executing our plan and remain on track to achieve   our fiscal year 2020 objectives. And third, we continue to make   great progress on our strategic growth initiatives. I will start   by summarizing our outstanding first quarter fiscal year 2020   performance and discuss our key achievements during the quarter.   Next Teresa will provide a more detailed summary of financial   performance in the quarter, and I will discuss our goals for   fiscal year 2020 before Teresa, Steve and I take your   questions. Now for our first quarter fiscal year 2020 financial   highlights. Once again, outstanding financial results reflect our   team's focused execution and the sustained market demand for our   solutions. Key highlights of our strong first quarter results   summarized on Page number 4 of our supplemental charts include   the following. Revenue of $86.9 million increased 11% over last   year. Gross profit of $41.3 million increased 27% over last year.   Earnings per diluted share of $0.71 decreased $0.14 from first   quarter of fiscal year 2019 diluted EPS of $0.85. Non-GAAP   earnings per diluted share of $0.74 increased $0.15 over first   quarter of fiscal year 2019 non-GAAP diluted EPS of $0.59. Funded   backlog of $165 million increased 5% over last year. We are   continuing a multi-quarter trend of maintaining a high level of   funded backlog as compared to our historical averages. Favorable revenue mix and higher volume contributed to strong   quarter profit as illustrated on Slide number 6 with a higher   proportion of product versus service revenue. Our strong funded   backlog supports a high level of visibility, which Teresa will   detail shortly. In addition to strong financial results, our team made great   progress across our business as highlighted on Slide number 5. We   remain the global leader in small UAS for the defense market and   for fixed wing solutions in particular. In the first quarter, we   received a $45 million contract award from the U.S. Army for   Raven systems that was included in government fiscal year 2019   appropriations. This award supports the Army's Security Force   Assistance Brigades referred to us SFAB. These specialized army   units conduct training, advising, assisting, enabling and   accompanying operations with allied and partner nations. Exposing   more allied and partner nations to the effectiveness of our Raven   systems helps expand awareness and promote further adoption of   our solutions. The Army and it's SFAB organization are engaged in a   modernization program to provide soldiers with the latest and   most capable tools. In the selection of our Raven system serves   as further evidence of AeroVironment's leadership position in   this market and our advanced capabilities. The U.S. Military and   more than 45 allied nations continue to view AeroVironment's   family of small UAS as the premier fixed wing solution and the   category with a track record of reliability, effectiveness and   ruggedness demonstrated around the world. We are actively   pursuing a number of international procurement opportunities and   look forward to providing more information when we are able   to. We're excited to count our new VAPOR unmanned helicopter   systems as part of our family of small UAS. Our team is on track   to fulfill to more than $13 million IDIQ contract for defense   customer, while also engaging with other customers to market this   capability. And our Tactical Missile Systems product line, the government   recently announced the U.S. Army's intent to award a sole source   Switchblade hardware production contract to Aerovironment for   government fiscal years 2020 through 2022. The performance period   includes one 12-month base period and two 12-month options. We   anticipate receiving this contract award by our fourth fiscal   quarter. And federal government fiscal year 2019 defense   appropriations $110 million and funding was specified for LMAMS,   or Lethal Miniature Aerial Missile Systems, and $83 million have   been proposed as part of the government fiscal year 2020 budget   request. On Slide number 7, we illustrate the primary AeroVironment   components of U.S. government fiscal year 2019 procurement   appropriations and which of those have already converted to   orders. Past awards have demonstrated that government fiscal year   appropriations can be spend in subsequent fiscal years. We are   preparing our production line based on communication with our   customer and anticipated contract timing. And our HAPS program summarized on Slide number 8. We continue   to make great progress toward the goal of helping to bridge the   worlds digital divide by manufacturing, supplying and supporting   solar HAPS UAS for HAPSMobile Inc. In August, HAPSMobile   announced, it received FAA authorization for flight testing in   Lanai, Hawaii, paving the way for the initiation of our high   altitude flight test program. Before operating in Lanai, we are   conducting ground and flight testing in California. We look   forward to providing you more updates as we continue to make   progress in this exciting and large growth opportunity. Now Teresa will provide a detailed financial overview of our   first quarter. Teresa?  Teresa Covington    --   Senior Vice President and Chief Financial Officer  Thank you, Wahid, and good afternoon, everyone. We had a   strong financial performance in the first quarter of fiscal 2020.   Revenue from continuing operations for the first quarter fiscal   2020 was $86.9 million, an increase of $8.9 million or 11% from   the first quarter of fiscal 2019 revenue of $78 million. The   increase was due to an increase in product deliveries of $10.5   million, partially offset by a decrease in service revenue of   $1.7 million. First quarter of fiscal 2020 revenue by major product   line/program is as follows, small UAS was $66.7 million or 77%,   HAPS was $12.3 million or 14%, TMS was $5.6 million or 6%, and   other was $2.2 million or 3%. The inception to-date revenue for   HAPSMobile is $89.8 million. The total value of all contracts   with HAPSMobile is $134.4 million, which consist of $125.7   million for the design development agreement and $8.7 million for   preliminary design and other related efforts. There is $44.5   million remaining on these contracts, which includes a portion   that is currently unfunded. Gross margin from continuing operations for the first quarter   of fiscal 2020 was $41.3 million or 47% of revenue compared to   $32.6 million or 42% of revenue for the first quarter of fiscal   2019. The increase in gross margin was primarily due to an   increase in product margin of $9.9 million, partially offset by a   decrease in service margin of $1.2 million. Gross margin as a   percentage of revenue increased to 47% from 42%, primarily due to   a favorable product mix and an increase in the proportion of   product revenue to total revenue. Product sales were 76% of total   sales in the first quarter fiscal 2020 compared to 71% for the   first quarter of fiscal 2019. Looking at the rest of the income statement, SG&A expense   from continuing operations for the first quarter of fiscal 2020   was $13.7 million or 16% of revenue compared to SG&A expense   of $12 million or 15% of revenue for the first quarter of fiscal   2019. R&D expense from continuing operations for the first   quarter of fiscal 2020 was $8.7 million or 10% of revenue   compared to R&D expense of $6.4 million or 8% of revenue for   the first quarter of fiscal 2019. Income from continuing operations for the first quarter of   fiscal 2020 was $18.9 million compared to $14.2 million for the   first quarter of fiscal 2019. The increase in income from   operations was primarily due to an increase in gross margin of   $8.7 million, partially offset by an increase in R&D expense   of $2.3 million and an increase in SG&A expense of $1.7   million. Net other income for the first quarter of fiscal 2020 was $1.7   million compared to net other income of $9.3 million for the   first quarter of fiscal 2019. The decrease in net other income   was primarily due to a one-time gain from a litigation settlement   during the first quarter of fiscal 2019. The effective income tax rate from continuing operations was   10.4% for the first quarter of fiscal 2020 compared to an   effective income tax rate of 10.9% for the first quarter of   fiscal 2019. Equity method investment activity, net of tax for   the first quarter of fiscal 2020 was a loss of $1.3 million or   $0.06 per diluted share compared to a loss of $0.6 million net of   tax for the first quarter of fiscal 2019. Net income from continuing operations attributable to   AeroVironment for the first quarter of fiscal 2020 was $17.1   million or $0.71 per diluted share compared to a net income from   continuing operations attributable to AeroVironment of $20.3   million or $0.85 per diluted share for the first quarter of   fiscal 2019. Non-GAAP diluted earnings per share for the first   quarter of fiscal 2020 was $0.74 per diluted share and exclude   $0.03 per diluted share for the deal, integration costs and   intangible amortization expense associated with our recent   acquisition of Pulse Aerospace. Non-GAAP diluted earnings per share for the first quarter of   fiscal 2019 was $0.59 per diluted share and excludes the $0.26   per diluted share gain from a one-time litigation settlement. Our   funded backlog as of July 27, 2019, was $165.2 million, an   increase of $8.2 million from the first quarter of fiscal 2019,   and an increase of $0.9 million from the fourth quarter of fiscal   2019 backlog of $164.3 million. Turning to our balance sheet, cash, cash equivalents,   restricted cash and investments at the end of the first quarter   of fiscal 2020 totaled $310.6 million, a decrease of $22 million   from the end of fiscal 2019 cash, cash equivalents, restricted   cash and investments of $332.6 million. The decrease in cash was   primarily related to the Pulse Aerospace acquisition as well as   the increased investment in the HAPSMobile joint venture. Net accounts receivable, including unbilled receivables and   retention at the end of the first quarter of fiscal 2020 totaled   $90.7 million. The unbilled receivables and retentions balance   was $47.9 million, inclusive of $12.6 million of related party   amount. Total days sales outstanding from continuing operations   for the first quarter of fiscal year 2020 was approximately 90   days compared to 87 days for the fourth quarter fiscal year   2019. Net inventory at the end of the first quarter fiscal year 2020   was $56.3 million compared to $54.1 million at the end of the   fourth quarter of fiscal year 2019. Days in inventory outstanding   for the first quarter of fiscal year 2020 was approximately 109   days compared to 92 days for the fourth quarter of fiscal year   2019. Accounts payable at the end of the first quarter fiscal   year 2020 was $11.4 million compared to $16 million at the end of   the fourth quarter of fiscal year 2019. Total days payable   outstanding for the first quarter fiscal year 2020 was   approximately 27 days compared to 24 days for the fourth quarter   fiscal year 2019. Turning to capital expenditures in the first quarter of fiscal   year 2020, we invested approximately $1.9 million in property   improvements and capital equipment for continuing operations, and   recognized $2.1 million of depreciation and amortization   expense. Now an update to our fiscal 2020 visibility, as highlighted on   Page 9 of the supplemental chart. As of today, we have   year-to-date revenue in fiscal 2020 of $87 million. First quarter   ending backlog that we anticipate to execute in fiscal 2020 of   $150 million. Q2 quarter-to-date bookings that we anticipate to   execute in fiscal 2020 of $18 million. Unfunded backlog from   incrementally funded contracts that we anticipate to recognize   revenue during the balance of the year of $15 million. This adds   up to $270 million or 75% of our fiscal year 2020 midpoint   revenue guidance range. We anticipate a full year effective tax rate of approximately   11%. This is higher than the fiscal 2019 full year tax rate of   9%, primarily due to anticipated lower excess tax benefits from   equity awards and other tax credit estimate. Now I'd like to turn things back to Wahid.  Wahid Nawabi    --   President and Chief Executive Officer  Thanks, Teresa. Our first quarter results represent a very   strong start to fiscal year 2020. We are executing to our plan   and are on track to achieving our fiscal year 2020 objectives,   and delivering a third consecutive year of profitable   double-digit top line growth. With 75% full year visibility to   the midpoint of our revenue guidance range, we reiterate our   guidance of $350 million to $370 million in revenue, $1.35 to   $1.55 in diluted EPS, and $1.47 to $1.67 in non-GAAP diluted   EPS. We anticipate first half revenue to represent about 45% of   full year revenue. We expect lower gross margin in the second   half of fiscal year 2020 as a shift in revenue mix is likely to   compress margins. We also plan higher investments in the second   half. Two consecutive years of double-digit profitable top line   growth demonstrate the effectiveness of our past strategic   investments. We expect full year internal R&D spending to be   around 11% of revenue. We have summarized our full fiscal year   2020 financial expectations on Slide number 10 of our   supplemental charts. Once again, the three key takeaways from our first fiscal   quarter are, first, our team delivered outstanding first quarter   results; second, we are successfully executing our plan and   remain on track to achieve our fiscal year 2020 objectives; and   third, we continue to make great progress on strategic growth   initiatives. I would like to take this opportunity to thank our   employees for their focus and dedication, our customers for   placing their trust in us, and you, our stockholders for your   confidence in our team and our plans. We remain dedicated to   helping you proceed with certainty. Teresa, Steve and I will now take your questions. Questions and Answers:  Steven A. Gitlin    --   Vice President of Investor Relations  Thank you, Wahid. We will now begin the question-and-answer   session. [Operator Instructions] Our first question comes from   Pete Skibitski at Alembic Global. Pete?  Pete Skibitski    --   Alembic Global Advisors -- Analyst  Hey, good afternoon, guys, nice quarter.  Wahid Nawabi    --   President and Chief Executive Officer  Thank you, Pete.  Pete Skibitski    --   Alembic Global Advisors -- Analyst  I was wondering if we could put maybe a finer point on the   strong gross margins on the product revenue, just -- it sounds   like UAS sales were very strong in the first quarter. And was it,   largely international small UAS revenue that drove the gross   margin strength? And just from the revenue that Teresa talked   about, it sounds like that will tail off the balance of the year,   and that's why gross margins won't be as high the balance of the   year. Am I characterizing that correctly?  Teresa Covington    --   Senior Vice President and Chief Financial Officer  Pete, if we look at our gross margin, the key drivers that I   have talked about before, really three key drivers. One is the   revenue volume and we had strong revenue volume in the first   quarter. The second one is product versus services mix. And so,   as I've talked about before, our product gross margins are   generally higher than our services margin, very high product   percentage at 76% for the quarter. And the third piece is the mix   difference. So we do have mix differences of our products. So a   combination in the first quarter, all of those were favorable,   the revenue volume, the product as a percentage of the sales and   the mix of products that we had. Your other question where you talked about, we did have very   strong, a small UAS sales in the first quarter at 66.7 [Phonetic]   that was strong in both domestic and international. So we did   have growth internationally in small UAS and also domestic; most   of the growth was in the domestic side.  Pete Skibitski    --   Alembic Global Advisors -- Analyst  Okay, interesting. Okay. Let me ask one more top-level   question, maybe for Wahid. Wahid, could you guys talk about your   view of DoD autonomy efforts and kind of how you see that? There   is a big push toward autonomy in DoD these days, it seems like,   and a lot of it is kind of wrapped up in UAVs. And I'm just   wondering how you guys are approaching that? A lot of DARPA money   -- a lot of research lab money is going toward. And I'm wondering   if you guys feel like you have to spend a lot on IR&D to kind   of stay in touch with that trend or not, or maybe look at M&A   to complement, we already have? I'm just wondering what your   thoughts are with regard to kind of where things are headed?  Wahid Nawabi    --   President and Chief Executive Officer  Sure, Steve -- Pete, I'm sorry. So absolutely we're right in   the middle of all of that. If you recall from previous       earnings call    s and discussions that I've had in different investor   conferences, our systems already today include a very heavy dose   of -- some level of autonomy and automatic flight and planning in   mission execution to begin with. Number two, if you recall from our las   t earnings    call, we have expanded our footprint geographically with an   innovation center in our New England facility, near Boston area,   as well as one in Midwest. And one of the primary reasons for   that was to continue to expand and grow our team of talented   scientists and engineers in the field of autonomy automatic   flight missions and also software analytics. It is one of the   four future defining technologies as part of our capabilities and   our roadmap. And we believe that in a long run, this continue --   will continue to be a very strong driver of differentiation   between our systems and other systems that are in the market   today and will be in the future. Lastly, I would say that we have been investing in this area   for a number of years and we continue to invest at a very healthy   dose. And we're also very open to non-organic complements or   supplementation of capability in this space, if we can find them   where it makes sense for the right price and timing. So your   observation is very accurate and we're on track with that. And   we're very pleased with our results and our performance so   far.  Pete Skibitski    --   Alembic Global Advisors -- Analyst  Okay. I appreciate the color, guys.  Wahid Nawabi    --   President and Chief Executive Officer  Thank you, Pete.  Steven A. Gitlin    --   Vice President of Investor Relations  Thanks, Pete. And our next question comes from Ken Herbert at   Canaccord Genuity.  Ken Herbert    --   Canaccord Genuity Inc. -- Analyst  Hi, good afternoon, everybody.  Steven A. Gitlin    --   Vice President of Investor Relations  Ken, are you there? We seem to have lost the connection with   Ken. So why don't we move on to Joe DeNardi at Stifel. And Ken   can come back into the queue, we'll be happy to answer his   questions. Joe?  Joseph DeNardi    --   Stifel, Nicolaus & Company, Inc. -- Analyst  Yes. Thanks. Thanks, Steve, and thanks for the slides this   evening, they were helpful.  Steven A. Gitlin    --   Vice President of Investor Relations  You're welcome, Joe.  Joseph DeNardi    --   Stifel, Nicolaus & Company, Inc. -- Analyst  Wahid, you mentioned the better visibility into TMS, it sounds   like given the three-year award you're expecting. So can you talk   about what that visibility provides you with, maybe the size of   the award you're expecting? Does that visibility suggest growth   from that program for you, just kind of the LMAMS or Switchblade   specifically, not the variance that you have within TMS?  Wahid Nawabi    --   President and Chief Executive Officer  Sure, Joe. So as I mentioned in my remarks, we -- the U.S.   government has publicly announced that they are going to engage   in a -- roughly, it's a three-year timeline contract, first year   sole source and then two additional years of auctions of sole   source. And it's primarily for the LMAMS requirements, which   essentially our Switchblade -- the original Switchblade has been   and continues to be the standard -- de facto standard solution   offering for the U.S. Military. We're actively involved with that customer. This is consistent   with what I've said to all of you before in the several quarters   in the past that we're working with our customer. And it's also   very consistent with the government appropriations budgets that   are reflected in the government fiscal year '19 budgets of over   $110 million for this capability, as well as on the proposed   budget for fiscal '20 of approximately $80 plus million. So we expect this to be essentially a contract that covers   that umbrella of requirements. Obviously, we will not stop there   and we continue to work with our customers. We believe that this   capability is differentiating. And we'll continue to see quite   strong demand and signs from our customers in terms of their   satisfaction, as well as this capability for war fighters. With that, I'm confident in our ability to continue to   delivering results, and that supports our current fiscal year   expectations, and our long-term value creation objectives that we   set for ourselves.  Joseph DeNardi    --   Stifel, Nicolaus & Company, Inc. -- Analyst  Okay. And then just on TMS revenues in the quarter, the $5.6   million, that's pretty light relative to where that's been last   year or recently. So can you just maybe speak to that? And then,   also just kind of the breakdown maybe between the TMS in terms of   how much is Switchblade or LMAMS related versus some of the   variance, customer funded R&D, just so we can get a sense for   kind of the magnitude of the opportunity there as I think you   guys are pretty excited about some of the larger variance you're   developing? Thank you.  Wahid Nawabi    --   President and Chief Executive Officer  Sure, Joe. So the TMS revenue, as you know, it's quite lumpy   in size based on timing. If you look at it any specific interval   of a quarter, it usually does not tell the whole story or a good   picture of the entire revenue or that -- story of that business   in that product line. So from time-to-time based on the timing of   the contract award in execution of our programs, we will see   upward down numbers in that regard. However, if you look at it   historically, we have demonstrated to grow that business and   we're preparing your production right now to get ready for the   very large contract award potential that we're working with our   customer that could be in the tune of $3 plus million or $3   million that I mentioned just earlier. Now, in regards to the mix of that revenue, we don't really   break down our revenue by product specifically on product line   basis. But at any given time, we have a mix of both product   revenue that we deliver from our original Switchblade, as well as   services revenue for sustainment as well as development of new   and next generation variance. One of those variance, which I   spoke about last quarter, we're very excited about and so our   customers. We're engaged with our customers. We're well into the   development of that effort. And we will continue to make progress   on that. I will update you as we have more information available   in the upcoming quarters. So that's the nature of the -- color of   our TMS business and the Switchblade revenue for this quarter   versus the entire year.  Steven A. Gitlin    --   Vice President of Investor Relations  And we'll go back to Ken Herbert. Ken, hopefully you're on a   connection that will sustain to the conversation. Please ask your   question.  Ken Herbert    --   Canaccord Genuity Inc. -- Analyst  Yes. Hi. Can you hear me?  Steven A. Gitlin    --   Vice President of Investor Relations  Yes, we can.  Ken Herbert    --   Canaccord Genuity Inc. -- Analyst  Great. Thanks, Steve, Teresa, and Wahid. I just wanted to ask   a couple of questions on the HAPS program. And first Wahid, with   the recent approval or certification for the testing to begin and   what you talked about in Hawaii, can you provide any more detail   on timing that we should expect across the fiscal year around the   flight test program, and what are some of the next important   milestones you're focused on there?  Wahid Nawabi    --   President and Chief Executive Officer  Sure, Steve -- sure, Ken. So in terms of the HAPS, we're very   excited about this growth opportunity in general as you know. And   we're making very, very expedite -- expeditious or an expedite   progress in this product line and in this program. In terms of   our ability to develop and demonstrate this capability in the   market in about two-year timeframe, number one. Number two, we've had a couple of announcements as you notice   and it's in our materials that we published this quarter in our   earnings release. We have received the approval from flight   operations and testing in Lanai, Hawaii. And obviously, before we   do that in Lanai, Hawaii, we've already started ground testing   here in our California facility, and we continue to conduct those   testings and flight testings as we progress. Unfortunately, we're not in a position to be able to disclose   any of the specific details yet. But this is the first phase of a   multi-phase building of a very large business for AeroVironment   long-term. We are in the phase of design, development and   demonstration, and then followed by testing and certification,   and then followed by the business launch, which we will actually   fly airplanes that certified in the airspace. So we're well into the final stages of what I call design,   development and testing. And then once we have more significant   news, we will update you on that. But our progress to date is   very promising and our progress and our partner are looking   forward to this great opportunity long-term.  Ken Herbert    --   Canaccord Genuity Inc. -- Analyst  Okay. And of the $46 million or $45 million -- $44.5 million   that's left to be recognized as part of what's been I guess set   aside both funded and unfunded, do you expect to see all of that   in fiscal '20? And how much of that is actually yet to be funded?   I think Teresa mentioned, there was a part of it that was still   unfunded?  Wahid Nawabi    --   President and Chief Executive Officer  Yes. So let me take a part of your question and I will let   Teresa answer the other part as well. In terms of the program,   our contract with our partner and HAPSMobile Inc., is really has   a lot of flexibility and our ability to be able to execute on the   outcomes of this program. So we've intentionally structured that   contract such that as we progress through this development phase   of a very difficult and complex project that we can make   adjustments with our partner. As you've seen, the total value of   that contract inception to date has significantly increased since   the inception, number one, the original contract value. Number two, we have continued to deliver quite a significant   amount of revenue in the last several quarters from it. This   year, again, still this is though development and design and   development and testing, it's not really a production contract   yet. The airplane is not ready for production yet. So we don't   expect significant increases in that regard in terms of the   short-term revenue profile. And we expect HAPSMobile to continue   to work with us to execute this program successfully as we   progress. In terms of what percentage of that is unfunded, I'll ask   Teresa to weigh in [Indecipherable]  Teresa Covington    --   Senior Vice President and Chief Financial Officer  Yes. So Ken, as I talked about in my prepared remarks, the   revenue perhaps in Q1 was $12.3 million, and we currently have   $44.5 million remaining on the contract portion of which is   unfunded. We don't break out our backlog in funded and unfunded   by contract. But as noted, our total funded backlog was $165   million at the end of Q1. And in our visibility, we talked that   we expected $150 million of that -- anticipate that in revenue in   fiscal 2020. In our unfunded, in our visibility we expect $15   million of our unfunded to be -- anticipate that as revenue in   fiscal 2020.  Steven A. Gitlin    --   Vice President of Investor Relations  Now we invite Peter Arment from Baird to ask the next   question. Peter?  Peter Arment    --   Robert W. Baird & Co. -- Analyst  Yes. Thanks, Steve. Good morning -- good afternoon, Wahid and   Teresa. Thanks for the charts also. Just circling back to Joe's   question on TMS, Wahid you mentioned, now that you've got   potentially, a lot of visibility here for this award. What sort   of capex or investment spending is required here for you to stand   up to support that volume?  Wahid Nawabi    --   President and Chief Executive Officer  Sure. So Peter, what we shared with you today and the   government is publicly announced or is disclosed is very   consistent with what we have said in the past several quarters   that are looking forward and we're engaged with our customers in   this front. We believe that our TMS product line is a very   compelling -- has a very compelling value proposition to our   customers' unique problems. And so we are really looking forward   to executing that. And we expect that to sometimes could   transition into a contract in our fourth fiscal quarter of this   year. In terms of cap expenditures, I'll let Teresa comment on it.   But I don't think we're expecting anything substantially   different in that regard. But Teresa will comment on   specifics.  Teresa Covington    --   Senior Vice President and Chief Financial Officer  Yes. So Peter, as I commented in the first quarter, we spent   about $1.9 million on capital. But at least in fiscal 2020,   specifically for TMS, there is not an expectation of unusually   large amount of capital in 2020 related to what we talked about   closing on that contract in the fiscal fourth quarter.  Peter Arment    --   Robert W. Baird & Co. -- Analyst  Yes.  Wahid Nawabi    --   President and Chief Executive Officer  And that's primarily Peter because it's our -- this is the   original Switchblade now, the other variance that this particular   requirement and customer acquisition is all about, which we have   invested in the past and now obviously delivering based on those   contracts.  Peter Arment    --   Robert W. Baird & Co. -- Analyst  No, that's very helpful. And just as a follow-up. So you   mentioned the product revenue mix was 76% this quarter. And the   second half of this fiscal year, you're expecting a much -- a   different change in that mix. So are we going to go back to kind   of that lower 60%-ish total that you've seen in previous   quarters. Just trying to get a better understanding for what the   gross margins are going to look like in the second half.   Thanks.  Wahid Nawabi    --   President and Chief Executive Officer  Sure. So Peter, in terms of our visibility for the rest of the   year, as I mentioned in my remarks, we expect the revenue in the   first half to be about 45% of total full year revenue, number   one. Number two, we do expect the gross margins to compress in   the second half or the next three quarters, primarily because of   the change in mix, as we change both from a product mix   perspective, as well as on services versus product mix as   well. And Teresa, you have any specific to add?  Teresa Covington    --   Senior Vice President and Chief Financial Officer  Yes. We haven't talked about in the guidance like what   percentage. In fiscal 2019, our product revenue was -- for the   year was 67% of the total. In the first quarter, we were at 76%.   So we obviously expect that percentage to go down in future   quarters. But we haven't specifically said what we expect for the   full year.  Peter Arment    --   Robert W. Baird & Co. -- Analyst  Yes.  Steven A. Gitlin    --   Vice President of Investor Relations  And our next question comes from Louie Dipalma at William   Blair. Louie?  Louie DiPalma    --   William Blair -- Analyst  Good afternoon, Wahid, Teresa, and Steve.  Steven A. Gitlin    --   Vice President of Investor Relations  Hello, Louie. How are you?  Louie DiPalma    --   William Blair -- Analyst  Great. As a follow-up on the various army Switchblade   questions. Do you expect that the total ceiling amount of the   three-year contract assuming the exercise of the two ladder   options will include the full amount of the fiscal '19 and the   fiscal '20 budget, or are you just assuming the fiscal '19   budget?  Wahid Nawabi    --   President and Chief Executive Officer  So Louie, we are working with our customer to put in place a   contract vehicle that allows us to provide this capability to our   customers for the customers intend to three years. So overall it   would seem to me based on our engagements with our customer that   the government's intent is consistent with that approach. What it   ends up being really -- no one can really tell until it's   complete. However, our belief is that since our customer expects   us to continue to deliver this capability, and there is budget   already in government fiscal year '19, and there's proposed   funding for government fiscal year '20, we believe that the   customers interested in putting a contract -- that vehicle in   place that allows them to procure products on a sole source basis   for a three-year full contract term. So -- and we'll keep you updated as that goes forward in the   future. In the meantime, we're very confident in the capability   of this solution set, and our ability to be able to execute our   plan as we stated our -- reiterated our guidance for this   year.  Louie DiPalma    --   William Blair -- Analyst  Okay. And related to this, Congress is working on a two-year   budget. Do you have any sense what the fiscal 2021 budget would   apply for the LMAMS and would that be possible for the fiscal   2021 to be also incorporated in this three-year contract   framework?  Wahid Nawabi    --   President and Chief Executive Officer  We are not in a position to be able to disclose anything that   our customers have not disclosed yet, Louie, on that front,   specifically related to the fiscal year '21. However, that is a   likely situation that if there is a -- A, there is a big if.   There is a two-year government DoD budget approval that then our   customers' expectation or plans for having a three-year contract   in place could potentially and theoretically cover the government   for three years. But it is -- there is no real indicators to be   able to say anything more than what I just described right now in   terms of the true likely outcome.  Steven A. Gitlin    --   Vice President of Investor Relations  And our next question will come from Joe DeNardi returned to   the queue. Joe?  Joseph DeNardi    --   Stifel, Nicolaus & Company, Inc. -- Analyst  Yes. Thanks. Wahid, I think the environment historically has   been reluctant to provide a longer term financial targets because   there was limited visibility. But when you think about kind of   the visibility you have into TMS now and HAPS, it seems like you   have better visibility now than you have historically. So can you   talk about when you think you might be in a position to provide   some longer term targets? And as you make this transition on   HAPS, do you think you can still grow revenue because it seems   like that and Switchblade maybe working against you a little bit,   just given what the budgets for LMAMS look like.  Wahid Nawabi    --   President and Chief Executive Officer  Sure, Joe. So as I've stated in the remarks, we have already   demonstrated in the last two consecutive years that we can grow   our business and we have grown our business, top line   double-digit profitably in two consecutive years. And this is --   well with their current guidance at the midpoint of our revenue   guidance range, this would mark essentially the third consecutive   year of double-digit top line growth. And that's actually with   our current portfolio of businesses and have still being a design   and development phase program, number one. Number two, I'm very pleased with the results that our team   delivered this quarter and how it sets us up for the remainder of   this fiscal year. As you know we don't provide guidance beyond   this calendar -- fiscal year and we will do so for the next year   on our fourth quarter fiscal quarter earnings call. Lastly, I   would say that, we're executing our strategy. And our strategy is   yielding great in outstanding results. We have very high backlog   in terms of visibility, as Teresa outlined earlier. We've got a   very strong start from our first quarter. And in terms of revenue   as well as profitability, we're growing our business in a very   exciting category -- categories that we play in. At the same   time, our business offers and our strategy lend itself to a very   long-term value creation strategy for shareholders. We're focused   not only on the short term, but also on a very long-term   basis. And many of our investments that we've made over the last   several years is already paying off now and it will continue to   pay off in the long run handsomely. So we'll keep you updated and   provide you as much visibility as we can possibly can provide you   based on the information that we have in our hands.  Joseph DeNardi    --   Stifel, Nicolaus & Company, Inc. -- Analyst  Yes. That's fair, Wahid. I mean, just given your expectation   that the -- you get the $110 million in funding as a -- or this   three year order by -- in sometime in your fiscal fourth quarter,   is it fair to say that there is not much in your revenue this   year associated with the $110 million in funding that, that   should really start to benefit you guys in your FY '21?  Wahid Nawabi    --   President and Chief Executive Officer  Well, yes and no. Some of it probably will end up in our   fiscal year and some of it will not end up in our fiscal year,   primarily because of the new ASC 606 accounting standard as to   how revenues recognized based on timing point revenue versus end   time revenue definitions.  Teresa Covington    --   Senior Vice President and Chief Financial Officer  Over time.  Wahid Nawabi    --   President and Chief Executive Officer  Over time, I'm sorry, revenue definitions. So some of it could   fall and may fall onto this year, and we'll keep you updated on   that as we progress throughout the year. But the key message   there is that, our customers working with us and we're working   with our customer to secure a multi-year contract for the   procurement of this capability. And there is dollars in   government fiscal year '19 budget over a $110 million, and an   additional $80 plus million in the proposed fiscal '20 budget. So   that -- those dollars are already known and they represent about   $180 plus million worth of demand for our original Switchblade   alone for this foreseeable future.  Steven A. Gitlin    --   Vice President of Investor Relations  [Operator Instructions] We'll take a question now again from   Ken Herbert of Canaccord. Ken?  Ken Herbert    --   Canaccord Genuity Inc. -- Analyst  Yes. Hi. Just a follow-up. It seems like you had good success   Wahid in smoothing out the top line and the revenues across the   quarters. But I'm just wondering if you can talk about your   ability, your -- or efforts to do the same thing with cash flow   because historically you've generated a significant amount of   your cash in the fourth quarter or second half of the fiscal   year. It seems like you again this quarter had a fair amount of   working capital build. Can you just talk about the cadence of   cash flow through the quarter, or any steps you're doing to maybe   better flow that across the fiscal year?  Wahid Nawabi    --   President and Chief Executive Officer  Sure, Ken. So -- again, we're very pleased with the   outstanding results that our team delivered this quarter and   setting us up for the remainder of our year. We also believe that   we're very confident in our ability to continue to delivering the   results that we expect out of ourselves, both short-term and   long-term. To your point, we have made a very strong effort over   the last two years to try to smoothen out the revenue, as you've   seen the results last fiscal year, and you have heard me this   fiscal year also, we expect the results to be about fairly evenly   distributed throughout the quarters. In terms of cash flow, it's really -- the challenge there is   based on the nature of our business. Our business is really lumpy   in size of contracts. And the type of contracts makes the time of   recognizing the revenue and the cash that flows through the   financial statements versus when we actually invest in building   it, and when we actually receive the dollars and when be collect   the invoices. So we absolutely have efforts to make that smoother   as much as we can. At the same time, we put a high priority on   our customers' needs and we try our best to make sure the first   we satisfy our customers' needs and then we also manage the   business effectively at the same time. Teresa, anything you'd like to add?  Teresa Covington    --   Senior Vice President and Chief Financial Officer  And Ken, as I noted in my remarks, also in the first quarter,   a portion of our cash we used for the acquisition of Pulse   Aerospace, as well as some additional investment in the   HAPSMobile joint venture.  Wahid Nawabi    --   President and Chief Executive Officer  So those two affected the cash flow in the first quarter.  Ken Herbert    --   Canaccord Genuity Inc. -- Analyst  Okay. Thank you.  Wahid Nawabi    --   President and Chief Executive Officer  You're welcome.  Steven A. Gitlin    --   Vice President of Investor Relations  Do you have a follow-up, Ken?  Ken Herbert    --   Canaccord Genuity Inc. -- Analyst  No, that was it. Thank you.  Steven A. Gitlin    --   Vice President of Investor Relations  Okay. Thank you very much. And that was our last question. We   thank you all for your attention and for your interest in   AeroVironment. An archived version of this call, all SEC filings   and relevant Company and industry news can be found on our   website avinc.com. We look forward to speaking with you again   following next quarter's results. And we wish you a good   afternoon.  Duration: 48 minutes  Call participants:  Steven A. Gitlin    --   Vice President of Investor Relations   Wahid Nawabi    --   President and Chief Executive Officer   Teresa Covington    --   Senior Vice President and Chief Financial Officer   Pete Skibitski    --   Alembic Global Advisors -- Analyst   Ken Herbert    --   Canaccord Genuity Inc. -- Analyst   Joseph DeNardi    --   Stifel, Nicolaus & Company, Inc. -- Analyst   Peter Arment    --   Robert W. Baird & Co. -- Analyst   Louie DiPalma    --   William Blair -- Analyst   More AVAV analysis   All earnings call transcripts        10 stocks we like better than AeroVironment     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and   AeroVironment wasn't one of them! That's right --   they think these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     recommends AeroVironment. The Motley Fool has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " Aerovironment Inc    (NASDAQ: AVAV)        Q1 2020 Earnings Call       Sep 4, 2019 ,   4:30 p.m. ET ",
    " Steven A. Gitlin    --   Vice President of Investor Relations ",
    "Good afternoon, ladies and gentlemen, and welcome to   AeroVironment's First Quarter Fiscal Year 2020 Earnings Call.   This is Steven Gitlin, Vice President of Investor Relations for   Aerovironment. At this time, all participants are in a   listen-only mode. We will conduct a question-and-answer session   after management's remarks.",
    "As a reminder, this conference is being recorded for replay   purposes. Before we begin, please note that on this call, certain   information presented contains forward-looking statements within   the meaning of the Private Securities Litigation Reform Act of   1995. Forward-looking statements include, without limitation, any   statement that may predict, forecast, indicate or imply future   results, performance or achievements and may contains words such   as believe, anticipate, expect, estimate, intend, project, plan   or words or phrases with similar meaning.",
    "Forward-looking statements are based on current expectations,   forecasts and assumptions that involve risks and uncertainties,   including but not limited to, economic, competitive, governmental   and technological factors outside of our control that may cause   our business strategy or actual results to differ materially from   the forward-looking statements. For further information on these   risks, we encourage you to review the risk factors discussed in   AeroVironment's periodic reports on Form 10-K and Form 10-Q filed   with the SEC, and the Form 8-K filed today with the SEC, along   with the associated earnings release and the safe harbor   statement contained therein.",
    "This afternoon we also filed a slide presentation with our   earnings release and posted a presentation on our website at   avinc.com, in the Events and Presentations section. The content   of this conference call contains time-sensitive information that   is accurate only as of today, September 4, 2019. The Company   undertakes no obligation to make any revision to any   forward-looking statements contained in our remarks today or to   update them to reflect the events or circumstances occurring   after this conference call.",
    "Joining me today from AeroVironment are President and Chief   Executive Officer, Mr. Wahid Nawabi; and Senior Vice President   and Chief Financial Officer, Mrs. Teresa Covington.",
    "We will now begin with remarks from Wahid Nawabi. Wahid?",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "Thank you, Steve, and welcome to our first quarter fiscal year   2020       earnings conference call    . Today, I will refer to the supplemental charts, we filed with   our earnings release and posted to our website to highlight   important messages.",
    "On today's call, I will emphasize three key messages that   appear on Slide number 3 of our supplemental charts. First, our   team delivered outstanding first quarter results. Second, we're   successfully executing our plan and remain on track to achieve   our fiscal year 2020 objectives. And third, we continue to make   great progress on our strategic growth initiatives. I will start   by summarizing our outstanding first quarter fiscal year 2020   performance and discuss our key achievements during the quarter.   Next Teresa will provide a more detailed summary of financial   performance in the quarter, and I will discuss our goals for   fiscal year 2020 before Teresa, Steve and I take your   questions.",
    "Now for our first quarter fiscal year 2020 financial   highlights. Once again, outstanding financial results reflect our   team's focused execution and the sustained market demand for our   solutions. Key highlights of our strong first quarter results   summarized on Page number 4 of our supplemental charts include   the following. Revenue of $86.9 million increased 11% over last   year. Gross profit of $41.3 million increased 27% over last year.   Earnings per diluted share of $0.71 decreased $0.14 from first   quarter of fiscal year 2019 diluted EPS of $0.85. Non-GAAP   earnings per diluted share of $0.74 increased $0.15 over first   quarter of fiscal year 2019 non-GAAP diluted EPS of $0.59. Funded   backlog of $165 million increased 5% over last year. We are   continuing a multi-quarter trend of maintaining a high level of   funded backlog as compared to our historical averages.",
    "Favorable revenue mix and higher volume contributed to strong   quarter profit as illustrated on Slide number 6 with a higher   proportion of product versus service revenue. Our strong funded   backlog supports a high level of visibility, which Teresa will   detail shortly.",
    "In addition to strong financial results, our team made great   progress across our business as highlighted on Slide number 5. We   remain the global leader in small UAS for the defense market and   for fixed wing solutions in particular. In the first quarter, we   received a $45 million contract award from the U.S. Army for   Raven systems that was included in government fiscal year 2019   appropriations. This award supports the Army's Security Force   Assistance Brigades referred to us SFAB. These specialized army   units conduct training, advising, assisting, enabling and   accompanying operations with allied and partner nations. Exposing   more allied and partner nations to the effectiveness of our Raven   systems helps expand awareness and promote further adoption of   our solutions.",
    "The Army and it's SFAB organization are engaged in a   modernization program to provide soldiers with the latest and   most capable tools. In the selection of our Raven system serves   as further evidence of AeroVironment's leadership position in   this market and our advanced capabilities. The U.S. Military and   more than 45 allied nations continue to view AeroVironment's   family of small UAS as the premier fixed wing solution and the   category with a track record of reliability, effectiveness and   ruggedness demonstrated around the world. We are actively   pursuing a number of international procurement opportunities and   look forward to providing more information when we are able   to.",
    "We're excited to count our new VAPOR unmanned helicopter   systems as part of our family of small UAS. Our team is on track   to fulfill to more than $13 million IDIQ contract for defense   customer, while also engaging with other customers to market this   capability.",
    "And our Tactical Missile Systems product line, the government   recently announced the U.S. Army's intent to award a sole source   Switchblade hardware production contract to Aerovironment for   government fiscal years 2020 through 2022. The performance period   includes one 12-month base period and two 12-month options. We   anticipate receiving this contract award by our fourth fiscal   quarter. And federal government fiscal year 2019 defense   appropriations $110 million and funding was specified for LMAMS,   or Lethal Miniature Aerial Missile Systems, and $83 million have   been proposed as part of the government fiscal year 2020 budget   request.",
    "On Slide number 7, we illustrate the primary AeroVironment   components of U.S. government fiscal year 2019 procurement   appropriations and which of those have already converted to   orders. Past awards have demonstrated that government fiscal year   appropriations can be spend in subsequent fiscal years. We are   preparing our production line based on communication with our   customer and anticipated contract timing.",
    "And our HAPS program summarized on Slide number 8. We continue   to make great progress toward the goal of helping to bridge the   worlds digital divide by manufacturing, supplying and supporting   solar HAPS UAS for HAPSMobile Inc. In August, HAPSMobile   announced, it received FAA authorization for flight testing in   Lanai, Hawaii, paving the way for the initiation of our high   altitude flight test program. Before operating in Lanai, we are   conducting ground and flight testing in California. We look   forward to providing you more updates as we continue to make   progress in this exciting and large growth opportunity.",
    "Now Teresa will provide a detailed financial overview of our   first quarter. Teresa?",
    " Teresa Covington    --   Senior Vice President and Chief Financial Officer ",
    "Thank you, Wahid, and good afternoon, everyone. We had a   strong financial performance in the first quarter of fiscal 2020.   Revenue from continuing operations for the first quarter fiscal   2020 was $86.9 million, an increase of $8.9 million or 11% from   the first quarter of fiscal 2019 revenue of $78 million. The   increase was due to an increase in product deliveries of $10.5   million, partially offset by a decrease in service revenue of   $1.7 million.",
    "First quarter of fiscal 2020 revenue by major product   line/program is as follows, small UAS was $66.7 million or 77%,   HAPS was $12.3 million or 14%, TMS was $5.6 million or 6%, and   other was $2.2 million or 3%. The inception to-date revenue for   HAPSMobile is $89.8 million. The total value of all contracts   with HAPSMobile is $134.4 million, which consist of $125.7   million for the design development agreement and $8.7 million for   preliminary design and other related efforts. There is $44.5   million remaining on these contracts, which includes a portion   that is currently unfunded.",
    "Gross margin from continuing operations for the first quarter   of fiscal 2020 was $41.3 million or 47% of revenue compared to   $32.6 million or 42% of revenue for the first quarter of fiscal   2019. The increase in gross margin was primarily due to an   increase in product margin of $9.9 million, partially offset by a   decrease in service margin of $1.2 million. Gross margin as a   percentage of revenue increased to 47% from 42%, primarily due to   a favorable product mix and an increase in the proportion of   product revenue to total revenue. Product sales were 76% of total   sales in the first quarter fiscal 2020 compared to 71% for the   first quarter of fiscal 2019.",
    "Looking at the rest of the income statement, SG&A expense   from continuing operations for the first quarter of fiscal 2020   was $13.7 million or 16% of revenue compared to SG&A expense   of $12 million or 15% of revenue for the first quarter of fiscal   2019. R&D expense from continuing operations for the first   quarter of fiscal 2020 was $8.7 million or 10% of revenue   compared to R&D expense of $6.4 million or 8% of revenue for   the first quarter of fiscal 2019.",
    "Income from continuing operations for the first quarter of   fiscal 2020 was $18.9 million compared to $14.2 million for the   first quarter of fiscal 2019. The increase in income from   operations was primarily due to an increase in gross margin of   $8.7 million, partially offset by an increase in R&D expense   of $2.3 million and an increase in SG&A expense of $1.7   million.",
    "Net other income for the first quarter of fiscal 2020 was $1.7   million compared to net other income of $9.3 million for the   first quarter of fiscal 2019. The decrease in net other income   was primarily due to a one-time gain from a litigation settlement   during the first quarter of fiscal 2019.",
    "The effective income tax rate from continuing operations was   10.4% for the first quarter of fiscal 2020 compared to an   effective income tax rate of 10.9% for the first quarter of   fiscal 2019. Equity method investment activity, net of tax for   the first quarter of fiscal 2020 was a loss of $1.3 million or   $0.06 per diluted share compared to a loss of $0.6 million net of   tax for the first quarter of fiscal 2019.",
    "Net income from continuing operations attributable to   AeroVironment for the first quarter of fiscal 2020 was $17.1   million or $0.71 per diluted share compared to a net income from   continuing operations attributable to AeroVironment of $20.3   million or $0.85 per diluted share for the first quarter of   fiscal 2019. Non-GAAP diluted earnings per share for the first   quarter of fiscal 2020 was $0.74 per diluted share and exclude   $0.03 per diluted share for the deal, integration costs and   intangible amortization expense associated with our recent   acquisition of Pulse Aerospace.",
    "Non-GAAP diluted earnings per share for the first quarter of   fiscal 2019 was $0.59 per diluted share and excludes the $0.26   per diluted share gain from a one-time litigation settlement. Our   funded backlog as of July 27, 2019, was $165.2 million, an   increase of $8.2 million from the first quarter of fiscal 2019,   and an increase of $0.9 million from the fourth quarter of fiscal   2019 backlog of $164.3 million.",
    "Turning to our balance sheet, cash, cash equivalents,   restricted cash and investments at the end of the first quarter   of fiscal 2020 totaled $310.6 million, a decrease of $22 million   from the end of fiscal 2019 cash, cash equivalents, restricted   cash and investments of $332.6 million. The decrease in cash was   primarily related to the Pulse Aerospace acquisition as well as   the increased investment in the HAPSMobile joint venture.",
    "Net accounts receivable, including unbilled receivables and   retention at the end of the first quarter of fiscal 2020 totaled   $90.7 million. The unbilled receivables and retentions balance   was $47.9 million, inclusive of $12.6 million of related party   amount. Total days sales outstanding from continuing operations   for the first quarter of fiscal year 2020 was approximately 90   days compared to 87 days for the fourth quarter fiscal year   2019.",
    "Net inventory at the end of the first quarter fiscal year 2020   was $56.3 million compared to $54.1 million at the end of the   fourth quarter of fiscal year 2019. Days in inventory outstanding   for the first quarter of fiscal year 2020 was approximately 109   days compared to 92 days for the fourth quarter of fiscal year   2019. Accounts payable at the end of the first quarter fiscal   year 2020 was $11.4 million compared to $16 million at the end of   the fourth quarter of fiscal year 2019. Total days payable   outstanding for the first quarter fiscal year 2020 was   approximately 27 days compared to 24 days for the fourth quarter   fiscal year 2019.",
    "Turning to capital expenditures in the first quarter of fiscal   year 2020, we invested approximately $1.9 million in property   improvements and capital equipment for continuing operations, and   recognized $2.1 million of depreciation and amortization   expense.",
    "Now an update to our fiscal 2020 visibility, as highlighted on   Page 9 of the supplemental chart. As of today, we have   year-to-date revenue in fiscal 2020 of $87 million. First quarter   ending backlog that we anticipate to execute in fiscal 2020 of   $150 million. Q2 quarter-to-date bookings that we anticipate to   execute in fiscal 2020 of $18 million. Unfunded backlog from   incrementally funded contracts that we anticipate to recognize   revenue during the balance of the year of $15 million. This adds   up to $270 million or 75% of our fiscal year 2020 midpoint   revenue guidance range.",
    "We anticipate a full year effective tax rate of approximately   11%. This is higher than the fiscal 2019 full year tax rate of   9%, primarily due to anticipated lower excess tax benefits from   equity awards and other tax credit estimate.",
    "Now I'd like to turn things back to Wahid.",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "Thanks, Teresa. Our first quarter results represent a very   strong start to fiscal year 2020. We are executing to our plan   and are on track to achieving our fiscal year 2020 objectives,   and delivering a third consecutive year of profitable   double-digit top line growth. With 75% full year visibility to   the midpoint of our revenue guidance range, we reiterate our   guidance of $350 million to $370 million in revenue, $1.35 to   $1.55 in diluted EPS, and $1.47 to $1.67 in non-GAAP diluted   EPS.",
    "We anticipate first half revenue to represent about 45% of   full year revenue. We expect lower gross margin in the second   half of fiscal year 2020 as a shift in revenue mix is likely to   compress margins. We also plan higher investments in the second   half. Two consecutive years of double-digit profitable top line   growth demonstrate the effectiveness of our past strategic   investments. We expect full year internal R&D spending to be   around 11% of revenue. We have summarized our full fiscal year   2020 financial expectations on Slide number 10 of our   supplemental charts.",
    "Once again, the three key takeaways from our first fiscal   quarter are, first, our team delivered outstanding first quarter   results; second, we are successfully executing our plan and   remain on track to achieve our fiscal year 2020 objectives; and   third, we continue to make great progress on strategic growth   initiatives. I would like to take this opportunity to thank our   employees for their focus and dedication, our customers for   placing their trust in us, and you, our stockholders for your   confidence in our team and our plans. We remain dedicated to   helping you proceed with certainty.",
    "Teresa, Steve and I will now take your questions.",
    " Steven A. Gitlin    --   Vice President of Investor Relations ",
    "Thank you, Wahid. We will now begin the question-and-answer   session. [Operator Instructions] Our first question comes from   Pete Skibitski at Alembic Global. Pete?",
    " Pete Skibitski    --   Alembic Global Advisors -- Analyst ",
    "Hey, good afternoon, guys, nice quarter.",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "Thank you, Pete.",
    " Pete Skibitski    --   Alembic Global Advisors -- Analyst ",
    "I was wondering if we could put maybe a finer point on the   strong gross margins on the product revenue, just -- it sounds   like UAS sales were very strong in the first quarter. And was it,   largely international small UAS revenue that drove the gross   margin strength? And just from the revenue that Teresa talked   about, it sounds like that will tail off the balance of the year,   and that's why gross margins won't be as high the balance of the   year. Am I characterizing that correctly?",
    " Teresa Covington    --   Senior Vice President and Chief Financial Officer ",
    "Pete, if we look at our gross margin, the key drivers that I   have talked about before, really three key drivers. One is the   revenue volume and we had strong revenue volume in the first   quarter. The second one is product versus services mix. And so,   as I've talked about before, our product gross margins are   generally higher than our services margin, very high product   percentage at 76% for the quarter. And the third piece is the mix   difference. So we do have mix differences of our products. So a   combination in the first quarter, all of those were favorable,   the revenue volume, the product as a percentage of the sales and   the mix of products that we had.",
    "Your other question where you talked about, we did have very   strong, a small UAS sales in the first quarter at 66.7 [Phonetic]   that was strong in both domestic and international. So we did   have growth internationally in small UAS and also domestic; most   of the growth was in the domestic side.",
    " Pete Skibitski    --   Alembic Global Advisors -- Analyst ",
    "Okay, interesting. Okay. Let me ask one more top-level   question, maybe for Wahid. Wahid, could you guys talk about your   view of DoD autonomy efforts and kind of how you see that? There   is a big push toward autonomy in DoD these days, it seems like,   and a lot of it is kind of wrapped up in UAVs. And I'm just   wondering how you guys are approaching that? A lot of DARPA money   -- a lot of research lab money is going toward. And I'm wondering   if you guys feel like you have to spend a lot on IR&D to kind   of stay in touch with that trend or not, or maybe look at M&A   to complement, we already have? I'm just wondering what your   thoughts are with regard to kind of where things are headed?",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "Sure, Steve -- Pete, I'm sorry. So absolutely we're right in   the middle of all of that. If you recall from previous       earnings call    s and discussions that I've had in different investor   conferences, our systems already today include a very heavy dose   of -- some level of autonomy and automatic flight and planning in   mission execution to begin with.",
    "Number two, if you recall from our las   t earnings    call, we have expanded our footprint geographically with an   innovation center in our New England facility, near Boston area,   as well as one in Midwest. And one of the primary reasons for   that was to continue to expand and grow our team of talented   scientists and engineers in the field of autonomy automatic   flight missions and also software analytics. It is one of the   four future defining technologies as part of our capabilities and   our roadmap. And we believe that in a long run, this continue --   will continue to be a very strong driver of differentiation   between our systems and other systems that are in the market   today and will be in the future.",
    "Lastly, I would say that we have been investing in this area   for a number of years and we continue to invest at a very healthy   dose. And we're also very open to non-organic complements or   supplementation of capability in this space, if we can find them   where it makes sense for the right price and timing. So your   observation is very accurate and we're on track with that. And   we're very pleased with our results and our performance so   far.",
    " Pete Skibitski    --   Alembic Global Advisors -- Analyst ",
    "Okay. I appreciate the color, guys.",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "Thank you, Pete.",
    " Steven A. Gitlin    --   Vice President of Investor Relations ",
    "Thanks, Pete. And our next question comes from Ken Herbert at   Canaccord Genuity.",
    " Ken Herbert    --   Canaccord Genuity Inc. -- Analyst ",
    "Hi, good afternoon, everybody.",
    " Steven A. Gitlin    --   Vice President of Investor Relations ",
    "Ken, are you there? We seem to have lost the connection with   Ken. So why don't we move on to Joe DeNardi at Stifel. And Ken   can come back into the queue, we'll be happy to answer his   questions. Joe?",
    " Joseph DeNardi    --   Stifel, Nicolaus & Company, Inc. -- Analyst ",
    "Yes. Thanks. Thanks, Steve, and thanks for the slides this   evening, they were helpful.",
    " Steven A. Gitlin    --   Vice President of Investor Relations ",
    "You're welcome, Joe.",
    " Joseph DeNardi    --   Stifel, Nicolaus & Company, Inc. -- Analyst ",
    "Wahid, you mentioned the better visibility into TMS, it sounds   like given the three-year award you're expecting. So can you talk   about what that visibility provides you with, maybe the size of   the award you're expecting? Does that visibility suggest growth   from that program for you, just kind of the LMAMS or Switchblade   specifically, not the variance that you have within TMS?",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "Sure, Joe. So as I mentioned in my remarks, we -- the U.S.   government has publicly announced that they are going to engage   in a -- roughly, it's a three-year timeline contract, first year   sole source and then two additional years of auctions of sole   source. And it's primarily for the LMAMS requirements, which   essentially our Switchblade -- the original Switchblade has been   and continues to be the standard -- de facto standard solution   offering for the U.S. Military.",
    "We're actively involved with that customer. This is consistent   with what I've said to all of you before in the several quarters   in the past that we're working with our customer. And it's also   very consistent with the government appropriations budgets that   are reflected in the government fiscal year '19 budgets of over   $110 million for this capability, as well as on the proposed   budget for fiscal '20 of approximately $80 plus million.",
    "So we expect this to be essentially a contract that covers   that umbrella of requirements. Obviously, we will not stop there   and we continue to work with our customers. We believe that this   capability is differentiating. And we'll continue to see quite   strong demand and signs from our customers in terms of their   satisfaction, as well as this capability for war fighters.",
    "With that, I'm confident in our ability to continue to   delivering results, and that supports our current fiscal year   expectations, and our long-term value creation objectives that we   set for ourselves.",
    " Joseph DeNardi    --   Stifel, Nicolaus & Company, Inc. -- Analyst ",
    "Okay. And then just on TMS revenues in the quarter, the $5.6   million, that's pretty light relative to where that's been last   year or recently. So can you just maybe speak to that? And then,   also just kind of the breakdown maybe between the TMS in terms of   how much is Switchblade or LMAMS related versus some of the   variance, customer funded R&D, just so we can get a sense for   kind of the magnitude of the opportunity there as I think you   guys are pretty excited about some of the larger variance you're   developing? Thank you.",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "Sure, Joe. So the TMS revenue, as you know, it's quite lumpy   in size based on timing. If you look at it any specific interval   of a quarter, it usually does not tell the whole story or a good   picture of the entire revenue or that -- story of that business   in that product line. So from time-to-time based on the timing of   the contract award in execution of our programs, we will see   upward down numbers in that regard. However, if you look at it   historically, we have demonstrated to grow that business and   we're preparing your production right now to get ready for the   very large contract award potential that we're working with our   customer that could be in the tune of $3 plus million or $3   million that I mentioned just earlier.",
    "Now, in regards to the mix of that revenue, we don't really   break down our revenue by product specifically on product line   basis. But at any given time, we have a mix of both product   revenue that we deliver from our original Switchblade, as well as   services revenue for sustainment as well as development of new   and next generation variance. One of those variance, which I   spoke about last quarter, we're very excited about and so our   customers. We're engaged with our customers. We're well into the   development of that effort. And we will continue to make progress   on that. I will update you as we have more information available   in the upcoming quarters. So that's the nature of the -- color of   our TMS business and the Switchblade revenue for this quarter   versus the entire year.",
    " Steven A. Gitlin    --   Vice President of Investor Relations ",
    "And we'll go back to Ken Herbert. Ken, hopefully you're on a   connection that will sustain to the conversation. Please ask your   question.",
    " Ken Herbert    --   Canaccord Genuity Inc. -- Analyst ",
    "Yes. Hi. Can you hear me?",
    " Steven A. Gitlin    --   Vice President of Investor Relations ",
    "Yes, we can.",
    " Ken Herbert    --   Canaccord Genuity Inc. -- Analyst ",
    "Great. Thanks, Steve, Teresa, and Wahid. I just wanted to ask   a couple of questions on the HAPS program. And first Wahid, with   the recent approval or certification for the testing to begin and   what you talked about in Hawaii, can you provide any more detail   on timing that we should expect across the fiscal year around the   flight test program, and what are some of the next important   milestones you're focused on there?",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "Sure, Steve -- sure, Ken. So in terms of the HAPS, we're very   excited about this growth opportunity in general as you know. And   we're making very, very expedite -- expeditious or an expedite   progress in this product line and in this program. In terms of   our ability to develop and demonstrate this capability in the   market in about two-year timeframe, number one.",
    "Number two, we've had a couple of announcements as you notice   and it's in our materials that we published this quarter in our   earnings release. We have received the approval from flight   operations and testing in Lanai, Hawaii. And obviously, before we   do that in Lanai, Hawaii, we've already started ground testing   here in our California facility, and we continue to conduct those   testings and flight testings as we progress.",
    "Unfortunately, we're not in a position to be able to disclose   any of the specific details yet. But this is the first phase of a   multi-phase building of a very large business for AeroVironment   long-term. We are in the phase of design, development and   demonstration, and then followed by testing and certification,   and then followed by the business launch, which we will actually   fly airplanes that certified in the airspace.",
    "So we're well into the final stages of what I call design,   development and testing. And then once we have more significant   news, we will update you on that. But our progress to date is   very promising and our progress and our partner are looking   forward to this great opportunity long-term.",
    " Ken Herbert    --   Canaccord Genuity Inc. -- Analyst ",
    "Okay. And of the $46 million or $45 million -- $44.5 million   that's left to be recognized as part of what's been I guess set   aside both funded and unfunded, do you expect to see all of that   in fiscal '20? And how much of that is actually yet to be funded?   I think Teresa mentioned, there was a part of it that was still   unfunded?",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "Yes. So let me take a part of your question and I will let   Teresa answer the other part as well. In terms of the program,   our contract with our partner and HAPSMobile Inc., is really has   a lot of flexibility and our ability to be able to execute on the   outcomes of this program. So we've intentionally structured that   contract such that as we progress through this development phase   of a very difficult and complex project that we can make   adjustments with our partner. As you've seen, the total value of   that contract inception to date has significantly increased since   the inception, number one, the original contract value.",
    "Number two, we have continued to deliver quite a significant   amount of revenue in the last several quarters from it. This   year, again, still this is though development and design and   development and testing, it's not really a production contract   yet. The airplane is not ready for production yet. So we don't   expect significant increases in that regard in terms of the   short-term revenue profile. And we expect HAPSMobile to continue   to work with us to execute this program successfully as we   progress.",
    "In terms of what percentage of that is unfunded, I'll ask   Teresa to weigh in [Indecipherable]",
    " Teresa Covington    --   Senior Vice President and Chief Financial Officer ",
    "Yes. So Ken, as I talked about in my prepared remarks, the   revenue perhaps in Q1 was $12.3 million, and we currently have   $44.5 million remaining on the contract portion of which is   unfunded. We don't break out our backlog in funded and unfunded   by contract. But as noted, our total funded backlog was $165   million at the end of Q1. And in our visibility, we talked that   we expected $150 million of that -- anticipate that in revenue in   fiscal 2020. In our unfunded, in our visibility we expect $15   million of our unfunded to be -- anticipate that as revenue in   fiscal 2020.",
    " Steven A. Gitlin    --   Vice President of Investor Relations ",
    "Now we invite Peter Arment from Baird to ask the next   question. Peter?",
    " Peter Arment    --   Robert W. Baird & Co. -- Analyst ",
    "Yes. Thanks, Steve. Good morning -- good afternoon, Wahid and   Teresa. Thanks for the charts also. Just circling back to Joe's   question on TMS, Wahid you mentioned, now that you've got   potentially, a lot of visibility here for this award. What sort   of capex or investment spending is required here for you to stand   up to support that volume?",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "Sure. So Peter, what we shared with you today and the   government is publicly announced or is disclosed is very   consistent with what we have said in the past several quarters   that are looking forward and we're engaged with our customers in   this front. We believe that our TMS product line is a very   compelling -- has a very compelling value proposition to our   customers' unique problems. And so we are really looking forward   to executing that. And we expect that to sometimes could   transition into a contract in our fourth fiscal quarter of this   year.",
    "In terms of cap expenditures, I'll let Teresa comment on it.   But I don't think we're expecting anything substantially   different in that regard. But Teresa will comment on   specifics.",
    " Teresa Covington    --   Senior Vice President and Chief Financial Officer ",
    "Yes. So Peter, as I commented in the first quarter, we spent   about $1.9 million on capital. But at least in fiscal 2020,   specifically for TMS, there is not an expectation of unusually   large amount of capital in 2020 related to what we talked about   closing on that contract in the fiscal fourth quarter.",
    " Peter Arment    --   Robert W. Baird & Co. -- Analyst ",
    "Yes.",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "And that's primarily Peter because it's our -- this is the   original Switchblade now, the other variance that this particular   requirement and customer acquisition is all about, which we have   invested in the past and now obviously delivering based on those   contracts.",
    " Peter Arment    --   Robert W. Baird & Co. -- Analyst ",
    "No, that's very helpful. And just as a follow-up. So you   mentioned the product revenue mix was 76% this quarter. And the   second half of this fiscal year, you're expecting a much -- a   different change in that mix. So are we going to go back to kind   of that lower 60%-ish total that you've seen in previous   quarters. Just trying to get a better understanding for what the   gross margins are going to look like in the second half.   Thanks.",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "Sure. So Peter, in terms of our visibility for the rest of the   year, as I mentioned in my remarks, we expect the revenue in the   first half to be about 45% of total full year revenue, number   one. Number two, we do expect the gross margins to compress in   the second half or the next three quarters, primarily because of   the change in mix, as we change both from a product mix   perspective, as well as on services versus product mix as   well.",
    "And Teresa, you have any specific to add?",
    " Teresa Covington    --   Senior Vice President and Chief Financial Officer ",
    "Yes. We haven't talked about in the guidance like what   percentage. In fiscal 2019, our product revenue was -- for the   year was 67% of the total. In the first quarter, we were at 76%.   So we obviously expect that percentage to go down in future   quarters. But we haven't specifically said what we expect for the   full year.",
    " Peter Arment    --   Robert W. Baird & Co. -- Analyst ",
    "Yes.",
    " Steven A. Gitlin    --   Vice President of Investor Relations ",
    "And our next question comes from Louie Dipalma at William   Blair. Louie?",
    " Louie DiPalma    --   William Blair -- Analyst ",
    "Good afternoon, Wahid, Teresa, and Steve.",
    " Steven A. Gitlin    --   Vice President of Investor Relations ",
    "Hello, Louie. How are you?",
    " Louie DiPalma    --   William Blair -- Analyst ",
    "Great. As a follow-up on the various army Switchblade   questions. Do you expect that the total ceiling amount of the   three-year contract assuming the exercise of the two ladder   options will include the full amount of the fiscal '19 and the   fiscal '20 budget, or are you just assuming the fiscal '19   budget?",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "So Louie, we are working with our customer to put in place a   contract vehicle that allows us to provide this capability to our   customers for the customers intend to three years. So overall it   would seem to me based on our engagements with our customer that   the government's intent is consistent with that approach. What it   ends up being really -- no one can really tell until it's   complete. However, our belief is that since our customer expects   us to continue to deliver this capability, and there is budget   already in government fiscal year '19, and there's proposed   funding for government fiscal year '20, we believe that the   customers interested in putting a contract -- that vehicle in   place that allows them to procure products on a sole source basis   for a three-year full contract term.",
    "So -- and we'll keep you updated as that goes forward in the   future. In the meantime, we're very confident in the capability   of this solution set, and our ability to be able to execute our   plan as we stated our -- reiterated our guidance for this   year.",
    " Louie DiPalma    --   William Blair -- Analyst ",
    "Okay. And related to this, Congress is working on a two-year   budget. Do you have any sense what the fiscal 2021 budget would   apply for the LMAMS and would that be possible for the fiscal   2021 to be also incorporated in this three-year contract   framework?",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "We are not in a position to be able to disclose anything that   our customers have not disclosed yet, Louie, on that front,   specifically related to the fiscal year '21. However, that is a   likely situation that if there is a -- A, there is a big if.   There is a two-year government DoD budget approval that then our   customers' expectation or plans for having a three-year contract   in place could potentially and theoretically cover the government   for three years. But it is -- there is no real indicators to be   able to say anything more than what I just described right now in   terms of the true likely outcome.",
    " Steven A. Gitlin    --   Vice President of Investor Relations ",
    "And our next question will come from Joe DeNardi returned to   the queue. Joe?",
    " Joseph DeNardi    --   Stifel, Nicolaus & Company, Inc. -- Analyst ",
    "Yes. Thanks. Wahid, I think the environment historically has   been reluctant to provide a longer term financial targets because   there was limited visibility. But when you think about kind of   the visibility you have into TMS now and HAPS, it seems like you   have better visibility now than you have historically. So can you   talk about when you think you might be in a position to provide   some longer term targets? And as you make this transition on   HAPS, do you think you can still grow revenue because it seems   like that and Switchblade maybe working against you a little bit,   just given what the budgets for LMAMS look like.",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "Sure, Joe. So as I've stated in the remarks, we have already   demonstrated in the last two consecutive years that we can grow   our business and we have grown our business, top line   double-digit profitably in two consecutive years. And this is --   well with their current guidance at the midpoint of our revenue   guidance range, this would mark essentially the third consecutive   year of double-digit top line growth. And that's actually with   our current portfolio of businesses and have still being a design   and development phase program, number one.",
    "Number two, I'm very pleased with the results that our team   delivered this quarter and how it sets us up for the remainder of   this fiscal year. As you know we don't provide guidance beyond   this calendar -- fiscal year and we will do so for the next year   on our fourth quarter fiscal quarter earnings call. Lastly, I   would say that, we're executing our strategy. And our strategy is   yielding great in outstanding results. We have very high backlog   in terms of visibility, as Teresa outlined earlier. We've got a   very strong start from our first quarter. And in terms of revenue   as well as profitability, we're growing our business in a very   exciting category -- categories that we play in. At the same   time, our business offers and our strategy lend itself to a very   long-term value creation strategy for shareholders. We're focused   not only on the short term, but also on a very long-term   basis.",
    "And many of our investments that we've made over the last   several years is already paying off now and it will continue to   pay off in the long run handsomely. So we'll keep you updated and   provide you as much visibility as we can possibly can provide you   based on the information that we have in our hands.",
    " Joseph DeNardi    --   Stifel, Nicolaus & Company, Inc. -- Analyst ",
    "Yes. That's fair, Wahid. I mean, just given your expectation   that the -- you get the $110 million in funding as a -- or this   three year order by -- in sometime in your fiscal fourth quarter,   is it fair to say that there is not much in your revenue this   year associated with the $110 million in funding that, that   should really start to benefit you guys in your FY '21?",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "Well, yes and no. Some of it probably will end up in our   fiscal year and some of it will not end up in our fiscal year,   primarily because of the new ASC 606 accounting standard as to   how revenues recognized based on timing point revenue versus end   time revenue definitions.",
    " Teresa Covington    --   Senior Vice President and Chief Financial Officer ",
    "Over time.",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "Over time, I'm sorry, revenue definitions. So some of it could   fall and may fall onto this year, and we'll keep you updated on   that as we progress throughout the year. But the key message   there is that, our customers working with us and we're working   with our customer to secure a multi-year contract for the   procurement of this capability. And there is dollars in   government fiscal year '19 budget over a $110 million, and an   additional $80 plus million in the proposed fiscal '20 budget. So   that -- those dollars are already known and they represent about   $180 plus million worth of demand for our original Switchblade   alone for this foreseeable future.",
    " Steven A. Gitlin    --   Vice President of Investor Relations ",
    "[Operator Instructions] We'll take a question now again from   Ken Herbert of Canaccord. Ken?",
    " Ken Herbert    --   Canaccord Genuity Inc. -- Analyst ",
    "Yes. Hi. Just a follow-up. It seems like you had good success   Wahid in smoothing out the top line and the revenues across the   quarters. But I'm just wondering if you can talk about your   ability, your -- or efforts to do the same thing with cash flow   because historically you've generated a significant amount of   your cash in the fourth quarter or second half of the fiscal   year. It seems like you again this quarter had a fair amount of   working capital build. Can you just talk about the cadence of   cash flow through the quarter, or any steps you're doing to maybe   better flow that across the fiscal year?",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "Sure, Ken. So -- again, we're very pleased with the   outstanding results that our team delivered this quarter and   setting us up for the remainder of our year. We also believe that   we're very confident in our ability to continue to delivering the   results that we expect out of ourselves, both short-term and   long-term. To your point, we have made a very strong effort over   the last two years to try to smoothen out the revenue, as you've   seen the results last fiscal year, and you have heard me this   fiscal year also, we expect the results to be about fairly evenly   distributed throughout the quarters.",
    "In terms of cash flow, it's really -- the challenge there is   based on the nature of our business. Our business is really lumpy   in size of contracts. And the type of contracts makes the time of   recognizing the revenue and the cash that flows through the   financial statements versus when we actually invest in building   it, and when we actually receive the dollars and when be collect   the invoices. So we absolutely have efforts to make that smoother   as much as we can. At the same time, we put a high priority on   our customers' needs and we try our best to make sure the first   we satisfy our customers' needs and then we also manage the   business effectively at the same time.",
    "Teresa, anything you'd like to add?",
    " Teresa Covington    --   Senior Vice President and Chief Financial Officer ",
    "And Ken, as I noted in my remarks, also in the first quarter,   a portion of our cash we used for the acquisition of Pulse   Aerospace, as well as some additional investment in the   HAPSMobile joint venture.",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "So those two affected the cash flow in the first quarter.",
    " Ken Herbert    --   Canaccord Genuity Inc. -- Analyst ",
    "Okay. Thank you.",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    "You're welcome.",
    " Steven A. Gitlin    --   Vice President of Investor Relations ",
    "Do you have a follow-up, Ken?",
    " Ken Herbert    --   Canaccord Genuity Inc. -- Analyst ",
    "No, that was it. Thank you.",
    " Steven A. Gitlin    --   Vice President of Investor Relations ",
    "Okay. Thank you very much. And that was our last question. We   thank you all for your attention and for your interest in   AeroVironment. An archived version of this call, all SEC filings   and relevant Company and industry news can be found on our   website avinc.com. We look forward to speaking with you again   following next quarter's results. And we wish you a good   afternoon.",
    " Duration: 48 minutes ",
    " Steven A. Gitlin    --   Vice President of Investor Relations ",
    " Wahid Nawabi    --   President and Chief Executive Officer ",
    " Teresa Covington    --   Senior Vice President and Chief Financial Officer ",
    " Pete Skibitski    --   Alembic Global Advisors -- Analyst ",
    " Ken Herbert    --   Canaccord Genuity Inc. -- Analyst ",
    " Joseph DeNardi    --   Stifel, Nicolaus & Company, Inc. -- Analyst ",
    " Peter Arment    --   Robert W. Baird & Co. -- Analyst ",
    " Louie DiPalma    --   William Blair -- Analyst ",
    " More AVAV analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than AeroVironment     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and   AeroVironment wasn't one of them! That's right --   they think these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     recommends AeroVironment. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:23:26"
}