{
  "url": "https://www.nasdaq.com/article/us-stocksfutures-higher-on-news-of-uschina-trade-talks-20190905-00357",
  "title": "US STOCKS-Futures higher on news of U.S.-China trade talks - Nasdaq.com",
  "text": [
    " (For a live blog on the U.S. stock market, click LIVE/ ortype LIVE/ in a news window.)",
    "* Futures up: Dow 0.94%, S&P 0.88%, Nasdaq 1.14% ",
    "By Uday Sampath Kumar",
    "China'sCommerce Ministry said its trade team will holdtalks with their U.S. counterparts in mid-September inpreparation for high level negotiations in early October.  urn:newsml:reuters.com:*:nL3N25W0JF",
    "Shares of chipmakers, sensitive to tariffs, rose inpremarket trading, with Intel CorpINTC.O , Advanced MicroDevices IncAMD.O and Nvidia CorpNVDA.O gaining between1.2% and 2%.",
    "Industrial bellwethers Boeing CoBA.N and Caterpillar IncCAT.N rose over 1% each. ",
    "Apple IncAAPL.O led the FAANG group of stocks higher,gaining 1.1%, while Facebook IncFB.O , Alphabet IncGOOGL.O ,Netflix IncNFLX.O and Amazon.com IncAMZN.O rose between0.8% and 1%.  ",
    "Wall Street came under pressure at the start of the week asBeijing and Washington began slapping tariffs on each other'sgood as well as data that showed a contraction in U.S. factoryactivity in August. ",
    "The trade dispute, which began over a year ago, has dentedglobal economic activity and roiled financial markets. Investorsare now pinning hopes on central banks to step in and easemonetary policy to help boost growth. ",
    "Market participants are currently expecting a quarterpercentage point cut in interest rates by the Federal Reserve atits mid-September meeting. ",
    "At 7:05 a.m. ET, Dow e-minis 1YMcv1 were up 249 points, or0.94%. S&P 500 e-minis EScv1 were up 26 points, or 0.88% andNasdaq 100 e-minis NQcv1 were up 88.25 points, or 1.14%.",
    "Among other stocks, Slack Technologies IncWORK.N fell13.1% after the workplace messaging platform on Wednesdayforecast slowing revenue growth in the second half and abigger-than-expected third-quarter loss. urn:newsml:reuters.com:*:nL3N25V434",
    "While market sentiment this week has largely been driven byglobal trade and political news, investors will likely shifttheir focus to nonfarm payrolls data due on Friday, withanalysts cautioning that any weakness could be a sign of theU.S. economy slowing.",
    "The ADP national employment data, considered a precursor tothe Labor Department's more comprehensive jobs report, isexpected to show private payrolls increased by 149,000 jobs inAugust, after gaining by 156,000 jobs in July. The data is dueat 8:15 a.m. ET.  (Reporting by Uday Sampath in Bengaluru; Editing by ArunKoyyur) ((UdaySampath.Kumar@thomsonreuters.com; within U.S.+1 646 2238780; Twitter: @sampath_uday; Reuters Messaging:UdaySampath.Kumar.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-05 07:28:00"
}