{
  "url": "https://www.nasdaq.com/article/as-trade-war-deepens-a-stateowned-insurer-in-china-helps-soften-the-blow-20190912-00071",
  "title": "As trade war deepens, a state-owned insurer in China helps soften the blow - Nasdaq.com",
  "text": [
    "By Cheng Leng, Samuel Shen and Engen Tham",
    "BEIJING/SHANGHAI, Sept 12 (Reuters) - As the U.S.-China trade war intensifies, an insurance company run by the Chinese government is stepping in to support Chinese exporters, providing low cost coverage and chasing down U.S. importers unwilling or unable to pay mounting tariffs.",
    "China Export & Credit Insurance Corp, known as Sinosure, has aggressively increased its insurance of Chinese exporters since last year, according to company sources and public data.",
    "Sinosure has boosted the number of new clients by thousands since last August, often relaxing its standards to do so, company data and two Sinosure sources familiar with the standards say.",
    "In some cases, local governments are even paying the premiums, the two sources say.",
    "The insurance policies help cushion companies from the risk of export deals collapsing because of elevated duties on goods flowing between the world's No.1 and No.2 economies.",
    "China and the United States have been locked in a tit-for-tat trade showdown for over a year, with the latest increases to tariffs on hundreds of billions of dollars worth of goods taking effect this month. ",
    "Last year, as the trade war started to bite, Sinosure's claim payouts surged more than 40% to nearly $2 billion, according to data from the company, which is owned by an investment company controlled by the finance ministry.",
    "Payouts are poised to climb further this year with tariffs rising, according the company's internal estimates.",
    "The payments stem from what one Sinosure official said was a growing number of U.S. buyers of Chinese goods who were unwilling or unable to pay higher prices for shipped goods. That has left some cargoes stranded at U.S. ports, and Chinese exporters on the hook.",
    "\"We're fulfilling our role as a policy insurer, not a for-profit commercial institution,\" said the official who spoke on the condition of anonymity because he was not authorised to talk to the media.",
    "The Ministry of Finance, the ultimate parent of Sinosure, did not immediately respond to Reuters' requests for comments.",
    "PAYMENT DEMANDS",
    "Eugene Weng, a Shanghai-based attorney who represents Chinese exporters in trade investigations, said it was unclear if Sinosure's practices might trigger WTO scrutiny.",
    "\"But such practice, if widely implemented, carries the risk of violating WTO commitments, and will face challenge from the Office of the United States Trade Representative for sure, as they usually set rules on their own,\" said Weng, from law firm Wintell & Co.",
    "For its part, the Trump administration has provided billions of dollars in subsidies to American farmers affected by Chinese tariffs as it too seeks to cushion the impact of the trade war.",
    "Dan Harris, a lawyer who represents U.S. importers, said he has received increasing requests for help dealing with Sinosure demands for payment on behalf of Chinese exporters.",
    "\"Before the trade war, I might go ... four, five months without getting a Sinosure email, now I'm getting four or five a week,\" said Harris, managing partner at international law firm Harris Bricken.",
    "Sinosure did not respond to Reuters' requests for information about its push to support smaller exporters, but recent figures - some public and others disclosed to Reuters - provide an insight.",
    "In 2018, the total sum insured by Sinosure jumped 16.7% to a record $612 billion, the fastest annual pace in six years. Premium income rose just 6%, reflecting the non-commercial nature of many of Sinosure's insurance policies.",
    "Meanwhile, claims payouts surged 41% to nearly $2 billion, the highest in Sinosure's 18-year history, as loss recovery slumped 32% from the prior year, company disclosures show.",
    "As a result, Sinosure saw its net profit tumble 42% last year to 359 million yuan ($50.5 million). That represents a return on equity of just 0.9%, according to Reuters calculations.",
    "A Sinosure source said the situation has deteriorated in 2019 as the trade war escalates, with the United States by far the biggest source of risk.",
    "NEW EXCUSE",
    "\"Tariff hikes have become a new excuse for U.S. importers to refuse payment,\" Sinosure's subsidiary in China's eastern Fujian province said on Sept. 2, a day after Washington slapped new tariffs on Chinese goods.",
    "In the first half of the year, non-payment cases involving U.S. buyers surged 80% in Fujian, hitting the region's fishing, textile and garment industries, said Sinosure. It has partnered with the local government to offer free insurance for small businesses.",
    "Other cities and regions have also partnered with Sinosure subsidise or refund premiums for smaller exporters exposed to the U.S. tariffs, a Sinosure source said.",
    "Sinosure said it paid $25,000 compensation to a fish exporter in Fujian province this year, after a U.S. buyer refused to pay the full bill for $89,000 worth of yellow croaker fish due to tariff hikes and complaints about the fish quality.",
    "Chinese businessman Xu Aimin, whose Nantong Modern Sporting Industrial Co generates one third of sales from the United States, called Sinosure's product \"a life boat\".",
    "\"Another increase in tariffs is just a tweet away,\" he said, referring to U.S. President Donald Trump's preferred method of communication.",
    "Harris, the lawyer, said many Chinese exporters are looking for new markets.",
    "\"Chinese manufacturers don't want U.S. buyers anymore as they view all of them as having one foot out the door,\" he said.",
    "($1 = 7.1160 Chinese yuan renminbi)"
  ],
  "published_datetime": "2019-09-12 03:01:00"
}