{
  "url": "https://www.nasdaq.com/article/netflix-nflx-gains-but-lags-market-what-you-should-know-cm1207620",
  "title": "Netflix (NFLX) Gains But Lags Market: What You Should Know - Nasdaq.com",
  "text": [
    " In the latest trading session, Netflix (NFLX) closed at $291.52, marking a +0.77% move from the previous day. This change lagged the S&P 500's 1.08% gain on the day. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%. Heading into today, shares of the internet video service had lost 6.71% over the past month, lagging the Consumer Discretionary sector's loss of 1.93% and the S&P 500's loss of 0.68% in that time. Wall Street will be looking for positivity from NFLX as it approaches its nex t earnings  report date. On that day, NFLX is projected to report earnings of $1.05 per share, which would represent year-over-year growth of 17.98%. Meanwhile, our latest consensus estimate is calling for revenue of $5.25 billion, up 31.34% from the prior-year quarter. NFLX's full-year Zacks Consensus Estimates are calling for earnings of $3.26 per share and revenue of $20.22 billion. These results would represent year-over-year changes of +21.64% and +28.01%, respectively. Investors should also note any recent changes to analyst estimates for NFLX. Recent revisions tend to reflect the latest near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook. Based on our research, we believe these estimate revisions are directly related to near-team stock moves. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 0.75% lower. NFLX is holding a Zacks Rank of #3 (Hold) right now. Investors should also note NFLX's current valuation metrics, including its Forward P/E ratio of 88.86. For comparison, its industry has an average Forward P/E of 15.13, which means NFLX is trading at a premium to the group. Also, we should mention that NFLX has a PEG ratio of 2.96. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. Broadcast Radio and Television stocks are, on average, holding a PEG ratio of 1.38 based on yesterday's closing prices. The Broadcast Radio and Television industry is part of the Consumer Discretionary sector. This group has a Zacks Industry Rank of 174, putting it in the bottom 33% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Be sure to follow all of these stock-moving metrics, and many more, on Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Netflix, Inc. (NFLX): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "In the latest trading session, Netflix (NFLX) closed at $291.52, marking a +0.77% move from the previous day. This change lagged the S&P 500's 1.08% gain on the day. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%.",
    "Heading into today, shares of the internet video service had lost 6.71% over the past month, lagging the Consumer Discretionary sector's loss of 1.93% and the S&P 500's loss of 0.68% in that time.",
    "Wall Street will be looking for positivity from NFLX as it approaches its nex t earnings  report date. On that day, NFLX is projected to report earnings of $1.05 per share, which would represent year-over-year growth of 17.98%. Meanwhile, our latest consensus estimate is calling for revenue of $5.25 billion, up 31.34% from the prior-year quarter.",
    "NFLX's full-year Zacks Consensus Estimates are calling for earnings of $3.26 per share and revenue of $20.22 billion. These results would represent year-over-year changes of +21.64% and +28.01%, respectively.",
    "Investors should also note any recent changes to analyst estimates for NFLX. Recent revisions tend to reflect the latest near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.",
    "Based on our research, we believe these estimate revisions are directly related to near-team stock moves. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.",
    "The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 0.75% lower. NFLX is holding a Zacks Rank of #3 (Hold) right now.",
    "Investors should also note NFLX's current valuation metrics, including its Forward P/E ratio of 88.86. For comparison, its industry has an average Forward P/E of 15.13, which means NFLX is trading at a premium to the group.",
    "Also, we should mention that NFLX has a PEG ratio of 2.96. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. Broadcast Radio and Television stocks are, on average, holding a PEG ratio of 1.38 based on yesterday's closing prices.",
    "The Broadcast Radio and Television industry is part of the Consumer Discretionary sector. This group has a Zacks Industry Rank of 174, putting it in the bottom 33% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Be sure to follow all of these stock-moving metrics, and many more, on Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:45:25"
}