{
  "url": "https://www.nasdaq.com/article/garmin-unveils-neo-2t-smart-to-sustain-fitness-momentum-cm1207401",
  "title": "Garmin Unveils NEO 2T Smart to Sustain Fitness Momentum - Nasdaq.com",
  "text": [
    "  Garmin Ltd. GRMN  has rolled out an indoor cycling trainer called NEO 2T Smart from Tacx in a bid to strengthen its fitness product offerings.  makeArticleAd();  We note that the latest product creates indoor training simulation by reacting instantly to speed. Also, it helps in controlling a rider's mass inertia with the help of its dynamic inertia.    Additionally, the product comes with a redesigned rear axle making it compatible with other bikes.    The product leverages Tacx software, which offers more than 100 videos featuring steep hills of the Alps, cobblestone roads of Milan and many more.    Hence, Garmin with the help of the new product will be able to deliver the experience of virtual riding through famous world routes to the cyclists. Moreover, NEO 2T Smart can be synchronized with Zwift app, which will help cyclists experience the feeling of riding on surfaces like cobblestone and gravel.    We believe that the training features and the feeling of virtual riding are likely to deliver enhanced fitness experience to the users. Moreover, these features make the product attractive and will aid in its adoption rate.   Bike Trainer Market Holds Promise    Per a report from Orbis Research, the global indoor bike trainer market is expected to hit $140 million by 2025, by growing at a CAGR of 7.6% between 2018 and 2025.    NEO 2T Smart is equipped with capacitive left and right sensors that measure leg position with accuracy. This helps in improving power distribution and performance of the cyclists.    Further, the bike trainer allows fitness freaks to upload GPS and ride on 3-D maps while creating workouts based on Functional Threshold Power, slope, power and heart rate. Additionally, users can race against live opponents.    Hence, NEO 2T Smart bike trainer makes Garmin well poised to gain traction in this booming market.    The latest launch expands the company's portfolio of bike trainers, which also includes NEO 2 Smart, FLUX S Smart, Flow Smart and Satori Smart, to name a few. Strong portfolio will aid the company in reaping benefits from this particular market.   Garmin Ltd. Revenue (TTM)      Garmin Ltd. revenue-ttm    |   Garmin Ltd. Quote    Tacx Buyout Bodes Well, Fitness Segment to Grow  Tacx was acquired by Garmin in the second quarter of 2019 in a bid to expand the fitness business. The buyout has added smart trainers as well as basic trainers such as Booster, Blue Matic, and Blue Twist to the fitness products portfolio.    Further, Tacx has also added rollers and accessories to the company's fitness offerings.    Notably, Garmin's fitness segment generated sales of $251.65 million (26.3% of net sales) in second-quarter 2019, advancing 12% from the year-ago quarter. This was driven by the company's well-performing running wearables and positive contributions from Tacx buyout.    We believe all these products, along with the latest bike trainer, are expected to drive top-line growth within the fitness segment of Garmin.   Zacks Rank & Other Stocks to Consider    Currently, Garmin carries a Zacks Rank #2 (Buy).    Some other top-ranked stocks in the borader technology sector are Itron ITRI  , Fortinet FTNT  and Anixter International AXE  . All the three stocks sport a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here.     Long-term earnings growth rate for Itron, Fortinet and Anixter is currently pegged at 25%,15.5% and 8%, respectively.   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Fortinet, Inc. (FTNT): Free Stock Analysis Report   Garmin Ltd. (GRMN): Free Stock Analysis Report   Anixter International Inc. (AXE): Free Stock Analysis Report   Itron, Inc. (ITRI): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Garmin Ltd. GRMN  has rolled out an indoor cycling trainer called NEO 2T Smart from Tacx in a bid to strengthen its fitness product offerings.  makeArticleAd();  We note that the latest product creates indoor training simulation by reacting instantly to speed. Also, it helps in controlling a rider's mass inertia with the help of its dynamic inertia.    Additionally, the product comes with a redesigned rear axle making it compatible with other bikes.    The product leverages Tacx software, which offers more than 100 videos featuring steep hills of the Alps, cobblestone roads of Milan and many more.    Hence, Garmin with the help of the new product will be able to deliver the experience of virtual riding through famous world routes to the cyclists. Moreover, NEO 2T Smart can be synchronized with Zwift app, which will help cyclists experience the feeling of riding on surfaces like cobblestone and gravel.    We believe that the training features and the feeling of virtual riding are likely to deliver enhanced fitness experience to the users. Moreover, these features make the product attractive and will aid in its adoption rate.   Bike Trainer Market Holds Promise    Per a report from Orbis Research, the global indoor bike trainer market is expected to hit $140 million by 2025, by growing at a CAGR of 7.6% between 2018 and 2025.    NEO 2T Smart is equipped with capacitive left and right sensors that measure leg position with accuracy. This helps in improving power distribution and performance of the cyclists.    Further, the bike trainer allows fitness freaks to upload GPS and ride on 3-D maps while creating workouts based on Functional Threshold Power, slope, power and heart rate. Additionally, users can race against live opponents.    Hence, NEO 2T Smart bike trainer makes Garmin well poised to gain traction in this booming market.    The latest launch expands the company's portfolio of bike trainers, which also includes NEO 2 Smart, FLUX S Smart, Flow Smart and Satori Smart, to name a few. Strong portfolio will aid the company in reaping benefits from this particular market.",
    "  Garmin Ltd. Revenue (TTM)      Garmin Ltd. revenue-ttm    |   Garmin Ltd. Quote  ",
    " Garmin Ltd. Revenue (TTM) ",
    " Garmin Ltd. revenue-ttm    |   Garmin Ltd. Quote ",
    " Tacx Buyout Bodes Well, Fitness Segment to Grow ",
    "Tacx was acquired by Garmin in the second quarter of 2019 in a bid to expand the fitness business. The buyout has added smart trainers as well as basic trainers such as Booster, Blue Matic, and Blue Twist to the fitness products portfolio.    Further, Tacx has also added rollers and accessories to the company's fitness offerings.    Notably, Garmin's fitness segment generated sales of $251.65 million (26.3% of net sales) in second-quarter 2019, advancing 12% from the year-ago quarter. This was driven by the company's well-performing running wearables and positive contributions from Tacx buyout.    We believe all these products, along with the latest bike trainer, are expected to drive top-line growth within the fitness segment of Garmin.   Zacks Rank & Other Stocks to Consider    Currently, Garmin carries a Zacks Rank #2 (Buy).    Some other top-ranked stocks in the borader technology sector are Itron ITRI  , Fortinet FTNT  and Anixter International AXE  . All the three stocks sport a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here.     Long-term earnings growth rate for Itron, Fortinet and Anixter is currently pegged at 25%,15.5% and 8%, respectively.   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:50:00"
}