{
  "url": "https://www.nasdaq.com/article/hong-kong-protesters-plan-busy-lantern-festival-again-targeting-metro-20190912-00190",
  "title": "Hong Kong protesters plan busy lantern festival, again targeting metro - Nasdaq.com",
  "text": [
    "By Jessie Pang and Felix Tam",
    "HONG KONG, Sept 12 (Reuters) - Hong Kong activists will combine pro-democracy protests with lantern celebrations marking the Mid-Autumn Festival this weekend after a brief lull in sometimes violent demonstrations which have rocked the Chinese-ruled city since June.",
    "The protests include another in a series of \"stress tests\" of the airport, which in recent weeks have seen approach roads blocked, street fires started and the trashing of a nearby MTR subway station.",
    "Activists are also planning a protest outside Prince Edward Mass Transit Railway (MTR) station on the Kowloon peninsula later on Thursday to mark the night of Aug. 31 when police were caught on CCTV beating protesters on a metro train as they cowered on the floor.",
    "The MTR has since become a prime target of vandalism. Activists are angry that the MTR closes stations to stop protesters from gathering and has demanded the company release CCTV footage of the beatings.",
    "Police have responded to violence in recent weeks with tear gas, pepper spray, rubber bullets, several live shots in the air, water cannon and baton charges, prompting complaints of excessive force.",
    "There were running battles with police in the same area, around Prince Edward MTR, on Friday and Saturday last week.",
    "Protesters also plan to gather outside the British consulate on Sunday to make sure China honours the Sino-British Joint Declaration which was signed in 1984, laying out the former British colony's future after its handover to China in 1997.",
    "China says Hong Kong is now its internal affair. Britain says it has a legal responsibility to ensure China abides by its obligations under the Joint Declaration.",
    "HARVEST FESTIVAL",
    "Hong Kong returned to China under a \"one country, two systems\" formula that guarantees freedoms not enjoyed on the mainland, including an independent legal system.",
    "The current unrest was originally prompted by anger over planned legislation to allow extraditions to China, but has broadened into calls for democracy and for Communist rulers in Beijing to leave the city alone.",
    "China denies meddling and has accused the United States, Britain and others of fomenting the unrest.",
    "The Mid-Autumn Festival, which falls on Friday this year, is a harvest celebration throughout the Chinese-speaking world and in East and Southeast Asia. It is celebrated with mooncakes, gazing at the full moon and colourful lantern displays.",
    "Protesters plan a series of lantern-carrying human chains and sit-ins at MTR shopping malls and on the scenic Victoria Peak, popular with mainland tour groups, and on Lion Rock, separating the New Territories from the Kowloon peninsula.",
    "There were some lunchtime scuffles between pro-Beijing and anti-Hong Kong government supporters in the mall of the IFC, a prominent skyscraper on the newly reclaimed Central waterfront. Some top-brand stores briefly closed.",
    "Anti-government protesters gathered there again after office hours, chanting \"Five demands, not one less\" and \"add oil, Hong Kong people\", meaning keep drawing strength.",
    "One demand was the withdrawal of the extradition bill, to which Hong Kong leader Carrie Lam has agreed. The four others are: retraction of the word \"riot\" to describe the protests, release of all arrested demonstrators, now numbering 1,365, an independent inquiry into perceived police brutality and the right for Hong Kong people to choose their own leaders.",
    "Police denied the Civil Human Rights Front (CHRF) permission for a mass downtown march on Sunday.",
    "\"In previous marches applied for by CHRF, participants, reporters and police suffered serious injuries,\" police said in their refusal letter to the group."
  ],
  "published_datetime": "2019-09-12 01:58:00"
}