{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-alibaba-jdcom-yandex-ringcentral-and-paylocity-cm1210324",
  "title": "The Zacks Analyst Blog Highlights: Alibaba, JD.com, Yandex, RingCentral and Paylocity - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 11, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Alibaba Group BABA  , JD.com JD  , Yandex YNDX  , RingCentral RNG  and Paylocity PCTY  .  Here are highlights from Monday's Analyst Blog:    5 Top-Ranked Large-Cap Internet Stocks to Boost Your     Portfolio   Internet companies are delivering innovative solutions to address evolving consumer preference, which is driven by the need for convenience and easy accessibility.  This boosts the business prospects of Internet companies. Also, improving Internet speed, rapid adoption of 4G Volte technology and accelerated deployment of 5G technology - the next-generation of wireless connectivity - are  tailwinds. Moreover, growth in digital advertising, rapid adoption of online payment methods, cloud computing and cloud-based gaming and expanding online delivery modes are some major catalysts. The optimism surrounding Internet stocks is reflected in the robust year-to-date performance of Invesco NASDAQ Internet ETF, which has rallied 23.6% compared with the S&P 500's growth of 19.3%.  Promising Initiatives to Expand User Base  Internet-based companies have seamless access to a wealth of information provided by users. This helps them to integrate AI, ML and deep learning into their solutions. Moreover, real-time analysis of user data supported by AI tools is helping advertisers target the right audience, which is boosting their return on investment. Additionally, focus on video streaming has been driving user engagement that is attracting advertising dollars. Moreover, transition to SaaS-based (or Software as a Service) applications boosts growth prospects of Internet-based companies. Notably, demand for cloud infrastructure monitoring, web-based application performance management, human capital management (HCM) and cyber security software has been on the rise. Furthermore, social media platforms are coming up with e-commerce verticals. This is enabling Internet-based companies like Facebook to tap new opportunities and expand their total addressable market. These initiatives are enabling Internet companies to expand their user base and realize business goals.  Winning Criteria  With the help of our Zacks Stock Screener  , we have picked five Internet-based stocks that possess strong fundamentals. Each of these stocks has a market cap of more than $5 billion, which makes them less vulnerable to economic slowdown. Moreover, each of the stocks has outperformed the S&P 500 year to date and sports a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .  5 Top Picks  China's e-commerce giant Alibaba Group  is benefiting from steady improvement in core commerce and cloud businesses. The company has a market cap of $452.34 billion. The company delivered average positive earnings surprise of 19.4% in the trailing four quarters. The Zacks Consensus Estimate for fiscal 2020 earnings has been revised 7.2% upward in the past 60 days to $7.19, indicating growth of 25.7% from the year-ago reported figure. Another China-based e-commerce player, JD.com  is benefiting from robust e-commerce business, improving logistics services and supply chain management system. The company has a market cap of $37.9 billion. Notably, JD.com pulled off an average positive earnings surprise of a whopping 186.4% in the trailing four quarters. Moreover, the consensus estimate for current-year earnings has been revised 27.9% upward in the past 60 days to 87 cents. The figure suggests year-over-year growth of 155.9%.  Yandex  is based in Schiphol, the Netherlands. The company's core search business and increasing online advertising revenues are key catalysts. Also, solid momentum across Taxi, Classifieds, Media Services and Experiments segments is expected to aid growth. The company has a market cap of $12.17 billion. The consensus estimate for current-year earnings has remained stable in the past 30 days at $1.38. The figure implies year-over-year growth of 45.3%. Belmont, CA-headquartered RingCentral  is benefiting from robust adoption of its cloud-based unified communications solutions among digitally transforming enterprises. The company's strength in delivering services with integrated video, voice, team messaging, in a unified experience holds promise. The company has a market cap of $10.92 billion. RingCentral pulled off an average positive earnings surprise of 22.8% in the trailing four quarters. Moreover, the current-year earnings estimate has been revised 6.8% upward in the past 60 days to 78 cents. The figure indicates increase of 1.3% on a year-over-year basis. Schaumburg, IL-based Paylocity  is riding on higher uptake of its HCM products among clients with less than 50 employees. The company has a market cap of $5.2 billion and delivered average four-quarter positive earnings surprise of 9.4%. The company's long-term earnings growth rate is currently pegged at 20%.  More Stock News: This Is Bigger than the iPhone!  It could become the mother of all technological revolutions. Apple sold a mere 1 billion iPhones in 10 years but a new breakthrough is expected to generate more than 27 billion devices in just 3 years, creating a $1.7 trillion market. Zacks has just released a Special Report that spotlights this fast-emerging phenomenon and 6 tickers for taking advantage of it. If you don't buy now, you may kick yourself in 2020.     Click here for the 6 trades >>   Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Alibaba Group Holding Limited (BABA): Free Stock Analysis Report   JD.com, Inc. (JD): Free Stock Analysis Report   Yandex N.V. (YNDX): Free Stock Analysis Report   Paylocity Holding Corporation (PCTY): Free Stock Analysis Report   Ringcentral, Inc. (RNG): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 11, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Alibaba Group BABA  , JD.com JD  , Yandex YNDX  , RingCentral RNG  and Paylocity PCTY  .",
    " Here are highlights from Monday's Analyst Blog: ",
    "  5 Top-Ranked Large-Cap Internet Stocks to Boost Your     Portfolio  ",
    "Internet companies are delivering innovative solutions to address evolving consumer preference, which is driven by the need for convenience and easy accessibility.  This boosts the business prospects of Internet companies. Also, improving Internet speed, rapid adoption of 4G Volte technology and accelerated deployment of 5G technology - the next-generation of wireless connectivity - are  tailwinds.",
    "Moreover, growth in digital advertising, rapid adoption of online payment methods, cloud computing and cloud-based gaming and expanding online delivery modes are some major catalysts.",
    "The optimism surrounding Internet stocks is reflected in the robust year-to-date performance of Invesco NASDAQ Internet ETF, which has rallied 23.6% compared with the S&P 500's growth of 19.3%.",
    " Promising Initiatives to Expand User Base ",
    "Internet-based companies have seamless access to a wealth of information provided by users. This helps them to integrate AI, ML and deep learning into their solutions. Moreover, real-time analysis of user data supported by AI tools is helping advertisers target the right audience, which is boosting their return on investment.",
    "Additionally, focus on video streaming has been driving user engagement that is attracting advertising dollars.",
    "Moreover, transition to SaaS-based (or Software as a Service) applications boosts growth prospects of Internet-based companies. Notably, demand for cloud infrastructure monitoring, web-based application performance management, human capital management (HCM) and cyber security software has been on the rise.",
    "Furthermore, social media platforms are coming up with e-commerce verticals. This is enabling Internet-based companies like Facebook to tap new opportunities and expand their total addressable market.",
    "These initiatives are enabling Internet companies to expand their user base and realize business goals.",
    " Winning Criteria ",
    "With the help of our Zacks Stock Screener  , we have picked five Internet-based stocks that possess strong fundamentals. Each of these stocks has a market cap of more than $5 billion, which makes them less vulnerable to economic slowdown.",
    "Moreover, each of the stocks has outperformed the S&P 500 year to date and sports a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .",
    " 5 Top Picks ",
    "China's e-commerce giant Alibaba Group  is benefiting from steady improvement in core commerce and cloud businesses. The company has a market cap of $452.34 billion.",
    "The company delivered average positive earnings surprise of 19.4% in the trailing four quarters. The Zacks Consensus Estimate for fiscal 2020 earnings has been revised 7.2% upward in the past 60 days to $7.19, indicating growth of 25.7% from the year-ago reported figure.",
    "Another China-based e-commerce player, JD.com  is benefiting from robust e-commerce business, improving logistics services and supply chain management system. The company has a market cap of $37.9 billion.",
    "Notably, JD.com pulled off an average positive earnings surprise of a whopping 186.4% in the trailing four quarters. Moreover, the consensus estimate for current-year earnings has been revised 27.9% upward in the past 60 days to 87 cents. The figure suggests year-over-year growth of 155.9%.",
    " Yandex  is based in Schiphol, the Netherlands. The company's core search business and increasing online advertising revenues are key catalysts. Also, solid momentum across Taxi, Classifieds, Media Services and Experiments segments is expected to aid growth. The company has a market cap of $12.17 billion.",
    "The consensus estimate for current-year earnings has remained stable in the past 30 days at $1.38. The figure implies year-over-year growth of 45.3%.",
    "Belmont, CA-headquartered RingCentral  is benefiting from robust adoption of its cloud-based unified communications solutions among digitally transforming enterprises. The company's strength in delivering services with integrated video, voice, team messaging, in a unified experience holds promise. The company has a market cap of $10.92 billion.",
    "RingCentral pulled off an average positive earnings surprise of 22.8% in the trailing four quarters. Moreover, the current-year earnings estimate has been revised 6.8% upward in the past 60 days to 78 cents. The figure indicates increase of 1.3% on a year-over-year basis.",
    "Schaumburg, IL-based Paylocity  is riding on higher uptake of its HCM products among clients with less than 50 employees.",
    "The company has a market cap of $5.2 billion and delivered average four-quarter positive earnings surprise of 9.4%. The company's long-term earnings growth rate is currently pegged at 20%.",
    " More Stock News: This Is Bigger than the iPhone! ",
    "It could become the mother of all technological revolutions. Apple sold a mere 1 billion iPhones in 10 years but a new breakthrough is expected to generate more than 27 billion devices in just 3 years, creating a $1.7 trillion market.",
    "Zacks has just released a Special Report that spotlights this fast-emerging phenomenon and 6 tickers for taking advantage of it. If you don't buy now, you may kick yourself in 2020.  ",
    "  Click here for the 6 trades >>  ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:53:00"
}