{
  "url": "https://www.nasdaq.com/article/mexico-attacks-decision-to-release-suspect-blamed-for-student-massacre-20190904-00863",
  "title": "Mexico attacks decision to release suspect blamed for student massacre - Nasdaq.com",
  "text": [
    "MEXICO CITY, Sept 4 (Reuters) - The Mexican government on Wednesday attacked a court's decision to release a key suspect in the 2014 disappearance of 43 student teachers and said it will ask authorities to review the conduct of the judges and prosecutors involved in the case.",
    "The abduction and apparent massacre of the trainee teachers by corrupt police working with local drug gang Guerreros Unidos sparked international condemnation of Mexico and battered the credibility of previous president Enrique Pena Nieto.",
    "On Saturday, Gildardo Lopez Astudillo, the Guerreros Unidos leader blamed for ordering the murder of the students who is known as El Gil, was released from prison after a judge found that the government had tortured him to obtain evidence.",
    "Speaking alongside Encinas, Mexico President Andres Manuel Lopez Obrador said the government would challenge the decision to release the Guerreros Unidos leader.",
    "\"We are going to formally present a complaint to the attorney general's office and the judicial branch in this case,\"  Lopez Obrador said. ",
    "The precedent set in the case could ultimately lead to the release of 50 other suspects who have been detained in connection with the disappearances, Encinas said.",
    "The United Nations' human rights office said in a report last year that Mexican authorities had probably tortured dozens of people during the investigation.",
    "Pena Nieto's popularity suffered lasting damage from the scandal over the disappearances, and his government was heavily criticized for its handling of the investigation.",
    "Investigators have definitively identified the remains of only one of the 43 students, who according to the government  were killed and then incinerated by the gang members.",
    "Lopez Obrador, who took office in December, promised during his campaign to launch a truth commission to get to the bottom of what happened to the missing students."
  ],
  "published_datetime": "2019-09-04 12:11:00"
}