{
  "url": "https://www.nasdaq.com/article/monster-beverages-energy-drinks-unit-strong-costs-high-cm1206750",
  "title": "Monster Beverage's Energy Drinks Unit Strong, Costs High - Nasdaq.com",
  "text": [
    "  Monster Beverage Corporation MNST  is experiencing momentum in the energy drinks category driven by the Monster Energy brand. In addition, the company has been consistently focusing on product launches and innovations besides strengthening its global footprint to increase market share.  makeArticleAd();  Despite these laudable efforts, shares of this  global market  er and distributor of energy drink beverages have lost 6.7% in the past three months. Meanwhile, the industry  rallied 2.8%. Notably, the company's lower-than-expected top and bottom lines in second-quarter 2019 resulted in the dismal price performance. While higher costs and soft margins weighed on earnings, unfavorable foreign currency affected sales in the reported quarter. Decline in sales at Strategic Brands and Other segments further dented the top line.      We note that input cost inflation and unfavorable product mix along with increased freight costs have been hurting the company's gross margin. In the second quarter, gross margin contracted 120 basis points (bps) mainly due to negative geographic and product sales mix as well as an increase in some input costs. This coupled with operating expenses dented operating margin, which was down 90 bps in second-quarter 2019.    These apart, Monster Beverage's significant international presence exposes it to foreign currency risks. In the second quarter, the company's top line was partly negated by unfavorable currency, which hurt gross and net sales by $25.9 million and $30.7 million, respectively. Further, net sales at the Monster Energy Drinks and Strategic Brands segments were adversely impacted by roughly $22.1 million and $3.8 million, respectively, from currency.   Initiatives to Offset Headwinds    While higher costs and adverse impact of currency are hurting Monster Beverage's performance, its strategic endeavors including TCCC Transaction appear promising.    Monster Beverage offers a wide range of energy drink brands like Monster Energy, Java Monster, Caffe Monster, Espresso Monster and more. The addition of Coca-Cola's KO  energy drink brands to the company's portfolio has further strengthened its position in the global energy drinks market.    Furthermore, the deal with Coca-Cola in 2015 (also referred to as the \"TCCC Transaction\") provides Monster Beverage with full access to Coca-Cola's world-class global distribution network. This deal has significantly boosted the company's international presence.    In March this year, the company completed the strategic alignment with Coca-Cola system bottlers in the United States, with the allotment of the Kalil Bottling Group's distribution territories (Southwestern United States). Additionally, it transitioned the distribution of Monster Energy drinks from Big Geyser's territory, located in the New York metro markets, to Liberty Coca-Cola in April.    In second-quarter 2019, Coke Bottlers launched the Monster Energy brand in Azerbaijan, Paraguay and Saudi Arabia. Going forward, Monster Beverage remains on track with the transitioning of the brand to Coca-Cola system bottlers in more countries.    In some markets of Europe, namely Greece, Bulgaria and Cyprus, the company launched the Predator energy brand. Monster Beverage also completed the rollout of Monster Ultra in China and launched Monster Mango. Management remains on track for more international launches later this year.    During the fourth quarter, it intends to launch the Monster brand in Israel. Monster Beverage further plans to launch the Predator brand in about 19 EMEA countries by the end of 2019. Later this year, management expects to roll out various products in the Asia Pacific and Monster Mule in Canada.    All said, Monster Beverage currently has a Zacks Rank #3 (Hold).     2 Solid Beverage Stocks You May Count on    Keurig Dr Pepper Inc. KDP  has an impressive long-term earnings growth rate of 15.4% and a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .    The Boston Beer Company, Inc. SAM  has a long-term earnings growth rate of 10% and a Zacks Rank #2.   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   The Boston Beer Company, Inc. (SAM): Free Stock Analysis Report   Monster Beverage Corporation (MNST): Free Stock Analysis Report   Coca-Cola Company (The) (KO): Free Stock Analysis Report   Keurig Dr Pepper, Inc (KDP): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Monster Beverage Corporation MNST  is experiencing momentum in the energy drinks category driven by the Monster Energy brand. In addition, the company has been consistently focusing on product launches and innovations besides strengthening its global footprint to increase market share.  makeArticleAd();  Despite these laudable efforts, shares of this  global market  er and distributor of energy drink beverages have lost 6.7% in the past three months. Meanwhile, the industry  rallied 2.8%. Notably, the company's lower-than-expected top and bottom lines in second-quarter 2019 resulted in the dismal price performance. While higher costs and soft margins weighed on earnings, unfavorable foreign currency affected sales in the reported quarter. Decline in sales at Strategic Brands and Other segments further dented the top line.",
    "     We note that input cost inflation and unfavorable product mix along with increased freight costs have been hurting the company's gross margin. In the second quarter, gross margin contracted 120 basis points (bps) mainly due to negative geographic and product sales mix as well as an increase in some input costs. This coupled with operating expenses dented operating margin, which was down 90 bps in second-quarter 2019.    These apart, Monster Beverage's significant international presence exposes it to foreign currency risks. In the second quarter, the company's top line was partly negated by unfavorable currency, which hurt gross and net sales by $25.9 million and $30.7 million, respectively. Further, net sales at the Monster Energy Drinks and Strategic Brands segments were adversely impacted by roughly $22.1 million and $3.8 million, respectively, from currency.   Initiatives to Offset Headwinds    While higher costs and adverse impact of currency are hurting Monster Beverage's performance, its strategic endeavors including TCCC Transaction appear promising.    Monster Beverage offers a wide range of energy drink brands like Monster Energy, Java Monster, Caffe Monster, Espresso Monster and more. The addition of Coca-Cola's KO  energy drink brands to the company's portfolio has further strengthened its position in the global energy drinks market.    Furthermore, the deal with Coca-Cola in 2015 (also referred to as the \"TCCC Transaction\") provides Monster Beverage with full access to Coca-Cola's world-class global distribution network. This deal has significantly boosted the company's international presence.    In March this year, the company completed the strategic alignment with Coca-Cola system bottlers in the United States, with the allotment of the Kalil Bottling Group's distribution territories (Southwestern United States). Additionally, it transitioned the distribution of Monster Energy drinks from Big Geyser's territory, located in the New York metro markets, to Liberty Coca-Cola in April.    In second-quarter 2019, Coke Bottlers launched the Monster Energy brand in Azerbaijan, Paraguay and Saudi Arabia. Going forward, Monster Beverage remains on track with the transitioning of the brand to Coca-Cola system bottlers in more countries.    In some markets of Europe, namely Greece, Bulgaria and Cyprus, the company launched the Predator energy brand. Monster Beverage also completed the rollout of Monster Ultra in China and launched Monster Mango. Management remains on track for more international launches later this year.    During the fourth quarter, it intends to launch the Monster brand in Israel. Monster Beverage further plans to launch the Predator brand in about 19 EMEA countries by the end of 2019. Later this year, management expects to roll out various products in the Asia Pacific and Monster Mule in Canada.    All said, Monster Beverage currently has a Zacks Rank #3 (Hold).     2 Solid Beverage Stocks You May Count on    Keurig Dr Pepper Inc. KDP  has an impressive long-term earnings growth rate of 15.4% and a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .    The Boston Beer Company, Inc. SAM  has a long-term earnings growth rate of 10% and a Zacks Rank #2.   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:56:00"
}