{
  "url": "https://www.nasdaq.com/article/are-investors-undervaluing-adecoagro-agro-right-now-cm1207219",
  "title": "Are Investors Undervaluing Adecoagro (AGRO) Right Now? - Nasdaq.com",
  "text": [
    " Here at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks. Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks. Looking at the history of these trends, perhaps none is more beloved than value investing. This strategy simply looks to identify companies that are being undervalued by the broader market. Value investors rely on traditional forms of analysis on key valuation metrics to find stocks that they believe are undervalued, leaving room for profits. On top of the Zacks Rank, investors can also look at our innovative Style Scores system to find stocks with specific traits. For example, value investors will want to focus on the \"Value\" category. Stocks with high Zacks Ranks and \"A\" grades for Value will be some of the highest-quality value stocks on the market today. One company value investors might notice is Adecoagro (AGRO). AGRO is currently holding a Zacks Rank of #2 (Buy) and a Value grade of A. The stock is trading with a P/E ratio of 9.87, which compares to its industry's average of 13.53. Over the past year, AGRO's Forward P/E has been as high as 22.06 and as low as 8.95, with a median of 11.43. Investors should also recognize that AGRO has a P/B ratio of 0.58. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. This company's current P/B looks solid when compared to its industry's average P/B of 0.72. AGRO's P/B has been as high as 1.98 and as low as 0.57, with a median of 0.75, over the past year. Value investors also love the P/S ratio, which is calculated by simply dividing a stock's price with the company's sales. This is a prefered metric because revenue can't really be manipulated, so sales are often a truer performance indicator. AGRO has a P/S ratio of 0.8. This compares to its industry's average P/S of 1.4. Finally, our model also underscores that AGRO has a P/CF ratio of 3.24. This data point considers a firm's operating cash flow and is frequently used to find companies that are undervalued when considering their solid cash outlook. AGRO's P/CF compares to its industry's average P/CF of 9.51. Over the past 52 weeks, AGRO's P/CF has been as high as 6.94 and as low as 3.19, with a median of 5.94. These figures are just a handful of the metrics value investors tend to look at, but they help show that Adecoagro is likely being undervalued right now. Considering this, as well as the strength of its earnings outlook, AGRO feels like a great value stock at the moment.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Adecoagro S.A. (AGRO): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Here at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks. Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks.",
    "Looking at the history of these trends, perhaps none is more beloved than value investing. This strategy simply looks to identify companies that are being undervalued by the broader market. Value investors rely on traditional forms of analysis on key valuation metrics to find stocks that they believe are undervalued, leaving room for profits.",
    "On top of the Zacks Rank, investors can also look at our innovative Style Scores system to find stocks with specific traits. For example, value investors will want to focus on the \"Value\" category. Stocks with high Zacks Ranks and \"A\" grades for Value will be some of the highest-quality value stocks on the market today.",
    "One company value investors might notice is Adecoagro (AGRO). AGRO is currently holding a Zacks Rank of #2 (Buy) and a Value grade of A. The stock is trading with a P/E ratio of 9.87, which compares to its industry's average of 13.53. Over the past year, AGRO's Forward P/E has been as high as 22.06 and as low as 8.95, with a median of 11.43.",
    "Investors should also recognize that AGRO has a P/B ratio of 0.58. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. This company's current P/B looks solid when compared to its industry's average P/B of 0.72. AGRO's P/B has been as high as 1.98 and as low as 0.57, with a median of 0.75, over the past year.",
    "Value investors also love the P/S ratio, which is calculated by simply dividing a stock's price with the company's sales. This is a prefered metric because revenue can't really be manipulated, so sales are often a truer performance indicator. AGRO has a P/S ratio of 0.8. This compares to its industry's average P/S of 1.4.",
    "Finally, our model also underscores that AGRO has a P/CF ratio of 3.24. This data point considers a firm's operating cash flow and is frequently used to find companies that are undervalued when considering their solid cash outlook. AGRO's P/CF compares to its industry's average P/CF of 9.51. Over the past 52 weeks, AGRO's P/CF has been as high as 6.94 and as low as 3.19, with a median of 5.94.",
    "These figures are just a handful of the metrics value investors tend to look at, but they help show that Adecoagro is likely being undervalued right now. Considering this, as well as the strength of its earnings outlook, AGRO feels like a great value stock at the moment.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:10:10"
}