{
  "url": "https://www.nasdaq.com/article/commit-to-purchase-zions-bancorporation-at-35-earn-55-annualized-using-options-cm1208151",
  "title": "Commit To Purchase Zions Bancorporation At $35, Earn 5.5% Annualized Using Options - Nasdaq.com",
  "text": [
    "Investors considering a purchase of Zions Bancorporation, N.A. (Symbol: ZION) stock, but tentative about paying the going market price of $41.25/share, might benefit from considering selling puts among the alternative strategies at their disposal. One interesting put contract in particular, is the April 2020 put at the $35 strike, which has a bid at the time of this writing of $1.19. Collecting that bid as the premium represents a 3.4% return against the $35 commitment, or a 5.5% annualized rate of return (at Stock Options Channel we call this the YieldBoost  ).      Selling a put does not give an investor access to ZION's upside potential the way owning shares would, because the put seller only ends up owning shares in the scenario where the contract is exercised. And the person on the other side of the contract would only benefit from exercising at the $35 strike if doing so produced a better outcome than selling at the going market price. ( Do options carry counterparty risk? This and six other common options myths debunked  ). So unless Zions Bancorporation, N.A. sees its shares decline 15.4% and the contract is exercised (resulting in a cost basis of $33.81 per share before broker commissions, subtracting the $1.19 from $35), the only upside to the put seller is from collecting that premium for the 5.5% annualized rate of return.  makeArticleAd();  Interestingly, that annualized 5.5% figure actually exceeds the 3.3% annualized dividend paid by Zions Bancorporation, N.A. by 2.2%, based on the current share price of $41.25. And yet, if an investor was to buy the stock at the going market price in order to collect the dividend, there is greater downside because the stock would have to fall 15.36% to reach the $35 strike price.    Always important when discussing dividends is the fact that, in general, dividend amounts are not always predictable and tend to follow the ups and downs of profitability at each company. In the case of Zions Bancorporation, N.A., looking at the dividend history chart for ZION below can help in judging whether the most recent dividend is likely to continue, and in turn whether it is a reasonable expectation to expect a 3.3% annualized dividend yield.       Below is a chart showing the trailing twelve month trading history for Zions Bancorporation, N.A., and highlighting in green where the $35 strike is located relative to that history:       The chart above, and the stock's historical volatility, can be a helpful guide in combination with fundamental analysis to judge whether selling the April 2020 put at the $35 strike for the 5.5% annualized rate of return represents good reward for the risks. We calculate the trailing twelve month volatility for Zions Bancorporation, N.A. (considering the last 251 trading day closing values as well as today's price of $41.25) to be 27%. For other put options contract ideas at the various different available expirations, visit the ZION Stock Options  page of StockOptionsChannel.com.   Top YieldBoost Puts of the S&P 500 »  ",
    "  Top YieldBoost Puts of the S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 12:57:44"
}