{
  "url": "https://www.nasdaq.com/article/3-big-stock-charts-for-wednesday-micron-jpmorgan-chase-and-fastenal-cm1210489",
  "title": "3 Big Stock Charts for Wednesday: Micron, JPMorgan Chase and Fastenal - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Last week's bullishness continues to fade away, with the S&P 500 ending yesterday's action up a nearly immeasurable 0.03%. And, that gain only took shape in the last few minutes of the day's trading action.",
    "Disney (NYSE: DIS ) and Netflix (NASDAQ: NFLX ) were the proverbial problem children, albeit for understandable reasons. The former fell while the latter was off by after Apple (NASDAQ: AAPL ) unveiled its competing streaming service. Priced at only $4.99 per month , even offering less content than its rivals, the iPhone maker has tacitly declared something of a price war.",
    "To that end, AAPL shares gained more than 1% in response to its announcement.",
    "That gain was chump-change compared to the 2.5% advance Bank of America (NYSE: BAC ) shares logged today. BofA leads a group of bank stocks higher, in step with recovering interest rates.",
    "Headed into hump-day, however, it's the stock charts of JPMorgan Chase (NYSE: JPM ), Fastenal Company (NASDAQ: FAST ) and Micron Technology (NASDAQ: MU ) that have earned a closer look. Here's why, and what may lie ahead for each.",
    "Just a few months ago, Micron Technology was presumed to be in serious peril. Yet another memory chip glut had lowered prices, punishing manufacturers who dared to ramp up production to meet what was perceived to be sustainable demand.",
    "This year has been dramatically different though. Not only is MU stock up, it has moved higher in a way that has set the stage for an explosive move higher from here. It will need some help to do so, and the effort may not be long-lived. The potential is tremendous though.",
    "Micron Technology isn't the only name on the verge of benefiting from what appears to be an upside-down head and shoulders pattern, however. JPMorgan Chase is as well. Although it's not as well-formed as Micron's and has moved a little more erratically as it has unfurled, the prospective upside is still noteworthy.",
    "In fact, JPM stock is arguably better positioned to make a nice run given a hint offered up on the long-term weekly chart.",
    "Finally, the last time we looked at Fastenal Company shares back on July 22 , the stock was fighting a losing battle. Its 50-day moving average line capped a rally attempt, and sent shares lower to test a major support line around $30. The bulls tried to push back, but by early August that last-ditch floor was broken.",
    "The sheer scope and speed of the selloff, however, didn't let FAST stock move all the way back to a long-established floor where it would be able to make a reversal. The rebound started to take shape just a few days later, and is sending the stock soaring to a new paradigm now.",
    "As of this writing, James Brumley did not hold a position in any of the aforementioned securities. You can learn more about him at his website jamesbrumley.com , or follow him on Twitter , at @jbrumley.",
    "The post 3 Big Stock Charts for Wednesday: Micron, JPMorgan Chase and Fastenal appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:34:27"
}