{
  "url": "https://www.nasdaq.com/article/us-stockswall-street-rises-on-strong-chinese-data-easing-geopolitical-concerns-20190904-00857",
  "title": "US STOCKS-Wall Street rises on strong Chinese data, easing geopolitical concerns - Nasdaq.com",
  "text": [
    " (For a live blog on the U.S. stock market, click LIVE/ ortype LIVE/ in a news window.)",
    "* Ten of 11 major S&P 500 sectors trading higher",
    "* China service sector activity rises to 3-mth high",
    "* Indexes up: Dow 0.79%, S&P 0.90%, Nasdaq 1.04%  (Updates market action, adds comments)",
    "By Uday Sampath Kumar",
    "Sept 4 (Reuters) - Wall Street's main indexes rose onWednesday as fears of a global economic slowdown were calmed byrobust economic data from China, while easing tensions in HongKong added to an upbeat mood.",
    "Activity in China's services sector expanded at the fastestpace in three months in August, providing a boost to the world'ssecond-largest economy that has been struggling to reverse aprolonged slump in its manufacturing sector. urn:newsml:reuters.com:*:nL3N25U2EK",
    "The mood also got a lift after Hong Kong leader Carrie Lamwithdrew an extradition bill that had triggered months of oftenviolent protests in the Chinese-ruled city. urn:newsml:reuters.com:*:nL3N25V0NC",
    "\"This is a sentiment driven market and whenever you get newslike this, while it may not directly impact the U.S., it causesa ripple effect,\" said Ryan Nauman, market strategist at InformaFinancial Intelligence in Lake Taho, California.",
    "Markets struggled last month as escalating trade tensionsand the inversion of a key part of the U.S. yield curve, oftenseen as a sign of recession, drove investors away from riskyassets and pushed the S&P 500 .SPX to log its worst August infour years.",
    "A contraction in U.S. factory activity in August only addedto those concerns on Tuesday.",
    "However, risk sentiment improved on Wednesday, pushing thebenchmark U.S. Treasury 10-year yield US10YT=RR higher, withthe yield curve at its steepest in more than two weeks. US/",
    "Helping cool slowdown concerns were comments from New YorkFederal Reserve President John Williams who said the economyappeared to be in a good place and he is ready to \"act asappropriate\" to help avoid a downturn. urn:newsml:reuters.com:*:nL2N25V0H6",
    "Ten of the 11 major S&P sectors were higher, with a 1.48% rise in technology stocks .SPLRCT providing the biggest boost.",
    "The U.S. nonfarm payrolls report due Friday will also be acritical piece of data, with some analysts cautioning that anyweakness could be taken as a major signal that the domesticeconomy is slowing.",
    "\"The strong labor market and consumer is what's drivingeconomic growth and if we start seeing cracks in the labormarket, that would give me pause that a recession is on thehorizon,\" Nauman said.",
    "However, he added weakness in the labor market couldpressure the Federal Reserve to cut interest rates by as much as50 basis points in its mid-September meeting. Marketparticipants are currently expecting a quarter percentage pointcut.",
    " At 11:53 a.m. ET the Dow Jones Industrial Average .DJI was up 207.36 points, or 0.79%, at 26,325.38, the S&P 500 .SPX was up 26.18 points, or 0.90%, at 2,932.45 and the NasdaqComposite .IXIC was up 81.60 points, or 1.04%, at 7,955.76.",
    "Bank stocks .SPXBK rose 0.93%, bouncing back from aselloff on Tuesday when the 10-year U.S. Treasury yield US10YT=RR hit its lowest since July 2016. ",
    "Tyson Foods IncTSN.N shares fell 5.8% to the bottom ofthe S&P 500 after the United States' biggest meat processor cutits 2019 earnings forecast. urn:newsml:reuters.com:*:nL3N25U46K",
    "Starbucks CorpSBUX.O dropped 1.36% after the company saidit expects 2020 adjusted profit growth to be lower than 2019 andhinted at fewer share repurchases next year. urn:newsml:reuters.com:*:nL3N25V34A",
    "Advancing issues outnumbered decliners by a 4.11-to-1 ratioon the NYSE and by a 2.06-to-1 ratio on the Nasdaq.",
    "The S&P index recorded 59 new 52-week highs and three newlows, while the Nasdaq recorded 49 new highs and 56 new lows. (Reporting by Uday Sampath and Shreyashi Sanyal in Bengaluru;Editing by Anil D'Silva) ((UdaySampath.Kumar@thomsonreuters.com; within U.S.+1 646 2238780; Twitter: @sampath_uday; Reuters Messaging:UdaySampath.Kumar.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-04 12:10:00"
}