{
  "url": "https://www.nasdaq.com/article/us-dollar-index-futures-dx-technical-analysis-approaching-important-support-cluster-98160-to-98120-cm1207678",
  "title": "U.S. Dollar Index Futures (DX) Technical Analysis – Approaching Important Support Cluster 98.160 to 98.120 - Nasdaq.com",
  "text": [
    "The U.S. Dollar continued to plunge against a basket of major currencies on Wednesday with the greenback pressured the most by the heavily weighted Euro and British Pound. The dollar was also weighed down by stronger Canadian Dollar and Swiss Franc, but it was able to pick up some strength against the Japanese Yen.",
    "On Wednesday, September U.S. Dollar Index futures settled at 98.393, down 0.556 or -0.56%.",
    "The Euro rose on Wednesday after comments from Christine Lagarde, who will likely be the European Central Bank's (ECB) next president, introduced some doubt over the scale of an ECB stimulus package expected next week. Lagarde said highly accommodative monetary policy for a prolonged period was necessary but she added that the bank needed to be mindful of the negative side-effects of such tools.",
    "The British Pound soared after lawmakers who defeated Prime Minister Boris Johnson's government on a crucial motion late on Tuesday, voted on Wednesday to stop Britain from leaving the European Union on October 31 without transitional arrangements. Lawmakers hope to have the motion passed into law by the end of the week.",
    "Tuesday's weaker-than-expected ISM US Manufacturing PMI report also pressured the U.S. Dollar since it suggests the Federal Reserve may have to cut rates more aggressively this year. Safe-haven demand for the U.S. Dollar and Japanese Yen was also dampened by an easing of global political tensions in Hong Kong, Italy and the United Kingdom.",
    "The main trend is up according to the daily swing chart, however, momentum is trending lower. A trade through 99.330 will signal a resumption of the uptrend. The main trend will change to down on a move through 97.370.",
    "The short-term range is 97.370 to 99.330. Its retracement zone at 98.350 to 98.120 is the first downside target. Since the main trend is up, we could see a technical bounce on the first test of this area.",
    "The main range is 96.980 to 99.330. Its retracement zone at 98.160 to 97.880 is the next downside target.",
    "Combining the two retracement zones makes 98.160 to 98.120 a key area to watch for buyers.",
    "Based on Wednesday's price action and the close at 93.393, the direction of the September U.S. Dollar Index is likely to be determined by trader reaction to the short-term 50% level at 98.350.",
    "A sustained move over 98.350 will indicate the presence of buyers. If this move can generate enough upside momentum then we could see a retracement of the break from 99.330. This makes 98.835 a potential upside target.",
    "A sustained move under 98.350 will signal the presence of sellers. However, any selling is likely to be labored because of a series of potential support levels.",
    "The first potential support is a pair of uptrending Gann angles at 98.295 and 98.245.",
    "The second potential support is a pair of retracement levels at 98.160 to 98.120.",
    "Watch for a technical bounce on the initial tests of these areas. If 98.120 fails as support then we could see an acceleration to the downside with the main Fibonacci level at 97.880 the first target, followed closely by an uptrending Gann angle at 97.810.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:45:50"
}