{
  "url": "https://www.nasdaq.com/article/sudans-pm-selects-members-of-first-cabinet-since-bashirs-ouster-20190903-00895",
  "title": "Sudan's PM selects members of first cabinet since Bashir's ouster - Nasdaq.com",
  "text": [
    "By Khalid Abdelaziz",
    "KHARTOUM, Sept 3 (Reuters) - Sudan's prime minister has approved 14 civilian members of his cabinet, the first to be appointed since the overthrow of long-time leader Omar al-Bashir in April, a source said on Tuesday.",
    "The nominations include Sudan's first female foreign minister, and a former World Bank economist as finance minister who will face an economic crisis that triggered months of protests against Bashir and has deepened in recent months.",
    "Asmaa Abdallah had been chosen as foreign minister, according to the member of the Forces for Freedom and Change (FFC) grouping, who spoke on condition of anonymity.",
    "Ibrahim Elbadawi, a former World Bank economist who had been managing director of the Cairo-based think tank Economic Research Forum since 2017, would serve as finance minister and Adel Ibrahim was tapped to lead the Energy and Mining Ministry, the source added. ",
    "General Jamal Aldin Omar, who was a member of the Transitional Military Council that took over from Bashir, will become defence minister, he said.",
    "The government will lead a three-year transition to elections under a power-sharing deal between the military and civilian opposition.",
    "Hamdok, speaking at a press conference in Khartoum alongside Germany's foreign minister, did not mention the appointments but said it would be \"logical\" for women to receive appropriate representation since \"the women of my country were on the frontline of this revolution\".      ",
    "\"Sudan's economic challenge is a big challenge, but we can tackle it,\" Hamdok said. \"In the near-term, we need to address the shortage of commodity items - sugar, flour and petroleum.\" ",
    "\"On the currency front, we need to stop inflation, deal with the exchange rate of the national currency, and restore confidence to the banking system,\" Hamdok said, adding he hoped to do so in six months to one year.     ",
    "Elbadawi, who has a PhD in economics from North Carolina State University, told Reuters in April that he hoped Sudan could get help from countries such as Saudi Arabia and the United Arab Emirates, which pledged aid to the military council after Bashir's fall.",
    "\"Sudan essentially needs a mini-Marshall plan, given the destruction which happened in the country, and the corruption,\" he said at the time.",
    "\"I would think, from my experience at the World Bank, in three months you can actually have an agreement with the IMF for balance of payments support. As well as, of course - the World Bank can provide budget support.\"",
    "The FFC presented lists of candidates for all portfolios except for defence and interior, for which the military chose nominees. ",
    "Consultations between Hamdok and the FFC were taking place for four ministries. Hamdok was expected to announce the full cabinet in the next two days, state news agency SUNA said."
  ],
  "published_datetime": "2019-09-03 11:46:00"
}