{
  "url": "https://www.nasdaq.com/article/heres-a-reason-to-own-microsofts-stock-its-red-hot-cloud-computing-business-cm1207534",
  "title": "Here’s A Reason To Own Microsoft’s Stock: Its Red-Hot Cloud Computing Business - Nasdaq.com",
  "text": [
    " Rewind a few years and   Microsoft    (NASDAQ: MSFT) was written off as a distant third-place player in   the cloud computing market.   Amazon    (NASDAQ: AMZN) dominated with its Amazon Web Services while   Alphabet's    (NASDAQ: GOOG) (NASDAQ: GOOGL)  Google was its scrappy   second-place rival. But things have changed a lot since then. Amazon is still the   leader, but Microsoft is chipping away at its lead. It has become   the second-largest cloud computing provider on a worldwide basis   and is growing at a rate that surpasses its rivals. It's also   operating in an environment that is projected to see double-digit   growth in the years to come as more companies move processes to   the cloud. According to Gartner, the market research firm, the worldwide   public cloud services market is forecasted to hit $214.3 billion   this year, 17.5% higher than the $182.4 billion seen last year.   Cloud system infrastructure services, is expected to   enjoy growth of 27.5%    in 2019, reaching $38.9 billion.makeArticleAd(); That bodes well for Microsoft. While Amazon is still the   leading cloud service provider with 31.5% market share in cloud   infrastructure services, Microsoft is   seeing the fastest    growth in that segment of the market, growing 63.6% during   the second quarter. Overall, total cloud revenue for its fiscal   fourth quarter ended June 30 was $33.7 billion, up 12% on a   year-over-year basis.  Microsoft's cloud transformation started with     Nadella  The growth in Microsoft's cloud computing business shouldn't   be too surprising for anyone who has followed the software giant   over the past few years. Ever since current Chief Executive Satya   Nadella came on board in 2014, Microsoft has been focused on   cloud computing and mobile services. It has been pouring billions   of dollars into the efforts. Today it is among the few cloud   computing players that cover all the aspects of the marketplace.   That means Microsoft is able to get recurring revenue from   commercial and consumer customers alike. Revenue in its   commercial cloud business    grew 39% to $11 billion in its fiscal fourth-quarter marking the   strongest three month period for that part of the business.   Microsoft's Office 365 Commercial business drove the growth, with   revenue up 31% year-over-year. Microsoft doesn't break-out   revenue for Azure, its cloud computing service that competes   head-on with Amazon, but it's clear it is focused on displacing   its rival. To achieve that end, Microsoft is providing businesses   with more reasons to switch to its services. During the   year, the technology powerhouse began bundling Azure with its   Office products to appeal to more customers. It's a strategy that   appears to be resonating. In July it   announced    a $2 billion deal with   AT&T    (NYSE: T) to move most of the telecom provider's non-network   workloads to the public cloud by 2024. As part of the deal,   AT&T's workforce will use Microsoft 365 cloud-based   productivity and collaboration tools. It's also forging partnerships in the cloud marketplace with   the likes of   Oracle    ,   Adobe    ,   Dell Technologies    and   SAP     among others that round out its offerings and help it eat   away at Amazon's dominance.   Getty Images    Microsoft     stock      poised to sail as it eats away at Amazon's lead  Microsoft's strong showing in the cloud market hasn't been   lost on investors and Wall Street, which have been sending the   stock higher over the past few years. When    Microsoft   report    ed its fiscal fourth-quarter results the stock surged in   after-hours trading. Shares have come down a bit since then but   is still up 40% so far this year. Some Wall Street analysts are betting Microsoft will   eventually surpass Amazon, to become the leader. In a recent   research report, Wedbush Securities analyst Dan Ives said there   has been an acceleration of large enterprise cloud deals during   the second quarter in the U.S. and Europe and that Microsoft is   poised to win many of them.   10 stocks we like better than Microsoft       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Microsoft wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. Suzanne Frey, an executive at Alphabet, is a member     of The Motley Fool's board of directors. Teresa Kersten, an     employee of LinkedIn, a Microsoft subsidiary, is a member of     The Motley Fool's board of directors.     Donna Fuscaldo      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Alphabet (A shares), Alphabet (C     shares), Amazon, and Microsoft. The Motley Fool has the     following options: long January 2021 $85 calls on Microsoft.     The Motley Fool recommends Adobe Systems. The Motley Fool has a     disclosure policy      .  ",
    "Rewind a few years and   Microsoft    (NASDAQ: MSFT) was written off as a distant third-place player in   the cloud computing market.   Amazon    (NASDAQ: AMZN) dominated with its Amazon Web Services while   Alphabet's    (NASDAQ: GOOG) (NASDAQ: GOOGL)  Google was its scrappy   second-place rival.",
    "But things have changed a lot since then. Amazon is still the   leader, but Microsoft is chipping away at its lead. It has become   the second-largest cloud computing provider on a worldwide basis   and is growing at a rate that surpasses its rivals. It's also   operating in an environment that is projected to see double-digit   growth in the years to come as more companies move processes to   the cloud.",
    "According to Gartner, the market research firm, the worldwide   public cloud services market is forecasted to hit $214.3 billion   this year, 17.5% higher than the $182.4 billion seen last year.   Cloud system infrastructure services, is expected to   enjoy growth of 27.5%    in 2019, reaching $38.9 billion.",
    "That bodes well for Microsoft. While Amazon is still the   leading cloud service provider with 31.5% market share in cloud   infrastructure services, Microsoft is   seeing the fastest    growth in that segment of the market, growing 63.6% during   the second quarter. Overall, total cloud revenue for its fiscal   fourth quarter ended June 30 was $33.7 billion, up 12% on a   year-over-year basis.",
    " Microsoft's cloud transformation started with     Nadella ",
    "The growth in Microsoft's cloud computing business shouldn't   be too surprising for anyone who has followed the software giant   over the past few years. Ever since current Chief Executive Satya   Nadella came on board in 2014, Microsoft has been focused on   cloud computing and mobile services. It has been pouring billions   of dollars into the efforts. Today it is among the few cloud   computing players that cover all the aspects of the marketplace.   That means Microsoft is able to get recurring revenue from   commercial and consumer customers alike.",
    "Revenue in its   commercial cloud business    grew 39% to $11 billion in its fiscal fourth-quarter marking the   strongest three month period for that part of the business.   Microsoft's Office 365 Commercial business drove the growth, with   revenue up 31% year-over-year. Microsoft doesn't break-out   revenue for Azure, its cloud computing service that competes   head-on with Amazon, but it's clear it is focused on displacing   its rival. To achieve that end, Microsoft is providing businesses   with more reasons to switch to its services. During the   year, the technology powerhouse began bundling Azure with its   Office products to appeal to more customers. It's a strategy that   appears to be resonating. In July it   announced    a $2 billion deal with   AT&T    (NYSE: T) to move most of the telecom provider's non-network   workloads to the public cloud by 2024. As part of the deal,   AT&T's workforce will use Microsoft 365 cloud-based   productivity and collaboration tools.",
    "It's also forging partnerships in the cloud marketplace with   the likes of   Oracle    ,   Adobe    ,   Dell Technologies    and   SAP     among others that round out its offerings and help it eat   away at Amazon's dominance.",
    "  Getty Images ",
    "Getty Images",
    "  Microsoft     stock      poised to sail as it eats away at Amazon's lead ",
    "Microsoft's strong showing in the cloud market hasn't been   lost on investors and Wall Street, which have been sending the   stock higher over the past few years. When    Microsoft   report    ed its fiscal fourth-quarter results the stock surged in   after-hours trading. Shares have come down a bit since then but   is still up 40% so far this year.",
    "Some Wall Street analysts are betting Microsoft will   eventually surpass Amazon, to become the leader. In a recent   research report, Wedbush Securities analyst Dan Ives said there   has been an acceleration of large enterprise cloud deals during   the second quarter in the U.S. and Europe and that Microsoft is   poised to win many of them.",
    "  10 stocks we like better than Microsoft       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Microsoft wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Microsoft       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Microsoft wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors. Suzanne Frey, an executive at Alphabet, is a member     of The Motley Fool's board of directors. Teresa Kersten, an     employee of LinkedIn, a Microsoft subsidiary, is a member of     The Motley Fool's board of directors.     Donna Fuscaldo      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Alphabet (A shares), Alphabet (C     shares), Amazon, and Microsoft. The Motley Fool has the     following options: long January 2021 $85 calls on Microsoft.     The Motley Fool recommends Adobe Systems. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:39:00"
}