{
  "url": "https://www.nasdaq.com/article/pound-punished-in-high-drama-cm1206504",
  "title": "Pound Punished in High Drama - Nasdaq.com",
  "text": [
    "Overview:  A showdown between UK Prime Minister Johnson and Parliament over Brexit pushed sterling below $1.20.  The euro is extended its losses after finishing last week below $1.10.  Growth concerns are seeing equities retreat.  Japanese and Chinese shares managed to eke out gains, but the Asia Pacific and European stocks have been sold.  The Dow Jones Stoxx 600 has been turned back from key target reached yesterday and is snapping a three-day advance today.  US shares are trading heavily in Europe, and the S&P 500 may open more than 0.8% lower.  Benchmark 10-year yields are falling three-six basis points today, with some European bonds, like Germany, Netherlands, and Italy falling to new record lows.  The dollar is broadly higher against most major and emerging market currencies.  Although the Swiss National Bank does not appear to have intervened last week, the franc's safe-haven status pales compared with the Japanese yen. The yen is posting minor gains today, and the Australian dollar is also resisting greenback strength following news of its first current account surplus in a generation.  Among emerging markets, the lower than expected CPI is spurring talk that Turkey has scope to cut rates again next week, and this is seeing some demand for the lira.      ",
    "Asia Pacific",
    "China continues to resist pressure on the yuan.  The PBOC's dollar reference rate was set at CNY7.0884 vs. CNY7.0883 on Monday.  Bank models had it closer to CNY7.1040.  The dollar approached CNH7.1965, but participants pulled back from testing CNH7.20 for fear of triggering a more aggressive response by officials.  Some are rolling positions into options, favoring CNH7.25 and CNH7.35 strikes.  A couple of large US banks are forecasting CNY7.50 by year-end. ",
    "The Reserve Bank of Australia as widely expected left the cash rate at 1.0% today.  Many expect a rate cut in Q4 19 and another in Q1 19.   Separately, Australia reported a decline in July retail sales and its first quarterly current account surplus in nearly 45 years.   Retail sales fell 0.1%.  The median forecast was for a 0.2% gain after a 0.4% rise in June.  Australia recorded an A$5.9 bln current account surplus in Q2, which was nearly four times larger than expected.  The Q1 deficit was revised from a nearly A$3 bln deficit to an A$1.1 bln shortfall. ",
    "South Korea shaved its Q2 GDP to 1.0% from 1.1% and reported half the gain expected in August CPI, pushing the year-over-year rate to zero.  In July it was at 0.6%.  The base effect with a 0.2% month-over-month rise weighed on the measure.  The core rate slipped to 0.9% from 1.0%.  The central bank does not meet until the middle of next month.  Its key policy rate (seven-day repo) is at 1.5%.  The July cut unwound the hike from last November.  Another cut looks likely.  ",
    "The dollar has been confined to yesterday's range against the yen (~JPY105.90-JPY106.40).  There are $1.3 bln in expiring options struck at JPY106.15-JPY106.20.  The greenback's lows were recorded in the European morning, and the intraday technicals suggest scope for a recovery in the North American morning.  The Australian dollar slipped through $0.6700 but recovered and now faces resistance in the $0.6735-$0.6740 area.  Here the intraday technical readings warn that the cap may hold.  Indian stocks came under pressure following disappointing GDP figures last week, and the rupee is making new lows for the year against the dollar.  ",
    "Europe",
    "The battle lines are drawn in the UK.   The House of Commons will consider a bill to request a three-month delay of Brexit if a deal is not agreed upon by mid-October.  Prime Minister Johnson recognizes this as an attempt to prevent a no-deal Brexit.  Johnson says the EU will capitulate when it sees that nothing will stop the UK from leaving at the end of next month.  However, thus far, the EC has shown no real signs of wavering.  Johnson threatens that if the government loses today's vote, tomorrow he will call a snap election (October 14).  However, the rub is that it is no longer within the PM's power to call an election and he would need 2/3 of the House of Commons or 434 votes to do so.  The Tories have 311 MPs assuming none are forced out of the party as Johnson has threatened over today's vote.  ",
    "Italy's political storm, triggered by the League's withdrawal of from the government, maybe nearly over.  Prime Minister Conte may have succeeded in forging a new coalition.  This one, between the Five Star Movement and the Democrat Party, seems almost as unwieldy as the last one, but their common hostility to Salvini may be sufficient allow the country to move forward on the 2020 budget and some political reforms.  With a little bit of luck, the worst economic news may be behind it.  Tomorrow, Italy reports the August composite PMI.  It may have slipped after rising to 51.0 in July from, its third monthly increase.  The composite bottomed last October-November at 49.3.  It was still below the 50 boom/bust level in May. ",
    "Turkey reported a larger than expected decline in inflation, and this is fueling expectations for another large rate cut.  August CPI fell to 15.01% from 16.65% in July.  The core rate fell to 13.6% from 16.2%.  The one-week repo rate stands at 19.75% following the 425 bp cut in July.  The base effect suggests further declines are likely in the coming months.  The central bank projects it will end the year a little below 14%, but this may be a conservative estimate.  The central bank meets on September 12, and a 200-300 bp rate cut is possible.  ",
    "The euro closed last week below $1.10 and has been unable to resurface above there yesterday or today.  It fell to almost $1.0930 in Asia before steadying and reached $1.0950 in the European morning.  There are nearly two bln euros in options struck at $1.0945-$1.0950 that will expire later today but are very much in play now.  The $1.10 level has a 2.3 bln euro option strike that also will be cut,, though it seems safe.  The break of $1.10 suggests the next target is near $1.08.  There is a gap from April 2017 that is bound between roughly $1.0780 and $1.0820 that may attract prices.  Sterling has been battered through $1.20.  The next target is the flash crash low from October 2016, for which there is some disagreement on the exact level it reached.  Bloomberg has it near $1.1840.  There is an option for GBP270 mln at $1.20 that expires today.  ",
    "America",
    "The US reports the August manufacturing PMI and ISM today alongside July construction spending.  While there may be some headline risk, the focus is on tomorrow's auto sales report and Fed's Beige Book, followed by the employment data at the end of the week.  The market has no doubt that the Fed will deliver its second rate cut of the year at the conclusion of its meeting on September 18.  However, CME's model suggests less than a 3% chance of a 50 bp, while the Bloomberg model puts it at a nearly 20% chance.  Subjectively, we suspect there is little chance of a 50 bp move, given the Fed's rhetoric and the still above-trend growth, full employment, and some acceleration in prices recently.  There are at least seven Fed officials speaking in the coming days, beginning with Rosengren, one of two dissents from the decision to cut rates in July, and ending with a speech by Powell in Switzerland ahead of the weekend. ",
    "Canada reports August manufacturing PMI today, but the focus is on tomorrow Bank of Canada meeting.  The cash rate is expected to remain steady at 1.75%, but speculation has mounted in recent weeks for an October 30 cut (~55% chance appears discounted in the derivatives market).  To validate the speculation, the Bank of Canada will have to soften its neutral stance.   Canada also reports its August employment data ahead of the weekend, and a bounce back after a soft July is anticipated.  Canada's national election will be held on October 21.  ",
    "The US dollar is looking to extend its seven-week rally against the Canadian dollar.  It rose in quiet trade yesterday and is rising further today.  Indeed, the greenback is at its best level since mid-June today near CAD1.3365.  This area corresponds to a retracement objective and suggests the next target is in the CAD1.3400-CAD1.3435 area.  Support now is seen in the CAD1.3315 area.  Mexico has a light calendar this week.  The dollar has risen against the peso for the past seven weeks as well.  Yesterday and so far today it is trading within the range seen before the weekend of roughly MXN20.00-MXN20.20.  Today bids are being found near the midpoint of the range.  The high from last December was set near MXN20.65.  The Dollar Index rose 1.3% last week, the most in since mid-June 2018.  It tested 99.00 ahead of the weekend and is now near 99.35.  The next target is 100.00-100.15.    ",
    "This article was originally published on Marc to Market.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:46:15"
}