{
  "url": "https://www.nasdaq.com/article/crude-falls-on-rising-output-trade-dispute-cm1206570",
  "title": "Crude Falls on Rising Output, Trade Dispute - Nasdaq.com",
  "text": [
    " SECTOR COMMENTARY ",
    "The energy sector is set to kick off the shortened-holiday week lower, weighed down by weakness in the crude complex and broader equity futures which slid as the US's new round of tariffs on some Chinese goods kicked in over the weekend and after a report that officials from both sides were struggling to decide on the schedule for a meeting this month. The markets will also be looking towards manufacturing data later this morning which is expected to shed some light on the impact of the trade war on the trade-sensitive U.S. industrial sector and management comments coming out of the Barclays Energy conference over the next three days for feedback on the health of the space.",
    "WTI crude oil futures were down over 2% this morning, marginally trailing Brent, pressured by reports of rising OPEC and Russian oil output as well as the protracted U.S.-China trade dispute. Reports this morning showed output from the OPEC rose in August for the first month in 2019, as higher supply from Iraq and Nigeria outweighed restraint by Saudi Arabia and losses caused by U.S. sanctions on Iran. That data also showed Russian oil production in August rose to 11.294 million bpd, topping the rate cap pledged by Moscow. The commodity markets are also digesting news that Saudi Arabian Energy Minister Khalid al-Falih is no longer on the board of directors of Aramco, replaced by the head of the kingdom's sovereign wealth fund, Yasir al-Rumayyan, as chairman.",
    "Natural gas futures bucked the trend this morning and are up just over 0.25%, adding to last week's +6% gain on the impact Hurricane Dorian is having in the South East and on warming weather forecasts for key consuming regions",
    " U.S. INTEGRATEDS ",
    "(Late Friday) Reuters - Major offshore oil and gas producers were evacuating non-essential staff from production platforms in the U.S. Gulf of Mexico due to the threat from Hurricane Dorian. BP, Chevron  and BHP Group said they had or were in the process of removing some workers from their facilities as a precautionary measure. Each said oil and gas production at the offshore facilities was unaffected.",
    "Press Release - Danish pension fund MP Pension said it would sell its stakes in 10 of the world's biggest oil firms as it seeks to divest major sources of carbon emissions from its portfolio. MP Pension said it would sell its stakes in ExxonMobil  , BP, Chevron  , PetroChina, Rosneft, Royal Dutch Shell, Sinopec, Total, Petrobras and Equinor.",
    "Press Release - W&T Offshore announced that it has closed the previously-announced purchase of ExxonMobil  's interests in and operatorship of oil and gas producing properties in the eastern region of the Gulf of Mexico, offshore Alabama, and related onshore and offshore facilities and pipelines. After taking into account customary closing adjustments and an effective date of January 1, 2019, cash consideration paid by W&T was $167.6 million which includes a previously-funded $10 million deposit. The acquisition was funded by cash on hand and borrowings on its previously-undrawn revolving bank credit facility; W&T will also assume asset retirement obligations associated with these assets.",
    " INTERNATIONAL INTEGRATEDS ",
    "Reuters - BP  may be interested in Polish refiner PKN Orlen's assets if they are up for sale as a result of an investigation by the European Commission into PKN's plan to buy smaller rival Lotos.",
    "(Late Friday) Reuters - BP  evacuated non-essential staff from its four operated offshore oil production platforms in the U.S. Gulf of Mexico, joining several other firms taking similar steps. The oil major said the evacuations covered its Atlantic, Mad Dog, Na Kika and Thunderhorse platforms. Oil and gas production continues unaffected at the four facilities.",
    "Press Release - Danish pension fund MP Pension said it would sell its stakes in 10 of the world's biggest oil firms as it seeks to divest major sources of carbon emissions from its portfolio. MP Pension said it would sell its stakes in ExxonMobil, BP  , Chevron, PetroChina, Rosneft, Royal Dutch Shell  , Sinopec, Total  , Petrobras  and Equinor.",
    "Reuters - Petroleo Brasileiro SA Petrobras  produced 3 million barrels of oil equivalent per day on average in August. Petrobras said that in Brazil's coveted pre-salt area it produced 2.2 million barrels of oil equivalent per day on average for the month.",
    "(Monday) Reuters - Petroleo Brasileiro SA Petrobras  announced the binding phase of the sale of its 11 oil fields in shallow waters of the Santos basin and collectively known as Polo Garoupa. Petrobras said in a securities filing that oil fields called Anequim, Bagre, Cherne, Congro, Corvina, Malhado, Namorado, Parati, Garoupa, Garoupinha and Viola are located 80 km (50 miles) off the coast and produced an average of 19,600 barrels a day in the past 12 months.",
    "(Late Friday) Reuters - Petroleo Brasileiro SA Petrobras  said that it would extend the deadline for parties to state their interest in buying four refineries it has put up for sale, based on high investor interest. Petrobras extended the deadline to Sept. 16 for firms to enter the first phase of the sales process, it said in a securities filing. Investors then have until Sept. 27 to sign confidentiality and other agreements required to advance in the sales process. The oil firm is selling its Abreu e Lima (RNEST), Landulpho Alves (RLAM), Presidente Getúlio Vargas (REPAR) and Alberto Pasqualini (REFAP) refineries and associated assets. Together the four refineries represent 37% of Brazil's refining capacity, according to Petrobras. The deal is expected to raise billions of dollars for the oil firm.",
    "(Late Friday) Reuters - Brazilian securities regulator CVM suspended a 3 billion-real ($728 million) local debt issuance by state-run oil firm Petroleo Brasileiro SA Petrobras  , after the firm's chief financial officer allegedly broke quiet period regulations. The suspension lasts \"up to 30 days,\" the regulator said, but the length of the suspension can be reduced if a series of mitigation measures are carried out, such as the removal of the interview with the company's CFO that was posted on YouTube and referred to the issuance.",
    "(Late Friday) Reuters - The coker at Royal Dutch Shell  's 225,300-barrel-per-day (bpd) Norco, Louisiana, refinery was shut by a malfunctioning valve. The 25,000-bpd coker restarted on Aug. 21 from a monthlong overhaul.",
    "Reuters - Total  could invest up to $10 billion in the North Sea over the next five years but cost discipline must be maintained as a matter of urgency, Chief Executive Officer Patrick Pouyanne said. As part of its efforts to cut costs the company had looked at joint oil and gas infrastructure decommissioning in the region with peers Royal Dutch Shell  and BP  , Pouyanne told an industry conference in Aberdeen, Scotland. He added that Total intended to participate in an upcoming offshore wind bid round in Scotland as the firm continues to expand investments in low carbon and renewable energy. Total was not limited by funds to invest in low carbon power projects, but by the capacity to develop projects, he said.",
    "(Monday) Press Release - Two new members have joined Total  's Executive Committee. As of August 1, 2019, Jean-Pierre Sbraire is Chief Financial Officer and member of the Total Executive Committee, following Patrick de La Chevardière's retirement. And as of August 19, 2019, Helle Kristoffersen is President, Strategy & Innovation and a Total Executive Committee member. The position was previously held by Philippe Sauquet, now focusing on his responsibilities as President, Gas Renewables & Power.",
    "Reuters - Papua New Guinea said it would honour a gas deal that Total  signed with a previous government for a $13 billion plan to expand gas exports, after securing promises from the French company to consider some future benefits for the country.",
    "Reuters - Australia's Oil Search said Papua New Guinea will likely make a decision on the Papua LNG deal with French oil major Total  later, ending months of uncertainty for the project that would double gas exports from the Pacific nation.",
    " CANADIAN INTEGRATEDS ",
    "(Late Friday) Reuters - Husky Energy  said its Superior, Wisconsin, refinery is making steady progress in its plans to return to full operations, with the rebuild activity expected to begin in the fall of 2019, pending regulatory approvals. Demolition work is underway at the 38,000-barrel-per-ay (bpd) refinery, with a target of resuming operations in 2021. The Superior refinery was projected to reopen in late 2020 following $400 million in repairs from an April 2018 explosion and fire.   ",
    " U.S. E&PS ",
    "Press Release - Cimarex Energy  announced that its Board of Directors approved a cash dividend of $20.3125 per share on its 8⅛ percent Series A Cumulative Perpetual Convertible Preferred Stock. The dividend is payable on October 15, 2019, to holders of record at the close of business on October 1, 2019, and is for the period beginning on July 16, 2019 and ending on October 15, 2019.",
    "Press Release - Concho Resources  announced that it has entered into a definitive agreement to sell its assets in the New Mexico Shelf to an affiliate of Spur Energy Partners LLC for $925 million. In addition, the Company's board of directors authorized the initiation of a repurchase program of up to $1.5 billion of the Company's shares of common stock.",
    "(Monday) Reuters - A World Bank arbitration panel lowered an initial $8.7 billion award to U.S. oil company ConocoPhillips  as compensation for Venezuela's 2007 expropriation of its assets to $8.5 billion, according to a decision dated August 29 posted online.",
    "Press Release - Penn Virginia  announced that Tiffany Thom Cepak and Jeffrey E. Wojahn have been appointed to the Company's Board of Directors, effective immediately.",
    "Press Release - W&T Offshore  announced that it has closed the previously-announced purchase of ExxonMobil's interests in and operatorship of oil and gas producing properties in the eastern region of the Gulf of Mexico, offshore Alabama, and related onshore and offshore facilities and pipelines. After taking into account customary closing adjustments and an effective date of January 1, 2019, cash consideration paid by W&T was $167.6 million which includes a previously-funded $10 million deposit. The acquisition was funded by cash on hand and borrowings on its previously-undrawn revolving bank credit facility; W&T will also assume asset retirement obligations associated with these assets.",
    " CANADIAN E&PS ",
    "Press Release - Crescent Point Energy  announced that it has entered into definitive agreements with select parties to sell its Uinta Basin asset in its entirety and certain southeast Saskatchewan conventional assets for total cash consideration of approximately $912 million.",
    " OILFIELD SERVICES ",
    "Zephirin Group upgraded Basic Energy Services, Core Laboratories NV, Halliburton,  and National Oilwell Varco,  to 'Buy' from 'Hold.'",
    "(Monday) Press Release - CGG  announced that its third quarter 2019 segment revenue is expected to be above $350m, based on strong multi-client sales in the range of $160m (including transfer fees) and steady demand for Geoscience technology and Equipment. Based on these estimates and considering current solid commercial outlook, CGG is raising its full-year 2019 guidance. The Company's 2019 segment revenue is expected to increase by more than 10% year on year with segment EBITDAs margin around 50% and segment operating income around $200m. As a result, CGG is expecting to generate positive Net Cash Flow this year, for the first time since 2012.",
    "(Late Friday) Press Release - ION Geophysical  announced that the United States District Court for the Southern District of Texas refused WesternGeco's request to reinstate a $100 million lost profits award against ION, and instead ordered a new trial to determine what lost profits, if any, WesternGeco is entitled to from surveys performed by ION's customers outside of the United States.",
    "Press Release - National Oilwell Varco  has been awarded equipment package and design orders for one of the world's largest offshore wind turbine installation vessels by Japanese-based Shimizu Corporation. NOV, through its subsidiary GustoMSC, has worked closely with Shimizu on the customized jack-up design which has a total tonnage of 28,000t and is capable of accommodating 130 people. The vessel will also incorporate a proprietary 2500t telescopic leg crane designed specifically for the offshore wind market to provide a unique combination of high elevation hoisting capability for turbine installation and heavy load capability for foundation installation. Japan Marine United shipyard will carry out the construction of the unit.",
    " DRILLERS ",
    "Zephirin Group upgraded Nabors Industries  to 'Buy' from 'Hold.'",
    "Zephirin Group dropped coverage of Seadrill  .",
    "(Monday) Press Release - Seadrill  has secured a one year contract with LLOG Exploration Offshore, L.L.C., for the West Neptune operating in the US Gulf of Mexico.  Total contract value is expected to be approximately $74 million with commencement in December 2019, in direct continuation of the existing contract with LLOG.",
    " MLPS & PIPELINES ",
    "Press Release - Cheniere Energy  announced that Substantial Completion of Train 2 of the Corpus Christi liquefaction project was achieved on August 28, 2019. Commissioning is complete and Cheniere's EPC partner Bechtel Oil, Gas and Chemicals, Inc. has turned over care, custody, and control of Train 2 to Cheniere. Cheniere, its subsidiaries, and Bechtel have now declared Substantial Completion on seven liquefaction trains at the Corpus Christi liquefaction project and the Sabine Pass liquefaction project ahead of each train's guaranteed completion date and within project budgets.",
    "(Late Friday) Press Release - Enbridge  announced that it has reached a commercial agreement with shippers to place the Canadian portion of the Line 3 replacement pipeline into service by the end of this year. This agreement reflects the importance of this safety-driven maintenance project to protecting our environment and ensuring the continued safe and reliable operation of the pipeline well into the future. Enbridge will be filing a tariff with the Canada Energy Regulator for a temporary surcharge with a proposed effective date of December 1, 2019. This tariff will be superseded by the full negotiated Line 3 tariff upon completion of the U.S. segment of the pipeline.",
    "Scotiabank assumed coverage of Enterprise Products Partners  , MPLX  , Phillips 66 Partners  , Plains All American Pipeline  , and Plains GP Holdings  at \"Sector Outperform.\"",
    "Press Release - Enterprise Products Partners  announced that Graham W. Bacon was elected Executive Vice President and Chief Operating Officer, and Brent B. Secrest has been elected Executive Vice President and Chief Commercial Officer, effective immediately.",
    "(Late Friday) Reuters - On August 28, 2019, Holly Energy Partners  and Alon USA, LP (\"Delek\") entered into the Fifth Amendment to the Pipelines and Terminals Agreement dated February 28, 2005, pursuant to which HEP and Delek agreed to extend the term of the Agreement from February 28, 2020 to March 31, 2020 as HEP and Delek continue discussions with respect to the renewal of services provided under the Agreement.",
    "Scotiabank assumed coverage of Kinder Morgan  , and Western Midstream Partners  at \"Sector Perform.\"",
    " MARKET COMMENTARY ",
    "Wall Street futures traded in the red, in line with  global market  s, as U.S.-China trade tensions drove investors to safer assets. In  currency market  , the euro fell against the dollar over rising expectations of a deeper rate cut by the European Central Bank next week. The pound slumped on Prime Minister Boris Johnson's implicit ultimatum to lawmakers to back him on Brexit or face an election. Oil fell, weighed down by rising OPEC and Russian crude output. Gold edged up, but gains were capped by a strong greenback. Markit Manufacturing PMI data for August is due later in the day.",
    " NASDAQ ENERGY TEAM THOUGHT LEADERSHIP ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:15:00"
}