{
  "url": "https://www.nasdaq.com/article/8-announcements-from-the-apple-event-including-the-new-iphone-11-cm1210655",
  "title": "8 Announcements From the Apple Event — Including the New iPhone 11 - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "The success of Apple (NASDAQ: AAPL ) over the past decade has been largely driven by the iPhone. Sales of the smartphone propelled Apple stock to huge gains, but those sales have been sputtering lately. So investors were eagerly anticipating the September 10 Apple event, where the company was expected to take the wraps off its answer to those struggling iPhone sales.",
    "The company didn't disappoint, unveiling a trio of new iPhones - including the iPhone 11 - along with other new hardware. Apple also announced pricing and launch dates for its new services - which are now more critical than ever . Here's everything you need to know about yesterday's Apple event.",
    "As expected, the new iPhone 11 Pro took center stage. The new flagship iPhone is priced the same as last year's iPhone XS, but has some big improvements.",
    "The iPhone 11 Pro gets a new Super Retina XDR display (a 5.8-inch OLED panel that's brighter and more energy efficient), and the powerful new A13 Bionic processor. It gains a whopping four hours of battery life compared to the iPhone XS, and comes with a faster 18W recharger in the box. But the big upgrade this year was the camera, which moves to a triple camera system, with a 12MP ultra-wide lens added to the 12MP telephone lens and 12MP wide angle lens. The cameras also get a Night mode to take on the low light performance of the Pixel smartphone from Alphabet's (NASDAQ: GOOG , NASDAQ: GOOGL ) Google. The front-facing selfie cam can now take 4K video.",
    "Apple also added a new Midnight Green color option.",
    "The iPhone 11 Pro starts at $999 for 64GB of storage, with pre-orders starting on September 13.",
    "Apple continued its pattern of releasing a super-sized version of its flagship with the iPhone 11 Pro Max. The Pro Max matches the iPhone 11 Pro's specs, but with a 6.5-inch Super Retina XDR display and a five-hour gain in battery life.",
    "The iPhone 11 Pro Max starts at $1099 for 64GB of storage, with pre-orders starting on September 13.",
    "Arguably the biggest announcement at this Apple event was the iPhone 11. The replacement to last year's iPhone XR is significantly better than the model it replaces - and $50 cheaper. When was the last time Apple, lowered the price of a new product?",
    "The iPhone 11 has the same 6.1-inch LCD display, and comes in a range of colors (including new options green and purple). It gets the same A13 Bionic processor as the Pro models, helping it to gain an extra hour of battery life. Water resistance has improved from IP67 to IP68. But the big news is a switch to a dual camera system, with wide angle and ultra-wide angle. Basically, what was offered with last year's flagship iPhone XS, but instead of telephoto for the second camera the iPhone 11 gets the new ultra-wide option. The cameras both shoot 4K video and get the new Dark mode, with the front camera also getting an upgrade to 12MP and 4K capability.",
    "The iPhone 11 starts at $699 for 64GB of storage, with pre-orders starting on September 13.",
    "In addition to the new iPhones, Apple lowered the price of the iPhone XR to $599 while the iPhone 8 will be available from $449.",
    "The Apple Watch has turned into a success story for AAPL, and the Apple Watch Series 5 was announced yesterday.",
    "The newest Apple Watch looks much the same as last year's Series 4, but the big new feature is an always-on Retina display. Despite never shutting off completely (it does dim when in the down position), the Apple Watch Series 5 still maintains the 18-hour battery life of last year's model. The Series 5 also gets international emergency calling. Apple introduced new case options including Titanium and Recycled Aluminum, along with Ceramic. ",
    "The Series 4 has been discontinued, but to offer a low-cost alternative that can better compete against Fitbit (NASDAQ: FIT ) on price, the Apple Watch Series 3 price has been lowered to $199.",
    "Apple Watch Series 5 starts at $399 ($499 for cellular) and is available now for pre-order.",
    "Apple is trying to keep its recent iPad sales momentum going and introduced a new entry level iPad to replace the 9.7-inch iPad released last spring .",
    "This seventh generation iPad keeps the same price at $329 ($299 for education customers), but the Retina display is boosted from 9.7-inches to 10.2-inches. It still uses a Lightning port - unlike the iPad Pro that switched to USB-C - but gains a Smart Connector that makes it compatible with Apple's full-sized Smart Keyboard. It also supports the first generation Apple Pencil.",
    "The new iPad is available for pre-order now, starting at $329 for 32GB of storage.",
    "Apple announced its Apple TV+ streaming video service launches on November 1, and surprised with the news that a family subscription will be priced at $4.99 per month, with a free 7-day trial. That undercuts rival streaming services like Disney's (NYSE: DIS ) $6.99 Disney+ , although Apple TV+ will have considerably less content at launch.",
    "Sweetening the deal - and leveraging its Apple ecosystem advantage to boost adoption - the company will be offering one year of free AppleTV+ to anyone who buys a new iPhone, iPad or Apple TV. ",
    "AAPL also confirmed the details on its Apple Arcade gaming subscription at yesterday's Apple event. After spending $500 million to bring 100 exclusive titles to the service, Apple Arcade will be priced at $4.99 per month. That's about half of what we were expecting Apple to charge.",
    "Apple Arcade games are playable on the iPhone, iPad, iPod Touch, Mac and Apple TV, with support for third party controllers. Apple Arcade will be available on the App Store, starting September 19.",
    "Along with the new hardware and services, the Apple event also saw demonstrations of the new operating systems coming to Apple devices.",
    "The most important of these is iOS13 - which powers the iPhone - and it has a number of features that should keep those iPhone users happy. Apple Maps is getting a big refresh including real-time public transit estimates and a street view. Siri gets a new, more natural sounding voice. And with iOS13, iPhone owners also get an optional Dark mode.",
    "Look for iOS 13, tvOS 13 and watchOS 6 on September 19, with iPadOS 13 on September 30 and macOS Catalina in October.",
    "Investors and analysts were watching yesterday's Apple event carefully. Even with a year of sliding sales, the iPhone accounted for 48% of APPL revenue in the last quarter. So the next generation of Apple's smartphone is critical. The iPhone 11 Pro series seems well positioned to appeal to premium smartphone buyers, despite lacking 5G support. And the iPhone 11 - with dual cameras and a price cut compared to last year's iPhone XR - could be a big seller. ",
    "In fact, the move to offering lower-prices across much of its hardware line was a big move for Apple. Consumers can pick up previous generation models of the iPhone and Apple Watch for much lower prices than previously, making AAPL more competitive. The same holds true for Apple Arcade and Apple TV+ with both services undercutting competing subscription services.",
    "Apple stock got a 1.18% bump after the Apple event, so investors were happy with what they saw, at least at first glance. Now it's up to the company to get people into Apple Stores and buying…",
    "As of this writing, Brad Moon did not hold a position in any of the aforementioned securitie s.",
    "The post 8 Announcements From the Apple Event - Including the New iPhone 11 appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:20:35"
}