{
  "url": "https://www.nasdaq.com/article/top-buys-by-top-brass-chief-executive-officer-lowreys-6276k-bet-on-pru-cm1210580",
  "title": "Top Buys by Top Brass: Chief Executive Officer Lowrey's $627.6K Bet on PRU - Nasdaq.com",
  "text": [
    "A company's own top management tend to have the best inside view into the business, so when company officers make major buys, investors are wise to take notice. Presumably the only reason an insider would take their hard-earned cash and use it to buy stock of their company in the open market, is that they expect to make money - maybe they find the stock very undervalued, or maybe they see exciting progress within the company, or maybe both. So in this series we look at the largest insider buys by the ''top brass'' over the trailing six month period, one of which was a total of $627.6K by Charles F. Lowrey, Chief Executive Officer at Prudential Financial Inc (Symbol: PRU).     Lowrey's average cost works out to $83.68/share. Shares of Prudential Financial Inc were changing hands at $86.86 at last check, trading up about 0.2% on Wednesday. The chart below shows the one year performance of PRU shares, versus its 200 day moving average:     makeArticleAd();  Looking at the chart above, PRU's low point in its 52 week range is $75.6094 per share, with $106.64 as the 52 week high point - that compares with a last trade of $86.86.    The current annualized dividend paid by Prudential Financial Inc is $4/share, currently paid in quarterly installments, and its most recent dividend ex-date was on 08/19/2019. Below is a long-term dividend history chart for PRU, which can be of good help in judging whether the most recent dividend with approx. 4.6% annualized yield is likely to continue.      Click here to find out which other top insider   buys by the ''top brass'' you need to know about »  ",
    "  Click here to find out which other top insider   buys by the ''top brass'' you need to know about » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 12:06:05"
}