{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-nrg-unitil-general-mills-boston-beer-and-penn-national-cm1207332",
  "title": "The Zacks Analyst Blog Highlights: NRG, Unitil, General Mills, Boston Beer and Penn National - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 4, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: NRG Energy, Inc. NRG  , Unitil Corp. UTL  , General Mills, Inc. GIS  , The Boston Beer Company, Inc. SAM  and Penn National Gaming, Inc. PENN  .  Here are highlights from Tuesday's Analyst Blog:    5 Rock-Solid Stocks to Buy as September Looks Tough   Summer is unofficially over and traders are back in business after an extended Labor Day break. But, September is historically the worst month for the stock market. And this September, particularly, can be a tough one as it follows a volatile August. Trade-related uncertainties and economic slowdown are primarily responsible for the market's volatile streak. Given such bearishness, investors should pick stocks that have a steady stream of customers, irrespective of market conditions.  September: Typically Rocky for Stocks  Stocks tend to wobble in September. According to Dow Jones Market Data, since 1937, both the S&P 500 and the Dow averaged a loss of 1%. The Nasdaq Composite, as incepted in 1971, averaged a loss of 0.5%. CFRA added that the broader S&P 500 has averaged a 1% decline, particularly, in September since 1946. What's more, September is gloomier after a downbeat August. It was a wild month for the stock market, with the S&P 500, the Dow and the Nasdaq registering a loss of 1.8%, 1.7% and 2.6%, respectively. By the way, this marked the worst August performance for the bourses since 2015. And whenever S&P 500 has lost more than 1.5% in August, the Dow declined an average 1.1% in September, while the Nasdaq has saw an average drop of 0.8%. The S&P 500, itself, continued its losing run, falling 0.9%.  What Happened in August?  Escalating trade tensions and signs of a recession dealt a heavy blow to stocks during August. The S&P 500 declined at least 2.6% three times during August, while the Cboe Volatility Index (VIX), better known as fear gauge index, traded as high as 24.81 before pulling back to around 18. The U.S.-China trade tussle intensified last month after President Trump urged American firms to start looking for an \"alternative to China.\" Trouble began after China announced plans of imposing tariffs of 5% and 10% on nearly $75 billion of U.S. products. Beijing clarified that the move was due to the Trump administration's intention to impose 10% tariffs on $300 billion of Chinese imports. Trump, in the meantime, reacted to China's decision by saying that the United States will increase tariffs on $250 billion of Chinese goods to 30% from an earlier 25%. And tariffs on additional $300 billion imports from China would go up to 15% from 10%. Meanwhile, the benchmark 10-year Treasury yield's fall below the 2-year Treasury yield added to the bearish sentiments. With the 10-year rate below the 2-year note, fixed income traders are expecting a slowdown in the near term. Lest we forget, the 2-year yield has always surpassed the 10-year note in every slowdown over the past 50 years. So, what led to the inverted yield curve? Thanks to the ever-changing China-trade narrative, the stock market continues to gyrate, compelling investors to pull money out of equities and opt for safe-haven government bonds, eventually leading to a decline in the 10-year Treasury yield. After all, bond yields tend to move opposite to prices.  Things Not Rosy This September  U.S.-China trade war, in fact, shows no signs of cooling down this month. Tariffs of 15% on $112 billion of Chinese goods have been put into effect on Sep 1, as did retaliatory Chinese tariffs on U.S. commodities, including crude-oil imports. Now, nearly two-thirds of the consumer goods that the United States imports from China will face higher taxes. Americans have to pay more for items like shoes, clothes and sporting goods. Trump's higher tariffs will now impact consumer spending, which has been one of the driving factors for the economy. Needless to say, business houses have lowered spending and exports have slowed down in the face of weak global growth. Both Washington and Beijing are struggling to de-escalate the trade war, with the United States accusing China of stealing trade secrets and unfairly subsidizing its own companies to make headway into high-tech fields such as AI and electric cars.  5 Best Stocks to Buy in September  With things not looking up on the trade front and yield curve remaining inverted, choppy trading sessions are expected to persist this September. However, contrary to popular belief, there are stocks that do well during market gyrations. Prominent among them are defensive stocks. These stocks are generally non-cyclical, or companies whose business performance and sales are not highly correlated with activities in the larger market. Their products are in constant demand, irrespective of market volatility, and such names include companies from the utilities and consumer staples sectors. The idea of investing in \"vice\" stocks can also be considered. After all, products or services in this space are relatively inelastic, and business is slowdown-proof. The very nature of their business ensures a stable stream of consumers, irrespective of market conditions, which eventually leads to higher margins and solid profits. Noteworthy vice stocks include beer and gaming companies. We have, thus, selected five solid stocks from the aforesaid areas that flaunt a Zacks Rank #1 (Strong Buy) or 2 (Buy).  NRG Energy, Inc.  is involved in producing, selling, and delivering electricity and related products and services. It has a Zacks Rank #1. The Zacks Consensus Estimate for its current-year earnings has moved up 4.9% in the past 30 days. The stock's expected earnings growth rate for the current year is 67.7% versus the Utility - Electric Power  industry's estimated rally of 3.2%.  Unitil Corp.  , a public utility holding company, engages in the distribution of electricity and natural gas in the United States. It has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has risen 0.9% in the past 60 days. The stock's expected earnings growth rate for the current year is 4% versus the Utility - Electric Power industry's projected rally of 3.2%.  General Mills, Inc.  manufactures and markets branded consumer foods. It has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has increased 0.9% in the past 90 days. The stock, which is part of the Food - Miscellaneous  industry, is expected to record earnings growth of 8.5% and 4.7% in the current quarter and year, respectively. You can see  the complete list of today's Zacks #1 Rank stocks here  .   The Boston Beer Company, Inc  . produces and sells alcohol beverages, primarily in the United States. It has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has moved up nearly 4% in the past 60 days. The stock's expected earnings growth rate for the current year is 19.5% versus the Beverages - Alcohol  industry's anticipated decline of 1.8%.  Penn National Gaming, Inc.  owns and manages gaming and racing facilities, and operates video gaming terminals with a focus on slot machine entertainment. It has a Zacks Rank #1. The Zacks Consensus Estimate for its current-year earnings has increased 10.5% in the past 60 days. The stock's expected earnings growth rate for the current year is 69.9% versus the Gaming  industry's projected rally of 7.7%. In fact, shares of NRG Energy, Unitil, General Mills, The Boston Beer Company and Penn National Gaming have gained 20.1%, 88.1%, 0.6%, 99.9% and 67.4%, respectively, over the past five-year period. Take a look -  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>   Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Unitil Corporation (UTL): Free Stock Analysis Report   NRG Energy, Inc. (NRG): Free Stock Analysis Report   Penn National Gaming, Inc. (PENN): Free Stock Analysis Report   The Boston Beer Company, Inc. (SAM): Free Stock Analysis Report   General Mills, Inc. (GIS): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 4, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: NRG Energy, Inc. NRG  , Unitil Corp. UTL  , General Mills, Inc. GIS  , The Boston Beer Company, Inc. SAM  and Penn National Gaming, Inc. PENN  .",
    " Here are highlights from Tuesday's Analyst Blog: ",
    "  5 Rock-Solid Stocks to Buy as September Looks Tough  ",
    "Summer is unofficially over and traders are back in business after an extended Labor Day break. But, September is historically the worst month for the stock market. And this September, particularly, can be a tough one as it follows a volatile August.",
    "Trade-related uncertainties and economic slowdown are primarily responsible for the market's volatile streak. Given such bearishness, investors should pick stocks that have a steady stream of customers, irrespective of market conditions.",
    " September: Typically Rocky for Stocks ",
    "Stocks tend to wobble in September. According to Dow Jones Market Data, since 1937, both the S&P 500 and the Dow averaged a loss of 1%. The Nasdaq Composite, as incepted in 1971, averaged a loss of 0.5%. CFRA added that the broader S&P 500 has averaged a 1% decline, particularly, in September since 1946.",
    "What's more, September is gloomier after a downbeat August. It was a wild month for the stock market, with the S&P 500, the Dow and the Nasdaq registering a loss of 1.8%, 1.7% and 2.6%, respectively. By the way, this marked the worst August performance for the bourses since 2015.",
    "And whenever S&P 500 has lost more than 1.5% in August, the Dow declined an average 1.1% in September, while the Nasdaq has saw an average drop of 0.8%. The S&P 500, itself, continued its losing run, falling 0.9%.",
    " What Happened in August? ",
    "Escalating trade tensions and signs of a recession dealt a heavy blow to stocks during August. The S&P 500 declined at least 2.6% three times during August, while the Cboe Volatility Index (VIX), better known as fear gauge index, traded as high as 24.81 before pulling back to around 18.",
    "The U.S.-China trade tussle intensified last month after President Trump urged American firms to start looking for an \"alternative to China.\" Trouble began after China announced plans of imposing tariffs of 5% and 10% on nearly $75 billion of U.S. products.",
    "Beijing clarified that the move was due to the Trump administration's intention to impose 10% tariffs on $300 billion of Chinese imports. Trump, in the meantime, reacted to China's decision by saying that the United States will increase tariffs on $250 billion of Chinese goods to 30% from an earlier 25%. And tariffs on additional $300 billion imports from China would go up to 15% from 10%.",
    "Meanwhile, the benchmark 10-year Treasury yield's fall below the 2-year Treasury yield added to the bearish sentiments. With the 10-year rate below the 2-year note, fixed income traders are expecting a slowdown in the near term. Lest we forget, the 2-year yield has always surpassed the 10-year note in every slowdown over the past 50 years.",
    "So, what led to the inverted yield curve? Thanks to the ever-changing China-trade narrative, the stock market continues to gyrate, compelling investors to pull money out of equities and opt for safe-haven government bonds, eventually leading to a decline in the 10-year Treasury yield. After all, bond yields tend to move opposite to prices.",
    " Things Not Rosy This September ",
    "U.S.-China trade war, in fact, shows no signs of cooling down this month. Tariffs of 15% on $112 billion of Chinese goods have been put into effect on Sep 1, as did retaliatory Chinese tariffs on U.S. commodities, including crude-oil imports.",
    "Now, nearly two-thirds of the consumer goods that the United States imports from China will face higher taxes. Americans have to pay more for items like shoes, clothes and sporting goods. Trump's higher tariffs will now impact consumer spending, which has been one of the driving factors for the economy. Needless to say, business houses have lowered spending and exports have slowed down in the face of weak global growth.",
    "Both Washington and Beijing are struggling to de-escalate the trade war, with the United States accusing China of stealing trade secrets and unfairly subsidizing its own companies to make headway into high-tech fields such as AI and electric cars.",
    " 5 Best Stocks to Buy in September ",
    "With things not looking up on the trade front and yield curve remaining inverted, choppy trading sessions are expected to persist this September. However, contrary to popular belief, there are stocks that do well during market gyrations.",
    "Prominent among them are defensive stocks. These stocks are generally non-cyclical, or companies whose business performance and sales are not highly correlated with activities in the larger market. Their products are in constant demand, irrespective of market volatility, and such names include companies from the utilities and consumer staples sectors.",
    "The idea of investing in \"vice\" stocks can also be considered. After all, products or services in this space are relatively inelastic, and business is slowdown-proof. The very nature of their business ensures a stable stream of consumers, irrespective of market conditions, which eventually leads to higher margins and solid profits. Noteworthy vice stocks include beer and gaming companies.",
    "We have, thus, selected five solid stocks from the aforesaid areas that flaunt a Zacks Rank #1 (Strong Buy) or 2 (Buy).",
    " NRG Energy, Inc.  is involved in producing, selling, and delivering electricity and related products and services. It has a Zacks Rank #1. The Zacks Consensus Estimate for its current-year earnings has moved up 4.9% in the past 30 days. The stock's expected earnings growth rate for the current year is 67.7% versus the Utility - Electric Power  industry's estimated rally of 3.2%.",
    " Unitil Corp.  , a public utility holding company, engages in the distribution of electricity and natural gas in the United States. It has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has risen 0.9% in the past 60 days. The stock's expected earnings growth rate for the current year is 4% versus the Utility - Electric Power industry's projected rally of 3.2%.",
    " General Mills, Inc.  manufactures and markets branded consumer foods. It has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has increased 0.9% in the past 90 days. The stock, which is part of the Food - Miscellaneous  industry, is expected to record earnings growth of 8.5% and 4.7% in the current quarter and year, respectively. You can see  the complete list of today's Zacks #1 Rank stocks here  . ",
    " The Boston Beer Company, Inc  . produces and sells alcohol beverages, primarily in the United States. It has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has moved up nearly 4% in the past 60 days. The stock's expected earnings growth rate for the current year is 19.5% versus the Beverages - Alcohol  industry's anticipated decline of 1.8%.",
    " Penn National Gaming, Inc.  owns and manages gaming and racing facilities, and operates video gaming terminals with a focus on slot machine entertainment. It has a Zacks Rank #1. The Zacks Consensus Estimate for its current-year earnings has increased 10.5% in the past 60 days. The stock's expected earnings growth rate for the current year is 69.9% versus the Gaming  industry's projected rally of 7.7%.",
    "In fact, shares of NRG Energy, Unitil, General Mills, The Boston Beer Company and Penn National Gaming have gained 20.1%, 88.1%, 0.6%, 99.9% and 67.4%, respectively, over the past five-year period. Take a look -",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:36:00"
}