{
  "url": "https://www.nasdaq.com/article/why-guess-ges-could-be-a-top-value-stock-pick-cm1210332",
  "title": "Why Guess? (GES) Could Be a Top Value Stock Pick - Nasdaq.com",
  "text": [
    " Value investing is always a very popular strategy, and for good reason. After all, who doesn't want to find stocks that have low PEs, solid outlooks, and decen t dividends  ?  makeArticleAd();  Fortunately for investors looking for this combination, we have identified a strong candidate which may be an impressive value; Guess?, Inc. GES  .   Guess? in Focus    GES may be an interesting play thanks to its forward PE of 13.9, its P/S ratio of 0.5, and its decen t dividend yield  of 2.5%. These factors suggest that Guess? is a pretty good value pick, as investors have to pay a relatively low level for each dollar o f earnings  , and that GES has decent revenue metrics to back up its earnings.   Guess?, Inc. PE Ratio (TTM)         Guess?, Inc. pe-ratio-ttm    |   Guess?, Inc. Quote   But before you think that Guess? is just a pure value play, it is important to note that it has been seeing solid activity on the earnings estimate front as well. For current year earnings, the consensus has gone up by 3.2% in the past 30 days, thanks to two upward revisions in the past one month compared to none lower.    This estimate strength is actually enough to push GES to a Zacks Rank #1 (Strong Buy), suggesting it is poised to outperform. You can see  the complete list of today's Zacks #1 Rank stocks   here   .    So really, Guess? is looking great from a number of angles thanks to its PE below 20, a P/S ratio below one, and a strong Zacks Rank, meaning that this company could be a great choice for value investors at this time.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.         Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.      See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Guess?, Inc. (GES): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Value investing is always a very popular strategy, and for good reason. After all, who doesn't want to find stocks that have low PEs, solid outlooks, and decen t dividends  ?  makeArticleAd();  Fortunately for investors looking for this combination, we have identified a strong candidate which may be an impressive value; Guess?, Inc. GES  .   Guess? in Focus    GES may be an interesting play thanks to its forward PE of 13.9, its P/S ratio of 0.5, and its decen t dividend yield  of 2.5%. These factors suggest that Guess? is a pretty good value pick, as investors have to pay a relatively low level for each dollar o f earnings  , and that GES has decent revenue metrics to back up its earnings.   Guess?, Inc. PE Ratio (TTM) ",
    "       Guess?, Inc. pe-ratio-ttm    |   Guess?, Inc. Quote  ",
    " Guess?, Inc. pe-ratio-ttm    |   Guess?, Inc. Quote ",
    "But before you think that Guess? is just a pure value play, it is important to note that it has been seeing solid activity on the earnings estimate front as well. For current year earnings, the consensus has gone up by 3.2% in the past 30 days, thanks to two upward revisions in the past one month compared to none lower.    This estimate strength is actually enough to push GES to a Zacks Rank #1 (Strong Buy), suggesting it is poised to outperform. You can see  the complete list of today's Zacks #1 Rank stocks   here   .    So really, Guess? is looking great from a number of angles thanks to its PE below 20, a P/S ratio below one, and a strong Zacks Rank, meaning that this company could be a great choice for value investors at this time.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.         Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.      See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:44:00"
}