{
  "url": "https://www.nasdaq.com/article/tech-startups-tout-ai-to-airlines-seeking-revenue-boost-20190903-00472",
  "title": "Tech startups tout AI to airlines seeking revenue boost - Nasdaq.com",
  "text": [
    "By Jamie Freed",
    "SINGAPORE, Sept 3 (Reuters) - Technology startups are luring airlines with demand-forecasting tools powered by artificial intelligence (AI), promising to boost efficiency at a time of rising fuel costs and upheaval in trade relations that has clouded the aviation sector's outlook.",
    "Demand intelligence firm PredictHQ on Tuesday announced product Aviation Rank which alerts airlines to major events, whereas software developer Volantio is touting Yana, a platform that helps carriers rebook customers to maximise revenue.",
    "Artificial intelligence is making in-roads in industries across the spectrum. In aviation, airlines use AI for website chatbots aimed at cutting customer service costs, for more targeted advertising, and to improve aircraft maintenance.",
    "PredictHQ's Aviation Rank can alert airlines to over 3,000 major events a month such as conferences, music festivals and sporting meets, and determine relative importance to demand.",
    "Carriers can then raise fares to take advantage of high demand or focus on filling seats at lower prices when they know there will be slower periods, said PredictHQ's San Francisco-based Chief Executive Campbell Brown.",
    "\"Airlines are coming to us rather than sitting in a room and having a guess at what events might be impacting them and putting it into a spreadsheet and trying to kind of anecdotally match that to their forecasting,\" Brown told Reuters in a telephone interview ahead of Aviation Rank's launch.",
    "Annual conferences, for instance, can involve thousands of delegates generating millions of dollars in bookings. However, venues can change each year, making it difficult to forecast demand on certain routes using historical data, PredictHQ said.",
    "\"What we do is we provide that in a very automated fashion,\" Brown said.",
    "Initial Aviation Rank customers include a major British airline and two European carriers, PredictHQ said, declining to identify them for commercial reasons. Elsewhere, PredictHQ's other clients include ride-hailing firm Uber Technologies Inc  and online travel agent Booking Holdings Inc .",
    "To better manage disruption and overbooking, Atlanta-based Volantio has signed carriers including Qantas Airways Ltd  and JetBlue Airways Corp  to Yana.",
    "The platform helps airlines re-sell seats at better prices by offering passengers incentives such as travel vouchers, upgrades or frequent flyer points to switch to other flights at times of high demand.",
    "\"Upgrades are the most popular offers,\" Volantio CEO Azim Barodawala said in an email. \"Our acceptance has been as high as 40% to 50%.\"",
    "The startup is also exploring expanding the product to give airlines the ability to prioritise high-value cargo, presenting passengers with incentives to take another flight to accommodate the cargo's weight, Barodawala said."
  ],
  "published_datetime": "2019-09-03 08:00:00"
}