{
  "url": "https://www.nasdaq.com/article/what-to-do-if-you-cant-pay-all-your-monthly-bills-cm1207261",
  "title": "What to Do If You Can't Pay All Your Monthly Bills - Nasdaq.com",
  "text": [
    "   Not being able to pay the bills is scary. Follow these steps   if your bills are bigger than your budget.  When you owe a lot of money, the bills can become too much to handle. If this happens to you, it's scary to face -- but being proactive can help. As soon as you realize you can't pay all of your monthly bills, and there are no other ways to increase your income or decrease your expenses, you'll want to act as quickly as possible. There are no easy fixes, but here are some steps that you'll want to take ASAP to resolve the problem with the minimum amount of damage to your credit and your financial situation.makeArticleAd();      Image source: Getty Images  1. See if refinancing could help The best way to handle not being able to pay all your monthly bills is to lower your payments and reduce the number of bills you have. Refinancing can sometimes accomplish both goals. If your credit is reasonably good, you may be able to qualify for a personal loan  to consolidate and refinance debt. When you use a personal loan to pay off all or most of your other loans, you'll have only one payment, whereas before you may have had many. If your personal loan is at a lower rate, you can pay less interest, making your debt cheaper. And if necessary, you could take a personal loan with a longer repayment period, which could substantially reduce your monthly payment -- although it may mean paying more interest over the long-term. Refinancing is not an option for everyone, because you need to be able to find an affordable refinance loan. But if it's possible, this approach can both make your bills affordable and  protect your credit. 2. Reach out to your creditors for assistance If refinancing isn't an option or won't make your bills affordable, reach out to creditors to let them know you are struggling and to ask what your options are. Sometimes it's possible to put loans into forbearance -- this is an option with federal student loans  , for example, as well as with some private student loans. If you can pause payments on at least some of your debt, this could give you time to increase your income or pay down other debt so you're able to afford all your obligations. You could also look into income-based payment plans on federal student loans. Choosing a payment plan that caps payments as a percent of income could free up some cash for your other debts. Lenders may also be willing to work out a payment plan for you, which may allow you to temporarily lower your interest rate or payment, or both. If you are facing only short-term financial hardship, because of a job loss or other temporary issue, this could be a good option. 3. Prioritize your bills If your lenders can't or won't work with you to make bills affordable and refinancing isn't an option, you may find yourself in a situation where you don't have a choice but to miss some payments on bills you can't afford. If this happens to you, it's a good idea to prioritize the bills you absolutely have  to pay. First and foremost, you should focus on paying secured debts such as your mortgage and car loan. Otherwise, you could lose your vehicle or your home. If you're a renter, paying your rent should also be a top priority. Otherwise, eviction could leave you homeless and severely damage your credit. You should also find out what the policy is for your utility companies. Sometimes, they aren't allowed to cut off service, which means you may put those bills lower down on your list of companies to pay. But in other cases, they can turn off your water or electric and you'd have to pay a hefty fee to get the services turned back on -- which means that paying those should be high up on the list. Beyond that, you may want to prioritize making payments on the credit cards you currently have balances on so your accounts don't get closed and your interest rate doesn't rise to a penalty rate. Medical loan debt, on the other hand, may become a lower priority as long as your providers won't stop treatment if you fall behind on the bills. 4. Look into debt settlement options While you may have to just stop paying some of your bills during a time of financial hardship, you don't want to let this situation continue for a long time. Each time you miss a payment, your credit will take another hit and you'll incur additional fees and penalties. Instead, it's time to start talking with your creditors about settling your debt. Once you've fallen behind on bills, creditors are often willing to settle your debt because they fear you'll go bankrupt otherwise. Debt settlement  means you agree to a plan to pay less than you owe. Usually you'll pay a lump sum amount that's smaller than your balance and the rest of the debt is forgiven -- but sometimes a payment plan can be worked out. You won't be able to use your accounts, and your credit will be hurt when the debt is reported as settled. But, if you can work out an agreement, you won't owe any more and you'll stop the repeated reports of late payments that drag your credit down further each month. You may be in a tough spot, but you do have options The above are all techniques that can be used to cope when you just can't cover all your bills. While it's best to increase income or reduce spending before you reach this point, sometimes that isn't possible. And when the worst happens and your money doesn't stretch far enough, taking some of these steps could help you to deal with the problem in the most efficient way possible to protect your financial future. Savings account rates are skyrocketing -- Earn 23x your bank Many people are missing out on guaranteed returns as their money languishes in a big bank savings account earning next to no interest. Our picks of the best online savings accounts  can earn you more than 25x the national average savings account rate. Click here  to uncover the best-in-class picks that landed a spot on our shortlist of the best savings accounts for 2019.  The Motley Fool owns and recommends MasterCard and Visa, and recommends American Express. We're firm believers in the Golden Rule. If we wouldn't recommend an offer to a close family member, we wouldn't recommend it on The Ascent either. Our number one goal is helping people find the best offers to improve their finances. That is why editorial opinions are ours alone and have not been previously reviewed, approved, or endorsed by included advertisers. Editorial content from The Ascent is separate from The Motley Fool editorial content and is created by a different analyst team.",
    "  Not being able to pay the bills is scary. Follow these steps   if your bills are bigger than your budget. ",
    "When you owe a lot of money, the bills can become too much to handle. If this happens to you, it's scary to face -- but being proactive can help. As soon as you realize you can't pay all of your monthly bills, and there are no other ways to increase your income or decrease your expenses, you'll want to act as quickly as possible.",
    "There are no easy fixes, but here are some steps that you'll want to take ASAP to resolve the problem with the minimum amount of damage to your credit and your financial situation.",
    "  Image source: Getty Images ",
    "Image source: Getty Images",
    "The best way to handle not being able to pay all your monthly bills is to lower your payments and reduce the number of bills you have. Refinancing can sometimes accomplish both goals.",
    "If your credit is reasonably good, you may be able to qualify for a personal loan  to consolidate and refinance debt. When you use a personal loan to pay off all or most of your other loans, you'll have only one payment, whereas before you may have had many. If your personal loan is at a lower rate, you can pay less interest, making your debt cheaper. And if necessary, you could take a personal loan with a longer repayment period, which could substantially reduce your monthly payment -- although it may mean paying more interest over the long-term.",
    "Refinancing is not an option for everyone, because you need to be able to find an affordable refinance loan. But if it's possible, this approach can both make your bills affordable and  protect your credit.",
    "If refinancing isn't an option or won't make your bills affordable, reach out to creditors to let them know you are struggling and to ask what your options are.",
    "Sometimes it's possible to put loans into forbearance -- this is an option with federal student loans  , for example, as well as with some private student loans. If you can pause payments on at least some of your debt, this could give you time to increase your income or pay down other debt so you're able to afford all your obligations. You could also look into income-based payment plans on federal student loans. Choosing a payment plan that caps payments as a percent of income could free up some cash for your other debts.",
    "Lenders may also be willing to work out a payment plan for you, which may allow you to temporarily lower your interest rate or payment, or both. If you are facing only short-term financial hardship, because of a job loss or other temporary issue, this could be a good option.",
    "If your lenders can't or won't work with you to make bills affordable and refinancing isn't an option, you may find yourself in a situation where you don't have a choice but to miss some payments on bills you can't afford.",
    "If this happens to you, it's a good idea to prioritize the bills you absolutely have  to pay. First and foremost, you should focus on paying secured debts such as your mortgage and car loan. Otherwise, you could lose your vehicle or your home.",
    "If you're a renter, paying your rent should also be a top priority. Otherwise, eviction could leave you homeless and severely damage your credit. You should also find out what the policy is for your utility companies. Sometimes, they aren't allowed to cut off service, which means you may put those bills lower down on your list of companies to pay. But in other cases, they can turn off your water or electric and you'd have to pay a hefty fee to get the services turned back on -- which means that paying those should be high up on the list.",
    "Beyond that, you may want to prioritize making payments on the credit cards you currently have balances on so your accounts don't get closed and your interest rate doesn't rise to a penalty rate. Medical loan debt, on the other hand, may become a lower priority as long as your providers won't stop treatment if you fall behind on the bills.",
    "While you may have to just stop paying some of your bills during a time of financial hardship, you don't want to let this situation continue for a long time. Each time you miss a payment, your credit will take another hit and you'll incur additional fees and penalties.",
    "Instead, it's time to start talking with your creditors about settling your debt. Once you've fallen behind on bills, creditors are often willing to settle your debt because they fear you'll go bankrupt otherwise. Debt settlement  means you agree to a plan to pay less than you owe. Usually you'll pay a lump sum amount that's smaller than your balance and the rest of the debt is forgiven -- but sometimes a payment plan can be worked out.",
    "You won't be able to use your accounts, and your credit will be hurt when the debt is reported as settled. But, if you can work out an agreement, you won't owe any more and you'll stop the repeated reports of late payments that drag your credit down further each month.",
    "The above are all techniques that can be used to cope when you just can't cover all your bills. While it's best to increase income or reduce spending before you reach this point, sometimes that isn't possible. And when the worst happens and your money doesn't stretch far enough, taking some of these steps could help you to deal with the problem in the most efficient way possible to protect your financial future.",
    "Many people are missing out on guaranteed returns as their money languishes in a big bank savings account earning next to no interest. Our picks of the best online savings accounts  can earn you more than 25x the national average savings account rate. Click here  to uncover the best-in-class picks that landed a spot on our shortlist of the best savings accounts for 2019.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:00:00"
}