{
  "url": "https://www.nasdaq.com/article/what-the-johnson-johnson-opioid-ruling-means-for-the-cannabis-industry-cm1206935",
  "title": "What the Johnson & Johnson Opioid Ruling Means for the Cannabis Industry - Nasdaq.com",
  "text": [
    " In late August,   Johnson & Johnson    (NYSE: JNJ) was hit with a hefty   $572 million fine    for its role in the opioid crisis in Oklahoma, which was still   not as bad as it could have been    . In what could prove to be a monumental case in the U.S., it   could just be the beginning of a much larger fallout. As many as   130 people   die daily as a result of overdosing on   opioids    . Johnson & Johnson and other pharmaceuticals have reason to   be worried, as Oklahoma's opioid problem is not nearly as severe   as it is in other states. According to   2017 data    from the Centers for Disease Control and Prevention, the state   had a death rate relating to drug overdoses of 20.1 per 100,000   people, with 775 total deaths occurring that year. In contrast,   West Virginia had the highest rate of death at 57.8 per 100,000   people while Pennsylvania, Florida, and Ohio each had more than   5,000 people lose their lives as a result of overdosing. While   the fine in Oklahoma may not be that big of a burden for Johnson   & Johnson, the amount could be a drop in the bucket compared   to what a potential payout may be in other states should they be   successful in pursuing similar types of litigation. The company   said it plans to appeal the ruling.  The cannabis impact  The importance of the issue is evident from a cost standpoint,   especially if the ruling against Johnson & Johnson holds up.   Companies are likely to start taking opioids more seriously and   look into alternative treatment options. One industry where   healthcare companies may start to focus on is cannabis. Colorado,   New York, and Illinois already   allow doctors to recommend cannabis in place of   opioids    .makeArticleAd();   IMAGE SOURCE: GETTY IMAGES.  The challenge when it comes to cannabis is that while there's   a lot of anecdotal evidence claiming marijuana use helps users   deal with pain, there just isn't hard data to support that. To   make matters worse, it's also hard to get research done on   cannabis to be able to even prove or disprove its effectiveness   since it remains a Schedule I drug, illegal on a federal level.   These limitations make it difficult to prove whether cannabis can   help the situation or not. In addition, there has been   research     to suggest that cannabis is not a blanket solution to the   opioid crisis. However, the research is by no means comprehensive   and there's a clear need for more research before any definitive   links can be drawn. Even one of the more   critical studies      acknowledged that \"a great majority of adults who used   cannabis did not go on to initiate or increase their nonmedical   opioid use.\" Meanwhile, veterans are   urging the government    to help them access medical marijuana, which has been more   effective for some in treating post-traumatic stress disorder   than opioids. Unfortunately, there's no one right answer to the question of   whether cannabis can help the opioid crisis. What is evident,   though, is that more research is needed to help understand in   which circumstances it may be helpful and in which it may not be.   To say conclusively that it does or doesn't help would be   premature given the conflicting data.  We're still early in the process  To date, only   GW Pharmaceuticals    (NASDAQ: GWPH)  has successfully launched a cannabis-based   drug in the U.S., called Epidiolex. And it could be a long time   before we see any others get approved as well given the legal   hurdles involved. However, the Johnson & Johnson ruling could   be the catalyst that at least gets pharmaceutical companies   looking into potential alternatives, ones that include   cannabis.  Why this matters for investors  From an investment standpoint, there's obviously a lot of   potential growth that could be at hand for a company with a   significant position in the medical marijuana segment like   Aurora Cannabis    . If cannabis is shown to be an effective treatment option in   place of opioids, we could see much more demand for   Aurora's products     and for the industry as a whole. It could also lead to a   big pharmaceutical company finally dipping its toes into the   medical marijuana market. It's very early on, but last week's   ruling could help lead to some medical professionals taking   another look at cannabis, and that could be huge for the   industry.   10 stocks we like better than Johnson &     Johnson       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Johnson & Johnson     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        David Jagielski      has no position in any of the stocks mentioned. The Motley Fool     recommends Johnson & Johnson. The Motley Fool has a     disclosure policy      .  ",
    "In late August,   Johnson & Johnson    (NYSE: JNJ) was hit with a hefty   $572 million fine    for its role in the opioid crisis in Oklahoma, which was still   not as bad as it could have been    . In what could prove to be a monumental case in the U.S., it   could just be the beginning of a much larger fallout. As many as   130 people   die daily as a result of overdosing on   opioids    .",
    "Johnson & Johnson and other pharmaceuticals have reason to   be worried, as Oklahoma's opioid problem is not nearly as severe   as it is in other states. According to   2017 data    from the Centers for Disease Control and Prevention, the state   had a death rate relating to drug overdoses of 20.1 per 100,000   people, with 775 total deaths occurring that year. In contrast,   West Virginia had the highest rate of death at 57.8 per 100,000   people while Pennsylvania, Florida, and Ohio each had more than   5,000 people lose their lives as a result of overdosing. While   the fine in Oklahoma may not be that big of a burden for Johnson   & Johnson, the amount could be a drop in the bucket compared   to what a potential payout may be in other states should they be   successful in pursuing similar types of litigation. The company   said it plans to appeal the ruling.",
    "The importance of the issue is evident from a cost standpoint,   especially if the ruling against Johnson & Johnson holds up.   Companies are likely to start taking opioids more seriously and   look into alternative treatment options. One industry where   healthcare companies may start to focus on is cannabis. Colorado,   New York, and Illinois already   allow doctors to recommend cannabis in place of   opioids    .",
    "  IMAGE SOURCE: GETTY IMAGES. ",
    "IMAGE SOURCE: GETTY IMAGES.",
    "The challenge when it comes to cannabis is that while there's   a lot of anecdotal evidence claiming marijuana use helps users   deal with pain, there just isn't hard data to support that. To   make matters worse, it's also hard to get research done on   cannabis to be able to even prove or disprove its effectiveness   since it remains a Schedule I drug, illegal on a federal level.   These limitations make it difficult to prove whether cannabis can   help the situation or not.",
    "In addition, there has been   research     to suggest that cannabis is not a blanket solution to the   opioid crisis. However, the research is by no means comprehensive   and there's a clear need for more research before any definitive   links can be drawn. Even one of the more   critical studies      acknowledged that \"a great majority of adults who used   cannabis did not go on to initiate or increase their nonmedical   opioid use.\" Meanwhile, veterans are   urging the government    to help them access medical marijuana, which has been more   effective for some in treating post-traumatic stress disorder   than opioids.",
    "Unfortunately, there's no one right answer to the question of   whether cannabis can help the opioid crisis. What is evident,   though, is that more research is needed to help understand in   which circumstances it may be helpful and in which it may not be.   To say conclusively that it does or doesn't help would be   premature given the conflicting data.",
    "To date, only   GW Pharmaceuticals    (NASDAQ: GWPH)  has successfully launched a cannabis-based   drug in the U.S., called Epidiolex. And it could be a long time   before we see any others get approved as well given the legal   hurdles involved. However, the Johnson & Johnson ruling could   be the catalyst that at least gets pharmaceutical companies   looking into potential alternatives, ones that include   cannabis.",
    "From an investment standpoint, there's obviously a lot of   potential growth that could be at hand for a company with a   significant position in the medical marijuana segment like   Aurora Cannabis    . If cannabis is shown to be an effective treatment option in   place of opioids, we could see much more demand for   Aurora's products     and for the industry as a whole. It could also lead to a   big pharmaceutical company finally dipping its toes into the   medical marijuana market. It's very early on, but last week's   ruling could help lead to some medical professionals taking   another look at cannabis, and that could be huge for the   industry.",
    "  10 stocks we like better than Johnson &     Johnson       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Johnson & Johnson     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Johnson &     Johnson       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Johnson & Johnson     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  David Jagielski      has no position in any of the stocks mentioned. The Motley Fool     recommends Johnson & Johnson. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:15:15"
}