{
  "url": "https://www.nasdaq.com/article/why-arista-networks-fell-171-in-august-cm1210380",
  "title": "Why Arista Networks Fell 17.1% in August - Nasdaq.com",
  "text": [
    " What happened Shares of   Arista Networks    (NYSE: ANET) declined 17.1% in August, according to data from   S&P Global Market Intelligence    , after the cloud-networking solutions specialist announced   strong second-quarter results but followed with cautious comments   on   growth    for the rest of the year. To be sure, Arista stock dropped more than 10% on August 2,   2019 alone -- the first trading day after the company told   investors its Q2 revenue had climbed 17% year over year to $608.3   million, translating to adjusted net income of $198.6 million, or   $2.44 per share. Analysts, on average, were modeling earnings of   $2.20 per share on revenue closer to $607 million.   Image source: Getty Images.makeArticleAd();  So what Arista CEO Jayshree Ullal praised the company's ability to   drive profitable growth, with particular strength in the   enterprise vertical more than offsetting some weakness from   certain cloud clients. Ullal also noted that Arista Networks'   \"leadership in cloud-area networking is now widely recognized by   industry analysts, partners and customers.\" So why the decline? During the   subsequent conference call    , Arista CFO Ita Brennan elaborated:  As expected, we experienced some softness in demand from our     cloud customers in the second quarter. While early indications     are for improved demand from these customers in the September     period, we believe that second-half growth in this business     will remain somewhat muted as compared to prior years. We     expect our enterprise and financial verticals to continue to     perform well, offset by some declines in the service provider     business.  Now what In the meantime, Arista is targeting third-quarter revenue of   $647 million to $657 million -- the midpoint of which is slightly   above consensus estimates for $651 million at the time -- with   adjusted gross margin remaining between 63% and 65% (compared to   64.7% in Q2). That helps explain why shares initially turned higher in   after-hours trading after Arista's report hit the wires. But   given those words of caution from management about growth   potentially slowing later this year, unless Arista steps out to   negate those concerns, I suspect the stock will remain under   pressure for now.   10 stocks we like better than Arista Networks       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Arista Networks wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Steve Symington      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Arista Networks. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   Arista Networks    (NYSE: ANET) declined 17.1% in August, according to data from   S&P Global Market Intelligence    , after the cloud-networking solutions specialist announced   strong second-quarter results but followed with cautious comments   on   growth    for the rest of the year.",
    "To be sure, Arista stock dropped more than 10% on August 2,   2019 alone -- the first trading day after the company told   investors its Q2 revenue had climbed 17% year over year to $608.3   million, translating to adjusted net income of $198.6 million, or   $2.44 per share. Analysts, on average, were modeling earnings of   $2.20 per share on revenue closer to $607 million.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Arista CEO Jayshree Ullal praised the company's ability to   drive profitable growth, with particular strength in the   enterprise vertical more than offsetting some weakness from   certain cloud clients. Ullal also noted that Arista Networks'   \"leadership in cloud-area networking is now widely recognized by   industry analysts, partners and customers.\"",
    "So why the decline? During the   subsequent conference call    , Arista CFO Ita Brennan elaborated:",
    "As expected, we experienced some softness in demand from our     cloud customers in the second quarter. While early indications     are for improved demand from these customers in the September     period, we believe that second-half growth in this business     will remain somewhat muted as compared to prior years. We     expect our enterprise and financial verticals to continue to     perform well, offset by some declines in the service provider     business.",
    "In the meantime, Arista is targeting third-quarter revenue of   $647 million to $657 million -- the midpoint of which is slightly   above consensus estimates for $651 million at the time -- with   adjusted gross margin remaining between 63% and 65% (compared to   64.7% in Q2).",
    "That helps explain why shares initially turned higher in   after-hours trading after Arista's report hit the wires. But   given those words of caution from management about growth   potentially slowing later this year, unless Arista steps out to   negate those concerns, I suspect the stock will remain under   pressure for now.",
    "  10 stocks we like better than Arista Networks       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Arista Networks wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Arista Networks       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Arista Networks wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Steve Symington      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Arista Networks. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:20:00"
}