{
  "url": "https://www.nasdaq.com/article/wall-street-has-this-pot-stock-all-wrong-cm1210317",
  "title": "Wall Street Has This Pot Stock All Wrong - Nasdaq.com",
  "text": [
    " No matter how you slice the data, marijuana is expected to be   one of the fastest-growing industries over the next decade.   Global weed sales have already tripled between 2014 and 2018 and   are   expected to grow fourfold between 2018 and   2024    . The sky really does seem to be the limit for an industry with   plenty of demand, but also a lot of black-market activity. Canada legalized recreational marijuana sales in 2018 and   two-thirds of all U.S. states allow medical marijuana   prescriptions, so the   stage is set for cannabis stocks to thrive     -- and Wall Street knows it. Although consensus estimates for sales and profitability have   varied wildly, which we'd expect from an industry with no legal   precedent, Wall Street has been pretty consistent with its   bullishness. This is to say that many of the brand-name pot   stocks -- e.g.,   Canopy Growth     and   Aurora Cannabis     -- are rated as the equivalent of a buy.makeArticleAd(); However, one pot stock last week wasn't initiated with the   green flag waving.   Image source: Getty Images.   OrganiGram Holdings stuck in neutral?  Last Thursday, covering analyst Rupesh Parikh at Oppenheimer   initiated coverage on Atlantic-based grower   OrganiGram Holdings    (NASDAQ: OGI) with a perform rating (this is the equivalent of a   hold). Oppenheimer didn't assign a price target, which simply   implies that the company is expected to perform in line with the   S&P 500    over the next 12 to 18 months. In a released research note detailing the rating, Parikh   points out that OrganiGram has executed well and has even   generated positive earnings before interest, taxes, depreciation,   and amortization (   EBITDA    ). \"Early success in the Canadian market coupled with above-peer   financial delivery gives us confidence in the company's ability   to further ramp-up from here,\" said Parikh. But Oppenheimer's covering analyst also noted that OrganiGram   was liable to face numerous near-term headwinds. Parikh and his   team are particularly worried about the upcoming launch of vape   products in Canada by mid-December, considering the   negative recent health findings associated with   vaping    . As of Monday, Sept. 9, more than 450 cases of vaping-related   lung illnesses have been reported in the United States, with some   reports suggesting that tetrahydrocannabinol (THC) being used in   electronic vaping devices may be the culprit. Though this is pure   hearsay at the moment, it has people -- and investors --   talking.   Image source: Getty Images.   Wall Street has this outperformer all wrong  However, the thing to remember about Wall Street analysts is   that they're just as fallible as retail investors. Despite   numerous near-term \"headwinds,\" this is a pot stock that   Oppenheimer has all wrong. If there's a major cannabis grower   worthy of a buy rating, it's OrganiGram Holdings. The way I see it, there are three factors that allow   OrganiGram to stand out. First, OrganiGram offers geographic advantages. It's the only   major marijuana grower located in Canada's eastern provinces,   with its sole growing facility in Moncton, New Brunswick. Though   eastern Canada is home to lesser-populated provinces, surveys   have shown them to be regions with higher cannabis-use rates.   OrganiGram should have little trouble establishing its brands in   these high-use-rate provinces while also leaning on the fact that   it's   one of only four pot growers    to have supply deals in place with all of Canada's provinces. Secondly, this is   one of the most efficient weed growers    throughout Canada. Despite the lone facility in Moncton,   OrganiGram aims to produce 113,000 kilos of peak annual output   utilizing less than 500,000 square feet of cultivation space. By   implementing a three-tiered grower system, the company should be   able to yield about 230 grams per square foot, which appears to   be well above the 75 grams per square foot to 125 grams per   square foot that most of its competition will yield. These   impressive yields should equate to below-average production costs   and higher margins. Third and finally, as alluded to by Parikh, OrganiGram is   light-years ahead of its peers on an operating basis. In the   company's fiscal third-quarter report, released in July,   OrganiGram generated 24.75 million Canadian dollars in net sales   and a gross margin of CA$12.28 million. If we were to exclude all   (and I do mean all) one-time benefits and fair-value adjustments,   and simply subtract the company's operating expenses of CA$11.11   million, OrganiGram   would have been operationally profitable in the   third quarter    .   Very few    other cannabis growers can say they're operationally profitable   right now.   Image source: Getty Images.   The biggest issue Oppenheimer may have     overlooked  While I feel that OrganiGram is one the few growers that   should have a buy rating on Wall Street, there's one reason the   company and entire industry could struggle. And it's not   something that Parikh goes into detail about in his firm's   coverage note. The biggest factor working against cannabis stocks right now   is that the industry needs time to mature, as evidenced by   early-stage supply problems. Since recreational pot sales   launched on Oct. 17, it's been virtually impossible for supply to   keep up with demand. Licensing backlogs at Health Canada, coupled   with cannabis store licensing delays in select provinces and   compliant-packaging shortages, have all played a role in reducing   near-term expectations for the marijuana industry. Although the launch of high-margin derivative products is   expected to be a major driver for the pot industry in December,   it's unlikely that the   solutions being implemented to fix supply   issues    prevalent throughout the country will be resolved by then. This   means derivative products, including vapes, beverages, and   edibles, could face many of the same headache-causing supply   concerns that dried flower experienced when it was legalized for   sale in October 2018. This is the one viable reason to tone down near-term   expectations for OrganiGram. But aside from this, OrganiGram   looks superior in many ways to its peers, thus making it worthy   of a buy rating.   Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.         And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018. And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution. Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks. Simply click here to get the full story now.  Learn more     Sean Williams      has no position in any of the stocks mentioned. The Motley Fool     recommends OrganiGram Holdings. The Motley Fool has a     disclosure policy      .  ",
    "No matter how you slice the data, marijuana is expected to be   one of the fastest-growing industries over the next decade.   Global weed sales have already tripled between 2014 and 2018 and   are   expected to grow fourfold between 2018 and   2024    . The sky really does seem to be the limit for an industry with   plenty of demand, but also a lot of black-market activity.",
    "Canada legalized recreational marijuana sales in 2018 and   two-thirds of all U.S. states allow medical marijuana   prescriptions, so the   stage is set for cannabis stocks to thrive     -- and Wall Street knows it.",
    "Although consensus estimates for sales and profitability have   varied wildly, which we'd expect from an industry with no legal   precedent, Wall Street has been pretty consistent with its   bullishness. This is to say that many of the brand-name pot   stocks -- e.g.,   Canopy Growth     and   Aurora Cannabis     -- are rated as the equivalent of a buy.",
    "However, one pot stock last week wasn't initiated with the   green flag waving.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Last Thursday, covering analyst Rupesh Parikh at Oppenheimer   initiated coverage on Atlantic-based grower   OrganiGram Holdings    (NASDAQ: OGI) with a perform rating (this is the equivalent of a   hold). Oppenheimer didn't assign a price target, which simply   implies that the company is expected to perform in line with the   S&P 500    over the next 12 to 18 months.",
    "In a released research note detailing the rating, Parikh   points out that OrganiGram has executed well and has even   generated positive earnings before interest, taxes, depreciation,   and amortization (   EBITDA    ). \"Early success in the Canadian market coupled with above-peer   financial delivery gives us confidence in the company's ability   to further ramp-up from here,\" said Parikh.",
    "But Oppenheimer's covering analyst also noted that OrganiGram   was liable to face numerous near-term headwinds. Parikh and his   team are particularly worried about the upcoming launch of vape   products in Canada by mid-December, considering the   negative recent health findings associated with   vaping    .",
    "As of Monday, Sept. 9, more than 450 cases of vaping-related   lung illnesses have been reported in the United States, with some   reports suggesting that tetrahydrocannabinol (THC) being used in   electronic vaping devices may be the culprit. Though this is pure   hearsay at the moment, it has people -- and investors --   talking.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "However, the thing to remember about Wall Street analysts is   that they're just as fallible as retail investors. Despite   numerous near-term \"headwinds,\" this is a pot stock that   Oppenheimer has all wrong. If there's a major cannabis grower   worthy of a buy rating, it's OrganiGram Holdings.",
    "The way I see it, there are three factors that allow   OrganiGram to stand out.",
    "First, OrganiGram offers geographic advantages. It's the only   major marijuana grower located in Canada's eastern provinces,   with its sole growing facility in Moncton, New Brunswick. Though   eastern Canada is home to lesser-populated provinces, surveys   have shown them to be regions with higher cannabis-use rates.   OrganiGram should have little trouble establishing its brands in   these high-use-rate provinces while also leaning on the fact that   it's   one of only four pot growers    to have supply deals in place with all of Canada's provinces.",
    "Secondly, this is   one of the most efficient weed growers    throughout Canada. Despite the lone facility in Moncton,   OrganiGram aims to produce 113,000 kilos of peak annual output   utilizing less than 500,000 square feet of cultivation space. By   implementing a three-tiered grower system, the company should be   able to yield about 230 grams per square foot, which appears to   be well above the 75 grams per square foot to 125 grams per   square foot that most of its competition will yield. These   impressive yields should equate to below-average production costs   and higher margins.",
    "Third and finally, as alluded to by Parikh, OrganiGram is   light-years ahead of its peers on an operating basis. In the   company's fiscal third-quarter report, released in July,   OrganiGram generated 24.75 million Canadian dollars in net sales   and a gross margin of CA$12.28 million. If we were to exclude all   (and I do mean all) one-time benefits and fair-value adjustments,   and simply subtract the company's operating expenses of CA$11.11   million, OrganiGram   would have been operationally profitable in the   third quarter    .   Very few    other cannabis growers can say they're operationally profitable   right now.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "While I feel that OrganiGram is one the few growers that   should have a buy rating on Wall Street, there's one reason the   company and entire industry could struggle. And it's not   something that Parikh goes into detail about in his firm's   coverage note.",
    "The biggest factor working against cannabis stocks right now   is that the industry needs time to mature, as evidenced by   early-stage supply problems. Since recreational pot sales   launched on Oct. 17, it's been virtually impossible for supply to   keep up with demand. Licensing backlogs at Health Canada, coupled   with cannabis store licensing delays in select provinces and   compliant-packaging shortages, have all played a role in reducing   near-term expectations for the marijuana industry.",
    "Although the launch of high-margin derivative products is   expected to be a major driver for the pot industry in December,   it's unlikely that the   solutions being implemented to fix supply   issues    prevalent throughout the country will be resolved by then. This   means derivative products, including vapes, beverages, and   edibles, could face many of the same headache-causing supply   concerns that dried flower experienced when it was legalized for   sale in October 2018.",
    "This is the one viable reason to tone down near-term   expectations for OrganiGram. But aside from this, OrganiGram   looks superior in many ways to its peers, thus making it worthy   of a buy rating.",
    "  Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.         And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018. And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution. Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks. Simply click here to get the full story now.  Learn more  ",
    " Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.        ",
    "And make no mistake - it is coming.",
    "Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018.",
    "And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution.",
    "Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks.",
    "Simply click here to get the full story now.",
    " Learn more ",
    "  Sean Williams      has no position in any of the stocks mentioned. The Motley Fool     recommends OrganiGram Holdings. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:00:00"
}