{
  "url": "https://www.nasdaq.com/article/tianjin-binhai-new-area-construction-revives-bond-issue-20190912-00018",
  "title": "Tianjin Binhai New Area Construction revives bond issue - Nasdaq.com",
  "text": [
    "By Carol  Chan",
    "HONG KONG, Sept 12 (IFR) - Tianjin Binhai New Area Construction & Investment Group (BHCI), rated Baa2/BBB+ (Moody's/Fitch), has successfully revived a US$300m bond offering with a more generous yield and strong anchors after a failed attempt in July.",
    "The Chinese local government financing vehicle on Wednesday priced the 5.875% three-year senior unsecured bond at 99.661 to yield 6.00%, in line with guidance.",
    "A banker on the deal said the Reg S issue had secured significant anchor orders and bookrunners had made sure orders were sufficient before formally launching marketing.",
    "\"That's why we went straight with 6% final price guidance in the morning,\" he said, noting that the yield seemed attractive to investors.",
    "\"Many high-yield LGFV names, such as Double B names, are trading at a 5%-6% handle, but this IG (investment grade) name is offering 6%. We saw some market orders yesterday,\" he said, but declined to disclose the book size.",
    "The banker acknowledged that BHCI had to offer a higher yield than some similarly rated or even lower-rated LGFVs, reflecting investors' concerns about the capability and likelihood of support from the Tianjin city government.",
    "Interest for Tianjin-based LGFVs and state-owned enterprises has weakened in response to financial distress at commodity trader Tewoo and developer Tianjin Real Estate Group. Both are looking for a white knight to overcome their financial woes.",
    "S&P on July 15 said flagged the financing challenges of Tianjin SOEs given that the northern Chinese port has the highest debt burden among Chinese mega-cities or provinces after including its local government financing vehicles' debt.",
    "S&P believes that the Tianjin government is more likely to provide support to its major LGFVs than to other types of SOEs, given their higher strategic importance.",
    "BHCI in July was forced to postpone the three-year dollar bond offering after concerns over the finances of its local government parent led to a rare snub from international investors. Marketing of the Reg S deal began on July 11 at 5.10% area and final guidance of 5.00% (+/-5bp) was announced in the evening, before the deal was pulled around midnight.",
    "YIELD COMPENSATION",
    "A significantly more generous yield helped assuage anxieties over Tianjin names yesterday.",
    "LGFVs have also been in demand recently with three other new issues pricing this week at lower yields than BHCI.",
    "Similarly rated Guangxi Communications Investment Group, rated Baa2/BBB (Moody's/ Fitch), on Tuesday priced US$300m 3.50% three-year bonds at 99.437 to yield 3.70%.",
    "First-time issuer Shuifa Group, rated Baa3 by Moody's, which is one notch lower than BHCI, on Tuesday sold US$400m three-year bonds at par to yield 4.15%.",
    "High-yield issuer Changde Urban Construction and Investment Group, rated BB+ by Fitch and three notches lower than BHCI, on Wednesday priced US$200m three-year bonds at 5.8%.",
    "BHCI's newly priced bonds were traded around reoffer in the aftermarket.",
    "The issue structure was the same as the last attempt in July, with Zhaobing Investment (BVI) as the issuer and BHCI as the guarantor.",
    "The notes have expected ratings of Baa2/BBB+ (Moody's/Fitch), in line with the guarantor.",
    "S&P withdrew its rating on BHCI at the company's request on September 10, following a downgrade to BBB- from BBB on August 22.",
    "Moody's and Fitch did not undertake any rating actions after the July deal postponement.",
    "BHCI was established in 2006 by the Tianjin municipal government to manage major projects in the Tianjin Binhai New Area.",
    "Proceeds from the bond issue will be used for general corporate purposes.",
    "The above banker said BHCI has used up its entire offshore debt issuance quota from the National Development and Reform Commission.",
    "Standard Chartered Bank, Bank of China, HSBC, ABC International, Guotai Junan International, Industrial Bank Hong Kong branch, Haitong International and CCB International were joint global coordinators. They were also joint lead managers and joint bookrunners with BNP Paribas, China Citic Bank International, Everbright Sun Hung Kai, CMBC Capital, CMB Wing Lung Bank, Orient Securities (Hong Kong), Shanghai Pudong Development Bank Hong Kong branch and Zhongtai International."
  ],
  "published_datetime": "2019-09-12 12:25:00"
}