{
  "url": "https://www.nasdaq.com/article/wednesdays-vital-data-cleveland-cliffs-home-depot-and-twitter-cm1207467",
  "title": "Wednesday’s Vital Data: Cleveland-Cliffs, Home Depot and Twitter - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "U.S. stock futures are bouncing back after yesterday's slide.",
    "Heading into the open, futures on the Dow Jones Industrial Average are up 0.87%, and S&P 500 futures are higher by 0.89%. Nasdaq-100 futures have added 1.00%.",
    "In the options pits, call volume outpaced puts despite Tuesday's selloff. Overall volume settled near average levels signaling a run-of-the-mill trading session. Specifically, about 15.3 million calls and 14.9 million puts changed hands.",
    "Meanwhile, over at the CBOE, the distance between calls and puts narrowed driving the single-session equity put/call volume ratio back up to 0.73 - another one-week high. The 10-day moving average popped to 0.68.",
    "Let's take a closer look at the most actively traded options:",
    "Typically investors view the announcement of a dividend increase with glee. But with iron-ore producer Cleveland-Cliffs (NYSE: CLF ), it caused traders to flee. CLF stock plunged 14.6% amid substantial volume after the company issued a press release detailing plans for a 20% bump in their dividend to 6 cents per share. Additionally, they will pay out a one-time special dividend of 4 cents per share.",
    "Falling steel and iron-ore prices amid trade war drama and global slowdown fears have plagued metal stocks like CLF, and it appears traders aren't willing to bank on a recovery just yet. While the dividend bump might be a win in the long run, Tuesday's price action shows traders are adopting a wait-and-see approach.",
    "On the charting front, the next major support looms at $5.60 so consider that the downside target if bears continue their rampage.",
    "As far as options trading goes, put volume exploded Tuesday driving 70% of the day's action. Total activity rocketed to over seven times the average daily volume.",
    "The increased demand drove implied volatility higher on the day to 68% placing it at the 71st percentile of its one-year range. Premium sellers will be happy to note this is the highest level since last December.",
    "Last month's earnings report lit a fire under Home Depot (NYSE: HD ) shares, and they continue to burn bright. Tuesday's drop was well-deserved and allowed HD stock to digest recent gains ahead of its next dividend payment. Its price action is extremely bullish with a rising 20-day, 50-day, and 200-day moving averages. Buying dips and breakouts remains the name of the game.",
    "Home Depot's ex-dividend date is today and was undoubtedly the cause of yesterday's boom in options trading. Dividend seekers took to the options market for short-term control of HD shares to capture the $1.36 payout. The annual yield is 2.44%. Activity zoomed to 411% of the average daily volume, with 182,882 contracts traded. Calls accounted for 88% of the tally.",
    "Implied volatility rose to 23%, pushing it to the 32nd percentile of its one-year range. Premiums are pricing in daily moves of $3.22 or 1.4%. Bull call spreads aren't a bad way to go if you're speculating on further gains.",
    "Twitter (NYSE: TWTR ) shares scored a long-awaited breakout Tuesday morning, but broad market weakness ultimately upended the rally. The intraday rejection pushed TWTR stock back toward the low of the day ending with a nasty upper shadow on its candlestick.",
    "Fortunately, it still closed above its 20-day moving average, keeping the recent consolidation pattern intact. While the volatility challenges buyers' resolve, the path of least resistance is still higher until support near $40 fails.",
    "On the options trading front, the breakout attempt boosted call demand. Activity grew to 195% of the average daily volume, with 144,250 total contracts traded. 79% of the trading came from call options alone, showing strong enthusiasm backing the breakout bid.",
    "Implied volatility continues to hover at the lower end of its trading range. The 40% reading places it at the 20th percentile of its one-year range. Premiums are baking in daily moves of $1.06 or 2.5%.",
    "As of this writing, Tyler Craig didn't hold a position in any of the aforementioned securities. Check out his recently releasedBear Market Survival Guideto learn how to defend your portfolio against market volatility.",
    "The post Wednesday's Vital Data: Cleveland-Cliffs, Home Depot and Twitter appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:31:53"
}