{
  "url": "https://www.nasdaq.com/article/euro-pauses-before-ecb-meeting-as-trade-thaw-triggers-risk-rally-20190912-00112",
  "title": "Euro pauses before ECB meeting as trade thaw triggers risk rally - Nasdaq.com",
  "text": [
    "By Tommy Wilkes",
    "LONDON, Sept 12 (Reuters) - The euro hovered near $1.10 on Thursday as traders waited to see the scale of fresh stimulus expected from the European Central Bank, while China's yuan and Australia's dollar were buoyed by further signs of a thaw in the U.S.-China trade war.",
    "After a difficult August in which concerns about a global recession sparked a scramble into safer assets, investors have been returning to riskier markets this month, encouraged by China and the United States making moves to ease trade tensions and by receding fears of a no-deal Brexit.",
    "Export-driven Asian currencies from Taiwan to Australia rallied on the buoyant mood as the world's two largest economies each granted concessions in their heated tariff dispute.",
    "The Japanese yen, the go-to safe haven currency for nervous investors, fell to a six-week low against the dollar. The yen breached the 108 mark and was last at 107.98 yen per dollar, down 0.1% on the day and far from its seven-month high of 104.46 plumbed last month.",
    "The Aussie hit a six-week high and the offshore Chinese yuan rose 0.5%  to a three-week high of 7.0737 against the dollar.",
    "Market attention now turns to the ECB, the first of a series of major central bank events, with the Federal Reserve and the Bank of Japan meeting next week.",
    "Investors almost universally expect a rate cut at Thursday's ECB meeting as policymakers try to prop up the region's ailing economy.",
    "The real uncertainty is whether policymakers will restart a quantitative easing programme after some members of the governing council in recent weeks expressed doubt about the need to relaunch asset purchases. ",
    "SEB strategist Jussi Hiljanen said he expected the ECB to cut the deposit rate by 10 basis points, extend the forward guidance on rates by six months and announce the restart of a quantitative easing programme with monthly purchases lower than the market anticipated.",
    "\"Such a package of stimulus measures would be a disappointment for the market, pushing long rates higher and EUR/USD higher and steepening the curve,\" Hiljanen said.",
    "The single currency  has shed 3.5% since June and was steady at $1.1017 in early European trade.",
    "The dollar was slightly lower against a basket of currencies at 98.599 .",
    "Sterling was little changed , . The pound rocketed to a six-week high on Monday, reversing last week's losses as investors welcomed the British parliament's move to block a no-deal Brexit on Oct. 31.",
    "Despite the more positive mood in risk assets this week, analysts expressed some caution about its sustainability.",
    "\"Just as the presidential tweet on tariffs this morning has injected more momentum ... we are only one social media posting away from a thoroughly unpredictable President turning sentiment on its head,\" said Jeffrey Halley, senior market analyst for Asia Pacific at brokerage OANDA."
  ],
  "published_datetime": "2019-09-12 03:59:00"
}