{
  "url": "https://www.nasdaq.com/article/lands-end-surpasses-its-own-outlook-and-raises-full-year-guidance-cm1208198",
  "title": "Lands' End Surpasses Its Own Outlook and Raises Full-Year Guidance - Nasdaq.com",
  "text": [
    "Venerable fashion retailer Lands' End (NASDAQ: LE)  surpassed its projected sales and profit benchmarks when i t report ed fiscal second-quarter 2019 earnings on Thursday morning before the start of trading. Much-beleaguered shares finally found a respite, surging as much as 18% higher in early trading, as investors warmed to the proposition that the company can eventually revive its retail growth prospects.",
    "Below, we'll review the last three months in detail and look ahead to management's near-term guidance, which was raised from previous levels alongside earnings on Thursday.",
    "All comparative numbers that follow refer to the prior-year quarter.",
    "Data source: Land's End.",
    "Image source: Getty Images.",
    "In the earnings press release on Thursday, CEO Jerome Griffith outlined key factors behind the company's improving performance and increased investment potential , while also touching on its current strategy:",
    "We were pleased to have delivered sales and net income above our expectations and adjusted EBITDA at the high end of our range, illustrating the strong progress we are making across our strategic initiatives. Product continued to resonate with consumers as we leverage data analytics to align our key item offerings with consumer demand. We believe our enhancements to our product offering combined with our marketing efforts are yielding overall growth in our customer file, which reflects high-teens growth in new customers.",
    "We are also very pleased with our retail expansion strategy with U.S. stores operating at or above expectations. Looking ahead, we remain committed to the continued advancements of our growth strategies centered on getting the product right, operating as a digitally led company, executing a uni-channel strategy, and improving business processes and infrastructure. We believe the execution of these strategies positions us to achieve double-digit EBITDA growth annually beginning in fiscal 2020 and puts us on track to achieve our stated long-term financial objectives.",
    "Turning our attention to the upcoming quarter, Lands' End expects net revenue of $345 million to $355 million, and diluted EPS of between $0.05 and $0.12.",
    "With two quarters left in fiscal 2019, the company revised its full-year outlook on Thursday. While revenue remains pegged between $1.45 billion and $1.50 billion, net income is now slated to land in a range of $12 million to $17 million, in comparison with last quarter's outlook for $10 million to $16 million. Similarly, Lands' End now projects that diluted EPS will fall between $0.37 and $0.52, versus an earlier expectation of $0.30 to $0.50. The company left its adjusted EBITDA target unchanged for the fiscal year: Management still expects that adjusted profits will wind up between $70 million and $80 million by year-end.",
    "10 stocks we like better than Lands' End\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Lands' End wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Asit Sharma has no position in any of the stocks mentioned. The Motley Fool owns shares of and recommends Delta Air Lines. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 01:21:00"
}