{
  "url": "https://www.nasdaq.com/article/brazil-senate-committee-approves-pension-system-overhaul-20190904-01145",
  "title": "Brazil Senate committee approves pension system overhaul - Nasdaq.com",
  "text": [
    "BRASILIA, Sept 4 (Reuters) - Brazil'sSenate constitutional affairs committee on Wednesday approved by a vote of 18-7 a bill that would overhaul the social security system and save the federal government about 1 trillion reais ($243 billion) over the next decade.",
    "The vote adds to signs that President Jair Bolsonaro's chief economic reform will see easy passage in the full Senate before he signs it into law. Overhaul of the costly pension system is being closely watched by investors worried about Brazil's huge budget deficit.",
    "The bill introduces a minimum retirement age, an unpopular change that means Brazilians would have to work more years to get their full pensions, but one that a majority of political leaders see as necessary to fix an unsustainable system.",
    "That bill with follow-on proposals, which would need lower house approval after passing the Senate, was designed to avoid delaying a reform process that economists call essential to stabilizing Brazil's public finances and re-igniting growth.",
    "The government had originally hoped for overall fiscal savings of 1.3 trillion reais over a decade, but Jereissati declined to estimate the total impact the amended bills would have on the federal and local government budgets.",
    "Senators excluded a proposal by Economy Minister Paulo Guedes to have privately managed retirement accounts based on worker and employer contributions, a so-called \"capitalization\" model adopted in other countries such as Chile.",
    "Under Brazilian law, bills require two votes in both the lower and upper houses if they make changes to the constitution.",
    "Senator Davi Alcolumbre, head of the upper chamber, told reporters pension reform would clear the Senate and be ready for  presidential signature by Oct. 10."
  ],
  "published_datetime": "2019-09-04 05:07:00"
}