{
  "url": "https://www.nasdaq.com/article/is-wisdomtree-international-high-dividend-fund-dth-a-strong-etf-right-now-cm1207723",
  "title": "Is WisdomTree International High Dividend Fund (DTH) a Strong ETF Right Now? - Nasdaq.com",
  "text": [
    "Making its debut on 06/16/2006, smart beta exchange traded fund WisdomTree International High Dividend Fund (DTH) provides investors broad exposure to the Broad Developed World ETFs category of the market.",
    "What Are Smart Beta ETFs?",
    "Products that are based on market cap weighted indexes, which are strategies designed to reflect a specific market segment or the market as a whole, have traditionally dominated the ETF industry.",
    "Market cap weighted indexes work great for investors who believe in market efficiency. They provide a low-cost, convenient and transparent way of replicating market returns.",
    "However, some investors believe in the possibility of beating the market through exceptional stock selection, and choose a different type of fund that tracks non-cap weighted strategies: smart beta.",
    "These indexes attempt to select stocks that have better chances of risk-return performance, based on certain fundamental characteristics or a combination of such characteristics.",
    "Methodologies like equal-weighting, one of the simplest options out there, fundamental weighting, and volatility/momentum based weighting are all choices offered to investors in this space, but not all of them can deliver superior returns.",
    "Fund Sponsor & Index",
    "The fund is managed by Wisdomtree, and has been able to amass over $229.02 M, which makes it one of the average sized ETFs in the Broad Developed World ETFs. DTH seeks to match the performance of the WisdomTree International High Dividend Index before fees and expenses.",
    "The WisdomTree International High Dividend Index is a fundamentally weighted Index that measures the performance of companies with high dividend yields selected from the WisdomTree International Equity Index.",
    "Cost & Other Expenses",
    "Investors should also pay attention to an ETF's expense ratio. Lower cost products will produce better results than those with a higher cost, assuming all other metrics remain the same.",
    "Operating expenses on an annual basis are 0.58% for this ETF, which makes it one of the more expensive products in the space.",
    "It has a 12-month trailing dividend yield of 4.48%.",
    "Sector Exposure and Top Holdings",
    "While ETFs offer diversified exposure, which minimizes single stock risk, a deep look into a fund's holdings is a valuable exercise. And, most ETFs are very transparent products that disclose their holdings on a daily basis.",
    "When you look at individual holdings, China Mobile Ltd accounts for about 2.57% of the fund's total assets, followed by Bp Plc (BP/) and Royal Dutch Shell Plc Class A (RDSA).",
    "DTH's top 10 holdings account for about 18.66% of its total assets under management.",
    "Performance and Risk",
    "So far this year, DTH has added about 5.80%, and is down about -3.02% in the last one year (as of 09/05/2019). During this past 52-week period, the fund has traded between $36.10 and $42.54.",
    "DTH has a beta of 0.79 and standard deviation of 11.61% for the trailing three-year period, which makes the fund a medium risk choice in the space. With about 489 holdings, it effectively diversifies company-specific risk.",
    "Alternatives",
    "WisdomTree International High Dividend Fund is not a suitable option for investors seeking to outperform the Broad Developed World ETFs segment of the market. Instead, there are other ETFs in the space which investors should consider.",
    "IShares MSCI EAFE ETF (EFA) tracks MSCI EAFE Index and the iShares Core MSCI EAFE ETF (IEFA) tracks MSCI EAFE Investable Market Index. IShares MSCI EAFE ETF has $58.20 B in assets, iShares Core MSCI EAFE ETF has $63.88 B. EFA has an expense ratio of 0.31% and IEFA charges 0.07%.",
    "Investors looking for cheaper and lower-risk options should consider traditional market cap weighted ETFs that aim to match the returns of the Broad Developed World ETFs.",
    "Bottom Line",
    "To learn more about this product and other ETFs, screen for products that match your investment objectives and read articles on latest developments in the ETF investing universe, please visit Zacks ETF Center .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 06:49:00"
}