{
  "url": "https://www.nasdaq.com/article/bhp-investors-file-resolution-to-cut-funding-for-australian-coal-lobby-groups-20190903-01022",
  "title": "BHP investors file resolution to cut funding for Australian coal lobby groups - Nasdaq.com",
  "text": [
    "MELBOURNE, Sept 4 (Reuters) - Several BHP Group shareholders, including the Church of England pension fund, are recommending the company suspend its membership in industry groups that advocate for policies inconsistent with the Paris climate change agreement.",
    "The resolution was filed on Tuesday by the Australasian Centre for Corporate Responsibility (ACCR) ahead of BHP's ,  annual general meetings (AGM) in London and Sydney, the ACCR said in a statement.",
    "Co-filers included the Church of England Pensions Board and Grok Ventures, the private investment vehicle of Australian tech billionaire Mike Cannon-Brookes, as well as institutional investors that combined hold A$140 billion( $94.6 billion) under management.",
    "\"ACCR has met with BHP on multiple occasions, and we have given them a long list of examples of adverse climate lobbying by their industry associations,\" it said.",
    "BHP Chief Executive Officer Andrew Mackenzie said in July that the world's biggest miner would invest $400 million over five years to reduce emissions, as it also became the first miner to pledge to tackle pollution caused when customers use its products. ",
    "ACCR said that the inconsistency between BHP's climate-aware positioning and \"the oppositional advocacy of its industry associations is especially acute in Australia.\" Australia is the world's biggest coal exporter.",
    "Industry groups like Minerals Council of Australia have repeatedly called for coal friendly policies, including government subsidies for coal-fired power stations and the development of a new thermal coal basin in Queensland, the ACCR said.",
    "To meet carbon targets in the Paris accord, Western countries must stop burning coal for power by 2030, experts have said.",
    "The ACCR lodged a similar resolution in 2017 that saw BHP review its membership of more than twenty industry associations and quit the World Coal Association.",
    "At the time, BHP pledged to review its membership in any groups that advocated for \"material\" differences in policy positions to its own that could impact public policy and where it did not otherwise see sufficient membership benefit.",
    "BHP has said that it can accomplish more with industry groups by being members but that it would keep its membership of groups and their policy positions under review.",
    "BHP's upcoming London AGM is on Oct. 17 while its Sydney AGM is Nov. 7.",
    "($1 = 1.4806 Australian dollars)"
  ],
  "published_datetime": "2019-09-03 15:00:00"
}