{
  "url": "https://www.nasdaq.com/article/this-habit-could-be-costing-you-1800-a-year-cm1207691",
  "title": "This Habit Could Be Costing You $1,800 a Year - Nasdaq.com",
  "text": [
    " Unfortunately, throwing away money is something that's all too   easy to do. Any time you rack up a credit card balance you can't   pay in full, you start accruing interest that amounts to wasted   cash. The same holds true for unused services like the streaming   app you rarely watch, or the   gym    you stopped visiting months ago. But if there's one habit that   could be costing you a small fortune, it's throwing out uneaten   food. The average family of four spends $1,800 per year on food that   winds up getting tossed, according to the Natural Resources   Defense Council, a nonprofit. Considering that 60% of Americans   have   less than $1,000    set aside for emergency expenses, that's a big deal.   Image source: Getty Images.makeArticleAd();  If you have a tendency to throw out food on a regular basis,   kicking that habit could save you some serious cash. Here's how   to avoid so much waste.  1. Pay attention to food labels  The confusing nature of food labels leads to needless waste,   but you can avoid that problem by paying closer attention to what   those labels are telling you. \"Sell by,\" for example, generally   doesn't mean \"use by.\" An item may be perfectly salvageable days   or even weeks after its sell-by date. The key is to make sure you   don't consume products after their use-by date, especially highly   perishable items such as meat and dairy.  2. Take regular inventory at home  You're more likely to throw out food if you shop without   having any idea what your pantry and fridge look like. Rather   than risk loading up on items you haven't yet run out of, make a   point of taking inventory once a week so that you're only   replenishing items you're truly low on. You can track your   inventory on a spreadsheet, or use one of many   useful apps    to get the job done.  3. Always shop with lists  It's easy to get distracted by fancy supermarket displays and   sale items, but if you buy items you don't really need, there's a   good chance you'll wind up throwing some away. A better bet?   Always make a grocery list before you hit the stores, and stick   to it.  4. Be careful when buying in bulk  Buying groceries in bulk can be a huge money-saver if you do   it carefully. But it can also lead to overspending and excessive   waste. If you're going to load up on bulk items, stick to a few   key ground rules. First, buy only items you use regularly --   don't take a chance on a case of pasta sauce you've never tried,   or a frozen-burger brand your kids may not like. Next, don't buy   perishable items in bulk unless you're certain you have the space   to store them. Those supersized bags of frozen vegetables won't   do you much good if you don't have enough room in your freezer to   house them. Finally, pay attention to expiration dates. The giant   bag of lettuce your warehouse club sells may be enough to feed   your family salad for a week, but if it's only good for two days,   there's no sense in purchasing it. Being mindful of how you shop for food could save you a huge   chunk of cash in the course of a year. If you've been known to   throw out groceries, it's time to rethink your approach to food   management -- before you waste even more money you can't afford   to part with.   The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .   The Motley Fool has a     disclosure policy      .  ",
    "Unfortunately, throwing away money is something that's all too   easy to do. Any time you rack up a credit card balance you can't   pay in full, you start accruing interest that amounts to wasted   cash. The same holds true for unused services like the streaming   app you rarely watch, or the   gym    you stopped visiting months ago. But if there's one habit that   could be costing you a small fortune, it's throwing out uneaten   food.",
    "The average family of four spends $1,800 per year on food that   winds up getting tossed, according to the Natural Resources   Defense Council, a nonprofit. Considering that 60% of Americans   have   less than $1,000    set aside for emergency expenses, that's a big deal.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "If you have a tendency to throw out food on a regular basis,   kicking that habit could save you some serious cash. Here's how   to avoid so much waste.",
    "The confusing nature of food labels leads to needless waste,   but you can avoid that problem by paying closer attention to what   those labels are telling you. \"Sell by,\" for example, generally   doesn't mean \"use by.\" An item may be perfectly salvageable days   or even weeks after its sell-by date. The key is to make sure you   don't consume products after their use-by date, especially highly   perishable items such as meat and dairy.",
    "You're more likely to throw out food if you shop without   having any idea what your pantry and fridge look like. Rather   than risk loading up on items you haven't yet run out of, make a   point of taking inventory once a week so that you're only   replenishing items you're truly low on. You can track your   inventory on a spreadsheet, or use one of many   useful apps    to get the job done.",
    "It's easy to get distracted by fancy supermarket displays and   sale items, but if you buy items you don't really need, there's a   good chance you'll wind up throwing some away. A better bet?   Always make a grocery list before you hit the stores, and stick   to it.",
    "Buying groceries in bulk can be a huge money-saver if you do   it carefully. But it can also lead to overspending and excessive   waste. If you're going to load up on bulk items, stick to a few   key ground rules. First, buy only items you use regularly --   don't take a chance on a case of pasta sauce you've never tried,   or a frozen-burger brand your kids may not like. Next, don't buy   perishable items in bulk unless you're certain you have the space   to store them. Those supersized bags of frozen vegetables won't   do you much good if you don't have enough room in your freezer to   house them. Finally, pay attention to expiration dates. The giant   bag of lettuce your warehouse club sells may be enough to feed   your family salad for a week, but if it's only good for two days,   there's no sense in purchasing it.",
    "Being mindful of how you shop for food could save you a huge   chunk of cash in the course of a year. If you've been known to   throw out groceries, it's time to rethink your approach to food   management -- before you waste even more money you can't afford   to part with.",
    "  The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      . ",
    " The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .",
    " The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 06:04:00"
}