{
  "url": "https://www.nasdaq.com/article/crude-climbs-boosted-by-chinas-services-sector-activity-cm1207266",
  "title": "Crude Climbs, Boosted by China's Services Sector Activity - Nasdaq.com",
  "text": [
    " SECTOR COMMENTARY ",
    "Energy stocks are higher in the premarket on an abatement of tensions in Hong Kong which boosted markets globally including  oil prices  . However, U.S. data released on Wednesday showed manufacturing activity contracted in August for the first time in three years, while euro zone activity shrank for a seventh month. Day 2 of the Barclays Energy Conference marches on today with a somber tone after yesterday's comments that E&P spending in North America could be challenged to grow in the near-to-intermediate timeframe.",
    "Crude oil is higher, accelerating all morning after recovering from three days of losses boosted by a wider market pickup on positive news from China's services sector. A private survey showed that activity in China's services sector expanded at the fastest pace in three months in August as new orders rose, prompting the biggest increase in hiring in over a year. API data tonight ahead of EIA data tomorrow is expected to show large draws across the board. More broadly, the major developments in Hong Kong quelled investors' risk-aversion.",
    "Natural gas prices are higher on technical trading above the 100 day moving average and a smaller than usual storage build expected this week.",
    " INTERNATIONAL INTEGRATEDS ",
    "Reuters - BP  Indonesia Head said the company plans to sell 120 cargoes of LNG in 2020 from Tangguh Plant, up from 2019 outlook of 118 cargoes. The company also plans to turn Train 2 in 2020.",
    "Press Release - Qantas and BP  Australia have announced a new customer loyalty partnership that will see Qantas Frequent Flyer become the cornerstone partner of BP's new customer loyalty program, BP Rewards. Launching in early 2020, the BP Rewards program will allow customers to earn Qantas Points on fuel and eligible in-store purchases across participating BP retail sites.",
    "(Late Tuesday) Reuters - Operations at BP  's 430,000 bpd Whiting, Indiana, refinery were continuing normally with no units shut. Refined products market traders have been talking of a shut unit at the refinery, which is preparing to begin an overhaul of the small gasoline-producing fluidic catalytic cracking unit (FCCU).",
    "Credit Suisse downgraded Eni  to 'Neutral' from 'Outperform.'",
    "Reuters - Royal Dutch Shell  has asked U.S. regulators to extend the time by which it should complete an LNG export project in Louisiana by five years to 2025. The project, a 50-50 venture with U.S. midstream company Energy Transfer, envisaged converting an existing import and regasification facility in Lake Charles into a multi-train, 16.45 million tonnes per year (mtpa) facility. The delay takes a major U.S. export project out of the race to achieve a final investment decision (FID) in time to start operations during an anticipated supply downturn in 2023-2024.",
    "Reuters - Liquefied natural gas (LNG) shipping company Gaslog Ltd said it had struck a deal to lease a tanker for 10 years to a gas-to-power project in Panama being developed by a Chinese company and supplied by Royal Dutch Shell  .",
    "Reuters - A total of 33 oil companies submitted bids for exploration blocks offshore Norway in a so-called predefined areas (APA) licensing round, the Ministry of Oil and Energy said. This year's round included 48 blocks in the Barents Sea, 37 blocks in the Norwegian Sea and five in the North Sea. Bidders included oil majors Royal Dutch Shell  , ConocoPhillips and Total  . Equinor, Aker BP, Lundin Petroleum, DNO and Eni  's Vaar Energi were also on the list. After processing the applications, the ministry aims to award licenses in early 2020",
    "(Late Tuesday) Reuters - Total  plans to restart a diesel hydrotreater at its 225,500-barrel-per-day (bpd) Port Arthur, Texas, refinery in mid-September. The 66,000-bpd Diesel Hydrotreater 3 (DHT 3) was shut on Aug. 20. Repairs began two days later after a failed restart attempt.",
    " U.S. E&PS ",
    "KeyBanc Capital Markets initiated coverage of Bonanza Creek Energy  at 'Overweight.'",
    "MKM Partners initiated coverage of Centennial Resource Development  at 'Buy.'",
    "Reuters - A total of 33 oil companies submitted bids for exploration blocks offshore Norway in a so-called predefined areas (APA) licensing round, the Ministry of Oil and Energy said. This year's round included 48 blocks in the Barents Sea, 37 blocks in the Norwegian Sea and five in the North Sea. Bidders included oil majors Shell, ConocoPhillips  and Total. Equinor, Aker BP, Lundin Petroleum, DNO and Eni's Vaar Energi were also on the list. After processing the applications, the ministry aims to award licenses in early 2020.",
    "Press Release - Marathon Oil  announced that it has launched a conversion and remarketing of $600 million of sub-series A bonds (the \"Sub-Series 2017A Bonds\") which are part of the $1 billion St. John the Baptist, State of Louisiana (the \"Issuer\") Revenue Refunding Bonds (Marathon Oil Corporation Project) Series 2017 (the \"2017 Bonds\") issued and purchased by the Company on December 18, 2017.  Assuming a successful remarketing of all of the Sub-Series 2017A Bonds, the Company will continue to own the remaining $400 million of the 2017 Bonds and has the right to convert and remarket them to investors at any time up to the 2037 maturity date.  The Company will continue to be obligated to service the principal and interest payments associated with the $1 billion 2017 Bonds.  The proceeds from the conversion and remarketing will be used to pay the purchase price of the converted 2017 Bonds owned by the Company on the closing date.  The Company does not intend for this conversion and remarketing to result in a long-term increase in the Company's indebtedness.",
    "(Late Tuesday) Press Release - Marathon Oil  announced that it sent an irrevocable notice of early redemption to the holders of the Company's $600 million 2.7% Senior Notes Due 2020.",
    "Press Release - Matador Resources  announced the appointment of Ms. Monika U. Ehrman to its Board of Directors. Professor Ehrman received her Bachelor of Science degree in Petroleum Engineering from the University of Alberta; J.D. from Southern Methodist University Dedman School of Law; and Master of Laws degree from Yale Law School. The Board has appointed Professor Ehrman to serve on the Corporate Governance, Operations and Engineering and Prospect Committees.",
    " CANADIAN E&PS ",
    "(Late Tuesday) Press Release - Advantage Oil & Gas  announced a significant Montney light oil pool has been discovered and appraised at Progress, Alberta, on the Corporation's 47 net section block of 100% owned lands.  This discovery elevates the Progress asset to be a primary element of the Corporation's near-term liquids development program.",
    "(Late Tuesday) Press Release - Crescent Point Energy  is selling $912-million in assets, a major step toward cutting its debt as it shifts its focus to core oil properties in Saskatchewan. The Calgary-based company said that it reached private deals to sell all of its Uinta Basin oil assets in Utah for $700-million and some conventional oil properties in Saskatchewan for $212-million. Crescent Point said its net debt is projected to be $2.75-billion by the end of this year, compared with $4.4-billion last year, when the company embarked on a turnaround strategy under new chief executive officer Craig Bryksa.",
    "Press Release - Encana  announced the final results of its substantial issuer bid under which it has accepted to purchase for cancellation 47,333,333 of its common shares at a purchase price of US$4.50 per Share, for an aggregate purchase price of approximately US$213 million. Shares purchased under the Offer represent approximately 3.5% of the issued and outstanding Shares at the time that the Offer was commenced.",
    " OILFIELD SERVICES ",
    "TD Securities upgraded Enerflex  to 'Buy' from 'Hold.'",
    "(Late Tuesday) Press Release - Tidewater  announced that the board of directors of company has appointed Quintin V. Kneen as President, Chief Executive Officer, and director of Tidewater, effective immediately. John T. Rynd is retiring as President, Chief Executive Officer, and director of Tidewater.",
    "Reuters - U.S. Silica Holdings  said 3Q'19 adjusted EBITDA is expected to be similar to or slightly lower than 1Q'19.",
    " DRILLERS ",
    "TD Securities upgraded Precision Drilling  to 'Action List Buy' from 'Buy.'",
    "(Late Tuesday) Press Release - On September 3, 2019, Transocean  announced that it intends to retire in an environmentally responsible way, the following three ultra-deepwater floaters: Discoverer Enterprise, Discoverer Spirit, and Discoverer Deep Seas. These rigs are classified as held for sale. As a result of the Company's decision on August 27, 2019, to authorize retirement of these three rigs and associated equipment, the Company expects its third quarter 2019 results to include an estimated non-cash charge of approximately $580 million. As the Company continues to evaluate the long-term competitiveness of its fleet, additional rigs may be identified as candidates for retirement.",
    " REFINERS ",
    "Reuters - HollyFrontier  said it sees 2019 Refining & Marketing CapEx of $470 million - $510 million, 2019 HF LSP CapEx of $40 million - $50 million, 2019 HEP CapEx of $30 million - $40 million, and 2019 EBITDA of $240 million to $260 million.",
    " MLPS & PIPELINES ",
    "(Late Tuesday) Press Release - Buckeye Partners  reported that its initial preliminary assessments, subject to physical verification, have not identified any significant damage to its Buckeye Bahamas Hub (BBH) as a result of Hurricane Dorian. Buckeye will provide further updates after in-depth, on-the-ground inspections and assessments of the storm's impact on BBH are completed in the coming days. As the hurricane moves away from Grand Bahama Island, Buckeye's first priority is accounting for the safety of all employees and their families. Consistent with its efforts when Hurricane Matthew struck in 2016, Buckeye intends to work with its business partners, local first responders and governmental authorities to bring needed supplies to the island as soon as it is safe. The health and wellbeing of its local workforce, the communities where it operates and the Bahamian people are Buckeye's top priority.",
    "Press Release - NuStar Energy  announced that it has completed and is moving volumes on three key pipeline projects that will significantly expand the partnership's capacity to move Permian crude oil to Corpus Christi for export, and to move refined products into Northern Mexico.",
    "(Late Tuesday) Press Release - Phillips 66 Partners  announced that it has priced $300 million aggregate principal amount of 2.450% unsecured senior notes due 2024 and $600 million aggregate principal amount of 3.150% unsecured senior notes due 2029 in an underwritten public offering pursuant to an effective shelf registration statement on Form S-3 previously filed with the Securities and Exchange Commission. The 2024 notes were offered at a price to the public of 99.763% of par and the 2029 notes were offered at a price to the public of 99.781% of par.",
    " MARKET COMMENTARY ",
    "Stock futures were trading higher a day after Wall Street's major indexes lost ground. European shares rallied, as political developments in Italy and Britain eased investors' nerves. Positive data from China's services sector and Hong Kong's withdrawal of controversial extradition bill supported Asian stocks. Britain's pound bounced, and the dollar fell against a basket of major currencies. Oil prices rebounded after three days of losses. Gold eased as traders locked in gains after previous session's rise.",
    " NASDAQ ENERGY TEAM THOUGHT LEADERSHIP   ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:15:00"
}