{
  "url": "https://www.nasdaq.com/article/oil-ticks-up-on-us-stocks-fall-signs-of-uschina-thaw-20190912-00120",
  "title": "Oil ticks up on U.S. stocks fall, signs of U.S.-China thaw - Nasdaq.com",
  "text": [
    "By Shadia Nasralla",
    "LONDON, Sept 12 (Reuters) - Oil prices fell on Thursday as a meeting of the OPEC+ alliance yielded no discussion about deepening supply cuts but focused instead on bringing Nigerian and Iraqi output down to their agreed quotas.",
    "Brent crude futures  fell 61 cents to $60.20 a barrel by 1026 GMT, heading for a third session of losses. U.S. West Texas Intermediate futures  were down 37 cents at $55.38.",
    "Prince Abdulaziz said, however, his country would keep cutting by more than it pledged in a deal that has throttled supply by OPEC and its allies by 1.2 million barrels per day. ",
    "Nigeria, Iraq and Russia have, at times, produced above their quota. ",
    "A statement from OPEC and its allies, a grouping known as OPEC+, said oil stocks in industrial countries remained above the five-year average. Oman's energy minister said \"the outlook is not very good for 2020.\" ",
    "Both crude benchmarks fell sharply the previous day following a report that U.S. President Donald Trump had weighed easing sanctions on Iran, a move that would potentially boost global crude supply. ",
    "Also feeding bearish sentiment, the International Energy Agency, which advises industrial economies on energy policy, said surging U.S. output would make balancing the market \"daunting\" in 2020. ",
    "The Paris-based agency kept its oil demand growth forecasts for this and next year at 1.1 million bpd and 1.3 million bpd, respectively.",
    "\"There is not a lot of room for any waiver on Iranian crude oil imports,\" said Petromatrix analyst Olivier Jakob, pointing to likely inventory builds in the first half of next year.",
    "Supporting prices earlier in Thursday's session, China and the United States made some concessions in a protracted trade war, which has weighed on oil demand forecasts, ahead of a planned meeting in coming days. ",
    "Also giving a floor to prices, the U.S. Energy Information Administration said on Wednesday that U.S. crude oil stockpiles fell last week to their lowest in nearly a year, as refineries raised output and imports fell. EIA/S",
    "Crude inventories  fell for a fourth week, decreasing by 6.9 million barrels in the week to Sept. 6 -  more than double analysts' expectations.",
    "At 416.1 million barrels, U.S. crude inventories were at their lowest since October 2018, the EIA said.",
    "The European Central Bank meets later on Thursday and is expected to ease policy to support flagging growth. ",
    "CHART: U.S. oil may fall to $54.83 per barrelL3N2630SP",
    "CHART: Brent oil may retest support at $60.62L3N2630O0"
  ],
  "published_datetime": "2019-09-12 04:41:00"
}