{
  "url": "https://www.nasdaq.com/article/in-uturn-ford-ditches-plan-to-unify-china-sales-system-after-partners-push-back-20190905-00319",
  "title": "In U-turn, Ford ditches plan to unify China sales system after partners push back - Nasdaq.com",
  "text": [
    "By Norihiko Shirouzu and Ben Klayman",
    "SHANGHAI/DETROIT, Sept 5 (Reuters) - Ford Motor Co  has scrapped a plan to create a unified national sales company for China that stoked mistrust of the automaker at its joint venture partners and contributed to a spectacular collapse in sales in the world's biggest car market.",
    "On the face of it, the plan announced by Ford in June last year to combine sales channels for vehicles manufactured with Chongqing Changan Automobile Co  and Jiangling Motors Group made sense. It would promote operational efficiency at its loss-making China operations and is standard practice in most other markets.",
    "\"I would say there was a lack of deep understanding on how relationships work in China,\" Anning Chen, who in October took over as Ford's third China chief in two years, said in an interview in Shanghai.",
    "It is the first time that Ford, grappling with a host of problems in China that present no quick fix, has disclosed the dropping of the plan - a decision also prompted by a sharp slowdown in China's economic growth amid the trade war with the United States as well as deeper losses at dealerships.",
    "Many major foreign automakers have 2 or 3 partners in China, involving different marketing and distribution strategies for each partner. Ford is the only one known to have tried combining sales channels for mainstream cars.",
    "Other steps Ford is taking to turn around its China business include launching 30 new or significantly redesigned vehicles over the next three years, reductions in the number of temporary workers at plants, hiring more local Chinese, and putting profits before growth in market share.",
    "Capacity cuts as Ford and its partners embark on \"right-sizing\" their plants are also likely, Chen said.",
    "A recovery would help relieve pressure on the U.S. automaker which is also scrambling to end losses in Europe through plant closures and layoffs. It would also mitigate the risk that Ford ends up a marginal player in China - a market with annual sales of some 28 million vehicles that many foreign automakers now consider their most important.",
    "SALES IMPLOSION",
    "The slide in Ford's sales has been unprecedented for a major global automaker in China. After a peak of 1.08 million vehicles in 2016, sales began faltering in late 2017, then nearly halved last year to 504,488, according to consultancy IHS Markit.",
    "IHS forecasts Ford's sales will tumble further to 382,882 this year, while LMC Automotive predicts Ford's China market share will fall to 1.4% compared to 3.8% in 2016.",
    "Ford has publicly pinned the blame on an aging model lineup but company officials familiar with the matter said the breakdown in relationships with its joint venture partners and dealers as well as missteps by previous management teams were the bigger factors at play.",
    "For now, Ford's main goal in China is profitability, Joe Hinrichs, president of Ford Automotive, told Reuters at the company's Dearborn, Michigan headquarters.",
    "\"You can be a profitable business in China with a relatively low market share because of...the size of the market,\" he said.",
    "As signs of progress, Hinrichs pointed to dealer inventories at their lowest level in 18 months and a halving in first-half China losses before interest and tax to $283 million from the same period a year earlier.",
    "\"This is not a five-year journey,\" he said, but declined to be more specific when asked how soon Ford's China unit is expected to regain profitability.",
    "Hinrichs, who became head of Ford's auto business in May, helmed its Asia Pacific business from 2009 to 2011 - a period of strong growth for the automaker in China.",
    "Chen, a U.S. citizen who grew up in China and speaks fluent Mandarin, joined Ford in October from Chery Automobile Co. He is however, a Ford veteran, having worked for the firm for 17 years, mostly in Dearborn, prior to joining Chery.",
    "TERRITORIAL ABOUT TERRITORY",
    "Highlighting the uneasy relationship that the joint venture partners have with each other and with Ford has been unhappiness over a cross distribution arrangement for a small sport-utility vehicle, the Territory. It was developed with JMC and sold not only through JMC Ford's sales network but also through Changan Ford's.",
    "The approach angered Changan, which wondered why it wasn't the development partner and which as a bigger state-owned company considers itself far higher in pecking order than a regional firm like JMC, Ford company officials said.",
    "For its part, JMC was upset the product was shared with Changan, the officials added, declining to be identified as they were not authorised to speak publicly on the matter.",
    "Changan Ford, which makes the Ford EcoSport SUV, Focus small car and Mondeo sedan, did not respond to a request for comment. JMC, which builds the Territory and the Transit and Tourneo vans, declined to comment.",
    "While Ford previously touted the arrangement as a success, Chen was more circumspect, saying similar agreements were unlikely as they can create inconsistencies in dealer services.",
    "\"We want to make sure distribution networks are directly facing different market segments and customers. We don't want to mix them up,\" he said.",
    "Ford is also aiming to build more cars locally, which will improve relations with domestic partners and help fill its woefully underused assembly plants. Cars likely to be built in China include the redesigned Ford Explorer and Lincoln Aviator SUVs.",
    "Ford used only 24% of its China production capacity to build 1.6 million vehicles in 2018, according to U.S. consultancy AlixPartners. Normally, rates of around 70% to 75% are considered the breakeven threshold. Ford declined to comment on its China capacity.",
    "PSA Group, also struggling in China with a 26% capacity utilization rate in 2018 according to AlixPartners, is shutting one plant, selling another and cutting thousands of jobs.",
    "Hinrichs said, however, that Ford doesn't feel a \"huge amount of pressure\" to shutter any of its five China plants given that they are already paid for.",
    "Instead, by locally producing many of the upcoming new products, Ford will gain an opportunity to further adjust the installed capacity, he said."
  ],
  "published_datetime": "2019-09-05 07:00:00"
}