{
  "url": "https://www.nasdaq.com/article/general-finance-gfn-q4-2019-earnings-call-transcript-cm1210821",
  "title": "General Finance (GFN) Q4 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   General Finance    (NASDAQ: GFN)        Q4 2019 Earnings Call       Sep 11, 2019 ,   11:30 a.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:   Operator  Welcome to General Finance Corporation's       earnings conference call    for the fourth quarter and fiscal year ended June 30th, 2019.   Hosting the call today from the company's corporate office in   Pasadena, California are Mr. Jody Miller, president and chief   executive officer; and Mr. Charles Barrantes, executive vice   president and chief financial officer. Today's call is being recorded and will be available for   replay beginning at 2:30 p.m. Eastern. [Operator instructions] It   is now my pleasure to turn the call over to Mr. Chris Wilson,   vice president, general counsel and secretary of General Finance   Corporation. Please go ahead, Mr. Wilson.  Chris Wilson    --   Vice President, General Counsel, and Secretary  Thank you, operator. Before we begin today, I would like to   remind you that this conference call may contain certain   forward-looking statements. Such forward-looking statements   include, but are not limited to our views with respect to future   financial and operating results, competitive pressures, increases   in interest rates for our variable-rate indebtedness, our ability   to raise capital or borrow additional funds, the availability of   sufficiently qualified employees to staff our businesses, changes   in the Australian, New Zealand or Canadian dollar relative to the   U.S. dollar, regulatory changes, customer defaults or   insolvencies, litigation, acquisition of businesses that do not   perform as we expect or that are difficult for us to integrate or   control, our ability to secure adequate levels of products to   meet customer demand, our ability to procure adequate supplies   for our manufacturing operations, labor disruptions, adverse   resolution of any contract or disputes with customers, declines   in demand for our products and services from key industries such   as the Australian construction and transportation industries or   the U.S. construction and oil and gas industries or write-off of all or   in part of our goodwill and intangible assets. These risks and   uncertainties could cause actual outcomes or results to differ   mature from those described in our forward-looking statements. We   believe that the expectations represented by our forward-looking   statements are reasonable, but there can be no assurance that   such expectations will prove to be correct. For more details   regarding these risks, please see the Risk Factors section of our   periodic reports filed with the SEC and posted to our website at   www.generalfinance.com.    10 stocks we like better than General   Finance     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and General   Finance wasn't one of them! That's right -- they think   these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019     These forward-looking statements represent the judgment of the   company at this time, and General Finance Corporation disclaims   any intent or obligation to update the forward-looking   statements. In this conference call, we will also discuss certain   non-U.S. GAAP financial measures such as adjusted EBITDA. A   reconciliation of how we define and arrive at adjusted EBITDA is   in our earnings release, and will be included in our annual   report on Form 10-K. And now, I turn the call over to Jody Miller, president and   chief executive officer. Jody, please go ahead.  Jody Miller    --   President and Chief Executive Officer  Thank you, Chris. Good morning, and we appreciate you joining   us today for our fourth-quarter fiscal year 2019 conference call.   I will begin with a brief discussion of our operations, then our   CFO, Chuck Barrantes, will provide our financial overview and our   outlook for fiscal year 2020. Following his remarks, we will open   the call up for questions. We are extremely proud of our accomplishments in fiscal year   2019, delivering record revenues and adjusted EBITDA driven by   growth across all of our operations. We finished the year with   solid momentum for the fourth quarter, generating year-over-year   improvement across virtually all of our key operational and   financial metrics. In fiscal year 2019, we surpassed our quickly   approaching important milestone in our company history. We now   serve over 50,000 customers from our 100 branches across two   geographic venues. Our lease fleet is now comprised of nearly 100,000 units with   over 80% of the units being portable storage or ground level   office containers, which offer the most attractive unit level   economics. It was a year of a century mark for us as we also   generated adjusted EBITDA in excess of $100 million, which is a   company record. Our North American leasing operations again   delivered record results and led our growth as our core container   business, Pac-Van, posted 16% organic growth rate year-over-year   in leasing revenues. Our team at Pac-Van continues to do a great   job executing on a number of key initiatives particularly, our   national account program and our recently introduced PV3 Safety   Containers. At year end, we have on leased nearly 4,000 PV3 Safety   Containers and Royal Wolf premium containers and expect that   number to grow significantly in the fiscal year. We've also   commenced our online ordering capabilities of Pac-Van and are   optimistic about the initiative going forward. With all the   success that we are experiencing in Pac-Van, it comes as no   surprise that we continue to be highly regarded by our customer   base, achieving world-class Net Promoter Score of 84 for the full   year. In addition to organic growth, we remain focused on our   long-term goals of growing Pac-Van's footprint in North America   by geographically expanding our portable storage container   business particularly in the adjacent markets. During the year, we completed five acquisitions and there are   two new markets to Greenville locations. We continue to serve   over half of the top 100 MSAs in the U.S. and our acquisition   pipeline remains healthy. To put this geographic expansion in   perspective, over the last 10 years, we've completed 32   acquisitions in North America, drilling from a footprint of 26   primary locations to 64 locations today. Our liquid containment business delivered improved results for   the fiscal year despite the moderation in leasing activity in   Texas. While oil and gas production in both basins generally   remain healthy, we have been impacted by slow activity year over   year. Additionally, there continues to be some lingering pipeline   availability challenges with some of our customers in the   Permian, as well as, customer consolidation. We remain optimistic   about this business as all indicators continue to point to   healthy production activity in both basins for the foreseeable   future. Our North American manufacturing operations continued to   deliver improved results. Total revenues, including sales of our   North American leasing operations increased by 30% during the   fiscal year and stand-alone adjusted EBITDA increased by over $1   million. This ongoing improvement is due to an increase in demand   in specialty tanks and trailers, as well as, ground level   containers built for Pac-Van. Now turning to our Asia-Pacific   region. Our Asia-Pacific region delivered a solid performance driven   by a 9% increase in leasing revenues in local currency with an   increased activity across most sectors notably in the   transportation, industrial, construction, and consumer sectors.   This is the 11th out of the last 12 quarters where Royal Wolf has   delivered year-over-year growth in leasing revenues, mainly due   to growth in average units on lease and improved utilization. In   fiscal year 2019, we also saw an increase in overall average   monthly lease rates due to moderate pricing power combined with   an improved product mix. Our Royal Wolf team remains focused on   building upon its leading market position across Australia and   New Zealand through a combination of organic growth and   Greenfield openings, and to the extent there are available,   accretive acquisitions. During the fiscal year, we strengthened our market presence in   the region with an acquisition of our largest competitor in New   Zealand and one Greenfield opening in Australia. Over the last 10   years, Royal Wolf has completed 12 acquisitions and grown its   footprint in the region from 24 primary locations to 37 today. To   conclude, our hard-working employees continue to execute on our   proven business strategy and their dedication to the company has   led to an outstanding and record-breaking financial performance.   We continue to see both organic and expansion opportunities in   North America, and ability to strengthen our market leadership in   the Asia-Pacific region. As always, we remain disciplined in our capital allocation. We   ended the year on a high note with our strong performance   positions as well for another year of solid financial results in   fiscal 2020. I'll now turn the call over to Chuck Barrantes for   his financial review and our outlook for the current fiscal   year.  Chuck Barrantes    --   Chief Financial Officer  Thanks, Jody. We will be filing our annual report on Form 10-K   shortly, at which time this document will be available on both   the SEC's EDGAR filing system and on our website. And I encourage   investors and other interested parties to read it as it contains   a substantial amount of information about our company, some of   which we will discuss today. Now turning to our financial   results. Our fiscal 2019 results fell within the guidance range. We   provided it in conjunction with the reporting of our   third-quarter results. Not only did we generate record revenues   and adjusted EBITDA for the year, but our fourth-quarter results   marked the 10th consecutive quarter where we have delivered   year-over-year growth in adjusted EBITDA. In addition to reaching   the key milestones that Jody referred to, we also made   significant progress strengthening our balance sheet and   improving our financial flexibility. We learned our overall cost of financing as we successfully   replaced higher cost of debt in both geographic venues with   lower-cost borrowings on our amended and expanded credit facility   in each region. In addition, our strong financial performance   enabled us to end the year with a net leverage ratio below 4   times, our lowest level in five years. Turning to our   fourth-quarter results. Total revenues were $96.2 million in the   fourth quarter of fiscal '19 compared to $93.8 million for the   fourth quarter of fiscal year '18, an increase of 3%. Leasing revenues, $59.1 million, an increase of 4% from the   prior-year's quarter and comprised 63% of total manufacturing   revenues for both fourth-quarter periods. Nonmanufacturing sales   revenues were $34.3 million in the quarter, an increase of 2%   over the fourth quarter of the prior year. In our North American   leasing operations, revenues for the fourth quarter totaled $61.1   million, compared with $57.4 million for the year ago period, an   increase of 8%, mainly driven by increases in the construction,   commercial, mining and industrial sectors, and were partially   offset by a decrease in the oil and gas sector. Leasing and sales   revenues increased by 6% to 11% on a year-over-year basis,   respectively. Revenues in our North American manufacturing facility from   fourth quarter for $4.2 million, which included intercompany   sales of $1.4 million to our North American leasing operations.   This compares to $3.7 million in total sales for the year ago   period, including intercompany sales of $190,000. Our   manufacturing operations saw increased demand for specialty tanks   and other steel-related products, particularly ground level   office container modifications for our North American leasing   operations. In our Asia-Pacific leasing operations, EBIT revenues   for the fourth quarter totaled $31.5 million, compared to $32.9   million for the fourth quarter of fiscal year 2018, a decrease of   4%. And on a local currency basis, total revenues increased by   approximately 4% and leasing revenues increased by 8%. The   increase in leasing revenues was driven primarily by increases in   the transportation, industrial, education, and retail sectors,   and partially offset by a decrease in the construction sector.   Consolidated adjusted EBITDA was $26.1 million in the fourth   quarter of 2019, compared to $23 million in the prior-year's   quarter, an increase of 13%. And adjusted EBITDA margin as a   percentage of total revenues is 27%, up from 25% in the fourth   quarter of fiscal 2018. As I mentioned, this was the 10th consecutive quarter of   year-over-year adjusted EBITDA growth. In North America, adjusted   EBITDA for our leasing operations was $19 million in the fourth   quarter, compared to $17.6 million from the year ago quarter, an   increase of 8%. Adjusted EBITDA at Pac-Van was $14.7 million, up   25% over year-over-year and Lone Star adjusted EBITDA was $4.3   million, down from $5.8 million in the prior-year's fourth   quarter. For our manufacturing operations, on a stand-alone   basis, adjusted EBITDA was $634,000 for the quarter, compared to   last year's fourth-quarter adjusted EBITDA of $460,000. Asia-Pacific's adjusted EBITDA for the quarter was $8.8   million compared to $7.5 million in the year-ago period, an   increase of 17%. On a local currency basis, adjusted EBITDA   increased by 27% from the prior-year's fourth quarter. Interest   expense for the fourth quarter of 2019 was $7.6 million, down   from $9.3 million for the fourth quarter of last year. The   decrease was primarily driven by lower interest expense in the   Asia-Pacific area and the lower average borrowings and a lower   interest rate of 8.1% from fourth quarter of fiscal 2019 versus   10% in the year-ago period, and by a weaker Australian dollar   between the periods. Net income attributable to common stockholders in the fourth   quarter was $4.3 million, or $0.14 per diluted share, compared to   a net loss of $11.6 million, or $0.44 per share in the year-ago   fourth quarter. Including these results were non-cash charges of   $1.7 million to $11.5 million in fiscal year 2019 and '18,   respectively, for the change in valuation of stand-alone   bifurcated derivatives. Both periods included $892,000 for the   dividends paid on our preferred stock. For fiscal year 2019, we   generated free cash flow before fleet activity of $50.5 million,   up slightly from $50 million in the prior year. Turning to our balance sheet. At June 30th, the company had a   net leverage ratio of 3.7 times for the trailing 12 months, which   compared very favorably with a net leverage ratio of 4.6 times at   June 30, 2018. Finally, turning to our companywide outlook for   fiscal year 2020. Depending on the condition in the oil and gas   sector in Texas and assuming the Australian dollar averages $0.68   versus the U.S. dollar, we estimate the consolidated revenue for fiscal year   2020 will be in the range of $370 million to $390 million, and   the consolidated adjusted EBITDA is expected to be in the range   of plus or minus 4% in fiscal year '20 from fiscal year '19. This   outlook does not take into account the effect of any acquisitions   that may occur during fiscal year 2020. This now concludes our   prepared comments, and I would like to turn the call back to the   operator for the question-and-answer session. Questions & Answers:   Operator  [Operator instructions] Our first question comes from the line   of Brent Thielman of D.A. Davidson.  Brent Thielman    --   D.A. Davidson -- Analyst  Thanks, good morning.  Jody Miller    --   President and Chief Executive Officer  Good morning, Brent.  Chuck Barrantes    --   Chief Financial Officer  Good morning.  Brent Thielman    --   D.A. Davidson -- Analyst  Jody or Chuck, I guess in terms of the outlook for F '20,   could you give a little bit more detail kind of what you're   factoring in for Lone Star? You know, I understand that   longer-term outlook is positive, notwithstanding some near-term   headwinds. So just trying to get a sense of what you're kind of   factoring into that that initial view for F'20 for Lone Star.  Jody Miller    --   President and Chief Executive Officer  Yeah, Brent. Thanks. This is Jody. Sor if you look at our   current quarter run rate, we're probably more in the $15 million,   $16 million range. So that's why we're a little bit more conservative on outlook   there. I mean all indicators show that it should improve. There's   a lot of wells drilled. And as we've mentioned before, we're   heavier on the production and completion side, so we're   optimistic that things will get more positive, but that's kind of   where our estimates are. Pac-Van, obviously, doing very well and growing at a nice   pace, and then kind of offset by that Lone Star being more of   today's run rate versus the latter half of last year when things   were a little more positive. So that's kind of how we're looking   at it but cautiously optimistic, it will be better than that.  Brent Thielman    --   D.A. Davidson -- Analyst  OK. And then I guess on Pac-Van's kind of traditional end   markets, which sectors are you seeing strengthening and, I guess,   similarly, where might you be seeing some softening in, I guess,   in demand within this vertical?  Jody Miller    --   President and Chief Executive Officer  Yeah. To be honest, we have not seen any negatives. Retail   season appears it's going to be very strong for us. The   construction sector, industrial sectors are still doing very   well, and we're getting nice growth across the board with   commercial still kind of leading the pack. So I think as product awareness continues to grow and the   economy goes well, we're doing quite well, and don't really see   any softening in any one area or geographically either.  Brent Thielman    --   D.A. Davidson -- Analyst  OK. I guess my last question. You know, the deleverage ratio   is at 4 times. I guess when you think about the new fiscal year,   where would you ideally like to see that ratio land by year   end?  Chuck Barrantes    --   Chief Financial Officer  Well, assuming that we do not make significant investment in   acquisitions, I mean, we would anticipate having that leverage   slow down. But we stated publicly before, we actually like our   sweet spot deleverage between -- to be somewhere around 4 times,   4.5 times. So we're a little below, which is good, which shows   the profitability . But also, you know, we think that we can   certainly use whatever free cash flow we have to make -- to even   make investments in acquisitions.  Brent Thielman    --   D.A. Davidson -- Analyst  OK. Thank you.  Operator  Our next question comes from the line of Scott Schneeberger of   Oppenheimer.  Unidentified speaker  Good morning, it's Daniel on for Scott.  Jody Miller    --   President and Chief Executive Officer  Hey.  Unidentified speaker  Hey, guys. Can we talk about the pricing environment across   the segment if you can give us an overview how things are looking   now and what the opportunity is going forward?  Chuck Barrantes    --   Chief Financial Officer  Yes. So on the Pac-Van, on this portable storage side, pricing   is doing very nicely. We're seeing very consistent price   increases like we've seen in the last several quarters with the   ground level or GLOs kind of leading the pack in price increases.   On the Royal Wolf side, very modest price increases but they are   coming up. And then on the Lone Star side, we're seeing just a little bit   of compression. Actually, the Eagle Ford is up a little bit, but   the Permian is down slightly, and I think that's just a natural   occurrence with the slowdown but nothing too drastic at this   point.  Unidentified speaker  OK. Thank you for that. On the end markets in Asia-Pacific,   can you talk about what areas -- where you see opportunities over   fiscal '20?  Jody Miller    --   President and Chief Executive Officer  Yeah. I think, you know, probably our biggest opportunity   there is on the building and construction. That's an area that we   feel like has a lot of opportunity for growth. Some of our   products are becoming more popular in the stackable solutions on   the B and C side. So I would say that and then just naturally, in Australia and   New Zealand markets, as I mentioned before, everything is moved   by rails. So our freight segment is doing quite well as well, and   then our camps that have been sitting idle for many years, we've   got most of those out or spoken for at this point, which will be   a nice lift for Royal Wolf as well. So pricing-wise, they're   doing nicely not as bigger price increases that we got in North   America but they're still on the rise versus flat.  Unidentified speaker  Got it. THank you. Final one for me. capex plans for fiscal   '20 and categories?  Chuck Barrantes    --   Chief Financial Officer  So we're looking at, as far as our planning is concerned,   we're looking at fiscal '20 net capex to be actually comparable   to fiscal year '18. So in fiscal year '19, our net capex is   around $39 million. In fiscal '18, it was at $21 million, and   we're looking at net capex to be around the same levels to fiscal   '18 to fiscal year '20, so $22 million. That's net capex. The gross capex, obviously, is a little higher. Gross capex   would be $60 million, and we expect it to -- with the sales out   of the fleet tune it down to $22 million. And that comes from   primarily North America, Asia Pacific, we anticipate somewhere   between $1 million, $2 million and North America to make up the   balance in 2022.  Unidentified speaker  OK. That's very helpful. Thank you so much.  Chuck Barrantes    --   Chief Financial Officer  Sure.  Operator  Our next question comes from the line of Brian Gagnon of   Gagnon Securities.  Brian Gagnon    --   Gagnon Securities -- Analyst  Hello, gentlemen.  Jody Miller    --   President and Chief Executive Officer  Brian.  Brian Gagnon    --   Gagnon Securities -- Analyst  Um, the same question but a little bit differently. If you   only have $22 million of net capex and you've got $50-plus   million of free cash flow, do you think you have enough   opportunities to acquire businesses? Or will you expand into more   greenfields? Or will you really try to pay down the most   expensive debt that you have?  Chuck Barrantes    --   Chief Financial Officer  I'll address the last one first. If we do not have significant   acquisition, we would expect that after we pay our preferred   stock dividends, we'd have somewhere in the vicinity of $20   million, $25 million consolidated to reduce our overall   indebtedness. And then re -- go ahead.  Jody Miller    --   President and Chief Executive Officer  I was just going to say regarding the acquisition side, you   know, our pipeline remains healthy. We don't see anything   changing. As I mentioned on the call, we had five last year, so   we do feel like there's opportunities there as far as expansion.   We're a little more aggressive with greenfields this past year   just because of some of the hurricane rebuild opportunities, and   we'll continue to expand greenfield. And again, we prefer adjacent markets but we do feel like   there's a great opportunity to expand in the greenfield side as   well.  Brian Gagnon    --   Gagnon Securities -- Analyst  OK. Um, all right. The interest expense, you pushed down your   interest rate in Australia to, I guess, 8%, you said versus last   year's 10%?  Chuck Barrantes    --   Chief Financial Officer  Yeah. For the fourth quarter, yup. Weighted average.  Brian Gagnon    --   Gagnon Securities -- Analyst  OK. What do you think the weighted averages are for 2020 at   this point?  Chuck Barrantes    --   Chief Financial Officer  Well, we no longer have the Bison debt, so I would determine   that the weighted average based on the BBSwide plus the margin   should be somewhere in the vicinity of 6% to 7%.  Brian Gagnon    --   Gagnon Securities -- Analyst  OK. So we're going to get an additional benefit on interest   expense.  Chuck Barrantes    --   Chief Financial Officer  Yeah. I would say, if expense is consolidated going forward,   it's somewhere in the $7 million to $7.5 million per quarter   range, which is significantly less than $1 million that's been in   the prior quarters.  Brian Gagnon    --   Gagnon Securities -- Analyst  OK. Terrific. That's all I have for now. Thank you.  Jody Miller    --   President and Chief Executive Officer  Thanks, Brian.  Chuck Barrantes    --   Chief Financial Officer  Thanks.  Operator  [Operator instructions] Our next question comes from the line   of Luis Hernandez, a private investor.  Luis Hernandez    --   Private Investor  Yes. Hello. Good morning, guys.  Jody Miller    --   President and Chief Executive Officer  Good morning, Luiz.  Chuck Barrantes    --   Chief Financial Officer  Good morning.  Luis Hernandez    --   Private Investor  All right. My first question is related to capital structure.   Have you thought ever -- about doing anything with the   preferreds? I believe in August, they became redeemable. Maybe   I'm wrong, but have you thought about anything in that front?  Chuck Barrantes    --   Chief Financial Officer  Yeah. Luis, this is Chuck. So yes, we've thought -- actually,   they've been redeemable since May of 2018, I believe so. As you   know, they're classified as equity. We are looking at that also in context of the senior notes,   which are June and July 2021. Prior to that, we had a few   refinancing, as you know, Luis, in terms of the Bison Capital,   you know, refinancing the Deutsche Bank and also refinancing   Wells Fargo. So that is definitely next on our capital structure   list.  Luis Hernandez    --   Private Investor  OK. Great. Then did you said $50.5 million in free cash flow?   Is that what you said?  Chuck Barrantes    --   Chief Financial Officer  $50.5 million was the free cash flow for this fiscal year,   yes.  Luis Hernandez    --   Private Investor  $50.5 million. All right. OK. Then --  Chuck Barrantes    --   Chief Financial Officer  And that's after interest payments. So that's after interest   payments before investments and any type of debt reduction.  Luis Hernandez    --   Private Investor  Right. And then before the preferred dividends?  Chuck Barrantes    --   Chief Financial Officer  Correct.  Luis Hernandez    --   Private Investor  Right. Jody did mention on the Lone Star's estimated EBITDA to   be around $15 million to $16 million, right?  Chuck Barrantes    --   Chief Financial Officer  That is the estimated, so that's kind of the current run   rate.  Jody Miller    --   President and Chief Executive Officer  Yeah. That's the current run rate, Luis. We're hoping, you   know, that [Inaudible] activity will pick up. And after the   consolidation, kind of work its way out with, you know, a couple   of our larger customers, and the pipelines free up, we're hoping   the completion kind of speeds back up. But that's our current run rate, yes.  Luis Hernandez    --   Private Investor  Right. But would you think it's going to be a little higher,   maybe? Is that what you're saying?  Jody Miller    --   President and Chief Executive Officer  We're cautiously optimistic that it will be higher because we   feel like the -- the well is already drilled, so they only have   so long to put those wells into completion for production of oil.   So -- and that's where we spend most of our time. It's on that   side of the business, not the drilling side. So we feel like it's   going to be picking up, and we've heard it's going to for a few   months now and it's kind of a staying the same, but we feel like   that it is going to pick up but we don't know for sure.  Luis Hernandez    --   Private Investor  Right. Of course. OK. And then, I just wanted sort of like a   reminder on the greenfield economics. Let's say you started greenfield today, walk me a little bit   through the numbers, you know, payback periods and then returns   on capital. Obviously, estimated an -- and then obviously, on an   average-type number.  Jody Miller    --   President and Chief Executive Officer  Yeah. We've already used six months as kind of the breakeven   as an average. But I will tell you that last year, a couple of   our greenfields were related to the hurricane rebuild and damage,   and those greenfields were virtually profitable the second month   out of the gate because there was a lot of volume that went out   pretty quickly and not a lot of costs associated, right? We just   had a yard, a drop yard, a driver. We were up and going and ship   the units there. So those were a little bit more of an anomaly just because of   the situation. But typically speaking, we say, you know, six   months, and I would say 90% of our colds greenfields in the last   three years have been profitable under a six-month time   period.  Luis Hernandez    --   Private Investor  Right. OK. And after you've reached that payback, what's the   next few year's or next several year's expected return on capital   and turnover? What do you expect from -- on an average way of   those greenfields?  Jody Miller    --   President and Chief Executive Officer  Yeah. We'd like to think we can get over a 20% return early   and it's a line from most of our branches have more of a 50% to   60% EBITDA at a local level after they're established. So they   kind of ramp up from there. That kind of gives you a range.  Luis Hernandez    --   Private Investor  Right. OK. And in terms of growth for this past year, do you   remember how many dots did you have in North America, and how   many dots do you have in the end of the year? I mean at the   beginning and then at the end. For both, I mean, the offices,   yeah.  Chuck Barrantes    --   Chief Financial Officer  Yeah. Well, at the end, in North America, we had a total of 64   dots, which includes Lone Star's two dots. So -- and that   consists of three in Canada. So we added in fiscal year '19 North   America, I believe, four dots in total?  Jody Miller    --   President and Chief Executive Officer  I think it's five.  Chuck Barrantes    --   Chief Financial Officer  Five dots, five dots in total for the fiscal year.  Luis Hernandez    --   Private Investor  OK.  Jody Miller    --   President and Chief Executive Officer  Because a couple of acquisitions were tuck-ins to our current   location.  Luis Hernandez    --   Private Investor  Right. OK. And for this year, do you estimate a similar number   or maybe higher?  Jody Miller    --   President and Chief Executive Officer  Yes. Yes.  Luis Hernandez    --   Private Investor  OK. A similar number?  Jody Miller    --   President and Chief Executive Officer  Yes.  Luis Hernandez    --   Private Investor  OK. Great. All right. I think that's all for me, and   congratulations for a pretty good year.  Jody Miller    --   President and Chief Executive Officer  Thank you. Thank you.  Chuck Barrantes    --   Chief Financial Officer  Thank you.  Operator  There are no other questions at this time. I would now like to   turn the call over to Mr. Jody Miller, president and CEO, for   closing remarks. Please go ahead, Mr. Miller.  Jody Miller    --   President and Chief Executive Officer  Thank you, operator. Thanks for joining us for our call today.   We appreciate your continued interest in General Finance   Corporation, and look forward to speaking to you next quarter.   Thank you.  Operator  [Operator signoff]  Duration: 32 minutes  Call participants:  Chris Wilson    --   Vice President, General Counsel, and Secretary   Jody Miller    --   President and Chief Executive Officer   Chuck Barrantes    --   Chief Financial Officer   Brent Thielman    --   D.A. Davidson -- Analyst   Unidentified speaker   Brian Gagnon    --   Gagnon Securities -- Analyst   Luis Hernandez    --   Private Investor     More GFN analysis   All earnings call transcripts   This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribing      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " General Finance    (NASDAQ: GFN)        Q4 2019 Earnings Call       Sep 11, 2019 ,   11:30 a.m. ET ",
    " Operator ",
    "Welcome to General Finance Corporation's       earnings conference call    for the fourth quarter and fiscal year ended June 30th, 2019.   Hosting the call today from the company's corporate office in   Pasadena, California are Mr. Jody Miller, president and chief   executive officer; and Mr. Charles Barrantes, executive vice   president and chief financial officer.",
    "Today's call is being recorded and will be available for   replay beginning at 2:30 p.m. Eastern. [Operator instructions] It   is now my pleasure to turn the call over to Mr. Chris Wilson,   vice president, general counsel and secretary of General Finance   Corporation.",
    "Please go ahead, Mr. Wilson.",
    " Chris Wilson    --   Vice President, General Counsel, and Secretary ",
    "Thank you, operator. Before we begin today, I would like to   remind you that this conference call may contain certain   forward-looking statements. Such forward-looking statements   include, but are not limited to our views with respect to future   financial and operating results, competitive pressures, increases   in interest rates for our variable-rate indebtedness, our ability   to raise capital or borrow additional funds, the availability of   sufficiently qualified employees to staff our businesses, changes   in the Australian, New Zealand or Canadian dollar relative to the   U.S. dollar, regulatory changes, customer defaults or   insolvencies, litigation, acquisition of businesses that do not   perform as we expect or that are difficult for us to integrate or   control, our ability to secure adequate levels of products to   meet customer demand, our ability to procure adequate supplies   for our manufacturing operations, labor disruptions, adverse   resolution of any contract or disputes with customers, declines   in demand for our products and services from key industries such   as the Australian construction and transportation industries or   the U.S.",
    "construction and oil and gas industries or write-off of all or   in part of our goodwill and intangible assets. These risks and   uncertainties could cause actual outcomes or results to differ   mature from those described in our forward-looking statements. We   believe that the expectations represented by our forward-looking   statements are reasonable, but there can be no assurance that   such expectations will prove to be correct. For more details   regarding these risks, please see the Risk Factors section of our   periodic reports filed with the SEC and posted to our website at   www.generalfinance.com.",
    " 10 stocks we like better than General   Finance     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and General   Finance wasn't one of them! That's right -- they think   these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "These forward-looking statements represent the judgment of the   company at this time, and General Finance Corporation disclaims   any intent or obligation to update the forward-looking   statements. In this conference call, we will also discuss certain   non-U.S. GAAP financial measures such as adjusted EBITDA. A   reconciliation of how we define and arrive at adjusted EBITDA is   in our earnings release, and will be included in our annual   report on Form 10-K.",
    "And now, I turn the call over to Jody Miller, president and   chief executive officer. Jody, please go ahead.",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Thank you, Chris. Good morning, and we appreciate you joining   us today for our fourth-quarter fiscal year 2019 conference call.   I will begin with a brief discussion of our operations, then our   CFO, Chuck Barrantes, will provide our financial overview and our   outlook for fiscal year 2020. Following his remarks, we will open   the call up for questions.",
    "We are extremely proud of our accomplishments in fiscal year   2019, delivering record revenues and adjusted EBITDA driven by   growth across all of our operations. We finished the year with   solid momentum for the fourth quarter, generating year-over-year   improvement across virtually all of our key operational and   financial metrics. In fiscal year 2019, we surpassed our quickly   approaching important milestone in our company history. We now   serve over 50,000 customers from our 100 branches across two   geographic venues.",
    "Our lease fleet is now comprised of nearly 100,000 units with   over 80% of the units being portable storage or ground level   office containers, which offer the most attractive unit level   economics. It was a year of a century mark for us as we also   generated adjusted EBITDA in excess of $100 million, which is a   company record. Our North American leasing operations again   delivered record results and led our growth as our core container   business, Pac-Van, posted 16% organic growth rate year-over-year   in leasing revenues. Our team at Pac-Van continues to do a great   job executing on a number of key initiatives particularly, our   national account program and our recently introduced PV3 Safety   Containers.",
    "At year end, we have on leased nearly 4,000 PV3 Safety   Containers and Royal Wolf premium containers and expect that   number to grow significantly in the fiscal year. We've also   commenced our online ordering capabilities of Pac-Van and are   optimistic about the initiative going forward. With all the   success that we are experiencing in Pac-Van, it comes as no   surprise that we continue to be highly regarded by our customer   base, achieving world-class Net Promoter Score of 84 for the full   year. In addition to organic growth, we remain focused on our   long-term goals of growing Pac-Van's footprint in North America   by geographically expanding our portable storage container   business particularly in the adjacent markets.",
    "During the year, we completed five acquisitions and there are   two new markets to Greenville locations. We continue to serve   over half of the top 100 MSAs in the U.S. and our acquisition   pipeline remains healthy. To put this geographic expansion in   perspective, over the last 10 years, we've completed 32   acquisitions in North America, drilling from a footprint of 26   primary locations to 64 locations today.",
    "Our liquid containment business delivered improved results for   the fiscal year despite the moderation in leasing activity in   Texas. While oil and gas production in both basins generally   remain healthy, we have been impacted by slow activity year over   year. Additionally, there continues to be some lingering pipeline   availability challenges with some of our customers in the   Permian, as well as, customer consolidation. We remain optimistic   about this business as all indicators continue to point to   healthy production activity in both basins for the foreseeable   future.",
    "Our North American manufacturing operations continued to   deliver improved results. Total revenues, including sales of our   North American leasing operations increased by 30% during the   fiscal year and stand-alone adjusted EBITDA increased by over $1   million. This ongoing improvement is due to an increase in demand   in specialty tanks and trailers, as well as, ground level   containers built for Pac-Van. Now turning to our Asia-Pacific   region.",
    "Our Asia-Pacific region delivered a solid performance driven   by a 9% increase in leasing revenues in local currency with an   increased activity across most sectors notably in the   transportation, industrial, construction, and consumer sectors.   This is the 11th out of the last 12 quarters where Royal Wolf has   delivered year-over-year growth in leasing revenues, mainly due   to growth in average units on lease and improved utilization. In   fiscal year 2019, we also saw an increase in overall average   monthly lease rates due to moderate pricing power combined with   an improved product mix. Our Royal Wolf team remains focused on   building upon its leading market position across Australia and   New Zealand through a combination of organic growth and   Greenfield openings, and to the extent there are available,   accretive acquisitions.",
    "During the fiscal year, we strengthened our market presence in   the region with an acquisition of our largest competitor in New   Zealand and one Greenfield opening in Australia. Over the last 10   years, Royal Wolf has completed 12 acquisitions and grown its   footprint in the region from 24 primary locations to 37 today. To   conclude, our hard-working employees continue to execute on our   proven business strategy and their dedication to the company has   led to an outstanding and record-breaking financial performance.   We continue to see both organic and expansion opportunities in   North America, and ability to strengthen our market leadership in   the Asia-Pacific region.",
    "As always, we remain disciplined in our capital allocation. We   ended the year on a high note with our strong performance   positions as well for another year of solid financial results in   fiscal 2020. I'll now turn the call over to Chuck Barrantes for   his financial review and our outlook for the current fiscal   year.",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "Thanks, Jody. We will be filing our annual report on Form 10-K   shortly, at which time this document will be available on both   the SEC's EDGAR filing system and on our website. And I encourage   investors and other interested parties to read it as it contains   a substantial amount of information about our company, some of   which we will discuss today. Now turning to our financial   results.",
    "Our fiscal 2019 results fell within the guidance range. We   provided it in conjunction with the reporting of our   third-quarter results. Not only did we generate record revenues   and adjusted EBITDA for the year, but our fourth-quarter results   marked the 10th consecutive quarter where we have delivered   year-over-year growth in adjusted EBITDA. In addition to reaching   the key milestones that Jody referred to, we also made   significant progress strengthening our balance sheet and   improving our financial flexibility.",
    "We learned our overall cost of financing as we successfully   replaced higher cost of debt in both geographic venues with   lower-cost borrowings on our amended and expanded credit facility   in each region. In addition, our strong financial performance   enabled us to end the year with a net leverage ratio below 4   times, our lowest level in five years. Turning to our   fourth-quarter results. Total revenues were $96.2 million in the   fourth quarter of fiscal '19 compared to $93.8 million for the   fourth quarter of fiscal year '18, an increase of 3%.",
    "Leasing revenues, $59.1 million, an increase of 4% from the   prior-year's quarter and comprised 63% of total manufacturing   revenues for both fourth-quarter periods. Nonmanufacturing sales   revenues were $34.3 million in the quarter, an increase of 2%   over the fourth quarter of the prior year. In our North American   leasing operations, revenues for the fourth quarter totaled $61.1   million, compared with $57.4 million for the year ago period, an   increase of 8%, mainly driven by increases in the construction,   commercial, mining and industrial sectors, and were partially   offset by a decrease in the oil and gas sector. Leasing and sales   revenues increased by 6% to 11% on a year-over-year basis,   respectively.",
    "Revenues in our North American manufacturing facility from   fourth quarter for $4.2 million, which included intercompany   sales of $1.4 million to our North American leasing operations.   This compares to $3.7 million in total sales for the year ago   period, including intercompany sales of $190,000. Our   manufacturing operations saw increased demand for specialty tanks   and other steel-related products, particularly ground level   office container modifications for our North American leasing   operations. In our Asia-Pacific leasing operations, EBIT revenues   for the fourth quarter totaled $31.5 million, compared to $32.9   million for the fourth quarter of fiscal year 2018, a decrease of   4%.",
    "And on a local currency basis, total revenues increased by   approximately 4% and leasing revenues increased by 8%. The   increase in leasing revenues was driven primarily by increases in   the transportation, industrial, education, and retail sectors,   and partially offset by a decrease in the construction sector.   Consolidated adjusted EBITDA was $26.1 million in the fourth   quarter of 2019, compared to $23 million in the prior-year's   quarter, an increase of 13%. And adjusted EBITDA margin as a   percentage of total revenues is 27%, up from 25% in the fourth   quarter of fiscal 2018.",
    "As I mentioned, this was the 10th consecutive quarter of   year-over-year adjusted EBITDA growth. In North America, adjusted   EBITDA for our leasing operations was $19 million in the fourth   quarter, compared to $17.6 million from the year ago quarter, an   increase of 8%. Adjusted EBITDA at Pac-Van was $14.7 million, up   25% over year-over-year and Lone Star adjusted EBITDA was $4.3   million, down from $5.8 million in the prior-year's fourth   quarter. For our manufacturing operations, on a stand-alone   basis, adjusted EBITDA was $634,000 for the quarter, compared to   last year's fourth-quarter adjusted EBITDA of $460,000.",
    "Asia-Pacific's adjusted EBITDA for the quarter was $8.8   million compared to $7.5 million in the year-ago period, an   increase of 17%. On a local currency basis, adjusted EBITDA   increased by 27% from the prior-year's fourth quarter. Interest   expense for the fourth quarter of 2019 was $7.6 million, down   from $9.3 million for the fourth quarter of last year. The   decrease was primarily driven by lower interest expense in the   Asia-Pacific area and the lower average borrowings and a lower   interest rate of 8.1% from fourth quarter of fiscal 2019 versus   10% in the year-ago period, and by a weaker Australian dollar   between the periods.",
    "Net income attributable to common stockholders in the fourth   quarter was $4.3 million, or $0.14 per diluted share, compared to   a net loss of $11.6 million, or $0.44 per share in the year-ago   fourth quarter. Including these results were non-cash charges of   $1.7 million to $11.5 million in fiscal year 2019 and '18,   respectively, for the change in valuation of stand-alone   bifurcated derivatives. Both periods included $892,000 for the   dividends paid on our preferred stock. For fiscal year 2019, we   generated free cash flow before fleet activity of $50.5 million,   up slightly from $50 million in the prior year.",
    "Turning to our balance sheet. At June 30th, the company had a   net leverage ratio of 3.7 times for the trailing 12 months, which   compared very favorably with a net leverage ratio of 4.6 times at   June 30, 2018. Finally, turning to our companywide outlook for   fiscal year 2020. Depending on the condition in the oil and gas   sector in Texas and assuming the Australian dollar averages $0.68   versus the U.S.",
    "dollar, we estimate the consolidated revenue for fiscal year   2020 will be in the range of $370 million to $390 million, and   the consolidated adjusted EBITDA is expected to be in the range   of plus or minus 4% in fiscal year '20 from fiscal year '19. This   outlook does not take into account the effect of any acquisitions   that may occur during fiscal year 2020. This now concludes our   prepared comments, and I would like to turn the call back to the   operator for the question-and-answer session.",
    " Operator ",
    "[Operator instructions] Our first question comes from the line   of Brent Thielman of D.A. Davidson.",
    " Brent Thielman    --   D.A. Davidson -- Analyst ",
    "Thanks, good morning.",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Good morning, Brent.",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "Good morning.",
    " Brent Thielman    --   D.A. Davidson -- Analyst ",
    "Jody or Chuck, I guess in terms of the outlook for F '20,   could you give a little bit more detail kind of what you're   factoring in for Lone Star? You know, I understand that   longer-term outlook is positive, notwithstanding some near-term   headwinds. So just trying to get a sense of what you're kind of   factoring into that that initial view for F'20 for Lone Star.",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Yeah, Brent. Thanks. This is Jody. Sor if you look at our   current quarter run rate, we're probably more in the $15 million,   $16 million range.",
    "So that's why we're a little bit more conservative on outlook   there. I mean all indicators show that it should improve. There's   a lot of wells drilled. And as we've mentioned before, we're   heavier on the production and completion side, so we're   optimistic that things will get more positive, but that's kind of   where our estimates are.",
    "Pac-Van, obviously, doing very well and growing at a nice   pace, and then kind of offset by that Lone Star being more of   today's run rate versus the latter half of last year when things   were a little more positive. So that's kind of how we're looking   at it but cautiously optimistic, it will be better than that.",
    " Brent Thielman    --   D.A. Davidson -- Analyst ",
    "OK. And then I guess on Pac-Van's kind of traditional end   markets, which sectors are you seeing strengthening and, I guess,   similarly, where might you be seeing some softening in, I guess,   in demand within this vertical?",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Yeah. To be honest, we have not seen any negatives. Retail   season appears it's going to be very strong for us. The   construction sector, industrial sectors are still doing very   well, and we're getting nice growth across the board with   commercial still kind of leading the pack.",
    "So I think as product awareness continues to grow and the   economy goes well, we're doing quite well, and don't really see   any softening in any one area or geographically either.",
    " Brent Thielman    --   D.A. Davidson -- Analyst ",
    "OK. I guess my last question. You know, the deleverage ratio   is at 4 times. I guess when you think about the new fiscal year,   where would you ideally like to see that ratio land by year   end?",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "Well, assuming that we do not make significant investment in   acquisitions, I mean, we would anticipate having that leverage   slow down. But we stated publicly before, we actually like our   sweet spot deleverage between -- to be somewhere around 4 times,   4.5 times. So we're a little below, which is good, which shows   the profitability . But also, you know, we think that we can   certainly use whatever free cash flow we have to make -- to even   make investments in acquisitions.",
    " Brent Thielman    --   D.A. Davidson -- Analyst ",
    "OK. Thank you.",
    " Operator ",
    "Our next question comes from the line of Scott Schneeberger of   Oppenheimer.",
    " Unidentified speaker ",
    "Good morning, it's Daniel on for Scott.",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Hey.",
    " Unidentified speaker ",
    "Hey, guys. Can we talk about the pricing environment across   the segment if you can give us an overview how things are looking   now and what the opportunity is going forward?",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "Yes. So on the Pac-Van, on this portable storage side, pricing   is doing very nicely. We're seeing very consistent price   increases like we've seen in the last several quarters with the   ground level or GLOs kind of leading the pack in price increases.   On the Royal Wolf side, very modest price increases but they are   coming up.",
    "And then on the Lone Star side, we're seeing just a little bit   of compression. Actually, the Eagle Ford is up a little bit, but   the Permian is down slightly, and I think that's just a natural   occurrence with the slowdown but nothing too drastic at this   point.",
    " Unidentified speaker ",
    "OK. Thank you for that. On the end markets in Asia-Pacific,   can you talk about what areas -- where you see opportunities over   fiscal '20?",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Yeah. I think, you know, probably our biggest opportunity   there is on the building and construction. That's an area that we   feel like has a lot of opportunity for growth. Some of our   products are becoming more popular in the stackable solutions on   the B and C side.",
    "So I would say that and then just naturally, in Australia and   New Zealand markets, as I mentioned before, everything is moved   by rails. So our freight segment is doing quite well as well, and   then our camps that have been sitting idle for many years, we've   got most of those out or spoken for at this point, which will be   a nice lift for Royal Wolf as well. So pricing-wise, they're   doing nicely not as bigger price increases that we got in North   America but they're still on the rise versus flat.",
    " Unidentified speaker ",
    "Got it. THank you. Final one for me. capex plans for fiscal   '20 and categories?",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "So we're looking at, as far as our planning is concerned,   we're looking at fiscal '20 net capex to be actually comparable   to fiscal year '18. So in fiscal year '19, our net capex is   around $39 million. In fiscal '18, it was at $21 million, and   we're looking at net capex to be around the same levels to fiscal   '18 to fiscal year '20, so $22 million. That's net capex.",
    "The gross capex, obviously, is a little higher. Gross capex   would be $60 million, and we expect it to -- with the sales out   of the fleet tune it down to $22 million. And that comes from   primarily North America, Asia Pacific, we anticipate somewhere   between $1 million, $2 million and North America to make up the   balance in 2022.",
    " Unidentified speaker ",
    "OK. That's very helpful. Thank you so much.",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "Sure.",
    " Operator ",
    "Our next question comes from the line of Brian Gagnon of   Gagnon Securities.",
    " Brian Gagnon    --   Gagnon Securities -- Analyst ",
    "Hello, gentlemen.",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Brian.",
    " Brian Gagnon    --   Gagnon Securities -- Analyst ",
    "Um, the same question but a little bit differently. If you   only have $22 million of net capex and you've got $50-plus   million of free cash flow, do you think you have enough   opportunities to acquire businesses? Or will you expand into more   greenfields? Or will you really try to pay down the most   expensive debt that you have?",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "I'll address the last one first. If we do not have significant   acquisition, we would expect that after we pay our preferred   stock dividends, we'd have somewhere in the vicinity of $20   million, $25 million consolidated to reduce our overall   indebtedness. And then re -- go ahead.",
    " Jody Miller    --   President and Chief Executive Officer ",
    "I was just going to say regarding the acquisition side, you   know, our pipeline remains healthy. We don't see anything   changing. As I mentioned on the call, we had five last year, so   we do feel like there's opportunities there as far as expansion.   We're a little more aggressive with greenfields this past year   just because of some of the hurricane rebuild opportunities, and   we'll continue to expand greenfield.",
    "And again, we prefer adjacent markets but we do feel like   there's a great opportunity to expand in the greenfield side as   well.",
    " Brian Gagnon    --   Gagnon Securities -- Analyst ",
    "OK. Um, all right. The interest expense, you pushed down your   interest rate in Australia to, I guess, 8%, you said versus last   year's 10%?",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "Yeah. For the fourth quarter, yup. Weighted average.",
    " Brian Gagnon    --   Gagnon Securities -- Analyst ",
    "OK. What do you think the weighted averages are for 2020 at   this point?",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "Well, we no longer have the Bison debt, so I would determine   that the weighted average based on the BBSwide plus the margin   should be somewhere in the vicinity of 6% to 7%.",
    " Brian Gagnon    --   Gagnon Securities -- Analyst ",
    "OK. So we're going to get an additional benefit on interest   expense.",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "Yeah. I would say, if expense is consolidated going forward,   it's somewhere in the $7 million to $7.5 million per quarter   range, which is significantly less than $1 million that's been in   the prior quarters.",
    " Brian Gagnon    --   Gagnon Securities -- Analyst ",
    "OK. Terrific. That's all I have for now. Thank you.",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Thanks, Brian.",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "Thanks.",
    " Operator ",
    "[Operator instructions] Our next question comes from the line   of Luis Hernandez, a private investor.",
    " Luis Hernandez    --   Private Investor ",
    "Yes. Hello. Good morning, guys.",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Good morning, Luiz.",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "Good morning.",
    " Luis Hernandez    --   Private Investor ",
    "All right. My first question is related to capital structure.   Have you thought ever -- about doing anything with the   preferreds? I believe in August, they became redeemable. Maybe   I'm wrong, but have you thought about anything in that front?",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "Yeah. Luis, this is Chuck. So yes, we've thought -- actually,   they've been redeemable since May of 2018, I believe so. As you   know, they're classified as equity.",
    "We are looking at that also in context of the senior notes,   which are June and July 2021. Prior to that, we had a few   refinancing, as you know, Luis, in terms of the Bison Capital,   you know, refinancing the Deutsche Bank and also refinancing   Wells Fargo. So that is definitely next on our capital structure   list.",
    " Luis Hernandez    --   Private Investor ",
    "OK. Great. Then did you said $50.5 million in free cash flow?   Is that what you said?",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "$50.5 million was the free cash flow for this fiscal year,   yes.",
    " Luis Hernandez    --   Private Investor ",
    "$50.5 million. All right. OK. Then --",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "And that's after interest payments. So that's after interest   payments before investments and any type of debt reduction.",
    " Luis Hernandez    --   Private Investor ",
    "Right. And then before the preferred dividends?",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "Correct.",
    " Luis Hernandez    --   Private Investor ",
    "Right. Jody did mention on the Lone Star's estimated EBITDA to   be around $15 million to $16 million, right?",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "That is the estimated, so that's kind of the current run   rate.",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Yeah. That's the current run rate, Luis. We're hoping, you   know, that [Inaudible] activity will pick up. And after the   consolidation, kind of work its way out with, you know, a couple   of our larger customers, and the pipelines free up, we're hoping   the completion kind of speeds back up.",
    "But that's our current run rate, yes.",
    " Luis Hernandez    --   Private Investor ",
    "Right. But would you think it's going to be a little higher,   maybe? Is that what you're saying?",
    " Jody Miller    --   President and Chief Executive Officer ",
    "We're cautiously optimistic that it will be higher because we   feel like the -- the well is already drilled, so they only have   so long to put those wells into completion for production of oil.   So -- and that's where we spend most of our time. It's on that   side of the business, not the drilling side. So we feel like it's   going to be picking up, and we've heard it's going to for a few   months now and it's kind of a staying the same, but we feel like   that it is going to pick up but we don't know for sure.",
    " Luis Hernandez    --   Private Investor ",
    "Right. Of course. OK. And then, I just wanted sort of like a   reminder on the greenfield economics.",
    "Let's say you started greenfield today, walk me a little bit   through the numbers, you know, payback periods and then returns   on capital. Obviously, estimated an -- and then obviously, on an   average-type number.",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Yeah. We've already used six months as kind of the breakeven   as an average. But I will tell you that last year, a couple of   our greenfields were related to the hurricane rebuild and damage,   and those greenfields were virtually profitable the second month   out of the gate because there was a lot of volume that went out   pretty quickly and not a lot of costs associated, right? We just   had a yard, a drop yard, a driver. We were up and going and ship   the units there.",
    "So those were a little bit more of an anomaly just because of   the situation. But typically speaking, we say, you know, six   months, and I would say 90% of our colds greenfields in the last   three years have been profitable under a six-month time   period.",
    " Luis Hernandez    --   Private Investor ",
    "Right. OK. And after you've reached that payback, what's the   next few year's or next several year's expected return on capital   and turnover? What do you expect from -- on an average way of   those greenfields?",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Yeah. We'd like to think we can get over a 20% return early   and it's a line from most of our branches have more of a 50% to   60% EBITDA at a local level after they're established. So they   kind of ramp up from there. That kind of gives you a range.",
    " Luis Hernandez    --   Private Investor ",
    "Right. OK. And in terms of growth for this past year, do you   remember how many dots did you have in North America, and how   many dots do you have in the end of the year? I mean at the   beginning and then at the end. For both, I mean, the offices,   yeah.",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "Yeah. Well, at the end, in North America, we had a total of 64   dots, which includes Lone Star's two dots. So -- and that   consists of three in Canada. So we added in fiscal year '19 North   America, I believe, four dots in total?",
    " Jody Miller    --   President and Chief Executive Officer ",
    "I think it's five.",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "Five dots, five dots in total for the fiscal year.",
    " Luis Hernandez    --   Private Investor ",
    "OK.",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Because a couple of acquisitions were tuck-ins to our current   location.",
    " Luis Hernandez    --   Private Investor ",
    "Right. OK. And for this year, do you estimate a similar number   or maybe higher?",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Yes. Yes.",
    " Luis Hernandez    --   Private Investor ",
    "OK. A similar number?",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Yes.",
    " Luis Hernandez    --   Private Investor ",
    "OK. Great. All right. I think that's all for me, and   congratulations for a pretty good year.",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Thank you. Thank you.",
    " Chuck Barrantes    --   Chief Financial Officer ",
    "Thank you.",
    " Operator ",
    "There are no other questions at this time. I would now like to   turn the call over to Mr. Jody Miller, president and CEO, for   closing remarks. Please go ahead, Mr.",
    "Miller.",
    " Jody Miller    --   President and Chief Executive Officer ",
    "Thank you, operator. Thanks for joining us for our call today.   We appreciate your continued interest in General Finance   Corporation, and look forward to speaking to you next quarter.   Thank you.",
    " Operator ",
    "[Operator signoff]",
    " Duration: 32 minutes ",
    " Chris Wilson    --   Vice President, General Counsel, and Secretary ",
    " Jody Miller    --   President and Chief Executive Officer ",
    " Chuck Barrantes    --   Chief Financial Officer ",
    " Brent Thielman    --   D.A. Davidson -- Analyst ",
    " Unidentified speaker ",
    " Brian Gagnon    --   Gagnon Securities -- Analyst ",
    " Luis Hernandez    --   Private Investor ",
    " More GFN analysis ",
    " All earnings call transcripts ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribing      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:23:35"
}