{
  "url": "https://www.nasdaq.com/article/will-baker-hughes-bhge-be-better-off-if-ge-lowers-stake-cm1210414",
  "title": "Will Baker Hughes (BHGE) be Better Off if GE Lowers Stake? - Nasdaq.com",
  "text": [
    "  Baker Hughes, a GE company BHGE  is once again likely to be an independent entity as its majority stock owner, General Electric Company GE  , is planning to further lower its interests in the oilfield service player. In 2017, the struggling oil and gas business of General Electric was merged with Baker Hughes to create a new public firm, wherein General Electric had 62.5% ownership stake. However, the merger was not appreciated by the market as the new entity - Baker Hughes, a GE company - declined more than 55% since the merger deal was signed in October 2016. Eventually, General Electric has been planning to exit the merger so that it could allocate the proceeds to lower its debt burden. In 2018, roughly $4 billion of Baker Hughes' shares were sold by General Electric to bring down its ownership to 50.2%. In its latest release, Baker Hughes announced that the U.S. industrial conglomerate is planning to further lower its stake to less than 50%. In a secondary offering, General Electric will be selling 105 million shares of Baker Hughes' Class A common stock. The transaction also includes a $250-million private deal, wherein Baker Hughes will repurchase its Class B common stock from General Electric. Notably, with the sale of shares of Baker Hughes, General Electric is likely to receive $3 billion in cash. Investors should know that Harry Markopolos, an accounting expert, recently delivered a report that accused General Electric of incorporating cash and earnings of Baker Hughes in its own financial statements to hide losses. Hence, many analysts expect Baker Hughes to be better off if it operates as an independent company.      Stocks to Consider  Presently, Baker Hughes carries a Zacks Rank #3 (Hold). Some better-ranked players in the energy space include National Oilwell Varco Inc. NOV  and World Fuel Services Corporation INT  , both carrying a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   . National Oilwell is likely to see earnings growth of 75% in 2019. World Fuel's earnings beat the Zacks Consensus Estimate in the trailing four quarters, the average positive earnings surprise being 16.4%.  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.      Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.     See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  General Electric Company (GE): Free Stock Analysis Report   National Oilwell Varco, Inc. (NOV): Free Stock Analysis Report   World Fuel Services Corporation (INT): Free Stock Analysis Report   Baker Hughes, a GE company (BHGE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Baker Hughes, a GE company BHGE  is once again likely to be an independent entity as its majority stock owner, General Electric Company GE  , is planning to further lower its interests in the oilfield service player.",
    "In 2017, the struggling oil and gas business of General Electric was merged with Baker Hughes to create a new public firm, wherein General Electric had 62.5% ownership stake. However, the merger was not appreciated by the market as the new entity - Baker Hughes, a GE company - declined more than 55% since the merger deal was signed in October 2016.",
    "Eventually, General Electric has been planning to exit the merger so that it could allocate the proceeds to lower its debt burden. In 2018, roughly $4 billion of Baker Hughes' shares were sold by General Electric to bring down its ownership to 50.2%.",
    "In its latest release, Baker Hughes announced that the U.S. industrial conglomerate is planning to further lower its stake to less than 50%. In a secondary offering, General Electric will be selling 105 million shares of Baker Hughes' Class A common stock. The transaction also includes a $250-million private deal, wherein Baker Hughes will repurchase its Class B common stock from General Electric. Notably, with the sale of shares of Baker Hughes, General Electric is likely to receive $3 billion in cash.",
    "Investors should know that Harry Markopolos, an accounting expert, recently delivered a report that accused General Electric of incorporating cash and earnings of Baker Hughes in its own financial statements to hide losses. Hence, many analysts expect Baker Hughes to be better off if it operates as an independent company.    ",
    " Stocks to Consider ",
    "Presently, Baker Hughes carries a Zacks Rank #3 (Hold).",
    "Some better-ranked players in the energy space include National Oilwell Varco Inc. NOV  and World Fuel Services Corporation INT  , both carrying a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    "National Oilwell is likely to see earnings growth of 75% in 2019.",
    "World Fuel's earnings beat the Zacks Consensus Estimate in the trailing four quarters, the average positive earnings surprise being 16.4%.",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.     ",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.  ",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:56:00"
}