{
  "url": "https://www.nasdaq.com/article/validea-joel-greenblatt-strategy-daily-upgrade-report-9122019-cm1210839",
  "title": "Validea Joel Greenblatt Strategy Daily Upgrade Report - 9/12/2019 - Nasdaq.com",
  "text": [
    "The following are today's upgrades for Validea's Earnings Yield Investor  model based on the published strategy of  Joel Greenblatt  . This value model looks for companies with high return on capital and earnings yields.",
    " INTERPUBLIC GROUP OF COMPANIES INC ( IPG  )  is a mid-cap value stock in the Advertising industry. The rating according to our strategy based on Joel Greenblatt changed from 80% to 90% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    " Company Description:  The Interpublic Group of Companies, Inc. is a global advertising and marketing services company. The Company specializes in consumer advertising, digital marketing, communications planning and media buying, public relations and specialized communications disciplines. It operates in two segments: Integrated Agency Networks (IAN) and Constituency Management Group ( CMG  ). Its agencies offer customized marketing programs for clients that range in scale from  global market  ers to regional and local clients. IAN consists of McCann Worldgroup, FCB, MullenLowe Group, IPG Mediabrands, its digital specialist agencies and its domestic integrated agencies. CMG consists of its specialist marketing services offerings. It has three global networks: McCann Worldgroup, Foote, Cone & Belding and MullenLowe Group, which provide integrated, advertising and marketing solutions for clients. Its global media services companies include UM and Initiative, which operate under the IPG Mediabrands umbrella.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here ",
    " CINER RESOURCES LP ( CINR  )  is a small-cap value stock in the Non-Metallic Mining industry. The rating according to our strategy based on Joel Greenblatt changed from 80% to 90% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    " Company Description:  Ciner Resources LP, through its subsidiary, Ciner Wyoming LLC (Ciner Wyoming), produces soda ash and serves a global market from its facility in the Green River Basin of Wyoming. The Company processes trona ore into soda ash, a raw material in flat glass, container glass, detergents, chemicals, paper and other consumer and industrial products. As of December 31, 2016, its Green River Basin surface operations were situated on approximately 880 acres in Wyoming, and the Company's mining operations included approximately 23,500 acres of leased and licensed subsurface mining area. The Company's mining leases and license are located in two mining beds, designated by the United States Geological Survey as beds 24 and 25, at depths of 800 to 1100 feet, respectively, below the surface. The Company uses a continuous mining technique to mine trona and roof bolt the ceiling simultaneously. The Company's soda ash is shipped by rail or truck from its Green River Basin operations.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here ",
    "Since its inception, Validea's strategy based on Joel Greenblatt has returned 71.36% vs. 137.21% for the S&P 500. For more details on this strategy,  click here ",
    " About Joel Greenblatt  : In his 2005 bestseller The Little Book That Beats The Market, hedge fund manager Joel Greenblatt laid out a stunningly simple way to beat the market using two -- and only two -- fundamental variables. The \"Magic Formula,\" as he called it, produced back-tested returns of 30.8 percent per year from 1988 through 2004, more than doubling the S&P 500's 12.4 percent return during that time. Greenblatt also produced exceptional returns as managing partner at Gotham Capital, a New York City-based hedge fund he founded. The firm averaged a remarkable 40 percent annualized return over more than two decades.",
    " About Validea  : Validea is an  investment research  service that follows the published strategies of investment legends. Validea offers both stock analysis and model portfolios based on gurus who have outperformed the market over the long-term, including Warren Buffett, Benjamin Graham, Peter Lynch and Martin Zweig. For more information about Validea, click here ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 03:50:52"
}