{
  "url": "https://www.nasdaq.com/article/mexico-prepares-for-migration-meeting-as-us-deal-expires-20190905-00838",
  "title": "Mexico prepares for migration meeting as U.S. deal expires - Nasdaq.com",
  "text": [
    "MEXICO CITY, Sept 5 (Reuters) - Mexico is preparing to set out the steps it has taken to curb illegal immigration under a deal struck with U.S. President Donald Trump in June to cut the number of Central American migrants traveling through Mexico to the U.S. border.",
    "Under the accord which the Mexican government has said expires on Thursday, Mexico vowed to curb U.S.-bound migration significantly to avert U.S. tariffs on Mexican exports.",
    "Mexico will provide details on the deal's status on Friday, ahead of a meeting between Mexican and U.S. officials in Washington on Sept. 10, President Andres Manuel Lopez Obrador told a news conference on Thursday.",
    "\"I want to thank Mexico, the Mexican government, their great President of Mexico, for helping us,\" he told reporters on Wednesday. \"They're helping us in a very big way. Far bigger than anybody thought even possible.\"",
    "Acting Homeland Security Secretary Kevin McAleenan said official data on crossings at the U.S. southern border would be released next week.",
    "\"We're looking at a reduction of over 50 percent from May to today,\" he said on Wednesday.",
    "Mexico's government has said it was doing well to meet U.S. demands to slow migration, and has resisted U.S. pressure to become a so-called safe third country.",
    "That designation would force Central American asylum seekers to seek refuge in Mexico, rather than the United States.",
    "Various new measures to discourage migration under Trump, such as sending asylum-seekers to Mexico to wait out lengthy applications for entry to the United States, have been met with legal challenges and backlash.",
    "The head of the asylum division at U.S. Citizenship and Immigration Services, John Lafferty, in July expressed concerns about a new rule aiming to bar many migrants from seeking asylum at the U.S.-Mexican border, saying in a staff email that his department had been given little time to train and prepare. ",
    "A department official said in a statement on Wednesday evening that Lafferty has been reassigned.",
    "In Mexico, migrant advocates blame their government for launching a migration crackdown without doing enough to protect people fleeing poverty and violence in Central America.",
    "Julio Lopez, director of the Nazareth Migrant House in Nuevo Laredo, just over the border from Texas, said officials have done \"nothing\" for the thousands of asylum seekers who are forced to wait out their cases in Mexico's dangerous northern border towns.",
    "The government should recognize \"the error of having used migrants as bargaining chips,\" he said."
  ],
  "published_datetime": "2019-09-05 12:24:00"
}