{
  "url": "https://www.nasdaq.com/article/philippines-inflation-slows-to-near-3yr-low-in-august-20190904-01223",
  "title": "Philippines inflation slows to near 3-yr low in August - Nasdaq.com",
  "text": [
    "MANILA, Sept 5 (Reuters) - Philippine inflation slowed more than expected in August due to base effects and lower food and utility prices, cementing expectations for a third interest rate cut this year.",
    "The consumer price index (CPI)  rose 1.7% in August from a year earlier, the statistics agency said on Thursday, the weakest pace in nearly three years and below the 1.8% forecast in a Reuters poll. ",
    "The data brought year-to-date inflation to 3.0%, which was well within the central bank's 2%-4% target for the year.",
    "Food and non-alcoholic beverages, which make up nearly two-fifths of the overall basket used to calculate inflation, rose at a slower annual pace of 0.6% compared with 1.9% in July.",
    "Price rises for housing, water, electricity, gas, and other fuel also eased to 1.8% from the previous month's 2.2%.",
    "Slowing inflation allowed the central bank to cut rates twice by a total of 50 basis points in May and August to give the economy a lift and buffer it from the fallout from the U.S.-China trade war.",
    "Bangko Sentral ng Pilipinas Governor Benjamin Diokno has flagged a further quarter-point interest rate reduction before the end of 2019 to shore up economic growth, which slipped to its weakest in 17 quarters in April-June. ",
    "\"We expect the governor to deliver on his pledge and cut policy rates by an additional 25 basis points at the 26 September meeting,\" said ING economist Nicholas Mapa.",
    "In a mobile phone text message, Diokno said the latest inflation reading \"is excellent news indeed. This gives us more confidence that average inflation would be in the neighbourhood of 2% in Q3 before it would increase slightly in Q4.\"",
    "BSP raised the rates by a total of 175 basis points last year to rein in inflation, which peaked at a near-decade high of 6.7% in September and October.",
    "Inflation is seen to average 2.6% this year and 2.9% next year, the central bank has said, well within its target of 2%-4% for both years."
  ],
  "published_datetime": "2019-09-04 09:42:00"
}