{
  "url": "https://www.nasdaq.com/article/csiq-vs-fslr-which-stock-should-value-investors-buy-now-cm1210426",
  "title": "CSIQ vs. FSLR: Which Stock Should Value Investors Buy Now? - Nasdaq.com",
  "text": [
    " Investors with an interest in Solar stocks have likely encountered both Canadian Solar (CSIQ) and First Solar (FSLR). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look. Everyone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits. Right now, Canadian Solar is sporting a Zacks Rank of #1 (Strong Buy), while First Solar has a Zacks Rank of #3 (Hold). This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that CSIQ is likely seeing its earnings outlook improve to a greater extent. But this is only part of the picture for value investors. Value investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels. The Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors. CSIQ currently has a forward P/E ratio of 6.52, while FSLR has a forward P/E of 26.32. We also note that CSIQ has a PEG ratio of 0.20. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. FSLR currently has a PEG ratio of 1.13. Another notable valuation metric for CSIQ is its P/B ratio of 0.95. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, FSLR has a P/B of 1.28. Based on these metrics and many more, CSIQ holds a Value grade of A, while FSLR has a Value grade of C. CSIQ sticks out from FSLR in both our Zacks Rank and Style Scores models, so value investors will likely feel that CSIQ is the better option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Canadian Solar Inc. (CSIQ): Free Stock Analysis Report   First Solar, Inc. (FSLR): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors with an interest in Solar stocks have likely encountered both Canadian Solar (CSIQ) and First Solar (FSLR). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look.",
    "Everyone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits.",
    "Right now, Canadian Solar is sporting a Zacks Rank of #1 (Strong Buy), while First Solar has a Zacks Rank of #3 (Hold). This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that CSIQ is likely seeing its earnings outlook improve to a greater extent. But this is only part of the picture for value investors.",
    "Value investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels.",
    "The Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors.",
    "CSIQ currently has a forward P/E ratio of 6.52, while FSLR has a forward P/E of 26.32. We also note that CSIQ has a PEG ratio of 0.20. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. FSLR currently has a PEG ratio of 1.13.",
    "Another notable valuation metric for CSIQ is its P/B ratio of 0.95. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, FSLR has a P/B of 1.28.",
    "Based on these metrics and many more, CSIQ holds a Value grade of A, while FSLR has a Value grade of C.",
    "CSIQ sticks out from FSLR in both our Zacks Rank and Style Scores models, so value investors will likely feel that CSIQ is the better option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:40:21"
}