{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-bcb-bridgewater-bancshares-customers-bancorp-first-bancorp-and-great-southern-bancorp-cm1210359",
  "title": "The Zacks Analyst Blog Highlights: BCB, Bridgewater Bancshares, Customers Bancorp, First Bancorp and Great Southern Bancorp - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 11, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: BCB Bancorp, Inc. BCBP  , Bridgewater Bancshares, Inc. BWB  , Customers Bancorp, Inc. CUBI  , First Bancorp FBNC  and Great Southern Bancorp, Inc. GSBC  .  Here are highlights from Monday's Analyst Blog:    5 Top Bank Stocks to Buy as Treasury Yields Climb     North   Bond yields rose as investors looked beyond discouraging data from China and focused on trade talk optimism and stimulus prospects in the struggling Eurozone. Investors have thus exited bond proxies, including utilities, real estate, telecom and consumer staples. Meanwhile, banks rallied on expectations to benefit from a rise in benchmark bond yield.  Bank Stocks in Broad Rally  Bank stocks, recently, scaled northward mostly on a jump in longer-term Treasury yields. While the broader Financial Select Sector ETF (XLF) increased 1.5% in the last trading session, the SPDR S&P Bank ETF (KBE) climbed 3%. Notably, shares of big banks, including Bank of America, Citigroup, Wells Fargo, J.P. Morgan Chase, KeyCorp and Regions Financial, went up more than 2%. Meanwhile, the yield on the 10-year Treasury bond increased 8 basis points to 1.632%, its highest level since Aug 13. At the same time, the yield on the 30-year Treasury note advanced 8.8 basis points to 2.109%, its highest level since Aug 13. Needless to say, an uptick in long-term yields boosts banks' profit margin as it increases the spread between what banks earn by funding longer-term assets, such as loans, and shorter-term liabilities.  Why Treasury Yields Are Rising  Treasuries are under immense pressure, pushing yields up as investors shrugged off weak Chinese economic data and focused on gradual de-escalation of trade war between Washington and Beijing, and potential stimulus measures ahead of this week's European Central Bank (ECB) meeting. Thanks to the trade war, China's global exports dropped 3% to $214.8 billion in August compared to a year ago while imports increased 1.7% to $180 billion. But, imports remained down 5.6% for the first eight months of 2019 compared to a year ago and exports were off 1%. Nonetheless, progress in U.S.-China trade talks eased investors' concerns. Last week, China made a peace proposal over the phone and has agreed to purchase U.S. agricultural commodities. This report follows the Trump administration's move to postpone tariffs on Chinese products on Sep 1. Trump's 10% tariffs on $300 billion of Chinese imports might go into effect on Dec 15, possibly a move to buttress the holiday shopping season. Trump claimed that \"we are doing this for Christmas season, just in case some of the tariffs would have an impact on U.S. customers. Just in case they might have an impact on people, what we've done is we've delayed it so that they won't be relevant to the Christmas shopping season.\" Meanwhile, ECB President Mario Draghi is set to release an array of stimulus to shore up economic growth. Primary among them will be interest rate cut that widens the difference between borrowing cost in the Eurozone and other parts of the world. What's more, Draghi before handing over the reins of the central bank to Christine Lagarde is widely expected to initiate a large QE program of asset purchases of up to 40 billion euro per month for the next year.  5 Best Bank Stocks to Buy Now  We have, thus, selected five solid bank stocks that are poised to gain from rise in bond yields. These stocks boast a Zacks Rank #1 (Strong Buy) or 2 (Buy).  BCB Bancorp, Inc.  operates as a bank holding company for BCB Community Bank, a state-chartered commercial bank that provides banking products and services to businesses and individuals in the United States. The company has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has risen 1.7% over the past 60 days. The company's expected earnings growth rate for the current year is 17.8%, more than the Banks - Northeast  industry's projected rally of 7%.  Bridgewater Bancshares, Inc.  operates as the bank holding company for Bridgewater Bank that provides banking products and services to commercial real estate investors, small business entrepreneurs, and high-net-worth individuals in the United States. The company has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has risen 4% over the past 60 days. The company's expected earnings growth rate for the current year is 13.2%, more than the Banks - Northeast industry's estimated rally of 7%.  Customers Bancorp, Inc.  operates as the bank holding company for Customers Bank that provides financial products and services to small and middle market businesses, not-for-profits, and consumers. The company has a Zacks Rank #1. The Zacks Consensus Estimate for its current-year earnings has moved up 2.1% over the past 90 days. The company's expected earnings growth rate for the current quarter is 17.7%, more than the Banks - Southeast  industry's expected rally of 6.6%. You can see  the complete list of today's Zacks #1 Rank stocks   here   .  First Bancorp  operates as the bank holding company for First Bank that provides banking products and services for individuals and small to medium-sized businesses, primarily in North Carolina and northeastern South Carolina. The company has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has moved 2.3% north over the past 60 days. The company's expected earnings growth rate for the current quarter is 8.1%, more than the Banks - Southeast industry's projected rally of 6.6%.  Great Southern Bancorp, Inc.  operates as a bank holding company for Great Southern Bank that offers a range of financial services in the United States. The company has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has risen 5.9% over the past 60 days. The company's expected earnings growth rate for the current year is 2.8%, more than the Financial - Savings and Loan  industry's projected rally of 2.5%.  More Stock News: This Is Bigger than the iPhone!  It could become the mother of all technological revolutions. Apple sold a mere 1 billion iPhones in 10 years but a new breakthrough is expected to generate more than 27 billion devices in just 3 years, creating a $1.7 trillion market. Zacks has just released a Special Report that spotlights this fast-emerging phenomenon and 6 tickers for taking advantage of it. If you don't buy now, you may kick yourself in 2020.   Click here for the 6 trades >>   Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  First Bancorp (FBNC): Free Stock Analysis Report   Customers Bancorp, Inc (CUBI): Free Stock Analysis Report   Great Southern Bancorp, Inc. (GSBC): Free Stock Analysis Report   Bridgewater Bancshares, Inc. (BWB): Free Stock Analysis Report   BCB Bancorp, Inc. (NJ) (BCBP): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 11, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: BCB Bancorp, Inc. BCBP  , Bridgewater Bancshares, Inc. BWB  , Customers Bancorp, Inc. CUBI  , First Bancorp FBNC  and Great Southern Bancorp, Inc. GSBC  .",
    " Here are highlights from Monday's Analyst Blog: ",
    "  5 Top Bank Stocks to Buy as Treasury Yields Climb     North  ",
    "Bond yields rose as investors looked beyond discouraging data from China and focused on trade talk optimism and stimulus prospects in the struggling Eurozone. Investors have thus exited bond proxies, including utilities, real estate, telecom and consumer staples. Meanwhile, banks rallied on expectations to benefit from a rise in benchmark bond yield.",
    " Bank Stocks in Broad Rally ",
    "Bank stocks, recently, scaled northward mostly on a jump in longer-term Treasury yields. While the broader Financial Select Sector ETF (XLF) increased 1.5% in the last trading session, the SPDR S&P Bank ETF (KBE) climbed 3%. Notably, shares of big banks, including Bank of America, Citigroup, Wells Fargo, J.P. Morgan Chase, KeyCorp and Regions Financial, went up more than 2%.",
    "Meanwhile, the yield on the 10-year Treasury bond increased 8 basis points to 1.632%, its highest level since Aug 13. At the same time, the yield on the 30-year Treasury note advanced 8.8 basis points to 2.109%, its highest level since Aug 13. Needless to say, an uptick in long-term yields boosts banks' profit margin as it increases the spread between what banks earn by funding longer-term assets, such as loans, and shorter-term liabilities.",
    " Why Treasury Yields Are Rising ",
    "Treasuries are under immense pressure, pushing yields up as investors shrugged off weak Chinese economic data and focused on gradual de-escalation of trade war between Washington and Beijing, and potential stimulus measures ahead of this week's European Central Bank (ECB) meeting.",
    "Thanks to the trade war, China's global exports dropped 3% to $214.8 billion in August compared to a year ago while imports increased 1.7% to $180 billion. But, imports remained down 5.6% for the first eight months of 2019 compared to a year ago and exports were off 1%.",
    "Nonetheless, progress in U.S.-China trade talks eased investors' concerns. Last week, China made a peace proposal over the phone and has agreed to purchase U.S. agricultural commodities. This report follows the Trump administration's move to postpone tariffs on Chinese products on Sep 1.",
    "Trump's 10% tariffs on $300 billion of Chinese imports might go into effect on Dec 15, possibly a move to buttress the holiday shopping season. Trump claimed that \"we are doing this for Christmas season, just in case some of the tariffs would have an impact on U.S. customers. Just in case they might have an impact on people, what we've done is we've delayed it so that they won't be relevant to the Christmas shopping season.\"",
    "Meanwhile, ECB President Mario Draghi is set to release an array of stimulus to shore up economic growth. Primary among them will be interest rate cut that widens the difference between borrowing cost in the Eurozone and other parts of the world. What's more, Draghi before handing over the reins of the central bank to Christine Lagarde is widely expected to initiate a large QE program of asset purchases of up to 40 billion euro per month for the next year.",
    " 5 Best Bank Stocks to Buy Now ",
    "We have, thus, selected five solid bank stocks that are poised to gain from rise in bond yields. These stocks boast a Zacks Rank #1 (Strong Buy) or 2 (Buy).",
    " BCB Bancorp, Inc.  operates as a bank holding company for BCB Community Bank, a state-chartered commercial bank that provides banking products and services to businesses and individuals in the United States. The company has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has risen 1.7% over the past 60 days. The company's expected earnings growth rate for the current year is 17.8%, more than the Banks - Northeast  industry's projected rally of 7%.",
    " Bridgewater Bancshares, Inc.  operates as the bank holding company for Bridgewater Bank that provides banking products and services to commercial real estate investors, small business entrepreneurs, and high-net-worth individuals in the United States. The company has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has risen 4% over the past 60 days. The company's expected earnings growth rate for the current year is 13.2%, more than the Banks - Northeast industry's estimated rally of 7%.",
    " Customers Bancorp, Inc.  operates as the bank holding company for Customers Bank that provides financial products and services to small and middle market businesses, not-for-profits, and consumers. The company has a Zacks Rank #1. The Zacks Consensus Estimate for its current-year earnings has moved up 2.1% over the past 90 days. The company's expected earnings growth rate for the current quarter is 17.7%, more than the Banks - Southeast  industry's expected rally of 6.6%. You can see  the complete list of today's Zacks #1 Rank stocks   here   .",
    " First Bancorp  operates as the bank holding company for First Bank that provides banking products and services for individuals and small to medium-sized businesses, primarily in North Carolina and northeastern South Carolina. The company has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has moved 2.3% north over the past 60 days. The company's expected earnings growth rate for the current quarter is 8.1%, more than the Banks - Southeast industry's projected rally of 6.6%.",
    " Great Southern Bancorp, Inc.  operates as a bank holding company for Great Southern Bank that offers a range of financial services in the United States. The company has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has risen 5.9% over the past 60 days. The company's expected earnings growth rate for the current year is 2.8%, more than the Financial - Savings and Loan  industry's projected rally of 2.5%.",
    " More Stock News: This Is Bigger than the iPhone! ",
    "It could become the mother of all technological revolutions. Apple sold a mere 1 billion iPhones in 10 years but a new breakthrough is expected to generate more than 27 billion devices in just 3 years, creating a $1.7 trillion market.",
    "Zacks has just released a Special Report that spotlights this fast-emerging phenomenon and 6 tickers for taking advantage of it. If you don't buy now, you may kick yourself in 2020.",
    "  Click here for the 6 trades >>  ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:08:00"
}