{
  "url": "https://www.nasdaq.com/article/buy-5-top-oil-stocks-ahead-of-crucial-opec-allies-meeting-cm1210466",
  "title": "Buy 5 Top Oil Stocks Ahead of Crucial OPEC & Allies Meeting - Nasdaq.com",
  "text": [
    " On Sep 12, the Organization of the Petroleum Exporting Countries (OPEC) and its allies will meet in Abu Dhabi to assess production levels, following significant surge in U.S. oil exports. Crude  oil prices  are witnessing a rally since the beginning of September backed by Saudi Arabia's commitment to cut production and Iraq's decision to follow suit. Conservative demand estimate and overblown global recessionary concerns also boosted oil prices.  makeArticleAd(); Crude Oil Prices Rally    Late in the evening on Sep 10, the American Petroleum Institute (API) reported that U.S. crude inventories plunged by 7.2 million barrels in the week ended Sep 6 to 421.9 million. Likewise, gasoline stocks fell by 4.5 million barrels.    Following the news, on Sep 11, U.S. benchmark of crude oil price, the West Texas Intermediate (WTI) futures increased 54 cents or 0.9% to $57.94 a barrel. Similarly, the global oil benchmark, the Brent Crude futures rose 51 cents or 0.6% to $62.89 a barrel. Both  crude oil prices  were the highest since Jul 31.   Crucial OPEC Meeting    On Sep 12, the OPEC and its allies will meet in Abu Dhabi to take a decision on oil production level as U.S. production is approaching 12.4 million barrels per day. U.S. oil production touched 12,123,000 barrels of oil per day (BOPD). It declined by 33,000 BOPD in June and is expected to decline more in July. However, these declines in oil production were mainly due to natural calamities.    The glut in global oil supply is creating downward pressure on oil prices. The 11-member OPEC led by Saudi Arabia and 10 allies led by Russia will discuss possible steps to restore and stabilize oil prices.    Moreover, at his speech at the World Energy Congress in Abu Dhabi, OPEC Secretary-General Mohammad Barkindo said that the organization's previous estimate of oil demand for 2019 is likely to turn out conservative since fears of an immediate global recession are overblown.    A fresh round of trade negotiation between the United States and China will start from Oct 1. Additionally, several governments and central banks have either injected stimulus or are likely to do so this month.   Saudi Arabia Confirms Production Cut    On Sep 9, the new Saudi energy minister, Prince Abdulaziz bin Salman, who recently replaced Khalid al-Falih, reiterated the Middle-East oil behemoth's pledge to abide by a global deal to cut oil production by 1.2 million barrels per day.    Notably, OPEC's oil supply increased in August for the first time this year as higher level of production from Iraq and Nigeria outpaced output restraint by Saudi Arabia and shrinkage of oil export from Iran due to U.S. sanctions.    Meanwhile, on Sep 10, Thamer Ghadhban, oil minister of Iraq said that the second-largest oil producer of OPEC will comply with the cartel's production cuts from this month after months of overproduction. In August, Iraq reported its highest oil production at 4.6 million barrels per day.   Our Top Picks    At this stage, investment in stocks engaged in exploration, production, refining and marketing of oil will be lucrative. We have narrowed down our search to five stocks with a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .    The chart below shows price performance of our five picks in the past three months.     CrossAmerica Partners LP CAPL  engages in the wholesale distribution of motor fuels, and ownership and leasing of real estate used in the retail distribution of motor fuels in the United States. It operates in two segments, Wholesale and Retail. The company has an expected earnings growth rate of 545.5% for the current year. The Zacks Consensus Estimate for the current year has improved 4.4% over the past 60 days.   Pembina Pipeline Corp. PBA  provides transportation and midstream services for the energy industry in North America. It operates through three divisions: Pipelines, Facilities, and Marketing & New Ventures. The company has an expected earnings growth rate of 14.1% for the current year. The Zacks Consensus Estimate for the current year has improved 19.5% over the past 60 days.   BP Midstream Partners LP BPMP  is a master limited partnership. It owns, acquires, operates and develops pipelines and other midstream assets. BP Midstream provides crude oil, natural gas and refined products. The company has an expected earnings growth rate of 13.4% for the current year. The Zacks Consensus Estimate for the current year has improved 3.6% over the past 60 days.   Crestwood Equity Partners LP CEQP  provides infrastructure solutions to liquids-rich natural gas and crude oil shale plays in the United States. It operates through three segments: Gathering and Processing, Storage and Transportation and Marketing, Supply and Logistics.  The company has an expected earnings growth rate of 1,876.2% for the current year. The Zacks Consensus Estimate for the current year has improved 510.3% over the past 60 days.   Delek Logistics Partners LP DKL  owns and operates logistics and marketing assets for crude oil, and intermediate and refined products in the United States. It operates in two segments, Pipelines and Transportation, and Wholesale Marketing and Terminalling.  The company has an expected earnings growth rate of 2.6% for the current year. The Zacks Consensus Estimate for the current year has improved 4.1% over the past 60 days.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Delek Logistics Partners, L.P. (DKL): Free Stock Analysis Report   Crestwood Equity Partners LP (CEQP): Free Stock Analysis Report   CrossAmerica Partners LP (CAPL): Free Stock Analysis Report   Pembina Pipeline Corp. (PBA): Free Stock Analysis Report   BP Midstream Partners LP (BPMP): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "On Sep 12, the Organization of the Petroleum Exporting Countries (OPEC) and its allies will meet in Abu Dhabi to assess production levels, following significant surge in U.S. oil exports. Crude  oil prices  are witnessing a rally since the beginning of September backed by Saudi Arabia's commitment to cut production and Iraq's decision to follow suit. Conservative demand estimate and overblown global recessionary concerns also boosted oil prices.  makeArticleAd(); Crude Oil Prices Rally    Late in the evening on Sep 10, the American Petroleum Institute (API) reported that U.S. crude inventories plunged by 7.2 million barrels in the week ended Sep 6 to 421.9 million. Likewise, gasoline stocks fell by 4.5 million barrels.    Following the news, on Sep 11, U.S. benchmark of crude oil price, the West Texas Intermediate (WTI) futures increased 54 cents or 0.9% to $57.94 a barrel. Similarly, the global oil benchmark, the Brent Crude futures rose 51 cents or 0.6% to $62.89 a barrel. Both  crude oil prices  were the highest since Jul 31.   Crucial OPEC Meeting    On Sep 12, the OPEC and its allies will meet in Abu Dhabi to take a decision on oil production level as U.S. production is approaching 12.4 million barrels per day. U.S. oil production touched 12,123,000 barrels of oil per day (BOPD). It declined by 33,000 BOPD in June and is expected to decline more in July. However, these declines in oil production were mainly due to natural calamities.    The glut in global oil supply is creating downward pressure on oil prices. The 11-member OPEC led by Saudi Arabia and 10 allies led by Russia will discuss possible steps to restore and stabilize oil prices.    Moreover, at his speech at the World Energy Congress in Abu Dhabi, OPEC Secretary-General Mohammad Barkindo said that the organization's previous estimate of oil demand for 2019 is likely to turn out conservative since fears of an immediate global recession are overblown.    A fresh round of trade negotiation between the United States and China will start from Oct 1. Additionally, several governments and central banks have either injected stimulus or are likely to do so this month.   Saudi Arabia Confirms Production Cut    On Sep 9, the new Saudi energy minister, Prince Abdulaziz bin Salman, who recently replaced Khalid al-Falih, reiterated the Middle-East oil behemoth's pledge to abide by a global deal to cut oil production by 1.2 million barrels per day.    Notably, OPEC's oil supply increased in August for the first time this year as higher level of production from Iraq and Nigeria outpaced output restraint by Saudi Arabia and shrinkage of oil export from Iran due to U.S. sanctions.    Meanwhile, on Sep 10, Thamer Ghadhban, oil minister of Iraq said that the second-largest oil producer of OPEC will comply with the cartel's production cuts from this month after months of overproduction. In August, Iraq reported its highest oil production at 4.6 million barrels per day.   Our Top Picks    At this stage, investment in stocks engaged in exploration, production, refining and marketing of oil will be lucrative. We have narrowed down our search to five stocks with a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .    The chart below shows price performance of our five picks in the past three months.",
    " CrossAmerica Partners LP CAPL  engages in the wholesale distribution of motor fuels, and ownership and leasing of real estate used in the retail distribution of motor fuels in the United States. It operates in two segments, Wholesale and Retail. The company has an expected earnings growth rate of 545.5% for the current year. The Zacks Consensus Estimate for the current year has improved 4.4% over the past 60 days.   Pembina Pipeline Corp. PBA  provides transportation and midstream services for the energy industry in North America. It operates through three divisions: Pipelines, Facilities, and Marketing & New Ventures. The company has an expected earnings growth rate of 14.1% for the current year. The Zacks Consensus Estimate for the current year has improved 19.5% over the past 60 days.   BP Midstream Partners LP BPMP  is a master limited partnership. It owns, acquires, operates and develops pipelines and other midstream assets. BP Midstream provides crude oil, natural gas and refined products. The company has an expected earnings growth rate of 13.4% for the current year. The Zacks Consensus Estimate for the current year has improved 3.6% over the past 60 days.   Crestwood Equity Partners LP CEQP  provides infrastructure solutions to liquids-rich natural gas and crude oil shale plays in the United States. It operates through three segments: Gathering and Processing, Storage and Transportation and Marketing, Supply and Logistics.  The company has an expected earnings growth rate of 1,876.2% for the current year. The Zacks Consensus Estimate for the current year has improved 510.3% over the past 60 days.   Delek Logistics Partners LP DKL  owns and operates logistics and marketing assets for crude oil, and intermediate and refined products in the United States. It operates in two segments, Pipelines and Transportation, and Wholesale Marketing and Terminalling.  The company has an expected earnings growth rate of 2.6% for the current year. The Zacks Consensus Estimate for the current year has improved 4.1% over the past 60 days.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:16:00"
}