{
  "url": "https://www.nasdaq.com/article/is-akamai-technologies-a-buy-cm1206895",
  "title": "Is Akamai Technologies a Buy? - Nasdaq.com",
  "text": [
    "Content delivery specialist Akamai Networks (NASDAQ: AKAM) is on a roll at the moment. The stock has gained 46% over the last 52 weeks and is trading near multiyear highs. Apart from a speculative spike in the dot-com boom at the turn of the millennium, we're looking at all-time record prices here.",
    "Is Akamai worth buying at these elevated prices, or is it time to back away from an overheated stock? Let's have a look.",
    "Image source: Getty Images.",
    "There's a simple truth behind Akamai's surging stock prices: Business is booming.",
    "Akamai's trailing revenues have grown 50% larger in five years. Free cash flow rose 72% over the same period. Adjusted earnings took a dip in 2017 and early 2018, then mounted a strong comeback. That metric increased by 37% in five years, including a 64% boost over the last year alone.",
    "During the same five-year time span, Akamai's valuation ratios have bounced around in a relatively steady range. The price-to-earnings ratio now sits at 33.4, just 5% below where it was in the summer of 2014. The stock is also trading at 25 times free cash flow, 23% below the value five years ago and fairly consistent with the long-term trend.",
    "In recent earnings calls , Akamai's management pinned the earnings improvements on strong sales of its security services . The media and carrier segment, which consists of Akamai's delivery platforms for audio and video content, posted 4% year-over-year growth in the recently reported second quarter, while security sales surged 32% higher.",
    "Akamai also reaped huge rewards from the Trump administration's tax reform in 2017. The company's effective tax rate had been hovering near the 30% line for half a decade when the corporate tax rules were overhauled The tax rate has been sitting near 14% since then, and Akamai's management expects it to stay below 20% for the long haul.",
    "Data security is a hot sector right now and Akamai is carving out a valuable niche within that space as a leading provider of cloud security tools. That effort should keep revenues and profits rising for several years. When the security trend cools down, we'll see Akamai moving forward at long-term growth rates closer to the more mature content delivery division's current velocity.",
    "That's why investors aren't paying a growth-stock premium for Akamai's shares here. The high-octane epoch of the company's business prospects looks very exciting in the short term but less interesting from a longer perspective.",
    "Furthermore, Akamai's tax-based advantages could come to an abrupt end if the next election cycle results in a left-leaning administration that sets out to reverse Trump's corporate tax cuts in a hurry. My crystal ball is in for repairs, so I can't say for sure that this will happen, but Akamai is exposed to significant tax risk.",
    "I thought Akamai looked overpriced and speculative a year ago , and the stock has only raced higher since then. This stock could suit a certain type of investor betting on the security boom lasting a bit longer. That's fine, as long as you realize that the stock could come tumbling back down for reasons as varied as a calmer network security sector or a certain outcome in the 2020 elections. I'm not a buyer at this point, despite Akamai's good-looking financial data trends.",
    "10 stocks we like better than Akamai Technologies\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Akamai Technologies wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Anders Bylund has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:31:00"
}