{
  "url": "https://www.nasdaq.com/article/is-nvda-stocks-growth-story-still-intact-cm1207264",
  "title": "Is NVDA Stock’s Growth Story Still Intact? - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "The past five months have been bumpy for Nvidia (NASDAQ: NVDA ). NVDA stock went from trading above $190 at the start of April to less than $135 in just two months and today trades at just under $165.",
    "The turbulent ride has been the result of several factors converging at once - trade war worries, concerns about the semiconductor sector in general and a few quarters with tough comparisons due to last year's cryptocurrency implosion. However, those factors could start to ease up, leaving Nvidia stock to run upward for the remainder of the year. ",
    "For almost every tech stock on the market, the trade war is a factor. For Nvidia, which has significant exposure in China, the ups and downs of President Trump's rhetoric with Beijing have added even more near-term uncertainty for investors.",
    "Early last week, news that Chinese officials are \"upbeat\" about the September trade talks took Nvidia stock nearly 4% higher as investors started to feel more positive about a potential end to the trade war.",
    "However, just days later news of a fresh round of tariffs on Chinese goods suggested that a resolution before the end of the year looks unlikely. And NVDA has fallen 3% since.",
    "The trade war has taken the tech sector on a roller coaster ride this year, and will likely continue to do so until the two countries come to some sort of agreement. That means if you do decide to jump on board with Nvidia stock (or any semiconductor name, really) you have to be ready for some ups and downs in the near term.",
    "Trade war aside, the other big question that NVDA stock investors have to answer is whether or not the firm has done enough to cement its place in the semiconductor industry and create a long growth runway for the future. ",
    "Part of the reason there is so much uncertainty surrounding the credibility of a NVDA stock rally is the fact that the firm has yet to prove its stable position in high-growth tech sectors. Semiconductors have long been considered a cyclical sector, but with the increased demand across different tech centers that could change - if NVDA stakes out its spot.",
    "Nvidia's GPUs have been a staple in the video game industry, which has been central to NVDA's growth story thus far. However as the gaming market matured investors began to question where the firm can go from here.",
    "NVDA management says data centers are the next big move for the company's graphics chips. As artificial intelligence becomes a larger part of everyday life, Nvidia says its graphics chips will be required in the data centers where AI is developed, which offers a growth catalyst in a much younger industry.",
    "That's true, but it's worth noting that although Nvidia's GPU's are certainly in the running to be a superpower in the AI world, they're not the only option. Competitors like Advanced Micro Devices (NASDAQ: AMD ) and Intel (NASDAQ: INTC ) are also looking to become leaders in the AI space, so NVDA's place at the table is far from being guaranteed.",
    "Another big growth catalyst for NVDA stock could be autonomous driving. Nvidia was a first-mover in self-driving technology, and that has its advantages. The company's Drive PX platform already has over 370 partners using it to research and develop autonomous driving technology. That could be a huge leg up for NVDA when the tech gains mainstream traction because the firm will already be a major supplier. ",
    "Again, it's worth pointing out this future growth potential, but it's far from being a concrete path to success. Right now autonomous driving makes up only a small fraction of the firm's top line and that's unlikely to change anytime soon. While self-driving vehicles are at the top of everyone's minds right now, mainstream adoption of that kind of technology is still a long way off.",
    "The next step for Nvidia stock investors is the firm's third quarter results. Most are expecting the second half of 2019 to be NVDA stock's return to glory as the comparisons are due to become markedly easier. There are also some catalysts on the horizon during the second half of the year as Nintendo products powered by Nvidia components gain momentum and Microsoft (NASDAQ: MSFT ) starts including NVDA's technology into the PC-version of Minecraft , the best selling video game in history. ",
    "Right now it's hard to make an accurate prediction about the direction of Nvidia stock, in large part due to the unpredictability of the U.S./China trade war. However, if you're looking long term, you should be making your decision based on whether you believe that NVDA will have a seat at the AI table. ",
    "The gaming side of things is a near-term driver, but long term, a foothold in Artificial Intelligence is key.",
    "Personally, I think NVDA will be able to elbow its way into the AI space and that its claim in the autonomous driving industry is solid. However, the benefits from either of those is overshadowed by uncertainty in the second half of 2019. Nvidia stock is trading at 31 times its forecasted earnings - in my opinion that's simply too expensive for the risk you'd be taking on. I'll be waiting it out on the sidelines for another trade-war related miss before I consider taking a position. ",
    "As of this writing, Laura Hoy was long INTC.",
    "The post Is NVDA Stock's Growth Story Still Intact? appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 06:35:46"
}