{
  "url": "https://www.nasdaq.com/article/can-cbl-recover-from-the-retail-apocalypse-cm1207396",
  "title": "Can CBL Recover From the Retail Apocalypse? - Nasdaq.com",
  "text": [
    "  The \"retail apocalypse\" is a phenomenon    whereby thousands of brick-and-mortar retail stores have closed   and many national retail chains have gone bankrupt. The cause: a   deadly cocktail of debt and declining sales due to competition   from e-commerce. It has continued with a vengeance in 2019. The hardest-hit segment of retail has been the American mall.   Mall operator   CBL & Associates Properties    (NYSE: CBL) has acutely felt this pain, and its stock price   reflects this. The stock is down over 90% from its highs a few   years ago due to fears that CBL will not be able to survive the   current onslaught. Are these fears well founded?makeArticleAd();          CBL    data by   YCharts  How CBL has been affected by the retail apocalypse CBL is a   real estate investment trust (REIT)    that owns shopping malls and leases out space to retail tenants.   The company's focus has been regional malls, those that serve as   the primary shopping center in a small city or town. The company doesn't operate in Los Angeles or Miami, where   luxury shopping malls still generate healthy traffic and sales.   It operates in markets like Chattanooga, Tennessee, and Laredo,   Texas, where the surrounding population is not growing as rapidly   and has less disposable income. A shopping center is only as strong as its tenants, and   CBL has had exposure to many of the large   department stores and apparel chains    that have been hit the hardest. In 2013, the company reported   that it had exposure to 63   Sears    stores, 43   Macy's    stores, and 69   JCPenney     stores, among others. Not only have these department stores   had to close many of their locations, but they were particularly   quick to do so in regional malls managed by CBL, due to their   relatively unfavorable demographics and sales per square   foot. CBL saw its tenant occupancy rate decline as stores closed   faster than the company could release the space. Because shoppers   do not want to visit a partially vacant mall, CBL has been under   pressure to quickly find new tenants, which has led it to lower   rental rates, putting pressure on mall profitability. Additionally, CBL has had to invest in redeveloping vacant   anchor spaces into new retail boxes for new tenants. For example,   it has transformed former Sears stores into movie theaters, gyms,   and grocery stores. But these transformations haven't come cheap.   The company projected it would spend $11 million to redevelop   just one JCPenney into three spaces for an H&M, an   Outback Steakhouse    , and a   Planet Fitness    .   Image source: Getty Images.  CBL's balance sheet The retail downturn has left CBL strapped for cash as it loses   tenants and must pony up more cash to redevelop its malls. The   company has had to borrow money to execute on its turnaround,   which has also put pressure on its balance sheet.  According to the company's most recent financial   report, in Q2 2019    , it has $4.4 billion in total debt. Its 2018   EBITDA    was $626 million, which implies a leverage ratio (debt to EBITDA)   of greater than seven times. That level of leverage is   questionable business practice in most investment circles, and it   is leading many investors to wonder if CBL will be able to pay   back its debts. To help alleviate its debt, CBL has been selling assets. So   far in 2019, the company has sold $120 million in real estate,   including a community center, an office building, and a hotel.   Last year, the company sold $100 million worth of assets. These   efforts are good to note, but selling a couple hundred million   worth of real estate won't wipe out the $4.4 billion debt burden   anytime soon. Recent financial performance is still negative Hopefully, the worst of the retail apocalypse is in the   rearview mirror, but even if that is true, CBL is still showing   deteriorating financial performance. In the company's Q2 2019 financial report, it noted the   following:  Portfolio same-center     net operating income      declined 5.7% year over year. Portfolio occupancy declined 0.9% year over year. Gross rent per square foot at stabilized malls declined     3.8% year over year. Sales per square foot at stabilized malls increased 0.8%     year over year.  Of this barrage of data, the only positive point was an   increase in sales per square foot. Despite this increase, the   company saw a decline in the rents it charged, a decline in   occupancy, and a decline in its profitability. Will CBL be able to turn around? The retail apocalypse hasn't been kind to this cash-strapped   mall operator. To make matters worse,   2019 has seen even more store closures and   bankruptcies    . CBL's financial figures are still not moving in the right   direction, which puts into question the viability of the   company's turnaround. The negative financial trends are compounded by the company's   stretched balance sheet position. It is certainly possible for   CBL to turn around, but that is clearly not   a safe bet to make today    .   10 stocks we like better than CBL and Associates     Properties       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and CBL and Associates     Properties wasn't one of them! That's right -- they think these     10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Luis Sanchez      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Planet Fitness. The Motley Fool     has a     disclosure policy      .  ",
    " The \"retail apocalypse\" is a phenomenon    whereby thousands of brick-and-mortar retail stores have closed   and many national retail chains have gone bankrupt. The cause: a   deadly cocktail of debt and declining sales due to competition   from e-commerce. It has continued with a vengeance in 2019.",
    "The hardest-hit segment of retail has been the American mall.   Mall operator   CBL & Associates Properties    (NYSE: CBL) has acutely felt this pain, and its stock price   reflects this. The stock is down over 90% from its highs a few   years ago due to fears that CBL will not be able to survive the   current onslaught.",
    "Are these fears well founded?",
    "    CBL    data by   YCharts ",
    "CBL is a   real estate investment trust (REIT)    that owns shopping malls and leases out space to retail tenants.   The company's focus has been regional malls, those that serve as   the primary shopping center in a small city or town.",
    "The company doesn't operate in Los Angeles or Miami, where   luxury shopping malls still generate healthy traffic and sales.   It operates in markets like Chattanooga, Tennessee, and Laredo,   Texas, where the surrounding population is not growing as rapidly   and has less disposable income.",
    "A shopping center is only as strong as its tenants, and   CBL has had exposure to many of the large   department stores and apparel chains    that have been hit the hardest. In 2013, the company reported   that it had exposure to 63   Sears    stores, 43   Macy's    stores, and 69   JCPenney     stores, among others. Not only have these department stores   had to close many of their locations, but they were particularly   quick to do so in regional malls managed by CBL, due to their   relatively unfavorable demographics and sales per square   foot.",
    "CBL saw its tenant occupancy rate decline as stores closed   faster than the company could release the space. Because shoppers   do not want to visit a partially vacant mall, CBL has been under   pressure to quickly find new tenants, which has led it to lower   rental rates, putting pressure on mall profitability.",
    "Additionally, CBL has had to invest in redeveloping vacant   anchor spaces into new retail boxes for new tenants. For example,   it has transformed former Sears stores into movie theaters, gyms,   and grocery stores. But these transformations haven't come cheap.   The company projected it would spend $11 million to redevelop   just one JCPenney into three spaces for an H&M, an   Outback Steakhouse    , and a   Planet Fitness    .",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "The retail downturn has left CBL strapped for cash as it loses   tenants and must pony up more cash to redevelop its malls. The   company has had to borrow money to execute on its turnaround,   which has also put pressure on its balance sheet.",
    " According to the company's most recent financial   report, in Q2 2019    , it has $4.4 billion in total debt. Its 2018   EBITDA    was $626 million, which implies a leverage ratio (debt to EBITDA)   of greater than seven times. That level of leverage is   questionable business practice in most investment circles, and it   is leading many investors to wonder if CBL will be able to pay   back its debts.",
    "To help alleviate its debt, CBL has been selling assets. So   far in 2019, the company has sold $120 million in real estate,   including a community center, an office building, and a hotel.   Last year, the company sold $100 million worth of assets. These   efforts are good to note, but selling a couple hundred million   worth of real estate won't wipe out the $4.4 billion debt burden   anytime soon.",
    "Hopefully, the worst of the retail apocalypse is in the   rearview mirror, but even if that is true, CBL is still showing   deteriorating financial performance.",
    "In the company's Q2 2019 financial report, it noted the   following:",
    "Of this barrage of data, the only positive point was an   increase in sales per square foot. Despite this increase, the   company saw a decline in the rents it charged, a decline in   occupancy, and a decline in its profitability.",
    "The retail apocalypse hasn't been kind to this cash-strapped   mall operator. To make matters worse,   2019 has seen even more store closures and   bankruptcies    . CBL's financial figures are still not moving in the right   direction, which puts into question the viability of the   company's turnaround.",
    "The negative financial trends are compounded by the company's   stretched balance sheet position. It is certainly possible for   CBL to turn around, but that is clearly not   a safe bet to make today    .",
    "  10 stocks we like better than CBL and Associates     Properties       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and CBL and Associates     Properties wasn't one of them! That's right -- they think these     10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than CBL and Associates     Properties       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and CBL and Associates     Properties wasn't one of them! That's right -- they think these     10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Luis Sanchez      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Planet Fitness. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:40:11"
}