{
  "url": "https://www.nasdaq.com/article/the-10-best-index-funds-to-buy-and-hold-cm1210625",
  "title": "The 10 Best Index Funds to Buy and Hold - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "[Editor's note: \"The 10 Best Index Funds to Buy and Hold\" was previously published in August 2019. It has since been updated to include the most relevant information available.]",
    "Index funds are responsible for saving investors like you and me untold billions of dollars in fees over the past couple of decades. They've also spared us countless headaches. (I don't know about you, but I'm glad I don't have to pick specific stocks to buy to get exposure to utilities or play the growth in India's middle class.) And the best index funds … well, they've made us a lot of money, which is the point of it all.",
    "But index funds are also contributing to an issue that could blow up in our faces .",
    "The push into index funds has intensified to the point that some experts believe it's not only driving the market higher, but it's causing a valuation bubble. In short, if you buy into any fund (index or not), the fund must invest that money into more stocks - and all that buying is distorting valuations . The danger, then, is that when that bubble pops, many supposedly safe index funds will feel the pain worse than other parts of the market.",
    "The lesson here is that the best index funds to buy for the foreseeable future aren't all going to look the same.",
    "Some top index fund picks will be so buy-and-hold-oriented that you won't need to worry about the bubble popping in a year or two or three because you plan on holding for 20 years, maybe 30. Some of the best picks for next year will only be worth buying into for tactical trades of a week or two at a time.",
    "So the following is a list of the best index funds for everyone - from long-term retirement-minded investors to click-happy day traders. And this includes a few funds that I either hold currently or have traded in the past.",
    "In no particular order …",
    "Type: Large-Cap Equity \r\n Expenses: 0.04%, or $4 annually for every $10,000 invested.",
    "Every year, I take a look at the best index funds for investors, and the Vanguard S&P 500 ETF (NYSEARCA: VOO ) is always at the top of my list.",
    "The argument is typically the same, and consists of two parts:",
    "But that second point has changed.",
    "In trying to position itself for advisers who may want to suggest the lowest-cost offerings, iShares parent BlackRock, Inc. (NYSE: BLK ) lowered the fees on 15 of its Core-branded ETFs, including the S&P 500-tracking  iShares Core S&P 500 ETF (NYSEARCA: IVV ).",
    "Previously, the IVV charged seven basis points. It's better than the SPDR S&P 500 ETF's (NYSEARCA: SPY ) 0.09%, but still above VOO's 0.03%. Now, though, IVV falls closest to the cellar at just 0.04%  in annual fees. Thus, the recommendation stands. Buy the market for as cheap as you can, and right now, that's the IVV.",
    "And that note of caution? If the valuation bubble does pop, the S&P 500 and its components very well could be hit harder than many other blue-chip stocks outside the index. If you only have a few years left in your investment horizon, you should acknowledge this and invest (and monitor) accordingly. If your investment horizon is measured in decades, buy and never look back.",
    "Learn more about iShares' IVV here",
    "Type: Mid-Cap EquityExpenses:  0.07%",
    "As I just said, it's difficult to beat the market. But the iShares Core S&P Mid-Cap ETF (NYSEARCA: IJH ) is awfully, awfully darn good at it. From a total performance perspective, the IJH has beaten the IVV over a 15-year period.",
    "And yet, very few people talk about the IJH, just as very few people talk about the companies that make it tick, such as veterinary supplier Idexx Laboratories, Inc. (NASDAQ: IDXX ).",
    "So … what's the deal?",
    "Mid-cap companies are frequently referred to as the market's \"sweet spot.\" That's because, as Hennessy Funds describes in a whitepaper ( PDF ), they typically feature much more robust long-term growth potential than their large-cap brethren, but more financial stability, access to capital and managerial experience than their small-cap counterparts.",
    "The result:",
    "\"Using standard deviation as a statistical measure of historical volatility, investors in mid-cap stocks have consistently been rewarded with lower risk relative to small-cap investors over the 1, 3, 5, 10, 15 and 20 years ended December 31, 2015. While mid-caps have historically exhibited higher standard deviation than large-caps, investors were compensated for this higher volatility with higher returns for the 10, 15 and 20 year periods.\"",
    "Ben Johnson, CFA, director of global ETF research for Morningstar, points out that \"an investment in a dedicated mid-cap fund reduces the likelihood of overlap with existing large-cap allocations and stands to improve overall portfolio diversification.\"",
    "In other words, IJH is an outstanding fund, but don't consider it an S&P 500 replacement - consider it an S&P 500 complement.",
    "Invest in both.",
    "Learn more about IJH here",
    "Type: Industry (Banking) \r\n Expenses: 0.35%",
    "Bank stocks have done very, very well in 2019, with solid year-to-date performances in stocks like  Bank of America  (NYSE: BAC ) and  Citigroup  (NYSE: C ) (up 19% and 32% respectively) leading the broad Financial Select Sector SPDR Fund (NYSEARCA: XLF ) to a 17% gain since the start of 2019. This makes the SPDR S&P Bank ETF (NYSEARCA: KBE ) especially attractive.",
    "Since the end of Oct. 2016, the KBE has gained over 25% on the belief Trump will tear down Wall Street regulations, creating an environment that's much more conducive to bank profits.",
    "That was confirmed in late 2016, when Trump confirmed Steve Mnuchin as his pick for Treasury Department secretary, and Mnuchin was quick to say that \"(stripping) back parts of Dodd-Frank that prevent banks from lending\" was top on his list of priorities.",
    "Mnuchin said something else telling - namely, that regional banks were the \"engine of growth to small- and medium-sized businesses.\" I got a call from Chris Johnson of JRG Investment Group after that, and he quipped, \"It's like he stared into the camera and winked at every regional bank and said, 'You're going to make money again.'\"",
    "While XLF does hold banks, it also holds insurers and other types of financials. KBE is a more focused collection of dozens of banks, including national brands like Bank of America and smaller regionals like Montana-based Glacier Bancorp, Inc. (NASDAQ: GBCI ), which is less than $3.5 billion by market cap. These stocks will not only benefit from any anti-regulation action but also future interest rate hikes.",
    "Learn more about SPDR's KBE here",
    "Type: Sector (Defense) \r\n Expenses: 0.60%",
    "The PowerShares Aerospace & Defense Portfolio (NYSEARCA: PPA ) is one of two ideal ways to play the defense space broadly. The other is the iShares U.S. Aerospace & Defense ETF (NYSEARCA: ITA ), and frankly, I think it's a toss-up between the pair. It just depends on what you're looking for.",
    "Both are heavy in many of the same stocks, such as Boeing Co (NYSE: BA ) and United Technologies Corporation (NYSE: UTX ). The price advantage goes to the iShares fund, which is cheaper by 0.2 percentage points. However, PPA is a better choice if you're looking for more diversification.",
    "Defense stocks are clobbering the market, including more than doubling the S&P 500 since Trump got elected. This isn't a hidden trade. Frankly, I think new money should consider waiting for the next sizable market dip to knock some of the froth off before buying either of these ETFs.",
    "But defense will rule for the foreseeable future. Thus, PPA and ITA will, too.",
    "Learn more about PowerShares' PPA here.",
    "Type: Emerging-Market Dividend Expenses:  0.65%",
    "The next four funds are dedicated yield plays, and we're starting with a pretty young (and aggressive) ETF - the Global X SuperDividend Emerging Markets ETF (NYSEARCA: SDEM ). But there are a few sound theories that could make this one of the best international plays.",
    "Trump is widely considered to be a net negative for emerging markets because of his anti-trade, pro-U.S. rhetoric. But as Paul J. Lim and Carolyn Bigda at Fortune point out, the recent reactionary drought in EM stocks has brought their price-to-earnings ratios below their long-term average.",
    "The duo points out a number of other drivers, including …",
    "All of that stands to benefit the SDEM, which has 23% of its holdings i nenergy and basic materials ) as its two heaviest sectors and invests heavily in commodity-focused markets including Brazil and Russia.",
    "SDEM does pose a bit of risk by intentionally investing in some of the highest yielders across a number of emerging markets - as we all know, dividends can suggest financial stability, but excessively high dividends can be a symptom of troubled companies.",
    "But Global X views the high dividends as another factor of value (the reason yields are high is because the stocks are underappreciated), and it does mitigate this risk by equally weighting its 50 holdings upon every rebalancing.",
    "SDEM's monthly dividend yields 6.58%. That's still excellent for an emerging-markets fund, and the icing on the cake if the potential for an EM rebound is realized.",
    "Learn more about SDEM here",
    "Type: U.S. Dividend \r\n Expenses:  0.3%",
    "If you're looking for dividend stocks without quite so much risk, the PowerShares S&P 500 High Dividend Low Volatility Portfolio (NYSEARCA: SPHD ) is literally designed to provide you with just that.",
    "The SPHD has a portfolio that seeks out dividends, not in risky emerging markets, but in the most stable high-yield blue chips the S&P 500 has to offer. To do this, the index takes the 75 highest-yielding constituents of the index, with a maximum of 10 stocks in any one particular sector, then takes the 51 stocks with the lowest 12-month volatility from the group.",
    "The result is a mostly boring group of stocks that are heavy in utilities (14%), energy (14%) and real estate (24%).",
    "The fund also uses a modified market cap-weighting scheme that provides a ton of balance. Even top holdings Iron Mountain  (NYSE: IRM) and Macerich (NYSE: MAC ) are just 3% of the fund apiece.",
    "The main purpose of a fund like SPHD is to create even returns and strong income - something more in line of protection against a down market. But it has even managed to clobber SPY (and numerous dividend ETFs) in the past.",
    "SPHD is young, but it looks like one of the best index funds on the market.",
    "Learn more about SPHD here",
    "Type: Junk Bond \r\n Expenses:  0.4%",
    "In late 2014, I picked the SPDR Bloomberg Barclays High-Yield Bond ETF (NYSEARCA: JNK ) as one of the best index funds to buy for 2015, and JNK responded by dropping 13% that year and recovering to \"only\" a 9.8% decline in 2016. But this year, however, JNK is actually up 9%.",
    "That reflects the general idea behind buying JNK - even in difficult times for junk bonds, a heavy yield can do a lot to offset capital losses, and then some.",
    "Invesco released a report showing that high-yield bonds like those held in JNK actually perform well in rising-rate environments ( PDF ). It starts:",
    "\"Since 1987, there have been 16 quarters where yields on the 5-year Treasury note rose by 70 basis points or more. During 11 of those quarters high yield bonds demonstrated positive returns; during the five quarters where high yield bond returns were not positive, the asset class rebounded the following quarter.\"",
    "There's a number of reasons for this, such as an expanding economy normally being a boon for corporate debt service (lowering default rates), a lower relative duration rate of junk bonds and the boosting of returns via prepayment penalties by companies anxious to reduce or eliminate their debt before rates increase.",
    "Meanwhile, near-zero rates have helped keep down the rates on junk bonds, so right now JNK is yielding nearly 5.6% despite offering some of its lowest nominal payouts since inception in late 2007. Expect that to rise along with interest rates in coming years, which will provide outstanding annual returns from income alone to anyone with a long investment horizon.",
    "Learn more about SPDR's JNK here",
    "Type: Preferred Stock \r\n Expenses: 0.4%*",
    "Another less-ballyhooed asset geared toward high income is preferred stocks. They're called \"preferred\" because the dividends on them actually take preference over common stock dividends.",
    "Preferreds must be paid before commons are, and in the case of a suspension, many preferred stocks demand that the company pay all missed dividends in arrears before resuming dividends to common shares.",
    "And the \"stocks\" part of the moniker is a little misleading too, because they actually have a lot in common with bonds:",
    "While I have long been (and still am) invested in the iShares U.S. Preferred Stock ETF (NYSEARCA: PFF ), my recommendation is the VanEck Vectors Preferred Securities ex Financials ETF (NYSEARCA: PFXF ).",
    "The real draw of PFXF is its low 0.4% expense ratio, low volatility  and 5.4% yield - the best combination of the three in the space.",
    "*Includes an 8-basis-point fee waiver",
    "Learn more about VanEck's PFXF here",
    "Type: Leveraged Industry (Biotech) \r\n Expenses: 1.13%*",
    "While I'm long both pharmaceuticals via the Health Care Select Sector SPDR Fund (NYSEARCA: XLV ) and biotechs via the SPDR S&P Biotech ETF (NYSEARCA: XBI ), I think the best healthcare opportunity will be found by traders who tango with the Direxion Daily S&P Biotech Bull 3x Shares (NYSEARCA: LABU ).",
    "The LABU is a 3x leveraged index fund that aims to provide triple the daily returns of the S&P Biotechnology Select Industry Index - the same index upon which XBI is based. Note the term \"daily returns\" - the longer you hold onto leveraged funds, the more your returns can skew from the movement of the index .",
    "I think biotechs could still be in for a bumpy ride, as popular outcry over sky-high drug pricing isn't going away. Moreover, there's still the issue of pharmacy benefits managers (PBMs) increasingly siphoning pharmaceutical and biotechs' profits . But aggressive traders will get the most bang for their buck trying to play dips with tools like LABU, while fiscal hermit crabs like myself are content to sit in XBI and enjoy the uneven crawl higher.",
    "*Includes 12-basis-point fee waiver.",
    "Learn more about Direxion's LABU here",
    "Type: Leveraged Industry (Gold Mining) \r\n Expenses: 0.94%/1.04%*",
    "The last of the best index funds are actually a pair of funds that you can use to trade gold. (Sort of.)",
    "The Direxion Daily Gold Miners Index Bull 3x Shares (NYSEARCA: NUGT ) and Direxion Daily Gold Miners Index Bear 3x Shares (NYSEARCA: DUST ) are actually leveraged plays on the NYSE Arca Gold Miners Index - an index of gold mining companies that powers the VanEck Vectors Gold Miners ETF (NYSEARCA: GDX ).",
    "Why gold miners?",
    "Gold miners have certain all-in costs of mining gold, and so they move heavily based on the price of the commodity. In fact, they tend to be more volatile than gold itself. Just take the first half of 2016, in which the SPDR Gold Trust (ETF) (NYSEARCA: GLD ) returned a robust 25%. GDX doubled in that same time frame. And NUGT? NUGT returned 420% - so, more than quadruple the GDX.",
    "But if you timed the play wrong, you were sunk. If you bought NUGT in May and held through the end of the month, you were down 40% to GDX's 14%.",
    "I have no doubt that 2019 will continue to provide a number of big drivers (in either direction) for gold, from U.S. dollar movements to interest rate moves to renewed Brexit fears. NUGT and DUST are two lucrative ways to profit off those trends.",
    "Just handle with care.",
    "*Includes a 9-basis-point fee waiver for NUGT and a 2-basis-point fee waiver for DUST.",
    "Learn more about NUGT & DUST here",
    "As of this writing, Kyle Woodley did not hold a position in any of the aforementioned securities. Follow him on Twitter at@KyleWoodley.",
    "The post The 10 Best Index Funds to Buy and Hold appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:35:52"
}