{
  "url": "https://www.nasdaq.com/article/peugeot-dongfeng-agree-to-restructuring-plan-for-chinese-venture-20190905-00907",
  "title": "Peugeot, Dongfeng agree to restructuring plan for Chinese venture - Nasdaq.com",
  "text": [
    "BEIJING, Sept 5 (Reuters) - Peugeot automaker PSA Group  and its Chinese partner Dongfeng Group  have hammered out a plan to restructure their joint venture operations, slashing costs in the short term and aiming to boost annual sales to 400,000 vehicles by 2025, PSA said on Thursday.",
    "Dongfeng Peugeot Citroen Automobiles (DPCA), the joint venture based in Wuhan, central China, plans to reduce the break-even point to below 180,000 vehicles in 2019 and further reduce to below 150,000 vehicles between 2020 and 2021, according to a post on PSA's social media account in China.",
    "The 27-year-old venture will start to consolidate manufacturing resources, dispose of idle assets, improve system efficiency and launch more models in China, according to the post. The goal is to revive annual sales to around 250,000 units between 2020 and 2021, and 400,000 units by 2025, it said.",
    "PSA is attempting a reboot under tough conditions in the world's largest vehicle market, once an auto industry cash cow. The Chinese market contracted last year for the first time since the 1990s and is expected to decline another 5% in 2019, squeezed by a trade tension between China and United States.",
    "Peugeot is one of several global automakers, including Ford Motor Co, that have been forced to retrench as sales in China have tumbled. ",
    "Dongfeng Peugeot plans to launch 14 new models in China over the next three years. After 2020, every new model will have an electrified version that qualifies as a \"new energy vehicle\" under Chinese regulations, the post said.",
    "A document seen by Reuters in July showed the joint venture plans to halve workforce and drop two of four shared assembly plants in China."
  ],
  "published_datetime": "2019-09-05 01:42:00"
}