{
  "url": "https://www.nasdaq.com/article/5-things-youll-want-to-know-about-amgens-future-cm1210074",
  "title": "5 Things You'll Want to Know About Amgen's Future - Nasdaq.com",
  "text": [
    "  Amgen    (NASDAQ: AMGN) is in a state of transition. The big biotech now   faces declining sales for several of its older blockbuster drugs.   But Amgen also has several new drugs on the market and more on   the way that are quite promising. What's next for Amgen? CEO Bob Bradway and CFO David Meline   fielded questions at the Morgan Stanley 17th Annual Global   Healthcare Conference on Tuesday. Here are five things you'll   want to know about what these top executives said about Amgen's   future.   Image source: Getty Images.makeArticleAd();  1. Changes to drug pricing One of the biggest uncertainties with   investing in pharmaceutical stocks    right now is the potential for major changes impacting how   companies price drugs. It didn't take long for questions about   proposed changes in Washington, D.C. to come up at the Morgan   Stanley conference. Bob Bradway said that \"it would be surprising if nothing   happens at the end of the day,\" adding that the big question was   when that \"end of the day\" would actually arrive. He stated that   Amgen is advocating for changes that lower the out-of-pocket   costs for patients. That stance is understandable since it would   likely involve the least painful changes for Amgen. However, David Meline noted that the company expects to see a   \"tougher pricing environment\" going forward. He said that Amgen   isn't assuming that it will be able to increase drug prices each   year on an ongoing basis. But he also expressed confidence that   the biotech is \"in a good position to be successful in a changing   environment.\" 2. More acquisitions Bradway was enthusiastic about Amgen's   recent deal to buy psoriasis and psoriatic drug   Otezla from   Celgene     . He stated that acquiring Otezla was \"a unique opportunity\"   unlike any that he has seen over the last several decades.   Bradway said that the drug is a \"very good strategic fit\" for   Amgen. But while deals to buy established blockbusters that fit   hand-in-glove with Amgen's portfolio like Otezla aren't likely to   come along very often, the company is clearly looking to make   more acquisitions. Meline said that Amgen will \"still be in the game\" for   attractive business development deals even after the Otezla   purchase. He noted that the company has plenty of cash to invest   in promising opportunities. He expects that Amgen will continue   to look at potential acquisitions and other business development   deals in all the areas the company currently has a commercial or   scientific presence and across all stages of development. 3. Big opportunities in oncology Amgen currently has 35 programs in its pipeline, including   three biosimilars. The biotech's pipeline is heavily weighted   with early stage candidates. Bradway spoke the most about   experimental KRAS inhibitor AMG510. Amgen recently announced data   from a phase 1 study of the drug that found that a 960 mg dose of   the drug kept non-small cell lung cancer (NSCLC) from progressing   in 100% of patients, with tumors shrinking in more than half of   the patients. It's still early, though, and some investors weren't overly   impressed with the phase 1 results. Bradway said that Amgen is   rapidly enrolling patients in a phase 2 study of AMG510. He also   noted that the drug has demonstrated potential in other types of   cancer. The biotech's pipeline is also loaded with early stage   bispecific T cell engager (BiTE) drugs targeting various types of   cancer. Amgen's first BiTE drug, Blincyto, is already on the   market as a treatment for acute lymphoblastic leukemia (ALL).   Bradway said that Amgen is evaluating BiTE candidates in treating   multiple blood cancers and solid tumors. 4. More buybacks, higher dividends You might expect that Amgen's CFO would play up how the   company has rewarded shareholders through stock buybacks and   dividend increases. And that's exactly what David Meline did.   Meline also stated that Amgen is \"committed to not sit forever   with excess cash,\" a reference to the company's cash stockpile of   close to $21.8 billion. It wasn't just Meline talking about buybacks and dividends. In   Bradway's opening comments at the Morgan Stanley conference, he   underscored that Amgen is committed to returning capital to its   shareholders through more buybacks and higher dividends. He   stressed that the deal to buy Otezla doesn't change these   priorities at all. 5. \"A very nice growth profile\" Meline acknowledged that Amgen is undergoing a transition as   its legacy products face increased competition. However, he said   that the company is managing this transition well, with products   such as Prolia and Xgeva generating strong growth along with   increased contributions from cholesterol drug Repatha and   migraine drug Aimovig. He thinks that adding Otezla to the mix will make Amgen's   product lineup even stronger. With all of this and several   pipeline opportunities in the relatively near future, Meline said   that it all \"adds up to a nice growth profile\" for Amgen. He   stated that the company is \"quite encouraged\" as it looks forward   to 2020.   10 stocks we like better than Amgen       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amgen wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Keith Speights      owns shares of Celgene. The Motley Fool owns shares of and     recommends Celgene. The Motley Fool recommends Amgen. The     Motley Fool has a     disclosure policy      .  ",
    " Amgen    (NASDAQ: AMGN) is in a state of transition. The big biotech now   faces declining sales for several of its older blockbuster drugs.   But Amgen also has several new drugs on the market and more on   the way that are quite promising.",
    "What's next for Amgen? CEO Bob Bradway and CFO David Meline   fielded questions at the Morgan Stanley 17th Annual Global   Healthcare Conference on Tuesday. Here are five things you'll   want to know about what these top executives said about Amgen's   future.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "One of the biggest uncertainties with   investing in pharmaceutical stocks    right now is the potential for major changes impacting how   companies price drugs. It didn't take long for questions about   proposed changes in Washington, D.C. to come up at the Morgan   Stanley conference.",
    "Bob Bradway said that \"it would be surprising if nothing   happens at the end of the day,\" adding that the big question was   when that \"end of the day\" would actually arrive. He stated that   Amgen is advocating for changes that lower the out-of-pocket   costs for patients. That stance is understandable since it would   likely involve the least painful changes for Amgen.",
    "However, David Meline noted that the company expects to see a   \"tougher pricing environment\" going forward. He said that Amgen   isn't assuming that it will be able to increase drug prices each   year on an ongoing basis. But he also expressed confidence that   the biotech is \"in a good position to be successful in a changing   environment.\"",
    "Bradway was enthusiastic about Amgen's   recent deal to buy psoriasis and psoriatic drug   Otezla from   Celgene     . He stated that acquiring Otezla was \"a unique opportunity\"   unlike any that he has seen over the last several decades.   Bradway said that the drug is a \"very good strategic fit\" for   Amgen. But while deals to buy established blockbusters that fit   hand-in-glove with Amgen's portfolio like Otezla aren't likely to   come along very often, the company is clearly looking to make   more acquisitions.",
    "Meline said that Amgen will \"still be in the game\" for   attractive business development deals even after the Otezla   purchase. He noted that the company has plenty of cash to invest   in promising opportunities. He expects that Amgen will continue   to look at potential acquisitions and other business development   deals in all the areas the company currently has a commercial or   scientific presence and across all stages of development.",
    "Amgen currently has 35 programs in its pipeline, including   three biosimilars. The biotech's pipeline is heavily weighted   with early stage candidates. Bradway spoke the most about   experimental KRAS inhibitor AMG510. Amgen recently announced data   from a phase 1 study of the drug that found that a 960 mg dose of   the drug kept non-small cell lung cancer (NSCLC) from progressing   in 100% of patients, with tumors shrinking in more than half of   the patients.",
    "It's still early, though, and some investors weren't overly   impressed with the phase 1 results. Bradway said that Amgen is   rapidly enrolling patients in a phase 2 study of AMG510. He also   noted that the drug has demonstrated potential in other types of   cancer.",
    "The biotech's pipeline is also loaded with early stage   bispecific T cell engager (BiTE) drugs targeting various types of   cancer. Amgen's first BiTE drug, Blincyto, is already on the   market as a treatment for acute lymphoblastic leukemia (ALL).   Bradway said that Amgen is evaluating BiTE candidates in treating   multiple blood cancers and solid tumors.",
    "You might expect that Amgen's CFO would play up how the   company has rewarded shareholders through stock buybacks and   dividend increases. And that's exactly what David Meline did.   Meline also stated that Amgen is \"committed to not sit forever   with excess cash,\" a reference to the company's cash stockpile of   close to $21.8 billion.",
    "It wasn't just Meline talking about buybacks and dividends. In   Bradway's opening comments at the Morgan Stanley conference, he   underscored that Amgen is committed to returning capital to its   shareholders through more buybacks and higher dividends. He   stressed that the deal to buy Otezla doesn't change these   priorities at all.",
    "Meline acknowledged that Amgen is undergoing a transition as   its legacy products face increased competition. However, he said   that the company is managing this transition well, with products   such as Prolia and Xgeva generating strong growth along with   increased contributions from cholesterol drug Repatha and   migraine drug Aimovig.",
    "He thinks that adding Otezla to the mix will make Amgen's   product lineup even stronger. With all of this and several   pipeline opportunities in the relatively near future, Meline said   that it all \"adds up to a nice growth profile\" for Amgen. He   stated that the company is \"quite encouraged\" as it looks forward   to 2020.",
    "  10 stocks we like better than Amgen       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amgen wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Amgen       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amgen wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Keith Speights      owns shares of Celgene. The Motley Fool owns shares of and     recommends Celgene. The Motley Fool recommends Amgen. The     Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:00:00"
}