{
  "url": "https://www.nasdaq.com/article/trade-of-the-day-the-trend-in-visa-stock-is-worth-a-closer-look-cm1210594",
  "title": "Trade of the Day: The Trend in Visa Stock Is Worth a Closer Look - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Despite a sharp pullback over the past two trading day, Visa  (NYSE: V ) stock remains higher by more than 30% year-to-date. While in the bigger picture V stock is certainly nearing overbought readings, in the near to intermediate term, the stock is trending higher. And, at the bottom end of the trading range here, the stock is ripe for a bounce trade.",
    "Many disagreements between market participants around any given stock's appreciation potential could immediately be put to rest if they would disclose what time frame their views are in. In the world of charts and technical analysis, successful traders know that a near-term view on a stock has nearly nothing to do with an intermediate-term or longer-term chart.",
    "In other words, while we always want to gain perspective on any given trade setup through the lens of different time frames, a stock at any given point is usually not a \"buy\" or a \"sell\" in all time frames simultaneously.",
    "To wit, looking at the multi-year chart of Visa stock we see that over time it has continuously steepened its slope. Year-to-date the stock has also begun to notably narrow its trading range while leaving most momentum oscillators (bottom of chart) in serious overbought readings. While this is concerning in the longer-term, and it could thus lead to a serious mean-reversion move lower over time, in the near term, the trend in Visa stock continues.",
    "On the daily chart we see that V stock, for the most part thus far in 2019, has pushed higher in a well-defined range as marked by the two purple parallels. The bearish reversal over the past two trading days, which measures nearly -5.50% so far, has pulled the stock down to the lower end of the trading range. Furthermore, this lower boundary also roughly coincides with the blue 100-day simple moving average as further potential solidification of support.",
    "While I am one to respect bearish reversals such as the ones we witnessed in V stock so far this week, I am also wanting to respect the year-to-date up-trend.",
    "My favorite way to look for entry points to buy V stock at this juncture is using a specific candlestick pattern. Join me on Wednesday Sept. 11 for a special webinar for InvestorPlace readers where I will teach this high-probability candlestick pattern.",
    "Right now, active investors and traders could look to buy Visa stock around the $175 area, using a first upside target at $185 and a stop loss at $171.",
    "Join Serge's special webinar to InvestorPlace readers where he will teach his highest probability candlestick pattern for rapid bullish and bearish reversals.",
    "The post Trade of the Day: The Trend in Visa Stock Is Worth a Closer Look appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:52:06"
}