{
  "url": "https://www.nasdaq.com/article/bcbp-or-wafd-which-is-the-better-value-stock-right-now-cm1207183",
  "title": "BCBP or WAFD: Which Is the Better Value Stock Right Now? - Nasdaq.com",
  "text": [
    " Investors interested in Banks - Northeast stocks are likely familiar with BCB Bancorp (BCBP) and Washington Federal (WAFD). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look. We have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits. BCB Bancorp and Washington Federal are both sporting a Zacks Rank of # 2 (Buy) right now. The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that both of these companies have improving earnings outlooks. However, value investors will care about much more than just this. Value investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels. Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years. BCBP currently has a forward P/E ratio of 10.31, while WAFD has a forward P/E of 13.37. We also note that BCBP has a PEG ratio of 1.03. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. WAFD currently has a PEG ratio of 1.91. Another notable valuation metric for BCBP is its P/B ratio of 1.03. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, WAFD has a P/B of 1.37. These are just a few of the metrics contributing to BCBP's Value grade of A and WAFD's Value grade of C. Both BCBP and WAFD are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that BCBP is the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  BCB Bancorp, Inc. (NJ) (BCBP): Free Stock Analysis Report   Washington Federal, Inc. (WAFD): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors interested in Banks - Northeast stocks are likely familiar with BCB Bancorp (BCBP) and Washington Federal (WAFD). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look.",
    "We have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits.",
    "BCB Bancorp and Washington Federal are both sporting a Zacks Rank of # 2 (Buy) right now. The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that both of these companies have improving earnings outlooks. However, value investors will care about much more than just this.",
    "Value investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels.",
    "Our Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years.",
    "BCBP currently has a forward P/E ratio of 10.31, while WAFD has a forward P/E of 13.37. We also note that BCBP has a PEG ratio of 1.03. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. WAFD currently has a PEG ratio of 1.91.",
    "Another notable valuation metric for BCBP is its P/B ratio of 1.03. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, WAFD has a P/B of 1.37.",
    "These are just a few of the metrics contributing to BCBP's Value grade of A and WAFD's Value grade of C.",
    "Both BCBP and WAFD are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that BCBP is the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:10"
}