{
  "url": "https://www.nasdaq.com/article/agree-to-purchase-lockheed-martin-corp-at-315-earn-46-using-options-cm1210535",
  "title": "Agree To Purchase Lockheed Martin Corp At $315, Earn 4.6% Using Options - Nasdaq.com",
  "text": [
    "Investors considering a purchase of Lockheed Martin Corp (Symbol: LMT) stock, but cautious about paying the going market price of $383.67/share, might benefit from considering selling puts among the alternative strategies at their disposal. One interesting put contract in particular, is the January 2021 put at the $315 strike, which has a bid at the time of this writing of $14.60. Collecting that bid as the premium represents a 4.6% return against the $315 commitment, or a 3.4% annualized rate of return (at Stock Options Channel we call this the YieldBoost  ).      Selling a put does not give an investor access to LMT's upside potential the way owning shares would, because the put seller only ends up owning shares in the scenario where the contract is exercised. And the person on the other side of the contract would only benefit from exercising at the $315 strike if doing so produced a better outcome than selling at the going market price. ( Do options carry counterparty risk? This and six other common options myths debunked  ). So unless Lockheed Martin Corp sees its shares decline 17.9% and the contract is exercised (resulting in a cost basis of $300.40 per share before broker commissions, subtracting the $14.60 from $315), the only upside to the put seller is from collecting that premium for the 3.4% annualized rate of return.  makeArticleAd();  Interestingly, that annualized 3.4% figure actually exceeds the 2.3% annualized dividend paid by Lockheed Martin Corp by 1.1%, based on the current share price of $383.67. And yet, if an investor was to buy the stock at the going market price in order to collect the dividend, there is greater downside because the stock would have to lose 17.95% to reach the $315 strike price.    Always important when discussing dividends is the fact that, in general, dividend amounts are not always predictable and tend to follow the ups and downs of profitability at each company. In the case of Lockheed Martin Corp, looking at the dividend history chart for LMT below can help in judging whether the most recent dividend is likely to continue, and in turn whether it is a reasonable expectation to expect a 2.3% annualized dividend yield.       Below is a chart showing the trailing twelve month trading history for Lockheed Martin Corp, and highlighting in green where the $315 strike is located relative to that history:       The chart above, and the stock's historical volatility, can be a helpful guide in combination with fundamental analysis to judge whether selling the January 2021 put at the $315 strike for the 3.4% annualized rate of return represents good reward for the risks. We calculate the trailing twelve month volatility for Lockheed Martin Corp (considering the last 251 trading day closing values as well as today's price of $383.67) to be 22%. For other put options contract ideas at the various different available expirations, visit the LMT Stock Options  page of StockOptionsChannel.com.    In mid-afternoon trading on Wednesday, the put volume among S&P 500 components was 1.29M contracts, with call volume at 1.29M, for a put:call ratio of 0.74 so far for the day, which is above normal compared to the long-term median put:call ratio of .65. In other words, if we look at the number of call buyers and then use the long-term median to project the number of put buyers we'd expect to see, we're actually seeing more put buyers than expected out there in  options trading  so far today. Find out which 15 call and put options traders are talking about today  .   Top YieldBoost Puts of the S&P 500 »  ",
    "  Top YieldBoost Puts of the S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:12:01"
}