{
  "url": "https://www.nasdaq.com/article/this-retirement-mistake-could-cost-you-200000-or-more-cm1210852",
  "title": "This Retirement Mistake Could Cost You $200,000 or More - Nasdaq.com",
  "text": [
    "Unless you win the lottery or inherit a fortune, it's up to you to save for your retirement. It's easy to fall into the trap of thinking you have plenty of time, but retirement costs more than many people realize and the years always go by faster than you think.",
    "There's no rule that says you have to start saving for retirement as soon as you enter the workforce, but the sooner you begin, the less money you have to put up because your investments have more time to grow. It's still possible to save enough if you don't start until your 30s or 40s, but you'll have to set aside a larger proportion of your earnings in order to make that happen.",
    "Image source: Getty Images.",
    "To put this in perspective, let's consider how much someone would have to save per month in order to reach $1 million in retirement savings by the time they're 65, assuming a 7% annual rate of return. The table below lists the starting age, the monthly amount they must contribute and the total amount they will contribute over their working lives toward retirement. All figures are rounded to the nearest dollar.",
    "Source:InvestingAnswers Million Dollar Savings Calculator.",
    "As the table illustrates, if you start saving at 25, you can retire at 65 with $1 million while contributing less than a fifth of that on your own. The remaining $817,120 will come from investmen t earnings . If you waited another decade to start saving, you'd have to pay another $100,000 of your own money to retire with $1 million by 65. And if you waited until 50 to start saving, you'll have to pay over half of the $1 million out of your own pocket because your investments don't have as much time to grow to make up the difference.",
    "The above example illustrates the importance of beginning to save early, but $1 million is probably not enough for most workers today to retire comfortably. If you need more than this to retire, you'll have to save more of your own money, regardless of the age you begin saving at. But starting early can still lessen the burden considerably. Consider the following table which shows how much different monthly contribution amounts could grow to with a 7% annual rate of return based on how much time your investments have to grow before you need to begin drawing upon them. All figures are rounded to the nearest dollar.",
    "Source:U.S. Securities and Exchange Commission Compound Interest Calculator.",
    "A $100 monthly contribution won't cover the cost of your retirement no matter when you start saving, but even in this example, it's clear how much starting early can help you save. If you saved $100 per month for a full 40 years, you'd end up with nearly $240,000. If you got a late start and that money sat in your account for just five years, it'd only be worth around $7,000. That's a difference of nearly $233,000.",
    "Now that you understand the importance of saving for retirement as early as possible, you have to figure out how to fit retirement savings into your budget. Set aside a portion of each paycheck for retirement if you can afford to do so. You might be able to automate these contributions so you don't have to think about it. Take advantage of any employer 401(k) match your company offers to reduce how much you have to save on your own.",
    "If your current budget doesn't allow for retirement saving, make some changes . Limit your discretionary purchases and look for expenses you can cut out altogether, like cable or a gym membership you don't use. You can also put your year-end bonuses and tax refunds toward retirement. Seek out ways to boost your income like starting a side hustle, and if you get a raise, increase your retirement contributions before doing anything else.",
    "How much you should save for retirement depends on your goals and lifestyle. Create a personalized retirement plan by subtracting your ideal retirement age from your estimated life expectancy. Then, multiply your average annual retirement expenses by the number of years of your retirement, adding 3% annually for inflation. A retirement calculator can do this math for you while also calculating how much your investments could grow to be. Use a 5% to 6% annual rate of return to be conservative.",
    "Your retirement calculator should tell you how much to save per month and overall to meet your goal. Subtract from this monthly target any money you expect from a pension, 401(k) match, or Social Security to figure out what you need to save on your own. You can estimate your Social Security benefit by creating a my Social Security account .",
    "Saving for retirement might not always be convenient, but whenever you're tempted to put it off for another month or year, remember how much money you're costing yourself in the long run.",
    "The $16,728 Social Security bonus most retirees completely overlook\r\n If you're like most Americans, you're a few years (or more) behind on your retirement savings. But a handful of little-known \"Social Security secrets\" could help ensure a boost in your retirement income. For example: one easy trick could pay you as much as $16,728 more... each year! Once you learn how to maximize your Social Security benefits, we think you could retire confidently with the peace of mind we're all after. Simply click here to discover how to learn more about these strategies .",
    "The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 05:52:00"
}