{
  "url": "https://www.nasdaq.com/article/most-workers-are-checking-their-salaries-and-many-arent-happy-cm1207688",
  "title": "Most Workers Are Checking Their Salaries (and Many Aren't Happy) - Nasdaq.com",
  "text": [
    " It used to be difficult to determine whether you were getting   paid fairly compared to people with similar experience doing the   same job. That has changed in the internet era, as a number of   websites exist where people openly share salary information. Most professionals (82%) said they feel well-informed about   what they should be making, and 73% said they have checked how   their salary compares using online resources, according to a   new study    from Robert Half. That's up from 54% in a similar survey two   years ago.   Know what you should be paid and talk to your boss about it.     Image source: Getty Images.makeArticleAd();  Many feel underpaid Less than half of those surveyed (47%) feel that they are   being paid what they are worth. That could become a major problem   for employers as a hot   job market    makes it easier for people to switch jobs. \"Workers have more access to information about their salaries,   roles and career options than ever before, arming them for   conversations with current and potential employers,\" said Robert   Half Senior Executive Director Paul McDonald. \"Managers must   remain equally knowledgeable, regularly evaluating salaries to   ensure they're paying at or above market rates to recruit and   retain highly skilled talent in today's competitive hiring   market.\" The majority of workers (57%) believe that the strong economy   has helped their earnings potential. However, 34% are frustrated   by the salary increases their company has offered, and 31%   believe they would have to leave in order to get a significant   raise. What can be done? Workers can use the availability of information about salaries   to get a raise. It's important to handle that the right way,   though -- you don't want to walk into your boss's office and   demand a big increase. Instead, take a proactive approach and lay   out what you make and what people with similar positions and   experience make, and then ask to make a plan to get your salary   into that ballpark. Make it clear that you want to be paid a market rate, but be   somewhat flexible when it comes to how you get there. It may take   multiple planned raises, but if your company is accommodating   (and you like your job), work with it to get where you want to   go. Companies should not force employees to bring salary   disparities up. This is something that should be actively   addressed. If you're making salary decisions, examine what you   pay compared to what your rivals pay. Factor in benefits,   workplace flexibility, and other perks. Once you have a picture   of where your salaries stand, work with your employees to raise   their wages so they are within industry norms. Workers have options. The job market has been strong, and   there are   more openings    than people to fill them. That makes it imperative for companies   to be very proactive when it comes to retaining staff. It's generally cheaper to keep the employees you have than   replace them. Be proactive and make sure you address your   employees' concerns before they're forced to leave.   The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .   The Motley Fool has a     disclosure policy      .  ",
    "It used to be difficult to determine whether you were getting   paid fairly compared to people with similar experience doing the   same job. That has changed in the internet era, as a number of   websites exist where people openly share salary information.",
    "Most professionals (82%) said they feel well-informed about   what they should be making, and 73% said they have checked how   their salary compares using online resources, according to a   new study    from Robert Half. That's up from 54% in a similar survey two   years ago.",
    "  Know what you should be paid and talk to your boss about it.     Image source: Getty Images.makeArticleAd(); ",
    "Know what you should be paid and talk to your boss about it.     Image source: Getty Images.",
    "Less than half of those surveyed (47%) feel that they are   being paid what they are worth. That could become a major problem   for employers as a hot   job market    makes it easier for people to switch jobs.",
    "\"Workers have more access to information about their salaries,   roles and career options than ever before, arming them for   conversations with current and potential employers,\" said Robert   Half Senior Executive Director Paul McDonald. \"Managers must   remain equally knowledgeable, regularly evaluating salaries to   ensure they're paying at or above market rates to recruit and   retain highly skilled talent in today's competitive hiring   market.\"",
    "The majority of workers (57%) believe that the strong economy   has helped their earnings potential. However, 34% are frustrated   by the salary increases their company has offered, and 31%   believe they would have to leave in order to get a significant   raise.",
    "Workers can use the availability of information about salaries   to get a raise. It's important to handle that the right way,   though -- you don't want to walk into your boss's office and   demand a big increase. Instead, take a proactive approach and lay   out what you make and what people with similar positions and   experience make, and then ask to make a plan to get your salary   into that ballpark.",
    "Make it clear that you want to be paid a market rate, but be   somewhat flexible when it comes to how you get there. It may take   multiple planned raises, but if your company is accommodating   (and you like your job), work with it to get where you want to   go.",
    "Companies should not force employees to bring salary   disparities up. This is something that should be actively   addressed. If you're making salary decisions, examine what you   pay compared to what your rivals pay. Factor in benefits,   workplace flexibility, and other perks. Once you have a picture   of where your salaries stand, work with your employees to raise   their wages so they are within industry norms.",
    "Workers have options. The job market has been strong, and   there are   more openings    than people to fill them. That makes it imperative for companies   to be very proactive when it comes to retaining staff.",
    "It's generally cheaper to keep the employees you have than   replace them. Be proactive and make sure you address your   employees' concerns before they're forced to leave.",
    "  The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      . ",
    " The $16,728 Social Security bonus most retirees     completely overlook       If you're like most Americans, you're a few years (or more)     behind on your retirement savings. But a handful of     little-known \"Social Security secrets\" could help ensure a     boost in your retirement income. For example: one easy trick     could pay you as much as $16,728 more... each year! Once     you learn how to maximize your Social Security benefits, we     think you could retire confidently with the peace of mind we're     all after.     Simply click here to discover how to learn more     about these strategies      .",
    " The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 06:16:00"
}