{
  "url": "https://www.nasdaq.com/article/preciousgold-slips-from-six-year-peak-on-sinous-trade-optimism-20190905-00234",
  "title": "PRECIOUS-Gold slips from six year peak on Sino-U.S. trade optimism - Nasdaq.com",
  "text": [
    "    * Platinum hits highest since Feb. 2018",
    "* Silver holds near three-year high touched on Wednesday",
    "* European equities climb to fresh one-month high (Adds comments, updates prices)",
    "Sept 5 (Reuters) - Gold retreated on Thursday as investorsbooked profits after the metal rallied to a six-year peak in theprevious session and hopes of a thaw in U.S.-China trade tiesspurred demand for riskier assets.",
    "Spot gold XAU= fell 0.7% to $1,541.20 per ounce as of 0957GMT, having scaled $1,557 on Wednesday, its highest since April2013.",
    "U.S. gold futures GCcv1 dropped 0.7% to $1,549.70 perounce.",
    "\"The fact that they (U.S. and China) have agreed to restarttalks probably has taken a little bit of steam off gold. We sawgold touching a high at $1,557, so it bounced down slightly;could just be an element of profit taking,\" said Philip Newman,a director at Metals Focus.",
    "China'sCommerce Ministry said its trade team will holdtalks with U.S. counterparts in mid-September in preparation forhigh-level negotiations in early October, while the ministryspokesman said Beijing opposes any escalation in the trade war. urn:newsml:reuters.com:*:nL3N25W0JF",
    "European shares rose to a one-month high, with furthersupport coming from a decision by British lawmakers to voteagainst a no-deal Brexit and the withdrawal of an extraditionbill that had triggered months of protests in Hong Kong. MKTS/GLOB",
    "However, \"just because the U.S. and China have agreed torestart talks, it doesn't detract from the extent to which thatdispute has escalated and deepened, adding to a sense thatglobal growth would slow,\" Newman said, adding there is stilltremendous uncertainty about Brexit.",
    "Gold has jumped about 20% this year as the bruising tradewar between the world's two largest economies has sparked fearsof a deceleration in global economic growth and encouragedinterest rate cuts by major central banks around the world.",
    "Analysts also said the likelihood of further easing inmonetary policy and negative yielding debts around the worldprovided support for bullion, keeping it close to its recentsix-year peak.",
    "Federal fund futures FEDWATCH implied traders saw a 89%chance of a 25 basis point rate cut by the U.S. Federal Reservethis month.",
    "Lower interest rates and Treasury yields reduces theopportunity cost of holding non-yielding bullion.",
    "Among other precious metals, silver XAG= eased about 1.9%to $19.19 per ounce, but was near a three-year high of $19.64 ittouched in the previous session.",
    "Platinum XPT= dipped 0.5% to $980.21, having touched itshighest since Feb. 2018 earlier in the session, while palladium XPD= was up 0.2% to $1,555.52 per ounce, holding close to itshighest in more than 1-1/2 months hit on Wednesday. (Reporting by K. Sathya Narayanan in Bengaluru; Editing byElaine Hardcastle) ((Sathya.Narayanan@thomsonreuters.com; within U.S. +1 651 8485832, outside U.S. +91 80 6749 3226/1298; Reuters Messaging:sathya.narayanan.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-05 06:33:00"
}