{
  "url": "https://www.nasdaq.com/article/huaweis-device-business-earned-11-bln-yuan-in-first-half-of-2019--filing-20190912-00209",
  "title": "Huawei's device business earned 11 bln yuan in first half of 2019 - filing - Nasdaq.com",
  "text": [
    "By Sijia Jiang",
    "HONG KONG, Sept 12 (Reuters) - Huawei Technologies' device business, comprising mainly smartphones, made a 11 billion yuan ($1.55 billion) profit in the first half of this year - as much as it earned in all of 2018 - a rare regulatory filing showed.",
    "The Chinese tech giant was put on a trade blacklist by the United States in May, which cut off its access to essential U.S. components and technology. The ban stops U.S. companies such as Alphabet's Google  from doing business with Huawei.",
    "Huawei said last month that, while the impact of the curbs was weaker than previously expected, it would still push the smartphone unit's revenue lower by about $10 billion this year. ",
    "The company had so far disclosed annual profit figures for the entire company and the filing provide a rare window into the growing profit contribution from Huawei's consumer business.",
    "Huawei previously said smartphone shipments in the first half of the year jumped 24% jump to 118 million units, as demand surged from patriotic Chinese buyers amid rising rhetoric in local media that Huawei was being treated unfairly by the United States. ",
    "Its market share rose more than 10 percentage points to 38% in the June quarter in China, the world's biggest smartphone market, according to market research firm Canalys showed.",
    "The new profit numbers were disclosed in a bonds prospectus published on Sept. 11 from Huawei's parent Huawei Investment & Holding Co Ltd, looking to raise up to 20 billion yuan in its first attempt to tap the onshore yuan bond market. ",
    "Profit at Huawei Device (Shenzhen) Ltd, a wholly-owned unit of the parent and a proxy for the behemoth's smartphone business, was 11.2 billion yuan in the first half of 2019, while revenue was 211 billion yuan.",
    "The unit earned the same amount of money in all of 2018 on revenue of 329 billion yuan, according to the prospectus that did not provide numbers for just the first half.",
    "The filing also showed Huawei Technologies Limited, Huawei's main business entity, made a net profit of 30.27 billion yuan and revenue of 353 billion yuan in the first half of 2019.",
    "The group recorded increases in gross margins across all three businesses of carrier network, consumer and enterprise business in the period. Revenue contribution from China rose to 58.12% in the first half, up from 52.02% for the full year of 2018."
  ],
  "published_datetime": "2019-09-12 06:44:00"
}