{
  "url": "https://www.nasdaq.com/article/are-you-looking-for-a-high-growth-dividend-stock-federated-investors-fii-could-be-a-great-choice-cm1210474",
  "title": "Are You Looking for a High-Growth Dividend Stock? Federated Investors (FII) Could Be a Great Choice - Nasdaq.com",
  "text": [
    " Whether it's through stocks, bonds, ETFs, or other types of securities, all investors love seeing their portfolios score big returns. But for income investors, generating consistent cash flow from each of your liquid investments is your primary focus. Cash flow can come from bond interest, interest from other types of investments, and of course, dividends. A dividend is the distribution of a company's earnings paid out to shareholders; it's often viewed by its dividend yield, a metric that measures a dividend as a percent of the current stock price. Many academic studies show tha t dividends  make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.  Federated Investors in Focus  Headquartered in Pittsburgh, Federated Investors (FII) is a Finance stock that has seen a price change of 21.43% so far this year. The one of the nation's largest managers of money market funds is currently shelling out a dividend of $0.27 per share, with a dividend yield of 3.35%. This compares to the Financial - Investment Management industry's yield of 2.79% and the S&P 500's yield of 1.9%. Taking a look at the company's dividend growth, its current annualized dividend of $1.08 is up 1.9% from last year. Over the last 5 years, Federated Investors has increased its dividend 1 times on a year-over-year basis for an average annual increase of 1.75%. Any future dividend growth will depend on both earnings growth and the company's payout ratio; a payout ratio is the proportion of a firm's annual earnings per share that it pays out as a dividend. Federated Investors's current payout ratio is 46%, meaning it paid out 46% of its trailing 12-month EPS as dividend. FII is expecting earnings to expand this fiscal year as well. The Zacks Consensus Estimate for 2019 is $2.47 per share, representing a year-over-year earnings growth rate of 13.30%.  Bottom Line  Investors like dividends for many reasons; they greatly improve stock investing profits, decrease overall portfolio risk, and carry tax advantages, among others. But, not every company offers a quarterly payout. Big, established firms that have more secure profits are often seen as the best dividend options, but it's fairly uncommon to see high-growth businesses or tech start-ups offer their stockholders a dividend. Income investors have to be mindful of the fact that high-yielding stocks tend to struggle during periods of rising interest rates. With that in mind, FII is a compelling investment opportunity. Not only is it a strong dividend play, but the stock currently sits at a Zacks Rank of 3 (Hold).   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Federated Investors, Inc. (FII): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Whether it's through stocks, bonds, ETFs, or other types of securities, all investors love seeing their portfolios score big returns. But for income investors, generating consistent cash flow from each of your liquid investments is your primary focus.",
    "Cash flow can come from bond interest, interest from other types of investments, and of course, dividends. A dividend is the distribution of a company's earnings paid out to shareholders; it's often viewed by its dividend yield, a metric that measures a dividend as a percent of the current stock price. Many academic studies show tha t dividends  make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.",
    " Federated Investors in Focus ",
    "Headquartered in Pittsburgh, Federated Investors (FII) is a Finance stock that has seen a price change of 21.43% so far this year. The one of the nation's largest managers of money market funds is currently shelling out a dividend of $0.27 per share, with a dividend yield of 3.35%. This compares to the Financial - Investment Management industry's yield of 2.79% and the S&P 500's yield of 1.9%.",
    "Taking a look at the company's dividend growth, its current annualized dividend of $1.08 is up 1.9% from last year. Over the last 5 years, Federated Investors has increased its dividend 1 times on a year-over-year basis for an average annual increase of 1.75%. Any future dividend growth will depend on both earnings growth and the company's payout ratio; a payout ratio is the proportion of a firm's annual earnings per share that it pays out as a dividend. Federated Investors's current payout ratio is 46%, meaning it paid out 46% of its trailing 12-month EPS as dividend.",
    "FII is expecting earnings to expand this fiscal year as well. The Zacks Consensus Estimate for 2019 is $2.47 per share, representing a year-over-year earnings growth rate of 13.30%.",
    " Bottom Line ",
    "Investors like dividends for many reasons; they greatly improve stock investing profits, decrease overall portfolio risk, and carry tax advantages, among others. But, not every company offers a quarterly payout.",
    "Big, established firms that have more secure profits are often seen as the best dividend options, but it's fairly uncommon to see high-growth businesses or tech start-ups offer their stockholders a dividend. Income investors have to be mindful of the fact that high-yielding stocks tend to struggle during periods of rising interest rates. With that in mind, FII is a compelling investment opportunity. Not only is it a strong dividend play, but the stock currently sits at a Zacks Rank of 3 (Hold).",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:15:10"
}