{
  "url": "https://www.nasdaq.com/article/stock-market-today-hong-kong-saves-the-day-cm1207651",
  "title": "Stock Market Today: Hong Kong Saves the Day - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Hong Kong's equities and its economy have been struggling over the past few months. If you thought trade tensions between the U.S. and China were high, those were nothing compared to what Hong Kong has been dealing with. Apparently - and fortunately - peace in Hong Kong goes a long way in the world, with global equities catching a nice boost. U.S. stocks enjoyed a solid session in the stock market today as well.",
    "The SPDR S&P 500 ETF (NYSEARCA: SPY ) rose 1.1%, the SPDR Dow Jones Industrial Average (NYSEARCA: DIA ) jumped 1% and PowerShares QQQ ETF (NASDAQ: QQQ ) climbed 1.4%.",
    "Are we in the clear?",
    "The Hang Seng Index rallied 3.9% on the day - its best day since 2011 - after leader Carrie Lam withdrew the controversial extradition bill . The introduction of the bill ignited months of protests and billions around the globe watched the situation unfold. Those protests have intensified in recent weeks, causing many to wonder how it would conclude.",
    "Now we know, and that's one less thing to worry about.",
    "Given the uncertainty that the global economy is in, it's surprising the U.S. and China haven't hammered out a trade deal. The Hong Kong situation seems to be under control and if the trade deal would just come through, investors and business leaders would breathe a sigh of relief.",
    "It would also allow everyone to get back to business as usual. And if China and the U.S. are healthy, then almost everyone else is healthy, too.",
    "On Tuesday we detailed the likeliness of another interest rate cut from the Federal Reserve later this month. The market is fully pricing a cut from the Fed, and that can be seen in more than just forecasts.",
    "What does that mean? For one, silver and gold prices have been erupting . The iShares Silver Trust (NYSEARCA: SLV ) and the SPDR Gold Shares (NYSEARCA: GLD ) both hit new 52-week highs on Wednesday. SLV isn't all that far away from new multi-year highs, while gold is hitting its highest levels since 2013.",
    "While both appear overbought in the short term, there are several catalysts pushing them higher. Worries over the economy and increasing uncertainty always gets the blood going for gold bugs. But so too does central bank easing. The Fed cutting interest rates weakens the dollar. Lower rates and a weakening dollar is good for commodities like silver and gold, so it's no surprise we're seeing new highs lately.",
    "American Eagle Outfitters (NYSE: AEO ) fell nearly 12% on Wednesday to new 52-week lows despite beating on earnings and revenue estimates, while Coupa (NASDAQ: COUP ) rose almost 9% to new highs after crushing estimates and providing robust guidance.",
    "Lumber Liquidators (NYSE: LL ) closed well off its highs of the day, but still climbed 9% after news of a go-private bid surfaced. Shares were as high as 16% on the day, but were unable to hold onto those gains. The news shouldn't be a complete surprise, as the former CEO took an equity stake in the company last month.",
    "Tyson Foods (NYSE: TSN ) was once a relative strength leader in this market. However, its 7.8% fall on Wednesday took it off the go-to list for many bulls. Shares slid after the company announced a reduction to its full-year guidance.",
    "World Wrestling Entertainment (NYSE: WWE ) was initiated with an \"outperform\" rating at Evercore ISI. The analyst also assigned a $90 price target to WWE, implying about 30% upside from the prior close. The analyst says the company has a path to \"unprecedented growth.\"",
    "Roku (NASDAQ: ROKU ) already has a buy-equivalent rating from DA Davidson , but the analysts took it a step further. They raised their $135 to price target to a Street-high $180. Roku is one of InvestorPlace'sTop Stock Trades , and after finishing the session near $169, Davidson's rather bullish upgrade only leaves about 6% upside.",
    "Activision Blizzard (NASDAQ: ATVI ) climbed 4.8% on Wednesday after analysts at BMO Capital Markets upgraded the stock to \"outperform.\" They also gave a big boost to their price target, raising it from $43 to $60. The new target implies over 12% upside despite Wednesday's rally.",
    "Bret Kenwell is the manager and author of Future Blue Chips and is on Twitter @BretKenwell . As of this writing, Bret Kenwell did not hold a position in any of the aforementioned securities.",
    "The post Stock Market Today: Hong Kong Saves the Day appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 04:18:59"
}