{
  "url": "https://www.nasdaq.com/article/cee-fx-eyes-ecb-stimulus-news-forint-regains-some-ground-20190912-00148",
  "title": "CEE FX eyes ECB stimulus news, forint regains some ground - Nasdaq.com",
  "text": [
    "By Radu-Sorin Marinas",
    "BUCHAREST, Sept 12 (Reuters) - Central European currencies firmed early on Thursday with Hungary's forint recovering some ground on hopes of fresh stimulus by the European Central Bank after it hit a record low of 333.46 to the euro the previous day.",
    "The ECB is widely expected to introduce a package of monetary easing and stimulus measures on Thursday to offset the effects of a U.S.-Chinese trade war and global economic slowdown. ",
    "\"The exchange rate could move in the range between 330 and 334 to the euro, but we are preparing for bigger movements between 1300 and 1600 CET (due to the ECB).\"",
    "By 0850 GMT, the forint  rose 0.3% on the day to trade at 331.32 to the euro. The Polish zloty  and the Czech crown  edged up 0.1% to 4.3377 and 25.8850 respectively. The Romanian leu  was flat at 4.7365.",
    "Prime Minister Viktor Orban's cabinet chief Gergely Gulyas said the government had no exchange rate target when asked about the forint's slide. \"I don't think the current exchange rate would give reason for any concerns,\" he said. ",
    "Czech National Bank Vice-Governor Marek Mora said ECB's monetary easing would be an anti-inflationary factor for the Czech economy but that, at this moment, it was better to have a \"wait-and-see\" approach to Czech rates.",
    "Mora added that Czech interest rates should stay steady over the next year to keep domestic inflationary pressures under control even as global central banks shift towards easing rates. ",
    "In Poland, which ended an easing cycle in March 2015, the Monetary Policy Council on Wednesday kept its benchmark rate at a record low of 1.5%, matching expectations in a Reuters poll.",
    "In Romania, the finance ministry plans to sell 600 million lei worth of August 2022 treasury bonds. ",
    "\"Today's auction should attract good demand as the tenors suit a broad range of investors. We expect an average allocation towards the lower end of the secondary market levels of 3.41%. Otherwise, the market will likely wait for the outcome of the European Central Bank meeting today,\" ING said in a note."
  ],
  "published_datetime": "2019-09-12 05:25:00"
}