{
  "url": "https://www.nasdaq.com/article/west-pharmaceutical-wst-hits-fresh-high-is-there-still-room-to-run-cm1208001",
  "title": "West Pharmaceutical (WST) Hits Fresh High: Is There Still Room to Run? - Nasdaq.com",
  "text": [
    " Have you been paying attention to shares of West Pharmaceutical Services (WST)? Shares have been on the move with the stock up 5.9% over the past month. The stock hit a new 52-week high of $148.16 in the previous session. West Pharmaceutical Services has gained 50.9% since the start of the year compared to the 2% move for the Zacks Medical sector and the 13.5% return for the Zacks Medical - Dental Supplies industry.  What's Driving the Outperformance?  The stock has a great record of positive earnings surprises, as it hasn't missed our earnings consensus estimate in any of the last four quarters. In its las t earnings  report on July 25, 2019, West Pharmaceutical reported EPS of $0.89 versus consensus estimate of $0.72. For the current fiscal year, West Pharmaceutical is expected to post earnings of $3.07 per share on $1.82 billion in revenues. This represents a 9.25% change in EPS on a 5.74% change in revenues. For the next fiscal year, the company is expected to earn $3.37 per share on $1.95 billion in revenues. This represents a year-over-year change of 9.93% and 7.27%, respectively.  Valuation Metrics  West Pharmaceutical may be at a 52-week high right now, but what might the future hold for the stock? A key aspect of this question is taking a look at valuation metrics in order to determine if the company is due for a pullback from this level. On this front, we can look at the Zacks Style Scores, as they provide investors with an additional way to sort through stocks (beyond looking at the Zacks Rank of a security). These styles are represented by grades running from A to F in the categories of Value, Growth, and Momentum, while there is a combined VGM Score as well. The idea behind the style scores is to help investors pick the most appropriate Zacks Rank stocks based on their individual investment style. West Pharmaceutical has a Value Score of C. The stock's Growth and Momentum Scores are A and C, respectively, giving the company a VGM Score of B. In terms of its value breakdown, the stock currently trades at 48.2X current fiscal year EPS estimates. On a trailing cash flow basis, the stock currently trades at 34.7X versus its peer group's average of 11X. Additionally, the stock has a PEG ratio of 4.21. This isn't enough to put the company in the top echelon of all stocks we cover from a value perspective.  Zacks Rank  We also need to consider the stock's Zacks Rank, as this supersedes any trend on the style score front. Fortunately, West Pharmaceutical currently has a Zacks Rank of #2 (Buy) thanks to favorable earnings estimate revisions from covering analysts. Since we recommend that investors select stocks carrying Zacks Rank of 1 (Strong Buy) or 2 (Buy) and Style Scores of A or B, it looks as if West Pharmaceutical passes the test. Thus, it seems as though West Pharmaceutical shares could have a bit more room to run in the near term.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  West Pharmaceutical Services, Inc. (WST): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Have you been paying attention to shares of West Pharmaceutical Services (WST)? Shares have been on the move with the stock up 5.9% over the past month. The stock hit a new 52-week high of $148.16 in the previous session. West Pharmaceutical Services has gained 50.9% since the start of the year compared to the 2% move for the Zacks Medical sector and the 13.5% return for the Zacks Medical - Dental Supplies industry.",
    " What's Driving the Outperformance? ",
    "The stock has a great record of positive earnings surprises, as it hasn't missed our earnings consensus estimate in any of the last four quarters. In its las t earnings  report on July 25, 2019, West Pharmaceutical reported EPS of $0.89 versus consensus estimate of $0.72.",
    "For the current fiscal year, West Pharmaceutical is expected to post earnings of $3.07 per share on $1.82 billion in revenues. This represents a 9.25% change in EPS on a 5.74% change in revenues. For the next fiscal year, the company is expected to earn $3.37 per share on $1.95 billion in revenues. This represents a year-over-year change of 9.93% and 7.27%, respectively.",
    " Valuation Metrics ",
    "West Pharmaceutical may be at a 52-week high right now, but what might the future hold for the stock? A key aspect of this question is taking a look at valuation metrics in order to determine if the company is due for a pullback from this level.",
    "On this front, we can look at the Zacks Style Scores, as they provide investors with an additional way to sort through stocks (beyond looking at the Zacks Rank of a security). These styles are represented by grades running from A to F in the categories of Value, Growth, and Momentum, while there is a combined VGM Score as well. The idea behind the style scores is to help investors pick the most appropriate Zacks Rank stocks based on their individual investment style.",
    "West Pharmaceutical has a Value Score of C. The stock's Growth and Momentum Scores are A and C, respectively, giving the company a VGM Score of B.",
    "In terms of its value breakdown, the stock currently trades at 48.2X current fiscal year EPS estimates. On a trailing cash flow basis, the stock currently trades at 34.7X versus its peer group's average of 11X. Additionally, the stock has a PEG ratio of 4.21. This isn't enough to put the company in the top echelon of all stocks we cover from a value perspective.",
    " Zacks Rank ",
    "We also need to consider the stock's Zacks Rank, as this supersedes any trend on the style score front. Fortunately, West Pharmaceutical currently has a Zacks Rank of #2 (Buy) thanks to favorable earnings estimate revisions from covering analysts.",
    "Since we recommend that investors select stocks carrying Zacks Rank of 1 (Strong Buy) or 2 (Buy) and Style Scores of A or B, it looks as if West Pharmaceutical passes the test. Thus, it seems as though West Pharmaceutical shares could have a bit more room to run in the near term.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:35:07"
}