{
  "url": "https://www.nasdaq.com/article/streaming-news-eros-now-stock-soars-on-oneplus-tv-deal-cm1206936",
  "title": "Streaming News: Eros Now Stock Soars on OnePlus TV Deal - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Streaming news for Tuesday includes a deal that has Eros Now stock on the rise.",
    "Eros International (NYSE: EROS ) has signed a deal with OnePlus that will have its content appearing on OnePlus TV in India. The company does not reveal the financial details of the deal that brings Eros Now content to OnePlus TV.",
    "What this means for customers is that they now have easy access to content from Eros Now. They will be able to use the interface found on OnePlus TV sets to search through a catalog of films and shows from Eros Now. It will also allow OnePlus TV customers to view the content in HD and 4K. This does require a TV with these resolutions.",
    "The streaming news comes as Eros International looks to break into the over the internet (OTT) avenue of content delivery. This has been growing more lately as customers continue to cut cords and skip out on traditional methods, such as cable and satellite.",
    "\"Today we are at a cusp of a revolution in India and are excited to partner with Eros Now for our upcoming OnePlus TV,\" Vikas Agarwal, General Manager for OnePlus India, says in a statement . \"We envisage this as a forward-thinking partnership which will emerge as the next big deal amidst the entertainment and advanced tech and telecom industry.\"",
    "EROS stock was up 7% as of Tuesday afternoon. However, the stock is down 79% since the start of the year.",
    "As of this writing, William White did not hold a position in any of the aforementioned securities.",
    "The post Streaming News: Eros Now Stock Soars on OnePlus TV Deal appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:01:08"
}