{
  "url": "https://www.nasdaq.com/article/pioneer-pxd-can-drill-its-best-inventory-for-another-decade-cm1208140",
  "title": "Pioneer (PXD) Can Drill Its Best Inventory for Another Decade - Nasdaq.com",
  "text": [
    "Pioneer Natural Resources CompanyPXD recently showcased its Permian Basin strength at the Barclays CEO Energy-Power Conference 2019, held in New York. The CEO of the company, Scott Sheffield said that the company has roughly 10 more years of drilling inventory in the region, where it can keep producing without a deceleration in the current output pace. Moreover, given its acreages in the prolific basin, the company does not have to turn to less productive sites.",
    "Unlike many other operators in the Permian Basin, Pioneer steered clear of downspacing issues, primarily due to the amount of choice acreage it has in the region. Downspacing is the method of drilling wells closer together in a particular area to maximize output. The pure-play Permian basin producer has operations across 680,000 net acres in the Midland Basin. While its peers have well spacing of less than or equal to 600 feet, Pioneer's wells are situated 850 feet away from each other.",
    "In 2019, the company intends to drill and produce 265-290 wells in the region compared with 270 wells drilled last year. Moreover, the upstream energy player expects Permian production through 2019 in the band of 320-335 thousand barrels of oil equivalent per day (MBoE/D), higher than 319.9 MBoE/D a year ago.",
    "Pioneer expects to operate an average of 21-23 rigs this year, from which it will likely generate free cash flow of $600 million. This is expected to help the company to continue increasing quarterly dividends. Notably, it has managed to increase annualized dividend by roughly 2100% over the past few years. Markedly, of the authorized $2-billion share buyback program, the company has executed $528 million of repurchases.",
    "Price Performance",
    "Irving, TX-based Pioneer has lost 5.6% year to date compared with 20.8% decline of the industry it belongs to.",
    "Zacks Rank and Stocks to Consider",
    "Currently, Pioneer carries a Zacks Rank #3 (Hold). Some better-ranked players in the energy space are National Oilwell Varco, Inc. NOV , Dril-Quip, Inc. DRQ and NuStar Energy L.P. NS , each holding a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.",
    "National Oilwell's 2019 earnings per share are expected to rise 75% year over year.",
    "Dril-Quip's 2019 earnings per share are expected to rise 131.8% year over year.",
    "NuStar Energy's third-quarter 2019 earnings per share are expected to gain more than 107% year over year.",
    "It's Illegal in 42 States, But Investors Will Make Billions Legally",
    "In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    "That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:38:00"
}