{
  "url": "https://www.nasdaq.com/article/why-teladoc-tdoc-stock-is-poised-to-capture-the-future-of-healthcare-cm1210818",
  "title": "Why Teladoc (TDOC) Stock is Poised to Capture the Future of Healthcare - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "There's a big shift going on in the healthcare industry. I'm sure you've seen evidence of it yourself. But today, I want to make sure it's on your radar as an investment . My pick in this area, Teladoc  (NYSE: TDOC ) stock, is starting to take off, and once you see why, you'll want to be on board, too.",
    "Healthcare companies are finally joining us here in the 21st century… by using technology to offer us better care, more efficiently.",
    "There are all sorts of advancements being made, from DNA sequencing to \"liquid biopsies\" (which can detect disease biomarkers with one little prick). But the one I find most exciting right now is telemedicine . Rather than getting stuck in line, waiting to see a doctor, these days you can often just log on (or get on the phone) for a \"virtual checkup.\"",
    "I'm a bit of a hypochondriac, so I'm never hesitant to go to urgent care if I'm concerned about something - but I hate sitting in a crowded room with people coughing on me. I'm sure you do, too. Telemedicine is perfect for me, and I've loved it every time I've used it.",
    "Aside from convenience, I believe telemedicine could have a big impact on things like mental health. When people are able to see a therapist or psychiatrist virtually, it makes it much easier for people to get treatment.",
    "Those are just two anecdotal examples. But as the trend takes hold, more data becomes available. Last week, UnitedHealth Group (NYSE: UNH ) published the following research:",
    "So far, the results are encouraging: From 2014 to 2018, virtual care usage is up 624% !",
    "As for United Healthcare itself, its experience with telemedicine reinforces my expectation that this trend is here to stay.",
    "United Healthcare launched \"Virtual Visits\" in 2016. Of roughly 500,000 customers to date, \"most are between the ages of 30 to 34 and are primarily women.\"",
    "And this generation - the millennials - is now the largest living adult generation, having just surpassed even the baby boomers.",
    "This demographic shift is one I have a close eye on. In fact, I just devoted my September issue of Investment Opportunities to it.",
    "Millennials are now reaching the point where they're beginning to form families and buy houses. They may have waited longer than their forerunners, but they will have a huge impact as they dominate the economy for the next decade or more.",
    "And if millennials prefer virtual checkups, then this really is the future of healthcare.",
    "At the end of its report, United Healthcare announced that its new, nationwide provider of Virtual Visits is Teladoc.",
    "But Teladoc has actually been around since 2002. And today, it's the leading provider of telehealth medical visits in the United States. The company boasts being able to connect you with a licensed doctor in under 10 minutes… whether it's via the phone, internet, or mobile app.",
    "Shares got hit on news that Teladoc's contract ran out with the U.S. Defense Health Agency. I wasn't too worried, though, as I explained in Investment Opportunities - where we've owned TDOC stock for a year and a half.",
    "Teladoc is already the leader in the telehealth industry, with well over 50% of the market share in the United States. If it can keep growing at this pace, the number of visits could grow by 10-fold in the coming years - and revenue gains should keep pace.",
    "Already in the most recent quarter, revenue gained 38% quarter-over-quarter to $130.3 million. Visit volumes soared 70% to 908,000, while U.S. paid memberships grew by 100,000 to 26.8 million.",
    "Sure enough, the stock has begun to surge again after the United Healthcare deal was announced. After all, the Military Health System was a 9.4 million-person market - but United Healthcare is a 49.5 million-person market!",
    "TDOC stock has popped more than 50% from its lows late last year. It is still under my recommended buy price in Investment Opportunities … but I don't expect it to stay that way for long. Once more investors catch on to the virtual-medicine mega-trend - and identify Teladoc as the industry leader - TDOC stock will realize plenty more upside.",
    "And while Teladoc is a great direct play on personalized medicine…",
    "Wearable devices are helping people like me take control of our health. The Apple Watch is actually an approved medical device. It can alert you to a low heart rate, detect your heart rhythm, and even conduct an ECG (or EKG). It can also make an emergency call for you - and it can do it in 150 different countries with the new Series 5 announced today.",
    "It's no wonder Apple (NASDAQ: AAPL ) would want to move into this market: Analysts are predicting 14X growth in just 10 years!",
    "All of these devices need to be powered . And when we're talking about something as crucial as medical devices - then we really need a battery that's more reliable than the current technology .",
    "It blows my mind that we are STILL relying on battery technology that was created for Sony camcorders in the 1980s. But the next generation is in the works. And these batteries will be more powerful - and much safer.",
    "I've got everything you need to know, and I can show you how to invest now. Click here for my free briefing.",
    "Matthew McCall left Wall Street to actually help investors - by getting them into the world's biggest, most revolutionary trends BEFORE anyone else. The power of being \"first\" gave Matt's readers the chance to bank +2,438% in Stamps.com (STMP), +1,523% in Ulta Beauty (ULTA) and +1,044% in Tesla (TSLA), just to name a few.  Click here to see what Matt has up his sleeve now .",
    "The post Why Teladoc (TDOC) Stock is Poised to Capture the Future of Healthcare appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 04:02:20"
}