{
  "url": "https://www.nasdaq.com/article/as-risk-appetite-returns-brexit-and-stats-keep-the-gbp-and-usd-in-focus-cm1207680",
  "title": "As Risk Appetite Returns, Brexit and Stats Keep the GBP and USD in Focus - Nasdaq.com",
  "text": [
    "It was a relatively quiet day on the economic calendar through the Asian session this morning. July trade figures out of Australia provided the Aussie Dollar with direction in the early part of the day.",
    "Outside of the stats, risk appetite continued to build as geopolitical risks abated further. On the trade front, China announced that trade talks will resume next month, providing further support to the markets.",
    "The trade surplus narrowed from a revised A$7.977bn to A$7.269bn in July. Economists had forecast a narrowing to A$7.200bn. According to the ABS ,",
    "The Aussie Dollar moved from $0.68121 to $0.68153 upon release of the survey. At the time of writing, the Aussie Dollar was up by 0.25% to $0.6814",
    "At the time of writing, the Kiwi Dollar was up by 0.16% to $0.6371, while the Japanese Yen was down by 0.23% to ¥106.64 against the U.S Dollar.",
    "It's a relatively quiet day ahead on the economic calendar . German factory order figures for July will provide the EUR with direction ahead of the European open.",
    "Outside of the numbers, while an easing in geopolitical risk remains positive for the EUR in the early part of the day, hopes of progress on trade talks would limit any upside.",
    "At the time of writing, the EUR was down by 0.04% to $1.1031.",
    "It's a quiet day ahead on the data front, with no material stats due out of the UK to provide the Pound with direction.",
    "The lack of stats will place the market focus squarely on the UK Parliament. On Wednesday, Johnson struggled to convince MPs to support a snap general election. A number of scenarios remain that could still result in Britain leaving the EU without a deal.",
    "A second Pound rally could come should the House of Lords push through the Bill to block a no-deal Brexit. This would still require the EU to approve an extension, however, which is not a sure thing.",
    "At the time of writing, the Pound was down by 0.13% to $1.2237.",
    "It's a particularly busy day ahead on the economic calendar . Key stats due out of the U.S include August ADP nonfarm employment change figures, July factory orders, and August's ISM Non-Manufacturing PMI.",
    "Barring dire numbers, the weekly jobless claims, 2 nd quarter productivity and unit labor cost figures and the finalized Markit service PMI will likely have a relatively muted effect on the Dollar.",
    "Outside of the numbers, news of trade talks resuming next month provided some support early on.",
    "At the time of writing, the Dollar Spot Index was down by 0.02% to 98.434.",
    "It's a quiet day ahead on the economic calendar , with no material stats due out of Canada.",
    "A lack of stats will leave the Loonie in the hands of market risk appetite through the day. Late in the session, the weekly EIA crude oil inventory figures will also influence.",
    "The Loonie was down by 0.05% at C$1.3231, against the U.S Dollar, at the time of writing.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:59:57"
}