{
  "url": "https://www.nasdaq.com/article/stocks-hit-onemonth-highs-on-news-of-uschina-trade-talks-20190905-00777",
  "title": "Stocks hit one-month highs on news of U.S.-China trade talks - Nasdaq.com",
  "text": [
    "By Stephen Culp",
    "NEW YORK, Sept 5 (Reuters) - Stocks hit one-month highs worldwide on Thursday as improved risk appetite led investors away from safe-haven assets such as bonds and gold on renewed hope for progress in U.S.-China trade negotiations and upbeat U.S. economic data.",
    "The announcement that top negotiators from the United States and China will meet early October in Washington raised hopes of a possible resolution to the two countries' brutal trade war that has wreaked havoc on the global economy. ",
    "\"We're in a headline-driven market and the headlines over the last couple of days have been pretty positive,\" Tuz added.",
    "U.S. private payrolls increased in August at their fastest pace in four months, according to ADP, blowing past analyst estimates ahead of Friday's more comprehensive jobs report from the Labor Department. ",
    "A separate report showed the U.S. services industry rebounded last month to its fastest expansion since February, bouncing back from a three-year low, according to the Institute for Supply Management's non-manufacturing purchasing managers index (PMI). ",
    "The Dow Jones Industrial Average  rose 446.4 points, or 1.69%, to 26,801.87, the S&P 500  gained 41.5 points, or 1.41%, to 2,979.28 and the Nasdaq Composite  added 138.85 points, or 1.74%, to 8,115.73. ",
    "European and emerging markets stocks jumped on hopes that next month's U.S.-China trade talks would move the world's two largest economies closer toward ending their cantankerous dispute, which has pushed major economies toward recession. ",
    "The pan-European STOXX 600 index  rose 0.63% and MSCI's gauge of stocks across the globe  gained 1.17%.",
    "Emerging market stocks rose 1.25%. MSCI's broadest index of Asia-Pacific shares outside Japan  closed 1.06% higher, while Japan's Nikkei  rose 2.12%. ",
    "ADP's private employment report helped U.S. Treasury yields extend their earlier gains. ",
    "Benchmark 10-year notes  last fell 1-4/32 in price to yield 1.5857%, from 1.459% late on Wednesday.",
    "The 30-year bond  last fell 2-27/32 in price to yield 2.0797%, from 1.957% late on Wednesday.",
    "The dollar held its losses against a basket of world currencies following the upbeat U.S. jobs data. Earlier news of a fresh round of trade talks weighed on the dollar and the yen while boosting riskier currencies.",
    "The dollar index  fell 0.07%, with the euro  up 0.06% to $1.104.",
    "The Japanese yen weakened 0.61% versus the greenback at 107.06 per dollar, while Sterling  was last trading at $1.2321, up 0.58% on the day.",
    "The tide of trade optimism also lifted oil prices, but the gain was capped by a report showing an unexpected increase in U.S. crude inventories. ",
    "U.S. crude  rose 1.88% to $57.32 per barrel and Brent  was last at $61.94, up 2.04% on the day. ",
    "Gold retreated from its six-year peak as investors shifted to riskier assets.",
    "Spot gold  dropped 2.5% to $1,513.84 an ounce.",
    "Copper  rose 1.88% to $5,856.00 a tonne.",
    "Three-month aluminum on the London Metal Exchange  rose 0.56% to $1,785.00 a tonne.",
    "\nGRAPHIC-Global assets in 2019",
    "\nGRAPHIC-World FX rates in 2019"
  ],
  "published_datetime": "2019-09-05 11:10:00"
}