{
  "url": "https://www.nasdaq.com/article/heres-why-fly-leasing-fly-is-a-great-momentum-stock-to-buy-cm1210405",
  "title": "Here's Why Fly Leasing (FLY) is a Great Momentum Stock to Buy - Nasdaq.com",
  "text": [
    " Momentum investing is all about the idea of following a stock's recent trend, which can be in either direction. In the 'long' context, investors will essentially be \"buying high, but hoping to sell even higher.\" And for investors following this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving in that direction. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades. Even though momentum is a popular stock characteristic, it can be tough to define. Debate surrounding which are the best and worst metrics to focus on is lengthy, but the Zacks Momentum Style Score, part of the Zacks Style Scores  , helps address this issue for us. Below, we take a look at Fly Leasing (FLY)  , a company that currently holds a Momentum Style Score of B. We also talk about price change and earnings estimate revisions, two of the main aspects of the Momentum Style Score. It's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Fly Leasing currently has a Zacks Rank of #2 (Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of A or B outperform the market over the following one-month period. You can see the current list of Zacks #1 Rank Stocks here >>>   Set to Beat the Market?  Let's discuss some of the components of the Momentum Style Score for FLY that show why this commercial aircraft leasing company shows promise as a solid momentum pick. Looking at a stock's short-term price activity is a great way to gauge if it has momentum, since this can reflect both the current interest in a stock and if buyers or sellers have the upper hand at the moment. It is also useful to compare a security to its industry, as this can help investors pinpoint the top companies in a particular area. For FLY, shares are up 4.11% over the past week while the Zacks Transportation - Equipment and Leasing industry is up 1.45% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 24.22% compares favorably with the industry's 9.42% performance as well. Considering longer term price metrics, like performance over the last three months or year, can be advantageous as well. Over the past quarter, shares of Fly Leasing have risen 22.61%, and are up 43.19% in the last year. On the other hand, the S&P 500 has only moved 3.69% and 5.5%, respectively. Investors should also take note of FLY's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. Right now, FLY is averaging 372,007 shares for the last 20 days.  Earnings Outlook  The Zacks Momentum Style Score also takes into account trends in estimate revisions, in addition to price changes. Please note that estimate revision trends remain at the core of Zacks Rank as well. A nice path here can help show promise, and we have recently been seeing that with FLY. Over the past two months, 3 earnings estimates moved higher compared to none lower for the full year. These revisions helped boost FLY's consensus estimate, increasing from $3.93 to $5.78 in the past 60 days. Looking at the next fiscal year, 2 estimates have moved upwards while there have been 1 downward revision in the same time period.  Bottom Line  Taking into account all of these elements, it should come as no surprise that FLY is a #2 (Buy) stock with a Momentum Score of B. If you've been searching for a fresh pick that's set to rise in the near-term, make sure to keep Fly Leasing on your short list.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Fly Leasing Limited (FLY): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Momentum investing is all about the idea of following a stock's recent trend, which can be in either direction. In the 'long' context, investors will essentially be \"buying high, but hoping to sell even higher.\" And for investors following this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving in that direction. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades.",
    "Even though momentum is a popular stock characteristic, it can be tough to define. Debate surrounding which are the best and worst metrics to focus on is lengthy, but the Zacks Momentum Style Score, part of the Zacks Style Scores  , helps address this issue for us.",
    "Below, we take a look at Fly Leasing (FLY)  , a company that currently holds a Momentum Style Score of B. We also talk about price change and earnings estimate revisions, two of the main aspects of the Momentum Style Score.",
    "It's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Fly Leasing currently has a Zacks Rank of #2 (Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of A or B outperform the market over the following one-month period.",
    "You can see the current list of Zacks #1 Rank Stocks here >>> ",
    " Set to Beat the Market? ",
    "Let's discuss some of the components of the Momentum Style Score for FLY that show why this commercial aircraft leasing company shows promise as a solid momentum pick.",
    "Looking at a stock's short-term price activity is a great way to gauge if it has momentum, since this can reflect both the current interest in a stock and if buyers or sellers have the upper hand at the moment. It is also useful to compare a security to its industry, as this can help investors pinpoint the top companies in a particular area.",
    "For FLY, shares are up 4.11% over the past week while the Zacks Transportation - Equipment and Leasing industry is up 1.45% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 24.22% compares favorably with the industry's 9.42% performance as well.",
    "Considering longer term price metrics, like performance over the last three months or year, can be advantageous as well. Over the past quarter, shares of Fly Leasing have risen 22.61%, and are up 43.19% in the last year. On the other hand, the S&P 500 has only moved 3.69% and 5.5%, respectively.",
    "Investors should also take note of FLY's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. Right now, FLY is averaging 372,007 shares for the last 20 days.",
    " Earnings Outlook ",
    "The Zacks Momentum Style Score also takes into account trends in estimate revisions, in addition to price changes. Please note that estimate revision trends remain at the core of Zacks Rank as well. A nice path here can help show promise, and we have recently been seeing that with FLY.",
    "Over the past two months, 3 earnings estimates moved higher compared to none lower for the full year. These revisions helped boost FLY's consensus estimate, increasing from $3.93 to $5.78 in the past 60 days. Looking at the next fiscal year, 2 estimates have moved upwards while there have been 1 downward revision in the same time period.",
    " Bottom Line ",
    "Taking into account all of these elements, it should come as no surprise that FLY is a #2 (Buy) stock with a Momentum Score of B. If you've been searching for a fresh pick that's set to rise in the near-term, make sure to keep Fly Leasing on your short list.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:00:08"
}