{
  "url": "https://www.nasdaq.com/article/wendys-wen-is-a-great-momentum-stock-should-you-buy-cm1207303",
  "title": "Wendy's (WEN) is a Great Momentum Stock: Should You Buy? - Nasdaq.com",
  "text": [
    " Momentum investing revolves around the idea of following a stock's recent trend in either direction. In the 'long' context, investors will be essentially be \"buying high, but hoping to sell even higher.\" With this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving that way. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades. Even though momentum is a popular stock characteristic, it can be tough to define. Debate surrounding which are the best and worst metrics to focus on is lengthy, but the Zacks Momentum Style Score, part of the Zacks Style Scores  , helps address this issue for us. Below, we take a look at Wendy's (WEN)  , which currently has a Momentum Style Score of B. We also discuss some of the main drivers of the Momentum Style Score, like price change and earnings estimate revisions. It's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Wendy's currently has a Zacks Rank of #2 (Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of A or B outperform the market over the following one-month period. You can see the current list of Zacks #1 Rank Stocks here >>>   Set to Beat the Market?  In order to see if WEN is a promising momentum pick, let's examine some Momentum Style elements to see if this hamburger chain holds up. Looking at a stock's short-term price activity is a great way to gauge if it has momentum, since this can reflect both the current interest in a stock and if buyers or sellers have the upper hand at the moment. It is also useful to compare a security to its industry, as this can help investors pinpoint the top companies in a particular area. For WEN, shares are up 4.36% over the past week while the Zacks Retail - Restaurants industry is up 0.46% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 20.55% compares favorably with the industry's 0.16% performance as well. Considering longer term price metrics, like performance over the last three months or year, can be advantageous as well. Shares of Wendy's have increased 12.3% over the past quarter, and have gained 24.69% in the last year. On the other hand, the S&P 500 has only moved 6.44% and 2.13%, respectively. Investors should also pay attention to WEN's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. WEN is currently averaging 3,263,216 shares for the last 20 days.  Earnings Outlook  The Zacks Momentum Style Score also takes into account trends in estimate revisions, in addition to price changes. Please note that estimate revision trends remain at the core of Zacks Rank as well. A nice path here can help show promise, and we have recently been seeing that with WEN. Over the past two months, 7 earnings estimates moved higher compared to none lower for the full year. These revisions helped boost WEN's consensus estimate, increasing from $0.63 to $0.64 in the past 60 days. Looking at the next fiscal year, 4 estimates have moved upwards while there have been 1 downward revision in the same time period.  Bottom Line  Given these factors, it shouldn't be surprising that WEN is a #2 (Buy) stock and boasts a Momentum Score of B. If you're looking for a fresh pick that's set to soar in the near-term, make sure to keep Wendy's on your short list.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  The Wendy's Company (WEN): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Momentum investing revolves around the idea of following a stock's recent trend in either direction. In the 'long' context, investors will be essentially be \"buying high, but hoping to sell even higher.\" With this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving that way. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades.",
    "Even though momentum is a popular stock characteristic, it can be tough to define. Debate surrounding which are the best and worst metrics to focus on is lengthy, but the Zacks Momentum Style Score, part of the Zacks Style Scores  , helps address this issue for us.",
    "Below, we take a look at Wendy's (WEN)  , which currently has a Momentum Style Score of B. We also discuss some of the main drivers of the Momentum Style Score, like price change and earnings estimate revisions.",
    "It's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Wendy's currently has a Zacks Rank of #2 (Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of A or B outperform the market over the following one-month period.",
    "You can see the current list of Zacks #1 Rank Stocks here >>> ",
    " Set to Beat the Market? ",
    "In order to see if WEN is a promising momentum pick, let's examine some Momentum Style elements to see if this hamburger chain holds up.",
    "Looking at a stock's short-term price activity is a great way to gauge if it has momentum, since this can reflect both the current interest in a stock and if buyers or sellers have the upper hand at the moment. It is also useful to compare a security to its industry, as this can help investors pinpoint the top companies in a particular area.",
    "For WEN, shares are up 4.36% over the past week while the Zacks Retail - Restaurants industry is up 0.46% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 20.55% compares favorably with the industry's 0.16% performance as well.",
    "Considering longer term price metrics, like performance over the last three months or year, can be advantageous as well. Shares of Wendy's have increased 12.3% over the past quarter, and have gained 24.69% in the last year. On the other hand, the S&P 500 has only moved 6.44% and 2.13%, respectively.",
    "Investors should also pay attention to WEN's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. WEN is currently averaging 3,263,216 shares for the last 20 days.",
    " Earnings Outlook ",
    "The Zacks Momentum Style Score also takes into account trends in estimate revisions, in addition to price changes. Please note that estimate revision trends remain at the core of Zacks Rank as well. A nice path here can help show promise, and we have recently been seeing that with WEN.",
    "Over the past two months, 7 earnings estimates moved higher compared to none lower for the full year. These revisions helped boost WEN's consensus estimate, increasing from $0.63 to $0.64 in the past 60 days. Looking at the next fiscal year, 4 estimates have moved upwards while there have been 1 downward revision in the same time period.",
    " Bottom Line ",
    "Given these factors, it shouldn't be surprising that WEN is a #2 (Buy) stock and boasts a Momentum Score of B. If you're looking for a fresh pick that's set to soar in the near-term, make sure to keep Wendy's on your short list.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:00:08"
}