{
  "url": "https://www.nasdaq.com/article/yields-rise-on-trade-hopes-and-ahead-of-us-data-feds-powell-20190905-00929",
  "title": "Yields rise on trade hopes and ahead of U.S. data, Fed's Powell - Nasdaq.com",
  "text": [
    "By Kate Duguid",
    "NEW YORK, Sept 5 (Reuters) - Treasury yields were higher on Thursday following news that the United States and China had agreed to hold trade talks in October and ahead of U.S. employment data for August and remarks from Federal Reserve Chair Jerome Powell, both on Friday. ",
    "Across maturities, yields were about 10 basis points higher, with the 10-year yield  at 1.564%, up 10.5 basis points. The two-year yield  was up 10.6 basis points to 1.540%.",
    "\"It all started last night with the headline that there would be U.S.-China talks in October. Basically it sent a risk-on tone around the globe. Even as we hit multi-year low yields in the 2s, 3s and 5s yesterday - the market is just under heavy pressure as all assets are at least seen as a short-term positive,\" said Justin Lederer, Treasury analyst and trader at Cantor Fitzgerald.  ",
    "\"Does it last? We'll see what headline events ultimately occur in the next few days, weeks, month.\"",
    "The talks were agreed to in a phone call between Chinese Vice Premier Liu He and U.S. Trade Representative Robert Lighthizer and U.S. Treasury Secretary Steven Mnuchin, China's commerce ministry said in a statement on its website. ",
    "Some analysts were skeptical that the promise of new talks reflected increased chances of a trade deal. But the market reacted as it did because the \"flight to quality was a little overdone with the last escalation of trade tensions and now that has been reversed this time around,\" said Paula Solanes, senior portfolio manager at Silicon Valley Bank.",
    "The rise in U.S. Treasury yields was on top of an earlier increase as payroll processor ADP said U.S. private employment grew at its fastest pace in four months in August, beating analysts' expectations. ",
    "The market on Friday will focus on payrolls data for August, as well as a speech from Powell in Zurich on the economic outlook. \"I think that they're trying to carefully position themselves, managing their dual mandate, the unemployment rate, inflation - which is giving them room to cut if necessary - but then also not necessarily feeding too much into trade policy because it is this exogenous factor,\" said Solanes."
  ],
  "published_datetime": "2019-09-05 02:25:00"
}