{
  "url": "https://www.nasdaq.com/article/netflix-nflx-gains-but-lags-market-what-you-should-know-cm1210796",
  "title": "Netflix (NFLX) Gains But Lags Market: What You Should Know - Nasdaq.com",
  "text": [
    " Netflix (NFLX) closed the most recent trading day at $288.27, moving +0.1% from the previous trading session. The stock lagged the S&P 500's daily gain of 0.72%. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%. Prior to today's trading, shares of the internet video service had lost 7.78% over the past month. This has lagged the Consumer Discretionary sector's gain of 2.9% and the S&P 500's gain of 2.25% in that time. Wall Street will be looking for positivity from NFLX as it approaches its nex t earnings  report date. The company is expected to report EPS of $1.05, up 17.98% from the prior-year quarter. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $5.25 billion, up 31.34% from the year-ago period. For the full year, our Zacks Consensus Estimates are projecting earnings of $3.26 per share and revenue of $20.22 billion, which would represent changes of +21.64% and +28.01%, respectively, from the prior year. It is also important to note the recent changes to analyst estimates for NFLX. Recent revisions tend to reflect the latest near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.75% lower within the past month. NFLX is currently a Zacks Rank #3 (Hold). Looking at its valuation, NFLX is holding a Forward P/E ratio of 88.47. Its industry sports an average Forward P/E of 16.78, so we one might conclude that NFLX is trading at a premium comparatively. Meanwhile, NFLX's PEG ratio is currently 2.95. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. NFLX's industry had an average PEG ratio of 1.52 as of yesterday's close. The Broadcast Radio and Television industry is part of the Consumer Discretionary sector. This industry currently has a Zacks Industry Rank of 206, which puts it in the bottom 20% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Netflix, Inc. (NFLX): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Netflix (NFLX) closed the most recent trading day at $288.27, moving +0.1% from the previous trading session. The stock lagged the S&P 500's daily gain of 0.72%. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%.",
    "Prior to today's trading, shares of the internet video service had lost 7.78% over the past month. This has lagged the Consumer Discretionary sector's gain of 2.9% and the S&P 500's gain of 2.25% in that time.",
    "Wall Street will be looking for positivity from NFLX as it approaches its nex t earnings  report date. The company is expected to report EPS of $1.05, up 17.98% from the prior-year quarter. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $5.25 billion, up 31.34% from the year-ago period.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of $3.26 per share and revenue of $20.22 billion, which would represent changes of +21.64% and +28.01%, respectively, from the prior year.",
    "It is also important to note the recent changes to analyst estimates for NFLX. Recent revisions tend to reflect the latest near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.",
    "The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.75% lower within the past month. NFLX is currently a Zacks Rank #3 (Hold).",
    "Looking at its valuation, NFLX is holding a Forward P/E ratio of 88.47. Its industry sports an average Forward P/E of 16.78, so we one might conclude that NFLX is trading at a premium comparatively.",
    "Meanwhile, NFLX's PEG ratio is currently 2.95. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. NFLX's industry had an average PEG ratio of 1.52 as of yesterday's close.",
    "The Broadcast Radio and Television industry is part of the Consumer Discretionary sector. This industry currently has a Zacks Industry Rank of 206, which puts it in the bottom 20% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:45:24"
}