{
  "url": "https://www.nasdaq.com/article/why-regency-centers-reg-is-a-great-dividend-stock-right-now-cm1210475",
  "title": "Why Regency Centers (REG) is a Great Dividend Stock Right Now - Nasdaq.com",
  "text": [
    " Getting big returns from financial portfolios, whether through stocks, bonds, ETFs, other securities, or a combination of all, is an investor's dream. But for income investors, generating consistent cash flow from each of your liquid investments is your primary focus. While cash flow can come from bond interest or interest from other types of investments, income investors hone in on dividends. A dividend is the distribution of a company's earnings paid out to shareholders; it's often viewed by its dividend yield, a metric that measures a dividend as a percent of the current stock price. Many academic studies show tha t dividends  make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.  Regency Centers in Focus  Based in Jacksonville, Regency Centers (REG) is in the Finance sector, and so far this year, shares have seen a price change of 16.26%. The shopping center real estate investment trust is currently shelling out a dividend of $0.58 per share, with a dividend yield of 3.43%. This compares to the REIT and Equity Trust - Retail industry's yield of 5.36% and the S&P 500's yield of 1.9%. Looking at dividend growth, the company's current annualized dividend of $2.34 is up 5.4% from last year. Over the last 5 years, Regency Centers has increased its dividend 5 times on a year-over-year basis for an average annual increase of 4.69%. Future dividend growth will depend on earnings growth as well as payout ratio, which is the proportion of a company's annual earnings per share that it pays out as a dividend. Right now, Regency Centers's payout ratio is 60%, which means it paid out 60% of its trailing 12-month EPS as dividend. Looking at this fiscal year, REG expects solid earnings growth. The Zacks Consensus Estimate for 2019 is $3.84 per share, which represents a year-over-year growth rate of 0.26%.  Bottom Line  Investors like dividends for many reasons; they greatly improve stock investing profits, decrease overall portfolio risk, and carry tax advantages, among others. But, not every company offers a quarterly payout. Big, established firms that have more secure profits are often seen as the best dividend options, but it's fairly uncommon to see high-growth businesses or tech start-ups offer their stockholders a dividend. During periods of rising interest rates, income investors must be mindful that high-yielding stocks tend to struggle. With that in mind, REG is a compelling investment opportunity. Not only is it a strong dividend play, but the stock currently sits at a Zacks Rank of 3 (Hold).   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Regency Centers Corporation (REG): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Getting big returns from financial portfolios, whether through stocks, bonds, ETFs, other securities, or a combination of all, is an investor's dream. But for income investors, generating consistent cash flow from each of your liquid investments is your primary focus.",
    "While cash flow can come from bond interest or interest from other types of investments, income investors hone in on dividends. A dividend is the distribution of a company's earnings paid out to shareholders; it's often viewed by its dividend yield, a metric that measures a dividend as a percent of the current stock price. Many academic studies show tha t dividends  make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.",
    " Regency Centers in Focus ",
    "Based in Jacksonville, Regency Centers (REG) is in the Finance sector, and so far this year, shares have seen a price change of 16.26%. The shopping center real estate investment trust is currently shelling out a dividend of $0.58 per share, with a dividend yield of 3.43%. This compares to the REIT and Equity Trust - Retail industry's yield of 5.36% and the S&P 500's yield of 1.9%.",
    "Looking at dividend growth, the company's current annualized dividend of $2.34 is up 5.4% from last year. Over the last 5 years, Regency Centers has increased its dividend 5 times on a year-over-year basis for an average annual increase of 4.69%. Future dividend growth will depend on earnings growth as well as payout ratio, which is the proportion of a company's annual earnings per share that it pays out as a dividend. Right now, Regency Centers's payout ratio is 60%, which means it paid out 60% of its trailing 12-month EPS as dividend.",
    "Looking at this fiscal year, REG expects solid earnings growth. The Zacks Consensus Estimate for 2019 is $3.84 per share, which represents a year-over-year growth rate of 0.26%.",
    " Bottom Line ",
    "Investors like dividends for many reasons; they greatly improve stock investing profits, decrease overall portfolio risk, and carry tax advantages, among others. But, not every company offers a quarterly payout.",
    "Big, established firms that have more secure profits are often seen as the best dividend options, but it's fairly uncommon to see high-growth businesses or tech start-ups offer their stockholders a dividend. During periods of rising interest rates, income investors must be mindful that high-yielding stocks tend to struggle. With that in mind, REG is a compelling investment opportunity. Not only is it a strong dividend play, but the stock currently sits at a Zacks Rank of 3 (Hold).",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:15:10"
}