{
  "url": "https://www.nasdaq.com/article/snap-snap-outpaces-stock-market-gains-what-you-should-know-cm1210795",
  "title": "Snap (SNAP) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Snap (SNAP) closed at $15.31 in the latest trading session, marking a +1.9% move from the prior day. This change outpaced the S&P 500's 0.72% gain on the day. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%. Coming into today, shares of the company behind Snapchat had lost 11.65% in the past month. In that same time, the Computer and Technology sector gained 2.17%, while the S&P 500 gained 2.25%. Wall Street will be looking for positivity from SNAP as it approaches its nex t earnings  report date. The company is expected to report EPS of -$0.05, up 58.33% from the prior-year quarter. Our most recent consensus estimate is calling for quarterly revenue of $437.59 million, up 46.99% from the year-ago period. For the full year, our Zacks Consensus Estimates are projecting earnings of -$0.20 per share and revenue of $1.69 billion, which would represent changes of +57.45% and +42.85%, respectively, from the prior year. It is also important to note the recent changes to analyst estimates for SNAP. Recent revisions tend to reflect the latest near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Our research shows that these estimate changes are directly correlated with near-term stock prices. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. SNAP is holding a Zacks Rank of #3 (Hold) right now. The Internet - Software industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 79, which puts it in the top 31% of all 250+ industries. The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Snap Inc. (SNAP): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Snap (SNAP) closed at $15.31 in the latest trading session, marking a +1.9% move from the prior day. This change outpaced the S&P 500's 0.72% gain on the day. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%.",
    "Coming into today, shares of the company behind Snapchat had lost 11.65% in the past month. In that same time, the Computer and Technology sector gained 2.17%, while the S&P 500 gained 2.25%.",
    "Wall Street will be looking for positivity from SNAP as it approaches its nex t earnings  report date. The company is expected to report EPS of -$0.05, up 58.33% from the prior-year quarter. Our most recent consensus estimate is calling for quarterly revenue of $437.59 million, up 46.99% from the year-ago period.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of -$0.20 per share and revenue of $1.69 billion, which would represent changes of +57.45% and +42.85%, respectively, from the prior year.",
    "It is also important to note the recent changes to analyst estimates for SNAP. Recent revisions tend to reflect the latest near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Our research shows that these estimate changes are directly correlated with near-term stock prices. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. SNAP is holding a Zacks Rank of #3 (Hold) right now.",
    "The Internet - Software industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 79, which puts it in the top 31% of all 250+ industries.",
    "The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:45:24"
}