{
  "url": "https://www.nasdaq.com/article/wednesdays-vital-data-ford-visa-and-roku-cm1210669",
  "title": "Wednesday’s Vital Data: Ford, Visa and Roku - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "U.S. stock futures are trading higher this morning in what looks to be a quiet open for the market. Ahead of the bell, futures on the Dow Jones Industrial Average are up 0.17% and S&P 500 futures are higher by 0.13%. Nasdaq-100 futures have added 0.17%.",
    "In the options pits, call volume saw a modest uptick, helping to drive overall volume above average levels. Specifically, about 21.7 million calls and 17.9 million puts changed hands on the session.",
    "At the CBOE, the single-session equity put/call volume ratio rose to 0.65 - a one-week high, and the dead center of its 2019 range. The 10-day moving average held its ground at 0.65.",
    "Options traders swarmed in Ford (NYSE: F ) ,Visa (NYSE: V ) and Roku (NASDAQ: ROKU ) among others. Below we'll explore the catalysts and investigate their price action.",
    "Volatility seized Ford shares yesterday after the automaker saw its credit downgraded to junk by Moody's. The ratings agency believes Ford sits in a poor financial position for its multi-billion dollar restructuring. Traders viewed the stock's large down gap as a buying opportunity, however.",
    "Initially, the company saw its shares open down 5%, but bulls swarmed to pare the losses to just 1.26% by day's end. Trading volumes surged to over 70 million shares for the session, marking the highest volume day since late-July. The price trend of Ford stock leaves much to be desired. It rests below its 50-day moving average but above the 20-day and 200-day. The mixed messages suggests neutrality more than anything.",
    "While the trend gives traders little to latch on to, the beefy 6.37% dividend is likely sufficient to keep income seekers targeting the stock for the foreseeable future.",
    "On the options trading front, calls slightly outpaced puts on the day. Activity swelled to 335% of the average daily volume, with 145,384 total contracts traded. The increased demand drove implied volatility up to 34%, placing it at the 24th percentile of its one-year range. Premiums are now pricing in daily moves of 20 cents or 2.1%.",
    "Credit card stocks have not fared well over the past two sessions. Visa has fallen almost 6% from Monday's intraday high on above-average volume. Yesterday's whack pushed V stock back below its 50-day moving average. Normally that kind of breach would question a stock's uptrend, but Visa has seen multiple probes below the 50-day during its trend and few have actually mattered.",
    "Bottom line: this is probably a dip worth buying.",
    "On the options trading front, speculators favored calls throughout the session. Total activity jumped to 220% of the average daily volume, with 114,740 contracts traded. Calls claimed 53% of the take.",
    "Implied volatility cruised higher to 23% and now sits at the 27th percentile of its one-year range. Premiums are baking in daily moves of $2.57 or 1.5% so set your expectations accordingly.",
    "Roku stock is finally receiving its comeuppance. Monday's wicked bearish engulfing candle marked a short-term top and yesterday's epic plunge confirmed the easy money in its upswing is over. ROKU stock has fallen 18.4% over the past two days.",
    "The action reminds me of the old trading adage, \"bulls make money, bears make money, pigs get slaughtered.\" Roku's ascent had long since left the stratosphere and was well on its way to the moon when profit-taking and the inevitable pullback commenced. And, like so many gravity-defying rallies before it, Roku learned that gravity always wins in the end.",
    "On a positive note, because ROKU had risen so far off of support and its major moving averages, this pullback hasn't broken any critical support levels. With its overall trend still pointing higher, it might just need a reset or time of rest before eventually moving higher.",
    "On the options trading front activity pushed to 218% of the average daily volume, with 309,379 total contracts traded. Calls barely inched out puts driving 51% of the session's sum.",
    "Implied volatility rallied to 66%, placing it at the 32nd percentile of its one-year range. Selling bull puts is the way to go if you're in the mood for buying the dip.",
    "As of this writing, Tyler Craig held bullish options positions in Roku. Check out his recently releasedBear Market Survival Guideto learn how to defend your portfolio against market volatility.",
    "The post Wednesday's Vital Data: Ford, Visa and Roku appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:52:37"
}