{
  "url": "https://www.nasdaq.com/article/top-ranked-momentum-stocks-to-buy-for-september-4th-cm1207445",
  "title": "Top Ranked Momentum Stocks to Buy for September 4th - Nasdaq.com",
  "text": [
    "Here are four stocks with buy rank and strong momentum characteristics for investors to consider today, September 4th:",
    "Northrop Grumman Corporation (NOC): This aerospace and defense company has a Zacks Rank #2 (Buy) and witnessed the Zacks Consensus Estimate for its current year earnings increasing 1.1% over the last 60 days.",
    "Northrop Grumman Corporation price-consensus-chart | Northrop Grumman Corporation Quote",
    "Northrop Grumman's shares gained 6.8% over the last one month more than S&P 500's rise of 2.2%. The company possesses a  Momentum Score  of B.",
    "Northrop Grumman Corporation price | Northrop Grumman Corporation Quote",
    "Leidos Holdings, Inc. (LDOS): This scientific research company has a Zacks Rank #2 and witnessed the Zacks Consensus Estimate for its current year earnings increasing 2% over the last 60 days.",
    "Leidos Holdings, Inc. price-consensus-chart | Leidos Holdings, Inc. Quote",
    "Leidos' shares gained 9.3% over the last one month. The company possesses a Momentum Score of B.",
    "Leidos Holdings, Inc. price | Leidos Holdings, Inc. Quote",
    "Ferrellgas Partners, L.P. (FGP): This supplier of propane has a Zacks Rank #2 and witnessed the Zacks Consensus Estimate for its current year earnings increasing 18.5% over the last 60 days.",
    "Ferrellgas Partners, L.P. price-consensus-chart | Ferrellgas Partners, L.P. Quote",
    "Ferrellgas' shares gained 9.9% over the last one month. The company possesses a Momentum Score of A.",
    "Ferrellgas Partners, L.P. price | Ferrellgas Partners, L.P. Quote",
    "Telenav, Inc. (TNAV): This location-based platform services provider has a Zacks Rank #2 and witnessed the Zacks Consensus Estimate for its current year earnings increasing 65.7% over the last 60 days.",
    "Telenav, Inc. price-consensus-chart | Telenav, Inc. Quote",
    "Telenav's shares gained 25.7% over the last one month. The company possesses a Momentum Score of B.",
    "Telenav, Inc. price | Telenav, Inc. Quote",
    "See the full list of top ranked stocks here",
    "Learn more about the Momentum score and how it is calculated here.",
    "Biggest Tech Breakthrough in a Generation",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "See 7 breakthrough stocks now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:47:00"
}