{
  "url": "https://www.nasdaq.com/article/arconic-arnc-hits-52-week-high-can-the-run-continue-cm1210442",
  "title": "Arconic (ARNC) Hits 52-Week High, Can the Run Continue? - Nasdaq.com",
  "text": [
    " Have you been paying attention to shares of Arconic (ARNC)? Shares have been on the move with the stock up 5.2% over the past month. The stock hit a new 52-week high of $26.74 in the previous session. Arconic has gained 58.4% since the start of the year compared to the 8.2% move for the Zacks Basic Materials sector and the 16.7% return for the Zacks Mining - Non Ferrous industry.  What's Driving the Outperformance?  The stock has an impressive record of positive earnings surprises, as it hasn't missed our earnings consensus estimate in any of the last four quarters. In its las t earnings  report on August 2, 2019, Arconic reported EPS of $0.58 versus consensus estimate of $0.5 while it beat the consensus revenue estimate by 1.35%. For the current fiscal year, Arconic is expected to post earnings of $2.04 per share on $14.48 billion in revenues. This represents a 50% change in EPS on a 3.32% change in revenues. For the next fiscal year, the company is expected to earn $2.39 per share on $15.22 billion in revenues. This represents a year-over-year change of 17.4% and 5.09%, respectively.  Valuation Metrics  Arconic may be at a 52-week high right now, but what might the future hold for the stock? A key aspect of this question is taking a look at valuation metrics in order to determine if the company is due for a pullback from this level. On this front, we can look at the Zacks Style Scores, as they provide investors with an additional way to sort through stocks (beyond looking at the Zacks Rank of a security). These styles are represented by grades running from A to F in the categories of Value, Growth, and Momentum, while there is a combined VGM Score as well. Investors should consider the style scores a valuable tool that can help you to pick the most appropriate Zacks Rank stocks based on their individual investment style. Arconic has a Value Score of B. The stock's Growth and Momentum Scores are B and D, respectively, giving the company a VGM Score of B. In terms of its value breakdown, the stock currently trades at 13.1X current fiscal year EPS estimates. On a trailing cash flow basis, the stock currently trades at 10.3X versus its peer group's average of 6.3X. This isn't enough to put the company in the top echelon of all stocks we cover from a value perspective.  Zacks Rank  We also need to look at the Zacks Rank for the stock, as this supersedes any trend on the style score front. Fortunately, Arconic currently has a Zacks Rank of #1 (Strong Buy) thanks to rising earnings estimates. Since we recommend that investors select stocks carrying Zacks Rank of 1 (Strong Buy) or 2 (Buy) and Style Scores of A or B, it looks as if Arconic passes the test. Thus, it seems as though Arconic shares could have potential in the weeks and months to come.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Arconic Inc. (ARNC): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Have you been paying attention to shares of Arconic (ARNC)? Shares have been on the move with the stock up 5.2% over the past month. The stock hit a new 52-week high of $26.74 in the previous session. Arconic has gained 58.4% since the start of the year compared to the 8.2% move for the Zacks Basic Materials sector and the 16.7% return for the Zacks Mining - Non Ferrous industry.",
    " What's Driving the Outperformance? ",
    "The stock has an impressive record of positive earnings surprises, as it hasn't missed our earnings consensus estimate in any of the last four quarters. In its las t earnings  report on August 2, 2019, Arconic reported EPS of $0.58 versus consensus estimate of $0.5 while it beat the consensus revenue estimate by 1.35%.",
    "For the current fiscal year, Arconic is expected to post earnings of $2.04 per share on $14.48 billion in revenues. This represents a 50% change in EPS on a 3.32% change in revenues. For the next fiscal year, the company is expected to earn $2.39 per share on $15.22 billion in revenues. This represents a year-over-year change of 17.4% and 5.09%, respectively.",
    " Valuation Metrics ",
    "Arconic may be at a 52-week high right now, but what might the future hold for the stock? A key aspect of this question is taking a look at valuation metrics in order to determine if the company is due for a pullback from this level.",
    "On this front, we can look at the Zacks Style Scores, as they provide investors with an additional way to sort through stocks (beyond looking at the Zacks Rank of a security). These styles are represented by grades running from A to F in the categories of Value, Growth, and Momentum, while there is a combined VGM Score as well. Investors should consider the style scores a valuable tool that can help you to pick the most appropriate Zacks Rank stocks based on their individual investment style.",
    "Arconic has a Value Score of B. The stock's Growth and Momentum Scores are B and D, respectively, giving the company a VGM Score of B.",
    "In terms of its value breakdown, the stock currently trades at 13.1X current fiscal year EPS estimates. On a trailing cash flow basis, the stock currently trades at 10.3X versus its peer group's average of 6.3X. This isn't enough to put the company in the top echelon of all stocks we cover from a value perspective.",
    " Zacks Rank ",
    "We also need to look at the Zacks Rank for the stock, as this supersedes any trend on the style score front. Fortunately, Arconic currently has a Zacks Rank of #1 (Strong Buy) thanks to rising earnings estimates.",
    "Since we recommend that investors select stocks carrying Zacks Rank of 1 (Strong Buy) or 2 (Buy) and Style Scores of A or B, it looks as if Arconic passes the test. Thus, it seems as though Arconic shares could have potential in the weeks and months to come.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:35:05"
}