{
  "url": "https://www.nasdaq.com/article/caterpillar-cat-outpaces-stock-market-gains-what-you-should-know-cm1207626",
  "title": "Caterpillar (CAT) Outpaces Stock Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " In the latest trading session, Caterpillar (CAT) closed at $119.10, marking a +1.77% move from the previous day. The stock outpaced the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%. Coming into today, shares of the construction equipment company had lost 4.14% in the past month. In that same time, the Industrial Products sector lost 3.76%, while the S&P 500 lost 0.68%. CAT will be looking to display strength as it nears its nex t earnings  release. In tha t report  , analysts expect CAT to post earnings of $2.89 per share. This would mark year-over-year growth of 1.05%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $13.52 billion, up 0.09% from the year-ago period. Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $11.75 per share and revenue of $56.01 billion. These totals would mark changes of +4.72% and +2.35%, respectively, from last year. Investors should also note any recent changes to analyst estimates for CAT. These revisions typically reflect the latest short-term business trends, which can change frequently. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.21% higher within the past month. CAT is currently a Zacks Rank #3 (Hold). Valuation is also important, so investors should note that CAT has a Forward P/E ratio of 9.96 right now. This valuation marks a premium compared to its industry's average Forward P/E of 9.57. Also, we should mention that CAT has a PEG ratio of 0.83. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Manufacturing - Construction and Mining industry currently had an average PEG ratio of 0.83 as of yesterday's close. The Manufacturing - Construction and Mining industry is part of the Industrial Products sector. This industry currently has a Zacks Industry Rank of 196, which puts it in the bottom 24% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. To follow CAT in the coming trading sessions, be sure to utilize Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Caterpillar Inc. (CAT): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "In the latest trading session, Caterpillar (CAT) closed at $119.10, marking a +1.77% move from the previous day. The stock outpaced the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%.",
    "Coming into today, shares of the construction equipment company had lost 4.14% in the past month. In that same time, the Industrial Products sector lost 3.76%, while the S&P 500 lost 0.68%.",
    "CAT will be looking to display strength as it nears its nex t earnings  release. In tha t report  , analysts expect CAT to post earnings of $2.89 per share. This would mark year-over-year growth of 1.05%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $13.52 billion, up 0.09% from the year-ago period.",
    "Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $11.75 per share and revenue of $56.01 billion. These totals would mark changes of +4.72% and +2.35%, respectively, from last year.",
    "Investors should also note any recent changes to analyst estimates for CAT. These revisions typically reflect the latest short-term business trends, which can change frequently. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.",
    "Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.",
    "The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.21% higher within the past month. CAT is currently a Zacks Rank #3 (Hold).",
    "Valuation is also important, so investors should note that CAT has a Forward P/E ratio of 9.96 right now. This valuation marks a premium compared to its industry's average Forward P/E of 9.57.",
    "Also, we should mention that CAT has a PEG ratio of 0.83. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Manufacturing - Construction and Mining industry currently had an average PEG ratio of 0.83 as of yesterday's close.",
    "The Manufacturing - Construction and Mining industry is part of the Industrial Products sector. This industry currently has a Zacks Industry Rank of 196, which puts it in the bottom 24% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "To follow CAT in the coming trading sessions, be sure to utilize Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:45:23"
}