{
  "url": "https://www.nasdaq.com/article/cash-dividend-on-the-way-from-invesco-mortgage-capital-fixed-to-floating-series-b-cumulative-redeemable-preferred-stock-cm1206815",
  "title": "Cash Dividend On The Way From Invesco Mortgage Capital Fixed-to-Floating Series B Cumulative Redeemable Preferred Stock - Nasdaq.com",
  "text": [
    "On 9/4/19, Invesco Mortgage Capital Inc's 7.75% Fixed-to-Floating Series B Cumulative Redeemable Preferred Stock (Symbol: IVR.PRB) will trade ex-dividend, for its quarterly dividend of $0.4844, payable on 9/27/19. As a percentage of IVR.PRB's recent share price of $27.60, this dividend works out to approximately 1.76%, so look for shares of IVR.PRB to trade 1.76% lower - all else being equal - when IVR.PRB shares open for trading on 9/4/19. On an annualized basis, the current yield is approximately 7.01%, which compares to an average yield of 6.67% in the \"Real Estate\" preferred stock category, according to  Preferred Stock Channel  . The chart below shows the one year performance of IVR.PRB shares, versus IVR:       makeArticleAd();  Below is a dividend history chart for IVR.PRB, showing historical dividends prior to the most recent $0.4844 on Invesco Mortgage Capital Inc's 7.75% Fixed-to-Floating Series B Cumulative Redeemable Preferred Stock:         In Tuesday trading, Invesco Mortgage Capital Inc's 7.75% Fixed-to-Floating Series B Cumulative Redeemable Preferred Stock (Symbol: IVR.PRB) is currently off about 0.1% on the day, while the common shares (Symbol: IVR) are down about 1.3%.   Click here to learn which S.A.F.E. dividend stocks   also have preferred shares that should be on your radar screen   »  ",
    "  Click here to learn which S.A.F.E. dividend stocks   also have preferred shares that should be on your radar screen   » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:50:56"
}