{
  "url": "https://www.nasdaq.com/article/british-airways-pilots-could-call-off-sept-910-strike-if-airline-negotiatesunion-20190905-00149",
  "title": "British Airways pilots could call off Sept. 9-10 strike if airline negotiates-union - Nasdaq.com",
  "text": [
    "By Noor Zainab Hussain",
    "Sept 5 (Reuters) - British Airways  pilots could call off proposed strikes set for Sept. 9 and 10 if the airline agrees to come back to the negotiating table, the British Airline Pilots Association (BALPA) said on Thursday.",
    "The union has put forward a new proposal in a letter to British Airways Chief Executive Officer Alex Cruz in an effort to reach a deal with the company, BALPA said in a (graphic).",
    "The strikes could still go ahead if the airline continues to refuse meaningful discussions, the union added.",
    "British Airways said it would meet BALPA.",
    "\"We continue to be available for constructive talks, on the basis that there are no pre-conditions to those talks,\" the airline said in a statement.",
    "The pilots overwhelmingly voted for industrial action in July and the airline, which is part of IAG, failed in a court bid to stop them.",
    "BALPA has said that British Airways should share more of its profits with its pilots. The union has also given notice to the airline that it will call on its members to strike on Sept. 27. ",
    "\"Our members' resolve is very strong and they remain very angry with BA, but they also want to leave no stone unturned in trying to find a resolution to their dispute,\" BALPA General Secretary, Brian Strutton, said.",
    "\"Avoiding strike action and agreeing a deal with their pilots surely must be the desired outcome for British Airways,\" he added.",
    "British Airways has said the strike action was unjustifiable as its pay offer was fair and that the strikes would destroy the travel plans of tens of thousands of customers.",
    "The airline said in August it was exploring options to supplement its fleet with aircraft and crew from other airlines, a practice known as wet-leasing, and working with partner airlines to schedule larger aircraft to take more customers.",
    "Ryanair  members of BALPA have also announced a further seven days of strikes as their latest walkout comes to an end. ",
    "While widespread strikes over pay and conditions a year ago forced Ryanair to cancel hundreds of flights, the first series of strikes since then in Britain, Spain and Portugal has caused minimal disruption.",
    "IAG's shares were 0.5% higher at 426.3 pence at 0836 GMT."
  ],
  "published_datetime": "2019-09-05 04:45:00"
}