{
  "url": "https://www.nasdaq.com/article/noteworthy-tuesday-option-activity-ulta-cxo-noc-cm1206798",
  "title": "Noteworthy Tuesday Option Activity: ULTA, CXO, NOC - Nasdaq.com",
  "text": [
    "Among the underlying components of the S&P 500 index, we saw noteworthy  options trading  volume today in Ulta Beauty Inc (Symbol: ULTA), where a total of 44,981 contracts have traded so far, representing approximately 4.5 million underlying shares. That amounts to about 276.2% of ULTA's average daily trading volume over the past month of 1.6 million shares. Particularly high volume was seen for the $245 strike call option expiring September 20, 2019  , with 3,120 contracts trading so far today, representing approximately 312,000 underlying shares of ULTA. Below is a chart showing ULTA's trailing twelve month trading history, with the $245 strike highlighted in orange:       makeArticleAd();    Concho Resources Inc (Symbol: CXO) options are showing a volume of 38,408 contracts thus far today. That number of contracts represents approximately 3.8 million underlying shares, working out to a sizeable 131.3% of CXO's average daily trading volume over the past month, of 2.9 million shares. Particularly high volume was seen for the $75 strike put option expiring September 20, 2019  , with 35,030 contracts trading so far today, representing approximately 3.5 million underlying shares of CXO. Below is a chart showing CXO's trailing twelve month trading history, with the $75 strike highlighted in orange:       And Northrop Grumman Corp (Symbol: NOC) options are showing a volume of 9,688 contracts thus far today. That number of contracts represents approximately 968,800 underlying shares, working out to a sizeable 123.1% of NOC's average daily trading volume over the past month, of 786,975 shares. Particularly high volume was seen for the $367.50 strike call option expiring October 11, 2019  , with 3,549 contracts trading so far today, representing approximately 354,900 underlying shares of NOC. Below is a chart showing NOC's trailing twelve month trading history, with the $367.50 strike highlighted in orange:         For the various different available expirations for ULTA options  , CXO options  , or NOC options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:43:19"
}