{
  "url": "https://www.nasdaq.com/article/ecb-package-could-include-rate-cut-tiering-new-guidance-20190903-00864",
  "title": "ECB package could include rate cut, tiering, new guidance - Nasdaq.com",
  "text": [
    "By Balazs Koranyi and Frank Siebelt",
    "FRANKFURT, Sept 3 (Reuters) - ECB policymakers are leaning towards a stimulus package that includes a rate cut, a beefed-up pledge to keep rates low for longer and compensation for banks over the side-effects of negative rates, five sources familiar with the discussion said.",
    "Many also favour restarting asset buys, a significantly more powerful weapon, but opposition from some northern European countries is complicating this issue, the sources, who declined to be named, added.",
    "With economic growth slowing as a global trade war threatens to escalate, the ECB has all but promised to announce more stimulus after its Sept 12 meeting, leaving markets only to guess about the composition of the expected package.",
    "The sources added that there was no reason to stagger stimulus moves over several meetings, even if Brexit uncertainty was still likely to rise. But they said it was also vital for the ECB to leave some tools unused for Christine Lagarde - due to take over as president from Mario Draghi on Nov 1 - to deploy, if needed.",
    "Several sources said final proposals were likely to be given to policymakers only during the week of their meeting, as is now customary before major decisions.",
    "Bond purchases are especially controversial because the ECB is nearing self-imposed issuer limits, so any substantial programme risked forcing policymakers to ditch their own rules and open the scheme to legal challenges.",
    "But three of the sources said the ECB had room for about one year of bond buys using the flexibility of its existing framework, so these was no immediate need to change the rule requiring the ECB to hold no more than one-third of each country's bonds.",
    "Sovereign debt would remain the cornerstone of any new purchase programme, but private sector assets were also again likely to be included, the sources added.",
    "The ECB ended its 2.6 trillion euro ($2.90 trillion) bond buying scheme, known as quantitative easing, just last December and looked set to raise interest rates this year as the economy picked up.",
    "But sentiment has deteriorated rapidly since as the trade war cut into exports, Brexit sapped confidence and a slowdown in China weakened demand.",
    "Germany's economy shrank last quarter and the bloc's industrial sector is also contracting, raising the risk that export troubles could soon infect the domestic economy.",
    "With banks already suffering under the slowdown, any rate cut is expected to be accompanied by a multi-tier deposit rate, which exempts banks from some of the ECB's punitive charges for holding overnight deposits.",
    "The ECB's deposit rate currently stands at minus 0.4% and, to prop up confidence, the ECB is likely to revise its pledge to keep rates low, unveiling 'reinforced' guidance that will specify what inflation conditions will be needed before they can rise.",
    "The ECB currently aims to keep rates at present or lower levels at least through the first half of 2020 and the new guidance is likely to cut the emphasis on specific timeframes for change, the sources added.",
    "($1 = 0.8973 euros)"
  ],
  "published_datetime": "2019-09-03 09:35:00"
}