{
  "url": "https://www.nasdaq.com/article/semtechs-lora-network-to-be-used-by-definium-in-tasmania-cm1206718",
  "title": "Semtech's Lora Network to Be Used by Definium in Tasmania - Nasdaq.com",
  "text": [
    "  Semtech Corporation SMTC  recently announced that the company's Low power, high Range (LoRa) devices will used by Definium Technologies (Definium). Recently, Definium has deployed an enterprise-grade network in Tasmania. Based on Semtech'sLoRa devices and LoRaWAN protocol, this network is expected to help in smooth transition of Tasmania into a laboratory that is capable of testing new technologies.  The deal will allow individuals and businesses to benefit from better connectivity, and thereby experiment new applications based on IoT. The LoRa Technology enables long-range connectivity of Internet of Things (IoT) devices and aids in connecting sensors to the cloud. Its long range performance and low power consumption requirement enhance overall performance. Moreover, this technology helps in real-time communication of data and analytics to enhance efficiency, as well as productivity. Consequently, the move is likely to boost the adoption rate of the company's LoRa technology, which in turn will drive the top line.  FormFactor, Inc. Price and Consensus         FormFactor, Inc. price-consensus-chart    |   FormFactor, Inc. Quote    Partnerships Play a Key Role  Semtech is witnessing growing strategic alliance and contracts, thanks to cost-efficient abilities of LoRa technology in creating as well as deploying IoT solutions. In addition to the current deal, the company recently joined forces with Continental Automated Buildings Association (CABA) to enhance and innovate the latter's portfolio of smart home and building technologies. Additionally, per a deal between Ineo-Sense and Lauak Group, the former will provide LoRa-enabled asset tracking sensors that will be integrated into the latter's manufacturing containers. Further, the technology has been selected to be used in Brazil's network, which is based on the LoRaWAN protocol that is deployed by American Tower (ATC). Moreover, Lemonbeat has adopted LoRa technology to enhance smart metering solutions. We believe Semtech is well poised to rapidly penetrate into the expanding IoT market, aided by the highly popular LoRa technology.  IoT Market's Growth Prospects  Internet of Things (IoT) devices have been gaining significant traction in recent times. These have been successful in making an impact across all end markets served by the company. Per IOT Analytics, the number of active IoT devices is expected to grow from 7 billion in 2018 to 10 billion and 22 billion by 2020 and 2025, respectively, including devices on the consumer and enterprise side. Presently, LoRaWAN networks are operating in more than 50 countries. The company expects the LoRaWAN open protocol to reach more countries in the near term. Industry experts expect four out of every 10 long-range IoT connections to be powered by LPWAN, with LoRaWAN being the dominant player. Semtech is well poised to cater to the growing demand in this domain on the back of robust product portfolio and strong IoT capabilities.  Zacks Rank & Stocks to Consider  Currently, Semtech carries a Zacks Rank #5 (Strong sell). Some better-ranked stocks in the broader technology sector include Alphabet Inc. GOOGL  , Itron, Inc. ITRI  and Teradyne, Inc. TER  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   . Long-term earnings growth for Alphabet, Itron and Teradyne is currently projected at 17.5%, 25% and 11.4%, respectively.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Alphabet Inc. (GOOGL): Free Stock Analysis Report   Semtech Corporation (SMTC): Free Stock Analysis Report   Teradyne, Inc. (TER): Free Stock Analysis Report   Itron, Inc. (ITRI): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Semtech Corporation SMTC  recently announced that the company's Low power, high Range (LoRa) devices will used by Definium Technologies (Definium).",
    "Recently, Definium has deployed an enterprise-grade network in Tasmania. Based on Semtech'sLoRa devices and LoRaWAN protocol, this network is expected to help in smooth transition of Tasmania into a laboratory that is capable of testing new technologies. ",
    "The deal will allow individuals and businesses to benefit from better connectivity, and thereby experiment new applications based on IoT.",
    "The LoRa Technology enables long-range connectivity of Internet of Things (IoT) devices and aids in connecting sensors to the cloud. Its long range performance and low power consumption requirement enhance overall performance. Moreover, this technology helps in real-time communication of data and analytics to enhance efficiency, as well as productivity.",
    "Consequently, the move is likely to boost the adoption rate of the company's LoRa technology, which in turn will drive the top line.",
    " FormFactor, Inc. Price and Consensus ",
    "     FormFactor, Inc. price-consensus-chart    |   FormFactor, Inc. Quote  ",
    " FormFactor, Inc. price-consensus-chart    |   FormFactor, Inc. Quote ",
    " Partnerships Play a Key Role ",
    "Semtech is witnessing growing strategic alliance and contracts, thanks to cost-efficient abilities of LoRa technology in creating as well as deploying IoT solutions.",
    "In addition to the current deal, the company recently joined forces with Continental Automated Buildings Association (CABA) to enhance and innovate the latter's portfolio of smart home and building technologies.",
    "Additionally, per a deal between Ineo-Sense and Lauak Group, the former will provide LoRa-enabled asset tracking sensors that will be integrated into the latter's manufacturing containers.",
    "Further, the technology has been selected to be used in Brazil's network, which is based on the LoRaWAN protocol that is deployed by American Tower (ATC). Moreover, Lemonbeat has adopted LoRa technology to enhance smart metering solutions.",
    "We believe Semtech is well poised to rapidly penetrate into the expanding IoT market, aided by the highly popular LoRa technology.",
    " IoT Market's Growth Prospects ",
    "Internet of Things (IoT) devices have been gaining significant traction in recent times. These have been successful in making an impact across all end markets served by the company.",
    "Per IOT Analytics, the number of active IoT devices is expected to grow from 7 billion in 2018 to 10 billion and 22 billion by 2020 and 2025, respectively, including devices on the consumer and enterprise side.",
    "Presently, LoRaWAN networks are operating in more than 50 countries. The company expects the LoRaWAN open protocol to reach more countries in the near term. Industry experts expect four out of every 10 long-range IoT connections to be powered by LPWAN, with LoRaWAN being the dominant player.",
    "Semtech is well poised to cater to the growing demand in this domain on the back of robust product portfolio and strong IoT capabilities.",
    " Zacks Rank & Stocks to Consider ",
    "Currently, Semtech carries a Zacks Rank #5 (Strong sell). Some better-ranked stocks in the broader technology sector include Alphabet Inc. GOOGL  , Itron, Inc. ITRI  and Teradyne, Inc. TER  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    "Long-term earnings growth for Alphabet, Itron and Teradyne is currently projected at 17.5%, 25% and 11.4%, respectively.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:04:00"
}