{
  "url": "https://www.nasdaq.com/article/miners-welcome-indonesian-export-ore-ban-plan-smelting-expansion-20190911-00943",
  "title": "Miners welcome Indonesian export ore ban, plan smelting expansion - Nasdaq.com",
  "text": [
    "By Mai Nguyen and Wilda Asmarini",
    "JAKARTA, Sept 11 (Reuters) - Large mining companies on Wednesday welcomed a recent decision by the Indonesian government to move forward a ban on exporting nickel ore, as the firms aim to increase smelting output.",
    "Top nickel ore supplier Indonesia last month said the country will stop ore export from Jan. 1, 2020, pushing forward a ban by two years and raising concerns of supply shortage as well as causing financing issues for smaller players. ",
    "\"For Vale, we see Indonesia as a great opportunity to expand our production,\" Steven Brown, a general manager at PT Vale Indonesia , told the conference in Jakarta.",
    "Indonesia said it expedited the ban to reserve ore for its fast-expanding smelting industries of nickel pig iron (NPI), stainless steel and electric vehicles (EV) battery nickel.",
    "The country first placed the nickel ore export ban in 2014, causing a price surge at the time, then relaxed it in 2017 under a quota system. Nickel prices  have surged as much as 76% this year.",
    "\"If we step back and look at whether this has been a successful industrial policy for Indonesia, I think the answer to that is a resounding yes,\" said Mark Selby, principal of Selby & Co.",
    "\"Tens of billions of dollars for investments coming into Indonesia, probably more in mining investment than any other developing country in the world, as a result the ore ban. Mining resources are not infinite,\" Selby told the conference.",
    "SMELTING CAPACITY",
    "Smelters in Indonesia in the past few years have ramped up production of NPI and ferronickel, or products made from nickel ore that are used in making stainless steel.",
    "From nearly zero in 2014, Indonesia's NPI output climbed to 261,000 tonnes a year in 2018 and could climb to as much as 530,000 tonnes in 2020, according to analysts' estimate. ",
    "\"The good thing is, domestically, more and more smelters apart from those owned by Antam are coming up and running,\" said Dimas Wikan Pramuditho, chief finance officer of Indonesian state miner Aneka Tambang (Antam) .",
    "Antam aimed to expand its ferronickel output to 40,500 tonnes of nickel metal by next year, from 27,000 tonnes currently and planned to add at least another 93,500 tonnes of nickel in NPI and ferronickel by 2024, Antam's commerce director Aprilandi Hidayat Setia told the conference.",
    "Tsingshan, the biggest NPI producer in Indonesia, could add another 100,000 tonnes of nickel in NPI next year, from around 220,000 tonnes currently, a source with direct knowledge said, while PT Vale Indonesia plans to add a new ferronickel smelter and expand its existing nickel matte plant.",
    "Nickel firms are also planning several battery nickel projects in Indonesia on the positive outlook for the EV battery sector, despite facing challenges of disposing waste financially and cleanly as well as obtaining a permit to run the projects.",
    "Tsingshan and its partners have two battery nickel projects with combined capacity of 110,000 tonnes in nickel content and aimed to start production from end 2020, pending permits from the authority and financing, the direct source said.",
    "PT Vale Indonesia and Sumitomo Metal Mining Co Ltd  are conducting a feasibility study of a 40,000-tonne battery nickel project, while Indonesia'sHarita Group and China's Ningbo Lygend is planning another battery nickel plant."
  ],
  "published_datetime": "2019-09-11 10:06:00"
}