{
  "url": "https://www.nasdaq.com/article/why-royal-caribbean-stock-sank-10-in-august-cm1207168",
  "title": "Why Royal Caribbean Stock Sank 10% in August - Nasdaq.com",
  "text": [
    " What happened  Royal Caribbean    (NYSE: RCL) investors trailed the market last month as their   stock lost 10% compared to a 2% decrease in the   S&P 500    , according to data provided by      S&P Global Market Intelligence    . The drop just erased a portion of the stock's gain, though,   and Royal Caribbean remains slightly higher so far in 2019.   Image source: Getty Images.makeArticleAd();  So what August's decline may have involved short-term selling   following the cruise giant's solid fiscal second-quarter results.   Tha   t report    was highlighted by   robust sales growth    across its key vacation geographies in Europe, the Caribbean, and   Asia. Yet the slump likely had more to do with impending   Hurricane Dorian, which has pounded the Bahamas in recent days.   Royal Caribbean counts that nation as a key destination, and it   is the location of its new private resort island excursion,   called Perfect Day. Now what Investors will likely learn about the scope of the hurricane   devastation to that property in the coming days. But their bigger   concerns involve the sustainability of   consumer discretionary    demand in the wider Caribbean in general, given the region's   pounding in each of the last few hurricane seasons.   10 stocks we like better than Royal Caribbean       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Royal Caribbean wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Demitrios Kalogeropoulos      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    " Royal Caribbean    (NYSE: RCL) investors trailed the market last month as their   stock lost 10% compared to a 2% decrease in the   S&P 500    , according to data provided by      S&P Global Market Intelligence    .",
    "The drop just erased a portion of the stock's gain, though,   and Royal Caribbean remains slightly higher so far in 2019.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "August's decline may have involved short-term selling   following the cruise giant's solid fiscal second-quarter results.   Tha   t report    was highlighted by   robust sales growth    across its key vacation geographies in Europe, the Caribbean, and   Asia. Yet the slump likely had more to do with impending   Hurricane Dorian, which has pounded the Bahamas in recent days.   Royal Caribbean counts that nation as a key destination, and it   is the location of its new private resort island excursion,   called Perfect Day.",
    "Investors will likely learn about the scope of the hurricane   devastation to that property in the coming days. But their bigger   concerns involve the sustainability of   consumer discretionary    demand in the wider Caribbean in general, given the region's   pounding in each of the last few hurricane seasons.",
    "  10 stocks we like better than Royal Caribbean       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Royal Caribbean wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Royal Caribbean       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Royal Caribbean wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Demitrios Kalogeropoulos      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:16:00"
}