{
  "url": "https://www.nasdaq.com/article/3-top-value-stocks-to-buy-in-september-cm1207665",
  "title": "3 Top Value Stocks to Buy in September - Nasdaq.com",
  "text": [
    " Value stocks can be found in nearly every corner of the market   for investors willing to look hard enough. Today, I've found   values in retail, technology, and telecom that are sitting right   in front of our eyes. For different reasons,   Best Buy Co    (NYSE: BBY) ,   Apple Inc.    (NASDAQ: AAPL) , and   AT&T Inc.    (NYSE: T) are all my top value stocks in September, and there's   something here for every kind of investor.   Image source: Getty Images.makeArticleAd();  The electronics retailer on a comeback Brick and mortar retail hasn't been a hot segment for   investors for a long time, but that doesn't mean there aren't   areas of value. One company that's been performing relatively   well is Best Buy, the electronics retailer that has survived the   onslaught from the likes of   Amazon    and others. Over the last few years, Best Buy has transitioned its   business to focus more on enterprise, services, and the brick and   mortar experience that online retailers can't offer. In the   second fiscal quarter of 2020, same-store services revenue was up   10.7% domestically, far exceeding 1.9% growth for the company   overall. You can see below that the last five years have seen steady   growth in both revenue and ne   t earnings    , which may seem surprising for a brick and mortar electronics   retailer.       BBY Revenue (TTM)    data by   YCharts  What I like at Best Buy is the company leaning into its   advantages. Seeing and feeling the performance of products   like TVs and speakers simply can't be replaced online, and Best   Buy is building its stores to show off those features. From a value standpoint, Best Buy's price to earnings ratio is   just 12.0, and the dividend yield now stands at 3.1%. That's a   solid price for a leading retailer, especially one that seems to   have found its place in the market. Value in big tech It's hard not to see Apple as a value stock in today's market.   The company has $102.2 billion of net cash on the balance sheet,   and earned $55.7 billion in the past year. At the current market   cap of $943 billion, the price to earnings ratio excluding net   cash is 15.1 times, and the curren   t   dividend yield    is 1.5%.       AAPL Revenue (TTM)    data by   YCharts  What separates Apple is the products that it makes and how   integral they are to millions of peoples' lives. There are nearly   1 billion iPhones in service today, and those customers are   getting pulled into an ecosystem that's hard to escape. On an industry level, scale is more important than ever in   technology, and few companies have the scale of Apple. That's   valuable considering the   rate tech is changing and growing overall    . Add it up and this is a great value stock in technology. A value play in telecom Telecommunications stocks aren't getting a lot of love these   days, because in the U.S. there's a lot of competition and not a   lot of growth. For companies like AT&T, that has meant   falling margins and little growth outside of acquisitions. But   that's looking back, and right now investors should be looking   forward.       T Revenue (TTM)    data by   YCharts  What's attractive for investors today is the stock's 14.9   trailing P/E ratio and its 5.8% dividend yield, which is where   the value lies. And looking at operations, there's a lot to like   too. 5G wireless is here, and everything from autonomous cars to VR   headsets will rely on a fast 5G connection. AT&T will have   one of two or three of the best networks in the country (   depending on the Sprint/T-Mobile deal    ), courting potentially hundreds of millions of new connected   devices. That should drive higher revenue, and potentially higher   margins as well. I think the best days are still ahead for wireless in the   U.S., and AT&T has one of the best networks -- and is trading   at a great value for investors. The value plays in today's market There's more to value than just price to earnings ratios or   dividends, and each of these companies has something different to   offer. Best Buy is a retailer that's having success offering   services online retailers can't offer, Apple is a cash machine,   and AT&T is a bet on the future of 5G in the U.S. Each trades   at a reasonable P/E multiple, and given their mainstay status in   the economy I think they're all great values this month.   10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors.     Travis Hoium      owns shares of Apple and AT&T and has a family member who     works at Amazon. The Motley Fool owns shares of and recommends     Amazon and Apple. The Motley Fool has the following options:     short January 2020 $155 calls on Apple, long January 2020 $150     calls on Apple, short January 2020 $155 calls on Apple, and     long January 2020 $150 calls on Apple. The Motley Fool has a     disclosure policy      .  ",
    "Value stocks can be found in nearly every corner of the market   for investors willing to look hard enough. Today, I've found   values in retail, technology, and telecom that are sitting right   in front of our eyes.",
    "For different reasons,   Best Buy Co    (NYSE: BBY) ,   Apple Inc.    (NASDAQ: AAPL) , and   AT&T Inc.    (NYSE: T) are all my top value stocks in September, and there's   something here for every kind of investor.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Brick and mortar retail hasn't been a hot segment for   investors for a long time, but that doesn't mean there aren't   areas of value. One company that's been performing relatively   well is Best Buy, the electronics retailer that has survived the   onslaught from the likes of   Amazon    and others.",
    "Over the last few years, Best Buy has transitioned its   business to focus more on enterprise, services, and the brick and   mortar experience that online retailers can't offer. In the   second fiscal quarter of 2020, same-store services revenue was up   10.7% domestically, far exceeding 1.9% growth for the company   overall.",
    "You can see below that the last five years have seen steady   growth in both revenue and ne   t earnings    , which may seem surprising for a brick and mortar electronics   retailer.",
    " BBY Revenue (TTM)    data by   YCharts ",
    "What I like at Best Buy is the company leaning into its   advantages. Seeing and feeling the performance of products   like TVs and speakers simply can't be replaced online, and Best   Buy is building its stores to show off those features.",
    "From a value standpoint, Best Buy's price to earnings ratio is   just 12.0, and the dividend yield now stands at 3.1%. That's a   solid price for a leading retailer, especially one that seems to   have found its place in the market.",
    "It's hard not to see Apple as a value stock in today's market.   The company has $102.2 billion of net cash on the balance sheet,   and earned $55.7 billion in the past year. At the current market   cap of $943 billion, the price to earnings ratio excluding net   cash is 15.1 times, and the curren   t   dividend yield    is 1.5%.",
    " AAPL Revenue (TTM)    data by   YCharts ",
    "What separates Apple is the products that it makes and how   integral they are to millions of peoples' lives. There are nearly   1 billion iPhones in service today, and those customers are   getting pulled into an ecosystem that's hard to escape.",
    "On an industry level, scale is more important than ever in   technology, and few companies have the scale of Apple. That's   valuable considering the   rate tech is changing and growing overall    . Add it up and this is a great value stock in technology.",
    "Telecommunications stocks aren't getting a lot of love these   days, because in the U.S. there's a lot of competition and not a   lot of growth. For companies like AT&T, that has meant   falling margins and little growth outside of acquisitions. But   that's looking back, and right now investors should be looking   forward.",
    " T Revenue (TTM)    data by   YCharts ",
    "What's attractive for investors today is the stock's 14.9   trailing P/E ratio and its 5.8% dividend yield, which is where   the value lies. And looking at operations, there's a lot to like   too.",
    "5G wireless is here, and everything from autonomous cars to VR   headsets will rely on a fast 5G connection. AT&T will have   one of two or three of the best networks in the country (   depending on the Sprint/T-Mobile deal    ), courting potentially hundreds of millions of new connected   devices. That should drive higher revenue, and potentially higher   margins as well.",
    "I think the best days are still ahead for wireless in the   U.S., and AT&T has one of the best networks -- and is trading   at a great value for investors.",
    "There's more to value than just price to earnings ratios or   dividends, and each of these companies has something different to   offer. Best Buy is a retailer that's having success offering   services online retailers can't offer, Apple is a cash machine,   and AT&T is a bet on the future of 5G in the U.S. Each trades   at a reasonable P/E multiple, and given their mainstay status in   the economy I think they're all great values this month.",
    "  10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " John Mackey, CEO of Whole Foods Market, an Amazon     subsidiary, is a member of The Motley Fool's board of     directors.     Travis Hoium      owns shares of Apple and AT&T and has a family member who     works at Amazon. The Motley Fool owns shares of and recommends     Amazon and Apple. The Motley Fool has the following options:     short January 2020 $155 calls on Apple, long January 2020 $150     calls on Apple, short January 2020 $155 calls on Apple, and     long January 2020 $150 calls on Apple. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:16:00"
}