{
  "url": "https://www.nasdaq.com/article/conns-inc-conn-q2-2020-earnings-call-transcript-cm1206903",
  "title": "Conn's Inc (CONN) Q2 2020 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   Conn's Inc    (NASDAQ: CONN)        Q2 2020 Earnings Call       Sep 3, 2019 ,   11:00 a.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Good morning and thank you for holding. Welcome to the Conn's   Inc. Conference Call to discuss earnings for the fiscal quarter   ended July 31, 2019. My name is Dana and I will be your operator   today. During the presentation, all participants will be in a   listen-only mode. After the speaker's remarks, you will be   invited to participate in the question-and-answer session. As a   reminder, this conference call is being recorded. The Company's earnings release, dated September 3rd, 2019, was   distributed before market opened this morning and can be accessed   via the Company's Investor Relations website at ir.conns.com. During today's call, management will discuss, among other   financial performance measures, adjusted EBITDA, adjusted net   income and adjusted earnings per diluted share. Please refer to   the Company's earnings release that was issued today for a   reconciliation of these non-GAAP measures to the most comparable   GAAP measures. I must remind you that some of the statements made   in this call are forward-looking statements within the meaning of   the federal securities laws. These forward-looking statements represent the Company's   present expectations or beliefs concerning future events. The   Company cautions that such statements are necessarily based on   certain assumptions, which are subject to risks and   uncertainties, which could cause actual results to differ   materially from those indicated today. Your speakers today are   Norm Miller, the Company's CEO; Lee Wright, the Company's COO and   George Bchara, the Company's CFO. I would now like to turn the conference call over to Mr.   Miller. Please go ahead, sir.  Norman Miller    --   President, Chief Executive Officer and Chairman  Good morning and welcome to Conn's Second Quarter of Fiscal   Year 2020 Earnings Conference Call. I'll begin the call with a   strategic overview. Then Lee will provide additional details on   the quarter before turning the call over to George, who will   complete our prepared remarks with additional comments on the   financial results. Our record second quarter earnings demonstrate our continued   success executing on our strategic priorities, our strong   operating performance across both our retail and credit segment   and the demand for our unique value proposition. We are pursuing   a compelling retail strategy that takes advantage of a large and   stable addressable market, and we have invested in people,   operations and systems to support our planned growth. As you may   recall, last quarter we launched our new e-commerce platform,   including the implementation of our upgraded website, which was a   significant milestone for our Company. Conn's has created an   end-to-end online solution, allowing our customer to transact   with us entirely online, using any of our financing options. I am also pleased to announce our planned expansion into the   Florida market, another significant milestone in the 129-year   history of our Company. Florida is a logical next step for our   geographic expansion as it is contiguous to our existing   footprint, is home to over 21 million people, and supports an   attractive rate environment for our in-house credit offering. To   support our future Florida locations, we recently executed a   lease agreement for an over 400,000 square foot distribution   center in Central Florida that will open in the next 12 months.   We expect the first Florida store to open in the second half of   next fiscal year. Ultimately, we believe the state of Florida   could support over 40 Conn's locations, which would represent a   significant expansion to our current store base. Our credit performance remains strong and is in line with the   strategy we outlined over three years ago. With confidence in our   underwriting and collections performance, our stable credit   segment provides us with additional opportunities to grow retail   sales and differentiate our business from other retailers.   Reflecting our optimism for the future and our desire to create   value for shareholders, I am pleased to announce that we have   repurchased $57.9 million of common stock through August 29,   which represents approximately 9.6% of our outstanding shares. As   you can see, positive momentum is accelerating across our   business and we believe fiscal year 2020 is shaping up to be a   year of strong earnings and operational growth. So with this overview, let me turn the call over to Lee, who   will provide more details on our second quarter operating   results.  Lee A. Wright    --   Executive Vice President and Chief Operating Officer  Thanks, Norm. The second quarter of fiscal year 2020 is the   second best quarter of total retail sales growth in 13 quarters,   despite the continued headwind of lapping the benefit of   Hurricane Harvey rebuilding efforts had on our results last   fiscal year. Although total same store sales decreased 2.3%,   reflecting the continued impact of Hurricane Harvey, I am pleased   to announce that total retail sales increased 3.3% for the second   quarter of fiscal year 2020 and same-store sales were positive in   non-Hurricane Harvey impacted markets, highlighting the power of   our growth opportunity. Year-to-date, we have opened 10 new showrooms in existing   states, including two opened in August. We plan to open four   additional locations in the third quarter. This will bring the   total number of showrooms opened in fiscal year 2020 to 14, all   within existing states, which reflects the highest number of new   stores that we will have opened in four years. New stores   continue to operate in line with our credit and retail   expectations. As a result, we plan to open a greater number of   showrooms next fiscal year, which includes several in Florida.   With only 133 stores in 14 states, we are excited by the   significant and long-term opportunity we have to expand our   footprint. Since coming to Conn's in July, Rodney Lastinger, our new   President of Retail has quickly contributed to our success,   helping to drive better retail execution both in our new stores   and within our existing store base. Rodney's experience at Target   Corporation, managing over $21 billion in sales, 85,000 team   members and 565 stores provides Conn's with a proven leader who   understands how to properly manage, scale and develop a large   retail operation. Same-store sales in non-Hurricane Harvey impacted markets   increased 0.4%, primarily due to higher sales within our home   appliance and furniture and mattress categories. In fact, total   same-store sales of our home appliance category were up 3.4%   during the second quarter and outpaced industry growth as we have   continued to enhance our better/best assortment and go-to-market   strategy. Our furniture and mattress category grew in non-Hurricane   Harvey markets as customers continued to embrace the increasing   number of new styles and looks now present in our showrooms.   Partially offsetting these second quarter strengths were lower   sales within our consumer electronics and home office categories,   which were impacted by challenging market dynamics for TVs,   computers and gaming consoles. Overall, we continue to   strategically manage our merchandising assortment and we believe   we are well-positioned to continue growing same-store sales as a   result of our better/best product focused, attractive financing   programs and compelling retail shopping experience. Second quarter same-store sales within our Hurricane Harvey   market, which includes our largest market of Houston, continued   to demonstrate the significant contribution rebuilding efforts   had on our retail sales last fiscal year. For the quarter,   same-store sales in hurricane impacted markets were down 9.3%,   which is the smallest decline over the last four quarters and is   a 550 basis point improvement compared to the first quarter. As a   reminder, Hurricane Harvey affected several of our Texas markets,   including our home market of Houston in August 2017. It has taken   two full years for us to lap Hurricane Harvey's impact, and we   believe this current quarter will be the last period meaningfully   affected by Hurricane Harvey. Turning to e-commerce sales, which are included in same-store   sales, the second quarter reflects the transformational increase   in web visits, online applications and e-commerce sales. For the   second quarter of fiscal year 2020, e-commerce sales were $3.2   million, which is approximately 20% higher than total e-commerce   sales for all of last fiscal year. Application volume increased   sequentially as result of improvements in online platform after   the first quarter of fiscal year 2020 transition to our new   website. In addition, we are starting to see improving trends and   application volume from Hurricane Harvey market. In fact, total   application volume for the second quarter of fiscal year 2020 was   the highest second quarter amount in three years even with the   continued pressure our Harvey impacted markets have had on   application and sales volume. We are well positioned to expand e-commerce sales in the   coming quarters as our digital marketing efforts grow. Our   existing logistics infrastructure, warehouse locations and last   mile delivery capabilities are fully scalable as we already offer   next day delivery across our 14-state store network. We are   excited by the positive trends we are seeing in online traffic,   applications and sales and we believe that our ability to   transact with our customers through our e-commerce platform is an   important capability that supports our continued growth. With over 90% of our retail sales completed using one of   Conn's three credit offerings, we worked closely with both   Progressive Leasing and Synchrony Financial to optimize our third   party financing programs. Our unique and diverse credit offerings   provide significant value for our customers and partners, while   differentiating Conn's from other retailers. During the second quarter of fiscal year 2020, we understand   that our lease to own financing partner, Progressive Leasing,   modestly tightened underwriting standards for lease transactions   across many of their product category verticals, which included   all of our eligible product verticals. Progressive and Conn's   remain committed partners and we continue to believe 10% of   retail sales through Progressive's offering is achievable. In addition, we continue to work with Synchrony, our third   party partner for prime credit customers to enhance our   relationship and expand our programs to prime customers. As a   result of these efforts, sales financed through Synchrony   increased to 17.7% of total retail sales for the second quarter   of fiscal year 2020, compared to 16.4% for the same period last   fiscal year and up 200 basis points compared to Synchrony sales   for fiscal year 2017. Quickly looking at the profitability of our retail segment,   retail gross margin remained strong. We continue to benefit from   our better/best merchandising strategy. Retail gross margin was   40.5% for the second quarter, representing the fifth consecutive   quarter at or above our target rate of 40%. The 90 basis point   year-over-year decline in retail gross margin was due primarily   to the one-time benefit of increases in appliance retail pricing   related to tariff adjustments and the associated forward buys of   inventory during the second quarter of fiscal year 2019, coupled   with increased logistics costs to help support future growth   specifically related to our new Houston distribution center. I am   pleased with the continued strength of retail profitability and   the second quarter of fiscal year 2020 is in line with our   strategy to produce annual retail gross margin above 40%. Positive momentum is under way in our retail business, and we   expect the second half of fiscal year 2020 to benefit from   improving retail execution in the longer tenure of our   merchandising, marketing and operations teams. We also expect the   second half of the fiscal year to be positively impacted by new   stores, sales from our e-commerce platform and lapping the sales   impact from Hurricane Harvey. With this overview of our retail segment, let's look at the   continued positive trends under way in our credit segment. Credit   results remain strong and are in line with expected seasonal   trends. Our credit spread for the second quarter was 890 basis   points, representing the highest second quarter credit spread in   six years as a result of a net yield of 21.9% and a net   charge-off rate of 13%. On a trailing 12-month basis, our credit   spread was 920 basis points at July 31, 2019 compared to 660   basis points at July 31, 2018. As a reminder, seasonality impacts   credit performance as our core customer receives the benefits of   personal income tax refunds during the first quarter. Overall portfolio performance has benefited from stable   underwriting, the enhancements we have made in our collection of   recovery efforts and a healthy economic environment for our core   customer. As a result, the 60-plus day delinquency rate remained   stable at 8.7%, while our charge-off rate net of recoveries was   13% compared to 13.8% for the same period last fiscal year. In   addition, we continue to control new store credit performance and   first payment default rate at our new stores remain better than   the Company average. Improving our recovery process remains a strategic focus as   higher cash recoveries result in lower net charge-offs and   reduced loss rates on our allowance for bad debt. For the second   quarter of fiscal year 2020, we collected $6.1 million of   recoveries, a 26% increase from the same period last fiscal year.   Year-to-date, we have collected $12.5 million and we remain on   track to collect over $20 million in recoveries this fiscal   year. As our trailing 12-month credit spread demonstrates the   majority of our portfolio, including recent originations, is in   line with our 1,000 basis point annual credit spread target. As a   result, our sophisticated underwriting team continues to analyze   and segment our portfolio to identify and test incremental sales   opportunities. We remain focused on maintaining a stable credit business and   I am confident in our ability to manage risk going forward, even   as growth accelerates. Positive same-store sales and   non-Hurricane Harvey impacted markets, higher total application   volume and growth in e-commerce sales demonstrates the positive   momentum under way in our business. As a result, we believe we   are well-positioned to achieve total annual retail sales growth   of 8% to 10% in the coming quarters. At this level of growth, we   can manage the credit segment with our 1,000 basis point spread   target while achieving annual retail gross margin of at least 40%   in leveraging SG&A expenses. This is the foundation of a very   powerful and sustainable business model and I am extremely   excited by the opportunities we have in fiscal year 2020 and   beyond. With this, let me turn the call over to George.  George L. Bchara    --   Chief Financial Officer  Thanks Lee. I'm pleased to report results in line with or   better than our guidance across every financial measure. On a   consolidated basis, revenues increased 4.3% to $401.1 million for   the second quarter of this fiscal year from $384.6 million for   the same period last fiscal year. This helped drive an increase   in GAAP net income of 17.4% to $20 million or $0.62 per diluted   share for the second quarter of fiscal year 2020 from $17 million   or 53% per diluted share for the prior fiscal year quarter. On a non-GAAP basis, adjusting for certain charges and credit   and loss from extinguishment of debt, earnings per diluted share   were $0.62 for the second quarter of fiscal year 2020 compared to   $0.57 for the same period last fiscal year. Adjusted EBITDA was   $54 million or 13.5% of total revenue for the second quarter of   fiscal year 2020 compared to $50.4 million or 13.1% of total   revenue for the same period last fiscal year. Reconciliations of   GAAP to non-GAAP financial measures are available on our second   quarter earnings press release that was issued this morning. Looking at our retail segment in more detail, total revenues   for the second quarter increased 3.3% to $306.3 million for the   same quarter last fiscal year. Regarding the ongoing trade   negotiations and tariff, our merchandising team in partnership   with our top vendors, has made substantial progress since last   year in diversifying our production outside China and other   affected countries. For goods covered by tariffs, the higher   costs have generally been split between the parties, thereby   limiting the retail increases needed to offset the tariff.   Additional tariffs impacting consumer goods, including   electronics, computers and accessories were announced in early   August. While postponed, we believe this latest round of tariffs,   could have an impact on prices and demand for these products if   they were to go into effect. Retail SG&A expense was $88.1   million, an increase of approximately $5.1 million from the same   quarter in the prior fiscal year, while retail SG&A expense   as a percentage of revenue deleveraged 80 basis points to 28.8%,   primarily due to increased costs for new stores. I am pleased to announce that our new state-of-the-art Houston   distribution center opened in August. This LEED-certified   facility will increase the capacity and efficiency of our retail   operations within our largest market. Costs will be higher   temporarily as we wind down operations from our legacy Houston   distribution center, which we expect to be completed by the   fourth quarter. In addition, for fiscal year 2020, we plan to   open 14 stores compared to seven stores last fiscal year and only   three stores two years ago. We typically start incurring costs   associated with new stores approximately six months ahead of   opening and there will be additional expenses incurred throughout   the fiscal year as we prepare to open these locations. I also want to mention, during the second quarter, we   successfully implemented our new ERP system and we are   progressing toward a successful conversion of our new loan   management system, which we expect to be completed during the   third quarter. As you can see, we are making a number of   near-term investments to support our meaningful and long-term   growth plan. This includes higher expenses associated with new   distribution centers as well as investments in SG&A to   support accelerating new store growth and our planned Florida   expansion. While these higher costs will temporarily impact our   overall level of profitability, they are necessary investments as   we continue to expand our retail footprint and grow sales. Turning to the credit segment, finance charges and other   revenues were a second quarter record of $94.8 million, up 7.5%   from the same period last fiscal year. The increase versus the   second quarter of fiscal year 2019 was primarily due to a 60   basis point increase in the portfolio yield to 21.9% as well as   higher retrospective insurance income compared to the prior   fiscal year period. Second quarter net annualized charge-offs as a percent of the   average outstanding balance were 13%, an 80 basis point   improvement over the prior fiscal year period. Provision for bad   debts in the credit segment was $49.8 million for the second   quarter of fiscal year 2020, a decrease of approximately $0.8   million from the same period last fiscal year, primarily due to   strong portfolio performance. The allowance for bad debts and   uncollected interest as a percent of the total portfolio was   13.3% at July 31, 2019, which was down approximately 20 basis   points from the prior fiscal year period. SG&A expense in the   credit segment for the second quarter increased 4.4% versus the   same quarter last fiscal year and on an annualized basis as a   percentage of the average customer portfolio balance was 10.2%   compared to 10.1%. The increase in credit SG&A primarily   reflects continued investments we are making in our recovery   effort and an increase in operational expenses to support our   growth. Interest expense for the second quarter was $14.4   million, which declined 7.5% from the same period last fiscal   year, as a result of reductions in our weighted average cost of   funds. For the second quarter, annualized interest expense as a   percentage of the average portfolio balance was 3.7% compared to   4.2% for the same period last fiscal year. Average net debt as a   percentage of the average portfolio balance was approximately 62%   -- 61% for the second quarter of fiscal year 2020 compared to 62%   for the prior fiscal year period. ABS notes currently outstanding   include all classes of our 2019 A and 2018 A notes and the B and   C classes of our 2017 B note. We currently expect to complete one   additional ABS transaction during the current fiscal year. I am very pleased with the improvements we continue to make in   our capital position. We expect to fund our anticipated growth   through internally generated funds and from our existing capital   sources. As Norm mentioned, through August 29, we have   repurchased a total of 3.1 million shares at an average price of   $18.79 per share, which is approximately 6% below our book value   as of April 30th, 2019. The total amount repurchased through August 29 under our $75   million share repurchase plan was $57.9 million or 9.6% of our   outstanding shares. During the second quarter, we repurchased   $34.3 million of our common stock and funded the growth of our   customer receivables portfolio while our net debt to adjusted   EBITDA ratio declined. Before opening the call up for questions,   I want to note that we continue to expect our annual effective   tax rate to be between 25% and 27% for the current fiscal   year. With this overview, Norm, Lee and I are happy to take your   questions. Operator, Please open the call up to question. Questions and Answers:  Operator  Thank you. At this time, we'll be conducting a   question-and-answer session. [Operator Instructions] Our first   question comes from the line of John Baugh with Stifel. Please   proceed with your question.  John A. Baugh    --   Stifel, Nicolus & Company, Inc. -- Analyst  Thank you. Good morning and congratulations on a good   quarter.  Norman Miller    --   President, Chief Executive Officer and Chairman  Thank you, John.  Lee A. Wright    --   Executive Vice President and Chief Operating Officer  Good Morning.  George L. Bchara    --   Chief Financial Officer  Good Morning.  John A. Baugh    --   Stifel, Nicolus & Company, Inc. -- Analyst  What if we could start with Florida and maybe talk a little   bit about how you expect the expenses to ramp there and   importantly, the interest rate cap or regulatory environment   within that state?  Norman Miller    --   President, Chief Executive Officer and Chairman  Sure, John. I'll start off with the reason we went to Florida   and then I'll hand it to Lee and George to talk about the   SG&A side. Florida obviously is contiguous to our existing   market. So, makes a lot of sense for us. Very attractive from a   rate standpoint. We were able to charge -- it is -- it will be a   state licensed product and we'll be able to charge the 29.99% APR   and so -- and from a demographic standpoint, as you heard in our   comments, there's 21 million people in Florida, a lot of   similarities to the state of Texas from a demographic standpoint.   And we're very bullish about what it bodes from a future sales   standpoint.  Lee A. Wright    --   Executive Vice President and Chief Operating Officer  Yeah, and from an operational standpoint, John, expenses -- as   we mentioned, we've signed a lease with the distribution center   in Central Florida. It gives us that core location for our   logistics build out. We'll start incurring expenses in the fourth   quarter as we go. We'll start opening showrooms in the second   half of next year and ramp that up. Again, obviously, as you   know, when we go into new market, we will have some marketing   expenses as we enter there and make sure we get our brand name   out, but as we talked about and Norm said in the call, very   excited about Florida's long term potential. So from that   standpoint, it's certainly worth the investment, a long-term play   for us, the 40-plus stores we are going to open at the state.  John A. Baugh    --   Stifel, Nicolus & Company, Inc. -- Analyst  Great. And then, maybe we could talk again about same-store   sales, and I'm particularly interested in non-Harvey and you've   got, I assume, some building benefit from new stores you opened   over a year ago, offset by some cannibalization because all the   stores have been in existing markets. Could you talk about the   plus and the minus there and maybe how that's influencing numbers   now and how that might change going forward with the Florida   plan?  Norman Miller    --   President, Chief Executive Officer and Chairman  Yeah, John. So currently, because we didn't open that many   stores, last year seven, there's not many in the comp base. It'll   be the fourth quarter and into the first quarter of next year   when we will start to see that benefit. As you well know,   historically when the Company opened new stores, we would open   them at $8 million to $10 million in revenue in the first year.   We're now averaging between $6 million and $7 million in revenue   because of the tightened underwriting. And those stores, by the   way, are still profitable and pay back in the first year even at   those reduced initial revenue levels, but they will give us   tailwinds in future years. We believe ultimately the stores will   still mature to that $10 million on average from a revenue   standpoint and we should see tailwinds from a three to five-year   timeframe from a comp standpoint that should bode very well for   us in the next year, certainly the back half of next year as   we're lapping the significant number of stores we've added this   year.  Lee A. Wright    --   Executive Vice President and Chief Operating Officer  And John, just a follow up. As you mentioned, ultimately there   will be cannibalization in some of our existing markets as we   open the showrooms in existing states. But obviously, we strongly   believe we've seen it. We grow our overall total sales by market   significantly so it would make sense. As they become a bigger   piece, the cannibalization, we'll look at break that for you as   we used to do in the past.  John A. Baugh    --   Stifel, Nicolus & Company, Inc. -- Analyst  Okay. But is there a little bit of a drag in, say, the Q2   numbers and the Q3 expectations from cannibalization   currently?  Norman Miller    --   President, Chief Executive Officer and Chairman  Very little, John.  Lee A. Wright    --   Executive Vice President and Chief Operating Officer  Yeah.  John A. Baugh    --   Stifel, Nicolus & Company, Inc. -- Analyst  Okay. Alright, and my last question, well, I have many more,   but I'll get back in queue, huge increase in applications   processed in Q2, significant turn there. Could you talk about --   what's online, what's maybe a byproduct of -- I am comparing more   to the first quarter where I know you had some challenges with   the new online process. What -- kind of walk through the pieces   of that applications and are you seeing an increase in   applications offline, if you will, in existing non-Harvey   markets? Any way you can slice that? Thank you.  Norman Miller    --   President, Chief Executive Officer and Chairman  Thanks, John. Yeah, we always really communicated in the past   is our online applications are greater and are growing at a   faster pace than our retail applications. As you know, that's why   we changed our platform. We went through a bit of a bumpy road in   the first quarter as we transition to the new e-commerce   platform, but as we shared at the end of the first quarter, we're   seeing the impact of that new platform, the effectiveness of the   platform and we believe that's reflected not only in e-commerce   sales that Lee touched for the quarter where we were 20% higher   in e-commerce sales for the quarter for what we did the entire   prior year, we believe we're still in the very early innings of   what we can deliver from an omni-channel standpoint as a   retailer. So, very bullish about what the future bodes from both   an application which ultimately translates to sales   standpoint.  John A. Baugh    --   Stifel, Nicolus & Company, Inc. -- Analyst  Thank you, good luck.  Lee A. Wright    --   Executive Vice President and Chief Operating Officer  Thanks, John.  Norman Miller    --   President, Chief Executive Officer and Chairman  Thanks, John.  Operator  Our next question comes from the line of Brad Thomas with   KeyBanc Capital Markets. Please proceed with your question.  Bradley B. Thomas    --   Key Banc Capital Markets, Inc. -- Analyst  Yeah. Thank you. Good morning, Norm, Lee and George, and nice   results here.  Lee A. Wright    --   Executive Vice President and Chief Operating Officer  Thanks, Brad.  Norman Miller    --   President, Chief Executive Officer and Chairman  Thanks, Brad.  Bradley B. Thomas    --   Key Banc Capital Markets, Inc. -- Analyst  I guess, guys, I wanted to zoom in first, maybe on the retail   gross margin and I was hoping you could talk a little bit about   some of the puts and takes as we think about modeling it over the   next couple of quarters, particularly as you think about tariffs   starting to roll in?  Lee A. Wright    --   Executive Vice President and Chief Operating Officer  Yeah, Brad. It's Lee, good morning. So from a retail gross   margin, I think what we tried to stress on the calls, what I   continue to reiterate is that, look, we want to make sure that   we're in that 40-plus retail gross margin range and feel very   comfortable that we can keep it there. Obviously, our it's our   52nd [Phonetic] quarter at or above that rate that we we're   excited about, obviously down year-over-year, but we did talk   about from the standpoint that we did have some of those 4s and   5s [Phonetic] some of the tariffs that came in and we've bought   pre those tariff implementations. So we got a one-time benefit   from that. So, I would just point you back that we feel very   comfortable with that 40% retail gross margin piece and that's   sort of what we guided toward the next quarter in that   standpoint. So from that, yes, we look at it. That's where we   really would continue to point you toward.  Norman Miller    --   President, Chief Executive Officer and Chairman  And we have some downward pressure because of the logistic   side of the house with the new Houston DC, the opening of the   floor to DC. Both of those will -- we will incur some cost here   as we get those, the old legacy Houston DC closed and the new   floor to DC open, but even with those give and takes, we still   expect to be at or above that 40% margin level.  Bradley B. Thomas    --   Key Banc Capital Markets, Inc. -- Analyst  Okay. That's great. And as we think about the new DC and the   store openings, you'll be ramping in for next year, I guess, as   we calibrate our models, you guys are real helpful, kind of one   quarter out, giving us some line items, but as we start to think   about the fourth quarter and some of these costs coming in, any   more quantification or color you could share with us on how to   think about SG&A and some of the ramp in expenses?  George L. Bchara    --   Chief Financial Officer  Yeah. Hey, Brad. This is George. I would tell you that as we   continue to open up increasing new stores year-over-year. So this   year we're planning to open 14 stores compared to seven last year   and we talked about opening even more stores next year. We will   continue to see some deleveraging from an SG&A   standpoint.  Norman Miller    --   President, Chief Executive Officer and Chairman  But as we get to that consistent run rate basis, you'll then   start to see the leveraging from an SG&A.  Lee A. Wright    --   Executive Vice President and Chief Operating Officer  Yeah.  Bradley B. Thomas    --   Key Banc Capital Markets, Inc. -- Analyst  Okay, OK. And if I could squeeze one more in here, just on the   comments around the lease to own, that had been growing pretty   nicely the last few quarters and took kind of a step back   sequentially. I mean if you had been in line in 2Q with where it   was as a percentage of sales in 1Q, looks like comp sort of ended   up [Phonetic] about two points better. I guess, could you help us   think about -- maybe how much of a headwind that was for you here   in 2Q, is -- would 2% be a reasonable estimate?  Norman Miller    --   President, Chief Executive Officer and Chairman  I think that's reasonable, Brad, and -- but what I would say   is and as we shared in the prepared comments, it was really   driven predominantly by our partner and some things they did, not   specific to Conn's, but overall from an underwriting standpoint.   Having said that, hasn't shaken what our belief is long term on   the lease-to-own opportunities that we have. Remember, in the   past 12 months, we had 1.2 million applications submitted from a   Conn standpoint, both in-house and online and approximately   700,000 were approved, which means about 500,000 are declined. So   that speaks to the magnitude of the opportunities that exist for   us to capture and get to that, why we remain very bullish on our   ability ultimately to get to that 10% balance of sale, not at the   expense of other elements of financing, but by growing the   overall size of the pie.  Bradley B. Thomas    --   Key Banc Capital Markets, Inc. -- Analyst  Great. Thank you very much.  Operator  Our next question comes from the line of Rick Nelson with   Stephens. Please proceed with your question.  Rick Nelson    --   Stephens Inc. -- Analyst  Thanks. Good morning, guys.  Norman Miller    --   President, Chief Executive Officer and Chairman  Good morning.  George L. Bchara    --   Chief Financial Officer  Good morning.  Lee A. Wright    --   Executive Vice President and Chief Operating Officer  Morning, Rick.  Rick Nelson    --   Stephens Inc. -- Analyst  Looking at spread between Harvey and non-Harvey markets, same   store --- [Indecipherable] 11% you are guiding to a 6% spread at   the midpoint for 3Q. Do you think that spread goes away in the   fourth quarter? What is the timing you think there?  Norman Miller    --   President, Chief Executive Officer and Chairman  Yeah, we think it will be negligible in the fourth quarter,   Rick. We don't anticipate breaking out Harvey and non-Harvey in   the fourth quarter.  Rick Nelson    --   Stephens Inc. -- Analyst  Okay, gotcha. And the accelerating new store growth that you   referenced, is that number of units or is that percentage growth   rate (Speech Overlap].  George L. Bchara    --   Chief Financial Officer  The number of units.  Norman Miller    --   President, Chief Executive Officer and Chairman  Number of units.  George L. Bchara    --   Chief Financial Officer  Number of unit.  Rick Nelson    --   Stephens Inc. -- Analyst  Gotcha. And e-com, can you discuss the economics there? The   lost rate, it's interesting you referred to the store's showroom?   Do you see over the long haul, online sales accounting for a   substantial proportion of your volume?  Lee A. Wright    --   Executive Vice President and Chief Operating Officer  Well, Rick, so first of all, thanks for the call out on   showrooms. We're excited about the look and feel of our new   showrooms and existing showrooms, and I know you'll be down here   to see what our new showroom. So -- but with regard to the   e-commerce, obviously very pleased to see that we were --   actually our e-commerce revenues 20% [Phonetic] all of last year.   Certainly believe it should be a material percentage of sales,   but we really do believe that's going to be incremental sales on   top of there'll be some cannibalization that mostly new customers   able to come on. And as you referenced, we certainly are very   careful from an underwriting perspective is why we took so long   to actually offer a true omni-channel online e-commerce   experience. Look, with John Davis and team, we certainly have the   sophistication to do the proper underwriting and not take any   excessive losses. So we are excited about that going forward.  Norman Miller    --   President, Chief Executive Officer and Chairman  And just as you've seen, Rick, on our new stores, our FTDs   continue to run. They're lower than the portfolio average. From   an underwriting standpoint online, we're well aware of the risk   associated with the online consumer versus the retail in-person   consumer. So we're taking appropriate steps from an underwriting   standpoint to ensure that as we've stated, any business, that we   underwrite, always with the risk mindset of maintaining that   1,000 basis points of credit spreads.  Rick Nelson    --   Stephens Inc. -- Analyst  Okay, that's good. And I thought, the Florida expansion also   interesting. Any thoughts on how many stores you could open   across the country?  Norman Miller    --   President, Chief Executive Officer and Chairman  I know that in the past there's been numbers thrown out there,   prefer at this point not to. It is materially by several factors   bigger than what our store base is now. Out of the 50 states,   when you look at attractiveness from a from a high APR being in   the high 20s APR, there's 35 plus states that give us that   opportunity right off the bat. So when you're only in 14 of them   and Florida is obviously one, California is one and a number of   other high population states give us that opportunity in addition   to where we're at now. So, we believe we can grow at that 8% to   10% top line revenue growth for many, many years from a growth   standpoint, because our customer -- our core customer demographic   is in every city, every town, every state of the United States.   They represent about 20% of the US population. So, the potential   future growth is enormous for the Company.  Rick Nelson    --   Stephens Inc. -- Analyst  By sustaining [Indecipherable] that proportion of the   population actually would grow in a downturn?  Norman Miller    --   President, Chief Executive Officer and Chairman  That has been historically --a number of the members of the   senior leadership team, including myself and Lee and JD, have   operated in sub prime for a number of years. We've been in it in   various economic cycles and downturns. And, although there is   some impact when there is a recession, there is also a   significant opportunity that presents itself as well as more   customers enter into our core focus or demographic. So -- we   don't -- from a recessionary standpoint or a cycle standpoint, we   are aware of that, but it gives us as much opportunities as it   does the challenges that would be presented in a down cycle.  Rick Nelson    --   Stephens Inc. -- Analyst  Got it. Thanks for the color and good luck.  Norman Miller    --   President, Chief Executive Officer and Chairman  Thanks, Rick.  Lee A. Wright    --   Executive Vice President and Chief Operating Officer  Thanks, Rick.  Operator  Our next question comes from the line of Kyle Joseph with   Jefferies. Please proceed with your question.  Kyle Joseph    --   Jefferies, LLC -- Analyst  Hey, good morning, guys. Most of my questions have been asked.   Just to follow up on credit and I can wait for the queue for   this, but just to get a sense of the charge of decline   year-over-year, is that primarily from the better recoveries or   are you also basically looking for some color on frequency versus   severity in terms of losses?  Lee A. Wright    --   Executive Vice President and Chief Operating Officer  Yeah, certainly recoveries had an impact. We've been excited   about the ramp up and continued pace of our recovery effort. And   so that's the material piece, Kyle.  Kyle Joseph    --   Jefferies, LLC -- Analyst  And then from from a frequency perspective, I know you guys   talked about first payment default management at new stores, but   can you give us any sort of sense of what trends you're seeing   there?  Norman Miller    --   President, Chief Executive Officer and Chairman  Continue to be very pleased with 60-day plus delinquencies and   for FTDs, which as you know, Kyle, are the two leading indicators   of what the quality and the strength of the portfolio is. So this   year and going forward, we're not going to see the significant   increases we saw in past years because we're close to that 1,000   basis point spread and as we hit that and we achieve that, we'll   take associated incremental risk to maintain the 1,000 basis   points, but also give us retail opportunity. So, the target here   going forward, you shouldn't see significant fluctuations there   because we're within that range. So, we're targeting spread   wise.  Kyle Joseph    --   Jefferies, LLC -- Analyst  That's it for me. Thanks very much for answering my   question.  Norman Miller    --   President, Chief Executive Officer and Chairman  Thanks a lot, John.  Operator  And our next question comes from the line of Bill Ryan with   Compass Point. Please proceed with your question.  William Ryan    --   Compass Point Research & Trading -- Analyst  Thanks and good morning. A couple of questions. First, there's   obviously been a reduction in market interest rates and you   talked about doing one more securitization this year and you're   obviously going to be rolling some of the prior deals. Do you see   an opportunity with a reduction in market rates that the funding   costs might actually come down a little bit further as we   progress over the next few quarters? And secondly, going back to   the disparity between the implementation of the tariffs and the   pricing changes that you implemented, because obviously you had   an outsized retail gross margin in Q4 last year. I want to kind   of get some anticipate -- what you anticipate of what Q4, the   retail gross margin might look like. Thanks.  George L. Bchara    --   Chief Financial Officer  Hey, Bill, this is George. With respect to your first question   around interest rates, our ABL is tied to LIBOR rates. So   certainly as market rates come down, it is possible that we would   see reductions in our interest rate as a result. And then, with   respect to the second question on tariffs, I mean, we continue to   guide and feel comfortable with our 40 basis -- 40% retail gross   margin throughout the back half of the year.  Norman Miller    --   President, Chief Executive Officer and Chairman  Now, you are right, Bill, that the fourth quarter was   elevated. So, it's typically our highest quarter from from a   margin standpoint. One of our higher quarters. So -- but we don't   expect to probably be at that level. We haven't guided for   quarter four yet, but it won't be at that elevated level because   of some of the tariff and some other things -- one-time things   that occurred in that fourth quarter, but still above that 40%   for certain.  William Ryan    --   Compass Point Research & Trading -- Analyst  Okay. One last thing. In terms of lease-to-own, obviously,   some competitors introduced a lease-to-own product earlier this   year. Just want to kind of get an idea, are you seeing any   incremental competition on the lease-to-own product as well in   your stores?  Norman Miller    --   President, Chief Executive Officer and Chairman  On a very limited basis, Bill. I mean, our expectation is   ultimately probably every retailer will have some lease-to-own   product, every bricks and mortar retailer. Remember, our customer   and the ones we're attracting now, very different than what the   prime customer is targeting and attracting which is why out of   the 1.2 million applications we get, 500,000 we decline as I   mentioned earlier. So the pool we have from an opportunity to   grow our lease-to-own and to capture that 10% is within our walls   right now, even if we lose some small piece of that. And   remember, our financing is 2.5 times to 3 times better or less   expensive for a customer if they can qualify for our Conn's   financing versus having to move to a lease-to-own option.  William Ryan    --   Compass Point Research & Trading -- Analyst  All right. Thank you.  Lee A. Wright    --   Executive Vice President and Chief Operating Officer  Thanks, Bill.  Norman Miller    --   President, Chief Executive Officer and Chairman  Thanks. Bill.  Operator  Ladies and gentlemen, we have reached the end of the   question-and-answer session, and I would like to turn the call   back to Norm Miller for closing remarks.  Norman Miller    --   President, Chief Executive Officer and Chairman  Thanks. I just want to thank, first of all, our almost 5,000   associates across our stores and our distribution centers and our   call centers for their hard work each and every day and for their   contributions to our success. And I also want to thank the folks   that have -- that are interested in the Company and we look   forward to sharing our third quarter results with you later this   year. Have a great day.  Operator  [Operator Closing Remarks]  Duration: 45 minutes  Call participants:  Norman Miller    --   President, Chief Executive Officer and Chairman   Lee A. Wright    --   Executive Vice President and Chief Operating Officer   George L. Bchara    --   Chief Financial Officer   John A. Baugh    --   Stifel, Nicolus & Company, Inc. -- Analyst   Bradley B. Thomas    --   Key Banc Capital Markets, Inc. -- Analyst   Rick Nelson    --   Stephens Inc. -- Analyst   Kyle Joseph    --   Jefferies, LLC -- Analyst   William Ryan    --   Compass Point Research & Trading -- Analyst   More CONN analysis   All earnings call transcripts        10 stocks we like better than Conn's     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Conn's wasn't   one of them! That's right -- they think these 10 stocks   are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " Conn's Inc    (NASDAQ: CONN)        Q2 2020 Earnings Call       Sep 3, 2019 ,   11:00 a.m. ET ",
    " Operator ",
    "Good morning and thank you for holding. Welcome to the Conn's   Inc. Conference Call to discuss earnings for the fiscal quarter   ended July 31, 2019. My name is Dana and I will be your operator   today. During the presentation, all participants will be in a   listen-only mode. After the speaker's remarks, you will be   invited to participate in the question-and-answer session. As a   reminder, this conference call is being recorded.",
    "The Company's earnings release, dated September 3rd, 2019, was   distributed before market opened this morning and can be accessed   via the Company's Investor Relations website at ir.conns.com.",
    "During today's call, management will discuss, among other   financial performance measures, adjusted EBITDA, adjusted net   income and adjusted earnings per diluted share. Please refer to   the Company's earnings release that was issued today for a   reconciliation of these non-GAAP measures to the most comparable   GAAP measures. I must remind you that some of the statements made   in this call are forward-looking statements within the meaning of   the federal securities laws.",
    "These forward-looking statements represent the Company's   present expectations or beliefs concerning future events. The   Company cautions that such statements are necessarily based on   certain assumptions, which are subject to risks and   uncertainties, which could cause actual results to differ   materially from those indicated today. Your speakers today are   Norm Miller, the Company's CEO; Lee Wright, the Company's COO and   George Bchara, the Company's CFO.",
    "I would now like to turn the conference call over to Mr.   Miller. Please go ahead, sir.",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Good morning and welcome to Conn's Second Quarter of Fiscal   Year 2020 Earnings Conference Call. I'll begin the call with a   strategic overview. Then Lee will provide additional details on   the quarter before turning the call over to George, who will   complete our prepared remarks with additional comments on the   financial results.",
    "Our record second quarter earnings demonstrate our continued   success executing on our strategic priorities, our strong   operating performance across both our retail and credit segment   and the demand for our unique value proposition. We are pursuing   a compelling retail strategy that takes advantage of a large and   stable addressable market, and we have invested in people,   operations and systems to support our planned growth. As you may   recall, last quarter we launched our new e-commerce platform,   including the implementation of our upgraded website, which was a   significant milestone for our Company. Conn's has created an   end-to-end online solution, allowing our customer to transact   with us entirely online, using any of our financing options.",
    "I am also pleased to announce our planned expansion into the   Florida market, another significant milestone in the 129-year   history of our Company. Florida is a logical next step for our   geographic expansion as it is contiguous to our existing   footprint, is home to over 21 million people, and supports an   attractive rate environment for our in-house credit offering. To   support our future Florida locations, we recently executed a   lease agreement for an over 400,000 square foot distribution   center in Central Florida that will open in the next 12 months.   We expect the first Florida store to open in the second half of   next fiscal year. Ultimately, we believe the state of Florida   could support over 40 Conn's locations, which would represent a   significant expansion to our current store base.",
    "Our credit performance remains strong and is in line with the   strategy we outlined over three years ago. With confidence in our   underwriting and collections performance, our stable credit   segment provides us with additional opportunities to grow retail   sales and differentiate our business from other retailers.   Reflecting our optimism for the future and our desire to create   value for shareholders, I am pleased to announce that we have   repurchased $57.9 million of common stock through August 29,   which represents approximately 9.6% of our outstanding shares. As   you can see, positive momentum is accelerating across our   business and we believe fiscal year 2020 is shaping up to be a   year of strong earnings and operational growth.",
    "So with this overview, let me turn the call over to Lee, who   will provide more details on our second quarter operating   results.",
    " Lee A. Wright    --   Executive Vice President and Chief Operating Officer ",
    "Thanks, Norm. The second quarter of fiscal year 2020 is the   second best quarter of total retail sales growth in 13 quarters,   despite the continued headwind of lapping the benefit of   Hurricane Harvey rebuilding efforts had on our results last   fiscal year. Although total same store sales decreased 2.3%,   reflecting the continued impact of Hurricane Harvey, I am pleased   to announce that total retail sales increased 3.3% for the second   quarter of fiscal year 2020 and same-store sales were positive in   non-Hurricane Harvey impacted markets, highlighting the power of   our growth opportunity.",
    "Year-to-date, we have opened 10 new showrooms in existing   states, including two opened in August. We plan to open four   additional locations in the third quarter. This will bring the   total number of showrooms opened in fiscal year 2020 to 14, all   within existing states, which reflects the highest number of new   stores that we will have opened in four years. New stores   continue to operate in line with our credit and retail   expectations. As a result, we plan to open a greater number of   showrooms next fiscal year, which includes several in Florida.   With only 133 stores in 14 states, we are excited by the   significant and long-term opportunity we have to expand our   footprint.",
    "Since coming to Conn's in July, Rodney Lastinger, our new   President of Retail has quickly contributed to our success,   helping to drive better retail execution both in our new stores   and within our existing store base. Rodney's experience at Target   Corporation, managing over $21 billion in sales, 85,000 team   members and 565 stores provides Conn's with a proven leader who   understands how to properly manage, scale and develop a large   retail operation.",
    "Same-store sales in non-Hurricane Harvey impacted markets   increased 0.4%, primarily due to higher sales within our home   appliance and furniture and mattress categories. In fact, total   same-store sales of our home appliance category were up 3.4%   during the second quarter and outpaced industry growth as we have   continued to enhance our better/best assortment and go-to-market   strategy.",
    "Our furniture and mattress category grew in non-Hurricane   Harvey markets as customers continued to embrace the increasing   number of new styles and looks now present in our showrooms.   Partially offsetting these second quarter strengths were lower   sales within our consumer electronics and home office categories,   which were impacted by challenging market dynamics for TVs,   computers and gaming consoles. Overall, we continue to   strategically manage our merchandising assortment and we believe   we are well-positioned to continue growing same-store sales as a   result of our better/best product focused, attractive financing   programs and compelling retail shopping experience.",
    "Second quarter same-store sales within our Hurricane Harvey   market, which includes our largest market of Houston, continued   to demonstrate the significant contribution rebuilding efforts   had on our retail sales last fiscal year. For the quarter,   same-store sales in hurricane impacted markets were down 9.3%,   which is the smallest decline over the last four quarters and is   a 550 basis point improvement compared to the first quarter. As a   reminder, Hurricane Harvey affected several of our Texas markets,   including our home market of Houston in August 2017. It has taken   two full years for us to lap Hurricane Harvey's impact, and we   believe this current quarter will be the last period meaningfully   affected by Hurricane Harvey.",
    "Turning to e-commerce sales, which are included in same-store   sales, the second quarter reflects the transformational increase   in web visits, online applications and e-commerce sales. For the   second quarter of fiscal year 2020, e-commerce sales were $3.2   million, which is approximately 20% higher than total e-commerce   sales for all of last fiscal year. Application volume increased   sequentially as result of improvements in online platform after   the first quarter of fiscal year 2020 transition to our new   website. In addition, we are starting to see improving trends and   application volume from Hurricane Harvey market. In fact, total   application volume for the second quarter of fiscal year 2020 was   the highest second quarter amount in three years even with the   continued pressure our Harvey impacted markets have had on   application and sales volume.",
    "We are well positioned to expand e-commerce sales in the   coming quarters as our digital marketing efforts grow. Our   existing logistics infrastructure, warehouse locations and last   mile delivery capabilities are fully scalable as we already offer   next day delivery across our 14-state store network. We are   excited by the positive trends we are seeing in online traffic,   applications and sales and we believe that our ability to   transact with our customers through our e-commerce platform is an   important capability that supports our continued growth.",
    "With over 90% of our retail sales completed using one of   Conn's three credit offerings, we worked closely with both   Progressive Leasing and Synchrony Financial to optimize our third   party financing programs. Our unique and diverse credit offerings   provide significant value for our customers and partners, while   differentiating Conn's from other retailers.",
    "During the second quarter of fiscal year 2020, we understand   that our lease to own financing partner, Progressive Leasing,   modestly tightened underwriting standards for lease transactions   across many of their product category verticals, which included   all of our eligible product verticals. Progressive and Conn's   remain committed partners and we continue to believe 10% of   retail sales through Progressive's offering is achievable.",
    "In addition, we continue to work with Synchrony, our third   party partner for prime credit customers to enhance our   relationship and expand our programs to prime customers. As a   result of these efforts, sales financed through Synchrony   increased to 17.7% of total retail sales for the second quarter   of fiscal year 2020, compared to 16.4% for the same period last   fiscal year and up 200 basis points compared to Synchrony sales   for fiscal year 2017.",
    "Quickly looking at the profitability of our retail segment,   retail gross margin remained strong. We continue to benefit from   our better/best merchandising strategy. Retail gross margin was   40.5% for the second quarter, representing the fifth consecutive   quarter at or above our target rate of 40%. The 90 basis point   year-over-year decline in retail gross margin was due primarily   to the one-time benefit of increases in appliance retail pricing   related to tariff adjustments and the associated forward buys of   inventory during the second quarter of fiscal year 2019, coupled   with increased logistics costs to help support future growth   specifically related to our new Houston distribution center. I am   pleased with the continued strength of retail profitability and   the second quarter of fiscal year 2020 is in line with our   strategy to produce annual retail gross margin above 40%.",
    "Positive momentum is under way in our retail business, and we   expect the second half of fiscal year 2020 to benefit from   improving retail execution in the longer tenure of our   merchandising, marketing and operations teams. We also expect the   second half of the fiscal year to be positively impacted by new   stores, sales from our e-commerce platform and lapping the sales   impact from Hurricane Harvey.",
    "With this overview of our retail segment, let's look at the   continued positive trends under way in our credit segment. Credit   results remain strong and are in line with expected seasonal   trends. Our credit spread for the second quarter was 890 basis   points, representing the highest second quarter credit spread in   six years as a result of a net yield of 21.9% and a net   charge-off rate of 13%. On a trailing 12-month basis, our credit   spread was 920 basis points at July 31, 2019 compared to 660   basis points at July 31, 2018. As a reminder, seasonality impacts   credit performance as our core customer receives the benefits of   personal income tax refunds during the first quarter.",
    "Overall portfolio performance has benefited from stable   underwriting, the enhancements we have made in our collection of   recovery efforts and a healthy economic environment for our core   customer. As a result, the 60-plus day delinquency rate remained   stable at 8.7%, while our charge-off rate net of recoveries was   13% compared to 13.8% for the same period last fiscal year. In   addition, we continue to control new store credit performance and   first payment default rate at our new stores remain better than   the Company average.",
    "Improving our recovery process remains a strategic focus as   higher cash recoveries result in lower net charge-offs and   reduced loss rates on our allowance for bad debt. For the second   quarter of fiscal year 2020, we collected $6.1 million of   recoveries, a 26% increase from the same period last fiscal year.   Year-to-date, we have collected $12.5 million and we remain on   track to collect over $20 million in recoveries this fiscal   year.",
    "As our trailing 12-month credit spread demonstrates the   majority of our portfolio, including recent originations, is in   line with our 1,000 basis point annual credit spread target. As a   result, our sophisticated underwriting team continues to analyze   and segment our portfolio to identify and test incremental sales   opportunities.",
    "We remain focused on maintaining a stable credit business and   I am confident in our ability to manage risk going forward, even   as growth accelerates. Positive same-store sales and   non-Hurricane Harvey impacted markets, higher total application   volume and growth in e-commerce sales demonstrates the positive   momentum under way in our business. As a result, we believe we   are well-positioned to achieve total annual retail sales growth   of 8% to 10% in the coming quarters. At this level of growth, we   can manage the credit segment with our 1,000 basis point spread   target while achieving annual retail gross margin of at least 40%   in leveraging SG&A expenses. This is the foundation of a very   powerful and sustainable business model and I am extremely   excited by the opportunities we have in fiscal year 2020 and   beyond.",
    "With this, let me turn the call over to George.",
    " George L. Bchara    --   Chief Financial Officer ",
    "Thanks Lee. I'm pleased to report results in line with or   better than our guidance across every financial measure. On a   consolidated basis, revenues increased 4.3% to $401.1 million for   the second quarter of this fiscal year from $384.6 million for   the same period last fiscal year. This helped drive an increase   in GAAP net income of 17.4% to $20 million or $0.62 per diluted   share for the second quarter of fiscal year 2020 from $17 million   or 53% per diluted share for the prior fiscal year quarter.",
    "On a non-GAAP basis, adjusting for certain charges and credit   and loss from extinguishment of debt, earnings per diluted share   were $0.62 for the second quarter of fiscal year 2020 compared to   $0.57 for the same period last fiscal year. Adjusted EBITDA was   $54 million or 13.5% of total revenue for the second quarter of   fiscal year 2020 compared to $50.4 million or 13.1% of total   revenue for the same period last fiscal year. Reconciliations of   GAAP to non-GAAP financial measures are available on our second   quarter earnings press release that was issued this morning.",
    "Looking at our retail segment in more detail, total revenues   for the second quarter increased 3.3% to $306.3 million for the   same quarter last fiscal year. Regarding the ongoing trade   negotiations and tariff, our merchandising team in partnership   with our top vendors, has made substantial progress since last   year in diversifying our production outside China and other   affected countries. For goods covered by tariffs, the higher   costs have generally been split between the parties, thereby   limiting the retail increases needed to offset the tariff.   Additional tariffs impacting consumer goods, including   electronics, computers and accessories were announced in early   August. While postponed, we believe this latest round of tariffs,   could have an impact on prices and demand for these products if   they were to go into effect. Retail SG&A expense was $88.1   million, an increase of approximately $5.1 million from the same   quarter in the prior fiscal year, while retail SG&A expense   as a percentage of revenue deleveraged 80 basis points to 28.8%,   primarily due to increased costs for new stores.",
    "I am pleased to announce that our new state-of-the-art Houston   distribution center opened in August. This LEED-certified   facility will increase the capacity and efficiency of our retail   operations within our largest market. Costs will be higher   temporarily as we wind down operations from our legacy Houston   distribution center, which we expect to be completed by the   fourth quarter. In addition, for fiscal year 2020, we plan to   open 14 stores compared to seven stores last fiscal year and only   three stores two years ago. We typically start incurring costs   associated with new stores approximately six months ahead of   opening and there will be additional expenses incurred throughout   the fiscal year as we prepare to open these locations.",
    "I also want to mention, during the second quarter, we   successfully implemented our new ERP system and we are   progressing toward a successful conversion of our new loan   management system, which we expect to be completed during the   third quarter. As you can see, we are making a number of   near-term investments to support our meaningful and long-term   growth plan. This includes higher expenses associated with new   distribution centers as well as investments in SG&A to   support accelerating new store growth and our planned Florida   expansion. While these higher costs will temporarily impact our   overall level of profitability, they are necessary investments as   we continue to expand our retail footprint and grow sales.",
    "Turning to the credit segment, finance charges and other   revenues were a second quarter record of $94.8 million, up 7.5%   from the same period last fiscal year. The increase versus the   second quarter of fiscal year 2019 was primarily due to a 60   basis point increase in the portfolio yield to 21.9% as well as   higher retrospective insurance income compared to the prior   fiscal year period.",
    "Second quarter net annualized charge-offs as a percent of the   average outstanding balance were 13%, an 80 basis point   improvement over the prior fiscal year period. Provision for bad   debts in the credit segment was $49.8 million for the second   quarter of fiscal year 2020, a decrease of approximately $0.8   million from the same period last fiscal year, primarily due to   strong portfolio performance. The allowance for bad debts and   uncollected interest as a percent of the total portfolio was   13.3% at July 31, 2019, which was down approximately 20 basis   points from the prior fiscal year period. SG&A expense in the   credit segment for the second quarter increased 4.4% versus the   same quarter last fiscal year and on an annualized basis as a   percentage of the average customer portfolio balance was 10.2%   compared to 10.1%. The increase in credit SG&A primarily   reflects continued investments we are making in our recovery   effort and an increase in operational expenses to support our   growth. Interest expense for the second quarter was $14.4   million, which declined 7.5% from the same period last fiscal   year, as a result of reductions in our weighted average cost of   funds.",
    "For the second quarter, annualized interest expense as a   percentage of the average portfolio balance was 3.7% compared to   4.2% for the same period last fiscal year. Average net debt as a   percentage of the average portfolio balance was approximately 62%   -- 61% for the second quarter of fiscal year 2020 compared to 62%   for the prior fiscal year period. ABS notes currently outstanding   include all classes of our 2019 A and 2018 A notes and the B and   C classes of our 2017 B note. We currently expect to complete one   additional ABS transaction during the current fiscal year.",
    "I am very pleased with the improvements we continue to make in   our capital position. We expect to fund our anticipated growth   through internally generated funds and from our existing capital   sources. As Norm mentioned, through August 29, we have   repurchased a total of 3.1 million shares at an average price of   $18.79 per share, which is approximately 6% below our book value   as of April 30th, 2019.",
    "The total amount repurchased through August 29 under our $75   million share repurchase plan was $57.9 million or 9.6% of our   outstanding shares. During the second quarter, we repurchased   $34.3 million of our common stock and funded the growth of our   customer receivables portfolio while our net debt to adjusted   EBITDA ratio declined. Before opening the call up for questions,   I want to note that we continue to expect our annual effective   tax rate to be between 25% and 27% for the current fiscal   year.",
    "With this overview, Norm, Lee and I are happy to take your   questions. Operator, Please open the call up to question.",
    " Operator ",
    "Thank you. At this time, we'll be conducting a   question-and-answer session. [Operator Instructions] Our first   question comes from the line of John Baugh with Stifel. Please   proceed with your question.",
    " John A. Baugh    --   Stifel, Nicolus & Company, Inc. -- Analyst ",
    "Thank you. Good morning and congratulations on a good   quarter.",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Thank you, John.",
    " Lee A. Wright    --   Executive Vice President and Chief Operating Officer ",
    "Good Morning.",
    " George L. Bchara    --   Chief Financial Officer ",
    "Good Morning.",
    " John A. Baugh    --   Stifel, Nicolus & Company, Inc. -- Analyst ",
    "What if we could start with Florida and maybe talk a little   bit about how you expect the expenses to ramp there and   importantly, the interest rate cap or regulatory environment   within that state?",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Sure, John. I'll start off with the reason we went to Florida   and then I'll hand it to Lee and George to talk about the   SG&A side. Florida obviously is contiguous to our existing   market. So, makes a lot of sense for us. Very attractive from a   rate standpoint. We were able to charge -- it is -- it will be a   state licensed product and we'll be able to charge the 29.99% APR   and so -- and from a demographic standpoint, as you heard in our   comments, there's 21 million people in Florida, a lot of   similarities to the state of Texas from a demographic standpoint.   And we're very bullish about what it bodes from a future sales   standpoint.",
    " Lee A. Wright    --   Executive Vice President and Chief Operating Officer ",
    "Yeah, and from an operational standpoint, John, expenses -- as   we mentioned, we've signed a lease with the distribution center   in Central Florida. It gives us that core location for our   logistics build out. We'll start incurring expenses in the fourth   quarter as we go. We'll start opening showrooms in the second   half of next year and ramp that up. Again, obviously, as you   know, when we go into new market, we will have some marketing   expenses as we enter there and make sure we get our brand name   out, but as we talked about and Norm said in the call, very   excited about Florida's long term potential. So from that   standpoint, it's certainly worth the investment, a long-term play   for us, the 40-plus stores we are going to open at the state.",
    " John A. Baugh    --   Stifel, Nicolus & Company, Inc. -- Analyst ",
    "Great. And then, maybe we could talk again about same-store   sales, and I'm particularly interested in non-Harvey and you've   got, I assume, some building benefit from new stores you opened   over a year ago, offset by some cannibalization because all the   stores have been in existing markets. Could you talk about the   plus and the minus there and maybe how that's influencing numbers   now and how that might change going forward with the Florida   plan?",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Yeah, John. So currently, because we didn't open that many   stores, last year seven, there's not many in the comp base. It'll   be the fourth quarter and into the first quarter of next year   when we will start to see that benefit. As you well know,   historically when the Company opened new stores, we would open   them at $8 million to $10 million in revenue in the first year.   We're now averaging between $6 million and $7 million in revenue   because of the tightened underwriting. And those stores, by the   way, are still profitable and pay back in the first year even at   those reduced initial revenue levels, but they will give us   tailwinds in future years. We believe ultimately the stores will   still mature to that $10 million on average from a revenue   standpoint and we should see tailwinds from a three to five-year   timeframe from a comp standpoint that should bode very well for   us in the next year, certainly the back half of next year as   we're lapping the significant number of stores we've added this   year.",
    " Lee A. Wright    --   Executive Vice President and Chief Operating Officer ",
    "And John, just a follow up. As you mentioned, ultimately there   will be cannibalization in some of our existing markets as we   open the showrooms in existing states. But obviously, we strongly   believe we've seen it. We grow our overall total sales by market   significantly so it would make sense. As they become a bigger   piece, the cannibalization, we'll look at break that for you as   we used to do in the past.",
    " John A. Baugh    --   Stifel, Nicolus & Company, Inc. -- Analyst ",
    "Okay. But is there a little bit of a drag in, say, the Q2   numbers and the Q3 expectations from cannibalization   currently?",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Very little, John.",
    " Lee A. Wright    --   Executive Vice President and Chief Operating Officer ",
    "Yeah.",
    " John A. Baugh    --   Stifel, Nicolus & Company, Inc. -- Analyst ",
    "Okay. Alright, and my last question, well, I have many more,   but I'll get back in queue, huge increase in applications   processed in Q2, significant turn there. Could you talk about --   what's online, what's maybe a byproduct of -- I am comparing more   to the first quarter where I know you had some challenges with   the new online process. What -- kind of walk through the pieces   of that applications and are you seeing an increase in   applications offline, if you will, in existing non-Harvey   markets? Any way you can slice that? Thank you.",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Thanks, John. Yeah, we always really communicated in the past   is our online applications are greater and are growing at a   faster pace than our retail applications. As you know, that's why   we changed our platform. We went through a bit of a bumpy road in   the first quarter as we transition to the new e-commerce   platform, but as we shared at the end of the first quarter, we're   seeing the impact of that new platform, the effectiveness of the   platform and we believe that's reflected not only in e-commerce   sales that Lee touched for the quarter where we were 20% higher   in e-commerce sales for the quarter for what we did the entire   prior year, we believe we're still in the very early innings of   what we can deliver from an omni-channel standpoint as a   retailer. So, very bullish about what the future bodes from both   an application which ultimately translates to sales   standpoint.",
    " John A. Baugh    --   Stifel, Nicolus & Company, Inc. -- Analyst ",
    "Thank you, good luck.",
    " Lee A. Wright    --   Executive Vice President and Chief Operating Officer ",
    "Thanks, John.",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Thanks, John.",
    " Operator ",
    "Our next question comes from the line of Brad Thomas with   KeyBanc Capital Markets. Please proceed with your question.",
    " Bradley B. Thomas    --   Key Banc Capital Markets, Inc. -- Analyst ",
    "Yeah. Thank you. Good morning, Norm, Lee and George, and nice   results here.",
    " Lee A. Wright    --   Executive Vice President and Chief Operating Officer ",
    "Thanks, Brad.",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Thanks, Brad.",
    " Bradley B. Thomas    --   Key Banc Capital Markets, Inc. -- Analyst ",
    "I guess, guys, I wanted to zoom in first, maybe on the retail   gross margin and I was hoping you could talk a little bit about   some of the puts and takes as we think about modeling it over the   next couple of quarters, particularly as you think about tariffs   starting to roll in?",
    " Lee A. Wright    --   Executive Vice President and Chief Operating Officer ",
    "Yeah, Brad. It's Lee, good morning. So from a retail gross   margin, I think what we tried to stress on the calls, what I   continue to reiterate is that, look, we want to make sure that   we're in that 40-plus retail gross margin range and feel very   comfortable that we can keep it there. Obviously, our it's our   52nd [Phonetic] quarter at or above that rate that we we're   excited about, obviously down year-over-year, but we did talk   about from the standpoint that we did have some of those 4s and   5s [Phonetic] some of the tariffs that came in and we've bought   pre those tariff implementations. So we got a one-time benefit   from that. So, I would just point you back that we feel very   comfortable with that 40% retail gross margin piece and that's   sort of what we guided toward the next quarter in that   standpoint. So from that, yes, we look at it. That's where we   really would continue to point you toward.",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "And we have some downward pressure because of the logistic   side of the house with the new Houston DC, the opening of the   floor to DC. Both of those will -- we will incur some cost here   as we get those, the old legacy Houston DC closed and the new   floor to DC open, but even with those give and takes, we still   expect to be at or above that 40% margin level.",
    " Bradley B. Thomas    --   Key Banc Capital Markets, Inc. -- Analyst ",
    "Okay. That's great. And as we think about the new DC and the   store openings, you'll be ramping in for next year, I guess, as   we calibrate our models, you guys are real helpful, kind of one   quarter out, giving us some line items, but as we start to think   about the fourth quarter and some of these costs coming in, any   more quantification or color you could share with us on how to   think about SG&A and some of the ramp in expenses?",
    " George L. Bchara    --   Chief Financial Officer ",
    "Yeah. Hey, Brad. This is George. I would tell you that as we   continue to open up increasing new stores year-over-year. So this   year we're planning to open 14 stores compared to seven last year   and we talked about opening even more stores next year. We will   continue to see some deleveraging from an SG&A   standpoint.",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "But as we get to that consistent run rate basis, you'll then   start to see the leveraging from an SG&A.",
    " Lee A. Wright    --   Executive Vice President and Chief Operating Officer ",
    "Yeah.",
    " Bradley B. Thomas    --   Key Banc Capital Markets, Inc. -- Analyst ",
    "Okay, OK. And if I could squeeze one more in here, just on the   comments around the lease to own, that had been growing pretty   nicely the last few quarters and took kind of a step back   sequentially. I mean if you had been in line in 2Q with where it   was as a percentage of sales in 1Q, looks like comp sort of ended   up [Phonetic] about two points better. I guess, could you help us   think about -- maybe how much of a headwind that was for you here   in 2Q, is -- would 2% be a reasonable estimate?",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "I think that's reasonable, Brad, and -- but what I would say   is and as we shared in the prepared comments, it was really   driven predominantly by our partner and some things they did, not   specific to Conn's, but overall from an underwriting standpoint.   Having said that, hasn't shaken what our belief is long term on   the lease-to-own opportunities that we have. Remember, in the   past 12 months, we had 1.2 million applications submitted from a   Conn standpoint, both in-house and online and approximately   700,000 were approved, which means about 500,000 are declined. So   that speaks to the magnitude of the opportunities that exist for   us to capture and get to that, why we remain very bullish on our   ability ultimately to get to that 10% balance of sale, not at the   expense of other elements of financing, but by growing the   overall size of the pie.",
    " Bradley B. Thomas    --   Key Banc Capital Markets, Inc. -- Analyst ",
    "Great. Thank you very much.",
    " Operator ",
    "Our next question comes from the line of Rick Nelson with   Stephens. Please proceed with your question.",
    " Rick Nelson    --   Stephens Inc. -- Analyst ",
    "Thanks. Good morning, guys.",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Good morning.",
    " George L. Bchara    --   Chief Financial Officer ",
    "Good morning.",
    " Lee A. Wright    --   Executive Vice President and Chief Operating Officer ",
    "Morning, Rick.",
    " Rick Nelson    --   Stephens Inc. -- Analyst ",
    "Looking at spread between Harvey and non-Harvey markets, same   store --- [Indecipherable] 11% you are guiding to a 6% spread at   the midpoint for 3Q. Do you think that spread goes away in the   fourth quarter? What is the timing you think there?",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Yeah, we think it will be negligible in the fourth quarter,   Rick. We don't anticipate breaking out Harvey and non-Harvey in   the fourth quarter.",
    " Rick Nelson    --   Stephens Inc. -- Analyst ",
    "Okay, gotcha. And the accelerating new store growth that you   referenced, is that number of units or is that percentage growth   rate (Speech Overlap].",
    " George L. Bchara    --   Chief Financial Officer ",
    "The number of units.",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Number of units.",
    " George L. Bchara    --   Chief Financial Officer ",
    "Number of unit.",
    " Rick Nelson    --   Stephens Inc. -- Analyst ",
    "Gotcha. And e-com, can you discuss the economics there? The   lost rate, it's interesting you referred to the store's showroom?   Do you see over the long haul, online sales accounting for a   substantial proportion of your volume?",
    " Lee A. Wright    --   Executive Vice President and Chief Operating Officer ",
    "Well, Rick, so first of all, thanks for the call out on   showrooms. We're excited about the look and feel of our new   showrooms and existing showrooms, and I know you'll be down here   to see what our new showroom. So -- but with regard to the   e-commerce, obviously very pleased to see that we were --   actually our e-commerce revenues 20% [Phonetic] all of last year.   Certainly believe it should be a material percentage of sales,   but we really do believe that's going to be incremental sales on   top of there'll be some cannibalization that mostly new customers   able to come on. And as you referenced, we certainly are very   careful from an underwriting perspective is why we took so long   to actually offer a true omni-channel online e-commerce   experience. Look, with John Davis and team, we certainly have the   sophistication to do the proper underwriting and not take any   excessive losses. So we are excited about that going forward.",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "And just as you've seen, Rick, on our new stores, our FTDs   continue to run. They're lower than the portfolio average. From   an underwriting standpoint online, we're well aware of the risk   associated with the online consumer versus the retail in-person   consumer. So we're taking appropriate steps from an underwriting   standpoint to ensure that as we've stated, any business, that we   underwrite, always with the risk mindset of maintaining that   1,000 basis points of credit spreads.",
    " Rick Nelson    --   Stephens Inc. -- Analyst ",
    "Okay, that's good. And I thought, the Florida expansion also   interesting. Any thoughts on how many stores you could open   across the country?",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "I know that in the past there's been numbers thrown out there,   prefer at this point not to. It is materially by several factors   bigger than what our store base is now. Out of the 50 states,   when you look at attractiveness from a from a high APR being in   the high 20s APR, there's 35 plus states that give us that   opportunity right off the bat. So when you're only in 14 of them   and Florida is obviously one, California is one and a number of   other high population states give us that opportunity in addition   to where we're at now. So, we believe we can grow at that 8% to   10% top line revenue growth for many, many years from a growth   standpoint, because our customer -- our core customer demographic   is in every city, every town, every state of the United States.   They represent about 20% of the US population. So, the potential   future growth is enormous for the Company.",
    " Rick Nelson    --   Stephens Inc. -- Analyst ",
    "By sustaining [Indecipherable] that proportion of the   population actually would grow in a downturn?",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "That has been historically --a number of the members of the   senior leadership team, including myself and Lee and JD, have   operated in sub prime for a number of years. We've been in it in   various economic cycles and downturns. And, although there is   some impact when there is a recession, there is also a   significant opportunity that presents itself as well as more   customers enter into our core focus or demographic. So -- we   don't -- from a recessionary standpoint or a cycle standpoint, we   are aware of that, but it gives us as much opportunities as it   does the challenges that would be presented in a down cycle.",
    " Rick Nelson    --   Stephens Inc. -- Analyst ",
    "Got it. Thanks for the color and good luck.",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Thanks, Rick.",
    " Lee A. Wright    --   Executive Vice President and Chief Operating Officer ",
    "Thanks, Rick.",
    " Operator ",
    "Our next question comes from the line of Kyle Joseph with   Jefferies. Please proceed with your question.",
    " Kyle Joseph    --   Jefferies, LLC -- Analyst ",
    "Hey, good morning, guys. Most of my questions have been asked.   Just to follow up on credit and I can wait for the queue for   this, but just to get a sense of the charge of decline   year-over-year, is that primarily from the better recoveries or   are you also basically looking for some color on frequency versus   severity in terms of losses?",
    " Lee A. Wright    --   Executive Vice President and Chief Operating Officer ",
    "Yeah, certainly recoveries had an impact. We've been excited   about the ramp up and continued pace of our recovery effort. And   so that's the material piece, Kyle.",
    " Kyle Joseph    --   Jefferies, LLC -- Analyst ",
    "And then from from a frequency perspective, I know you guys   talked about first payment default management at new stores, but   can you give us any sort of sense of what trends you're seeing   there?",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Continue to be very pleased with 60-day plus delinquencies and   for FTDs, which as you know, Kyle, are the two leading indicators   of what the quality and the strength of the portfolio is. So this   year and going forward, we're not going to see the significant   increases we saw in past years because we're close to that 1,000   basis point spread and as we hit that and we achieve that, we'll   take associated incremental risk to maintain the 1,000 basis   points, but also give us retail opportunity. So, the target here   going forward, you shouldn't see significant fluctuations there   because we're within that range. So, we're targeting spread   wise.",
    " Kyle Joseph    --   Jefferies, LLC -- Analyst ",
    "That's it for me. Thanks very much for answering my   question.",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Thanks a lot, John.",
    " Operator ",
    "And our next question comes from the line of Bill Ryan with   Compass Point. Please proceed with your question.",
    " William Ryan    --   Compass Point Research & Trading -- Analyst ",
    "Thanks and good morning. A couple of questions. First, there's   obviously been a reduction in market interest rates and you   talked about doing one more securitization this year and you're   obviously going to be rolling some of the prior deals. Do you see   an opportunity with a reduction in market rates that the funding   costs might actually come down a little bit further as we   progress over the next few quarters? And secondly, going back to   the disparity between the implementation of the tariffs and the   pricing changes that you implemented, because obviously you had   an outsized retail gross margin in Q4 last year. I want to kind   of get some anticipate -- what you anticipate of what Q4, the   retail gross margin might look like. Thanks.",
    " George L. Bchara    --   Chief Financial Officer ",
    "Hey, Bill, this is George. With respect to your first question   around interest rates, our ABL is tied to LIBOR rates. So   certainly as market rates come down, it is possible that we would   see reductions in our interest rate as a result. And then, with   respect to the second question on tariffs, I mean, we continue to   guide and feel comfortable with our 40 basis -- 40% retail gross   margin throughout the back half of the year.",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Now, you are right, Bill, that the fourth quarter was   elevated. So, it's typically our highest quarter from from a   margin standpoint. One of our higher quarters. So -- but we don't   expect to probably be at that level. We haven't guided for   quarter four yet, but it won't be at that elevated level because   of some of the tariff and some other things -- one-time things   that occurred in that fourth quarter, but still above that 40%   for certain.",
    " William Ryan    --   Compass Point Research & Trading -- Analyst ",
    "Okay. One last thing. In terms of lease-to-own, obviously,   some competitors introduced a lease-to-own product earlier this   year. Just want to kind of get an idea, are you seeing any   incremental competition on the lease-to-own product as well in   your stores?",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "On a very limited basis, Bill. I mean, our expectation is   ultimately probably every retailer will have some lease-to-own   product, every bricks and mortar retailer. Remember, our customer   and the ones we're attracting now, very different than what the   prime customer is targeting and attracting which is why out of   the 1.2 million applications we get, 500,000 we decline as I   mentioned earlier. So the pool we have from an opportunity to   grow our lease-to-own and to capture that 10% is within our walls   right now, even if we lose some small piece of that. And   remember, our financing is 2.5 times to 3 times better or less   expensive for a customer if they can qualify for our Conn's   financing versus having to move to a lease-to-own option.",
    " William Ryan    --   Compass Point Research & Trading -- Analyst ",
    "All right. Thank you.",
    " Lee A. Wright    --   Executive Vice President and Chief Operating Officer ",
    "Thanks, Bill.",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Thanks. Bill.",
    " Operator ",
    "Ladies and gentlemen, we have reached the end of the   question-and-answer session, and I would like to turn the call   back to Norm Miller for closing remarks.",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    "Thanks. I just want to thank, first of all, our almost 5,000   associates across our stores and our distribution centers and our   call centers for their hard work each and every day and for their   contributions to our success. And I also want to thank the folks   that have -- that are interested in the Company and we look   forward to sharing our third quarter results with you later this   year. Have a great day.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 45 minutes ",
    " Norman Miller    --   President, Chief Executive Officer and Chairman ",
    " Lee A. Wright    --   Executive Vice President and Chief Operating Officer ",
    " George L. Bchara    --   Chief Financial Officer ",
    " John A. Baugh    --   Stifel, Nicolus & Company, Inc. -- Analyst ",
    " Bradley B. Thomas    --   Key Banc Capital Markets, Inc. -- Analyst ",
    " Rick Nelson    --   Stephens Inc. -- Analyst ",
    " Kyle Joseph    --   Jefferies, LLC -- Analyst ",
    " William Ryan    --   Compass Point Research & Trading -- Analyst ",
    " More CONN analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than Conn's     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Conn's wasn't   one of them! That's right -- they think these 10 stocks   are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 15:23:17"
}