{
  "url": "https://www.nasdaq.com/article/preciousgold-slips-as-trade-optimism-lifts-risk-assets-ecb-meeting-in-focus-20190912-00005",
  "title": "PRECIOUS-Gold slips as trade optimism lifts risk assets; ECB meeting in focus - Nasdaq.com",
  "text": [
    "    * ECB announcement expected at 1145 GMT",
    "* Palladium set for 4th session of gains (Adds comments, updates prices)",
    "By Karthika Suresh Namboothiri",
    "Spot gold XAU= dropped 0.2% to $1,494.02 per ounce as of0340 GMT. U.S. gold futures GCcv1 fell 0.1% to $1,501.70 perounce.",
    "The United States on Wednesday agreed to delay increasingtariffs on $250 billion worth of Chinese imports to Oct. 15 fromOct. 1 \"as a gesture of good will.\" urn:newsml:reuters.com:*:nW1N24C02Jurn:newsml:reuters.com:*:nL3N2624DJ",
    "U.S. President Donald Trump postponing additional tariffs onChinese goods eased trade tensions to an extent, said Brian Lan,managing director at dealer GoldSilver Central in Singapore,adding that markets will now be awaiting cues from the ECBmeeting.",
    "Hopes of a breakthrough in negotiations between the world'stwo biggest economies lifted risk sentiment, with MSCI'sbroadest index of Asia-Pacific shares outside Japan.MIAPJ0000PUS up 0.2%, and the dollar at a six-week highagainst the safe-haven yen. MKTS/GLOBUSD/",
    "The ECB meeting later in the session will be closely watchedfor clues on what measures the bank was willing to take tosupport a dampened economy amid Brexit concerns. The U.S.Federal Reserve is expected to do the same next week.",
    "\"There seems to be no concrete plans yet (from the ECB). Soinvestors are waiting and some of them are already starting totake profits. That's why we don't see (gold) prices fall muchfurther,\" Lan added.",
    "The ECB is set to announces its rate decision at 1145 GMT onThursday, followed by ECB President Mario Draghi's newsconference at 1230 GMT.",
    "Gold prices have dropped about 4% from a more than six-yearhigh of $1,557 it hit on Sept. 4 as renewed risk appetite andimproved economic data dampened demand for the safe-haven metal.These prices are highly sensitive to rising interest rates,which lift the opportunity cost of holding non-yielding bullion.   ",
    "Gold prices continue to hover near $1,500 an ounce, OANDAanalyst Jeffrey Halley wrote in a note. \"It implies that thereis still plenty of demand for the safe-haven asset on this dipin prices, which contrasts with the bullish euphoria elsewhere.\"",
    "Among other precious metals, silver XAG= dropped 0.2% to$18.08 per ounce, while platinum XPT= was little changed at$944.55. Meanwhile, palladium XPD= inched 0.7% higher to$1,582.26 an ounce.",
    "Palladium was on track for a fourth straight day of gains,while holding close to a two-month high of $1,590 it touched onWednesday. (Reporting by Karthika Suresh Namboothiri in Bengaluru; Editingby Rashmi Aich) ((karthikasuresh.namboothiri@thomsonreuters.com; +91 80 67490997 (If within U.S. call 651-848-5832); Reuters Messaging:karthikasuresh.namboothiri.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-12 12:03:00"
}