{
  "url": "https://www.nasdaq.com/article/ecb-to-turn-stimulus-taps-back-on-to-prop-up-ailing-economy-20190912-00069",
  "title": "ECB to turn stimulus taps back on to prop up ailing economy - Nasdaq.com",
  "text": [
    "By Balazs Koranyi and Francesco Canepa",
    "FRANKFURT, Sept 12 (Reuters) - The European Central Bank approved fresh stimulus measures on Thursday to prop up the ailing euro zone economy, cutting rates deeper into negative territory and relaunching an extended bond purchase scheme.",
    "With other major central banks easing monetary policy, Germany at risk of falling into recession and euro zone governments doing little to prop up the bloc, the ECB was left alone once again as the 'only game in town', forcing policymakers to deploy most of their few remaining tools.",
    "\"The Governing Council expects (bond purchases) to run for as long as necessary to reinforce the accommodative impact of its policy rates, and to end shortly before it starts raising the key ECB interest rates,\" it said.",
    "Such a formulation suggests that purchases could go on for years. Markets do not expect rates to rise for nearly a decade.",
    "The rate cut will increase the cost to commercial banks of parking their more than 1 trillion euros worth of excess reserves at the central bank. The ECB said it would compensate lenders for part of this charge to ensure they continued to lend to the real economy.",
    "The ECB also eased the terms of its long-term loan facility to banks and said it would introduce a multi-tier deposit rate facility to help them.",
    "\"The Governing Council now expects the key ECB interest rates to remain at their present or lower levels until it has seen the inflation outlook robustly converge to a level sufficiently close to, but below, 2%,\" the ECB added.",
    "Approving fresh asset buys just nine months after a 2.6 trillion bond purchase scheme was halted suggests that policymakers fear recession risks are rising.",
    "Data earlier on Thursday showed euro zone industrial production fell for a second month in July, while Germany's Ifo institute predicted a recession in Europe's economic powerhouse in the third quarter.",
    "Although markets had priced in a revival of asset purchases, over half a dozen conservative policymakers spoke out in public against such a scheme, leaving markets in doubt about how bold the ECB's measures would be.",
    "The decision suggests that many of these sceptics eventually agreed, giving ECB President Mario Draghi a comfortable enough majority.",
    "The single currency , which had fallen 3.5% against the dollar since the ECB began signalling an easing of its monetary policy in June, initially surged then quickly reversed course to ease. Yields on euro zone government bonds fell sharply.",
    "Attention now turns to Draghi's 1230 GMT press conference at which he will also reveal the bank's new economic projections.",
    "COMPLICATIONS",
    "With just six weeks left before Draghi hands power to Christine Lagarde, he was all but certain to push through a big stimulus package, even if each of the measures come with complications, from limited potency to negative side-effects.",
    "The ECB has persistently undershot its inflation target of almost 2% since 2013 so stimulus was essential to maintain credibility. But policy easing by central banks around the globe, including the U.S. Federal Reserve, also put the ECB in a bind.",
    "Not easing in sync with the Fed risked pushing the euro higher, which would then dampen inflation and put the bank even further away from its targets.",
    "But Draghi's critics argue that the euro zone's biggest troubles -- a global trade war, Brexit and China's slowdown -- are outside the ECB's control, so any stimulus would have a limited impact.",
    "They also argued that the bloc is merely experiencing a slowdown, not a recession, and that bond purchases, the ECB's most powerful tool, should be reserved for real crises, especially since the ECB has already used up much of its firepower in past rounds of stimulus.",
    "With Lagarde taking over on Nov. 1, some also argued that the ECB should refrain from making long-term commitments that would tie the hands of the bank's next president."
  ],
  "published_datetime": "2019-09-12 02:53:00"
}