{
  "url": "https://www.nasdaq.com/article/real-estate-firms-hurt-dubai-qatar-extends-gains-20190903-00792",
  "title": "Real estate firms hurt Dubai; Qatar extends gains - Nasdaq.com",
  "text": [
    "By Ateeq Shariff",
    "Sept 3 (Reuters) - Dubai's stock market reversed course to end lower on Tuesday, hurt by its property shares, while blue-chip lenders helped Qatar outperform major markets in the region.",
    "In Dubai, the index  fell 0.5%, with all its real estate stocks tumbling. Emaar Properties , the emirate's largest listed developer, lost 2.3%, while its units Emaar Malls  and Emaar Development  were both 2.1% and 2.2% respectively.",
    "On Monday, Dubai set up a real estate planning commission to regulate projects and avoid competition between semi-government and private firms, in a move designed to address the property market slump. ",
    "However, Emirates NBD  gained a further 2.7%, extending gains for a second day in a row. On Monday, the lender soared 14.9%, reaching its highest level since October 2007, after the bank said that it had raised its foreign ownership limit to 20% from 5% with immediate effect.",
    "The Qatari index  added 0.3%, stretching gains for the fourth straight session, with Qatar International Islamic Bank  surging 5.3% and Qatar National Bank , the Gulf's largest lender by assets, closing 1.1% higher.",
    "The Saudi index  slipped 0.6%, driven down by a 1% fall in Al Rajhi Bank , and a 2.4% drop in Riyad Bank .",
    "The index took a breather on Monday as it has been sliding since Wednesday mainly pressured by its lenders.",
    "Investment bank EFG Hermes had said on Wednesday that the investment case for Saudi banks is no longer \"compelling\" against a backdrop of receding passive fund flows and the emergence of credit quality concerns among others.",
    "Egypt's blue-chip index  declined 0.7%, snapping a four-day winning streak, with most of its blue-chip shares tumbling. Commercial International Bank  was down 0.9% and Eastern Company  traded 3.5% lower.",
    "Non-Arab foreigners were net buyers of stocks during the session and Egyptians and Arabs were net sellers, according to the stock exchange.",
    "Back in the Gulf, the Abu Dhabi index  lost 1% with First Abu Dhabi Bank , the United Arab Emirates' largest lender losing 1.1% and Abu Dhabi Commercial Bank  shedding 2.6%."
  ],
  "published_datetime": "2019-09-03 09:08:00"
}