{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-microsoft-merck-procter-gamble-united-technologies-and-coca-cola-cm1210320",
  "title": "The Zacks Analyst Blog Highlights: Microsoft, Merck, Procter & Gamble, United Technologies and Coca-Cola - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 11, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Microsoft Corp. MSFT  , Merck & Co. Inc. MRK  , The Procter & Gamble Co. PG  , United Technologies Corp. UTX  and The Coca-Cola Co. KO  .  Here are highlights from Monday's Analyst Blog:    Top Dow Stocks to Buy for the Next Rally   Wall Street rally, which started in the last week of August, maintains it momentum. Despite a sluggish U.S. economy, global economic downturn and geopolitical concerns, the stock market remained upbeat owing to renewed trade negotiations between the United States and China and rate cut hope from major central banks, especially the Fed. In line with the broader market, the Dow 30 Index ---- popularly known as the blue-chip index of Wall Street ---- gained in previous four successive trading sessions, posting its longest winning streak since the week ended Jul 15.  Dow Remains Firm Despite Fluctuations  In spite of facing extreme volatility, the Dow 30 has returned more than 15% so far in 2019. In the last week of August and the first week of September, the blue-chip index gained 3% and 1.5%, respectively. On Sep 9, the index closed in the green for four consecutive days with an average gain of nearly 0.7%. Moreover, 18 components of the 30-stock index have provided double-digit returns so far this year.  Two Major Drivers of Dow in September  The Dow is expected to maintain its current momentum for the rest of this month and further due to two immediate catalysts. First, despite an expanding U.S. economy, the market has assigned a high chance for the Fed to reduce the benchmark leading rate again in September after doing the same in July, for the first time in 11 years. Weak job growth, tepid manufacturing data, lower business spending and muted inflation are near-term concerns for the Fed. On Sep 6, Fed Chair Jerome Powell once again reiterated his pledge that the central bank will do whatever is needed to sustain U.S. economic expansion. As of Sep 9, per the CME FedWatch, there is 93.5% probability of a 25-basis point cut in the benchmark lending rate by the central bank at its next FOMC meeting on Sep 17-18 and 6.5% chance of maintaining status quo. Second, on Sep 5, China's Ministry of Commerce informed that Liu He, its top negotiator on trade, had a telephonic discussion with U.S. Trade Representative Robert Lighthizer and Treasury Secretary Steven Mnuchin to reopen the trade-related negotiation. The two sides have agreed to hold the next round of meeting at Washington, D.C. early next month for which preparatory consultations will start from mid-September. Moreover, Hu Xijin, editor-in-chief of the Global Times and an insider of the Chinese authority tweeted that \"There's more possibility of a breakthrough between the two sides,\" this time. Although market participants are not hopeful of a permanent trade deal between the two largest trading nations of the world anytime soon, a relative calm atmosphere and no further escalation of tariff war will bode well for Wall Street.  Our Top Picks  At this stage, it will be prudent to invest in Dow stocks with a favorable Zacks Rank and strong dividend yield, which will act as a regular income stream to investors. Therefore, these stocks will likely benefit from both market rally and attractive dividend. We have narrowed down our search to five such stocks, each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .  Microsoft Corp.  is one of the largest broad-based technology providers in the world. Although software is the most-important revenue source, its offerings include hardware and online services. In the fourth quarter of fiscal 2019, the company's adjusted earnings per share of $1.37 surpassed the Zacks Consensus Estimate of $1.21. Revenues of $33.72 billion also outpaced the Zacks Consensus Estimate of $32.83 billion. Microsoft has a dominant position in the desktop PC market, with its operating systems being used in the majority of PCs worldwide. Robust execution and better-than-expected demand from customers for hybrid cloud offerings drove the quarterly results. Moreover, strong Commercial business positively impacted the top and the bottom line. The company has expected earnings of 9.9% for the current year. The Zacks Consensus Estimate for the current year has improved by 2.4% over the last 60 days. Microsoft delivered positive earnings surprise in the last four quarters with an average beat of 11.7%. The stock has a dividend yield of 1.32%.  Merck & Co. Inc.  is a global research-driven pharmaceutical products company. It offers therapeutic and preventive agents to treat cardiovascular, type 2 diabetes, chronic hepatitis C virus, HIV-1 infection, intra-abdominal, fungal infection, insomnia and inflammatory diseases. In second-quarter 2019, the company's adjusted earnings per share of $1.30 surpassed the Zacks Consensus Estimate of $1.16. Revenues of $11.76 billion also outpaced the Zacks Consensus Estimate of $10.91 billion. Merck has many pipeline candidates in advanced stages of development targeting multiple disease areas such as oncology, cardiovascular diseases, diabetes, infectious diseases, neurosciences, respiratory and immunology diseases, and vaccines. Strength in cancer drug, Keytruda, and Gardasil vaccine and a strong performance in international markets, especially China were the key drivers of the company's second-quarter results. The company has expected earnings of 12.7% for the current year. The Zacks Consensus Estimate for the current year has improved by 3.2% over the last 60 days. Merck & Co. delivered positive earnings surprise in the last four quarters with an average beat of 8%. The stock has a dividend yield of 2.54%.  The Procter & Gamble Co.  provides branded consumer packaged goods to consumers in North and Latin America, Europe, the Asia Pacific, Greater China, India, the Middle East and Africa. It operates in five segments: Beauty, Grooming, Health Care, Fabric & Home Care, and Baby, Feminine & Family Care. In the fourth quarter of fiscal 2019, the company's adjusted earnings per share of $1.10 surpassed the Zacks Consensus Estimate of $1.06. Revenues of $17.09 billion also outpaced the Zacks Consensus Estimate of $16.87 billion. The Procter & Gamble focuses on improving its product portfolio through strategic initiatives, which enable it to concentrate on its fast-growing businesses. For this, the company relies on its strategy of acquiring complementary businesses. The company also follows a systematic divestiture plan to streamline its portfolio. The company has expected earnings of 7.1% for the current year. The Zacks Consensus Estimate for the current year has improved by 1.7% over the last 60 days. Procter & Gamble delivered positive earnings surprise in the last four quarters with an average beat of 2.9%. The stock has a dividend yield of 2.43%.  United Technologies Corp.  provides high-technology systems and services to the building and aerospace industries. The operations of the company are primarily classified into two principal businesses: Commercial and Aerospace. In second-quarter 2019, the company's adjusted earnings per share of $2.20 surpassed the Zacks Consensus Estimate of $2.04. Revenues of $19.63 billion also outpaced the Zacks Consensus Estimate of $19.46 billion. United Technologies intends to become more competent on the back of meaningful business acquisitions. In this context, the acquisition of Rockwell Collins is worth mentioning. The buyout has not only strengthened its existing product portfolio, but also has aided in launching innovative solutions for aerospace customers. The company has expected earnings of 5.5% for the current year. The Zacks Consensus Estimate for the current year has improved by 0.8% over the last 60 days. United Technologies delivered positive earnings surprise in the last four quarters with an average beat of 13.2%. The stock has a dividend yield of 2.20%.  The Coca-Cola Co.  is the world's largest total beverage company.  It manufactures and distributes various nonalcoholic beverages worldwide including sparkling soft drinks, water, enhanced water, and sports drinks, juice, dairy, and plant-based beverages, teas and coffees, and energy drinks. In second-quarter 2019, the company's adjusted earnings per share of 63 cents surpassed the Zacks Consensus Estimate of 62 cents. Revenues of $9.997 million also outpaced the Zacks Consensus Estimate of $9,702.6 million. The second quarter performance was driven by the focus on consumer-centric innovation, solid core brand performance and improved execution in the marketplace. The increase in organic revenues was attributed to robust performance across all segments as well as balanced volume and price/mix. The company has expected earnings of 1% for the current year. The Zacks Consensus Estimate for the current year has improved by 0.5% over the last 60 days. Coca-Cola delivered positive earnings surprise in the last four quarters with an average beat of 2.9%. The stock has a dividend yield of 2.90%.  More Stock News: This Is Bigger than the iPhone!  It could become the mother of all technological revolutions. Apple sold a mere 1 billion iPhones in 10 years but a new breakthrough is expected to generate more than 27 billion devices in just 3 years, creating a $1.7 trillion market. Zacks has just released a Special Report that spotlights this fast-emerging phenomenon and 6 tickers for taking advantage of it. If you don't buy now, you may kick yourself in 2020.   Click here for the 6 trades >>   Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Merck & Co., Inc. (MRK): Free Stock Analysis Report   Coca-Cola Company (The) (KO): Free Stock Analysis Report   Microsoft Corporation (MSFT): Free Stock Analysis Report   United Technologies Corporation (UTX): Free Stock Analysis Report   Procter & Gamble Company (The) (PG): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 11, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Microsoft Corp. MSFT  , Merck & Co. Inc. MRK  , The Procter & Gamble Co. PG  , United Technologies Corp. UTX  and The Coca-Cola Co. KO  .",
    " Here are highlights from Monday's Analyst Blog: ",
    "  Top Dow Stocks to Buy for the Next Rally  ",
    "Wall Street rally, which started in the last week of August, maintains it momentum. Despite a sluggish U.S. economy, global economic downturn and geopolitical concerns, the stock market remained upbeat owing to renewed trade negotiations between the United States and China and rate cut hope from major central banks, especially the Fed.",
    "In line with the broader market, the Dow 30 Index ---- popularly known as the blue-chip index of Wall Street ---- gained in previous four successive trading sessions, posting its longest winning streak since the week ended Jul 15.",
    " Dow Remains Firm Despite Fluctuations ",
    "In spite of facing extreme volatility, the Dow 30 has returned more than 15% so far in 2019. In the last week of August and the first week of September, the blue-chip index gained 3% and 1.5%, respectively. On Sep 9, the index closed in the green for four consecutive days with an average gain of nearly 0.7%. Moreover, 18 components of the 30-stock index have provided double-digit returns so far this year.",
    " Two Major Drivers of Dow in September ",
    "The Dow is expected to maintain its current momentum for the rest of this month and further due to two immediate catalysts.",
    "First, despite an expanding U.S. economy, the market has assigned a high chance for the Fed to reduce the benchmark leading rate again in September after doing the same in July, for the first time in 11 years. Weak job growth, tepid manufacturing data, lower business spending and muted inflation are near-term concerns for the Fed.",
    "On Sep 6, Fed Chair Jerome Powell once again reiterated his pledge that the central bank will do whatever is needed to sustain U.S. economic expansion. As of Sep 9, per the CME FedWatch, there is 93.5% probability of a 25-basis point cut in the benchmark lending rate by the central bank at its next FOMC meeting on Sep 17-18 and 6.5% chance of maintaining status quo.",
    "Second, on Sep 5, China's Ministry of Commerce informed that Liu He, its top negotiator on trade, had a telephonic discussion with U.S. Trade Representative Robert Lighthizer and Treasury Secretary Steven Mnuchin to reopen the trade-related negotiation. The two sides have agreed to hold the next round of meeting at Washington, D.C. early next month for which preparatory consultations will start from mid-September.",
    "Moreover, Hu Xijin, editor-in-chief of the Global Times and an insider of the Chinese authority tweeted that \"There's more possibility of a breakthrough between the two sides,\" this time. Although market participants are not hopeful of a permanent trade deal between the two largest trading nations of the world anytime soon, a relative calm atmosphere and no further escalation of tariff war will bode well for Wall Street.",
    " Our Top Picks ",
    "At this stage, it will be prudent to invest in Dow stocks with a favorable Zacks Rank and strong dividend yield, which will act as a regular income stream to investors. Therefore, these stocks will likely benefit from both market rally and attractive dividend.",
    "We have narrowed down our search to five such stocks, each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    " Microsoft Corp.  is one of the largest broad-based technology providers in the world. Although software is the most-important revenue source, its offerings include hardware and online services.",
    "In the fourth quarter of fiscal 2019, the company's adjusted earnings per share of $1.37 surpassed the Zacks Consensus Estimate of $1.21. Revenues of $33.72 billion also outpaced the Zacks Consensus Estimate of $32.83 billion.",
    "Microsoft has a dominant position in the desktop PC market, with its operating systems being used in the majority of PCs worldwide. Robust execution and better-than-expected demand from customers for hybrid cloud offerings drove the quarterly results. Moreover, strong Commercial business positively impacted the top and the bottom line.",
    "The company has expected earnings of 9.9% for the current year. The Zacks Consensus Estimate for the current year has improved by 2.4% over the last 60 days. Microsoft delivered positive earnings surprise in the last four quarters with an average beat of 11.7%. The stock has a dividend yield of 1.32%.",
    " Merck & Co. Inc.  is a global research-driven pharmaceutical products company. It offers therapeutic and preventive agents to treat cardiovascular, type 2 diabetes, chronic hepatitis C virus, HIV-1 infection, intra-abdominal, fungal infection, insomnia and inflammatory diseases.",
    "In second-quarter 2019, the company's adjusted earnings per share of $1.30 surpassed the Zacks Consensus Estimate of $1.16. Revenues of $11.76 billion also outpaced the Zacks Consensus Estimate of $10.91 billion.",
    "Merck has many pipeline candidates in advanced stages of development targeting multiple disease areas such as oncology, cardiovascular diseases, diabetes, infectious diseases, neurosciences, respiratory and immunology diseases, and vaccines. Strength in cancer drug, Keytruda, and Gardasil vaccine and a strong performance in international markets, especially China were the key drivers of the company's second-quarter results.",
    "The company has expected earnings of 12.7% for the current year. The Zacks Consensus Estimate for the current year has improved by 3.2% over the last 60 days. Merck & Co. delivered positive earnings surprise in the last four quarters with an average beat of 8%. The stock has a dividend yield of 2.54%.",
    " The Procter & Gamble Co.  provides branded consumer packaged goods to consumers in North and Latin America, Europe, the Asia Pacific, Greater China, India, the Middle East and Africa. It operates in five segments: Beauty, Grooming, Health Care, Fabric & Home Care, and Baby, Feminine & Family Care.",
    "In the fourth quarter of fiscal 2019, the company's adjusted earnings per share of $1.10 surpassed the Zacks Consensus Estimate of $1.06. Revenues of $17.09 billion also outpaced the Zacks Consensus Estimate of $16.87 billion.",
    "The Procter & Gamble focuses on improving its product portfolio through strategic initiatives, which enable it to concentrate on its fast-growing businesses. For this, the company relies on its strategy of acquiring complementary businesses. The company also follows a systematic divestiture plan to streamline its portfolio.",
    "The company has expected earnings of 7.1% for the current year. The Zacks Consensus Estimate for the current year has improved by 1.7% over the last 60 days. Procter & Gamble delivered positive earnings surprise in the last four quarters with an average beat of 2.9%. The stock has a dividend yield of 2.43%.",
    " United Technologies Corp.  provides high-technology systems and services to the building and aerospace industries. The operations of the company are primarily classified into two principal businesses: Commercial and Aerospace.",
    "In second-quarter 2019, the company's adjusted earnings per share of $2.20 surpassed the Zacks Consensus Estimate of $2.04. Revenues of $19.63 billion also outpaced the Zacks Consensus Estimate of $19.46 billion.",
    "United Technologies intends to become more competent on the back of meaningful business acquisitions. In this context, the acquisition of Rockwell Collins is worth mentioning. The buyout has not only strengthened its existing product portfolio, but also has aided in launching innovative solutions for aerospace customers.",
    "The company has expected earnings of 5.5% for the current year. The Zacks Consensus Estimate for the current year has improved by 0.8% over the last 60 days. United Technologies delivered positive earnings surprise in the last four quarters with an average beat of 13.2%. The stock has a dividend yield of 2.20%.",
    " The Coca-Cola Co.  is the world's largest total beverage company.  It manufactures and distributes various nonalcoholic beverages worldwide including sparkling soft drinks, water, enhanced water, and sports drinks, juice, dairy, and plant-based beverages, teas and coffees, and energy drinks.",
    "In second-quarter 2019, the company's adjusted earnings per share of 63 cents surpassed the Zacks Consensus Estimate of 62 cents. Revenues of $9.997 million also outpaced the Zacks Consensus Estimate of $9,702.6 million.",
    "The second quarter performance was driven by the focus on consumer-centric innovation, solid core brand performance and improved execution in the marketplace. The increase in organic revenues was attributed to robust performance across all segments as well as balanced volume and price/mix.",
    "The company has expected earnings of 1% for the current year. The Zacks Consensus Estimate for the current year has improved by 0.5% over the last 60 days. Coca-Cola delivered positive earnings surprise in the last four quarters with an average beat of 2.9%. The stock has a dividend yield of 2.90%.",
    " More Stock News: This Is Bigger than the iPhone! ",
    "It could become the mother of all technological revolutions. Apple sold a mere 1 billion iPhones in 10 years but a new breakthrough is expected to generate more than 27 billion devices in just 3 years, creating a $1.7 trillion market.",
    "Zacks has just released a Special Report that spotlights this fast-emerging phenomenon and 6 tickers for taking advantage of it. If you don't buy now, you may kick yourself in 2020.",
    "  Click here for the 6 trades >>  ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:57:00"
}