{
  "url": "https://www.nasdaq.com/article/highyield-em-currencies-to-pare-this-years-losses-in-12-months-20190905-00050",
  "title": "High-yield EM currencies to pare this year's losses in 12 months - Nasdaq.com",
  "text": [
    "By Vuyani Ndaba",
    "JOHANNESBURG, Sept 4 (Reuters) - High-yield emerging market currencies will probably pare this year's losses over the next 12 months provided monetary stimulus shows up in time in major economies to avoid a global recession, a Reuters poll found on Wednesday.",
    "These currencies have had a torrid time against the dollar this year, with investors only favouring to short the greenback against a rising gold price rather than take bets on riskier assets like the South African rand  and Brazil's real .",
    "The rand is already moving in that direction after it touched its strongest level in three weeks on Wednesday due to better-than-expected gross domestic product data released the previous day.",
    "The Turkish lira  and Argentina's peso  are forecast by foreign exchange strategists to sink further below current losses.",
    "Goldman Sachs noted the unexpected escalation in the U.S.-China trade conflict recently looks set to reinforce a number of existing trends in global markets, such as a tough environment for emerging market foreign exchange carry trades.",
    "\"Carry trades\" involve investors buying high-yield interest rate currencies, such as the rand, with funds borrowed from a low-yield currency like the dollar or Japanese yen, provided there is low volatility and liquidity.",
    "That strategy has been rather lukewarm this year.",
    "A survey showed last month that battered emerging market currencies would eventually bounce back from last month's U.S.-led trade war jitters, but risks remained high for currencies of commodity exporters inextricably linked to China.",
    "\"At some point U.S. trade policy may pivot, or other factors, for example fiscal stimulus in certain economies, may help turn negative market sentiment around,\" wrote analysts at Goldman Sachs in a recent client note.",
    "\"But policy support appears unlikely in the near term, so for now investors should lean FX risk in a cautious direction,\" it continued.",
    "Central banks across the globe are cutting rates, including in emerging markets like Brazil and Mexico, where the peso is expected to weaken due to interest rate differentials.",
    "There are also global risks in the next couple of months such as Britain crashing out of the European Union without a deal, at a time when both the UK and euro zone economies have slowed markedly.",
    "The bigger threat to the rest of the world remains the prospect of the U.S.-China trade war tipping the rest of the world into a global recession as trade links are strained by rising protectionist policies.",
    "\"Weakening growth in many key global areas...has led to concerns of recession, and with rates globally already at low levels historically, concerns centre around leaving it too late to cut,\" said Annabel Bishop, chief economist at Investec.",
    "The U.S. Federal Reserve is expected to cut interest rates again this month to keep the economic expansion, now in its 11th year, on track. Financial markets have priced in another quarter-point cut at the Fed's Sept. 17-18 policy meeting.",
    "South Africa will in the next couple of months face some risks of its own from strains over public finances due to managing its ailing economy hit by cash-strapped state power firm Eskom.",
    "Its economy grew more than expected in the second quarter due to a recovery in mining and manufacturing. However, the long-term trend in growth threatens the country's credit ratings. ",
    "\"There is a lot of negative news priced into the rand at this stage, both domestically and globally,\" said Hugo Pienaar, chief economist at the Bureau for Economic Research.",
    "\"If we could see some greater certainty on Eskom plans and some moderation in the trade war rhetoric for example, this should be rand supportive on the margin - at least relative to current levels.\""
  ],
  "published_datetime": "2019-09-05 02:15:00"
}