{
  "url": "https://www.nasdaq.com/article/validea-james-p-oshaughnessy-strategy-daily-upgrade-report-952019-cm1207695",
  "title": "Validea James P. O'Shaughnessy Strategy Daily Upgrade Report - 9/5/2019 - Nasdaq.com",
  "text": [
    "The following are today's upgrades for Validea's Growth/Value Investor model based on the published strategy of James P. O'Shaughnessy . This two strategy approach offers a large-cap value model and a growth approach that looks for persisten t earnings growth and strong relative strength.",
    "LATAM AIRLINES GROUP SA (ADR) ( LTM ) is a mid-cap growth stock in the Airline industry. The rating according to our strategy based on James P. O'Shaughnessy changed from 75% to 100% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: LATAM Airlines Group SA is a Chile-based company, which is engaged in passenger and cargo air transportation, both in the domestic markets of Chile, Peru, Argentina, Colombia, Ecuador and Brazil and in a developed series of regional and international routes in America, Europe and Oceania. These businesses are performed directly or through its subsidiaries in different countries. It operates through two segments: the Air transportation business and the Coalition and loyalty program Multiplus. It Air transportation segment corresponds to the route network for air transport. Its segment of Coalition and loyalty program called Multiplus is a frequent flyer programs, which operate as a unilateral system of loyalty that offers a flexible coalition system. The Company operates a fleet of over 329 aircrafts. Its passenger aircrafts include Airbus A319-100, Airbus A350-900, Boeing 767-300ER, Boeing 787-8, Boeing 787-9 and Boeing 777-300ER.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "Since its inception, Validea's strategy based on James P. O'Shaughnessy has returned 254.27% vs. 196.65% for the S&P 500. For more details on this strategy, click here",
    "About James P. O'Shaughnessy : Research guru and money manager James O'Shaughnessy forced many professional and amateur investors alike to rethink their investment beliefs when he published his 1996 bestseller, What Works on Wall Street. O'Shaughnessy back-tested 44 years of stock market data from the comprehensive Standard & Poor's Compustat database to find out which quantitative strategies have worked over the years and which haven't. To the surprise of many, he concluded that price/earnings ratios aren't the best indicator of a stock's value, and that small-company stocks, contrary to popular wisdom, don't as a group have an edge on large-company stocks. Today O'Shaughnessy is the Chief Investment Officer of O'Shaughnessy Asset Management.",
    "About Validea : Validea is an investment research service that follows the published strategies of investment legends. Validea offers both stock analysis and model portfolios based on gurus who have outperformed the market over the long-term, including Warren Buffett, Benjamin Graham, Peter Lynch and Martin Zweig. For more information about Validea, click here",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 08:03:46"
}