{
  "url": "https://www.nasdaq.com/article/us-china-trade-deal-a-pipe-dream-cm1206713",
  "title": "U.S.-China Trade Deal a Pipe Dream? - Nasdaq.com",
  "text": [
    "  Tuesday, September 3, 2019  makeArticleAd();  Beginning a new month of trading, we see market futures down in today's pre-market. A new round of tariffs levied in the ongoing trade war between the U.S. and China were put into place Sunday, September 1st. This will not only increase the challenges for product suppliers on both sides of the Pacific, but may also bring into question whether a new round of talks scheduled this month will happen at all.    Aside from the new hundreds of billions of dollars' worth of traded goods between the top two economies in the world, China has also filed a complaint against the U.S. with the World Trade Organization (WTO), while it also has ratcheted down costs of exports, such as appliances, to alleviate some of the purchase costs burdens of such items. Neither country has dialed back its pro-tariff rhetoric, which makes a near-term trade deal something of a pipe dream at this stage.    Futures are in the red at this hour, but up from early session lows. We currently see the U.S. 10-year bond continuing to trade sub-1.5%, with the 30-year a fairly pathetic sub-2%. We won't see the Fed return to the interest rate-cutting table for a couple weeks, which will follow next week's stepping down of Mario Draghi as President of the European Central Bank (ECB).    After today's opening bell, manufacturing and construction metrics hit the tape: specifically PMI  and ISM Manufacturing  reads for August. ISM posted a gain of 51.2% a month ago. Construction Spending  for July will also be released during regular trading hours, with a pullback having been reported in the previous month: -1.3%. These two sectors have been the engines of exceptional economic growth of the past couple years, but analysts have been looking for a slowdown here. Are we already within it?    Otherwise, the big news of the week will be the non-farm payroll report from the U.S. government on Friday. Payrolls last time around came in at 164K - below the average gains of the past couple years, but still strong enough to more than make up for retiring baby boomers. The Unemployment Rate remained steady at an historically low 3.7%.    Mark Vickery   Senior Editor    Questions or comments about this article and/or its author? Click here>>   The Hottest Tech Mega-Trend of All  Last year, it generated $8 billion in global revenues. By 2020, it's predicted to blast through the roof to $47 billion. Famed investor Mark Cuban says it will produce \"the world's first trillionaires,\" but that should still leave plenty of money for regular investors who make the right trades early.   See Zacks' 3 Best Stocks to Play This Trend     >>       Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   SPDR Dow Jones Industrial Average ETF (DIA): ETF Research Reports   Invesco QQQ (QQQ): ETF Research Reports   SPDR S&P 500 ETF (SPY): ETF Research Reports   To read this article on Zacks.com click here. ",
    " Tuesday, September 3, 2019  makeArticleAd();  Beginning a new month of trading, we see market futures down in today's pre-market. A new round of tariffs levied in the ongoing trade war between the U.S. and China were put into place Sunday, September 1st. This will not only increase the challenges for product suppliers on both sides of the Pacific, but may also bring into question whether a new round of talks scheduled this month will happen at all.    Aside from the new hundreds of billions of dollars' worth of traded goods between the top two economies in the world, China has also filed a complaint against the U.S. with the World Trade Organization (WTO), while it also has ratcheted down costs of exports, such as appliances, to alleviate some of the purchase costs burdens of such items. Neither country has dialed back its pro-tariff rhetoric, which makes a near-term trade deal something of a pipe dream at this stage.    Futures are in the red at this hour, but up from early session lows. We currently see the U.S. 10-year bond continuing to trade sub-1.5%, with the 30-year a fairly pathetic sub-2%. We won't see the Fed return to the interest rate-cutting table for a couple weeks, which will follow next week's stepping down of Mario Draghi as President of the European Central Bank (ECB).    After today's opening bell, manufacturing and construction metrics hit the tape: specifically PMI  and ISM Manufacturing  reads for August. ISM posted a gain of 51.2% a month ago. Construction Spending  for July will also be released during regular trading hours, with a pullback having been reported in the previous month: -1.3%.",
    "These two sectors have been the engines of exceptional economic growth of the past couple years, but analysts have been looking for a slowdown here. Are we already within it?    Otherwise, the big news of the week will be the non-farm payroll report from the U.S. government on Friday. Payrolls last time around came in at 164K - below the average gains of the past couple years, but still strong enough to more than make up for retiring baby boomers. The Unemployment Rate remained steady at an historically low 3.7%.    Mark Vickery   Senior Editor    Questions or comments about this article and/or its author? Click here>> ",
    " The Hottest Tech Mega-Trend of All ",
    "Last year, it generated $8 billion in global revenues. By 2020, it's predicted to blast through the roof to $47 billion. Famed investor Mark Cuban says it will produce \"the world's first trillionaires,\" but that should still leave plenty of money for regular investors who make the right trades early.",
    "  See Zacks' 3 Best Stocks to Play This Trend     >>    ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:04:00"
}