{
  "url": "https://www.nasdaq.com/article/workday-wday-shows-momentum-is-it-part-of-your-portfolio-cm1206617",
  "title": "Workday (WDAY) Shows Momentum: Is It Part of Your Portfolio? - Nasdaq.com",
  "text": [
    "  Workday Inc. WDAY  has exhibited impressive price performance in the past year. Notably, the company's stock has returned 13.1% in the past one year, outperforming the  industry  's rally of 0.4%. Meanwhile, the S&P 500 Index declined 0.2% in the same timeframe.    We note that Workday has an average positive earnings surprise of 41.4% in the trailing four quarters. Moreover, the company has a long-term expected EPS growth rate of 27.1%. Let's delve deeper and analyze the factors driving Workday's robust quarterly performances.  Q2 Results  Workday delivered second-quarter fiscal 2020 non-GAAP earnings of 44 cents per share, which beat the Zacks Consensus Estimate of 35 cents. The figure also improved from 31 cents reported in the year-ago quarter. Robust growth can primarily be attributed to improvement of 32.2% in revenues, which totaled $887.8 million. The figure outpaced the Zacks Consensus Estimate for revenues of $872 million. The upside was driven by solid growth in subscription and professional services revenues.  Outlook Encouraging  For third-quarter fiscal 2020, Workday expects subscription revenues in the range of $783-$785 million (up approximately 26% sequentially). Professional services revenues are projected at $135 million. The company raised fiscal 2020 guidance for subscription services revenues. It now expects subscription services revenues in the range of $3.06-$3.07 billion (previously $3.045-$3.06 billion). Professional services revenues are now projected to be around $520 million (previously $500 million).  Product Adoption: Key Catalysts  Workday is making every effort to enhance customer experience by adding extended capabilities and tools in Workday HCM and Workday Financial Management. In the second-quarter, the company announced the upcoming Workday 33 release, with advanced features to provide deeper integration between Workday and Adaptive Insights. The company witnessed rapid deployment of HCM solution in the second quarter. It was chosen by the likes of Gap, Stanley Black & Decker and Rockwell Automation in North America, Aldi Stores Limited in Europe, and Bunnings Group Limited in Asia-Pacific. Management is also optimistic regarding the growing clout of Workday Prism Analytics and Adaptive Insights business planning cloud offerings. Moreover, strong focus on product innovation and higher investments in introducing products is expected to provide the company a competitive edge against peers.  Buyouts & Partnerships Aids Growth  Workday announced partnership with Duo Security to integrate the latter's multi-factor authentication (MFA) technology. This will enhance security and improve functionality of Workday's user interface. Workday also acquired SkipFlag, marking another step toward its efforts to invest in areas such as ML, advanced search and natural language processing. Further, the acquisitions are likely to enhance and expand ML, AI and data analytics capabilities to drive customer satisfaction, which is a positive.  Risks Persist  However, intensifying competition from peers and higher marketing expenditure remain primary headwinds at least in the near term.  Zacks Rank & Stocks to Consider  Workday carries a Zacks Rank #3 (Hold) Some better-ranked stocks in the broader technology sector are Alibaba Group Holding Limited BABA  , Keysight Technologies Inc. KEYS  and Anixter International AXE  . All the stocks flaunt a Zacks Rank #1 (Strong Buy). You can see   the complete list of today's Zacks #1 Rank stocks   here   . Long-term earnings growth rate for Alibaba, Keysight and Anixter is currently pegged at 28%, 10% and 8%, respectively.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Alibaba Group Holding Limited (BABA): Free Stock Analysis Report   Workday, Inc. (WDAY): Free Stock Analysis Report   Keysight Technologies Inc. (KEYS): Free Stock Analysis Report   Anixter International Inc. (AXE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Workday Inc. WDAY  has exhibited impressive price performance in the past year. Notably, the company's stock has returned 13.1% in the past one year, outperforming the  industry  's rally of 0.4%. Meanwhile, the S&P 500 Index declined 0.2% in the same timeframe.",
    "We note that Workday has an average positive earnings surprise of 41.4% in the trailing four quarters. Moreover, the company has a long-term expected EPS growth rate of 27.1%.",
    "Let's delve deeper and analyze the factors driving Workday's robust quarterly performances.",
    " Q2 Results ",
    "Workday delivered second-quarter fiscal 2020 non-GAAP earnings of 44 cents per share, which beat the Zacks Consensus Estimate of 35 cents. The figure also improved from 31 cents reported in the year-ago quarter.",
    "Robust growth can primarily be attributed to improvement of 32.2% in revenues, which totaled $887.8 million. The figure outpaced the Zacks Consensus Estimate for revenues of $872 million. The upside was driven by solid growth in subscription and professional services revenues.",
    " Outlook Encouraging ",
    "For third-quarter fiscal 2020, Workday expects subscription revenues in the range of $783-$785 million (up approximately 26% sequentially). Professional services revenues are projected at $135 million.",
    "The company raised fiscal 2020 guidance for subscription services revenues. It now expects subscription services revenues in the range of $3.06-$3.07 billion (previously $3.045-$3.06 billion). Professional services revenues are now projected to be around $520 million (previously $500 million).",
    " Product Adoption: Key Catalysts ",
    "Workday is making every effort to enhance customer experience by adding extended capabilities and tools in Workday HCM and Workday Financial Management.",
    "In the second-quarter, the company announced the upcoming Workday 33 release, with advanced features to provide deeper integration between Workday and Adaptive Insights.",
    "The company witnessed rapid deployment of HCM solution in the second quarter. It was chosen by the likes of Gap, Stanley Black & Decker and Rockwell Automation in North America, Aldi Stores Limited in Europe, and Bunnings Group Limited in Asia-Pacific.",
    "Management is also optimistic regarding the growing clout of Workday Prism Analytics and Adaptive Insights business planning cloud offerings. Moreover, strong focus on product innovation and higher investments in introducing products is expected to provide the company a competitive edge against peers.",
    " Buyouts & Partnerships Aids Growth ",
    "Workday announced partnership with Duo Security to integrate the latter's multi-factor authentication (MFA) technology. This will enhance security and improve functionality of Workday's user interface.",
    "Workday also acquired SkipFlag, marking another step toward its efforts to invest in areas such as ML, advanced search and natural language processing.",
    "Further, the acquisitions are likely to enhance and expand ML, AI and data analytics capabilities to drive customer satisfaction, which is a positive.",
    " Risks Persist ",
    "However, intensifying competition from peers and higher marketing expenditure remain primary headwinds at least in the near term.",
    " Zacks Rank & Stocks to Consider ",
    "Workday carries a Zacks Rank #3 (Hold)",
    "Some better-ranked stocks in the broader technology sector are Alibaba Group Holding Limited BABA  , Keysight Technologies Inc. KEYS  and Anixter International AXE  . All the stocks flaunt a Zacks Rank #1 (Strong Buy). You can see   the complete list of today's Zacks #1 Rank stocks   here   .",
    "Long-term earnings growth rate for Alibaba, Keysight and Anixter is currently pegged at 28%, 10% and 8%, respectively.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:55:00"
}