{
  "url": "https://www.nasdaq.com/article/stocks-rally-amid-upbeat-global-headlines-cm1207556",
  "title": "Stocks Rally Amid Upbeat Global Headlines - Nasdaq.com",
  "text": [
    "The Dow logged a triple-digit gain today, with the blue-chip's recovery sparked by a positive  political development in Hong Kong   and upbeat economic data from China. This helped drive a rally in tech stocks, with Intel ( INTC  ) shares gaining more than 4%. Investors also digested a raft of Fed speeches, with comments from New York Fed President John Williams gaining attention. The voting member of the Federal Open Market Committee (FOMC) said the U.S. economy is in \"a favorable place,\" but remains \"vigilant to act as appropriate to support continuing growth.\"",
    " Continue reading for more on today's  market, including:  ",
    "The Dow Jones Industrial Average (DJI - 26,355.47)  recorded a 237.5-point, or 0.9% gain. INTC had the best day of the 27 blue-chip gainers, finishing up 4.1%, while UnitedHealth ( UNH  ) led the three Dow laggards with a 1.7% drop.",
    "The S&P 500 Index (SPX - 2,937.78)  added 31.5 points, or 1.1%, while the Nasdaq Composite (IXIC - 7,976.88)  closed up 102.7 points, or 1.3%.",
    "The Cboe Volatility Index (VIX - 17.33)   shed 2.3 points, or 11.9%.",
    " Data courtesy of      Trade-Alert      ",
    "Oil prices also rallied today, on expectations data will show a third straight weekly decline in domestic inventories. October-dated crude futures finished up $2.32, or 4.3%, to settle at $56.26 per barrel its largest one-day gain in roughly two months.",
    "Gold finished higher today, as well, shaking off early losses thanks to a weakening greenback. Gold for December delivery closed up $4.50, or 0.3%, at $1,560.40 an ounce -- the metal's highest close in six years.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 04:30:52"
}