{
  "url": "https://www.nasdaq.com/article/att-t-gains-but-lags-market-what-you-should-know-cm1207613",
  "title": "AT&T (T) Gains But Lags Market: What You Should Know - Nasdaq.com",
  "text": [
    " In the latest trading session, AT&T (T) closed at $35.72, marking a +0.96% move from the previous day. The stock lagged the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%. Heading into today, shares of the telecommunications company had gained 4.18% over the past month, outpacing the Computer and Technology sector's loss of 1.68% and the S&P 500's loss of 0.68% in that time. T will be looking to display strength as it nears its nex t earnings  release. The company is expected to report EPS of $0.94, up 4.44% from the prior-year quarter. Our most recent consensus estimate is calling for quarterly revenue of $45.45 billion, down 0.62% from the year-ago period. For the full year, our Zacks Consensus Estimates are projecting earnings of $3.57 per share and revenue of $182.76 billion, which would represent changes of +1.42% and +7.03%, respectively, from the prior year. Investors should also note any recent changes to analyst estimates for T. Recent revisions tend to reflect the latest near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 0.02% lower. T is currently sporting a Zacks Rank of #3 (Hold). Digging into valuation, T currently has a Forward P/E ratio of 9.9. This represents a discount compared to its industry's average Forward P/E of 14.82. It is also worth noting that T currently has a PEG ratio of 2.24. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Wireless National was holding an average PEG ratio of 2.24 at yesterday's closing price. The Wireless National industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 101, putting it in the top 40% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. To follow T in the coming trading sessions, be sure to utilize Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  AT&T Inc. (T): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "In the latest trading session, AT&T (T) closed at $35.72, marking a +0.96% move from the previous day. The stock lagged the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%.",
    "Heading into today, shares of the telecommunications company had gained 4.18% over the past month, outpacing the Computer and Technology sector's loss of 1.68% and the S&P 500's loss of 0.68% in that time.",
    "T will be looking to display strength as it nears its nex t earnings  release. The company is expected to report EPS of $0.94, up 4.44% from the prior-year quarter. Our most recent consensus estimate is calling for quarterly revenue of $45.45 billion, down 0.62% from the year-ago period.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of $3.57 per share and revenue of $182.76 billion, which would represent changes of +1.42% and +7.03%, respectively, from the prior year.",
    "Investors should also note any recent changes to analyst estimates for T. Recent revisions tend to reflect the latest near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 0.02% lower. T is currently sporting a Zacks Rank of #3 (Hold).",
    "Digging into valuation, T currently has a Forward P/E ratio of 9.9. This represents a discount compared to its industry's average Forward P/E of 14.82.",
    "It is also worth noting that T currently has a PEG ratio of 2.24. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Wireless National was holding an average PEG ratio of 2.24 at yesterday's closing price.",
    "The Wireless National industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 101, putting it in the top 40% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "To follow T in the coming trading sessions, be sure to utilize Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:45:26"
}