{
  "url": "https://www.nasdaq.com/article/trade-optimism-apple-push-wall-street-slightly-higher-20190911-00544",
  "title": "Trade optimism, Apple push Wall Street slightly higher - Nasdaq.com",
  "text": [
    "By Uday Sampath Kumar",
    "Sept 11 (Reuters) - U.S. stocks rose slightly on Wednesday as China's move to ease trade tensions with the United States soothed investor nerves, while shares of Apple gained a day after the launch of its latest iPhones.",
    "Apple Inc  rose 1.79% and provided the biggest boost to all three major indexes, a day after it unveiled new iPhones and rolled out a streaming TV service at a price that undercuts Disney  and Netflix . ",
    "Adding to the positive momentum, China's finance ministry exempted 16 types of U.S. goods from additional retaliatory tariffs, ahead of a planned meeting between trade negotiators. ",
    "While the move is seen as a friendly gesture to thaw relations with the United States, analysts are skeptical about how much it will move the needle in resolving a trade war that has hurt the global economy.",
    "\"The exemption could be seen as a gesture of sincerity towards the US ahead of negotiations in October, but is probably more a means of supporting the (Chinese) economy,\" Iris Pang, a Greater China economist with ING, wrote in a note.",
    "Comments from a senior White House adviser on Tuesday urging investors to be patient about resolving the dispute further downplayed expectations that a trade deal would be agreed this year. ",
    "Markets were largely subdued as investors held out on big bets ahead of stimulus decisions from central banks to stem a global slowdown. The U.S. Federal Reserve and the European Central Bank are expected to cut interest rates at their policy meetings over the next two weeks.",
    "U.S. President Donald Trump on Wednesday renewed his attacks on Fed Chairman Jerome Powell, saying that the central bank should get interest rates down to \"ZERO, or less.\"",
    "\"People will be interested to hear what is going to be said (by the Fed) next week, so until then, barring something unexpected, things will be quiet,\" said Andre Bakhos, managing director at Janlyn Capital LLC in Bernardsville, New Jersey.",
    "At 10:15 a.m. ET, the Dow Jones Industrial Average  was up 26.56 points, or 0.10%, at 26,935.99, the S&P 500  was up 6.69 points, or 0.22%, at 2,986.08 and the Nasdaq Composite  was up 46.24 points, or 0.57%, at 8,130.40.",
    "Energy stocks  led gains on the S&P 500, with Exxon Mobil Corp  and Chevron Corp  providing the biggest boost to the sector.",
    "Among other stocks, shares of Micron Technology Inc  rose 3.10% after Longbow Research upgraded its stock to \"buy\".",
    "Wynn Resorts Ltd  fell 2.44% and was among the biggest losers on the S&P 500 after the hotel operator announced a $750 million debt offering.",
    "Advancing issues outnumbered decliners by a 2.09-to-1 ratio on the NYSE and by a 2.34-to-1 ratio on the Nasdaq.",
    "The S&P index recorded 13 new 52-week highs and no new low, while the Nasdaq recorded 28 new highs and eight new lows."
  ],
  "published_datetime": "2019-09-11 10:47:00"
}