{
  "url": "https://www.nasdaq.com/article/validea-david-dreman-strategy-daily-upgrade-report-952019-cm1207694",
  "title": "Validea David Dreman Strategy Daily Upgrade Report - 9/5/2019 - Nasdaq.com",
  "text": [
    "The following are today's upgrades for Validea's Contrarian Investor model based on the published strategy of David Dreman . This contrarian strategy finds the most unpopular mid- and large-cap stocks in the market and looks for improving fundamentals.",
    "CANADIAN IMPERIAL BANK OF COMMERCE ( USA ) ( CM ) is a large-cap value stock in the Money Center Banks industry. The rating according to our strategy based on David Dreman changed from 57% to 83% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Canadian Imperial Bank of Commerce (CIBC) is a global financial institution. The Company provides a range of financial products and services to approximately 11 million individual, small business, commercial, corporate and institutional clients in Canada and around the world. The Company operates through three segments: Retail and Business Banking, Wealth Management and Capital Markets. The Company's Retail and Business Banking segment provides personal and business clients across Canada with financial advice, products and services in its banking centers or through remote channels, such as mobile advisors, telephone, online or mobile banking. The Company's Wealth Management segment provides advice and investment solutions. The Company's Capital Markets segment provides integrated credit and global market s products, investment banking advisory services and research to corporate, government and institutional clients around the world.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "SASOL LIMITED (ADR) ( SSL ) is a large-cap value stock in the Chemical Manufacturing industry. The rating according to our strategy based on David Dreman changed from 70% to 77% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Sasol Limited is an international integrated chemicals and energy company. The Company develops and commercializes technologies, and builds and operates facilities to produce a range of product streams, including liquid fuels, chemicals and low-carbon electricity. The Company's operating business units include Mining and, Exploration and Production International. Its Strategic Business Units are energy, base chemicals, performance chemicals and group functions. The Company's regional operating hubs include Southern Africa Operations and International Operations. The Company operates approximately six coal mines that supply feedstock for its Secunda (Sasol Synfuels) and Sasolburg (Sasolburg Operations) complexes in South Africa. It offers market ready fuels and oils, such as bitumen; industrial heating fuels; naphtha and illuminating paraffin transport fuels; automotive lubricants; industrial lubricants; greases; cleansers and degreasers; automotive fuels, and burner fuels.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "NAVIENT CORP ( NAVI ) is a mid-cap value stock in the Consumer Financial Services industry. The rating according to our strategy based on David Dreman changed from 69% to 83% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Navient Corporation provides asset management and business processing services to education, healthcare and government clients at the federal, state and local levels. The Company holds the portfolio of education loans insured or federally guaranteed under the Federal Family Education Loan Program (FFELP). It operates through four segments: FFELP Loans, Private Education Loans, Business Services and Other. It also holds the portfolio of Private Education Loans. It services its own portfolio of education loans, as well as education loans owned by the United States Department of Education ( ED ), financial institutions and nonprofit education lenders. It also provides business processing services to education-related clients, such as guaranty agencies and colleges and universities. It provides additional business processing services to a range of other clients, including federal agencies, state and local governments, healthcare systems and other healthcare providers and municipalities.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "Since its inception, Validea's strategy based on David Dreman has returned 110.78% vs. 196.65% for the S&P 500. For more details on this strategy, click here",
    "About David Dreman : Dreman's Kemper-Dreman High Return Fund was one of the best-performing mutual funds ever, ranking as the best of 255 funds in its peer groups from 1988 to 1998, according to Lipper Analytical Services. At the time Dreman published Contrarian Investment Strategies: The Next Generation, the fund had been ranked number one in more time periods than any of the 3,175 funds in Lipper's database. In addition to managing money, Dreman is also a longtime Forbes magazine columnist.",
    "About Validea : Validea is an investment research service that follows the published strategies of investment legends. Validea offers both stock analysis and model portfolios based on gurus who have outperformed the market over the long-term, including Warren Buffett, Benjamin Graham, Peter Lynch and Martin Zweig. For more information about Validea, click here",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 08:03:37"
}