{
  "url": "https://www.nasdaq.com/article/binance-to-list-its-new-dollar-backed-busd-stablecoin-next-week-cm1210841",
  "title": "Binance to List Its New Dollar-Backed BUSD Stablecoin Next Week - Nasdaq.com",
  "text": [
    "Binance's new dollar-backed stablecoin, BUSD, created in   partnership with the Paxos Trust Company, will be made available   for trading on the cryptocurrency exchange the week of Sept.   16.",
    "Announced on Thursday at CoinDesk's Invest: Asia conference,   Paxos co-founder Rich Teo said:",
    "\"We minted out first batch of Binance U.S. dollars. It will     be made available for trading starting next week [against] a     few trading pairs such as BTC and BNB.\"",
    " Related: PwC Report Shows Major Growth in Crypto M&A     in Asia and Europe ",
    "Earlier this month, the Paxos Trust Company, which already   issues its own dollar-backed and gold-backed stablecoins,   obtained additional regulatory approval    from the New York Department of Financial Services (NYDFS) to   issue BUSD.",
    "Now Binance will list the asset on its exchange, which is the   largest globally by trading volume, alongside a slew of other   stablecoins already listed on the platform such as USDT, USDC and   PAX.",
    "\"Launching a stablecoin approved by the New York State   Department of Financial Services (NYDFS) is a strategic step for   Binance to provide on-chain financial services for users across   the world,\" said Binance CFO Wei Zhou.",
    "This is not the first stablecoin to be created by Binance and   listed on the cryptocurrency exchange.   In July    , the Jersey arm of Binance enabled trading for its own British   pound-backed stablecoin called Binance GBP (BGBP).",
    " Related: Bobby Lee Returns With Ballet, a Crypto     Hardware Wallet for the Masses ",
    "Seeing a multi-coin future where many different \"types and   forms\" of stablecoins are traded actively on the   exchange, Zhou added:",
    "\"[We] hope to launch more compliant stablecoins backed by     fiat reserves in the future, introducing more stability to the     cryptocurrency world.\"",
    " Wei Zhou at Invest: Asia 2019, image via Christine Kim for     CoinDesk ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 05:00:43"
}