{
  "url": "https://www.nasdaq.com/article/dave-busters-play-q2-earnings-top-stock-down-on-view-cut-cm1210529",
  "title": "Dave & Buster's (PLAY) Q2 Earnings Top, Stock Down on View Cut - Nasdaq.com",
  "text": [
    "  Dave & Buster's Entertainment, Inc. PLAY  reported mixed second-quarter fiscal 2019 results, wherein earnings surpassed the Zacks Consensus Estimate but revenues marginally missed the same. This marked the company's second straight quarter of revenue miss. Furthermore, Dave & Buster's lowered its guidance for the fiscal year. Following the quarterly results and bleak view for fiscal 2019, the stock declined 14.2% in after-hours trading on Sep 10. Adjusted earnings in the first quarter came in at 90 cents per share, which outpaced the Zacks Consensus Estimate of 86 cents and increased 7.1% year over year. Results were aided by revenue and unit growth. Let's delve deeper into numbers.  Detailed Revenue Discussion  Quarterly revenues of $344.6 million in the quarter under review marginally missed the consensus mark of $345 million. However, the top line rose 8% from the prior-year quarter number. The upside was primarily driven by consistent unit growth and robust Amusements and Other revenues as well as Food and Beverage revenues. Food and Beverage revenues (40% of total revenues in the fiscal second quarter) increased 5.9% year over year to $137.9 million, and Amusement and Other revenues (60%) rose 9.4% to $206.7 million. Meanwhile, overall comps decreased 1.8% in the fiscal second quarter, comparing favorably with a 2.4% decline in the year-ago quarter. This decrease can be attributed to a 2% decrease in walk-in sales, which overshadowed a 0.1% increase in special events sales. Moreover, comps at Amusements & Other decreased 0.8%, the same declined 3.2% at Food & Beverage. Non-comparable store revenues in the reported quarter increased 62.3% from the year-ago quarter to $77.2 million.  Operating Highlights  In the second quarter, operating margin contracted roughly 100 basis points (bps) year over year to 13.4%. Net income totaled $32.4 million, up from $33.8 million registered in the prior-year quarter. Adjusted EBITDA increased 4.4% to $86 million compared with $82.4 million in the same period last year. Meanwhile, the EBITDA margin contracted 80 bps year over year to 25%.  Dave & Buster's Entertainment, Inc. Price, Consensus   and EPS Surprise         Dave & Buster's Entertainment, Inc.   price-consensus-eps-surprise-chart    |   Dave & Buster's Entertainment, Inc. Quote    Balance Sheet  As of Aug 4, 2019, cash and cash equivalents totaled $23.3 million compared with $21.6 million as of Feb 3, 2019. Long-term debt summed $552.1 million at the end of the reported quarter, up from $378.5 million at the end of Feb 3, 2019. During the fiscal second quarter, the company repurchased roughly 3.4 million shares for $137 million. On Apr 2, 2019, the company's board of directors authorized the repurchase of an additional $200-million stock, under the existing share repurchase program, through the end of fiscal 2020. Furthermore, management paid a quarterly cash dividend of 15 cents per share in the quarter under review.  Store Development  Dave & Buster's launched three stores during the fiscal second quarter in Winston-Salem, North Carolina; Natick, Massachusetts (west of Boston); and Gaithersburg, Maryland (northwest of Washington, D.C.). In fiscal 2019, management expects to open 15-16 stores in new locations, with 12% unit growth.  Fiscal 2019 Outlook  Dave & Buster's trimmed its fiscal 2019 guidance. The company expects total revenues of $1.338-$1.359 billion compared with $1.365-$1.390 billion projected earlier. Comps are anticipated to be in the range of -3.5% to -2% compared with prior guided range of down 1.5% to up 0.5%. Adjusted EBITDA is expected to be $272-$282 million, down from $274-$284 million anticipated earlier. In an effort to drive near and long-term value, the company is focusing on five priorities -revival of existing stores, building guest engagement, cost management, investment in highest-return new locations, and share repurchases and dividend payments.  Zacks Rank & Other Key Picks  Dave & Buster's has a Zacks Rank #2 (Buy). Other stocks, which warrant a look in the same space, include Chuy's Holdings, Inc. CHUY  , YUM! Brands, Inc. YUM  and Shake Shack Inc. SHAK  . Chuy's Holdings sports a Zacks Rank #1 (Strong Buy), whereas YUM! Brands and Shake Shack carry a Zacks Rank of 2. You can see  the complete list of today's Zacks #1 Rank stocks   here.   Chuy's Holdings, YUM! Brands and Shake Shack have an impressive long-term earnings growth rate of 17.5%, 12.3% and 22.5%, respectively.  makeArticleAd(); Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana. Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Shake Shack, Inc. (SHAK): Free Stock Analysis Report   Chuy's Holdings, Inc. (CHUY): Free Stock Analysis Report   Dave & Buster's Entertainment, Inc. (PLAY): Free Stock Analysis Report   Yum! Brands, Inc. (YUM): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Dave & Buster's Entertainment, Inc. PLAY  reported mixed second-quarter fiscal 2019 results, wherein earnings surpassed the Zacks Consensus Estimate but revenues marginally missed the same. This marked the company's second straight quarter of revenue miss. Furthermore, Dave & Buster's lowered its guidance for the fiscal year.",
    "Following the quarterly results and bleak view for fiscal 2019, the stock declined 14.2% in after-hours trading on Sep 10.",
    "Adjusted earnings in the first quarter came in at 90 cents per share, which outpaced the Zacks Consensus Estimate of 86 cents and increased 7.1% year over year. Results were aided by revenue and unit growth.",
    "Let's delve deeper into numbers.",
    " Detailed Revenue Discussion ",
    "Quarterly revenues of $344.6 million in the quarter under review marginally missed the consensus mark of $345 million. However, the top line rose 8% from the prior-year quarter number. The upside was primarily driven by consistent unit growth and robust Amusements and Other revenues as well as Food and Beverage revenues.",
    "Food and Beverage revenues (40% of total revenues in the fiscal second quarter) increased 5.9% year over year to $137.9 million, and Amusement and Other revenues (60%) rose 9.4% to $206.7 million.",
    "Meanwhile, overall comps decreased 1.8% in the fiscal second quarter, comparing favorably with a 2.4% decline in the year-ago quarter. This decrease can be attributed to a 2% decrease in walk-in sales, which overshadowed a 0.1% increase in special events sales. Moreover, comps at Amusements & Other decreased 0.8%, the same declined 3.2% at Food & Beverage.",
    "Non-comparable store revenues in the reported quarter increased 62.3% from the year-ago quarter to $77.2 million.",
    " Operating Highlights ",
    "In the second quarter, operating margin contracted roughly 100 basis points (bps) year over year to 13.4%.",
    "Net income totaled $32.4 million, up from $33.8 million registered in the prior-year quarter. Adjusted EBITDA increased 4.4% to $86 million compared with $82.4 million in the same period last year. Meanwhile, the EBITDA margin contracted 80 bps year over year to 25%.",
    " Dave & Buster's Entertainment, Inc. Price, Consensus   and EPS Surprise ",
    "       Dave & Buster's Entertainment, Inc.   price-consensus-eps-surprise-chart    |   Dave & Buster's Entertainment, Inc. Quote  ",
    " Dave & Buster's Entertainment, Inc.   price-consensus-eps-surprise-chart    |   Dave & Buster's Entertainment, Inc. Quote ",
    " Balance Sheet ",
    "As of Aug 4, 2019, cash and cash equivalents totaled $23.3 million compared with $21.6 million as of Feb 3, 2019.",
    "Long-term debt summed $552.1 million at the end of the reported quarter, up from $378.5 million at the end of Feb 3, 2019.",
    "During the fiscal second quarter, the company repurchased roughly 3.4 million shares for $137 million.",
    "On Apr 2, 2019, the company's board of directors authorized the repurchase of an additional $200-million stock, under the existing share repurchase program, through the end of fiscal 2020.",
    "Furthermore, management paid a quarterly cash dividend of 15 cents per share in the quarter under review.",
    " Store Development ",
    "Dave & Buster's launched three stores during the fiscal second quarter in Winston-Salem, North Carolina; Natick, Massachusetts (west of Boston); and Gaithersburg, Maryland (northwest of Washington, D.C.). In fiscal 2019, management expects to open 15-16 stores in new locations, with 12% unit growth.",
    " Fiscal 2019 Outlook ",
    "Dave & Buster's trimmed its fiscal 2019 guidance. The company expects total revenues of $1.338-$1.359 billion compared with $1.365-$1.390 billion projected earlier. Comps are anticipated to be in the range of -3.5% to -2% compared with prior guided range of down 1.5% to up 0.5%. Adjusted EBITDA is expected to be $272-$282 million, down from $274-$284 million anticipated earlier.",
    "In an effort to drive near and long-term value, the company is focusing on five priorities -revival of existing stores, building guest engagement, cost management, investment in highest-return new locations, and share repurchases and dividend payments.",
    " Zacks Rank & Other Key Picks ",
    "Dave & Buster's has a Zacks Rank #2 (Buy). Other stocks, which warrant a look in the same space, include Chuy's Holdings, Inc. CHUY  , YUM! Brands, Inc. YUM  and Shake Shack Inc. SHAK  . Chuy's Holdings sports a Zacks Rank #1 (Strong Buy), whereas YUM! Brands and Shake Shack carry a Zacks Rank of 2. You can see  the complete list of today's Zacks #1 Rank stocks   here.  ",
    "Chuy's Holdings, YUM! Brands and Shake Shack have an impressive long-term earnings growth rate of 17.5%, 12.3% and 22.5%, respectively.  makeArticleAd(); Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:49:00"
}