{
  "url": "https://www.nasdaq.com/article/global-mining-panel-looks-to-boost-accountability-after-brazil-disaster-20190911-00909",
  "title": "Global mining panel looks to boost accountability after Brazil disaster - Nasdaq.com",
  "text": [
    "By Christian Plumb",
    "BELO HORIZONTE, Brazil, Sept 11 (Reuters) - New safety standards being drawn up by a global mining industry panel will include rules to better define management accountability after Vale SA's  January tailings dam disaster, a top industry official said on Wednesday.",
    "The governance standards would help ensure independent reviews of dams and adequate disclosure of risks, said Tom Butler, president of the International Council on Mining and Metals.",
    "\"Therefore it involves governance and that's where there's potential for things to go wrong if the governance is weak or the right hand is not talking to the left.\"",
    "A draft version \"is almost ready to go out\" and is expected by late September or early October, Butler had earlier told a mining conference in Belo Horizonte, about 20 miles (30 km) from the site of January's disaster.",
    "The dam rupture in the town of Brumadinho killed nearly 250 people, sparking a push to establish global rules for building and inspection of such facilities, which contain the muddy detritus from mining iron ore, gold, copper and other minerals.",
    "That collapse came less than four years after another at a joint venture of Vale and BHP Group , which are both Council members, Butler said.",
    "An inquiry showed one factor behind the collapse was a loss of know-how over the structure's lifespan of more than 40 years, he added.",
    "\"You've got to make sure you transfer that knowledge and I think the industry recognizes that's a critical part of it we haven't been getting right,\" Butler said.",
    "While the cause of the Brumadinho disaster is still under review, some experts have suggested governance failings at the miner are partly to blame. In February, Vale's chief financial officer said senior executives had never been shown internal security documents indicating the dam was at risk of collapse.",
    "The ICMM represents about a third of the mining industry but Butler said the standards, being drawn up by a panel of eight members with expertise on tailings, health, risk and law, could influence the wider sector.",
    "A public consultation period will follow the release of the draft, with the new standards likely to be finalized and disseminated in the first quarter of 2020, he said.",
    "Panel members visited Brazil in July and more recently, British Colombia, the site of a 2014 breach at Imperial Metals Corp'sMount Polley Mine, which sent billions of gallons of wastewater and sludge into waterways."
  ],
  "published_datetime": "2019-09-11 08:14:00"
}