{
  "url": "https://www.nasdaq.com/article/dollar-tree-dltr-displays-solid-1-year-run-up-more-than-20-cm1210321",
  "title": "Dollar Tree (DLTR) Displays Solid 1-Year Run, Up More Than 20% - Nasdaq.com",
  "text": [
    "  Dollar Tree Inc. DLTR  is one of the investor favorite Discount Retail stocks, courtesy of sound fundamentals, as well as efforts to provide a hassle-free shopping experience to customers. Its initiatives like the Dollar Tree Plus! test and store-optimization efforts are likely to boost margins and profitability. We note that shares of the Chesapeake, VA-based company have advanced 29.3% in the past year compared with the industry  's growth of 19.5%.  makeArticleAd();  The Zacks Rank #3 (Hold) stock has also comfortably outperformed the Retail-Wholesale  sector's decline of 0.5% and the S&P 500 Index's growth of 1.9% in the same period. In all likelihood, Dollar Tree, with a long-term earnings growth rate of nearly 10%, can reach new heights.    You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .       Endeavors to Drive Momentum    The company's fundamental strength is highlighted by its positive earnings surprise trend recorded in three of the last four quarters, with three consecutive quarters of sales beat. Further, its robust comps trend reflects strength in Dollar Tree and Family Dollar banners, which is likely to continue. Progress on Dollar Tree's restructuring and expansion initiatives, and store optimization program for the Family Dollar brand are contributing to this robust surprise trend.    It is displaying robust comps mainly due to competitive pricing and store expansion plans, including remodeling and relocations. The company continued the positive trend as enterprise comps for second-quarter fiscal 2019 improved 2.4%. The uptick was driven by constant-currency comps growth of 2.4% in both Dollar Tree and Family Dollar segments. This marked the 46th straight quarter of comps growth for the Dollar Tree segment. Further, comps at Family Dollar marked the third consecutive quarter of sequential acceleration. The company anticipates enterprise comps growth in a low-single digit for third-quarter and fiscal 2019.    Dollar Tree is focused on further strengthening its namesake and Family Dollar banners in the wake of rising competition from the likes of Dollar General DG  , Costco Wholesale COST  and Target TGT  . We believe that its restructuring and expansion initiatives will continue to drive traffic. Notably, the company is steadily expanding store base and improving distribution centers to drive the top line. In second-quarter fiscal 2019, Dollar Tree opened 150 stores, including 107 Dollar Tree and 43 Family Dollar stores. Further, it expanded or relocated 19 outlets (including 17 Dollar Tree and two Family Dollar) and shuttered 296 Family Dollar as well as nine Dollar Tree stores. As of Aug 3, 2019, Dollar Tree operated 15,115 stores in 48 states and five Canadian provinces.    The company also added freezers and coolers in 210 Dollar Tree stores in the reported quarter, bringing the total Dollar Tree store count, with freezers and coolers, to 5,970. These actions place it on track to reach the long-term target of operating 26,000 stores, with more than 10,000 Dollar Tree and 15,000 Family Dollar outlets, across North America. Additionally, the company is on track to leverage Family Dollar and Dollar Tree distribution center systems, and combined merchandise. This will help in bringing the latest products into Dollar Tree stores without any disruptions.    Further, the smooth integration of Family Dollar, which was acquired in July 2015, is a key focus area for the company. It is undertaking significant store renovation initiatives for Family Dollar to attract more customers. As part of its store optimization program for the Family Dollar brand, the company is rolling out H2 - a latest model for the new and renovated Family Dollar stores internally. These renovations are likely to boost traffic at stores, thus lifting average comps.    Driven by the robust momentum in Family Dollar stores due to these initiatives, the company raised its targeted Family Dollar H2 renovations for fiscal 2019 by 150 stores. It now expects 1,150 Family Dollar H2 renovations to occur in fiscal 2019 compared with 1,000 mentioned earlier. The majority of the increased H2 renovations will be carried out in the fiscal third quarter.    Moreover, the company is on track to close underperforming Family Dollar stores (targeting to close about 390 stores) in fiscal 2019. Further, it plans to re-banner about 200 Family Dollar stores to Dollar Tree locations in fiscal 2019. It also expects to install adult beverages in roughly 1,000 Family Dollar stores, and expand freezers and coolers in roughly 400 Family Dollar outlets in fiscal 2019 to boost customer experience.    In addition to these, the company is testing the addition of merchandise with higher price points to its stores to boost sales and margins through the Dollar Tree Plus! initiative. Currently, it is formulating tests to measure the impact of different price points, items and categories, store profitability, and the affinity of loyal customers for the Dollar Tree brand. As part of the tests, the company will leverage Family Dollar and Dollar Tree distribution center systems, and combined merchandise to efficiently get new products to Dollar Tree stores without disrupting normal operations.    It plans to offer merchandise at price points of $3, $4 and $5, which will be displayed in end caps clearly branded as Dollar Tree Plus! to minimize confusion with the dollar value offerings that are familiar to customers. These tests are basically not intended toward raising prices of products in the Dollar price point but adding items and categories with the higher price points to boost margins and sales. By the end of June 2019, the company successfully rolled out these tests to nearly 115 stores.   Wrapping Up    As already detailed, we expect Dollar Tree's top and bottom-line momentum to continue in the quarters ahead, driven by various initiatives. The company's efforts to improve shopping experience at the Dollar Tree and Family Dollar banners position it to outpace rivals and sustain growth in the long run.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Costco Wholesale Corporation (COST): Free Stock Analysis Report   Dollar General Corporation (DG): Free Stock Analysis Report   Dollar Tree, Inc. (DLTR): Free Stock Analysis Report   Target Corporation (TGT): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Dollar Tree Inc. DLTR  is one of the investor favorite Discount Retail stocks, courtesy of sound fundamentals, as well as efforts to provide a hassle-free shopping experience to customers. Its initiatives like the Dollar Tree Plus! test and store-optimization efforts are likely to boost margins and profitability. We note that shares of the Chesapeake, VA-based company have advanced 29.3% in the past year compared with the industry  's growth of 19.5%.  makeArticleAd();  The Zacks Rank #3 (Hold) stock has also comfortably outperformed the Retail-Wholesale  sector's decline of 0.5% and the S&P 500 Index's growth of 1.9% in the same period. In all likelihood, Dollar Tree, with a long-term earnings growth rate of nearly 10%, can reach new heights.    You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    "    Endeavors to Drive Momentum    The company's fundamental strength is highlighted by its positive earnings surprise trend recorded in three of the last four quarters, with three consecutive quarters of sales beat. Further, its robust comps trend reflects strength in Dollar Tree and Family Dollar banners, which is likely to continue. Progress on Dollar Tree's restructuring and expansion initiatives, and store optimization program for the Family Dollar brand are contributing to this robust surprise trend.    It is displaying robust comps mainly due to competitive pricing and store expansion plans, including remodeling and relocations. The company continued the positive trend as enterprise comps for second-quarter fiscal 2019 improved 2.4%. The uptick was driven by constant-currency comps growth of 2.4% in both Dollar Tree and Family Dollar segments. This marked the 46th straight quarter of comps growth for the Dollar Tree segment. Further, comps at Family Dollar marked the third consecutive quarter of sequential acceleration. The company anticipates enterprise comps growth in a low-single digit for third-quarter and fiscal 2019.    Dollar Tree is focused on further strengthening its namesake and Family Dollar banners in the wake of rising competition from the likes of Dollar General DG  , Costco Wholesale COST  and Target TGT  . We believe that its restructuring and expansion initiatives will continue to drive traffic.",
    "Notably, the company is steadily expanding store base and improving distribution centers to drive the top line. In second-quarter fiscal 2019, Dollar Tree opened 150 stores, including 107 Dollar Tree and 43 Family Dollar stores. Further, it expanded or relocated 19 outlets (including 17 Dollar Tree and two Family Dollar) and shuttered 296 Family Dollar as well as nine Dollar Tree stores. As of Aug 3, 2019, Dollar Tree operated 15,115 stores in 48 states and five Canadian provinces.    The company also added freezers and coolers in 210 Dollar Tree stores in the reported quarter, bringing the total Dollar Tree store count, with freezers and coolers, to 5,970. These actions place it on track to reach the long-term target of operating 26,000 stores, with more than 10,000 Dollar Tree and 15,000 Family Dollar outlets, across North America. Additionally, the company is on track to leverage Family Dollar and Dollar Tree distribution center systems, and combined merchandise. This will help in bringing the latest products into Dollar Tree stores without any disruptions.    Further, the smooth integration of Family Dollar, which was acquired in July 2015, is a key focus area for the company. It is undertaking significant store renovation initiatives for Family Dollar to attract more customers. As part of its store optimization program for the Family Dollar brand, the company is rolling out H2 - a latest model for the new and renovated Family Dollar stores internally. These renovations are likely to boost traffic at stores, thus lifting average comps.    Driven by the robust momentum in Family Dollar stores due to these initiatives, the company raised its targeted Family Dollar H2 renovations for fiscal 2019 by 150 stores. It now expects 1,150 Family Dollar H2 renovations to occur in fiscal 2019 compared with 1,000 mentioned earlier. The majority of the increased H2 renovations will be carried out in the fiscal third quarter.    Moreover, the company is on track to close underperforming Family Dollar stores (targeting to close about 390 stores) in fiscal 2019. Further, it plans to re-banner about 200 Family Dollar stores to Dollar Tree locations in fiscal 2019. It also expects to install adult beverages in roughly 1,000 Family Dollar stores, and expand freezers and coolers in roughly 400 Family Dollar outlets in fiscal 2019 to boost customer experience.    In addition to these, the company is testing the addition of merchandise with higher price points to its stores to boost sales and margins through the Dollar Tree Plus! initiative. Currently, it is formulating tests to measure the impact of different price points, items and categories, store profitability, and the affinity of loyal customers for the Dollar Tree brand. As part of the tests, the company will leverage Family Dollar and Dollar Tree distribution center systems, and combined merchandise to efficiently get new products to Dollar Tree stores without disrupting normal operations.    It plans to offer merchandise at price points of $3, $4 and $5, which will be displayed in end caps clearly branded as Dollar Tree Plus! to minimize confusion with the dollar value offerings that are familiar to customers. These tests are basically not intended toward raising prices of products in the Dollar price point but adding items and categories with the higher price points to boost margins and sales. By the end of June 2019, the company successfully rolled out these tests to nearly 115 stores.   Wrapping Up    As already detailed, we expect Dollar Tree's top and bottom-line momentum to continue in the quarters ahead, driven by various initiatives. The company's efforts to improve shopping experience at the Dollar Tree and Family Dollar banners position it to outpace rivals and sustain growth in the long run.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:56:00"
}