{
  "url": "https://www.nasdaq.com/article/chinese-professor-accused-of-huaweirelated-fraud-asks-why-case-was-moved-to-brooklyn-20190911-00858",
  "title": "Chinese professor accused of Huawei-related fraud asks why case was moved to Brooklyn - Nasdaq.com",
  "text": [
    "Sept 11 (Reuters) - A lawyer for a Chinese professor accused of obtaining technology from a Silicon Valley startup to benefit China'sHuawei on Wednesday told a federal judge that he would like to know why the case is in her Brooklyn courtroom.",
    "Professor Bo Mao was arrested last month in Texas, and prosecutors there initially said he should be kept behind bars, citing a serious risk of him both fleeing and obstructing justice, according to court documents.",
    "But prosecutors changed their position once Mao agreed to waive indictment and let the case proceed in Brooklyn, where a case is pending against Huawei for alleged bank fraud and sanctions violations.",
    "On Wednesday, Mao lawyer Richard Roper told U.S. District Court Judge Ann Donnelly he found the terms of Mao's release \"extraordinary\" and asked to see the motion filed to transfer the case to her.",
    "The case \"had no connection to anything in this district,\" Roper, a former U.S. Attorney in Texas, said in reference to the Brooklyn venue.",
    "Prosecutor Alex Solomon said the transfer motion contained grand jury information and would only be shared if and when that became public, suggesting there may be more charges to come.",
    "Donnelly is the judge overseeing the case against Huawei for allegedly misleading banks about its business in Iran, and the prosecutors in the Mao case now are the same as those in the case against the Chinese company. A court document also says the case is related to the U.S. v Huawei case.",
    "A public defender, not a private attorney, had represented Mao when he gave up the right to challenge where he would be prosecuted.",
    "The judge tried to make light of the situation.",
    "\"It's here,\" Donnelly told the Texas lawyer. \"We're not that bad. Get to know us.\"",
    "She set the next court date for Nov. 13.",
    "The criminal case against Mao stems from an agreement he signed with San Jose, California-based CNEX Labs to use its circuit board for research.",
    "Unbeknownst to the tech company, Mao was also doing work for Huawei on an apparently similar product, according to a criminal complaint, which accuses Mao of secretly providing CNEX's proprietary information to Huawei in violation of the agreement.",
    "The complaint describes but does not identify the Chinese telecommunications conglomerate or the tech startup.",
    "Mao, 36, was released from jail in Texas after six days behind bars. He must stay his Texas home from 7 p.m. to 7 a.m., confine his travel to Texas and New York, allow electronic monitoring, and not enter any Chinese diplomatic facilities. A $100,000 bond also was posted."
  ],
  "published_datetime": "2019-09-11 06:04:00"
}