{
  "url": "https://www.nasdaq.com/article/strong-economic-data-easing-trade-worries-push-wall-street-higher-20190905-00807",
  "title": "Strong economic data, easing trade worries push Wall Street higher - Nasdaq.com",
  "text": [
    "By Uday Sampath Kumar",
    "Sept 5 (Reuters) - U.S. stocks hit one-month highs on Thursday on hopes of a de-escalation in trade tensions after Washington and Beijing agreed to hold high-level talks next month, while strong U.S. economic data allayed some concerns of a slowdown.",
    "Wall Street's three main indexes touched their highest level since Aug. 1 and the benchmark S&P 500 index  breached its 50-day moving average, a key indicator for short-term momentum.",
    "Technology stocks  provided the biggest boost to S&P 500, rising 2.05%, while financials  jumped 2.31%, the most among the 11 major S&P sectors.",
    "Interest rate-sensitive banks  surged 3%, following a rise in U.S. Treasury yields. US/",
    "\"The trade news was the spark that lit this rally and then the economic data extended it,\" said Michael Antonelli, market strategist at Robert W. Baird in Milwaukee.",
    "The ADP National Employment Report, considered a precursor to the Labor Department's more comprehensive jobs report, showed U.S. private employers' payrolls grew at the fastest pace in four months in August, led by big gains in service-sector jobs. ",
    "Another private survey showed growth in the U.S. services sectors accelerated in August, rebounding from its weakest level in nearly three years, as new orders rose to their highest level since February amid trade worries. ",
    "\"Manufacturing is in a bit of a global slump, but if you look at the other economic data, like the services and jobs reports, none of them point to an economy that is teetering on a recession,\" Antonelli said.",
    "The upbeat reports eased concerns of an economic downturn, which was exacerbated by data on Tuesday that showed a contraction in U.S. factory activity in August. Investors will keep a close watch on the crucial nonfarm payrolls data due on Friday.",
    "At 11:41 a.m. ET the Dow Jones Industrial Average  was up 446.46 points, or 1.69%, at 26,801.93, the S&P 500  was up 41.58 points, or 1.42%, at 2,979.36 and the Nasdaq Composite  was up 132.80 points, or 1.66%, at 8,109.68.",
    "In deal news, insurer Prudential Financial Inc  agreed to acquire online insurance startup Assurance IQ Inc for $2.35 billion. Shares of Prudential fell 2.81%.",
    "Among losers were the defensive utilities , real estate  and consumer staples  sectors.",
    "Advancing issues outnumbered decliners by a 2.26-to-1 ratio on the NYSE and by a 3.01-to-1 ratio on the Nasdaq.",
    "The S&P index recorded 53 new 52-week highs and no new low, while the Nasdaq recorded 66 new highs and 27 new lows."
  ],
  "published_datetime": "2019-09-05 11:50:00"
}