{
  "url": "https://www.nasdaq.com/article/why-hubspot-stock-rose-117-in-august-cm1207668",
  "title": "Why HubSpot Stock Rose 11.7% in August - Nasdaq.com",
  "text": [
    " What happened  HubSpot    (NYSE: HUBS) gained 11.7% in the month of August, according to   data from      S&P Global Market Intelligence    . The sales and marketing   software-as-a-service    company delivered a strong earnings report early in the month,   then held up through an otherwise tumultuous month for the   broader market. Since HubSpot's offerings help businesses become   more efficient, the company's products and services are thought   to be somewhat recession-resistant, and in a slow-growth world,   any company that delivers 30%-plus growth will get some   attention. So what In its second quarter, HubSpot delivered   impressive results    . Revenue grew 33% year over year, while   non-GAAP    earnings per share surged 121% to $0.42 per share, both of which   beat analyst expectations. Total customers actually grew at a   higher rate than revenue, at 35%. Perhaps most importantly, the   company raised its full-year guidance to $663 million to $665   million versus the previous guidance of $655.5 million to $658.5   million.   Image source: Getty Images.makeArticleAd();  HubSpot has several products that help middle-market   businesses attract customers, nurture sales, and offer customer   service. HubSpot CRM tracks the entire customer life cycle in a   single database. Marketing Hub tracks all of a company's online   communications to prospective customers (email, SEO, social   media) with reporting and analytics. Sales Hub offers tools to   enhance the productivity of sales teams. Service Hub, the   company's newest offering, enables streamlined customer service.   Finally, HubSpot CMS is a smart web content management   system. Consistent product innovation paved the way for this growth.   CEO Brian Halligan said, \"We reached nearly 25,000 multiproduct   customers this quarter, and our youngest product, the Service   Hub, has surpassed 5,000 paying customers. Great stuff.\" Not only has HubSpot developed more applications and services,   but it has also integrated 300 third-party apps into its   platform. Management says that the average customer now uses more   than five third-party apps through the HubSpot platform, making   the offering all the \"stickier.\" Now what There's a lot to like about HubSpot going forward. It's a   leading software-as-a-service platform that is continuously   improving, and its target market opportunity for small and   medium-sized businesses worldwide is very large. In addition, HubSpot is run by founder and CEO Halligan, who   has a huge 98% approval rating on Glassdoor.com, and is also an   unabashed   Deadhead    , which is reason enough (in my book!) to be bullish on this   rule-breaking company.   10 stocks we like better than HubSpot       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and HubSpot wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Billy Duberstein      has no position in any of the stocks mentioned. His clients may     own shares of the companies mentioned. The Motley Fool owns     shares of and recommends HubSpot. The Motley Fool has a     disclosure policy      .  ",
    " HubSpot    (NYSE: HUBS) gained 11.7% in the month of August, according to   data from      S&P Global Market Intelligence    . The sales and marketing   software-as-a-service    company delivered a strong earnings report early in the month,   then held up through an otherwise tumultuous month for the   broader market. Since HubSpot's offerings help businesses become   more efficient, the company's products and services are thought   to be somewhat recession-resistant, and in a slow-growth world,   any company that delivers 30%-plus growth will get some   attention.",
    "In its second quarter, HubSpot delivered   impressive results    . Revenue grew 33% year over year, while   non-GAAP    earnings per share surged 121% to $0.42 per share, both of which   beat analyst expectations. Total customers actually grew at a   higher rate than revenue, at 35%. Perhaps most importantly, the   company raised its full-year guidance to $663 million to $665   million versus the previous guidance of $655.5 million to $658.5   million.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "HubSpot has several products that help middle-market   businesses attract customers, nurture sales, and offer customer   service. HubSpot CRM tracks the entire customer life cycle in a   single database. Marketing Hub tracks all of a company's online   communications to prospective customers (email, SEO, social   media) with reporting and analytics. Sales Hub offers tools to   enhance the productivity of sales teams. Service Hub, the   company's newest offering, enables streamlined customer service.   Finally, HubSpot CMS is a smart web content management   system.",
    "Consistent product innovation paved the way for this growth.   CEO Brian Halligan said, \"We reached nearly 25,000 multiproduct   customers this quarter, and our youngest product, the Service   Hub, has surpassed 5,000 paying customers. Great stuff.\"",
    "Not only has HubSpot developed more applications and services,   but it has also integrated 300 third-party apps into its   platform. Management says that the average customer now uses more   than five third-party apps through the HubSpot platform, making   the offering all the \"stickier.\"",
    "There's a lot to like about HubSpot going forward. It's a   leading software-as-a-service platform that is continuously   improving, and its target market opportunity for small and   medium-sized businesses worldwide is very large.",
    "In addition, HubSpot is run by founder and CEO Halligan, who   has a huge 98% approval rating on Glassdoor.com, and is also an   unabashed   Deadhead    , which is reason enough (in my book!) to be bullish on this   rule-breaking company.",
    "  10 stocks we like better than HubSpot       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and HubSpot wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than HubSpot       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and HubSpot wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Billy Duberstein      has no position in any of the stocks mentioned. His clients may     own shares of the companies mentioned. The Motley Fool owns     shares of and recommends HubSpot. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:42:00"
}