{
  "url": "https://www.nasdaq.com/article/small-cap-value-etfs-rallying-hard-heres-why-cm1210062",
  "title": "Small-Cap Value ETFs Rallying Hard: Here's Why - Nasdaq.com",
  "text": [
    " Small-cap fund  iShares Russell 2000 ETF ( IWM )   has    underperformed the S&P 500 this year. However, the trend seems to be reversing of late with small caps taking charge. Value ETFs in the spectrum of small caps have been especially doing well. In the past five days (as of Sep 10, 2019), SPDR S&P 500 ETF SPY  has added about 2.6% while IWM gained about 4.9% and Invesco S&P SmallCap 600 Pure Value ETF RZV  increased around 11.7%. A dovish Fed, heightened trade war tensions, global growth worries, geopolitical risks and a decently growing U.S. economy have probably been working in favor of pint-sized stocks.  US Economy in Decent Shape; Fed Dovish  Investors should note that small caps are domestically focused and are less scathed by trade tensions or global slowdown. These companies, with lesser foreign exposure, gain when the economy is improving and currency strengthening. The Fed meeting, which is going to start in mid-September, is expected to end on a dovish note. At the current level, according to CME FedWatch tool, there is a 91.2% chance  of a 25-bp rate cut in the September meeting. The bets over lower rates increased a bit in recent trading as U.S. GDP growth revised down  in the second quarter to 2% (from 2.1% rate reported earlier) hurt by softer business investment and manufacturing. The growth rate followed a 3.1% uptick in the previous three-month period. Needless to say, tariffs and a global slowdown weighed on the U.S. economy, which compelled the Fed to act dovish. Also, \"small caps have more relative debt on their balance sheets. Small caps are stretched on debt to capital and net debt EBITA\" per an article published on CNBC  . If there is higher debt on the balance sheet, chances of low rates should benefit smaller-cap stocks.  Stronger Greenback: A Boon for Small Caps  But despite the dovish stance adopted by the Fed, the greenback has been gaining traction. Invesco DB US Dollar Index Bullish Fund UUP  has advanced 2.6% in the past three months. Such strength in the U.S. dollar is a negative for the more-sensitive large-cap stocks. This should boost small-cap stocks to a great extent.  U.S. Consumer Spending Still Strong  Also, investors should note that while manufacturing and housing data point toward a slowdown early in the third quarter  , strong consumer spending alleviated concerns about a recession.\"While other parts of the economy may show some weakening, consumers have remained confident and  willing to spend  ,\" said Lynn Franco, senior director of economic indicators at the Conference Board (read: ETFs to Buy as Americans' Confidence Nears 19-Year High  ). Investors should note that  oil prices  are not likely to shoot up this year given the global growth worries and a possible threat to demand. Savings at gas stations should also fatten consumer wallets. Overall, the inflationary picture is subdued, which in turn, might encourage consumers to spend more. With consumer spending making up about 70% of the U.S. economy, the trend should bode well for small-cap stocks.  Why Value?  Having said that, we would like to note that in the wake of a host of uncertainties like trade tensions, U.S. presidential election in 2020 and Brexit, it is better to stick to value stocks at the moment. After all, the \"gap between how much foreign sales small caps have versus large caps has been narrowing in recent years,\" according to Jill Carey Hall, Bank of American Merrill Lynch U.S. equity strategist. So, any  global market  shock might take away the edge small caps had been enjoying for long.  Invesco S&P SmallCap 600 Pure Value ETF  RZV  - Up 11.7% in the pas five days (as of Sep 10, 2019)  First Trust Small Cap Value AlphaDEX Fund  FYT  - Up 9.6%   Invesco S&P MidCap 400 Pure Value ETF RFV  - Up 10.6%     First Trust Mid Cap Value AlphaDEX Fund  FNK  - Up 8.9%      iShares Morningstar Small-Cap Value ETF  JKL  - Up 7.2%       Want key ETF info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.   Get it free >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  First Trust Small Cap Value AlphaDEX Fund (FYT): ETF Research Reports   iShares Russell 2000 ETF (IWM): ETF Research Reports   Invesco S&P SmallCap 600 Pure Value ETF (RZV): ETF Research Reports   Invesco DB US Dollar Index Bullish Fund (UUP): ETF Research Reports   First Trust Mid Cap Value AlphaDEX Fund (FNK): ETF Research Reports   iShares Morningstar Small-Cap Value ETF (JKL): ETF Research Reports   Invesco S&P MidCap 400 Pure Value ETF (RFV): ETF Research Reports   SPDR S&P 500 ETF (SPY): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    "Small-cap fund  iShares Russell 2000 ETF ( IWM )   has    underperformed the S&P 500 this year. However, the trend seems to be reversing of late with small caps taking charge. Value ETFs in the spectrum of small caps have been especially doing well.",
    "In the past five days (as of Sep 10, 2019), SPDR S&P 500 ETF SPY  has added about 2.6% while IWM gained about 4.9% and Invesco S&P SmallCap 600 Pure Value ETF RZV  increased around 11.7%. A dovish Fed, heightened trade war tensions, global growth worries, geopolitical risks and a decently growing U.S. economy have probably been working in favor of pint-sized stocks.",
    " US Economy in Decent Shape; Fed Dovish ",
    "Investors should note that small caps are domestically focused and are less scathed by trade tensions or global slowdown. These companies, with lesser foreign exposure, gain when the economy is improving and currency strengthening.",
    "The Fed meeting, which is going to start in mid-September, is expected to end on a dovish note. At the current level, according to CME FedWatch tool, there is a 91.2% chance  of a 25-bp rate cut in the September meeting.",
    "The bets over lower rates increased a bit in recent trading as U.S. GDP growth revised down  in the second quarter to 2% (from 2.1% rate reported earlier) hurt by softer business investment and manufacturing. The growth rate followed a 3.1% uptick in the previous three-month period. Needless to say, tariffs and a global slowdown weighed on the U.S. economy, which compelled the Fed to act dovish.",
    "Also, \"small caps have more relative debt on their balance sheets. Small caps are stretched on debt to capital and net debt EBITA\" per an article published on CNBC  . If there is higher debt on the balance sheet, chances of low rates should benefit smaller-cap stocks.",
    " Stronger Greenback: A Boon for Small Caps ",
    "But despite the dovish stance adopted by the Fed, the greenback has been gaining traction. Invesco DB US Dollar Index Bullish Fund UUP  has advanced 2.6% in the past three months. Such strength in the U.S. dollar is a negative for the more-sensitive large-cap stocks. This should boost small-cap stocks to a great extent.",
    " U.S. Consumer Spending Still Strong ",
    "Also, investors should note that while manufacturing and housing data point toward a slowdown early in the third quarter  , strong consumer spending alleviated concerns about a recession.\"While other parts of the economy may show some weakening, consumers have remained confident and  willing to spend  ,\" said Lynn Franco, senior director of economic indicators at the Conference Board (read: ETFs to Buy as Americans' Confidence Nears 19-Year High  ).",
    "Investors should note that  oil prices  are not likely to shoot up this year given the global growth worries and a possible threat to demand. Savings at gas stations should also fatten consumer wallets. Overall, the inflationary picture is subdued, which in turn, might encourage consumers to spend more. With consumer spending making up about 70% of the U.S. economy, the trend should bode well for small-cap stocks.",
    " Why Value? ",
    "Having said that, we would like to note that in the wake of a host of uncertainties like trade tensions, U.S. presidential election in 2020 and Brexit, it is better to stick to value stocks at the moment. After all, the \"gap between how much foreign sales small caps have versus large caps has been narrowing in recent years,\" according to Jill Carey Hall, Bank of American Merrill Lynch U.S. equity strategist. So, any  global market  shock might take away the edge small caps had been enjoying for long.",
    " Invesco S&P SmallCap 600 Pure Value ETF  RZV  - Up 11.7% in the pas five days (as of Sep 10, 2019)",
    " First Trust Small Cap Value AlphaDEX Fund  FYT  - Up 9.6% ",
    " Invesco S&P MidCap 400 Pure Value ETF RFV  - Up 10.6%   ",
    " First Trust Mid Cap Value AlphaDEX Fund  FNK  - Up 8.9%    ",
    " iShares Morningstar Small-Cap Value ETF  JKL  - Up 7.2%     ",
    " Want key ETF info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.   Get it free >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:00:00"
}