{
  "url": "https://www.nasdaq.com/article/3-top-tech-stocks-to-buy-right-now-cm1206889",
  "title": "3 Top Tech Stocks to Buy Right Now - Nasdaq.com",
  "text": [
    "Investing in technology stocks can be an excellent way for long-term investors to experience significant gains in their portfolios. Over the past decade, the Nasdaq 100 index, which is made up mostly of tech stocks , has gained 313%, while the S&P 500 index has increased by 163%.",
    "But selecting the right tech stock isn't always easy, which is why we asked three Motley Fool contributors for their top tech stocks to buy right now. Here's why they suggested Micron Technology (NASDAQ: MU) , Roku (NASDAQ: ROKU) , and PayPal Holdings (NASDAQ: PYPL) .",
    "Image source: Getty Images.",
    "Anders Bylund (Micron Technology): Analysts and investors alike have started to acknowledge that Micron's cyclical turnaround is happening. It's not too late to jump on this skyrocket before the real meat of this up-cycle comes in.",
    "Micron's stock peaked almost exactly one year ago at $64.66 per share. By Christmas share prices had plunged all the way to $28.39 -- a 56% drop in four months. Memory chip prices were falling after a couple of years with stable street prices, and pundits argued that another lengthy price war was coming.",
    "The price war never materialized. Micron and a mere handful of memory chip peers scaled back their production lines instead of flooding the market with cheap products. DRAM and NAND chip prices still fell, but not by the torrential percentage rates seen in the price wars of 2008 and 2015 .",
    "Here in the summer of 2019, memory prices have stabilized to rates near the industry's overarching long-term trends. Micron's sliding revenue chart should turn upward in the second half of this calendar year, driven by stronger demand for both DRAM and NAND chips. In turn, those end markets are heading into secular upswings of their own. Smartphone sales could kick-start their stalled engines as consumers look for new handsets with support for the faster 5G wireless networking standards, and the NAND market continues to explore rising demand from enterprise and data center storage customers.",
    "Meanwhile, Micron shares trade at bargain-bin valuation ratios such as 5.4 times trailing earnings and 8.5 times free cash flows. Skeptics still expect the memory market to melt down in a series of uncontrollable price wars, but that's just not how this maturing market works anymore. And Micron's shares are left undervalued until further notice. This would be a great time to pick up some Micron shares.",
    "Rich Duprey(Roku): Investing in a stock that has rocketed 400% higher in just eight months requires a leap of faith for most investors, but Roku may be the company to convert the masses.",
    "No one is getting more out of the revolution in how video is consumed than Roku. What started as a simple hardware manufacturer of boxes to help viewers watch streaming content has since evolved into a sprawling service for content providers and advertisers. Physical devices are still part of the mix, but merely to provide a gateway for the platform side of its business.",
    "Despite the heights it's already hit, there's no reason to think Roku can't do more. That's because its platform is \"agnostic\" to the content offered, welcoming thousands of stream apps into its home. As viewers flock to its service to consume content, finding it easy to locate and watch shows, providers are following en masse. That's also why it's becoming the platform of choice for smart TV manufacturers: Roku says one out of every three smart TVs sold in the U.S. in the first quarter of 2019 featured Roku TV.",
    "Revenue surged 59% in the second quarter as the number of active accounts jumped to 30.5 million and the number of hours watched expanded to 9.4 billion. Adjusted gross profits expanded to a mouthwatering 66%, indicating the business is scalable and the end hasn't yet been achieved.",
    "No investment can go up forever, but that could have been said of Roku at numerous points along its meteoric journey so far. Because there is no impediment to the streaming video platform's continued rise, it may be a more difficult and risky decision to bet against Roku than to back its continued ascent.",
    "Chris Neiger (PayPal): There's a quiet shift happening right now, and if you're not paying attention, you might miss it. It's the transition from cash to cashless payments. The change has been happening for years, but with the proliferation of the Internet and smartphones it's beginning to accelerate -- and PayPal is already benefiting.",
    "The company is one of the leading online payment platforms, a great position to be in considering that online retail sales will grow from just 11% of all U.S. retail sales right now to 14% by 2021. Online sales are helping to boost PayPal's total payment volume (TPV) -- the total amount spent on the company's platform -- which increased 24% year over year in the second quarter to $172 billion.",
    "But the company is also benefiting as more people use their smartphones to pay for items and to pay each other. PayPal's popular Venmo app, which allows users to pay their peers money or to buy things at merchant stores, processed $24 billion of TPV in the second quarter, an increase of 70% from the year-ago quarter.",
    "Investors looking for a top tech stock that's betting big on the transition to a cashless society would be wise to take a look at PayPal. PayPal's CEO believes that digital payments -- including mobile, peer-to-peer, and online payments -- could eventually reach $100 trillion. And with PayPal already benefiting from this market, the company looks like a great long-term tech investment .",
    "10 stocks we like better than PayPal Holdings\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and PayPal Holdings wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Anders Bylund owns shares of Micron Technology. Chris Neiger has no position in any of the stocks mentioned. Rich Duprey has no position in any of the stocks mentioned. The Motley Fool owns shares of and recommends PayPal Holdings and Roku. The Motley Fool has the following options: short October 2019 $97 calls on PayPal Holdings. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:10:00"
}