{
  "url": "https://www.nasdaq.com/article/preciousgold-silver-surge-after-weak-us-data-compounds-slowdown-fears-20190903-00906",
  "title": "PRECIOUS-Gold, silver surge after weak U.S. data compounds slowdown fears - Nasdaq.com",
  "text": [
    "    * U.S. manufacturing activity contracts for first time in 3years",
    "* Silver surges 3% to near 3-year peak, breaches $19/ozlevel",
    "* British lawmakers bid to stop no-deal Brexit (Adds analyst comments, market details, updates prices)",
    "Sept 3 (Reuters) - Gold rose more than 1% on Tuesday afterweak manufacturing data from the United States reinforced fearsof an economic downturn, while uncertainties over U.S.-Chinatrade ties and Brexit further boosted bullion's safe-havenappeal.",
    "Meanwhile, silver XAG= followed gold's rally to jump 3%while breaching the $19 mark for the first time since October2016 at $19.07 per ounce. ",
    "Spot gold XAU= rose 1.1% to $1,547.70 per ounce at 11:20a.m. EDT (1520 GMT), not far off its more than six-year high of$1,554.56. ",
    "U.S. gold futures GCcv1 surged 1.8% to $1,557.20. ",
    "Renewing fears of a sharp economic slowdown and weighing onrisk sentiment, U.S. manufacturing activity contracted for thefirst time in three years in August. urn:newsml:reuters.com:*:nL2N25R073MKTS/GLOB",
    "Weak manufacturing data \"will further embolden the view thatthe U.S. Federal Reserve is going to need to be aggressive withrate cuts,\" said Ryan McKay, a commodity strategist at TDSecurities.",
    "\"Equities are on the back foot, that's what's keeping goldhigher. There's a lot of uncertainty on the Brexit front,politics in Italy, protests in Hong Kong as well - a lot ofstuff that's positive for gold.\"",
    "Gold also shook off mild pressure from the dollar earlier inthe session, with the U.S. unit holding gains versus other majorcurrencies. USD/",
    " \"Dollar is also being seen as a safe-haven asset ... EvenTreasuries are up, dollar is up, silver is up, gold is up - it'sall the safe-haven assets up together,\" said Phillip Streible,senior commodities strategist at RJO Futures.",
    "Meanwhile, European currencies such as the euro and poundhave dipped against the dollar as traders remain wary ofdevelopments surrounding Britain's imminent exit from theEuropean Union and Italy's political turmoil.",
    "In Britain, lawmakers began a bid to stop Prime MinisterBoris Johnson from pursuing a no-deal Brexit. urn:newsml:reuters.com:*:nL5N25U0GW",
    "On the trade front, China has lodged a complaint at theWorld Trade Organization over U.S. import duties, trashing thelatest tariff actions as violating the consensus reached byleaders of both countries at a meeting in Osaka. urn:newsml:reuters.com:*:nL3N25T2PU",
    "\"Gold has aggressively priced in Fed rate cuts. With littleopportunity cost in holding gold and growing economicuncertainty tied to escalating U.S.-China trade tensions,investor appetite for the yellow metal has grown,\" BNP Paribasanalysts wrote in a note, forecasting average gold prices toclimb above $1,600 driven by the Fed's monetary easing cycle.",
    "Federal fund futures FEDWATCH implied traders saw a 91%chance of a 25 basis-point rate cut by the U.S. Federal Reservethis month.",
    "Meanwhile, platinum XPT= rose 2.5% to $953.25 per ounce,while palladium XPD= was up 0.1% at $1,532.75 per ounce. (Reporting by Asha Sistla in BengaluruEditing by Matthew Lewis) ((Asha.Sistla@thomsonreuters.com; If within U.S. +1 646 2238780; outside U.S. +91 80 6749 5072; Reuters Messaging: ReutersMessaging: asha.sistla.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-03 11:52:00"
}