{
  "url": "https://www.nasdaq.com/article/after-hours-slack-palo-alto-networks-report-quarterly-results-cm1207667",
  "title": "After Hours: Slack, Palo Alto Networks Report Quarterly Results - Nasdaq.com",
  "text": [
    " Tonight's post-market trading action is centered on quarterly   results, thanks to several popular   tech stocks    that have reported their latest after the closing bell. One of these disappointed investors even though it beat   analyst estimates. The story was quite different for another.   Read on for more about the pair's latest fundamentals, and how   the market is reacting to them.   Image source: Getty Images.makeArticleAd();  Slack Q2 trumps expectations, but apparently not enough  Slack Technologies    (NYSE: WORK) posted its firs   t earnings    report as a publicly traded company. For its Q2 of fiscal 2020,   the company booked revenue of $145 million, which was 58% higher   on a year-over-year basis and exceeded the average analyst   estimate of just under $141 million. On the bottom line, the company's   non-GAAP    (adjusted) net loss deepened to $51.5 million ($0.14 per share)   from Q2 2019's $30.1 million ($0.25). Still, that result was   better than the $0.18-per-share deficit expected by   prognosticators. Slack pointed to significant growth in a key customer segment   -- enterprises, with over $100,000 in annual recurring revenue --   as a driver of that revenue improvement. The number of those   customers rose by 75%. The company proffered guidance for its current quarter and for   the entirety of fiscal 2020. With the former, it expects to post   $154 million to $156 million in revenue, and a per-share adjusted   net loss of $0.08 to $0.09. Analysts were projecting just over   $153 million on the top line, with per-share adjusted net loss   coming in at $0.07. Despite the Q2 beats, Slack stock is trading down sharply   tonight -- it's off by nearly 14%. A big worry with this company   is that it's a one-trick pony with its corporate messaging   software, and   Microsoft    (NASDAQ: MSFT) will swamp its business. The latter company has a product called Microsoft Teams that   apes many of the Slack app's features    . Once rumored to be a potential acquirer of Slack, Microsoft is   a stiff competitor and a significant threat. Investors likely   wanted to see Slack more convincingly beat trailing or forward   estimates, in order to show that it can compete with the likes of   Microsoft. Palo Alto Networks Q4: Two beats and a buy Another tech company reporting after hours tonight was   Palo Alto Networks    (NYSE: PANW) . The   cybersecurity    specialist unveiled its Q4 2019 figures, which showed that both   its revenue and billings grew by 22%. The former landed at almost   $806 million, with the latter rising to $1.1 billion. Adjusted   net income improved by 12% to just under $147 million ($1.47 per   share). Both line items edged past the average analyst estimates of   $803 million for revenue and $1.42 for per-share adjusted net   profit. Analysts had also been modeling $995 million in bookings   for the quarter. Earlier in the day, Palo Alto Networks announced it had signed   a deal to acquire privately held IT security company Zingbox in   an all-cash transaction for $75 million. Unlike Slack, Palo Alto Networks' stock price is rising in   after-hours trading. It's up by over 6% at the moment.   10 stocks we like better than Palo Alto     Networks       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Palo Alto Networks wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       Teresa Kersten, an employee of LinkedIn, a Microsoft     subsidiary, is a member of The Motley Fool's board of     directors.     Eric Volkman      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Microsoft and Palo Alto Networks.     The Motley Fool owns shares of Slack Technologies and has the     following options: long January 2021 $85 calls on Microsoft.     The Motley Fool has a     disclosure policy      .  ",
    "Tonight's post-market trading action is centered on quarterly   results, thanks to several popular   tech stocks    that have reported their latest after the closing bell.",
    "One of these disappointed investors even though it beat   analyst estimates. The story was quite different for another.   Read on for more about the pair's latest fundamentals, and how   the market is reacting to them.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    " Slack Technologies    (NYSE: WORK) posted its firs   t earnings    report as a publicly traded company. For its Q2 of fiscal 2020,   the company booked revenue of $145 million, which was 58% higher   on a year-over-year basis and exceeded the average analyst   estimate of just under $141 million.",
    "On the bottom line, the company's   non-GAAP    (adjusted) net loss deepened to $51.5 million ($0.14 per share)   from Q2 2019's $30.1 million ($0.25). Still, that result was   better than the $0.18-per-share deficit expected by   prognosticators.",
    "Slack pointed to significant growth in a key customer segment   -- enterprises, with over $100,000 in annual recurring revenue --   as a driver of that revenue improvement. The number of those   customers rose by 75%.",
    "The company proffered guidance for its current quarter and for   the entirety of fiscal 2020. With the former, it expects to post   $154 million to $156 million in revenue, and a per-share adjusted   net loss of $0.08 to $0.09. Analysts were projecting just over   $153 million on the top line, with per-share adjusted net loss   coming in at $0.07.",
    "Despite the Q2 beats, Slack stock is trading down sharply   tonight -- it's off by nearly 14%. A big worry with this company   is that it's a one-trick pony with its corporate messaging   software, and   Microsoft    (NASDAQ: MSFT) will swamp its business.",
    "The latter company has a product called Microsoft Teams that   apes many of the Slack app's features    . Once rumored to be a potential acquirer of Slack, Microsoft is   a stiff competitor and a significant threat. Investors likely   wanted to see Slack more convincingly beat trailing or forward   estimates, in order to show that it can compete with the likes of   Microsoft.",
    "Another tech company reporting after hours tonight was   Palo Alto Networks    (NYSE: PANW) .",
    "The   cybersecurity    specialist unveiled its Q4 2019 figures, which showed that both   its revenue and billings grew by 22%. The former landed at almost   $806 million, with the latter rising to $1.1 billion. Adjusted   net income improved by 12% to just under $147 million ($1.47 per   share).",
    "Both line items edged past the average analyst estimates of   $803 million for revenue and $1.42 for per-share adjusted net   profit. Analysts had also been modeling $995 million in bookings   for the quarter.",
    "Earlier in the day, Palo Alto Networks announced it had signed   a deal to acquire privately held IT security company Zingbox in   an all-cash transaction for $75 million.",
    "Unlike Slack, Palo Alto Networks' stock price is rising in   after-hours trading. It's up by over 6% at the moment.",
    "  10 stocks we like better than Palo Alto     Networks       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Palo Alto Networks wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Palo Alto     Networks       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Palo Alto Networks wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " Teresa Kersten, an employee of LinkedIn, a Microsoft     subsidiary, is a member of The Motley Fool's board of     directors.     Eric Volkman      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Microsoft and Palo Alto Networks.     The Motley Fool owns shares of Slack Technologies and has the     following options: long January 2021 $85 calls on Microsoft.     The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:33:00"
}