{
  "url": "https://www.nasdaq.com/article/the-big-shorts-michael-burry-is-going-long-gamestop-stock-should-you-cm1206808",
  "title": "The Big Short’s Michael Burry Is Going Long GameStop Stock: Should You? - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Typically, a security that generates a 38% dividend yield means only one thing: run! And while that metric may seem like a fantasy, it's actually a very real narrative for GameStop (NYSE: GME ). Beleaguered from a massive shift in the retail video game landscape, GameStop stock has never looked like a legitimate investment since the middle of this decade.",
    "However, two major news items have breathed new life into GME stock. First, Sony (NYSE: SNE ) and Microsoft (NASDAQ: MSFT ) announced earlier this year that their next-generation gaming consoles will utilize physical discs. Now, this is old news. However, a second catalyst has forced many analysts to reconsider it in a new light.",
    "And that spark comes in the form of famed short-seller Michael Burry . Famously, Burry predicted last decade's sub-prime mortgage. Additionally, he put his money where his mouth was, profiting from the downfall. His exploits later inspired the film \"The Big Short.\"",
    "Usually, movies about the financial markets draw snores. But like many audience members, I was engrossed not only by the story, but also the implications. Burry, played by Christian Bale, was a reclusive genius. However, people really didn't understand the latter attribute until they profited handsomely from his outrageous call.",
    "How many of us wished we had access to Burry and his unconventional approach to the markets? Well, now we do. Burry is going long GameStop stock.",
    "It's an intriguing contrarian play. To us, betting on GME stock makes as much sense as the idea of shorting the mortgage industry must have been prior to the bubble collapse.",
    "But is this genuinely good advice on GameStop stock, or has Burry's reputation preceded him?",
    "Before we get into the details, we should reiterate a general point: you should never invest in an equity just based on an advisor's prior success. Obviously, Burry scored big on his big short. But can lightning strike twice? Maybe it can, or maybe he was just lucky that first time.",
    "As far as I know, there's no sequel to \"The Big Short.\"",
    "But specific to GameStop stock, the overriding reason why people are so bearish is because of the Amazon (NASDAQ: AMZN ) effect; namely, gamers are increasingly gravitating toward the convenience of video game downloads.",
    "After all, why go through the hassle of driving to the store, waiting in line, and driving back home? Instead, you can just download your target game in the comfort of your own home.",
    "Furthermore, console developers are moving toward subscription models similar to Netflix (NASDAQ: NFLX ). Rather than spending gobs of money for each new release, you pay a nominal fee monthly. Then, you have access to a much wider range of games than you would have buying them individually.",
    "And these aren't just talking points: they're negatively impacting the GameStop stock price. Just open a five-year chart and the debate is over.",
    "While GME stock seems like a far-fetched bet, I'm not going to dismiss that Burry is a genius. Plus, he might be onto something here.",
    "First, video game downloads aren't without their limitations. With today's data-intensive games, you've got to have super high-speed internet; otherwise, you're going to spend all day (or even night) to get them.",
    "Moreover, not all Americans have access to high-speed internet. In fact, one of the underlying issues with the T-Mobile US (NASDAQ: TMUS ) and Sprint (NYSE: S ) merger is the rural customer . Theoretically, a merger would provide rural internet users with a comprehensively more competent high-speed internet solution. But for now, they must make do with inferior service.",
    "Beyond that, high-speed internet is expensive, and some folks may not have the means to afford it, especially under a recession.",
    "This brings me to my second point. If we do have a recession, GameStop stock levers a critical advantage. In an economic downturn, customers will cut unnecessary expenditures. I'd call video game subscriptions unnecessary. But used physical games for half their new sticker price or better? That would fly very well, especially because recessions incentivize cheap entertainment .",
    "Additionally, we sometimes forget the fact that as technology improves, so too does their data and storage demands. There's a reason why Sony and Microsoft both elected physics disc formats for their upcoming consoles: next-gen games are extremely data-intensive, and that burden will only increase.",
    "For now, downloading such behemoths on the regular is too much.",
    "I nearly soiled myself when I saw the dividend yield for GME stock. This is about as desperate of a long play as you're going to find.",
    "However, Burry is in many ways a visionary. I think part of his thesis involves the concept that we're headed toward a recession. If that's true, consumer behaviors will necessarily change. And this change is what would drive the bull case for GameStop stock.",
    "Now, I'm not clear as to how long Burry intends to hold GME stock. But if you're looking for a nearer-term gamble, I believe the outside fundamentals are surprisingly positive.",
    "As of this writing, Josh Enomoto is long SNE.",
    "The post The Big Short's Michael Burry Is Going Long GameStop Stock: Should You? appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:48:18"
}