{
  "url": "https://www.nasdaq.com/article/are-p2p-loans-a-viable-investment-for-your-portfolio-cm1207491",
  "title": "Are P2P Loans A Viable Investment for Your Portfolio? - Nasdaq.com",
  "text": [
    " Peer to peer (P2P) loans allow you to act as a bank, providing   loans directly to other individuals or businesses in exchange for   a return on your investment via interest payments. Investing in   P2P loans, which are typically smaller than a traditional bank   loan, has proven to be reliable no matter the economic   climate. \"Interest rates on P2P loans have remained durable throughout   economic cycles, and can provide a significant boost to portfolio   income,\" states a P2P industry   academic research report    out of the University of California, Berkeley.   Image source: Getty ImagesmakeArticleAd();  As investors begin to realize the opportunities for   diversification    via P2P loans, many P2P companies are seeing their stocks   rise.  Helping you do the hard work  Let's face it, the average investor does not have the   knowledge or resources to successfully replicate the best lending   practices of a bank or financial institution. This makes it   difficult for investors to successfully choose P2P investments   for themselves. Investing in P2P loans requires an intimate   understanding of credit ratings and financial projections. It   would take a significant time investment by the average investor   to learn how to successfully invest in the P2P market. To combat this barrier to entry, P2P lending platforms have   devised automated investing solutions so that investors can gain   exposure to the P2P market without having to take the time to   learn the intricacies of the market. With an automated lending   solution, an investor sets their parameters for investment, such   as minimum required credit rating, loan amount, duration, etc.   The automated solution then invests a set amount of capital into   loans that adhere to the parameters pre-set by the investor. With such a solution you don't need to take hundreds of hours   to understand the intricacies of these loans. Instead, you can   benefit by using a simple P2P investment strategy and the   automation of a lending platform.  Liquidity problems  But there are some snags to consider when adding P2P loans to   your portfolio. Come into a cash crunch and need to liquidate   your P2P loans immediately? Good luck. P2P loans are some of the   most illiquid assets available. This illiquidity compared to   traditional investments like stocks have kept many investors on   the P2P sidelines. Recently, platforms like   Lending Club    (NYSE: LC) have   created secondary markets    on which investors can sell their loan notes as needed. Investors   list their notes on the Lending Club Note Trading Platform at an   asking price of their choosing. Other investors on the platform   browse the available notes for sale and can select any note on   the marketplace to purchase. This has helped bring more profitability and revenue to P2P   lending platforms like Lending Club, the first P2P platform to   open its doors to US investors in 2005. The company reported   solid Q2 earnings    with an 18% rise in loan originations, which brought revenues of   $174.4 million on the quarter, exceeding analysts   expectations. All told, the Lending Club platform generated   over $50 billion in originations    in Q2 alone. On Lending Club, investors with a minimum of 100   notes have a median return of 4.6%. And although Lending   Club's stock price is down 1.6% YTD, these recent numbers point   to a solid business on the rise. What was once a problem has been flipped with the advent of   secondary trading markets. Investors can now find the liquidity   they are looking for by selling loan notes on the secondary   market and liquidating their holdings before maturity. Profit on borrower irrationality Since P2P loans are usually smaller than those from a bank or   financial institution, this can actually be a benefit to the   average investor. Studies have shown that investors are more   likely to pay back loans with smaller balances, as it   psychologically makes them feel better to pay-off a loan   completely than pay-down a loan with a high balance. It is likely   this phenomenon plays a role in driving investor returns. As long as investors take the time to understand the P2P   market and its inner-workings, P2P loans will remain a viable   investment for a diversified portfolio.   10 stocks we like better than LendingClub       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and LendingClub wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Dan Pelberg      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Peer to peer (P2P) loans allow you to act as a bank, providing   loans directly to other individuals or businesses in exchange for   a return on your investment via interest payments. Investing in   P2P loans, which are typically smaller than a traditional bank   loan, has proven to be reliable no matter the economic   climate.",
    "\"Interest rates on P2P loans have remained durable throughout   economic cycles, and can provide a significant boost to portfolio   income,\" states a P2P industry   academic research report    out of the University of California, Berkeley.",
    "  Image source: Getty ImagesmakeArticleAd(); ",
    "Image source: Getty Images",
    "As investors begin to realize the opportunities for   diversification    via P2P loans, many P2P companies are seeing their stocks   rise.",
    "Let's face it, the average investor does not have the   knowledge or resources to successfully replicate the best lending   practices of a bank or financial institution. This makes it   difficult for investors to successfully choose P2P investments   for themselves. Investing in P2P loans requires an intimate   understanding of credit ratings and financial projections. It   would take a significant time investment by the average investor   to learn how to successfully invest in the P2P market.",
    "To combat this barrier to entry, P2P lending platforms have   devised automated investing solutions so that investors can gain   exposure to the P2P market without having to take the time to   learn the intricacies of the market. With an automated lending   solution, an investor sets their parameters for investment, such   as minimum required credit rating, loan amount, duration, etc.   The automated solution then invests a set amount of capital into   loans that adhere to the parameters pre-set by the investor.",
    "With such a solution you don't need to take hundreds of hours   to understand the intricacies of these loans. Instead, you can   benefit by using a simple P2P investment strategy and the   automation of a lending platform.",
    "But there are some snags to consider when adding P2P loans to   your portfolio. Come into a cash crunch and need to liquidate   your P2P loans immediately? Good luck. P2P loans are some of the   most illiquid assets available. This illiquidity compared to   traditional investments like stocks have kept many investors on   the P2P sidelines.",
    "Recently, platforms like   Lending Club    (NYSE: LC) have   created secondary markets    on which investors can sell their loan notes as needed. Investors   list their notes on the Lending Club Note Trading Platform at an   asking price of their choosing. Other investors on the platform   browse the available notes for sale and can select any note on   the marketplace to purchase.",
    "This has helped bring more profitability and revenue to P2P   lending platforms like Lending Club, the first P2P platform to   open its doors to US investors in 2005. The company reported   solid Q2 earnings    with an 18% rise in loan originations, which brought revenues of   $174.4 million on the quarter, exceeding analysts   expectations.",
    "All told, the Lending Club platform generated   over $50 billion in originations    in Q2 alone. On Lending Club, investors with a minimum of 100   notes have a median return of 4.6%. And although Lending   Club's stock price is down 1.6% YTD, these recent numbers point   to a solid business on the rise.",
    "What was once a problem has been flipped with the advent of   secondary trading markets. Investors can now find the liquidity   they are looking for by selling loan notes on the secondary   market and liquidating their holdings before maturity.",
    "Since P2P loans are usually smaller than those from a bank or   financial institution, this can actually be a benefit to the   average investor. Studies have shown that investors are more   likely to pay back loans with smaller balances, as it   psychologically makes them feel better to pay-off a loan   completely than pay-down a loan with a high balance. It is likely   this phenomenon plays a role in driving investor returns.",
    "As long as investors take the time to understand the P2P   market and its inner-workings, P2P loans will remain a viable   investment for a diversified portfolio.",
    "  10 stocks we like better than LendingClub       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and LendingClub wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than LendingClub       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and LendingClub wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Dan Pelberg      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 01:43:00"
}