{
  "url": "https://www.nasdaq.com/article/bayer-says-monsantos-list-of-influential-people-was-not-illegal-20190905-00212",
  "title": "Bayer says Monsanto's list of influential people was not illegal - Nasdaq.com",
  "text": [
    "By Ludwig Burger",
    "FRANKFURT, Sept 5 (Reuters) - Bayer  said a law firm it commissioned to investigate lists compiled by Monsanto of European journalists, politicians and researchers had found no evidence of illegal behaviour.",
    "French prosecutors in May opened an inquiry after newspaper Le Monde filed a complaint alleging Monsanto, which was bought by Bayer for $63 billion, had kept files of influential people in a bid to sway public opinion on its pesticides. ",
    "\"But ... we did not find evidence to support the French media's allegations regarding the illegality of the stakeholder lists,\" it said, quoting the report. \"There was also no evidence that the lists were based on illegal 'surveillance' of individuals, as claimed by the media.\"",
    "Bayer faces potentially heavy litigation costs from U.S. lawsuits in which plaintiffs claim its Roundup weedkiller, which contains glyphosate, causes cancer, which Bayer disputes. ",
    "The group has suffered setbacks in its fight for acceptance of the product in Europe. Its home country of Germany will ban glyphosate from the end of 2023 and Austrian lawmakers have also voted to end its use. ",
    "Direct glyphosate sales play only a limited role for Bayer, but it relies heavily on selling seeds to U.S. and Latin American farmers for crops that withstand the weedkiller.",
    "The 1,475 people on the lists came from a range of mostly European countries including France (466), Germany (202), Poland (152), Spain (144), Great Britain (93), Bayer said.",
    "It added all individuals were informed by the law firm between May 31 and Aug. 9, 2019.",
    "The lists were created in late 2016 and 2017 by public relations agency FleishmanHillard on behalf of Monsanto."
  ],
  "published_datetime": "2019-09-05 05:55:00"
}