{
  "url": "https://www.nasdaq.com/article/can-aurora-cannabis-sales-overcome-the-black-market-cm1206858",
  "title": "Can Aurora Cannabis Sales Overcome the Black Market? - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Aurora Cannabis (NYSE: ACB ) has a well-defined path to profitability. Its near-term goal is to drive down costs by leveraging its massive scale to improve margins. Its medium-term goal is to leverage R&D to work on higher-margin products and to harvest the Canadian cash flow that is generated from its near-term goals. Long-term, the goal is to use extensive R&D to develop and brand higher-margin products.",
    "Wall Street likes ACB stock. Out of the 17 firms that follow it, 10 of them have it ranked either as a buy or overweight. The average target price is more than two times higher than where it is currently trading.",
    "In addition, unlike many of the other large industrial growers, this company reported an actual profit last year, something that is rarely seen in this industry. In fiscal 2019, the company earned 15 cents a share.",
    "Despite all of these positives, the price of ACB stock continues to decline. Why is this happening? Being a veteran of the markets I know that it is impossible to give an exact and definitive reason.",
    "But I believe that a challenge facing Aurora Cannabis and other cannabis growing companies which isn't discussed too often is the negative effect that the supply from the black market has on their sales.",
    "If you follow the cannabis markets you are probably aware that two recent stories involve litigation issues other than legalization. Canntrust (NYSE: CTST ) is alleged to have operated unlicensed, and therefore untaxed and illegal, grow rooms. These were literally hidden behind fake walls.",
    "In addition, the FBI just announced that it will be investigating the industry. Sources tell me that their main focus will be on the alleged kickbacks that are required in some places in order to obtain a growing license. I believe that their investigation will expose and shed light on the enormous size of the black market of cannabis.",
    "Is the cannabis black market efficient and profitable? You bet it is. As someone who has many connections in law enforcement and the cannabis industry, I can tell you that the black market for recreational cannabis is enormous. And this market is virtually, if not literally, impossible to control.",
    "Consider a cannabis farm of 2,000 acres. You don't need a vivid imagination to understand how easy it will be for employees and others to walk off with product or to send it out the proverbial back door. In fact, I have talked to recreational marijuana enthusiasts in Canada that enjoy it daily. Yet none have purchased it from a licensed retailer since it became legal almost a year ago.  Why go to the store when someone in the park across the street has the same thing for half the price?",
    "As long as these dynamics exist, industrial growers like Aurora Cannabis will have to accept and face this challenge as part of their growth strategies.",
    "ACB stock has been trending lower since it failed at resistance at the $7 level in early August. If it continues to trend lower, there may be support around the $5 level. This is where support was in December and January and it is also important psychologically.",
    "At the time of this writing, Mark Putrino did not hold a position in any of the aforementioned securities.",
    "The post Can Aurora Cannabis Sales Overcome the Black Market? appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:05:53"
}