{
  "url": "https://www.nasdaq.com/article/dave-busters-has-a-problem-cm1210736",
  "title": "Dave & Buster's Has A Problem - Nasdaq.com",
  "text": [
    " In the   second quarter    ,   Dave & Buster's    (NASDAQ: PLAY) reported continued growth in overall revenue, but   weakness in comp store sales is undermining the business. The   sports bar/arcade destination is relying on new store openings,   coupled with stock buybacks in order to bolster its   situation.   Image Source: Dave & Busters makeArticleAd();  Financials  Total revenues increased 8% to $344.6 million. The revenue   growth stems from both the restaurant side of things, as well as   the arcade/entertainment side.  While the overall revenue story remains strong, comp sales are   another matter entirely. Comparable store sales declined by 1.8%   in the second quarter. While that might be an improvement over   last year's 2.4% decline, it is still a continuation of a   problematic trend that is undermining the long term potential of   the company. Revenue growth created the wiggle room for a 0.6% increase in   operating income, but as a percentage of revenue, operating   income actually decreased to 13.4% vs. 14.4% last year. Rising   interest expenses, along with higher tax provisions, led to a   4.2% decline in net income to $32.36 million. That breaks down to   $0.90 per diluted share vs. $0.84 per diluted share a year a   ago.  Guidance  While the quarter itself certainly wasn't the best, the big   issue garnering negative sentiment is the forward looking   guidance. Dave & Buster's now expects revenues of $1.338   billion to $1.359 billion. This marks a decline from previous   guidance of $1.365 billion to $1.390 billion. This would still   mark a year over gain in total revenue, but the shift down is   still a negative for investors.  Estimates for comp sales have deteriorated. Comparable store   sales are now expected to decrease between 2% to 3.5%. This is   the real problem with the stock. Unless the company changes this   trend in comp store sales, the long term picture is bleak in my   eyes. Net income is forecast in the range of $91 million to $100   million. On the liberal side of the guidance, it would mark a   17.22% decline from last's year's net income of $117.22 million.   What I think we might be seeing here is the effects of comp sales   finally taking their toll on the benefit of new store openings.   As sales decline at established locations, the costs remain. And   the revenues from new stores don't seem to be compensating for it   anymore. Dave & Buster's plans to open 15 to 16 new stores   this year, but total net income is expected to be lower. That   creates a real problem if not prudently addressed. As a destination, I absolutely love Dave & Buster's. As an   investment, there isn't a lot of momentum here. One needs to be   very vigilant of how Dave & Buster's handles this sales   situation moving forward. Store openings are not going to fix the   problem.   10 stocks we like better than Dave & Buster's     Entertainment       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Dave & Buster's     Entertainment wasn't one of them! That's right -- they think     these 10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019            David Butler      has no position in any of the stocks mentioned. The Motley Fool     recommends Dave & Buster's Entertainment. The Motley Fool     has a     disclosure policy      .  ",
    "In the   second quarter    ,   Dave & Buster's    (NASDAQ: PLAY) reported continued growth in overall revenue, but   weakness in comp store sales is undermining the business. The   sports bar/arcade destination is relying on new store openings,   coupled with stock buybacks in order to bolster its   situation.",
    "  Image Source: Dave & Busters ",
    "Image Source: Dave & Busters",
    " Financials ",
    "Total revenues increased 8% to $344.6 million. The revenue   growth stems from both the restaurant side of things, as well as   the arcade/entertainment side.",
    "While the overall revenue story remains strong, comp sales are   another matter entirely. Comparable store sales declined by 1.8%   in the second quarter. While that might be an improvement over   last year's 2.4% decline, it is still a continuation of a   problematic trend that is undermining the long term potential of   the company.",
    "Revenue growth created the wiggle room for a 0.6% increase in   operating income, but as a percentage of revenue, operating   income actually decreased to 13.4% vs. 14.4% last year. Rising   interest expenses, along with higher tax provisions, led to a   4.2% decline in net income to $32.36 million. That breaks down to   $0.90 per diluted share vs. $0.84 per diluted share a year a   ago.",
    " Guidance ",
    "While the quarter itself certainly wasn't the best, the big   issue garnering negative sentiment is the forward looking   guidance. Dave & Buster's now expects revenues of $1.338   billion to $1.359 billion. This marks a decline from previous   guidance of $1.365 billion to $1.390 billion. This would still   mark a year over gain in total revenue, but the shift down is   still a negative for investors.",
    "Estimates for comp sales have deteriorated. Comparable store   sales are now expected to decrease between 2% to 3.5%. This is   the real problem with the stock. Unless the company changes this   trend in comp store sales, the long term picture is bleak in my   eyes.",
    "Net income is forecast in the range of $91 million to $100   million. On the liberal side of the guidance, it would mark a   17.22% decline from last's year's net income of $117.22 million.   What I think we might be seeing here is the effects of comp sales   finally taking their toll on the benefit of new store openings.   As sales decline at established locations, the costs remain. And   the revenues from new stores don't seem to be compensating for it   anymore. Dave & Buster's plans to open 15 to 16 new stores   this year, but total net income is expected to be lower. That   creates a real problem if not prudently addressed.",
    "As a destination, I absolutely love Dave & Buster's. As an   investment, there isn't a lot of momentum here. One needs to be   very vigilant of how Dave & Buster's handles this sales   situation moving forward. Store openings are not going to fix the   problem.",
    "  10 stocks we like better than Dave & Buster's     Entertainment       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Dave & Buster's     Entertainment wasn't one of them! That's right -- they think     these 10 stocks are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Dave & Buster's     Entertainment       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Dave & Buster's     Entertainment wasn't one of them! That's right -- they think     these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  David Butler      has no position in any of the stocks mentioned. The Motley Fool     recommends Dave & Buster's Entertainment. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:00:00"
}