{
  "url": "https://www.nasdaq.com/article/apple-may-steal-netflix-streaming-crown-but-only-for-a-year-20190911-00614",
  "title": "Apple may steal Netflix streaming crown, but only for a year - Nasdaq.com",
  "text": [
    "By Tanvi Mehta and Supantha Mukherjee",
    "Sept 11 (Reuters) - Apple Inc's  move to offer a free TV+ subscription for a year with every new device may briefly crown the iPhone maker as the biggest streaming service by user numbers, leapfrogging Netflix Inc .",
    "But it doesn't mean Apple will keep the lead.",
    "Given Wall Street expects Apple to sell at least 130 million iPhones outside of China in the next 12 months, and that last year it sold more than 60 million Macbooks and iPads, that should allow TV+ to easily top Netflix's almost 160 million users (graphic).",
    "Thereafter, however, all bets will be off, with Apple facing the same need for fresh shows to make subscribers pay, which drove Netflix to sink a $12 billion into new programming last year (graphic).",
    "While the company has spent months assembling a roster of Hollywood talent and planned shows, analysts say the $2 billionApple plans to spend this year is a long way from a guarantee of the hits it would need to pull in viewers, regardless of the cheaper $5 per month price tag for TV+.",
    "\"We believe Netflix's 10-year head start, scale, breath of content and customer engagement is unlikely to be dented by an Apple TV+ subscription service with a relatively light content slate and no library content,\" Credit Suisse analysts said.",
    "CROWDS",
    "The video streaming market is on the verge of becoming a very crowded space, with the new services from Apple and Walt Disney  set to compete with Hulu, Amazon.com Inc's  Prime Video and HBO Max. ",
    "Analysts say that will change the nature of a business where the relatively limited number of services and the idiosyncrasy of them - Prime for example is bundled with Amazon's free delivery service - meant users rarely had to choose.",
    "Whereas Netflix in the past took content from a wide range of studios and networks, now many of them will have their own streaming services and keep franchises like, for example, the Marvel cinematic universe, to themselves.",
    "Launching on Nov. 1 in 100 countries, Apple TV+ promises to launch a new show every week and has already announced drama \"See\" starring Jason Momoa, \"The Morning Show,\" with Reese Witherspoon and Jennifer Aniston, and \"Helpsters,\" a children's series from the makers of \"Sesame Street.\"",
    "But that still leaves it way short of the 700 separate shows Netflix made last year, including dozens in the U.S. list of top 100 most-watched. The streaming pioneer also reportedly plans to up spending to $15 billion(graphic).",
    "\"Apple is primarily focused on selling subscriptions to other services (e.g. HBO, Showtime) and modestly focused on original content,\" said Daniel Morgan, a portfolio manager at Synovus Trust Company in Atlanta who currently owns Apple shares.",
    "\"It seems unlikely that new entrants such as Apple TV Plus will be able to find a footing given how crowded the field has become.\"",
    "In that light, Apple's main focus with the project may prove to be as much keeping iPhone and iPad sales rolling as wading into a costly streaming war.",
    "Analysts from another Wall Street brokerage, Wedbush, said Apple's base of 900 million global iPhone users could allow it to steal 100 million streaming subscribers within 3-4 years. But they also pointed to iPhone sales, particularly in China, as the company's bigger priority.",
    "\"Apple is offering Apple TV+ free for a year ... to help stimulate demand for its trifecta of (new) smartphones,\" Wedbush said. \"Cook & Co. recognize this is a crucial product cycle.\""
  ],
  "published_datetime": "2019-09-11 12:31:00"
}