{
  "url": "https://www.nasdaq.com/article/german-software-firm-teamviewer-sets-ipo-price-range-at-up-to-55-bln-euros-20190911-00667",
  "title": "German software firm TeamViewer sets IPO price range at up to 5.5 bln euros - Nasdaq.com",
  "text": [
    "BERLIN, Sept 11 (Reuters) - German software company TeamViewer set the price range for its planned listing on the Frankfurt stock exchange on Wednesday, valuing it at up to 5.5 billion euros ($6.05 billion) in one of Europe's largest IPOs of the year.",
    "TeamViewer sells software for online meetings and remote desktop access, with more than 20 million support sessions taking place each day on its platform. Unlike many other tech companies going public, TeamViewer is already profitable.",
    "The private-equity backed firm said that its shares would be offered between 23.50 and 27.50 euros per share, with gross proceeds of between 1.41 billion to 2.31 billion euros depending on the final number of shares placed and the issue price.",
    "The offer period is set to run from Sept. 12-24, with the first day of trading planned for Sept. 25.",
    "After a steady stream of stock market listings last year, IPOs have slowed in Germany in 2019, with VW truck unit Traton  being the only sizeable Frankfurt of the year.",
    "Permira  bought TeamViewer for 870 million euros in 2014 and Permira'sGermany head Joerg Rockenhaeuser said that the investor wanted to remain a major shareholder after the IPO.",
    "TeamViewer says that its addressable market, currently worth 10 billion euros will grow to 30 billion in 2023, as companies invest in digitally controlling their production machines and the trend of employees working from home intensifies.",
    "Listed peers include Zoom Video Communications Inc , Okta Inc  and Slack Technologies Inc , which listed on the New York Stock Exchange in June at a blockbuster valuation of more than 50 times its revenues. ",
    "Goldman Sachs and Morgan Stanley are organising the IPO with the help of Bank of America, Barclays and RBC Capital Markets, while Lilja & Co is acting as so-called IPO adviser.",
    "($1 = 0.9083 euros)"
  ],
  "published_datetime": "2019-09-11 02:17:00"
}