{
  "url": "https://www.nasdaq.com/article/pepsico-inc-pep-ex-dividend-date-scheduled-for-september-05-2019-cm1207122",
  "title": "Pepsico, Inc. (PEP) Ex-Dividend Date Scheduled for September 05, 2019 - Nasdaq.com",
  "text": [
    "Pepsico, Inc. ( PEP  ) will begin trading ex-dividend on September 05, 2019. A cash dividend payment of $0.955 per share is scheduled to be paid on September 30, 2019. Shareholders who purchased PEP prior to the ex-dividend date are eligible for the cash dividend payment. This represents an 2.96% increase over prior dividend payment. At the current stock price of $137.46, the dividend yield is 2.78%.",
    "The previous trading day's last sale of PEP was $137.46, representing a -0.15% decrease from the 52 week high of $137.67 and a 31.5% increase over the 52 week low of $104.53.",
    "PEP is a part of the Consumer Non-Durables sector, which includes companies such as Coca-Cola Company ( KO  ) and Anheuser-Busch Inbev SA ( BUD  ). PEP's current earnings per share, an indicator of a company's profitability, is $9.02. Zacks Investment Research reports PEP's forecasted earnings growth in 2019 as -2.61%, compared to an industry average of 1.3%.",
    "For more information on the declaration, record and payment dates, visit the PEP Dividend History  page. Our  Dividend Calendar  has the full list of stocks that have an ex-dividend today.",
    " Interested in gaining exposure to PEP through an Exchange Traded Fund [ETF]?   The following ETF(s) have PEP as a top-10 holding:  Fidelity MSCI COnsumer Staples Index ETF (   FSTA    ) iShares U.S. ETF Trust (   IECS    ) iShares U.S. Consumer Goods ETF (   IYK    ) Vanguard Consumer Staples ETF (   VDC    ) SPDR Select Sector Fund - Consumer Staples (   XLP    ).  ",
    "The top-performing ETF of this group is XLP with an increase of 9.23% over the last 100 days. FSTA has the highest percent weighting of PEP at 9.55%.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:00:04"
}