{
  "url": "https://www.nasdaq.com/article/logm-or-mant-which-is-the-better-value-stock-right-now-cm1207184",
  "title": "LOGM or MANT: Which Is the Better Value Stock Right Now? - Nasdaq.com",
  "text": [
    " Investors with an interest in Computer - Services stocks have likely encountered both LogMein (LOGM) and ManTech International (MANT). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look. There are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits. Right now, LogMein is sporting a Zacks Rank of #1 (Strong Buy), while ManTech International has a Zacks Rank of #3 (Hold). This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that LOGM is likely seeing its earnings outlook improve to a greater extent. But this is just one factor that value investors are interested in. Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels. Our Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use. LOGM currently has a forward P/E ratio of 13, while MANT has a forward P/E of 29.97. We also note that LOGM has a PEG ratio of 2.60. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. MANT currently has a PEG ratio of 3.75. Another notable valuation metric for LOGM is its P/B ratio of 1.16. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, MANT has a P/B of 1.94. These are just a few of the metrics contributing to LOGM's Value grade of B and MANT's Value grade of C. LOGM is currently sporting an improving earnings outlook, which makes it stick out in our Zacks Rank model. And, based on the above valuation metrics, we feel that LOGM is likely the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  LogMein, Inc. (LOGM): Free Stock Analysis Report   ManTech International Corporation (MANT): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors with an interest in Computer - Services stocks have likely encountered both LogMein (LOGM) and ManTech International (MANT). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look.",
    "There are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits.",
    "Right now, LogMein is sporting a Zacks Rank of #1 (Strong Buy), while ManTech International has a Zacks Rank of #3 (Hold). This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that LOGM is likely seeing its earnings outlook improve to a greater extent. But this is just one factor that value investors are interested in.",
    "Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels.",
    "Our Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use.",
    "LOGM currently has a forward P/E ratio of 13, while MANT has a forward P/E of 29.97. We also note that LOGM has a PEG ratio of 2.60. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. MANT currently has a PEG ratio of 3.75.",
    "Another notable valuation metric for LOGM is its P/B ratio of 1.16. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, MANT has a P/B of 1.94.",
    "These are just a few of the metrics contributing to LOGM's Value grade of B and MANT's Value grade of C.",
    "LOGM is currently sporting an improving earnings outlook, which makes it stick out in our Zacks Rank model. And, based on the above valuation metrics, we feel that LOGM is likely the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:10"
}