{
  "url": "https://www.nasdaq.com/article/why-cbs-stock-gave-up-18-in-august-cm1210578",
  "title": "Why CBS Stock Gave Up 18% in August - Nasdaq.com",
  "text": [
    "Shares of CBS (NYSE: CBS) headed lower last month after the company's merger with Viacom (NASDAQ: VIA) was widely panned by Wall Street.",
    "The reunion between the two companies had been expected by the market, but investors seemed to be suspicious that the new company would be able to compete in a fast-changing media industry . According to data from S&P Global Market Intelligence , the stock finished down 18% last month.",
    "Image source: Getty Images.",
    "As you can see from the chart below, the stock fell sharply on Aug. 14 after the deal was announced.",
    "CBS data by YCharts.",
    "CBS announced the news on Aug. 13. The all-stock deal unites the broadcast network -- which also owns Showtime, several other CBS-branded properties, and a partial stake in the CW -- with Viacom, the parent of Comedy Central, MTV, and Nickelodeon, and Paramount Studios. It creates a company with $28 billion in annual revenue. The move comes as both companies look to assert themselves in an industry rapidly consolidating and preparing for streaming, which relies on a deep content library to attract subscribers.",
    "Viacom CEO Bob Bakish said the deal allows the new enterprise to \"become one of only a few companies with the breadth and depth of content and reach to shape the future of our industry.\" Together the combined company will be the market share leader in live TV viewership with 22%.",
    "The market initially liked the news as the stock rose on Aug. 13, finishing up 1.4%. However, sentiment changed the following day when analysts began to weigh in on the deal. A number of them downgraded the stock and suggested that CBS was trying to grab a piece of Disney 's magic in its own streaming announcement earlier, but doesn't have the content to match.   The stock lost 8% on Aug. 14.",
    "Traditional media stocks like CBS have fallen out of fashion as investors have jumped on streaming plays like Netflix and Roku , but there's a solid argument for CBS being an attractive value stock. Traditional broadcast and cable companies continue to generate solid profits and cash flow, and the threat of cord-cutting is often exaggerated as there are still many more U.S. subscribers to pay TV, which includes cable and satellite, than there are for Netflix.",
    "CBS may be operating from a position of weakness, but a tie-up with Viacom makes sense since it will only make its streaming services like CBS All Access more appealing to viewers.",
    "Still, it's up to the new company to persuade investors that the merger is a smart move. Until it does, or its results meaningfully change, expect the stock to remain at its current levels.",
    "10 stocks we like better than CBS\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and CBS wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Jeremy Bowman owns shares of Netflix and Walt Disney. The Motley Fool owns shares of and recommends Netflix, Roku, and Walt Disney. The Motley Fool has the following options: long January 2021 $60 calls on Walt Disney and short October 2019 $125 calls on Walt Disney. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-10 10:23:00"
}