{
  "url": "https://www.nasdaq.com/article/ibm-stock-come-for-the-buybacks-stay-for-the-potential-of-blockchain-and-the-cloud-cm1206732",
  "title": "IBM Stock: Come for the Buybacks, Stay for the Potential of Blockchain and the Cloud - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "For years, International Business Machines (NYSE: IBM ) has offered declining revenue but decent earnings per share that were boosted by the company's voracious appetite for buying back its own stock. While buybacks are often applauded, Wall Street eventually saw through that act and demanded more from IBM stock.",
    "Up nearly 19% year-to-date, it's fair to say IBM stock is on the mend, but not all the way back. Highly creative and nimble technology companies are often viewed as \"transformative.\" While that label probably doesn't apply to IBM, Big Blue is undergoing a transformation aimed at rejuvenating the company's growth and boosting IBM stock price.",
    "Analysts are mostly bullish on the company's recently closed acquisition of Red Hat and see the deal as a potential bullish catalyst for IBM stock price. Of course, the company paints a bullish picture of the deal, telling analysts and investors that it will be able to sell more IBM products to Red Hat users and vice versa.",
    "\"IBM said the deal will boost second half 2019 revenues by about 2 percentage points; 2020 by 4-5 percentage points; and 2021 by 2-3 percentage points,\" according to Barron's.",
    "Moreover, the Red Hat purchase will bolster IBM's free cash flow. That, in turn, could enable IBM to return more money to the owners of IBM stock.   Over the years, IBM stock has been pretty dependable on that front. In addition to IBM being a dedicated buyer of its own shares, the dividend of IBM stock has steadily grown and currently yields 4.94%, more than triple the yield on 10-year Treasuries.",
    "While IBM stock is widely viewed as a mature, if not lumbering, technology name, the company has a formidable presence in the fast-growing blockchain and is a worthy cloud competitor.  Cloud computing is certainly growing, but IBM is behind rivals such as Amazon.com (NASDAQ: AMZN ) and Microsoft  (NASDAQ: MSFT ) in the cloud-computing arena.",
    "\"Though still in the early stages, we think investments in IBM Cloud (a combination of SoftLayer and Bluemix); acquisition of Red Hat; establishment of development platforms like Watson Developer Cloud; and enterprise application partnerships with leading global companies present positive opportunities for IBM,\" said Morningstar in a recent note. \"Still, more work remains to be done.\"",
    "In the cloud space, IBM likely needs to sharpen its focus on software-as-a-service, also a hyper-competitive environment. With IBM facing intense competition in its hardware business from rivals, such as Oracle (NYSE: ORCL ) and Cisco (NASDAQ: CSCO ), software-as-a-service has become more important for IBM stock.",
    "\"Cloud computing and increasing competitive pressures from Oracle and Cisco will pressure IBM's systems segment,\" said Morningstar . \"We expect secular headwinds and intense competition to hinder the growth of IBM's hardware business over the long term. On average, we forecast a small annual decline in revenue for this segment through 2023.\"",
    "As for blockchain, a space where IBM has meaningful advantages over its competitors, the company recently unveiled its Trust Your Supplier (TYS) network. TYS is aimed at improving \"supplier qualification, validation, onboarding and life cycle information management\" for corporate customers.",
    "That's a lot of tech jargon. What it really means is the platform helps companies track the movement of goods and services. That could be a $2 trillion industry in a few years. TYS could easily attract many customers if its promises of improving administrative cost and onboarding efficiencies are realized. In the corporate world, \"efficiencies\" usually mean cost savings, and executives love that.",
    "There are positive aspects of the outlook of IBM stock. That outlook would grow more compelling if the Red Hat acquisition proves to be a better deal than previously believed. Currently, Red Hat is an \"add on\" to the positive thesis on IBM stock. But if the acquired company exceeds Wall Street's expectations, IBM stock could rally.",
    "IBM stock price could also climb if the company increases its footprint in the SaaS market. Trading at just 10.53 times the average forward earnings estimate, IBM is most definitely a value play in a sector in which investors are looking for growth. Moreover, even mature companies (see Microsoft) are delivering growth in the SaaS sector.",
    "IBM stock lacks the pizzazz of many equities in its sector, explaining its low multiples. That's all right as long as investors can wait for value stocks to come back into style, something that hasn't happened in over a decade.",
    "As of this writing, Todd Shriber did not hold a position in any of the aforementioned securities.",
    "The post IBM Stock: Come for the Buybacks, Stay for the Potential of Blockchain and the Cloud appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 07:40:27"
}