{
  "url": "https://www.nasdaq.com/article/walmart-puts-a-new-spin-on-meal-kits-cm1207690",
  "title": "Walmart Puts a New Spin on Meal Kits - Nasdaq.com",
  "text": [
    " In recent years, a number of companies have tried to profit by   making it easier for people to cook complete meals by offering   meal kits -- single packages that contain all the needed   ingredients to complete their dishes.   Walmart    (NYSE: WMT) recently entered that space with a variation on that   theme: shoppable recipes. The retail titan has partnered with BuzzFeed's Tasty app to   make it so customers can add the ingredients for 4,000 recipes   from Tasty videos directly to their virtual grocery carts. With a   single click, shoppers can add all the items needed for a recipe   to their orders for curbside pickup or home delivery. (Not every   Walmart offers those services.) \"Finding that perfect recipe, creating a grocery list and   finally getting to the store can keep any chef out of the   kitchen,\" said Walmart Chief Customer Officer Janey Whiteside in   a press release. \"We're excited to create a fun solution that   feeds customers appetites to put time back in their busy   schedules.\"makeArticleAd();   Many Walmart locations offer curbside pickup. Image source:     Walmart.  It's about convenience Walmart has been reshaping its whole business around the idea   of becoming more a convenient choice for customers. Curbside   pickup and home delivery make shopping easier, and this   partnership makes it simpler to cook more meals. The Tasty app   also offers video instructions for the home chef. \"From watching a mesmerizing Tasty video to cooking it in your   own kitchen, the missing link is buying the ingredients. More   than two-thirds of our audience have made a Tasty recipe and 90%   of American live within ten miles of a Walmart store, so we're   excited to build upon our partnership with Walmart and provide a   new feature that will solve the pain point of grocery shopping   and make it even easier for our audience to cook their favorite   Tasty recipes,\" said BuzzFeed Chief Marketing Officer Ben   Kaufman. The app directs consumers to walmart.com/grocery, where   shoppers can make substitutions for personal preference or   dietary needs. Walmart and BuzzFeed had already partnered on a   Tasty kitchenware line featuring nonstick cookware, bakeware,   kitchen gadgets, and accessories. This makes sense Most people want to cook more often -- it's usually healthier   and less costly than eating out or ordering   food    in. But lack of time and energy can conspire against that   impulse, and it's easy to grow bored with the dishes one knows   how to prepare. Even if one wants to escape from one's culinary   rut, preparing entirely new recipes can be daunting. The aim of   this partnership is to take some of the work and confusion out of   trying a new recipe. In some ways, it's better than a meal kit,   given that an instructional cooking video may be more helpful   than a basic recipe card. Once again,   Walmart    is attempting to remove a pain point for consumers -- a key piece   of its long-term strategy for maintaining its customer base and   growing its market share in the grocery segment. It seems likely   that other retailers will follow its lead.   10 stocks we like better than Walmart Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Walmart Inc. wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Daniel B. Kline      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "In recent years, a number of companies have tried to profit by   making it easier for people to cook complete meals by offering   meal kits -- single packages that contain all the needed   ingredients to complete their dishes.   Walmart    (NYSE: WMT) recently entered that space with a variation on that   theme: shoppable recipes.",
    "The retail titan has partnered with BuzzFeed's Tasty app to   make it so customers can add the ingredients for 4,000 recipes   from Tasty videos directly to their virtual grocery carts. With a   single click, shoppers can add all the items needed for a recipe   to their orders for curbside pickup or home delivery. (Not every   Walmart offers those services.)",
    "\"Finding that perfect recipe, creating a grocery list and   finally getting to the store can keep any chef out of the   kitchen,\" said Walmart Chief Customer Officer Janey Whiteside in   a press release. \"We're excited to create a fun solution that   feeds customers appetites to put time back in their busy   schedules.\"",
    "  Many Walmart locations offer curbside pickup. Image source:     Walmart. ",
    "Many Walmart locations offer curbside pickup. Image source:     Walmart.",
    "Walmart has been reshaping its whole business around the idea   of becoming more a convenient choice for customers. Curbside   pickup and home delivery make shopping easier, and this   partnership makes it simpler to cook more meals. The Tasty app   also offers video instructions for the home chef.",
    "\"From watching a mesmerizing Tasty video to cooking it in your   own kitchen, the missing link is buying the ingredients. More   than two-thirds of our audience have made a Tasty recipe and 90%   of American live within ten miles of a Walmart store, so we're   excited to build upon our partnership with Walmart and provide a   new feature that will solve the pain point of grocery shopping   and make it even easier for our audience to cook their favorite   Tasty recipes,\" said BuzzFeed Chief Marketing Officer Ben   Kaufman.",
    "The app directs consumers to walmart.com/grocery, where   shoppers can make substitutions for personal preference or   dietary needs. Walmart and BuzzFeed had already partnered on a   Tasty kitchenware line featuring nonstick cookware, bakeware,   kitchen gadgets, and accessories.",
    "Most people want to cook more often -- it's usually healthier   and less costly than eating out or ordering   food    in. But lack of time and energy can conspire against that   impulse, and it's easy to grow bored with the dishes one knows   how to prepare. Even if one wants to escape from one's culinary   rut, preparing entirely new recipes can be daunting. The aim of   this partnership is to take some of the work and confusion out of   trying a new recipe. In some ways, it's better than a meal kit,   given that an instructional cooking video may be more helpful   than a basic recipe card.",
    "Once again,   Walmart    is attempting to remove a pain point for consumers -- a key piece   of its long-term strategy for maintaining its customer base and   growing its market share in the grocery segment. It seems likely   that other retailers will follow its lead.",
    "  10 stocks we like better than Walmart Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Walmart Inc. wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Walmart Inc.       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Walmart Inc. wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Daniel B. Kline      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 06:06:00"
}