{
  "url": "https://www.nasdaq.com/article/why-shares-of-at-home-group-are-falling-today-cm1208201",
  "title": "Why Shares of At Home Group Are Falling Today - Nasdaq.com",
  "text": [
    "Shares of At Home Group (NYSE: HOME) fell more than 8% on Thursday morning before recovering somewhat after the home furnishing retailer posted quarterly results that beat on earnings but missed on revenue. It's been a tough time for consumer retail stocks , and At Home is proving to be no exception to the rule.",
    "After markets closed Wednesday, At Home reported second-quarter non-GAAP earnings of $0.18 per share, beating analyst expectations by $0.03. Revenue was up 18.7% year over year but came in just shy of expectations. Comparable sales fell 0.4% in the quarter, slightly better than what analysts had feared, with the company blaming adverse weather conditions during the early weeks of the quarter for depressing store traffic.",
    "Image source: Getty Images.",
    "Total revenue benefited from the company adding 13 new locations during the period. But there were signs of strain. Adjusted operating margins fell 3% to 6.8% of revenue, and adjusted EBITDA fell 4.4% from a year prior to $47.1 million. And At Home now expects fiscal 2020 full-year same-store sales to be down 1.5% to up 0.5%, a slip from previous guidance for up 0.5% to 1.5%.",
    "The company is also lowering its full-year capex spending guidance to $135 million to $155 million from $200 million to $220 million. Company chairman and CEO Lee Bird said in a statement that he was \"pleased with our team's accomplishments this quarter in successfully navigating a fluid tariff situation and implementing key marketing and merchandising initiatives focused on driving store traffic and strengthening our customer value proposition.\"",
    "Investors could also have been disappointed not to get an update on At Home's rumored sale process .",
    "At Home was a one-time highflier, at one point in 2018 up more than 160% from its 2016 IPO price. That gain has largely evaporated in 2019, with the shares now down 65% on the year.",
    "Given the challenging retail environment and the difficulty companies can have achieving outsized growth quarter by quarter as they get larger, investors should be very careful if they are considering going bargain hunting after this latest announcement.",
    "10 stocks we like better than At Home Group Inc.\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and At Home Group Inc. wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Lou Whiteman has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 01:01:00"
}