{
  "url": "https://www.nasdaq.com/article/albemarle-struggles-as-lithium-prices-continue-to-fall-cm1206886",
  "title": "Albemarle Struggles as Lithium Prices Continue to Fall - Nasdaq.com",
  "text": [
    "While the demand for rare and precious metals used in electric vehicle battery production remains strong, investors are facing a unique situation where prices have fallen to record lows. One key metal, lithium, has seen its prices fall by more than 40% in the past year, a decline that has eaten into the profit margins of top producers and wiped out the majority of their share price gains over the past couple of years.",
    "Among the companies hit the hardest by falling lithium prices is Albemarle (NYSE: ALB) , the world's largest lithium miner. With a market cap of $6.54 billion, shares of the lithium mining giant have fallen by 33.1% over the past few six months and 55% from its 2017 high. This drop isn't due to investors having a problem with Albemarle as a company but rather was caused by falling lithium prices. As such, many are now saying the stock is undervalued and could be a good investment today.",
    "Despite the fact that lithium demand is expected to explode over the coming years with demand for electric vehicles projected to skyrocket, the metal's prices in 2019 have been falling due to an oversupply problem caused by an avalanche of new lithium supplies. Australia, which is the world's leading producer of the battery metal with an output of 51,000 tons per year, has seen six new major lithium mines begin operations since 2017. Chile is the second-largest producer with 16,000 tons of annual output and it has opened its door to foreign companies looking to explore for lithium in the resource-rich Atacama salt flat. Over the past two decades, output from Chile has quadrupled with other countries seeing a similar increase in production over the same period.",
    "LITHIUM PRODUCERS ARE STRUGGLING AS PRICES PLUMMET. IMAGE SOURCE: GETTY IMAGES.",
    "Financing for junior and senior lithium and cobalt miners have also declined significantly as investors flee to more profitable mining sectors. The amount of investment capital available is seen as a proxy for investor confidence, and it has plummeted to all-time lows. In Q2 2019, the amount of cash raised on stock exchanges by lithium and cobalt miners fell to $34 million, a 96.2% decline from Q2 2018's $801 million raised. This decline in funding is also reflected in new drilling activity, with the number of newly completed drill holes having plummeted by more than 50% from its peak in Q3 2018.",
    "Since hitting its peak in 2017, Albemarle has seen its stock slide by more than 50% due almost entirely to the lithium oversupply problem. In response to the supply glut, the company decided to mothball its plans to add an extra 125,000 tons of processing capacity across all its facilities. Albemarle currently operates two major lithium sites, one in Silver Peak, Nevada and the other in Salar de Atacama, Chile, and it has postponed future expansions into Australia. Instead, Albemarle plans to reduce capital expenditure by $1.5 billion over the next few years and become cash-flow positive 2021.",
    "While it's easy to see why on a short-term basis the outlook for lithium producers isn't good, the silver lining behind this lithium glut is that it will force companies like Albemarle to cut down on the operational fat and become more efficient. In the next 24 months, demand for lithium will likely see an exponential increase, catching up to the current supply level as electrical vehicle production continues taking off.",
    "This seems to paint an excellent picture for the company, which is now trading at a 50% discount from the previous year due primarily to market factors outside its control. Besides being attractive from a value perspective, with the stock trading at 12 times earnings whereas historically it has traded closer to 15 times earnings, Albemarle has a strong dividend track record. The company has consistently raised its dividend every year for 25 years and currently offers a 2.38% dividend yield.",
    "If the company's management team follows through on its commitment to cut capital expenditures and become cash-flow positive again, Albemarle might become one of the top value stocks in the mining industry. Addressing these two areas is especially important, as these issues have deterred investors from buying this company's stock in the past. Fixing its cash-flows and curbing capital expenditures would easily make Albemarle a strong value play for investors looking for exposure to the electric vehicle market.",
    "10 stocks we like better than Albemarle\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Albemarle wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Mark Prvulovic has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:26:54"
}