{
  "url": "https://www.nasdaq.com/article/hkmpf-vs-nbix-which-stock-should-value-investors-buy-now-cm1207995",
  "title": "HKMPF vs. NBIX: Which Stock Should Value Investors Buy Now? - Nasdaq.com",
  "text": [
    " Investors looking for stocks in the Medical - Drugs sector might want to consider either Hikma Pharmaceuticals Plc (HKMPF) or Neurocrine Biosciences (NBIX). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look. We have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits. Currently, both Hikma Pharmaceuticals Plc and Neurocrine Biosciences are holding a Zacks Rank of # 2 (Buy). Investors should feel comfortable knowing that both of these stocks have an improving earnings outlook since the Zacks Rank favors companies that have witnessed positive analyst estimate revisions. But this is just one piece of the puzzle for value investors. Value investors also try to analyze a wide range of traditional figures and metrics to help determine whether a company is undervalued at its current share price levels. Our Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use. HKMPF currently has a forward P/E ratio of 16.93, while NBIX has a forward P/E of 118.82. We also note that HKMPF has a PEG ratio of 1.82. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. NBIX currently has a PEG ratio of 4.95. Another notable valuation metric for HKMPF is its P/B ratio of 3.61. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, NBIX has a P/B of 18.48. These metrics, and several others, help HKMPF earn a Value grade of B, while NBIX has been given a Value grade of D. Both HKMPF and NBIX are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that HKMPF is the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Hikma Pharmaceuticals Plc (HKMPF): Free Stock Analysis Report   Neurocrine Biosciences, Inc. (NBIX): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors looking for stocks in the Medical - Drugs sector might want to consider either Hikma Pharmaceuticals Plc (HKMPF) or Neurocrine Biosciences (NBIX). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look.",
    "We have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits.",
    "Currently, both Hikma Pharmaceuticals Plc and Neurocrine Biosciences are holding a Zacks Rank of # 2 (Buy). Investors should feel comfortable knowing that both of these stocks have an improving earnings outlook since the Zacks Rank favors companies that have witnessed positive analyst estimate revisions. But this is just one piece of the puzzle for value investors.",
    "Value investors also try to analyze a wide range of traditional figures and metrics to help determine whether a company is undervalued at its current share price levels.",
    "Our Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use.",
    "HKMPF currently has a forward P/E ratio of 16.93, while NBIX has a forward P/E of 118.82. We also note that HKMPF has a PEG ratio of 1.82. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. NBIX currently has a PEG ratio of 4.95.",
    "Another notable valuation metric for HKMPF is its P/B ratio of 3.61. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, NBIX has a P/B of 18.48.",
    "These metrics, and several others, help HKMPF earn a Value grade of B, while NBIX has been given a Value grade of D.",
    "Both HKMPF and NBIX are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that HKMPF is the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:40:11"
}