{
  "url": "https://www.nasdaq.com/article/apogee-stock-appreciates-21-ytd-whats-driving-the-rally-cm1207419",
  "title": "Apogee Stock Appreciates 21% YTD: What's Driving the Rally? - Nasdaq.com",
  "text": [
    " Shares of Apogee Enterprises, Inc. APOG  have rallied 21% year to date, aided by its forecast-toppings earnings and revenue performance in first-quarter fiscal 2020.  The stock is also gaining from solid bidding and order activities, robust backlog and a continued upbeat outlook for the North America commercial construction market.  makeArticleAd();  Apogee, a Zacks Rank #3 (Hold) stock, has a market cap of roughly $979.3 million. The company has an expected long-term earnings per share growth rate of 10%.    Notably, the stock's 21% year-to-date rally has outperformed the  industry  's decline of roughly 25.7%.      Let's delve deeper and analyze the reasons behind the company's impressive price performance and find out if there is room for further appreciation:   Stellar Results in Q1:  Apogee delivered adjusted earnings per share of 58 cents in the fiscal first quarter, surpassing the Zacks Consensus Estimate of 53 cents. The company generated revenues of $355 million, which also comfortably beat the Zacks Consensus Estimate of $325 million.   Healthy Growth Projections:  The Zacks Consensus Estimate for earnings per share is currently pegged at $3.03 for fiscal 2020, indicating year-over-year growth of 2.4%. For fiscal 2021, the Zacks Consensus Estimate for earnings is pegged at $3.60, highlighting year-over-year growth of 18.8%.   Return on Assets (ROA):  Apogee currently has a ROA of 7.6%, while the industry's ROA is 4.1%. An above-average ROA denotes that the company is generating earnings by effectively managing assets.   Growth Drivers in Place    Apogee's segments have opportunities to boost its market share, expand into new geographies and markets, and roll out products. These growth opportunities are backed by the solid bidding and order activities, robust backlog, and an encouraging outlook for the North American commercial construction market. The North America commercial construction market is poised to grow throughout fiscal 2020, as market activity continues to reflect stellar growth in all the regions and sectors across the United States, in particular, office and institutional building segments, both of which are core markets for Apogee.    Apogee will likely benefit from its focus on strategy to grow and diversify the business, which will strengthen the company's operations and boost profitability. The company's continued focus on investment in projects will fuel growth and improve productivity.    Regarding acquisitions, Apogee is primarily focusing on the integration of EFCO to identify margin opportunities. The company is marching ahead with synergy goals by leveraging supplier relationships and driving on-time delivery. The company remains optimistic about the long-term prospects for this business.  Apogee Enterprises, Inc. Price and Consensus         Apogee Enterprises, Inc.   price-consensus-chart    |   Apogee Enterprises, Inc. Quote    Zacks Rank & Stocks to Consider    Apogee currently carries a Zacks Rank #3 (Hold).    A few better-ranked stocks in the Industrial Products  sector are Zebra Technologies Corp. ZBRA  , Avery Dennison Corp. AVY  and Tetra Tech, Inc. TTEK  . While Zebra Technologies currently sports a Zacks Rank #1 (Strong Buy), Avery Dennison and Tetra Tech carry a Zacks Rank of 2 (Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here.     Zebra Technologies has a projected earnings growth rate of 16.71% for the current year. The stock has gained 19% in a year's time.    Avery Dennison has an estimated earnings growth rate of 8.42% for 2019. The company's shares have rallied 11.5% in the past year.    Tetra Tech has an expected earnings growth rate of 15.97% for the ongoing year. The stock has appreciated 16.5% over the past year.   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Apogee Enterprises, Inc. (APOG): Free Stock Analysis Report   Zebra Technologies Corporation (ZBRA): Free Stock Analysis Report   Avery Dennison Corporation (AVY): Free Stock Analysis Report   Tetra Tech, Inc. (TTEK): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Shares of Apogee Enterprises, Inc. APOG  have rallied 21% year to date, aided by its forecast-toppings earnings and revenue performance in first-quarter fiscal 2020.  The stock is also gaining from solid bidding and order activities, robust backlog and a continued upbeat outlook for the North America commercial construction market.  makeArticleAd();  Apogee, a Zacks Rank #3 (Hold) stock, has a market cap of roughly $979.3 million. The company has an expected long-term earnings per share growth rate of 10%.    Notably, the stock's 21% year-to-date rally has outperformed the  industry  's decline of roughly 25.7%.",
    "     Let's delve deeper and analyze the reasons behind the company's impressive price performance and find out if there is room for further appreciation:   Stellar Results in Q1:  Apogee delivered adjusted earnings per share of 58 cents in the fiscal first quarter, surpassing the Zacks Consensus Estimate of 53 cents. The company generated revenues of $355 million, which also comfortably beat the Zacks Consensus Estimate of $325 million.   Healthy Growth Projections:  The Zacks Consensus Estimate for earnings per share is currently pegged at $3.03 for fiscal 2020, indicating year-over-year growth of 2.4%. For fiscal 2021, the Zacks Consensus Estimate for earnings is pegged at $3.60, highlighting year-over-year growth of 18.8%.   Return on Assets (ROA):  Apogee currently has a ROA of 7.6%, while the industry's ROA is 4.1%. An above-average ROA denotes that the company is generating earnings by effectively managing assets.   Growth Drivers in Place    Apogee's segments have opportunities to boost its market share, expand into new geographies and markets, and roll out products. These growth opportunities are backed by the solid bidding and order activities, robust backlog, and an encouraging outlook for the North American commercial construction market. The North America commercial construction market is poised to grow throughout fiscal 2020, as market activity continues to reflect stellar growth in all the regions and sectors across the United States, in particular, office and institutional building segments, both of which are core markets for Apogee.    Apogee will likely benefit from its focus on strategy to grow and diversify the business, which will strengthen the company's operations and boost profitability. The company's continued focus on investment in projects will fuel growth and improve productivity.    Regarding acquisitions, Apogee is primarily focusing on the integration of EFCO to identify margin opportunities. The company is marching ahead with synergy goals by leveraging supplier relationships and driving on-time delivery. The company remains optimistic about the long-term prospects for this business.",
    " Apogee Enterprises, Inc. Price and Consensus ",
    "       Apogee Enterprises, Inc.   price-consensus-chart    |   Apogee Enterprises, Inc. Quote  ",
    " Apogee Enterprises, Inc.   price-consensus-chart    |   Apogee Enterprises, Inc. Quote ",
    " Zacks Rank & Stocks to Consider    Apogee currently carries a Zacks Rank #3 (Hold).    A few better-ranked stocks in the Industrial Products  sector are Zebra Technologies Corp. ZBRA  , Avery Dennison Corp. AVY  and Tetra Tech, Inc. TTEK  . While Zebra Technologies currently sports a Zacks Rank #1 (Strong Buy), Avery Dennison and Tetra Tech carry a Zacks Rank of 2 (Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here.     Zebra Technologies has a projected earnings growth rate of 16.71% for the current year. The stock has gained 19% in a year's time.    Avery Dennison has an estimated earnings growth rate of 8.42% for 2019. The company's shares have rallied 11.5% in the past year.    Tetra Tech has an expected earnings growth rate of 15.97% for the ongoing year. The stock has appreciated 16.5% over the past year.   Biggest Tech Breakthrough in a Generation    Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:36:00"
}