{
  "url": "https://www.nasdaq.com/article/why-cloudera-stock-is-rising-today-cm1208173",
  "title": "Why Cloudera Stock Is Rising Today - Nasdaq.com",
  "text": [
    "After managemen t report ed fiscal 2020 second-quarter results, shares of Cloudera (NYSE: CLDR) , an enterprise data cloud company , rose 14% as of 10:51 a.m. EDT on Thursday.",
    "Here are the headline numbers from the quarter:",
    "Check out the latest earnings call transcript for Cloudera .",
    "Image source: Getty Images.",
    "Here is the guidance that is being shared with investors for the upcoming quarter and year:",
    "Given the better-than-expected quarterly results and upbeat guidance, it's no surprise to see shares flying high today.",
    "It's been an interesting year for Cloudera. The company got off to a very rough start after it reported weak quarterly results, slashed its full-year guidance, and announced a surprise CEO transition . The stock became so cheap that billionaire activist investor Carl Icahn took an interest in the company and started to load up on shares .",
    "There's no telling what might happen next, but if Cloudera can string together a few more beat-and-raise quarters like it just did, I could easily see this stock's upbeat trajectory continuing.",
    "10 stocks we like better than Cloudera, Inc.\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Cloudera, Inc. wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Brian Feroldi has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:05:00"
}