{
  "url": "https://www.nasdaq.com/article/why-square-stock-sank-23-in-august-cm1210646",
  "title": "Why Square Stock Sank 23% in August - Nasdaq.com",
  "text": [
    " What happened Shares of   Square    (NYSE: SQ) fell more than 20% last month, according to data   provided by      S&P Global Market Intelligence    , following the release of the digital payments company's   second-quarter results. So what Square's second-quarter sales and profits actually came in   above Wall Street's estimates. The company's adjusted revenue   climbed 46% year over year to $563 million, while its adjusted   earnings per share surged 62% to $0.21. Analysts had expected   revenue and adjusted EPS of $557 million and $0.17,   respectively. However, investors appear to be focusing more on Square's   guidance. For the third quarter, the company expects to deliver   adjusted revenue of $590 million to $600 million and adjusted EPS   of $0.18 and $0.20. The midpoints of these ranges are less than   the $599 million in revenue and $0.22 in adjusted EPS analysts   had forecast.makeArticleAd();   Square's underwhelming guidance led some investors to sell     its stock. Image source: Getty Images.  Now what Investors may be overreacting to Square's slightly   lower-than-expected guidance. The company still has tremendous   potential for long-term growth. Square's core payment processing   business represents just a small fraction of the massive global   digital payments market    . Its business financing arm,   Square Capital    , also has the potential to grow exponentially. And Square's   Cash App    continues to expand its user and revenue base at an impressive   clip. With so much growth still ahead -- and with its share price   now down about 40% from its 52-week high -- investors may want to   consider picking up some Square stock today.   10 stocks we like better than Square       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Square wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Joe Tenebruso      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Square. The Motley Fool has the     following options: short September 2019 $70 puts on Square. The     Motley Fool has a     disclosure policy      .  ",
    "Shares of   Square    (NYSE: SQ) fell more than 20% last month, according to data   provided by      S&P Global Market Intelligence    , following the release of the digital payments company's   second-quarter results.",
    "Square's second-quarter sales and profits actually came in   above Wall Street's estimates. The company's adjusted revenue   climbed 46% year over year to $563 million, while its adjusted   earnings per share surged 62% to $0.21. Analysts had expected   revenue and adjusted EPS of $557 million and $0.17,   respectively.",
    "However, investors appear to be focusing more on Square's   guidance. For the third quarter, the company expects to deliver   adjusted revenue of $590 million to $600 million and adjusted EPS   of $0.18 and $0.20. The midpoints of these ranges are less than   the $599 million in revenue and $0.22 in adjusted EPS analysts   had forecast.",
    "  Square's underwhelming guidance led some investors to sell     its stock. Image source: Getty Images. ",
    "Square's underwhelming guidance led some investors to sell     its stock. Image source: Getty Images.",
    "Investors may be overreacting to Square's slightly   lower-than-expected guidance. The company still has tremendous   potential for long-term growth. Square's core payment processing   business represents just a small fraction of the massive global   digital payments market    . Its business financing arm,   Square Capital    , also has the potential to grow exponentially. And Square's   Cash App    continues to expand its user and revenue base at an impressive   clip.",
    "With so much growth still ahead -- and with its share price   now down about 40% from its 52-week high -- investors may want to   consider picking up some Square stock today.",
    "  10 stocks we like better than Square       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Square wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Square       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Square wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Joe Tenebruso      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Square. The Motley Fool has the     following options: short September 2019 $70 puts on Square. The     Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:36:00"
}