{
  "url": "https://www.nasdaq.com/article/notable-tuesday-option-activity-uri-aimt-dci-cm1206914",
  "title": "Notable Tuesday Option Activity: URI, AIMT, DCI - Nasdaq.com",
  "text": [
    "Among the underlying components of the Russell 3000 index, we saw noteworthy  options trading  volume today in United Rentals Inc (Symbol: URI), where a total of 6,310 contracts have traded so far, representing approximately 631,000 underlying shares. That amounts to about 48.5% of URI's average daily trading volume over the past month of 1.3 million shares. Especially high volume was seen for the $90 strike call option expiring September 13, 2019  , with 645 contracts trading so far today, representing approximately 64,500 underlying shares of URI. Below is a chart showing URI's trailing twelve month trading history, with the $90 strike highlighted in orange:       makeArticleAd();    Aimmune Therapeutics Inc (Symbol: AIMT) options are showing a volume of 2,975 contracts thus far today. That number of contracts represents approximately 297,500 underlying shares, working out to a sizeable 45.9% of AIMT's average daily trading volume over the past month, of 647,960 shares. Particularly high volume was seen for the $17.50 strike put option expiring September 20, 2019  , with 1,606 contracts trading so far today, representing approximately 160,600 underlying shares of AIMT. Below is a chart showing AIMT's trailing twelve month trading history, with the $17.50 strike highlighted in orange:       And Donaldson Co. Inc. (Symbol: DCI) options are showing a volume of 1,970 contracts thus far today. That number of contracts represents approximately 197,000 underlying shares, working out to a sizeable 45.7% of DCI's average daily trading volume over the past month, of 431,455 shares. Especially high volume was seen for the $50 strike call option expiring September 20, 2019  , with 1,403 contracts trading so far today, representing approximately 140,300 underlying shares of DCI. Below is a chart showing DCI's trailing twelve month trading history, with the $50 strike highlighted in orange:         For the various different available expirations for URI options  , AIMT options  , or DCI options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 15:28:13"
}