{
  "url": "https://www.nasdaq.com/article/airline-stock-roundup-aal-ual-extend-737-max-grounding-period-alk-in-focus-cm1206681",
  "title": "Airline Stock Roundup: AAL & UAL Extend 737 MAX Grounding Period, ALK in Focus - Nasdaq.com",
  "text": [
    " In the past week, American Airlines AAL  and United Airlines UAL  extended the grounding period of Boeing 737 Max jets in their respective fleets. Currently, American Airlines and United Airlines have 24 and 14 such jets, respectively. A couple of updates were also available from Alaska Air Group's ALK  wholly-owned subsidiary - Alaska Airlines - in the past week. The carrier announced the ratifications  of two pay-related labor deals and also issued an update related to its expansion on the West Coast. An expansion-related update was available from Delta Air Lines DAL  as well. European low-cost carrier, Ryanair Holdings RYAAY  too grabbed headlines by virtue of its decision to announce a change at the helm of the group's biggest airline, Ryanair DAC. The Irish carrier also announced an 8% increase in its August traffic. (Read the Last Airline Stock Roundup here  ).  Recap of Past Week's Most Important Stories  1. Updates on Boeing 737 MAX jets have been flooding the aviation space ever since the deadly Ethiopian Airlines' crash on Mar 10, 2019. In fact, this was the second accident involving Boeing 737 MAX jets within a span of five months. The same model had crashed in Indonesia during October 2018, killing 189 people. The latest update came from American Airlines that suspended operations of its Boeing 737 Max jets until Dec 3, 2019, extending the grounding period from the previously announced Nov 2. American Airlines anticipates approximately 140 flights to be canceled per day through Dec 3. Also, United Airlines expects 737 MAX jets in its fleet to remain grounded through Dec 19 as opposed to Nov 3, expected earlier. Notably, Southwest Airlines LUV  , which has 34 such jets in its fleet, had announced earlier that it will remove Boeing 737 MAX jets from its schedule until Jan 5, 2020. (Read more: American Airlines Extends Boeing 737 MAX Grounding Period  ) 2. In a bid to expand its presence in the West Coast, Alaska Airlines announced that it aims to add eight new routes connecting the \"vibrant Pacific Northwest communities\" with California cities like Los Angeles and San Francisco. For instance, there will be two daily departures from Spokane to Los Angeles and San Francisco each. While some of the above flights (for example, Spokane to Los Angeles) will start operations from Jan 7, 2020, most others (for example, Spokane to San Francisco, Missoula to Los Angeles) will take to the skies from Mar 19. (Read more: Alaska Airlines to Boost West Coast Presence With New Routes  ) 3. To meet the surge in demand during the upcoming winter season, Delta intends to ramp up services to popular Caribbean destinations from its hubs. To this end, the carrier aims to launch an additional daily flight from Dec 21, 2019, in the New York John F. Kennedy Airport (JFK)-Luis Munoz Marin International Airport (SJU) route. Post commencement of this new service, Delta will offer a total of four daily flights on the same route. (Read more: Delta to Boost Caribbean Services From Its Hubs This Winter  ) Delta carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .  4. Ryanair, which operates as a holding group company and includes several airlines, stated that highly-experienced Eddie Wilson has replaced Michael O'Leary as chief executive officer (CEO) of the group's biggest airline, Ryanair DAC, with immediate effect. Notably, Wilson has been associated with the airline for 22 years. O'Leary will, however, continue to function as the group's CEO. Additionally, Ryanair's August traffic report was impressive, with the metric (including 0.6 million from its LaudaMotion unit) increasing 8% year over year to 14.9 million. However, the load factor remained unaltered at 97%. The carrier operated more than 81,000 scheduled flights in August. 5. Azul's AZUL  cargo division - Azul Cargo Express - has entered into a new agreement with Mercado Libre, the largest e-commerce company in Latin America, for deliveries across Brazil. The two companies have started working together earlier this year. Presently, Azul derives 10% of its cargo revenues from Mercado Libre. The company's cargo business is benefiting immensely from rapid e-commerce growth. Notably, its cargo revenues increased 44% during the first half of 2019. The new deal should further fortify its cargo operations.  Performance  The following table shows the price movement of the major airline players over the past week and during the last six months.    The table above shows that all airline stocks traded in the green over the past week, resulting in the NYSE ARCA Airline Index gaining 3.8% to $92.89. Over the course of six months, the same depreciated 3.5% due to double-digit losses at the likes of Spirit Airlines and American Airlines.  What's Next in the Airline Space?  Investors will look forward to August traffic reports from the likes of SkyWest in the coming days. Updates on the impact of Hurricane Dorian on airline operations will also be awaited.  Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   American Airlines Group Inc. (AAL): Free Stock Analysis Report   Alaska Air Group, Inc. (ALK): Free Stock Analysis Report   Southwest Airlines Co. (LUV): Free Stock Analysis Report   United Airlines Holdings Inc (UAL): Free Stock Analysis Report   Delta Air Lines, Inc. (DAL): Free Stock Analysis Report   Ryanair Holdings PLC (RYAAY): Free Stock Analysis Report   AZUL SA (AZUL): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "In the past week, American Airlines AAL  and United Airlines UAL  extended the grounding period of Boeing 737 Max jets in their respective fleets. Currently, American Airlines and United Airlines have 24 and 14 such jets, respectively.",
    "A couple of updates were also available from Alaska Air Group's ALK  wholly-owned subsidiary - Alaska Airlines - in the past week. The carrier announced the ratifications  of two pay-related labor deals and also issued an update related to its expansion on the West Coast. An expansion-related update was available from Delta Air Lines DAL  as well.",
    "European low-cost carrier, Ryanair Holdings RYAAY  too grabbed headlines by virtue of its decision to announce a change at the helm of the group's biggest airline, Ryanair DAC. The Irish carrier also announced an 8% increase in its August traffic.",
    "(Read the Last Airline Stock Roundup here  ).",
    " Recap of Past Week's Most Important Stories ",
    "1. Updates on Boeing 737 MAX jets have been flooding the aviation space ever since the deadly Ethiopian Airlines' crash on Mar 10, 2019. In fact, this was the second accident involving Boeing 737 MAX jets within a span of five months. The same model had crashed in Indonesia during October 2018, killing 189 people.",
    "The latest update came from American Airlines that suspended operations of its Boeing 737 Max jets until Dec 3, 2019, extending the grounding period from the previously announced Nov 2. American Airlines anticipates approximately 140 flights to be canceled per day through Dec 3. Also, United Airlines expects 737 MAX jets in its fleet to remain grounded through Dec 19 as opposed to Nov 3, expected earlier. Notably, Southwest Airlines LUV  , which has 34 such jets in its fleet, had announced earlier that it will remove Boeing 737 MAX jets from its schedule until Jan 5, 2020. (Read more: American Airlines Extends Boeing 737 MAX Grounding Period  )",
    "2. In a bid to expand its presence in the West Coast, Alaska Airlines announced that it aims to add eight new routes connecting the \"vibrant Pacific Northwest communities\" with California cities like Los Angeles and San Francisco. For instance, there will be two daily departures from Spokane to Los Angeles and San Francisco each. While some of the above flights (for example, Spokane to Los Angeles) will start operations from Jan 7, 2020, most others (for example, Spokane to San Francisco, Missoula to Los Angeles) will take to the skies from Mar 19. (Read more: Alaska Airlines to Boost West Coast Presence With New Routes  )",
    "3. To meet the surge in demand during the upcoming winter season, Delta intends to ramp up services to popular Caribbean destinations from its hubs. To this end, the carrier aims to launch an additional daily flight from Dec 21, 2019, in the New York John F. Kennedy Airport (JFK)-Luis Munoz Marin International Airport (SJU) route. Post commencement of this new service, Delta will offer a total of four daily flights on the same route. (Read more: Delta to Boost Caribbean Services From Its Hubs This Winter  )",
    "Delta carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  . ",
    "4. Ryanair, which operates as a holding group company and includes several airlines, stated that highly-experienced Eddie Wilson has replaced Michael O'Leary as chief executive officer (CEO) of the group's biggest airline, Ryanair DAC, with immediate effect. Notably, Wilson has been associated with the airline for 22 years. O'Leary will, however, continue to function as the group's CEO.",
    "Additionally, Ryanair's August traffic report was impressive, with the metric (including 0.6 million from its LaudaMotion unit) increasing 8% year over year to 14.9 million. However, the load factor remained unaltered at 97%. The carrier operated more than 81,000 scheduled flights in August.",
    "5. Azul's AZUL  cargo division - Azul Cargo Express - has entered into a new agreement with Mercado Libre, the largest e-commerce company in Latin America, for deliveries across Brazil. The two companies have started working together earlier this year. Presently, Azul derives 10% of its cargo revenues from Mercado Libre. The company's cargo business is benefiting immensely from rapid e-commerce growth. Notably, its cargo revenues increased 44% during the first half of 2019. The new deal should further fortify its cargo operations.",
    " Performance ",
    "The following table shows the price movement of the major airline players over the past week and during the last six months.",
    "The table above shows that all airline stocks traded in the green over the past week, resulting in the NYSE ARCA Airline Index gaining 3.8% to $92.89. Over the course of six months, the same depreciated 3.5% due to double-digit losses at the likes of Spirit Airlines and American Airlines.",
    " What's Next in the Airline Space? ",
    "Investors will look forward to August traffic reports from the likes of SkyWest in the coming days. Updates on the impact of Hurricane Dorian on airline operations will also be awaited.",
    " Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:21:00"
}