{
  "url": "https://www.nasdaq.com/article/netease-autodesk-and-amazon-highlighted-as-zacks-bull-and-bear-of-the-day-cm1210437",
  "title": "NetEase, Autodesk and Amazon highlighted as Zacks Bull and Bear of the Day - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL - September 11, 2019 - Zacks Equity Research  NetEase NTES  as the Bull of the Day, Autodesk ADSK  as the Bear of the Day. In addition, Zacks Equity Research provides analysis on Amazon AMZN  . Here is a synopsis of all three stocks:   Bull of the Day  :  When I look for a Bull of the Day, it's important for me to find stocks with strong earnings trends. One way to do that is to lean on the time-tested power of the Zacks Rank. Stocks that are Zacks Rank #1 (Strong Buy) and Zacks Rank #2 (Buy) are a good place to start. That way, you know the stock you are looking at has a strong earnings profile, with analysts continually revising their earnings estimates to the upside. In addition to the strong Zacks Rank on the individual stock, I like to find stocks within strong industries. The strongest industries often have tailwinds which are helping the stocks make more money. The industry this stock is in, is currently in the Top 22% of our Zacks Industry Rank. The last part of this equation has to be growth. Growth is the greatest mover of stock prices. Two major things move when growth increases. Earnings go up directly as a result of growth and, often times, the earnings multiple increases when growth increases. My stock to double here has all of these components, giving it a real shot at doubling its size, despite being as large as it already is. My pick is Zacks Rank #2 (Buy) NetEase  . NetEase is a Chinese internet technology company providing online PC and mobile games. The company develops their own games like Fantasy Westward Journey and Heroes of Tang Dynasty Zero, as well as partners with other developers to adapt games to their local markets. For example, they have teamed up with Blizzard Entertainment to operate local versions of World of Warcraft and Overwatch. They've also been working on a huge VR multiplayer online game with an open world setting they call Nostos. Earnings estimates have been moving in the right direction here for NetEase. Negative revisions plagued the stock from late 2017 until early 2019. It was then when earnings troughed and started moving back in the right direction. What should be even more encouraging for the bulls is the fact tha t earnings  growth is beginning to be baked in here. In fact, NetEase has future year-over-year projected growth of over 30% for the next five years.  NetEase, Inc. Price and Consensus  Current valuations have NetEase trading at 25x forward 12-month earnings. At the surface, that sounds a bit rich considering that the broad market trades at about 17x. However, there are two mitigating factors which make this number much more palatable. While the broad market trades at 17x, the Computer Software - Services industry trades at 27.87x. The other factor I pointed out earlier, huge sales growth numbers for NTES. The company is on the cusp of a huge growth opportunity. That is bringing the PEG ratio under 1. That means that for its projected amount of growth, the stock is undervalued. The PEG ratio is 0.82. That's what gives NTES the roadmap to potentially double over the next several quarters. Coming back into growth could lead to a surge in the stock price. That growth could come from the explosion in gaming. This fiscal year, mobile gaming revenue for the company is projected to grow at 16% year-over-year. Overall, that industry has been growing exponentially. Gaming is the fastest-growing form of entertainment in the world. Revenues have been increasing globally at a clip of 9.7% per year. Last year, video game revenues totaled $139 billion. By 2022, the global video game market is estimated to be nearly $200 billion.  Bear of the Day  : Sometimes, stocks get beat down for no reason at all. It can be very confusing and frustrating for investors when their favorite stock is going down for seemingly no reason. If you pay close attention to earnings estimates from analysts, often times, you can get a warning ahead of impending doom. I don't want to sound like the harbinger of bad news here, I'm just setting up the reasoning for today's Bear of the Day. It's Zacks Rank #5 (Strong Sell) Autodesk.  Autodesk, Inc. operates as a design software and services company worldwide. The company offers AutoCAD, a professional design, drafting, detailing, and visualization software; AutoCAD Civil 3D, a surveying, design, analysis, and documentation solution for civil engineering, including land development, transportation, and environmental projects; AutoCAD LT, a professional drafting and detailing software; BIM 360, a construction management cloud-based software; computer-aided manufacturing (CAM) software for computer numeric control machining, inspection, and modelling for manufacturing; Fusion 360, a 3D CAD, CAM, and computer-aided engineering tool; and Industry Collections software products for professionals in architecture, engineering and construction, product design and manufacturing, and media and entertainment industries. The reason for the unfavorable Zacks Rank is the series o f earnings  estimate revisions coming in to the downside recently. Over the last thirty days, eight analysts have cut their earnings estimates for the next quarter and next year. The bearish sentiment has dropped our Zacks Consensus Estimate from 99 cents to 94 cents for next quarter, while next year's number has come down from $4.78 to $4.53. I don't want to lead on as if Autodesk is tumbling down to zero. In fact, even with these negative estimates, next quarter's EPS growth is slated to come in at 104%, while next year's growth number is set to hit 63.7%. Revenue is still set to grow at 21.89% next quarter and 21.7% next year. Growth has slowed some, which has caused Autodesk's earnings multiple to shrink a bit. The stock is trading at a PE of 54.5x earnings, above the industry average of 41.7x and well above the broad market average of 17.8x.   Amazon Expands Prime to Brazil    Amazon  has rolled out Prime Subscription services in Brazil, in order to strengthen presence in the Latin America. Notably, Prime members in Brazil will now enjoy unlimited nationwide free shipping and a maximum 48-hour delivery time in more than 90 municipalities. Products eligible for Prime delivery will include all types of goods ranging from clothes to electronics. In addition to these benefits, the Prime subscribers will have access to movies, music, and digital books and magazines on the Prime platform. This will likely increase Amazon's subscriber base and give the online retailer an edge over online streaming services like Netflix. Notably, the Brazilian Prime package will cost 9.90 reals ($2.42) a month, or 89.00 reals a year. The latest move of the company, which will strengthen its footprint in Brazil, is in sync with continued focus on expanding presence in the Latin American region.  Amazon Expands in Brazil  The company made its foray into the Brazilian e-commerce market in 2012. Notably, its expanding product portfolio bodes well. Amazon's strong efforts to bolster market share by improving customer base in the country will further drive top-line growth. The company has presence in the country's online books and electronics retail markets. Last year, it had made foray into the clothing, accessories and footwear market of Brazil via its Brazilian marketplace. In addition, it had announced plans to enhance product offerings by bringing a wide variety of fashion apparels and active sportswear ranging from designer Reinaldo Lourenco's collection to Alpargatas' Havaianas flip flops to Levi's Jeans. The company further plans to sell these products through its e-commerce platform in the country and deliver the same by third-party vendors. Notably, all these endeavors will continue to aid the company in gaining a competitive edge against domestic retail companies like Magazine Luiza, B2W and MercadoLibre, which is one of the dominant players in Latin America's e-commerce space.  Brazil Holds Promise  We believe the above-mentioned customer benefits will aid Amazon in attracting customers to Brazil's e-commerce platform. Further, these benefits will aid growth of Prime membership, which in turn will drive the top line. With its strong endeavors, Amazon is likely to rapidly penetrate into the e-commerce market of Brazil, which, per a report from Statista, is expected to record $31.7 billion revenues by 2022 at a CAGR of 10.4% between 2018 and 2022. Markedly, the company's latest move bodes well for continuous focus on expansion of Prime's global presence. Moreover, rapid expansion of Prime in international regions will continue to aid its dominance in the global e-commerce space. Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      https://www.zacks.com  Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer  . Past performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  https://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Amazon.com, Inc. (AMZN): Free Stock Analysis Report   NetEase, Inc. (NTES): Free Stock Analysis Report   Autodesk, Inc. (ADSK): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " For Immediate Release ",
    "Chicago, IL - September 11, 2019 - Zacks Equity Research  NetEase NTES  as the Bull of the Day, Autodesk ADSK  as the Bear of the Day. In addition, Zacks Equity Research provides analysis on Amazon AMZN  .",
    "Here is a synopsis of all three stocks:",
    "  Bull of the Day  : ",
    "When I look for a Bull of the Day, it's important for me to find stocks with strong earnings trends. One way to do that is to lean on the time-tested power of the Zacks Rank. Stocks that are Zacks Rank #1 (Strong Buy) and Zacks Rank #2 (Buy) are a good place to start. That way, you know the stock you are looking at has a strong earnings profile, with analysts continually revising their earnings estimates to the upside.",
    "In addition to the strong Zacks Rank on the individual stock, I like to find stocks within strong industries. The strongest industries often have tailwinds which are helping the stocks make more money. The industry this stock is in, is currently in the Top 22% of our Zacks Industry Rank.",
    "The last part of this equation has to be growth. Growth is the greatest mover of stock prices. Two major things move when growth increases. Earnings go up directly as a result of growth and, often times, the earnings multiple increases when growth increases. My stock to double here has all of these components, giving it a real shot at doubling its size, despite being as large as it already is.",
    "My pick is Zacks Rank #2 (Buy) NetEase  . NetEase is a Chinese internet technology company providing online PC and mobile games. The company develops their own games like Fantasy Westward Journey and Heroes of Tang Dynasty Zero, as well as partners with other developers to adapt games to their local markets. For example, they have teamed up with Blizzard Entertainment to operate local versions of World of Warcraft and Overwatch. They've also been working on a huge VR multiplayer online game with an open world setting they call Nostos.",
    "Earnings estimates have been moving in the right direction here for NetEase. Negative revisions plagued the stock from late 2017 until early 2019. It was then when earnings troughed and started moving back in the right direction. What should be even more encouraging for the bulls is the fact tha t earnings  growth is beginning to be baked in here. In fact, NetEase has future year-over-year projected growth of over 30% for the next five years.",
    " NetEase, Inc. Price and Consensus ",
    "Current valuations have NetEase trading at 25x forward 12-month earnings. At the surface, that sounds a bit rich considering that the broad market trades at about 17x. However, there are two mitigating factors which make this number much more palatable. While the broad market trades at 17x, the Computer Software - Services industry trades at 27.87x. The other factor I pointed out earlier, huge sales growth numbers for NTES. The company is on the cusp of a huge growth opportunity. That is bringing the PEG ratio under 1. That means that for its projected amount of growth, the stock is undervalued. The PEG ratio is 0.82. That's what gives NTES the roadmap to potentially double over the next several quarters. Coming back into growth could lead to a surge in the stock price.",
    "That growth could come from the explosion in gaming. This fiscal year, mobile gaming revenue for the company is projected to grow at 16% year-over-year. Overall, that industry has been growing exponentially. Gaming is the fastest-growing form of entertainment in the world. Revenues have been increasing globally at a clip of 9.7% per year. Last year, video game revenues totaled $139 billion. By 2022, the global video game market is estimated to be nearly $200 billion.",
    " Bear of the Day  :",
    "Sometimes, stocks get beat down for no reason at all. It can be very confusing and frustrating for investors when their favorite stock is going down for seemingly no reason. If you pay close attention to earnings estimates from analysts, often times, you can get a warning ahead of impending doom. I don't want to sound like the harbinger of bad news here, I'm just setting up the reasoning for today's Bear of the Day.",
    "It's Zacks Rank #5 (Strong Sell) Autodesk.  Autodesk, Inc. operates as a design software and services company worldwide. The company offers AutoCAD, a professional design, drafting, detailing, and visualization software; AutoCAD Civil 3D, a surveying, design, analysis, and documentation solution for civil engineering, including land development, transportation, and environmental projects; AutoCAD LT, a professional drafting and detailing software; BIM 360, a construction management cloud-based software; computer-aided manufacturing (CAM) software for computer numeric control machining, inspection, and modelling for manufacturing; Fusion 360, a 3D CAD, CAM, and computer-aided engineering tool; and Industry Collections software products for professionals in architecture, engineering and construction, product design and manufacturing, and media and entertainment industries.",
    "The reason for the unfavorable Zacks Rank is the series o f earnings  estimate revisions coming in to the downside recently. Over the last thirty days, eight analysts have cut their earnings estimates for the next quarter and next year. The bearish sentiment has dropped our Zacks Consensus Estimate from 99 cents to 94 cents for next quarter, while next year's number has come down from $4.78 to $4.53.",
    "I don't want to lead on as if Autodesk is tumbling down to zero. In fact, even with these negative estimates, next quarter's EPS growth is slated to come in at 104%, while next year's growth number is set to hit 63.7%. Revenue is still set to grow at 21.89% next quarter and 21.7% next year. Growth has slowed some, which has caused Autodesk's earnings multiple to shrink a bit. The stock is trading at a PE of 54.5x earnings, above the industry average of 41.7x and well above the broad market average of 17.8x.",
    "  Amazon Expands Prime to Brazil  ",
    " Amazon  has rolled out Prime Subscription services in Brazil, in order to strengthen presence in the Latin America.",
    "Notably, Prime members in Brazil will now enjoy unlimited nationwide free shipping and a maximum 48-hour delivery time in more than 90 municipalities. Products eligible for Prime delivery will include all types of goods ranging from clothes to electronics.",
    "In addition to these benefits, the Prime subscribers will have access to movies, music, and digital books and magazines on the Prime platform. This will likely increase Amazon's subscriber base and give the online retailer an edge over online streaming services like Netflix.",
    "Notably, the Brazilian Prime package will cost 9.90 reals ($2.42) a month, or 89.00 reals a year.",
    "The latest move of the company, which will strengthen its footprint in Brazil, is in sync with continued focus on expanding presence in the Latin American region.",
    " Amazon Expands in Brazil ",
    "The company made its foray into the Brazilian e-commerce market in 2012. Notably, its expanding product portfolio bodes well. Amazon's strong efforts to bolster market share by improving customer base in the country will further drive top-line growth.",
    "The company has presence in the country's online books and electronics retail markets. Last year, it had made foray into the clothing, accessories and footwear market of Brazil via its Brazilian marketplace.",
    "In addition, it had announced plans to enhance product offerings by bringing a wide variety of fashion apparels and active sportswear ranging from designer Reinaldo Lourenco's collection to Alpargatas' Havaianas flip flops to Levi's Jeans. The company further plans to sell these products through its e-commerce platform in the country and deliver the same by third-party vendors.",
    "Notably, all these endeavors will continue to aid the company in gaining a competitive edge against domestic retail companies like Magazine Luiza, B2W and MercadoLibre, which is one of the dominant players in Latin America's e-commerce space.",
    " Brazil Holds Promise ",
    "We believe the above-mentioned customer benefits will aid Amazon in attracting customers to Brazil's e-commerce platform. Further, these benefits will aid growth of Prime membership, which in turn will drive the top line.",
    "With its strong endeavors, Amazon is likely to rapidly penetrate into the e-commerce market of Brazil, which, per a report from Statista, is expected to record $31.7 billion revenues by 2022 at a CAGR of 10.4% between 2018 and 2022.",
    "Markedly, the company's latest move bodes well for continuous focus on expansion of Prime's global presence.",
    "Moreover, rapid expansion of Prime in international regions will continue to aid its dominance in the global e-commerce space.",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    https://www.zacks.com ",
    "Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer  .",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  https://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:37:00"
}