{
  "url": "https://www.nasdaq.com/article/waste-management-inc-wm-ex-dividend-date-scheduled-for-september-05-2019-cm1207093",
  "title": "Waste Management, Inc. (WM) Ex-Dividend Date Scheduled for September 05, 2019 - Nasdaq.com",
  "text": [
    "Waste Management, Inc. ( WM  ) will begin trading ex-dividend on September 05, 2019. A cash dividend payment of $0.512 per share is scheduled to be paid on September 20, 2019. Shareholders who purchased WM prior to the ex-dividend date are eligible for the cash dividend payment. This marks the 3rd quarter that WM has paid the same dividend. At the current stock price of $119.53, the dividend yield is 1.71%.",
    "The previous trading day's last sale of WM was $119.53, representing a -0.87% decrease from the 52 week high of $120.58 and a 43.63% increase over the 52 week low of $83.22.",
    "WM is a part of the Public Utilities sector, which includes companies such as Republic Services, Inc. ( RSG  ) and Waste Connections, Inc. ( WCN  ). WM's current earnings per share, an indicator of a company's profitability, is $4.1. Zacks Investment Research reports WM's forecasted earnings growth in 2019 as 3.02%, compared to an industry average of -3.8%.",
    "For more information on the declaration, record and payment dates, visit the WM Dividend History  page. Our  Dividend Calendar  has the full list of stocks that have an ex-dividend today.",
    " Interested in gaining exposure to WM through an Exchange Traded Fund [ETF]?   The following ETF(s) have WM as a top-10 holding:  VictoryShares US Multi-Factor Minimum Volatility ETF (   VSMV    ) Cambria Core Equity ETF (   CCOR    ) Invesco Exchange-Traded Fund Trust II (   SPMV    ) VanEck Vectors Environmental Services ETF (   EVX    ) Invesco S&P 500 Pure Growth ETF (   RPG    ).  ",
    "The top-performing ETF of this group is VSMV with an increase of 5.6% over the last 100 days. It also has the highest percent weighting of WM at 2.88%.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:00:04"
}