{
  "url": "https://www.nasdaq.com/article/ntsb-says-autopilot-engaged-in-2018-california-tesla-crash-20190903-00920",
  "title": "NTSB says Autopilot engaged in 2018 California Tesla crash - Nasdaq.com",
  "text": [
    "By David Shepardson",
    "WASHINGTON, Sept 3 (Reuters) - The National Transportation Safety Board (NTSB) said on Tuesday that a Tesla Model S was in Autopilot mode and the driver's hands were off the wheel when it struck a fire truck in Culver City, California, one of a series of crashes the board is investigating involving Tesla's driver assistance system.",
    "The 2014 Model S Autopilot system was engaged continuously for the final 13 minutes 48 seconds of the trip before the vehicle struck a fire truck parked on Interstate-405 in January 2018, the NTSB safety board said in documents posted on Tuesday.",
    "The driver kept his hands off the wheel for all but 51 seconds of the final drive segment and received numerous alerts to place his hands back on the wheel, the documents showed. Tesla Inc  did not immediately comment.",
    "The fire truck was unoccupied and the driver was not injured in the incident.",
    "\"I was having a coffee and a bagel. And all I remember, that truck, and then I just saw the boom in my face and that was it,\" the man behind the wheel told the NTSB.",
    "The report says the Tesla was following a vehicle for an extended period at a speed of around 21 miles per hour (33.8 kph) when the vehicle ahead changed lanes seconds before the crash",
    "After the vehicle in front shifted, the Tesla began accelerating toward the driver-set cruise control speed of 80 mph (129 kph) and hit the parked fire truck while going 30.9 mph. The system did not detect the driver's hands on the wheel for the final 3 minutes and 41 seconds of the crash.",
    "He did not remember precisely what he was doing at the time of the crash but could have been changing the radio or drinking coffee. Records show the driver was not using his cellphone to text or talk at the time of the crash, the NTSB said.",
    "Tesla's Autopilot was engaged during at least three fatal U.S. crashes, including fatal March 2018 crashes of a 2018 Model 3 in Delray Beach, Florida and in Mountain View, California of a Model X. Both of those crashes remain under investigation by the NTSB and National Highway Traffic Safety Administration. The agencies are also investigating other crashes and battery fires involving Tesla vehicles.",
    "The crashes raised questions about the driver-assistance system's ability to detect hazards and has sparked concern about the safety of systems that can perform driving tasks for extended stretches of time with little or no human intervention, but which cannot completely replace human drivers.",
    "While Tesla drivers say they are able to avoid holding the steering wheel for extended periods while using Autopilot, Tesla advises drivers to keep their hands on the wheel and pay attention while using the system.",
    "In May 2016, a Tesla Model S driver was killed near Williston, Florida, while Autopilot was engaged, when he slammed into a tractor trailer.",
    "The NTSB said in 2017 that Tesla lacked proper safeguards allowing the Florida driver \"to use the system outside of the environment for which it was designed and the system gave far too much leeway to the driver to divert his attention.\""
  ],
  "published_datetime": "2019-09-03 12:14:00"
}