{
  "url": "https://www.nasdaq.com/article/how-will-tariffs-affect-the-next-generation-of-video-game-consoles-cm1207661",
  "title": "How Will Tariffs Affect the Next Generation of Video Game Consoles? - Nasdaq.com",
  "text": [
    " There's no bigger story in finance right now than the ongoing   trade war between the United States and China. Kicked off by   President Donald Trump, who has taken a hard line on Chinese   trade, the conflict has at turns inspired and battered the   market, including when the Chinese government allowed its   currency, the renminbi, to devalue (   the market swooned to the tune of nearly 3%    ) and then backed off a bit (   the market bounced back    ). Chief among the tactics used in the trade war has been   tariffs. First came the United States' tariff on washing machines   and solar panels (though not just those made in China) in March   of 2018; then a second set of new tariffs (on steel and   aluminum); then retaliatory tariffs from the Chinese on 128 U.S.   goods; and then several more back-and-forth tariff announcements   and rate hikes.   Image source: Getty Images.makeArticleAd();  That's been rough on a lot of companies, but   tech giants Microsoft    (NASDAQ: MSFT) ,   Sony    (NYSE: SNE) , and   Nintendo    (OTC: NTDOY) have not seen their gaming segments targeted   directly -- until now. Despite coming together to issue a joint   statement over the summer warning of the impact of tariffs on the   video game industry, the console makers are getting hit with an   upcoming round of tariffs, which will take effect on December   15. Made in China The video game giants' joint statement came in response to a   proposed (and now official) list of goods to be made subject to   tariffs if imported from China. Among them: \"Video game consoles   and machines.\" That was bad news for the big three of console   gaming, each of which makes its video game consoles in China. The joint statement wasn't the only time the video game giants   have spoken out. Sony recently told   The Wall Street Journal    that PlayStation price hikes would likely follow the proposed   tariffs, should they be finalized. And finalized they have been. Despite Sony's protestations,   the president took to   Twitter    the very next day to announce that the proposed tariffs would go   into effect on Sept. 1. That has since been changed to December   15. Other options There's no doubt these tariffs will hit video game consoles   hard -- unless the manufacturers can get out of China. And that's   what Nintendo has started to do. At least some of the company's   new Switch models are now manufactured in Southeast Asia,   reportedly with the goal of manufacturing enough to meet U.S.   demand (Nintendo can still supply other countries with   Chinese-made devices without worrying about U.S. tariffs, of   course). Will Sony and Microsoft follow suit? The companies would   clearly prefer not to. Neither has made any move out of China yet   (Microsoft has even refuted a report that it was contemplating   such a move). Both companies seemed focused on defeating the   tariffs instead, but now that they've lost that battle, it's not   clear what comes next. Next-gen concerns Sony and Microsoft are still selling new units of consoles   that are now more than half a decade old -- Sony recently passed   the 100 million mark with sales of its PlayStation 4. But this   fight isn't just about the immediate future. It's also about   where Sony and Microsoft will build the next generation of   hardware. These upcoming versions of the PlayStation and Xbox are likely   to debut in late 2020, and their manufacturers don't want tariffs   on consoles to become the new normal. That's especially true   given that   Alphabet    (NASDAQ: GOOG) (NASDAQ: GOOGL) is moving into the market with a   light-on-hardware cloud gaming approach    . No manufacturing location for the as-yet-unreleased Stadia has   been announced, but Google has already made moves to shift   manufacturing out of China. Even if Stadia is made in China, the   device is cheaper (and the tariffs, calculated as a percentage,   will be proportionately smaller). What it all means In the short term, new tariffs could mean pricier consoles --   and such a price hike might well be passed on to consumers, just   as Sony predicted. On the other hand, Sony and Microsoft may be   reluctant to raise prices on their existing offerings, given   their age -- but if that's the case, price hikes to the next   generation of systems could well pick up the slack. The good news   for Sony and Microsoft is that the delayed effective date of the   tariffs gives them more time to lobby against the planned   tariffs, and in the meantime, consider Nintendo's strategy of   moving at least some of their manufacturing elsewhere in   Asia.   10 stocks we like better than Microsoft       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now… and Microsoft wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       Suzanne Frey, an executive at Alphabet, is a member of The     Motley Fool's board of directors. Teresa Kersten, an employee     of LinkedIn, a Microsoft subsidiary, is a member of The Motley     Fool's board of directors.     Stephen Lovely      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Alphabet (A shares), Alphabet (C     shares), Microsoft, and Twitter. The Motley Fool has the     following options: long January 2021 $85 calls on Microsoft.     The Motley Fool recommends Nintendo. The Motley Fool has a     disclosure policy      .  ",
    "There's no bigger story in finance right now than the ongoing   trade war between the United States and China. Kicked off by   President Donald Trump, who has taken a hard line on Chinese   trade, the conflict has at turns inspired and battered the   market, including when the Chinese government allowed its   currency, the renminbi, to devalue (   the market swooned to the tune of nearly 3%    ) and then backed off a bit (   the market bounced back    ).",
    "Chief among the tactics used in the trade war has been   tariffs. First came the United States' tariff on washing machines   and solar panels (though not just those made in China) in March   of 2018; then a second set of new tariffs (on steel and   aluminum); then retaliatory tariffs from the Chinese on 128 U.S.   goods; and then several more back-and-forth tariff announcements   and rate hikes.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "That's been rough on a lot of companies, but   tech giants Microsoft    (NASDAQ: MSFT) ,   Sony    (NYSE: SNE) , and   Nintendo    (OTC: NTDOY) have not seen their gaming segments targeted   directly -- until now. Despite coming together to issue a joint   statement over the summer warning of the impact of tariffs on the   video game industry, the console makers are getting hit with an   upcoming round of tariffs, which will take effect on December   15.",
    "The video game giants' joint statement came in response to a   proposed (and now official) list of goods to be made subject to   tariffs if imported from China. Among them: \"Video game consoles   and machines.\" That was bad news for the big three of console   gaming, each of which makes its video game consoles in China.",
    "The joint statement wasn't the only time the video game giants   have spoken out. Sony recently told   The Wall Street Journal    that PlayStation price hikes would likely follow the proposed   tariffs, should they be finalized.",
    "And finalized they have been. Despite Sony's protestations,   the president took to   Twitter    the very next day to announce that the proposed tariffs would go   into effect on Sept. 1. That has since been changed to December   15.",
    "There's no doubt these tariffs will hit video game consoles   hard -- unless the manufacturers can get out of China. And that's   what Nintendo has started to do. At least some of the company's   new Switch models are now manufactured in Southeast Asia,   reportedly with the goal of manufacturing enough to meet U.S.   demand (Nintendo can still supply other countries with   Chinese-made devices without worrying about U.S. tariffs, of   course).",
    "Will Sony and Microsoft follow suit? The companies would   clearly prefer not to. Neither has made any move out of China yet   (Microsoft has even refuted a report that it was contemplating   such a move). Both companies seemed focused on defeating the   tariffs instead, but now that they've lost that battle, it's not   clear what comes next.",
    "Sony and Microsoft are still selling new units of consoles   that are now more than half a decade old -- Sony recently passed   the 100 million mark with sales of its PlayStation 4. But this   fight isn't just about the immediate future. It's also about   where Sony and Microsoft will build the next generation of   hardware.",
    "These upcoming versions of the PlayStation and Xbox are likely   to debut in late 2020, and their manufacturers don't want tariffs   on consoles to become the new normal. That's especially true   given that   Alphabet    (NASDAQ: GOOG) (NASDAQ: GOOGL) is moving into the market with a   light-on-hardware cloud gaming approach    . No manufacturing location for the as-yet-unreleased Stadia has   been announced, but Google has already made moves to shift   manufacturing out of China. Even if Stadia is made in China, the   device is cheaper (and the tariffs, calculated as a percentage,   will be proportionately smaller).",
    "In the short term, new tariffs could mean pricier consoles --   and such a price hike might well be passed on to consumers, just   as Sony predicted. On the other hand, Sony and Microsoft may be   reluctant to raise prices on their existing offerings, given   their age -- but if that's the case, price hikes to the next   generation of systems could well pick up the slack. The good news   for Sony and Microsoft is that the delayed effective date of the   tariffs gives them more time to lobby against the planned   tariffs, and in the meantime, consider Nintendo's strategy of   moving at least some of their manufacturing elsewhere in   Asia.",
    "  10 stocks we like better than Microsoft       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now… and Microsoft wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Microsoft       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now… and Microsoft wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " Suzanne Frey, an executive at Alphabet, is a member of The     Motley Fool's board of directors. Teresa Kersten, an employee     of LinkedIn, a Microsoft subsidiary, is a member of The Motley     Fool's board of directors.     Stephen Lovely      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Alphabet (A shares), Alphabet (C     shares), Microsoft, and Twitter. The Motley Fool has the     following options: long January 2021 $85 calls on Microsoft.     The Motley Fool recommends Nintendo. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:50:00"
}