{
  "url": "https://www.nasdaq.com/article/5-great-stocks-under-10-for-investors-to-buy-in-september-cm1207587",
  "title": "5 Great Stocks Under $10 for Investors to Buy in September - Nasdaq.com",
  "text": [
    " At Zacks, we try to avoid labeling stocks as \"cheap\" or \"expensive.\" Instead, we opt to look beyond a stock's face value, and our system puts an emphasis on earnings estimate revisions to find stocks that will hopefully be winners for investors. With that said, low-priced stocks can still be attractive to investors as they present the chance to take a larger position in a company. When searching for these low-priced stocks, we still look for similar trends in growth, value, and momentum. Then we apply the Zacks Rank to properly analyze the potential that these companies have. Clearly, we are in the midst of some overarching macroeconomic uncertainty and the ongoing U.S.-China trade war hasn't helped calm nerves. Nonetheless, with interest rates so low, investors still need to find returns somewhere. And there is nothing stopping some of these lower-priced stocks from performing well. Therefore, we've highlighted five stocks that are currently trading for under $10 per share. All of these stocks also sport a Zacks Rank #2 (Buy) or better…  1. Kinross Gold Corporation   KGC   Prior Close: $5.19 USD Kinross Gold is a Canadian-based gold mining firm that operates across the U.S., Brazil, and other locations. As we just touched on, the global economic picture remains uncertain, which has caused investors to put more money into safe-haven assets. The  price of gold  has soared from $1,200 last September to its current price of over $1,550. Plus, Mining - Gold ranks in the top 4% of our 256 Zacks Industries-a rising tide situation. A year ago, KGC shares were trading at $2.83, now they hover well above $5 a share. The firm has also seen its earnings estimate revision activity climb completely upward recently to help it earn its current Zacks Rank #1 (Strong Buy) status. Meanwhile, both KGC's top and bottom lines are projected to surge the next two quarters, with solid full-year fiscal 2019 and 2020 growth projected as well. Kinross Gold also boasts an overall \"A\" VGM score.  2. Vipshop Holdings Limited   VIPS   Prior Close: $8.12 USD Vipshop is a Chinese online discount retailer that sells popular branded products throughout China from cosmetics to Levis. Shares of the Guangzhou, China-based firm have climbed 50% from $5.45 in January to its current price point of over $8.00 per share. Despite the climb, VIPS is trading with a 0.42 forward price/sales ratio, which marks a discount against its industry's 0.71 average. Vipshop is also trading well below the Internet - Delivery Services average in terms of forward P/E. Both of these figures help VIPS earn an \"A\" grade for Value in our Style Scores system. Vipshop is currently a Zacks Rank #2 (Buy) that also sports an \"A\" grade for Growth. The Chinese e-commerce retailer's full-year fiscal 2019 earnings are projected to soar 40% to reach $0.81 per share on the back of 2% revenue expansion. Looking further ahead, the discount e-commerce retailer's adjusted 2020 earnings are projected to climb 25% above our current year estimate on 6.5% higher sales.  3. Eldorado Gold Corporation   EGO   Prior Close: $9.26 USD We are going to keep the gold train rolling here today for all the same reasons that we touched on with Kinross Gold. Eldorado is a gold and base metals producer that has mining, development, and exploration operations in Brazil, Turkey, Canada, and elsewhere. EGO stock was trading at $3.17 a share in early January and just broke through the $10 range as of this writing (midday September 4). But we will keep Eldorado in here because it closed below the under $10 threshold Tuesday and its outlook appears impressive. Our current Zacks Consensus Estimates call for the firms Q3 and Q4 2019 revenue to soar 144% and 130%, respectively. Eldorado Gold's full-year fiscal 2019 revenue is projected to climb 42% to $653.2 million, with 2020's revenues expected to come in 32% higher than that to hit $862.3 million. At the bottom end of the income statement, EGO's 2019 EPS is projected to soar from a loss of nearly $0.20 a year ago to +$0.19. Better still, 2020's adjusted earnings then are expected to skyrocket 362% to $0.87 a share. EGO is a Zacks Rank #2 (Buy) at the moment that sports an \"A\" grade for Momentum in our Style Scores system. (Disclosure: I am recently long EGO).  4. Digital Turbine, Inc.   APPS   Prior Close: $7.40 USD Digital Turbine aims to connect OEMs, mobile operators, and publishers with advertisers and app developers. APPS stock has gone from $1.37 per share last September to its current price point, which rests right below its 52-week highs. The Austin, Texas-based firm posted stronger-than-projected Q1 2020 earnings and revenue results in early August. Investors should also note that Digital Turbine recently partnered with a lifestyle-focused brand for gamers called Razer that will see the firm \"power curated app recommendations to users of Razer Cortex Mobile-which is a one-stop Android GOOGL  games client-enabled smartphones.\" Digital Turbine has seen its longer-term earnings estimate revision activity trend more heavily in the right direction recently, which helps APPS earn its current Zacks Rank #1 (Strong Buy). Digital Turbine also sports an \"A\" grade for Growth. The firm is projected to see its adjusted current-quarter earnings soar 300% on 33.3% higher revenues. Meanwhile, its full-year EPS figure is expected to climb 150% on 26.4% stronger sales. On top of that, APPS has crushed our earnings estimates over the trailing four periods by an average of 125%.  5. NeoPhotonics Corporation   NPTN   Prior Close: $6.22 USD NeoPhotonics designs and makes optoelectronic solutions utilized in high-speed communications networks across telecom and datacenters. The San Jose, California-based firm's Q2 revenue only climbed 1% from the year-ago period as the broader and historically cyclical chip market tries to fight off a rough 2019. But a comeback could be on the horizon that goes beyond the uptick in overall semiconductor stock prices. \"Market drivers are well aligned with our advanced technologies and high-speed capabilities,\" CEO Tim Jenks said in prepared remarks in early August. \"These trends transcend the current Huawei ban and, coupled with the continued demand with hyperscale data centers, we are optimistic about NeoPhotonics' new product prospects.\" NPTN is a Zacks Rank #2 (Buy) right now that also sports an \"A grade for Growth and a \"B\" for Momentum. NeoPhotonics is projected to see its Q3 2019 EPS figure soar from a loss of $0.05 per share in the year-ago period to +$0.02 on 10% higher revenue. Meanwhile, NPTN is projected to post a much smaller than projected loss this year on over 7% better sales. NeoPhotonics fiscal 2020 earnings are then expected to soar from a -$0.15 to +$0.18, while revenue is projected to pop 8.4% above our current-year estimate. And NeoPhotonics is part of the Semiconductor - Communications industry, which currently rests in the top 7% of our Zacks Industries.  Biggest Tech Breakthrough in a Generation  makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Alphabet Inc. (GOOGL): Free Stock Analysis Report   Digital Turbine, Inc. (APPS): Free Stock Analysis Report   Vipshop Holdings Limited (VIPS): Free Stock Analysis Report   NeoPhotonics Corporation (NPTN): Free Stock Analysis Report   Kinross Gold Corporation (KGC): Free Stock Analysis Report   Eldorado Gold Corporation (EGO): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "At Zacks, we try to avoid labeling stocks as \"cheap\" or \"expensive.\" Instead, we opt to look beyond a stock's face value, and our system puts an emphasis on earnings estimate revisions to find stocks that will hopefully be winners for investors.",
    "With that said, low-priced stocks can still be attractive to investors as they present the chance to take a larger position in a company. When searching for these low-priced stocks, we still look for similar trends in growth, value, and momentum. Then we apply the Zacks Rank to properly analyze the potential that these companies have.",
    "Clearly, we are in the midst of some overarching macroeconomic uncertainty and the ongoing U.S.-China trade war hasn't helped calm nerves. Nonetheless, with interest rates so low, investors still need to find returns somewhere. And there is nothing stopping some of these lower-priced stocks from performing well.",
    "Therefore, we've highlighted five stocks that are currently trading for under $10 per share. All of these stocks also sport a Zacks Rank #2 (Buy) or better…",
    " 1. Kinross Gold Corporation   KGC  ",
    "Prior Close: $5.19 USD",
    "Kinross Gold is a Canadian-based gold mining firm that operates across the U.S., Brazil, and other locations. As we just touched on, the global economic picture remains uncertain, which has caused investors to put more money into safe-haven assets. The  price of gold  has soared from $1,200 last September to its current price of over $1,550. Plus, Mining - Gold ranks in the top 4% of our 256 Zacks Industries-a rising tide situation.",
    "A year ago, KGC shares were trading at $2.83, now they hover well above $5 a share. The firm has also seen its earnings estimate revision activity climb completely upward recently to help it earn its current Zacks Rank #1 (Strong Buy) status. Meanwhile, both KGC's top and bottom lines are projected to surge the next two quarters, with solid full-year fiscal 2019 and 2020 growth projected as well. Kinross Gold also boasts an overall \"A\" VGM score.",
    " 2. Vipshop Holdings Limited   VIPS  ",
    "Prior Close: $8.12 USD",
    "Vipshop is a Chinese online discount retailer that sells popular branded products throughout China from cosmetics to Levis. Shares of the Guangzhou, China-based firm have climbed 50% from $5.45 in January to its current price point of over $8.00 per share. Despite the climb, VIPS is trading with a 0.42 forward price/sales ratio, which marks a discount against its industry's 0.71 average. Vipshop is also trading well below the Internet - Delivery Services average in terms of forward P/E. Both of these figures help VIPS earn an \"A\" grade for Value in our Style Scores system.",
    "Vipshop is currently a Zacks Rank #2 (Buy) that also sports an \"A\" grade for Growth. The Chinese e-commerce retailer's full-year fiscal 2019 earnings are projected to soar 40% to reach $0.81 per share on the back of 2% revenue expansion. Looking further ahead, the discount e-commerce retailer's adjusted 2020 earnings are projected to climb 25% above our current year estimate on 6.5% higher sales.",
    " 3. Eldorado Gold Corporation   EGO  ",
    "Prior Close: $9.26 USD",
    "We are going to keep the gold train rolling here today for all the same reasons that we touched on with Kinross Gold. Eldorado is a gold and base metals producer that has mining, development, and exploration operations in Brazil, Turkey, Canada, and elsewhere. EGO stock was trading at $3.17 a share in early January and just broke through the $10 range as of this writing (midday September 4). But we will keep Eldorado in here because it closed below the under $10 threshold Tuesday and its outlook appears impressive.",
    "Our current Zacks Consensus Estimates call for the firms Q3 and Q4 2019 revenue to soar 144% and 130%, respectively. Eldorado Gold's full-year fiscal 2019 revenue is projected to climb 42% to $653.2 million, with 2020's revenues expected to come in 32% higher than that to hit $862.3 million. At the bottom end of the income statement, EGO's 2019 EPS is projected to soar from a loss of nearly $0.20 a year ago to +$0.19. Better still, 2020's adjusted earnings then are expected to skyrocket 362% to $0.87 a share. EGO is a Zacks Rank #2 (Buy) at the moment that sports an \"A\" grade for Momentum in our Style Scores system. (Disclosure: I am recently long EGO).",
    " 4. Digital Turbine, Inc.   APPS  ",
    "Prior Close: $7.40 USD",
    "Digital Turbine aims to connect OEMs, mobile operators, and publishers with advertisers and app developers. APPS stock has gone from $1.37 per share last September to its current price point, which rests right below its 52-week highs. The Austin, Texas-based firm posted stronger-than-projected Q1 2020 earnings and revenue results in early August. Investors should also note that Digital Turbine recently partnered with a lifestyle-focused brand for gamers called Razer that will see the firm \"power curated app recommendations to users of Razer Cortex Mobile-which is a one-stop Android GOOGL  games client-enabled smartphones.\"",
    "Digital Turbine has seen its longer-term earnings estimate revision activity trend more heavily in the right direction recently, which helps APPS earn its current Zacks Rank #1 (Strong Buy). Digital Turbine also sports an \"A\" grade for Growth. The firm is projected to see its adjusted current-quarter earnings soar 300% on 33.3% higher revenues. Meanwhile, its full-year EPS figure is expected to climb 150% on 26.4% stronger sales. On top of that, APPS has crushed our earnings estimates over the trailing four periods by an average of 125%.",
    " 5. NeoPhotonics Corporation   NPTN  ",
    "Prior Close: $6.22 USD",
    "NeoPhotonics designs and makes optoelectronic solutions utilized in high-speed communications networks across telecom and datacenters. The San Jose, California-based firm's Q2 revenue only climbed 1% from the year-ago period as the broader and historically cyclical chip market tries to fight off a rough 2019. But a comeback could be on the horizon that goes beyond the uptick in overall semiconductor stock prices. \"Market drivers are well aligned with our advanced technologies and high-speed capabilities,\" CEO Tim Jenks said in prepared remarks in early August. \"These trends transcend the current Huawei ban and, coupled with the continued demand with hyperscale data centers, we are optimistic about NeoPhotonics' new product prospects.\"",
    "NPTN is a Zacks Rank #2 (Buy) right now that also sports an \"A grade for Growth and a \"B\" for Momentum. NeoPhotonics is projected to see its Q3 2019 EPS figure soar from a loss of $0.05 per share in the year-ago period to +$0.02 on 10% higher revenue. Meanwhile, NPTN is projected to post a much smaller than projected loss this year on over 7% better sales. NeoPhotonics fiscal 2020 earnings are then expected to soar from a -$0.15 to +$0.18, while revenue is projected to pop 8.4% above our current-year estimate. And NeoPhotonics is part of the Semiconductor - Communications industry, which currently rests in the top 7% of our Zacks Industries.",
    " Biggest Tech Breakthrough in a Generation  makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:00:00"
}