{
  "url": "https://www.nasdaq.com/article/netflix-applies-for-licence-under-new-turkish-broadcasting-rules-20190903-00329",
  "title": "Netflix applies for licence under new Turkish broadcasting rules - Nasdaq.com",
  "text": [
    "By Ali Kucukgocmen and Kenneth Li",
    "ISTANBUL/NEW YORK, Sept 3 (Reuters) - U.S. online streaming service Netflix  has applied for a license to continue operating in Turkey under new online broadcasting rules that have raised fears over possible censorship in the future.",
    "Turkey last month granted its radio and television watchdog sweeping oversight over all online content, including streaming platforms and news outlets, a move that raised concerns that the state was tightening its control over the media. ",
    "As part of obtaining the license, the Los Gatos, California-based subscription streaming service will set up a local entity and pay 0.5% of revenue generated in Turkey to the government. The company said it is in discussions to pay similar levies in Spain and Italy.",
    "Netflix serves 1.5 million subscribers in Turkey and only reaches about 10% of the country's broadband households, the company said, making the Turkish market a potentially important and lucrative source of new subscribers as competition mounts.",
    "The company operates one of the world's largest streaming services and has sustained its position at the top by courting new subscribers outside the United States as its U.S. home market matures.",
    "To date, Turkey has not attempted to censor Netflix content, a source familiar with the matter said.",
    "Turkey's new regulation stipulates that content providers should get a fresh license to continue operating in Turkey, and comply with RTUK guidelines.",
    "If they don't respect the guidelines, they will be given 30 days to change their content, or face having their licenses suspended for three months and later canceled. The announcement last month did not specify what standards RTUK would expect.",
    "Critics have said the move will allow the government to tighten its grip on Turkish media, which is largely owned or controlled by supporters of President Tayyip Erdogan and his ruling AK Party. ",
    "GROWTH MARKET",
    "Netflix and the Saudi Arabian government were widely condemned when the company pulled an episode of the comedy show, \"Patriot Act with Hasan Minhaj\" from its Saudi Arabia service in January, after officials complained. The show was critical of Saudi Arabia after the killing of journalist Jamal Khashoggi. ",
    "Unlike other popular internet-based content providers and services, including Alphabet Inc'sYouTube and Twitter Inc , which were banned at one time in Turkey, Netflix is generally not a platform for news or current affairs.",
    "Netflix is hoping a proactive approach to working with local regulators, such as by bolstering parental controls, would help it address potential censorship issues down the line, the source said.",
    "\"Our goal is to protect children from content that may be inappropriate for their age, while ensuring our members can continue to watch the shows and films of their choice,\" a Netflix spokesman said on Monday.",
    "Netflix declined to comment about potential censorship concerns beyond its statement.",
    "In the quarter ended June 30, it lost subscribers in the United States for the first time in eight years and fell short of targets for new subscriber growth overseas. Netflix executives said it would still meet its annual target.",
    "In Turkey, it has invested in local programming and some of its TV series have attracted international audiences, including \"The Protector,\" about an Istanbul shopkeeper who battles immortal enemies.",
    "Netflix has ordered two seasons of \"The Gift\" - another Turkish supernatural drama - and has commissioned the Turkish series, \"Love 101.\"",
    "Shares of Netflix were down 1% to $290.86 on Nasdaq. "
  ],
  "published_datetime": "2019-09-03 07:32:00"
}