{
  "url": "https://www.nasdaq.com/article/us-middle-east-envoy-greenblatt-to-resign-after-plan-released-20190905-00839",
  "title": "U.S. Middle East envoy Greenblatt to resign after plan released - Nasdaq.com",
  "text": [
    "By Steve Holland",
    "WASHINGTON, Sept 5 (Reuters) - Jason Greenblatt, President Donald Trump's special envoy for the Middle East, plans to resign once the long-delayed U.S. peace plan for Israel and the Palestinians that he has been working on is released, officials said on Thursday.",
    "Greenblatt, who had intended to stay only two years when he began working at the White House in early 2017, is eager to return to his wife and six children who stayed behind at their home in New Jersey, the officials said.",
    "Described by Trump as the \"deal of the century,\" the Republican president's plan to solve one of the world's most intractable disputes has drawn deep skepticism from Palestinians.",
    "Trump called Greenblatt \"a loyal and great friend and fantastic lawyer\" and said he would be leaving to pursue work in the private sector. \"His dedication to Israel and to seeking peace between Israel and the Palestinians won't be forgotten,\" Trump said in a Twitter post.",
    "So far, the White House has outlined a $50 billion redevelopment plan for the Palestinians and neighboring countries but have yet to release their proposals for resolving  difficult political issues like the status of Jerusalem.",
    "U.S. officials said the political plan is now complete and will be made public when appropriate. Trump has said he will release it some time after Israel holds an election on Sept. 17 that will decide the fate of Prime Minister Benjamin Netanyahu, a close Trump ally.",
    "Whether Trump releases the plan immediately after the election or he waits until a governing coalition is formed, a process that could take weeks, remains unclear.",
    "The Palestinian Authority has boycotted the U.S. peace effort since late 2017 when Trump decided to move the U.S. Embassy from Tel Aviv to Jerusalem and recognized Jerusalem as the capital of Israel, reversing decades of U.S. policy.",
    "The political details of the plan have remained under wraps, with Kushner refusing to say even whether it would offer Palestinians a state of their own.",
    "Greenblatt will hand over much of his Middle East responsibilities to Kushner aide Avi Berkowitz. Brian Hook, the leader of the State Department'sIran team, will take on an increased role, a senior administration official said.",
    "Greenblatt, a former lawyer for Trump, said he was grateful to have been part of the team to draft \"a vision for peace.\"",
    "\"This vision has the potential to vastly improve the lives of millions of Israelis, Palestinians and others in the region,\" he said in a statement.",
    "Greenblatt has been a player in all of Trump's moves aimed at bolstering support for Israel, such as the U.S. recognition of both Jerusalem as the capital of Israel and Israeli sovereignty over the Golan Heights.",
    "The developing peace plan, which Greenblatt and others have kept secret, is viewed skeptically among many in the Arab world because of expectations it will be a pro-Israel vision. The U.S. team says the plan will require concessions from the Israelis.",
    "Kushner, in a statement, said Greenblatt \"has done a tremendous job leading the efforts to develop an economic and political vision for a long sought after peace in the Middle East.\"",
    "\"His work has helped develop the relationships between Israel and its neighbors as he is trusted and respected by all of the leaders throughout the region. He is a close friend and partner and will continue to make a positive impact on the world,\" he said."
  ],
  "published_datetime": "2019-09-05 11:29:00"
}