{
  "url": "https://www.nasdaq.com/article/health-care-sector-update-for-09052019-gbtlvgomnk-cm1208190",
  "title": "Health Care Sector Update for 09/05/2019: GBT,LVGO,MNK - Nasdaq.com",
  "text": [
    "Top Health Care Stocks",
    "JNJ -0.14%",
    "PFE +1.55%",
    "ABT +1.23%",
    "MRK +0.06%",
    "AMGN +0.54%",
    "Health care stocks were posting modest gains, with the NYSE Health Care Index rising nearly 0.5% in recent trade while the shares of health care companies in the S&P 500 also were up more than 0.8% as a group. The Nasdaq Biotechnology index was climbing over 0.8%.",
    "Among health care stocks moving on news:",
    "(+) Global Blood Therapeutics ( GBT  ) rose almost 15% on Thursday after saying the US Food and Drug Administration has accepted the new drug application seeking accelerated approval for the company's voxelotor prospective sickle cell disease drug treatment. If approved, the once-daily, oral drug candidate would be the first medication available to patients targeting hemoglobin polymerization, the root cause of damaged red blood cell in sickle cell patients.",
    "In other sector news:",
    "(+) Livongo Health ( LVGO  ) fell 15% after reporting a non-GAAP Q2 net loss of $0.46 per share, expanding on a $0.31 per share adjusted loss during the same quarter last year ago and also missing the Capital IQ consensus net loss of $0.41 per share.",
    "(-) Mallinckrodt ( MNK  ) dropped 39% following a Bloomberg report the drugmaker has hired the Latham & Watkins law firm and consultants AlixPartners to advise on the potential costs of opioid lawsuits as the company explores a restructuring. It may also consider bankruptcy if the liabilities aren't manageable, the report said.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\nCopyright (C) 2016 MTNewswires.com. All rights reserved. Unauthorized reproduction is strictly prohibited.\n"
  ],
  "published_datetime": "2019-09-05 01:33:48"
}