{
  "url": "https://www.nasdaq.com/article/these-3-unloved-tech-stocks-are-finally-recovering-cm1210501",
  "title": "These 3 Unloved Tech Stocks Are Finally Recovering - Nasdaq.com",
  "text": [
    " Several   tech stocks have slumped    over the past year amid concerns about the U.S.-China trade war,   tariffs, and other macro headwinds. Sentiment about the markets   recently improved in anticipation of the upcoming trade talks   next month, but many unloved tech stocks remain well below their   historic highs. Let's take a look at three stocks that fit that description --   Infinera    (NASDAQ: INFN) ,   JD.com    (NASDAQ: JD) , and   Seagate    (NASDAQ: STX) -- and why they could rebound significantly over   the next few quarters.   Image source: Getty Images.makeArticleAd();  1. Infinera: an unloved optical systems maker Infinera sells wave division multiplexing (WDM) systems, which   enable service providers to boost the capacity of their networks   without laying down additional fiber. That's why it was once   considered an ideal play on the \"super cycle\" in-network   upgrades, which support the growth of cloud and streaming   services. However, Infinera generated most of its revenue from long-haul   WDM systems instead of shorter-range WDM systems for the metro   and data center interconnect (DCI) markets. Many service   providers prioritized those shorter-distance upgrades, causing   Infinera's double-digit sales growth in the first half of 2018 to   fade to the single digits. Infinera subsequently acquired Coriant, an industry peer that   focuses on shorter-range systems, to boost its revenue growth.   Unfortunately, Infinera's initial expectations for Coriant were   too lofty, and it   slashed those forecasts    last November. The bulls gave up, and Infinera's stock plunged   from $12 last May to about $3 this July. Yet Infinera gradually rebounded to about $5 after its revenue   rose 47% annually in the second quarter, representing an   acceleration    from its 46% growth in the first quarter. Its forecast for   60%-70% growth in the third quarter with a sequential expansion   to its gross margin also indicated that it had   turned a corner    . Infinera still isn't profitable, but it expects its synergies   with Coriant to boost its free cash flow and non-GAAP   profits to positive levels by the fourth quarter. Based on those   forecasts, this stock looks dirt cheap at 0.7 times this year's   sales. 2. JD.com: a retail giant in China JD is China's biggest direct retailer and second-largest   e-commerce player after   Alibaba    . The stock topped $50 last January, but its slowing growth,   rising expenses, and a rape allegation against CEO Richard Liu   caused it to revisit its   IPO price    of $19 by November. The trade war exacerbated that sell-off. However, the rape allegation was dropped in December, and   JD's subsequen   t earnings    reports indicated that its business   was stabilizing    . Its revenue rose 23% annually in the second quarter,   marking its strongest growth in three quarters, and it expects   20%-24% growth in the third quarter. On the bottom line, JD's adjusted net income rose more than   seven-fold annually as its gross margin expanded and it generated   more higher-margin revenue from its logistics services for   third-party sellers. Over the long term, JD plans to reduce its   operating expenses   by automating    most of its logistics platform with warehouse robots, delivery   drones, and autonomous delivery vehicles.   Image source: JD.com.  JD's total number of annual active customers grew 2.4% to   321.3 million during the quarter. That marked a deceleration from   previous quarters, but JD's accelerating revenue growth also   indicated that its existing customers were spending more money.   Wall Street expects JD's revenue and earnings to rise 17%   and 34%, respectively, next year -- which are robust growth rates   for a stock that trades at 26 times forward earnings. 3. Seagate: a cyclical tech stock with a 5% yield Seagate is the world's second-largest maker of platter-based   hard disk drives (HDD) after   Western Digital    (NASDAQ: WDC) . The HDD market faces tough competition from flash   memory-based solid state drives (SSD), which are smaller, faster,   more power-efficient, and less prone to damage than platter-based   drives. Unlike Western Digital, which prepared for that disruption by   acquiring flash memory (NAND) chipmaker SanDisk, Seagate still   generates most of its revenue from HDDs. Seagate believes that   the lower prices of HDDs, along with the constant demand for   high-capacity drives from data center customers, will buoy its   long-term growth. Yet Seagate struggled with three headwinds in recent quarters:   sluggish sales of PCs (exacerbated by   Intel    's chip shortage), soft demand from enterprise customers, and   cyclically lower prices of NAND chips reducing prices of SSDs.   That's why its revenue and gross margins declined annually over   the past three quarters. Seagate's revenue fell 17% annually last quarter as its   non-GAAP gross margin contracted from 32% to 27%. But for the   first quarter, it expects its revenue to fall just 15% annually   (at the midpoint) and for its non-GAAP gross margin to   stay flat sequentially. That forecast indicates that its   cyclical declines are bottoming out. Seagate won't rally toward its historic highs in the high $60s   anytime soon, but the stock trades at just 11 times forward   earnings and pays a   forward yield    of 4.6%. That low valuation and high yield should set a firm   floor under the stock.   10 stocks we like better than Seagate     Technology       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Seagate Technology wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Leo Sun      owns shares of Infinera and JD.com. The Motley Fool owns shares     of and recommends JD.com. The Motley Fool owns shares of Intel     and has the following options: short September 2019 $50 calls     on Intel. The Motley Fool recommends Infinera. The Motley Fool     has a     disclosure policy      .  ",
    "Several   tech stocks have slumped    over the past year amid concerns about the U.S.-China trade war,   tariffs, and other macro headwinds. Sentiment about the markets   recently improved in anticipation of the upcoming trade talks   next month, but many unloved tech stocks remain well below their   historic highs.",
    "Let's take a look at three stocks that fit that description --   Infinera    (NASDAQ: INFN) ,   JD.com    (NASDAQ: JD) , and   Seagate    (NASDAQ: STX) -- and why they could rebound significantly over   the next few quarters.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Infinera sells wave division multiplexing (WDM) systems, which   enable service providers to boost the capacity of their networks   without laying down additional fiber. That's why it was once   considered an ideal play on the \"super cycle\" in-network   upgrades, which support the growth of cloud and streaming   services.",
    "However, Infinera generated most of its revenue from long-haul   WDM systems instead of shorter-range WDM systems for the metro   and data center interconnect (DCI) markets. Many service   providers prioritized those shorter-distance upgrades, causing   Infinera's double-digit sales growth in the first half of 2018 to   fade to the single digits.",
    "Infinera subsequently acquired Coriant, an industry peer that   focuses on shorter-range systems, to boost its revenue growth.   Unfortunately, Infinera's initial expectations for Coriant were   too lofty, and it   slashed those forecasts    last November. The bulls gave up, and Infinera's stock plunged   from $12 last May to about $3 this July.",
    "Yet Infinera gradually rebounded to about $5 after its revenue   rose 47% annually in the second quarter, representing an   acceleration    from its 46% growth in the first quarter. Its forecast for   60%-70% growth in the third quarter with a sequential expansion   to its gross margin also indicated that it had   turned a corner    .",
    "Infinera still isn't profitable, but it expects its synergies   with Coriant to boost its free cash flow and non-GAAP   profits to positive levels by the fourth quarter. Based on those   forecasts, this stock looks dirt cheap at 0.7 times this year's   sales.",
    "JD is China's biggest direct retailer and second-largest   e-commerce player after   Alibaba    . The stock topped $50 last January, but its slowing growth,   rising expenses, and a rape allegation against CEO Richard Liu   caused it to revisit its   IPO price    of $19 by November. The trade war exacerbated that sell-off.",
    "However, the rape allegation was dropped in December, and   JD's subsequen   t earnings    reports indicated that its business   was stabilizing    . Its revenue rose 23% annually in the second quarter,   marking its strongest growth in three quarters, and it expects   20%-24% growth in the third quarter.",
    "On the bottom line, JD's adjusted net income rose more than   seven-fold annually as its gross margin expanded and it generated   more higher-margin revenue from its logistics services for   third-party sellers. Over the long term, JD plans to reduce its   operating expenses   by automating    most of its logistics platform with warehouse robots, delivery   drones, and autonomous delivery vehicles.",
    "  Image source: JD.com. ",
    "Image source: JD.com.",
    "JD's total number of annual active customers grew 2.4% to   321.3 million during the quarter. That marked a deceleration from   previous quarters, but JD's accelerating revenue growth also   indicated that its existing customers were spending more money.   Wall Street expects JD's revenue and earnings to rise 17%   and 34%, respectively, next year -- which are robust growth rates   for a stock that trades at 26 times forward earnings.",
    "Seagate is the world's second-largest maker of platter-based   hard disk drives (HDD) after   Western Digital    (NASDAQ: WDC) . The HDD market faces tough competition from flash   memory-based solid state drives (SSD), which are smaller, faster,   more power-efficient, and less prone to damage than platter-based   drives.",
    "Unlike Western Digital, which prepared for that disruption by   acquiring flash memory (NAND) chipmaker SanDisk, Seagate still   generates most of its revenue from HDDs. Seagate believes that   the lower prices of HDDs, along with the constant demand for   high-capacity drives from data center customers, will buoy its   long-term growth.",
    "Yet Seagate struggled with three headwinds in recent quarters:   sluggish sales of PCs (exacerbated by   Intel    's chip shortage), soft demand from enterprise customers, and   cyclically lower prices of NAND chips reducing prices of SSDs.   That's why its revenue and gross margins declined annually over   the past three quarters.",
    "Seagate's revenue fell 17% annually last quarter as its   non-GAAP gross margin contracted from 32% to 27%. But for the   first quarter, it expects its revenue to fall just 15% annually   (at the midpoint) and for its non-GAAP gross margin to   stay flat sequentially. That forecast indicates that its   cyclical declines are bottoming out.",
    "Seagate won't rally toward its historic highs in the high $60s   anytime soon, but the stock trades at just 11 times forward   earnings and pays a   forward yield    of 4.6%. That low valuation and high yield should set a firm   floor under the stock.",
    "  10 stocks we like better than Seagate     Technology       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Seagate Technology wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Seagate     Technology       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Seagate Technology wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Leo Sun      owns shares of Infinera and JD.com. The Motley Fool owns shares     of and recommends JD.com. The Motley Fool owns shares of Intel     and has the following options: short September 2019 $50 calls     on Intel. The Motley Fool recommends Infinera. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:28:13"
}