{
  "url": "https://www.nasdaq.com/article/the-market-is-tired-of-the-trade-war-and-thats-good-news-cm1207677",
  "title": "The Market Is Tired Of The Trade War (And That's Good News...) - Nasdaq.com",
  "text": [
    " Tariffs and the trade war are still in the news. But they will   be for some time. The uncertainty of trade is now the new   normal. That's important because uncertainty is often associated with   market declines. However, when uncertainty becomes certain, as it   is now, traders tend to look past that news. So, trade will be in the headlines for some time. Those   headlines could lead to occasional blips in the market action,   but it no longer seems likely that a trade war will be the   catalyst for a bear market. I know that sounds a little confusing. And I know I often turn   to parenting analogies to understand the market. I hope you'll   indulge me with another one...  First children are the most stressful. Every time the first   child suffers a skinned knee or even believes they might have   skinned their knee, parents rush to treat the \"boo boo.\" With the second child, parents might move a little slower.   They know the boo boo will heal in just a few seconds in most   cases. Well, when Donald Trump first became president, it seemed like   every tweet was important. Now, traders understand that the tweet   will cause a little excitement but will heal itself in a few   moments. This is good news since the market has been recovering from   the trade war over the past month. The chart of SPDR S&P 500   ETF (NYSE:      SPY    ) below puts the past month in perspective.  There was an initial selloff on news that China would impose   tariffs on U.S. goods and news that the United States would   retaliate. This was before traders were accustomed to the   escalation. Over the past four weeks, there has been more news,   but overall there hasn't been any real movement in the stock   market. Obviously, we ended last week at an important price level. The   blue rectangle (above) shows that we are at resistance, a level   SPY reached before selling off twice in the past month. I expect SPY to break through resistance this time. That's   based on momentum. The next chart zooms in on the recent market   action and shows my Income Trader Volatility (ITV) indicator at   the bottom of the chart.  ITV turned bearish in the first days of the selloff and it is   now bullish. This is likely a signal that that prices are   positioned to break through resistance.  What Investor Sentiment Is Telling Us     Sentiment also confirms an \"up\" move is likely. The next chart   shows the latest results of the weekly survey conducted by the   American Association of Individual Investors (AAII). This survey dates back to 1987. For an average week, 38% of   investors are bullish, 30% are bearish, and 32% are neutral. Last week, just 26% were bullish, about 42% were bearish, and   32% were neutral.   Source:      AAII.com  There has been an unusually low number of bulls for the past   month. Most investors are bearish or neutral. Over more than 40 years, this survey has shown that the   majority of investors are usually wrong. When there are few   bulls, like there are now, markets tend to rally. As I've noted before, this makes sense. If markets were easy,   every investor would enjoy success. We should expect most   investors to be wrong because it is difficult to hold minority   views. Momentum and sentiment say we are due for a rally. The news is   bearish, but the weight of the evidence is bullish. In the   markets, it's best to take action based on evidence. For now,   that tells me we should be bullish.  How We're Trading A Bullish Gold Market     And, it's not just stocks that are bullish. Among the other bull   markets is gold, which is trading at a six-year high and breaking   out of a basing pattern that shows the potential for an   additional 14% gain.  As gold rallies, gold miners become more attractive. An   interesting gold miner is   Franco-Nevada Corporation (NYSE:      FNV    )    . To start with, the stock is on an ITV \"buy\" signal.  FNV is one of just 15 publicly traded gold miners with a   dividend yield. That makes it a unique way to combine income with   an inflation hedge. That should make the stock attractive. But   rather than simply buy the stock like most investors would, my I   recently told my     Income Trader      readers about a way to earn instant income from the stock without   having to wait for the dividend. If everything goes right, we collect our instant payout and   move on. Worst-case scenario, we would get the chance to buy the   stock at a big discount to current prices -- and we may even get   to collect that dividend, depending on how long we hold the   stock. As I always tell people, it's about as close as you can get to   a win-win when it comes to investing. My   Income Trader    subscribers and I have been making trades like this for years --   with a 90.5% success rate. And there's nothing complicated or   risky about it once you learn the basics.   If you'd like to learn more details about how       to make trades like this, go here now.     Related Articles   The Shocking Interest Rate Chart You Need To       See To Believe...   2 Cancer-Fighting Favorites To Put On Your       Watchlist   This May Be The Simplest Way To Pick Winning       Stocks   ",
    "Tariffs and the trade war are still in the news. But they will   be for some time. The uncertainty of trade is now the new   normal.",
    "That's important because uncertainty is often associated with   market declines. However, when uncertainty becomes certain, as it   is now, traders tend to look past that news.",
    "So, trade will be in the headlines for some time. Those   headlines could lead to occasional blips in the market action,   but it no longer seems likely that a trade war will be the   catalyst for a bear market.",
    "I know that sounds a little confusing. And I know I often turn   to parenting analogies to understand the market. I hope you'll   indulge me with another one...",
    "First children are the most stressful. Every time the first   child suffers a skinned knee or even believes they might have   skinned their knee, parents rush to treat the \"boo boo.\"",
    "With the second child, parents might move a little slower.   They know the boo boo will heal in just a few seconds in most   cases.",
    "Well, when Donald Trump first became president, it seemed like   every tweet was important. Now, traders understand that the tweet   will cause a little excitement but will heal itself in a few   moments.",
    "This is good news since the market has been recovering from   the trade war over the past month. The chart of SPDR S&P 500   ETF (NYSE:      SPY    ) below puts the past month in perspective.",
    "There was an initial selloff on news that China would impose   tariffs on U.S. goods and news that the United States would   retaliate. This was before traders were accustomed to the   escalation. Over the past four weeks, there has been more news,   but overall there hasn't been any real movement in the stock   market.",
    "Obviously, we ended last week at an important price level. The   blue rectangle (above) shows that we are at resistance, a level   SPY reached before selling off twice in the past month.",
    "I expect SPY to break through resistance this time. That's   based on momentum. The next chart zooms in on the recent market   action and shows my Income Trader Volatility (ITV) indicator at   the bottom of the chart.",
    "ITV turned bearish in the first days of the selloff and it is   now bullish. This is likely a signal that that prices are   positioned to break through resistance.",
    " What Investor Sentiment Is Telling Us     Sentiment also confirms an \"up\" move is likely. The next chart   shows the latest results of the weekly survey conducted by the   American Association of Individual Investors (AAII).",
    "This survey dates back to 1987. For an average week, 38% of   investors are bullish, 30% are bearish, and 32% are neutral.",
    "Last week, just 26% were bullish, about 42% were bearish, and   32% were neutral.",
    "There has been an unusually low number of bulls for the past   month. Most investors are bearish or neutral.",
    "Over more than 40 years, this survey has shown that the   majority of investors are usually wrong. When there are few   bulls, like there are now, markets tend to rally.",
    "As I've noted before, this makes sense. If markets were easy,   every investor would enjoy success. We should expect most   investors to be wrong because it is difficult to hold minority   views.",
    "Momentum and sentiment say we are due for a rally. The news is   bearish, but the weight of the evidence is bullish. In the   markets, it's best to take action based on evidence. For now,   that tells me we should be bullish.",
    " How We're Trading A Bullish Gold Market     And, it's not just stocks that are bullish. Among the other bull   markets is gold, which is trading at a six-year high and breaking   out of a basing pattern that shows the potential for an   additional 14% gain.",
    "As gold rallies, gold miners become more attractive. An   interesting gold miner is   Franco-Nevada Corporation (NYSE:      FNV    )    . To start with, the stock is on an ITV \"buy\" signal.",
    "FNV is one of just 15 publicly traded gold miners with a   dividend yield. That makes it a unique way to combine income with   an inflation hedge. That should make the stock attractive. But   rather than simply buy the stock like most investors would, my I   recently told my     Income Trader      readers about a way to earn instant income from the stock without   having to wait for the dividend.",
    "If everything goes right, we collect our instant payout and   move on. Worst-case scenario, we would get the chance to buy the   stock at a big discount to current prices -- and we may even get   to collect that dividend, depending on how long we hold the   stock.",
    "As I always tell people, it's about as close as you can get to   a win-win when it comes to investing. My   Income Trader    subscribers and I have been making trades like this for years --   with a 90.5% success rate. And there's nothing complicated or   risky about it once you learn the basics.",
    "  If you'd like to learn more details about how       to make trades like this, go here now.  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n",
    "\n© Copyright 2001-2016 StreetAuthority, LLC. All Rights Reserved.\n"
  ],
  "published_datetime": "2019-09-05 01:00:00"
}