{
  "url": "https://www.nasdaq.com/article/why-shares-of-general-electric-are-up-today-cm1207559",
  "title": "Why Shares of General Electric Are Up Today - Nasdaq.com",
  "text": [
    " What happened Shares of   General Electric    (NYSE: GE) were up more than 6% Wednesday after a prominent   analyst returned from a breakfast with management encouraged   about the progress GE is making. The jump is not enough to   recover all of what was lost last month when it was the   target of a short attack    , but the stock has been moving in the right direction in recent   weeks. So what Onetime highflier General Electric has fallen far off the   list of top growth stocks    , plagued by financial weakness made worse by poor acquisitions   and mismanagement. CEO Larry Culp took over in October 2018 with   a plan to streamline operations and return the company to growth,   but even bulls concede his ambitious plan will take years to play   out. Some, including Bernie Madoff whistleblower Harry Markopolos,   have suggested that the rot inside GE is much worse than the   company has disclosed.makeArticleAd();   GE is hoping products like its LEAP engine will help power     future results. Image source: GE.  Analysts are beginning to weigh in, and have been generally   supportive of GE. Earlier in the week, Deutsche Bank analyst   Nicole DeBlase wrote that while GE's insurance businesses are   \"messy,\" she said her team found some of Markopolos' arguments   \"to be weak, while others are plainly incorrect.\" Citi analyst Andrew Kaplowitz chimed in on Wednesday, saying   that he walked away from a breakfast with Culp and other managers   encouraged by GE's \"positive momentum.\" While there is still   considerable work to be done, Kaplowitz concluded \"meaningful   progress is underway\" and GE's potential for improvements into   2020 \"could be more significant than we think some investors   appreciate.\" Now what There is understandable relief from investors in hearing that   the worst-case scenario for GE is unlikely. But this is still a   troubled company with a long road to recovery. Even after the   Wednesday rally, shares are still down 12% from the beginning of   August. And at best, Culp and his team are going to need multiple   quarters to get GE up and running again. For shareholders who were worried they should take their   losses and abandon a sinking ship after the Markopolos report,   the current news flow should be encouraging. But investors   thinking of buying in should proceed cautiously. Even if a   turnaround is in GE's future, it is going to take time.   10 stocks we like better than General Electric       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and General Electric wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Lou Whiteman      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   General Electric    (NYSE: GE) were up more than 6% Wednesday after a prominent   analyst returned from a breakfast with management encouraged   about the progress GE is making. The jump is not enough to   recover all of what was lost last month when it was the   target of a short attack    , but the stock has been moving in the right direction in recent   weeks.",
    "Onetime highflier General Electric has fallen far off the   list of top growth stocks    , plagued by financial weakness made worse by poor acquisitions   and mismanagement. CEO Larry Culp took over in October 2018 with   a plan to streamline operations and return the company to growth,   but even bulls concede his ambitious plan will take years to play   out.",
    "Some, including Bernie Madoff whistleblower Harry Markopolos,   have suggested that the rot inside GE is much worse than the   company has disclosed.",
    "  GE is hoping products like its LEAP engine will help power     future results. Image source: GE. ",
    "GE is hoping products like its LEAP engine will help power     future results. Image source: GE.",
    "Analysts are beginning to weigh in, and have been generally   supportive of GE. Earlier in the week, Deutsche Bank analyst   Nicole DeBlase wrote that while GE's insurance businesses are   \"messy,\" she said her team found some of Markopolos' arguments   \"to be weak, while others are plainly incorrect.\"",
    "Citi analyst Andrew Kaplowitz chimed in on Wednesday, saying   that he walked away from a breakfast with Culp and other managers   encouraged by GE's \"positive momentum.\" While there is still   considerable work to be done, Kaplowitz concluded \"meaningful   progress is underway\" and GE's potential for improvements into   2020 \"could be more significant than we think some investors   appreciate.\"",
    "There is understandable relief from investors in hearing that   the worst-case scenario for GE is unlikely. But this is still a   troubled company with a long road to recovery. Even after the   Wednesday rally, shares are still down 12% from the beginning of   August. And at best, Culp and his team are going to need multiple   quarters to get GE up and running again.",
    "For shareholders who were worried they should take their   losses and abandon a sinking ship after the Markopolos report,   the current news flow should be encouraging. But investors   thinking of buying in should proceed cautiously. Even if a   turnaround is in GE's future, it is going to take time.",
    "  10 stocks we like better than General Electric       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and General Electric wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than General Electric       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and General Electric wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Lou Whiteman      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 04:04:00"
}