{
  "url": "https://www.nasdaq.com/article/amazon-roundup-india-indonesia-canada-logistics-policing-audible-irs-cm1206906",
  "title": "Amazon Roundup: India, Indonesia, Canada Logistics, Policing, Audible, IRS - Nasdaq.com",
  "text": [
    " Amazon AMZN  is strengthening its position in India despite regulatory setbacks; it is investing in a leading Indonesian ecommerce company; increasing logistics capabilities in Canada; and helping the police, getting sued by publishers and defeating the IRS in the U.S.  India  India's crackdown on fraudulent practices by non-banking financial institutions and its move to ban international auditing firm Deloitte and a KPMG affiliate has rattled corporate heads, contributing to lower growth rates and impacting the stock market. Amazon India head Amit Agarwal took the opportunity to say that India could improve its growth rates by promoting ecommerce rather than holding it back with red tape and unfriendly laws. He also said that Amazon's push for SMB exports had contributed a billion dollars to the country's exports and that the next three years would see this number climb to $5 billion. Amazon is specifically opposing the government's move to protect small sellers that can't compete with the deep discounts on the platform. The Confederation of All India Traders (CAIT) are accusing big retailers like Amazon of continuing to use complex measures to circumvent the protective law that went into effect this February. Agarwal's comments seem to indicate that the company is opposing rather than requesting time to build the data centers necessary to store Indian data within its borders, in line with global sentiments. Amazon has however inaugurated a new campus in the southern city of Hyderabad and there are no known plans of slowing down investment in the country, where Prime memberships continue to grow at the fastest rate in the world. Amazon is making arrangements to acquire a larger stake in Future Retail, one of the leading traditional retail chains in India. So, through Amazon.Com NV Investment Holdings LLC it has agreed to buy a 49% stake in Future Coupons Ltd, which holds warrants that can be converted partly or wholly into Future Retail shares. The warrants can be exercised in the next three to 10 years. It was earlier reported that Amazon was looking to buy a 10% stake in the company, valued at 20 billion rupees, or $278 million.  Investment in Indonesia's Gojek App  Bloomberg and Reuters are saying that Amazon is in talks to acquire a stake in Indonesian super app Gojek. Presumably the super prefix is because the app lets you hail rides, order dinner, shop groceries, make payments through a digital wallet, appoint cleaners, masseuses, hairdressers, etc, order medicines, and many other things. Its usefulness has enabled its expansion across Indonesia, the Philippines, Singapore, Thailand and Vietnam, where it serves 260 million people and competes with Alibaba (BABA) and Shopee. In Indonesia, where it launched, ecommerce sales are expected to jump from the current $12.2 billion to $53 billion in the next five years. The terms of the deal aren't known, but it definitely looks like a good place to kick-start Amazon's investment in the region.  Equity Stake in Canadian Airline Cargojet  Amazon continues to corner logistics capabilities in an attempt to serve its customers better. So similar to its agreements with U.S. air carriers Atlas Air Worldwide Holdings AAWW  and Air Transport Services Group ATSG  , it has signed an agreement with Toronto-based Cargojet, which operates 21 freighters (Boeing 757s and 767s). Accordingly, Cargojet will issue warrants that can, after seven years, be converted into voting shares, giving Amazon a 9.9% stake in the company. In exchange, Amazon will make sure it contributes C$ 400 million in volumes through the period. There's also a separate agreement giving Amazon warrants to buy, after seven years, an additional 5% of variable voting shares, for C$ 200 million.  Partnership with 400 Police Forces  Amazon-owned Ring has set itself up for fresh controversy by partnering with 400 police departments across the country. It allows law enforcement access to video recorded by the camera system that typically detects motion and transmits to the user, which can be viewed and shared as desired. Policemen won't get live access to the data unless publicly shared, but only by requesting the home owner, who has the prerogative to refuse.   Privacy advocates and critics fear this could increase racial profiling, while turning police officers into salespeople for surveillance-systems and increase community paranoia. Amazon has also been criticized by at least 25 prominent artificial-intelligence researchers, including experts at Alphabet GOOGL  , Facebook FB  and Microsoft MSFT  , for selling its facial recognition technology called rekognition to law enforcement. The problem with so doing is its inability to correctly identify colored people. Amazon, however, has said that the technology is so great that it can also identify emotions like fear, happiness, sadness, anger, surprise, disgust, calmness and confusion although it isn't against a certain amount of regulation. Its shareholders rejected proposals to stop selling the technology to government agencies and also to investigate privacy violations.  Amazon's Audible Sued for Copyright Infringement  Amazon doesn't appear to learn well from past mistakes, or tries to stretch what it can do with everything at its disposal. In the past, the company has got on the wrong side of publishers, authors and the Authors Guild because of unauthorized use of copyrights. And now it's doing pretty much the same thing with its audio book company Audible. Its new speech-to-text feature called \"Captions\" can use machine learning to reproduce voice recordings so children can see the text that they're hearing. The text may not be a hundred percent accurate, Amazon warns, and is intended to be more an education aid than anything else, according to the company. This is supposed to legalize the textual reproduction notwithstanding the fact that it will in all probability impact sales of print and digital book sales, hurting authors and publishers.  Of course, publishers, including Hachette, HarperCollins, Macmillan, Penguin Random House, Simon & Schuster, Chronicle Books and Scholastic don't agree with the thinking. So they and the Association of American Publishers, to which they subscribe, have sued Amazon in the Southern District Court of New York for copyright infringement.  IRS Appeal in U.S. Tax Dispute  Amazon won a 3-0 ruling in its favor at the 9th U.S. Circuit Court of Appeals in Seattle. The court upheld the 2017 U.S. tax court ruling against the IRS, represented by the Justice Department. The case was in relation to the definition of intangibles that were transferred to its Luxemburg headquarters in Europe. Amazon claimed that the value was limited to independently transferable assets, while the IRS wanted to include things like goodwill, employees and \"culture of innovation.\" A 2017 amendment to the tax law does include these things, and would have enabled the IRS to increase the tax bill. But the judge held that since the increased scope of intangibles in 2017 did not apply to what Amazon transacted in 2005 and 2006, it couldn't be held liable.       Recommendation  Amazon shares carry a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .    Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Amazon.com, Inc. (AMZN): Free Stock Analysis Report   Facebook, Inc. (FB): Free Stock Analysis Report   Alphabet Inc. (GOOGL): Free Stock Analysis Report   Microsoft Corporation (MSFT): Free Stock Analysis Report   Atlas Air Worldwide Holdings (AAWW): Free Stock Analysis Report   Air Transport Services Group, Inc (ATSG): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Amazon AMZN  is strengthening its position in India despite regulatory setbacks; it is investing in a leading Indonesian ecommerce company; increasing logistics capabilities in Canada; and helping the police, getting sued by publishers and defeating the IRS in the U.S.",
    " India ",
    "India's crackdown on fraudulent practices by non-banking financial institutions and its move to ban international auditing firm Deloitte and a KPMG affiliate has rattled corporate heads, contributing to lower growth rates and impacting the stock market. Amazon India head Amit Agarwal took the opportunity to say that India could improve its growth rates by promoting ecommerce rather than holding it back with red tape and unfriendly laws.",
    "He also said that Amazon's push for SMB exports had contributed a billion dollars to the country's exports and that the next three years would see this number climb to $5 billion.",
    "Amazon is specifically opposing the government's move to protect small sellers that can't compete with the deep discounts on the platform. The Confederation of All India Traders (CAIT) are accusing big retailers like Amazon of continuing to use complex measures to circumvent the protective law that went into effect this February.",
    "Agarwal's comments seem to indicate that the company is opposing rather than requesting time to build the data centers necessary to store Indian data within its borders, in line with global sentiments.",
    "Amazon has however inaugurated a new campus in the southern city of Hyderabad and there are no known plans of slowing down investment in the country, where Prime memberships continue to grow at the fastest rate in the world.",
    "Amazon is making arrangements to acquire a larger stake in Future Retail, one of the leading traditional retail chains in India. So, through Amazon.Com NV Investment Holdings LLC it has agreed to buy a 49% stake in Future Coupons Ltd, which holds warrants that can be converted partly or wholly into Future Retail shares. The warrants can be exercised in the next three to 10 years. It was earlier reported that Amazon was looking to buy a 10% stake in the company, valued at 20 billion rupees, or $278 million.",
    " Investment in Indonesia's Gojek App ",
    "Bloomberg and Reuters are saying that Amazon is in talks to acquire a stake in Indonesian super app Gojek.",
    "Presumably the super prefix is because the app lets you hail rides, order dinner, shop groceries, make payments through a digital wallet, appoint cleaners, masseuses, hairdressers, etc, order medicines, and many other things. Its usefulness has enabled its expansion across Indonesia, the Philippines, Singapore, Thailand and Vietnam, where it serves 260 million people and competes with Alibaba (BABA) and Shopee. In Indonesia, where it launched, ecommerce sales are expected to jump from the current $12.2 billion to $53 billion in the next five years.",
    "The terms of the deal aren't known, but it definitely looks like a good place to kick-start Amazon's investment in the region.",
    " Equity Stake in Canadian Airline Cargojet ",
    "Amazon continues to corner logistics capabilities in an attempt to serve its customers better. So similar to its agreements with U.S. air carriers Atlas Air Worldwide Holdings AAWW  and Air Transport Services Group ATSG  , it has signed an agreement with Toronto-based Cargojet, which operates 21 freighters (Boeing 757s and 767s).",
    "Accordingly, Cargojet will issue warrants that can, after seven years, be converted into voting shares, giving Amazon a 9.9% stake in the company. In exchange, Amazon will make sure it contributes C$ 400 million in volumes through the period. There's also a separate agreement giving Amazon warrants to buy, after seven years, an additional 5% of variable voting shares, for C$ 200 million.",
    " Partnership with 400 Police Forces ",
    "Amazon-owned Ring has set itself up for fresh controversy by partnering with 400 police departments across the country.",
    "It allows law enforcement access to video recorded by the camera system that typically detects motion and transmits to the user, which can be viewed and shared as desired. Policemen won't get live access to the data unless publicly shared, but only by requesting the home owner, who has the prerogative to refuse.  ",
    "Privacy advocates and critics fear this could increase racial profiling, while turning police officers into salespeople for surveillance-systems and increase community paranoia.",
    "Amazon has also been criticized by at least 25 prominent artificial-intelligence researchers, including experts at Alphabet GOOGL  , Facebook FB  and Microsoft MSFT  , for selling its facial recognition technology called rekognition to law enforcement. The problem with so doing is its inability to correctly identify colored people.",
    "Amazon, however, has said that the technology is so great that it can also identify emotions like fear, happiness, sadness, anger, surprise, disgust, calmness and confusion although it isn't against a certain amount of regulation.",
    "Its shareholders rejected proposals to stop selling the technology to government agencies and also to investigate privacy violations.",
    " Amazon's Audible Sued for Copyright Infringement ",
    "Amazon doesn't appear to learn well from past mistakes, or tries to stretch what it can do with everything at its disposal. In the past, the company has got on the wrong side of publishers, authors and the Authors Guild because of unauthorized use of copyrights. And now it's doing pretty much the same thing with its audio book company Audible.",
    "Its new speech-to-text feature called \"Captions\" can use machine learning to reproduce voice recordings so children can see the text that they're hearing. The text may not be a hundred percent accurate, Amazon warns, and is intended to be more an education aid than anything else, according to the company. This is supposed to legalize the textual reproduction notwithstanding the fact that it will in all probability impact sales of print and digital book sales, hurting authors and publishers. ",
    "Of course, publishers, including Hachette, HarperCollins, Macmillan, Penguin Random House, Simon & Schuster, Chronicle Books and Scholastic don't agree with the thinking. So they and the Association of American Publishers, to which they subscribe, have sued Amazon in the Southern District Court of New York for copyright infringement.",
    " IRS Appeal in U.S. Tax Dispute ",
    "Amazon won a 3-0 ruling in its favor at the 9th U.S. Circuit Court of Appeals in Seattle. The court upheld the 2017 U.S. tax court ruling against the IRS, represented by the Justice Department.",
    "The case was in relation to the definition of intangibles that were transferred to its Luxemburg headquarters in Europe. Amazon claimed that the value was limited to independently transferable assets, while the IRS wanted to include things like goodwill, employees and \"culture of innovation.\"",
    "A 2017 amendment to the tax law does include these things, and would have enabled the IRS to increase the tax bill. But the judge held that since the increased scope of intangibles in 2017 did not apply to what Amazon transacted in 2005 and 2006, it couldn't be held liable.",
    " Recommendation ",
    "Amazon shares carry a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 15:17:00"
}