{
  "url": "https://www.nasdaq.com/article/at-the-intersections-of-financial-services-cm1206795",
  "title": "At the Intersections of Financial Services - Nasdaq.com",
  "text": [
    "Professional providers of financial advice should look carefully at the history of innovation since it can provide a proven and much needed roadmap for their future. Traditional financial services business models are under attack by new technologies, new approaches and new players forcing many incumbents into increasingly uncompetitive or irrelevant positions.",
    "The industry has been historically structured around a series of strong linear disciplines (investment, insurance, taxes) where each has spent a lot of time and resources building moats against one another. ",
    "The history of innovation successes that moved industries forward paints a different picture. It has always pointed to intersections and cross-discipline idea sharing and collaboration. New ideas and real progress happens when diverse perspectives, specializations and ideas intersect and this is where new knowledge, insights and solutions are generated.",
    "To address an ongoing and accelerating rate of change in the industry, all financial providers need to bridge these moats of conflict, ego and distrust to creatively collaborate into client-centric teams. This is the best way to mix the latest of each disciplines’ thinking and solutions to keep ahead of rapid change and truly address clients’ increasingly complex family and business wealth needs.",
    "The future of your firm may not be in enhancing and continuing the extrapolation of your current linear services but positioning your firm into a unique cross-discipline team approach.",
    "To better understand this intersection and the power of industry collaboration as a strategic goal, we went to Institute member Travis Jennings, CEO of FinanceCAPE – A Tampa based financial concierge firm that has passionately been working to build strong networks of allied financial firms for the maximum benefit of clients.",
    "Hortz:You explain what you and your services represent as being a Financial Concierge. What does that mean exactly? ",
    "Jennings: The concept of being a “Financial Concierge” means being a genuine caretaker of the client in a 360-degree fashion. Anything and everything that may influence or impact their financial well-being is of concern to us. As a concierge, we are charged with the coordination, planning, and execution of how to manage the communication lines with their CPA, estate planning attorney, tax professional, insurance agent, banker, etc. Our goal is to create intersections of value through proactive planning with the additional professionals they rely on; to identify greater levels of opportunities and unseen challenges that can only be seen and resolved in co-ordination.",
    "This is where our obligation and commitment as a fiduciary really shines. It’s one thing to have an excellent grasp on investments and wealth producing strategies; it’s another thing to manage the execution of those strategies which often require tools from other financial professionals to optimize investment results. The majority of clients we work with do not have the time or interest in facilitating these sorts of discussions. As a result, we quarterback the process for them to ensure the right questions are being asked and comprehensive strategies are being applied.",
    "Hortz:What have you seen as client response or client experience to this approach?",
    "Jennings: This approach brings freedom to the client: freedom of time, freedom of worry, and, most importantly, freedom from distrust. We are contending with a long-standing reputation our industry has cultivated of being transactional - “in and out” when it comes to client interaction. When you are targeting what is truly “best” for the client, you can demonstrate that by sticking around to bridge the gaps and have transparent discussions with other financial professionals who have a vested interest in your clients’ lives. This creates an enormous amount of trust with your client. The goal is to provide as much value to our client. To be the light that guides their path through a seemingly dark forest that has become the unfortunate norm within the industry.",
    "Hortz:How does having a concierge approach really differentiate you and the services you provide?",
    "Jennings: Being able to empathize with clients while also coordinating efforts with other financial professionals is as much an art as it is a science. This task is not for the faint of heart. Often, we contend with challenging personality types, individuals who are strictly transactional or are not interested in having proactive discussions on how to best serve the client. Our multifaceted approach allows us to create a one-stop solution that saves the client time and worry while uncovering additional opportunities that come from relationship optimization with fellow financial professionals. It uniquely positions us in the crossroads or intersections of all their financial specialists and needs.",
    "Hortz:Tell us more about this intersection.",
    "Jennings: Creating these intersections of value is what makes the concierge model work. The old saying of “many hands make for light work” rings true when a little bit of sweat equity and due diligence is applied to the overall relationship. When we establish long-term and short-term goals with our clients we recognize the limitless possibilities that exist through proactive planning and relationship management with other financial professionals. We admit that we DO NOT have all of the answers. We carry a keen expertise when it comes to wealth management, as well as tax solutions, but understand that we are not CPA’s, attorneys, or bankers. Each one of these professionals provides a different angle with points of consideration that effect our clients’ overall well-being. As caretakers, we welcome and rely on each expertise that allows us to serve the client in a 360 degree fashion.",
    "Hortz:What do you see as your role at this intersection? ",
    "Jennings: We facilitate the intersection. The effort it takes to connect the dots is no easy task as there often are barriers to entry with each professional. Whether it is time, personalities or distance, facilitating these conversations to create the working or engaged intersections has taken many years to perfect. By bringing everyone together, by helping make things happen, working together as equals to search for solutions for our clients – then magic can happen at this intersection of experts. The key is in the commitment each of us has to serve to our clients. In putting their needs, goals, and considerations first, we find common ground that we synergistically build upon and create value together.",
    "Hortz:What have been your experiences working with other financial professionals in this potential intersection point?",
    "Jennings: The beginning of any new professional relationship can present challenges as you are figuring each other out. Once other professionals recognize that we are facilitating positive opportunities for our mutual clients, seeking to save them time and increase their value, the relationship typically takes off. The beautiful thing about always doing the right thing for your client is that it equates to value compounding itself over time. This leads to greater trust with all parties involved in addition to a more than happy client who is truly getting the best of the best",
    "Hortz:What are your best recommendations for advisors based from your experiences?",
    "Jennings: Always put yourself in your client’s shoes and ask yourself how you would want an advisor to treat you. As primary as that sounds, it is a constant reminder and has been the backbone to how I built my firm. I always want my advisor to go the extra mile, be transparent and be proactive. The proactive part doesn’t stop at a financial plan that canvases the next 30 years of a client’s projected financial wellness. It requires additional conversations with other trusted professionals. It requires you easing the burden and stress for your client so they can see and feel, on an ongoing basis, how much you care as opposed to just hearing it during quarterly reviews.",
    " My best recommendation is to assume a leadership role in your client’s life. It’s where you make the proactive effort to bridge the gap and identify value opportunities with other trusted advisors in their life. Our duty and responsibility as a “concierge” is rooted in action and investing the time it takes to forge trust and this vibrant, coordinated intersection of financial services for our clients.",
    "The Institute for Innovation Development is an educational and business development catalyst for growth-oriented financial advisors and financial services firmsdetermined to lead their businesses in an operating environment of accelerating business and cultural change. We position our members with the necessary ongoing innovation resources and best practices to drive and facilitate their next-generation growth, differentiation and unique community engagement strategies.The institute was launched with the support and foresight of our founding sponsors - Pershing, Voya Financial, Ultimus Fund Solutions, Fidelity, and Charter Financial Publishing (publisher of Financial Advisor and Private Wealth magazines). For more information click here.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:21:30"
}