{
  "url": "https://www.nasdaq.com/article/the-motley-fool-launches-soapbox-financial-network-acquires-budgetsaresexycom-cm1206867",
  "title": "The Motley Fool Launches Soapbox Financial Network, Acquires BudgetsAreSexy.com - Nasdaq.com",
  "text": [
    "  ALEXANDRIA, Va. -- Tuesday, Sept. 3 --    The Motley Fool Holdings, Inc., a global financial services   company dedicated to making the world smarter, happier, and   richer, has launched its newest subsidiary,   Soapbox Financial Network    , LLC - A Motley Fool Company. Through acquisitions of, and partnerships with, websites,   blogs, podcasts, and other content producers, Soapbox intends to   bring together expert storytellers on finance-related topics,   from budgeting to travel hacks to the FIRE movement and   beyond. \"By handing off tech operations and optimization to Soapbox,   bloggers and other content producers can focus on the things they   love to do -- writing, engaging with their audience, and helping   their community of readers,\" said Laura Cavanaugh, Soapbox team   captain and former head of The Motley Fool's business   intelligence team. \"They can dedicate more time to creating great   content, while we put our experience and expertise to work on   broadening the site's reach, improving operations, and increasing   profitability.\"makeArticleAd(); Soapbox's first acquisition,      BudgetsAreSexy.com    , \"a personal finance blog that won't put you to sleep,\" was   finalized on Monday, linking Soapbox with renowned owner, writer,   and content creator, J. Money. \"It's not every day you find a partner whose vision matches up   so well,\" said J. Money. \"I'm beyond excited to collaborate with   Soapbox and continue amplifying the financial gospel even   further. The world needs to know finance can be fun!\"   Image source: The Motley Fool.  J. Money, a preeminent professional blogger, philanthropist,   and leader in the financial community, will work alongside the   Soapbox team after the acquisition. He will continue to write for   the blog, and also provide consultation on future acquisitions,   curation strategies, and community building. \"Soapbox will share a range of approaches to help readers   improve their financial situation,\" said Roger Friedman, Soapbox   chief words officer and former Motley Fool managing editor and   president of the Fool's Blog Network. \"As we raise up exciting   voices who are aligned with the Fool's purpose, we can make an   even greater impact in the world.\"  About The Motley Fool Holdings, Inc.   Founded in 1993 in Alexandria, Va., by brothers David and     Tom Gardner, The Motley Fool Holdings, Inc., is a financial     services company dedicated to making the world smarter,     happier, and richer. The Motley Fool reaches millions of people     around the globe every day through its innovative investing     solutions, podcasts, books, newspaper column, and media     appearances. The Motley Fool Holdings Inc.'s operating     companies include The Motley Fool, LLC, and its international     subsidiaries, which provide free and premium investing advice     and commentary; Motley Fool Asset Management, LLC, which     advises the Motley Fool family of mutual funds and ETFs; Motley     Fool Wealth Management, LLC, which provides personal           investment advice      and managed accounts to its clients; and Motley Fool Ventures,     LLC, a member-based, venture capital fund focused on early     stage private companies.   The Motley Fool has a     disclosure policy      .  ",
    " ALEXANDRIA, Va. -- Tuesday, Sept. 3 --    The Motley Fool Holdings, Inc., a global financial services   company dedicated to making the world smarter, happier, and   richer, has launched its newest subsidiary,   Soapbox Financial Network    , LLC - A Motley Fool Company.",
    "Through acquisitions of, and partnerships with, websites,   blogs, podcasts, and other content producers, Soapbox intends to   bring together expert storytellers on finance-related topics,   from budgeting to travel hacks to the FIRE movement and   beyond.",
    "\"By handing off tech operations and optimization to Soapbox,   bloggers and other content producers can focus on the things they   love to do -- writing, engaging with their audience, and helping   their community of readers,\" said Laura Cavanaugh, Soapbox team   captain and former head of The Motley Fool's business   intelligence team. \"They can dedicate more time to creating great   content, while we put our experience and expertise to work on   broadening the site's reach, improving operations, and increasing   profitability.\"",
    "Soapbox's first acquisition,      BudgetsAreSexy.com    , \"a personal finance blog that won't put you to sleep,\" was   finalized on Monday, linking Soapbox with renowned owner, writer,   and content creator, J. Money.",
    "\"It's not every day you find a partner whose vision matches up   so well,\" said J. Money. \"I'm beyond excited to collaborate with   Soapbox and continue amplifying the financial gospel even   further. The world needs to know finance can be fun!\"",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    "J. Money, a preeminent professional blogger, philanthropist,   and leader in the financial community, will work alongside the   Soapbox team after the acquisition. He will continue to write for   the blog, and also provide consultation on future acquisitions,   curation strategies, and community building.",
    "\"Soapbox will share a range of approaches to help readers   improve their financial situation,\" said Roger Friedman, Soapbox   chief words officer and former Motley Fool managing editor and   president of the Fool's Blog Network. \"As we raise up exciting   voices who are aligned with the Fool's purpose, we can make an   even greater impact in the world.\"",
    " About The Motley Fool Holdings, Inc. ",
    " Founded in 1993 in Alexandria, Va., by brothers David and     Tom Gardner, The Motley Fool Holdings, Inc., is a financial     services company dedicated to making the world smarter,     happier, and richer. The Motley Fool reaches millions of people     around the globe every day through its innovative investing     solutions, podcasts, books, newspaper column, and media     appearances. The Motley Fool Holdings Inc.'s operating     companies include The Motley Fool, LLC, and its international     subsidiaries, which provide free and premium investing advice     and commentary; Motley Fool Asset Management, LLC, which     advises the Motley Fool family of mutual funds and ETFs; Motley     Fool Wealth Management, LLC, which provides personal           investment advice      and managed accounts to its clients; and Motley Fool Ventures,     LLC, a member-based, venture capital fund focused on early     stage private companies. ",
    " The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:19:00"
}