{
  "url": "https://www.nasdaq.com/article/notable-wednesday-option-activity-axdx-gild-mdb-cm1210684",
  "title": "Notable Wednesday Option Activity: AXDX, GILD, MDB - Nasdaq.com",
  "text": [
    "Looking at  options trading  activity among components of the Russell 3000 index, there is noteworthy activity today in Accelerate Diagnostics Inc (Symbol: AXDX), where a total volume of 1,826 contracts has been traded thus far today, a contract volume which is representative of approximately 182,600 underlying shares (given that every 1 contract represents 100 underlying shares). That number works out to 96.4% of AXDX's average daily trading volume over the past month, of 189,345 shares. Particularly high volume was seen for the $22.50 strike put option expiring October 18, 2019  , with 463 contracts trading so far today, representing approximately 46,300 underlying shares of AXDX. Below is a chart showing AXDX's trailing twelve month trading history, with the $22.50 strike highlighted in orange:       makeArticleAd();    Gilead Sciences Inc (Symbol: GILD) options are showing a volume of 52,238 contracts thus far today. That number of contracts represents approximately 5.2 million underlying shares, working out to a sizeable 90.3% of GILD's average daily trading volume over the past month, of 5.8 million shares. Especially high volume was seen for the $62.50 strike call option expiring September 20, 2019  , with 5,644 contracts trading so far today, representing approximately 564,400 underlying shares of GILD. Below is a chart showing GILD's trailing twelve month trading history, with the $62.50 strike highlighted in orange:       And MongoDB Inc (Symbol: MDB) saw options trading volume of 13,904 contracts, representing approximately 1.4 million underlying shares or approximately 86% of MDB's average daily trading volume over the past month, of 1.6 million shares. Especially high volume was seen for the $140 strike call option expiring September 20, 2019  , with 2,619 contracts trading so far today, representing approximately 261,900 underlying shares of MDB. Below is a chart showing MDB's trailing twelve month trading history, with the $140 strike highlighted in orange:         For the various different available expirations for AXDX options  , GILD options  , or MDB options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:25:29"
}