{
  "url": "https://www.nasdaq.com/article/video-costco-stock-looks-enticing-cm1207642",
  "title": "VIDEO: Costco Stock Looks Enticing - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Viral video footage might have reeled you in, but Costco's (NASDAQ: COST ) venture in Shanghai, China is worthy of holding your attention. In this episode of Matt McCall's \"Money Line\" podcast, he talks about what the craze means for Costco stock and what savvy investors should be doing to ride the rotisserie-chicken-filled wave.",
    " If you haven't seen the videos , you might be a little confused. What's the big deal about COST stock? Well, as McCall highlights, Costco's grand opening in Shanghai is important for several reasons. It offers packaged, bulk goods that many Chinese consumers want. Plus, the Shanghai location also sells high-end cosmetics and designer handbags .",
    "Costco's management had to close the store's doors early Aug. 27 amid reports that wait times for parking spots topped three hours. Later that day, it took to WeChat to announce a new maximum capacity of 2,000 people.",
    "While McCall is still on the fence about buying his own Costco membership, he isn't on the fence about what this means for Costco stock. Tune in to learn how to play this retail trend.",
    "You might remember that last week, McCall went head on with mainstream media organizations and \"irresponsible\" analysts. He's talking about ones that are searching for a recession around every corner. He still doesn't see one coming, and he has some advice if market fears are keeping you up at night. The fact that the S&P 500 is just 5% to 6% off an all-time high is reassuring, too.",
    "One thing McCall does see is a new trend for investors on the horizon. Fans of electric vehicles may know that lithium ion batteries, used to power such cars, have two major downsides. One, they rely on cobalt, primarily mined from geopolitically tense hotspots. Two, they are highly flammable. (Remember Samsung's phone scare?)",
    "But McCall sees solid-state batteries as the future because they offer less flammable, longer-lasting support. Their potential is in everything from EVs to smartphones. Subscribers to his VIP podcast or newsletters have access to an exchange-traded fund, of sorts. He's put together a list of plays in the solid-state battery space that are all up despite market volatility.",
    "Not a paid subscriber? Don't worry. Listen up for more on how General Motors (NYSE: GM ) and Toyota (NYSE: TM ) are positioning themselves for this up-and-coming trend. GM stock and TM stock are just two ways McCall highlights to get in on the trend.",
    "Tune in to \"Money Line\" for a review of Costco stock's crazy headlines, McCall's critiques of recession fearmongers and some takeaways on potentially the newest trend in the battery and electric vehicle space.",
    "Matthew McCall is the founder and president of Penn Financial Group, an investment advisory firm, as well as the editor of Investment Opportunities and Early Stage Investor. He has dedicated his career to getting investors into the world's biggest, most revolutionary trends BEFORE anyone else. The power of being \"first\" gave Matt's readers the chance to bank +2,438% in Stamps.com (STMP), +1,523% in Ulta Beauty (ULTA), +1,044% in Tesla (TSLA), +611% in Liquefied Natural Gas Limited (LNGLY), +324% in Bitcoin Services (BTSC), just to name a few. If you're interested in making triple-digit gains from the world's biggest investment trends BEFORE anyone else, click here to learn more about Matt McCall and his investments strategy today .",
    "The post VIDEO: Costco Stock Looks Enticing appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 03:48:16"
}