{
  "url": "https://www.nasdaq.com/article/why-michaels-companies-shares-briefly-jumped-27-this-morning-cm1207457",
  "title": "Why Michaels Companies Shares Briefly Jumped 27% This Morning - Nasdaq.com",
  "text": [
    "  What happened  Shares of   Michaels Companies    (NASDAQ: MIK) jumped as much as 27.3% higher on Wednesday   morning, powered by a strong second-quarter earnings report. By   12:20 p.m. EDT, the arts and crafts retailer's stock had calmed   down to a 7.3% gain. So what Michaels' second-quarter sales fell 2% year over year, landing   at $1.03 billion. Your average analyst would have settled for   $1.02 billion. On the bottom line, adjusted earnings rose 27% to   $0.19 per share. Here, analysts had been looking for $0.14 per   share, and   the midpoint of management's guidance    stopped at $0.15 per share. Furthermore, Michaels posted a 0.3% gain in comparable-store   sales. The top end of that metric's guidance range called for   flat comps, and management was prepared to report as much as a   1.5% lower trend.makeArticleAd();   Image source: Getty Images.  Now what Michaels also provided full-year and third-quarter guidance   roughly in line with current Wall Street expectations. The early gains rested on Michaels' solid performance and   upbeat near-term guidance, but the stock ran out of rocket fuel   when interim CEO Mark Cosby addressed the Chinese tariff   situation on the       earnings call    . The first three rounds of import tariffs haven't damaged the   company's results, but   the upcoming List 4    -- scheduled to take effect in mid-December -- could be a   different beast. \"Clearly, the situation remains fluid,\" Cosby said. \"And if   List 4 China tariffs are fully implemented, we estimate the   applicable direct import product costs subject to these duties   are between $400 million and $500 million.\" These effects wouldn't make an impact on Michaels' results   until 2020, because the company can work through its existing   inventory before taking the brunt of higher costs on new goods   from China. Management is exploring tariff-mitigating options   such as sourcing more goods from markets other than China,   negotiating better deals with Chinese vendors, and raising   customer prices as needed. Still, investors are right to worry   about the potential damage   consumer discretionary stocks    like Michaels could suffer if the List 4 tariffs are allowed to   take full effect in December.   10 stocks we like better than The Michaels     Companies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and The Michaels Companies     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Anders Bylund      has no position in any of the stocks mentioned. The Motley Fool     recommends The Michaels Companies. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   Michaels Companies    (NASDAQ: MIK) jumped as much as 27.3% higher on Wednesday   morning, powered by a strong second-quarter earnings report. By   12:20 p.m. EDT, the arts and crafts retailer's stock had calmed   down to a 7.3% gain.",
    "Michaels' second-quarter sales fell 2% year over year, landing   at $1.03 billion. Your average analyst would have settled for   $1.02 billion. On the bottom line, adjusted earnings rose 27% to   $0.19 per share. Here, analysts had been looking for $0.14 per   share, and   the midpoint of management's guidance    stopped at $0.15 per share.",
    "Furthermore, Michaels posted a 0.3% gain in comparable-store   sales. The top end of that metric's guidance range called for   flat comps, and management was prepared to report as much as a   1.5% lower trend.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Michaels also provided full-year and third-quarter guidance   roughly in line with current Wall Street expectations.",
    "The early gains rested on Michaels' solid performance and   upbeat near-term guidance, but the stock ran out of rocket fuel   when interim CEO Mark Cosby addressed the Chinese tariff   situation on the       earnings call    . The first three rounds of import tariffs haven't damaged the   company's results, but   the upcoming List 4    -- scheduled to take effect in mid-December -- could be a   different beast.",
    "\"Clearly, the situation remains fluid,\" Cosby said. \"And if   List 4 China tariffs are fully implemented, we estimate the   applicable direct import product costs subject to these duties   are between $400 million and $500 million.\"",
    "These effects wouldn't make an impact on Michaels' results   until 2020, because the company can work through its existing   inventory before taking the brunt of higher costs on new goods   from China. Management is exploring tariff-mitigating options   such as sourcing more goods from markets other than China,   negotiating better deals with Chinese vendors, and raising   customer prices as needed. Still, investors are right to worry   about the potential damage   consumer discretionary stocks    like Michaels could suffer if the List 4 tariffs are allowed to   take full effect in December.",
    "  10 stocks we like better than The Michaels     Companies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and The Michaels Companies     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than The Michaels     Companies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and The Michaels Companies     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Anders Bylund      has no position in any of the stocks mentioned. The Motley Fool     recommends The Michaels Companies. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 01:20:00"
}