{
  "url": "https://www.nasdaq.com/article/3-dividend-paying-semiconductor-stocks-to-buy-in-september-cm1210750",
  "title": "3 Dividend-Paying Semiconductor Stocks to Buy in September - Nasdaq.com",
  "text": [
    " U.S. stocks climbed Wednesday. The Dow posted its sixth straight session of gains and the S&P 500 rests not too far behind its all-time highs. This strength comes despite slowing global economic growth and the ongoing specter of the U.S.-China trade war.  makeArticleAd();  Markets have bounced back on trade war positivity, with talks between U.S. and Chinese officials scheduled for early next months. Plus, news broke Wednesday morning that China lifted tariffs on some products for the first time  since the trade war started, in a perceived sign of goodwill heading into the upcoming talks. There are certainly no guarantees that anything close to a trade resolution is reached anytime soon. Nonetheless, the broader global economic picture sets up a situation where investors need to search for returns somewhere, with negative interest rates from Germany to Japan. The yield on the 10-year U.S. Treasury, often considered one of the world's safest assets, sits at 1.73% right now. This is down from 2% near the end of July, but up from its recent lows of 1.43% (bond yields fall as prices climb). This brings us to today's topic: semiconductor stocks. Chip makers have played a vital role in the technological revolution and they will continue to. Global tech titans Apple AAPL  , Microsoft MSFT  , Google GOOGL  , and Amazon AMZN  all rely on chips, and everything from cloud computing to artificial intelligence are dependent on semiconductors. Despite its importance, the semiconductor industry is historically cyclical, as the last 12 months highlighted. Chip makers are still beholden to larger spending cycles and more. Plus, a run of outsized success put many semiconductor firms in a tough spot. Yet, the semiconductor industry has bounced back in 2019-driven by the likes of Advanced Micro Devices AMD  and Micron MU  -after its massive 2018 selloff, along with the rest of the market. Now, it's time to take a look at three semiconductor companies that pay a dividend that investors might want to consider buying right now.  1. Nvidia   NVDA   Nvidia is a GPU power that helps drive the quickly expanding high-end gaming market. The firm's products are also used in data centers, artificial intelligence, autonomous driving, and more. NVDA has seen its quarterly revenue fall over the last three quarters. With that said, the firm's Q2 fiscal 2020 revenue fell by the smallest amount (17%, compared to Q1's 30% drop) and management is optimistic. Last quarter, the company posted sequential growth across all of its platforms and said that adoption of its next-generation graphics chips \"has reached a tipping point.\" NVDA shares have surged 38% in 2019 to outpace the broader semiconductor market's 22% climb. Despite the jump, Nvidia stock still rests nearly 40% below its 52-week highs and its growth outlook is strong. Our current Zacks Consensus Estimates call for Q3 2020 revenue and earnings to slip 9% and 16%, respectively to help push its full-year sales and EPS down at similar clips. Then, Q4 revenue is projected to soar 39% above the year-ago period's rough quarter, to help lif t earnings  by 111% to $1.69 per share. NVDA's full-year fiscal 2021 earnings are then projected to climb 32% higher than our current-year estimate on 21% stronger sales that would see it easily top 2019 and 2020. NVDA is a Zacks Rank #3 (Hold) at the moment and its longer-term earnings revisions have trended more heavily in the right direction. Nvidia, which sports a \"B\" grade for Growth in our Style Scores system, also currently pays an annualized dividend of $0.64 per share, for a 0.35% yield. This isn't strong, but it is better than nothing, while also providing the potential for massive growth. And Nvidia is still trading far below its three-year highs in terms of forward earnings.     2. Intel Corporation   INTC   Intel is a historic microchip firm that has suffered a similar industry-related sales downturn during the past two quarters. INTC also faces increased competition from AMD, but investors shouldn't worry too much about Intel since it is still by far the biggest player in the space, expected to pull in $69 billion this year, compared to AMD's $6.7 billion. The Santa Clara, California-based company posted stronger-than-projected Q2 2019 earnings and revenue and upped its full-year guidance. Looking ahead, the semiconductor behemoth is projected to see its full-year fiscal 2019 sales slip 2%, with earnings projected to dip 4.4%. Peeking ahead, Intel's 2020 revenue is then projected to pop 2.2% above our 2019 estimate to outpace 2018's total. Meanwhile, the company's bottom-line is expected to pop 1.3%. On top of that, its Q3 and fiscal 2019 earnings estimate revisions have climbed heavily upward. Shares of INTC are up 12% in 2019 and 17% over the lats 12 months to top the semiconductor market's 6.5% climb. Intel is currently a Zacks Rank #3 (Hold) that rocks an \"A\" grade for Value and a \"B\" for Growth. The company also pays an annualized dividend of $1.26 per share at the moment, for a strong 2.43% yield. The firm also returns a ton of value to shareholders through buybacks. And its purchase of autonomous vehicle tech firm, Mobileye, could prove to be a big winner down the road.  3. Tokyo Electron Ltd.   TOELY   The Japanese firm makes semiconductor production equipment and flat panel display production equipment that are key to the industry. CEO Toshiki Kawai aims to continue to make Tokyo Electron a global power that is set to help fuel the continued expansion of everything from IoT to virtual reality and augmented reality and much more. Tokyo Electron is a lightly traded ADR stock in the U.S., but boasts a $28.68 billion market cap. TOELY stock is up 32% over the past 12 months to crush its industry's 6.5% climb. In fact, shares of Tokyo Electron hit a brand new 52-week high of $47.79 per share Wednesday. TOELY is also the only one of these three stocks that boasts a Zacks Rank #1 (Strong Buy). The company also holds \"B\" grades for both Growth and Value and its earnings and revenue are both expected to surge next year. Tokyo Electron currently pays an annualized dividend of $1.23 per share. Plus, the company's dividend yield is the highest on the list at 2.60%. This is even more impressive considering its huge climb, which includes a 70% jump in 2019.  Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Amazon.com, Inc. (AMZN): Free Stock Analysis Report   Alphabet Inc. (GOOGL): Free Stock Analysis Report   Apple Inc. (AAPL): Free Stock Analysis Report   Microsoft Corporation (MSFT): Free Stock Analysis Report   Advanced Micro Devices, Inc. (AMD): Free Stock Analysis Report   Intel Corporation (INTC): Free Stock Analysis Report   NVIDIA Corporation (NVDA): Free Stock Analysis Report   Micron Technology, Inc. (MU): Free Stock Analysis Report   Tokyo Electron Ltd. (TOELY): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "U.S. stocks climbed Wednesday. The Dow posted its sixth straight session of gains and the S&P 500 rests not too far behind its all-time highs. This strength comes despite slowing global economic growth and the ongoing specter of the U.S.-China trade war.  makeArticleAd();  Markets have bounced back on trade war positivity, with talks between U.S. and Chinese officials scheduled for early next months. Plus, news broke Wednesday morning that China lifted tariffs on some products for the first time  since the trade war started, in a perceived sign of goodwill heading into the upcoming talks.",
    "There are certainly no guarantees that anything close to a trade resolution is reached anytime soon. Nonetheless, the broader global economic picture sets up a situation where investors need to search for returns somewhere, with negative interest rates from Germany to Japan. The yield on the 10-year U.S. Treasury, often considered one of the world's safest assets, sits at 1.73% right now. This is down from 2% near the end of July, but up from its recent lows of 1.43% (bond yields fall as prices climb).",
    "This brings us to today's topic: semiconductor stocks. Chip makers have played a vital role in the technological revolution and they will continue to. Global tech titans Apple AAPL  , Microsoft MSFT  , Google GOOGL  , and Amazon AMZN  all rely on chips, and everything from cloud computing to artificial intelligence are dependent on semiconductors.",
    "Despite its importance, the semiconductor industry is historically cyclical, as the last 12 months highlighted. Chip makers are still beholden to larger spending cycles and more. Plus, a run of outsized success put many semiconductor firms in a tough spot. Yet, the semiconductor industry has bounced back in 2019-driven by the likes of Advanced Micro Devices AMD  and Micron MU  -after its massive 2018 selloff, along with the rest of the market.",
    "Now, it's time to take a look at three semiconductor companies that pay a dividend that investors might want to consider buying right now.",
    " 1. Nvidia   NVDA  ",
    "Nvidia is a GPU power that helps drive the quickly expanding high-end gaming market. The firm's products are also used in data centers, artificial intelligence, autonomous driving, and more. NVDA has seen its quarterly revenue fall over the last three quarters. With that said, the firm's Q2 fiscal 2020 revenue fell by the smallest amount (17%, compared to Q1's 30% drop) and management is optimistic. Last quarter, the company posted sequential growth across all of its platforms and said that adoption of its next-generation graphics chips \"has reached a tipping point.\"",
    "NVDA shares have surged 38% in 2019 to outpace the broader semiconductor market's 22% climb. Despite the jump, Nvidia stock still rests nearly 40% below its 52-week highs and its growth outlook is strong. Our current Zacks Consensus Estimates call for Q3 2020 revenue and earnings to slip 9% and 16%, respectively to help push its full-year sales and EPS down at similar clips. Then, Q4 revenue is projected to soar 39% above the year-ago period's rough quarter, to help lif t earnings  by 111% to $1.69 per share. NVDA's full-year fiscal 2021 earnings are then projected to climb 32% higher than our current-year estimate on 21% stronger sales that would see it easily top 2019 and 2020.",
    "NVDA is a Zacks Rank #3 (Hold) at the moment and its longer-term earnings revisions have trended more heavily in the right direction. Nvidia, which sports a \"B\" grade for Growth in our Style Scores system, also currently pays an annualized dividend of $0.64 per share, for a 0.35% yield. This isn't strong, but it is better than nothing, while also providing the potential for massive growth. And Nvidia is still trading far below its three-year highs in terms of forward earnings.   ",
    " 2. Intel Corporation   INTC  ",
    "Intel is a historic microchip firm that has suffered a similar industry-related sales downturn during the past two quarters. INTC also faces increased competition from AMD, but investors shouldn't worry too much about Intel since it is still by far the biggest player in the space, expected to pull in $69 billion this year, compared to AMD's $6.7 billion. The Santa Clara, California-based company posted stronger-than-projected Q2 2019 earnings and revenue and upped its full-year guidance.",
    "Looking ahead, the semiconductor behemoth is projected to see its full-year fiscal 2019 sales slip 2%, with earnings projected to dip 4.4%. Peeking ahead, Intel's 2020 revenue is then projected to pop 2.2% above our 2019 estimate to outpace 2018's total. Meanwhile, the company's bottom-line is expected to pop 1.3%. On top of that, its Q3 and fiscal 2019 earnings estimate revisions have climbed heavily upward.",
    "Shares of INTC are up 12% in 2019 and 17% over the lats 12 months to top the semiconductor market's 6.5% climb. Intel is currently a Zacks Rank #3 (Hold) that rocks an \"A\" grade for Value and a \"B\" for Growth. The company also pays an annualized dividend of $1.26 per share at the moment, for a strong 2.43% yield. The firm also returns a ton of value to shareholders through buybacks. And its purchase of autonomous vehicle tech firm, Mobileye, could prove to be a big winner down the road.",
    " 3. Tokyo Electron Ltd.   TOELY  ",
    "The Japanese firm makes semiconductor production equipment and flat panel display production equipment that are key to the industry. CEO Toshiki Kawai aims to continue to make Tokyo Electron a global power that is set to help fuel the continued expansion of everything from IoT to virtual reality and augmented reality and much more. Tokyo Electron is a lightly traded ADR stock in the U.S., but boasts a $28.68 billion market cap.",
    "TOELY stock is up 32% over the past 12 months to crush its industry's 6.5% climb. In fact, shares of Tokyo Electron hit a brand new 52-week high of $47.79 per share Wednesday. TOELY is also the only one of these three stocks that boasts a Zacks Rank #1 (Strong Buy). The company also holds \"B\" grades for both Growth and Value and its earnings and revenue are both expected to surge next year.",
    "Tokyo Electron currently pays an annualized dividend of $1.23 per share. Plus, the company's dividend yield is the highest on the list at 2.60%. This is even more impressive considering its huge climb, which includes a 70% jump in 2019.",
    " Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:06:00"
}