{
  "url": "https://www.nasdaq.com/article/samsung-to-launch-galaxy-fold-in-skorea-on-sept-6-priced-2000-20190904-01231",
  "title": "Samsung to launch Galaxy Fold in S.Korea on Sept. 6 priced $2,000 - Nasdaq.com",
  "text": [
    "SEOUL, Sept 5 (Reuters) - Samsung Electronics Co Ltd  on Thursday said its first foldable smartphone, the Galaxy Fold, will be available in South Korea from Sept. 6 with fifth-generation (5G) mobile connectivity.",
    "The world's largest smartphone vendor said the device would be priced 2.398 million won($1,977.47).",
    "The highly anticipated handset was originally due to hit the U.S. market in April but the launch was delayed by screen defects detected in samples.",
    "Samsung has promised to usher in a new age of foldables as part of its effort to showcase innovation in a saturated smartphone market.",
    "The company announced in July it would be ready to sell the Galaxy Fold in September after making changes including strengthening hinges, which early reviewers had found to be problematic. ",
    "Samsung will provide a program for Fold users in which the company covers 70% of cost of a display screen repair once within a year, according to its statement.",
    "\"Consumers have responded positively to larger screens, and the Galaxy Fold's revolutionary form factor offers a bigger, more immersive screen without sacrificing portability,\" said DJ Koh, chief executive of IT & Mobile Communications Division at Samsung Electronics.",
    "Last month, Chinese rival Huawei Technologies Co Ltd  delayed the planned September launch of its own first foldable phone, its second postponement this year, as it battles a U.S. trade blacklist that threatens the tech giant's access to crucial U.S. technologies such as Alphabet Inc's  Android operating system. ",
    "SK Telecom Co Ltd , South Korea's biggest mobile carrier by subscribers, also on Thursday said it expected Galaxy Fold sales to boost its number of 5G subscribers, offering discounts and insurance plans for the high-priced folding phone.",
    "($1 = 1,212.6600 won)"
  ],
  "published_datetime": "2019-09-04 10:00:00"
}