{
  "url": "https://www.nasdaq.com/article/why-is-fleetcor-technologies-flt-up-23-since-last-earnings-report-cm1208046",
  "title": "Why Is FleetCor Technologies (FLT) Up 2.3% Since Last Earnings Report? - Nasdaq.com",
  "text": [
    " A month has gone by since the las t earnings  report for FleetCor Technologies (FLT). Shares have added about 2.3% in that time frame, outperforming the S&P 500. Will the recent positive trend continue leading up to its next earnings release, or is FleetCor Technologies due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important catalysts.  FLEETCOR Tops Q2 Earnings & Revenues Estimates, 2019   View Up  FLEETCOR Technologies reported strong second-quarter 2019 results wherein both earnings and revenues surpassed the Zacks Consensus Estimate. Adjusted earnings of $2.85 per share outpaced the consensus estimate by 6 cents and increased 10.9% year over year. Notably, the reported figure exceeded the company guided range of $2.74-$2.84 per share. Revenues of $647.1 million beat the consensus mark by $13 million and increased 10.6% year over year on a reported basis and 13% on a pro-forma and macro-adjusted basis. Organic revenue growth was 13% in the reported quarter, driven by solid double-digit growth across the company's product categories - fuel, corporate payments, tolls and lodging. Its fuel card business was up 9%, corporate payments increased 26%, toll business grew 17% and lodging business increased 13% organically.  Revenues in Detail  Segment-wise, revenues from North America came in at $417.94 million, up 12.7% year over year. Internationally, revenues of $229.15 million increased 7.1% year over year. Product category-wise, fuel revenues of $295.1 million increased 6% year over year on a reported basis and 9% on a pro-forma and macro-adjusted basis. Corporate Payments revenues of $127.1 million increased 28% year over year on a reported basis and 26% on a pro-forma and macro-adjusted basis. Tolls revenues of $86.2 million improved 8% year over year on a reported basis and 17% on a pro-forma and macro-adjusted basis. Lodging revenues of $50.2 million increased 13% year over year on a reported basis as well as on a pro-forma and macro-adjusted basis. Gift revenues of $35.7 million increased 7% year over year on a reported basis and 2% on a pro-forma and macro-adjusted basis. Other revenues of $52.7 million increased 7% year over year on a reported basis and 8% on a pro-forma and macro-adjusted basis.  Operating Results  Operating income increased 12.3% from the prior-year quarter to $297.32 million. Operating income margin rose to 45.9% from 45.2% in the prior-year quarter.  Balance Sheet & Cash Flow  FLEETCOR exited second-quarter 2019 with cash, cash equivalents and restricted cash of approximately $1.49 billion compared with $1.37 billion at the end of the prior quarter. The company generated $252.53 million of net cash from operating activities. Capital expenditures totaled $17.47 million. In the reported quarter, FLEETCOR repurchased shares worth $702 million.  Q3 Guidance  For third-quarter 2019, the company expects adjusted earnings to be in the range of $3.00-$3.10 per share. The current Zacks Consensus Estimate of $3.04 lies within the guided range.  2019 Guidance  For 2019, FLEETCOR raised its revenue and adjusted earnings guidance while reaffirming the same for organic revenue growth, adjusted tax rate and interest expense. Total revenues are now anticipated in the range of $2.63-$2.68 billion compared with the previously guided range of $2.60-$2.66 billion. Adjusted earnings are now expected in the range of $11.53-$11.83 per share compared with the prior guided range of $11.47-$11.77 per share. The company continues to expect organic revenues to register 9-11% growth. Adjusted tax rate is anticipated between 23% and 24%. Interest expense is estimated between $150 - $160 million.   How Have Estimates Been Moving Since Then?  It turns out, fresh estimates have trended upward during the past month.  VGM Scores  At this time, FleetCor Technologies has a subpar Growth Score of D, however its Momentum Score is doing a lot better with a B. However, the stock was allocated a grade of D on the value side, putting it in the bottom 40% for this investment strategy. Overall, the stock has an aggregate VGM Score of D. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending upward for the stock, and the magnitude of these revisions looks promising. It comes with little surprise FleetCor Technologies has a Zacks Rank #2 (Buy). We expect an above average return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  FleetCor Technologies, Inc. (FLT): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "A month has gone by since the las t earnings  report for FleetCor Technologies (FLT). Shares have added about 2.3% in that time frame, outperforming the S&P 500.",
    "Will the recent positive trend continue leading up to its next earnings release, or is FleetCor Technologies due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recen t earnings report  in order to get a better handle on the important catalysts.  FLEETCOR Tops Q2 Earnings & Revenues Estimates, 2019   View Up  FLEETCOR Technologies reported strong second-quarter 2019 results wherein both earnings and revenues surpassed the Zacks Consensus Estimate. Adjusted earnings of $2.85 per share outpaced the consensus estimate by 6 cents and increased 10.9% year over year. Notably, the reported figure exceeded the company guided range of $2.74-$2.84 per share. Revenues of $647.1 million beat the consensus mark by $13 million and increased 10.6% year over year on a reported basis and 13% on a pro-forma and macro-adjusted basis. Organic revenue growth was 13% in the reported quarter, driven by solid double-digit growth across the company's product categories - fuel, corporate payments, tolls and lodging. Its fuel card business was up 9%, corporate payments increased 26%, toll business grew 17% and lodging business increased 13% organically.  Revenues in Detail  Segment-wise, revenues from North America came in at $417.94 million, up 12.7% year over year. Internationally, revenues of $229.15 million increased 7.1% year over year. Product category-wise, fuel revenues of $295.1 million increased 6% year over year on a reported basis and 9% on a pro-forma and macro-adjusted basis. Corporate Payments revenues of $127.1 million increased 28% year over year on a reported basis and 26% on a pro-forma and macro-adjusted basis. Tolls revenues of $86.2 million improved 8% year over year on a reported basis and 17% on a pro-forma and macro-adjusted basis. Lodging revenues of $50.2 million increased 13% year over year on a reported basis as well as on a pro-forma and macro-adjusted basis. Gift revenues of $35.7 million increased 7% year over year on a reported basis and 2% on a pro-forma and macro-adjusted basis. Other revenues of $52.7 million increased 7% year over year on a reported basis and 8% on a pro-forma and macro-adjusted basis.  Operating Results  Operating income increased 12.3% from the prior-year quarter to $297.32 million. Operating income margin rose to 45.9% from 45.2% in the prior-year quarter.  Balance Sheet & Cash Flow  FLEETCOR exited second-quarter 2019 with cash, cash equivalents and restricted cash of approximately $1.49 billion compared with $1.37 billion at the end of the prior quarter. The company generated $252.53 million of net cash from operating activities. Capital expenditures totaled $17.47 million. In the reported quarter, FLEETCOR repurchased shares worth $702 million.  Q3 Guidance  For third-quarter 2019, the company expects adjusted earnings to be in the range of $3.00-$3.10 per share. The current Zacks Consensus Estimate of $3.04 lies within the guided range.  2019 Guidance  For 2019, FLEETCOR raised its revenue and adjusted earnings guidance while reaffirming the same for organic revenue growth, adjusted tax rate and interest expense. Total revenues are now anticipated in the range of $2.63-$2.68 billion compared with the previously guided range of $2.60-$2.66 billion. Adjusted earnings are now expected in the range of $11.53-$11.83 per share compared with the prior guided range of $11.47-$11.77 per share. The company continues to expect organic revenues to register 9-11% growth. Adjusted tax rate is anticipated between 23% and 24%. Interest expense is estimated between $150 - $160 million. ",
    " FLEETCOR Tops Q2 Earnings & Revenues Estimates, 2019   View Up ",
    "FLEETCOR Technologies reported strong second-quarter 2019 results wherein both earnings and revenues surpassed the Zacks Consensus Estimate.",
    "Adjusted earnings of $2.85 per share outpaced the consensus estimate by 6 cents and increased 10.9% year over year. Notably, the reported figure exceeded the company guided range of $2.74-$2.84 per share.",
    "Revenues of $647.1 million beat the consensus mark by $13 million and increased 10.6% year over year on a reported basis and 13% on a pro-forma and macro-adjusted basis.",
    "Organic revenue growth was 13% in the reported quarter, driven by solid double-digit growth across the company's product categories - fuel, corporate payments, tolls and lodging. Its fuel card business was up 9%, corporate payments increased 26%, toll business grew 17% and lodging business increased 13% organically.",
    " Revenues in Detail ",
    "Segment-wise, revenues from North America came in at $417.94 million, up 12.7% year over year. Internationally, revenues of $229.15 million increased 7.1% year over year.",
    "Product category-wise, fuel revenues of $295.1 million increased 6% year over year on a reported basis and 9% on a pro-forma and macro-adjusted basis.",
    "Corporate Payments revenues of $127.1 million increased 28% year over year on a reported basis and 26% on a pro-forma and macro-adjusted basis.",
    "Tolls revenues of $86.2 million improved 8% year over year on a reported basis and 17% on a pro-forma and macro-adjusted basis.",
    "Lodging revenues of $50.2 million increased 13% year over year on a reported basis as well as on a pro-forma and macro-adjusted basis.",
    "Gift revenues of $35.7 million increased 7% year over year on a reported basis and 2% on a pro-forma and macro-adjusted basis.",
    "Other revenues of $52.7 million increased 7% year over year on a reported basis and 8% on a pro-forma and macro-adjusted basis.",
    " Operating Results ",
    "Operating income increased 12.3% from the prior-year quarter to $297.32 million. Operating income margin rose to 45.9% from 45.2% in the prior-year quarter.",
    " Balance Sheet & Cash Flow ",
    "FLEETCOR exited second-quarter 2019 with cash, cash equivalents and restricted cash of approximately $1.49 billion compared with $1.37 billion at the end of the prior quarter. The company generated $252.53 million of net cash from operating activities. Capital expenditures totaled $17.47 million. In the reported quarter, FLEETCOR repurchased shares worth $702 million.",
    " Q3 Guidance ",
    "For third-quarter 2019, the company expects adjusted earnings to be in the range of $3.00-$3.10 per share. The current Zacks Consensus Estimate of $3.04 lies within the guided range.",
    " 2019 Guidance ",
    "For 2019, FLEETCOR raised its revenue and adjusted earnings guidance while reaffirming the same for organic revenue growth, adjusted tax rate and interest expense. Total revenues are now anticipated in the range of $2.63-$2.68 billion compared with the previously guided range of $2.60-$2.66 billion. Adjusted earnings are now expected in the range of $11.53-$11.83 per share compared with the prior guided range of $11.47-$11.77 per share. The company continues to expect organic revenues to register 9-11% growth. Adjusted tax rate is anticipated between 23% and 24%. Interest expense is estimated between $150 - $160 million.",
    " How Have Estimates Been Moving Since Then? ",
    "It turns out, fresh estimates have trended upward during the past month.",
    " VGM Scores ",
    "At this time, FleetCor Technologies has a subpar Growth Score of D, however its Momentum Score is doing a lot better with a B. However, the stock was allocated a grade of D on the value side, putting it in the bottom 40% for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of D. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending upward for the stock, and the magnitude of these revisions looks promising. It comes with little surprise FleetCor Technologies has a Zacks Rank #2 (Buy). We expect an above average return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:31:26"
}