{
  "url": "https://www.nasdaq.com/article/forget-coca-cola-here-are-2-better-dividend-stocks-cm1207066",
  "title": "Forget Coca-Cola: Here Are 2 Better Dividend Stocks - Nasdaq.com",
  "text": [
    "  Coca-Cola    's (NYSE: KO) stock packs a 2.9%   dividend yield    , and the company has achieved   Dividend King    status by raising its payout for more than 50 years straight.   With some of the most valuable beverage brands in the world and a   strong dividend profile, it's no wonder the beverage leader has   been a go-to portfolio component for many income-focused   investors. Coca-Cola stock has delivered fantastic returns over the last   half-century, but the company's business has been losing some of   its fizz as consumers move away from sugary sodas and seek   healthier options. That's not to say that Coke won't find success   updating its product portfolio and continue to see strong   performance in emerging markets -- or that the stock won't   continue to generate solid dividend payments for years to   come. However, there are probably better long-term plays. If you're   looking for top    dividend   stocks    , you might consider   PepsiCo    (NASDAQ: PEP) and   Johnson & Johnson    (NYSE: JNJ) instead.makeArticleAd();   Image source: Getty Images.  PepsiCo Coke versus Pepsi isn't just an age-old question in the   soft-drink industry and the subject of blind-taste-test marketing   campaigns. It's a match-up that's long been a topic of debate   among income investors. It's also one that's unlikely to be   definitively resolved as long as the two companies are in   operation. While I personally prefer the taste of Coca-Cola's   namesake soda to that of its rival, I break ranks in maintaining   that PepsiCo is a better long-term income investment. While Coca-Cola has typically held the top spot in the   soft-drink market, PepsiCo has put more emphasis on   diversification and built up business through its Frito-Lay and   Quaker divisions. That move has worked to its benefit,   particularly as recent years have seen consumers shift away from   sugary drinks in the important North American market. PepsiCo's 2.8% dividend yield comes in just a hair below   Coca-Cola's, and I like the former company's lower payout ratios   and long-term growth prospects better. Covering Coca-Cola's   forward dividend will require roughly 75% of the company's   trailing earnings and 88% of trailing free cash flow (FCF), while   PepsiCo's earnings and FCF payout ratios over the   trailing-12-month period come in at 68% and 87%,   respectively. Pepsi has raised its payout by roughly 46%   over the last five years, while Coke has raised its payout by   31%.       Both companies are in heavy spending periods, and PepsiCo's   guidance actually calls for it to pay out around 100% of its free   cash flow in dividends in the current fiscal year. However,   if Coca-Cola does not significantly exceed its target for FCF of   at least $6 billion    in the current fiscal year, its current outstanding share count   would see the company distributing roughly $6.84 billion in   dividend payments -- working out to a payout ratio of 114%. Both   payout ratios look quite high, but Coke's is significantly   worse. The red-can company has delivered annual payout growth for a   whopping 56 years straight, while the blue-can company has a very   impressive 46-year streak of annual payout growth. Both beverage   giants have been reliably raising their payouts since before I   was born, and both companies will likely continue to hike their   dividends each year. However, PepsiCo's lower payout ratios put   it in position to deliver bigger dividend hikes. PepsiCo has also been having more success growing FCF, and   it's translated to dividend growth that tops that of its   rival.       KO Free Cash Flow Per Share (TTM)    data by   YCharts    . Pepsi's forward price-to-earnings ratio of 25 also comes in   below Coke's forward P/E of 26 as well. Like the difference in   taste between the two namesake sodas, it's not unreasonable to   point out there's not a big gulf between the two when it comes to   their current P/E values. However, PepsiCo's more diversified   product lineup appears better positioned for navigating shifts in   consumer tastes, so the slightly lower P/E still looks   significant. Johnson & Johnson Johnson & Johnson has been in operation for more than 130   years, and it has the makings of a great   income stock    and a steady performer that's built to weather market volatility.   The healthcare stalwart is poised to see long-term benefits from   trends including aging populations in its core Western markets   and overall global population growth, and shares look   attractively valued trading at just 15 times this year's expected   earnings. While consumers may continue to move away from sugary   beverages, it's a virtual certainty that more people will need   healthcare products and services. Whether J&J will maintain   its leadership status in its core business areas and effectively   position itself to serve an expanding healthcare market is   another question, but the company actually looks pretty well set   up for the future despite some recent setbacks and looming   challenges. J&J stock is facing pressure stemming   from high-profile legal cases and decisions. The company has   been hit with a string of lawsuits and judgments related to the   alleged tainting of its talcum-based powder with asbestos and   litigant claims that this caused the development of ovarian   cancer and mesothelioma. The healthcare company was also recently   ordered to pay $572 million in a suit alleging that it had   misrepresented the dangers associated with opioid-based drugs and   exaggerated their positive effects. In addition to the recent   legal troubles, the company's pharmaceuticals segment (which   accounts for roughly half of sales) has to contend with patents   for its drugs entering into the public domain and paving the way   for generic alternatives. The recent sell-offs have pushed the yield on the healthcare   giant's stock up to roughly 3% -- just a bit above what you're   getting with Coke. Like Coca-Cola, Johnson & Johnson is   a Dividend King. The company has raised its payout for 57 years   running, and the cost of covering its forward dividend comes   in at just 62% of trailing earnings and 56% of trailing free cash   flow. The healthcare giant hasn't been a slouch when it comes to   payout growth, either, with its roughly 36% dividend growth over   the last five years, edging out Coke's dividend growth. Its   dividend growth of 94% over the last decade comes in just below   the beverage giant's payout growth of 95% over the stretch. J&J is facing some significant challenges, but it   currently looks like a better defensive stock and long-term   income play than Coca-Cola. Consumer products is the smallest of   J&J's three segments, but the company name remains   well-trusted, and it has a strong lineup of brand names including   Band-Aid, Tylenol, Listerine, and Neutrogena. The company has   also been making internal steps and big investments to modernize   its healthcare devices business, making strides in surgical   robotics and big acquisitions in the augmented reality field. And   while drug patents aging into the public domain will continue to   be an issue, Johnson & Johnson still has a forefront position   in pharmaceuticals.   10 stocks we like better than Coca-Cola       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Coca-Cola wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Keith Noonan      has no position in any of the stocks mentioned. The Motley Fool     recommends Johnson & Johnson. The Motley Fool has a     disclosure policy      .  ",
    " Coca-Cola    's (NYSE: KO) stock packs a 2.9%   dividend yield    , and the company has achieved   Dividend King    status by raising its payout for more than 50 years straight.   With some of the most valuable beverage brands in the world and a   strong dividend profile, it's no wonder the beverage leader has   been a go-to portfolio component for many income-focused   investors.",
    "Coca-Cola stock has delivered fantastic returns over the last   half-century, but the company's business has been losing some of   its fizz as consumers move away from sugary sodas and seek   healthier options. That's not to say that Coke won't find success   updating its product portfolio and continue to see strong   performance in emerging markets -- or that the stock won't   continue to generate solid dividend payments for years to   come.",
    "However, there are probably better long-term plays. If you're   looking for top    dividend   stocks    , you might consider   PepsiCo    (NASDAQ: PEP) and   Johnson & Johnson    (NYSE: JNJ) instead.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Coke versus Pepsi isn't just an age-old question in the   soft-drink industry and the subject of blind-taste-test marketing   campaigns. It's a match-up that's long been a topic of debate   among income investors. It's also one that's unlikely to be   definitively resolved as long as the two companies are in   operation. While I personally prefer the taste of Coca-Cola's   namesake soda to that of its rival, I break ranks in maintaining   that PepsiCo is a better long-term income investment.",
    "While Coca-Cola has typically held the top spot in the   soft-drink market, PepsiCo has put more emphasis on   diversification and built up business through its Frito-Lay and   Quaker divisions. That move has worked to its benefit,   particularly as recent years have seen consumers shift away from   sugary drinks in the important North American market.",
    "PepsiCo's 2.8% dividend yield comes in just a hair below   Coca-Cola's, and I like the former company's lower payout ratios   and long-term growth prospects better. Covering Coca-Cola's   forward dividend will require roughly 75% of the company's   trailing earnings and 88% of trailing free cash flow (FCF), while   PepsiCo's earnings and FCF payout ratios over the   trailing-12-month period come in at 68% and 87%,   respectively. Pepsi has raised its payout by roughly 46%   over the last five years, while Coke has raised its payout by   31%.      ",
    "Both companies are in heavy spending periods, and PepsiCo's   guidance actually calls for it to pay out around 100% of its free   cash flow in dividends in the current fiscal year. However,   if Coca-Cola does not significantly exceed its target for FCF of   at least $6 billion    in the current fiscal year, its current outstanding share count   would see the company distributing roughly $6.84 billion in   dividend payments -- working out to a payout ratio of 114%. Both   payout ratios look quite high, but Coke's is significantly   worse.",
    "The red-can company has delivered annual payout growth for a   whopping 56 years straight, while the blue-can company has a very   impressive 46-year streak of annual payout growth. Both beverage   giants have been reliably raising their payouts since before I   was born, and both companies will likely continue to hike their   dividends each year. However, PepsiCo's lower payout ratios put   it in position to deliver bigger dividend hikes.",
    "PepsiCo has also been having more success growing FCF, and   it's translated to dividend growth that tops that of its   rival.",
    " KO Free Cash Flow Per Share (TTM)    data by   YCharts    .",
    "Pepsi's forward price-to-earnings ratio of 25 also comes in   below Coke's forward P/E of 26 as well. Like the difference in   taste between the two namesake sodas, it's not unreasonable to   point out there's not a big gulf between the two when it comes to   their current P/E values. However, PepsiCo's more diversified   product lineup appears better positioned for navigating shifts in   consumer tastes, so the slightly lower P/E still looks   significant.",
    "Johnson & Johnson has been in operation for more than 130   years, and it has the makings of a great   income stock    and a steady performer that's built to weather market volatility.   The healthcare stalwart is poised to see long-term benefits from   trends including aging populations in its core Western markets   and overall global population growth, and shares look   attractively valued trading at just 15 times this year's expected   earnings.",
    "While consumers may continue to move away from sugary   beverages, it's a virtual certainty that more people will need   healthcare products and services. Whether J&J will maintain   its leadership status in its core business areas and effectively   position itself to serve an expanding healthcare market is   another question, but the company actually looks pretty well set   up for the future despite some recent setbacks and looming   challenges.",
    "J&J stock is facing pressure stemming   from high-profile legal cases and decisions. The company has   been hit with a string of lawsuits and judgments related to the   alleged tainting of its talcum-based powder with asbestos and   litigant claims that this caused the development of ovarian   cancer and mesothelioma. The healthcare company was also recently   ordered to pay $572 million in a suit alleging that it had   misrepresented the dangers associated with opioid-based drugs and   exaggerated their positive effects. In addition to the recent   legal troubles, the company's pharmaceuticals segment (which   accounts for roughly half of sales) has to contend with patents   for its drugs entering into the public domain and paving the way   for generic alternatives.",
    "The recent sell-offs have pushed the yield on the healthcare   giant's stock up to roughly 3% -- just a bit above what you're   getting with Coke. Like Coca-Cola, Johnson & Johnson is   a Dividend King. The company has raised its payout for 57 years   running, and the cost of covering its forward dividend comes   in at just 62% of trailing earnings and 56% of trailing free cash   flow. The healthcare giant hasn't been a slouch when it comes to   payout growth, either, with its roughly 36% dividend growth over   the last five years, edging out Coke's dividend growth. Its   dividend growth of 94% over the last decade comes in just below   the beverage giant's payout growth of 95% over the stretch.",
    "J&J is facing some significant challenges, but it   currently looks like a better defensive stock and long-term   income play than Coca-Cola. Consumer products is the smallest of   J&J's three segments, but the company name remains   well-trusted, and it has a strong lineup of brand names including   Band-Aid, Tylenol, Listerine, and Neutrogena. The company has   also been making internal steps and big investments to modernize   its healthcare devices business, making strides in surgical   robotics and big acquisitions in the augmented reality field. And   while drug patents aging into the public domain will continue to   be an issue, Johnson & Johnson still has a forefront position   in pharmaceuticals.",
    "  10 stocks we like better than Coca-Cola       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Coca-Cola wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Coca-Cola       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Coca-Cola wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Keith Noonan      has no position in any of the stocks mentioned. The Motley Fool     recommends Johnson & Johnson. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:20:00"
}