{
  "url": "https://www.nasdaq.com/article/why-stampscom-stock-soared-348-in-august-cm1210521",
  "title": "Why Stamps.com Stock Soared 34.8% in August - Nasdaq.com",
  "text": [
    " What happened Shares of   Stamps.com    (NASDAQ: STMP) climbed 34.8% in August, according to data from   S&P Global Market Intelligence    , after the beaten-down online-postage specialist announced   encouraging quarterly results and raised its full-year   outlook. Stamps.com stock soared 27% on Aug. 8, 2019 alone -- the first   trading day after the company told investors its second-quarter   revenue declined 0.6% year over year to $138.8 million,   translating to a more than 50% decline in adjusted net income to   $22.3 million, or $1.25 per share. Recall that Stamps.com's top-   and bottom-line performance is still under pressure on the heels   of management's surprise decision in February to   end the company's exclusive partnership    with the U.S. Postal Service (USPS) in order to embrace   partnerships with other carriers in the increasingly competitive   shipping industry.   IMAGE SOURCE: GETTY IMAGES.makeArticleAd();  So what To be clear, Stamps.com chairman and CEO Ken McBride noted   their second-quarter results were essentially in line with   expectations -- though even that left investors breathing a sigh   of relief considering the stock was still reeling from not only   its big drop after the February news, but also after the company   lowered its already sobering guidance in May due to the potential   fallout of the USPS renegotiating service agreements with some of   Stamps.com's reseller partners. During last month's call, however, McBride explained that   Stamps.com was seeing \"a positive shift in the USPS's negotiating   position with\" those partners -- a potential indication that the   government entity is beginning to realize the value those   resellers were bringing to the table. Now what As such, Stamps.com revised its 2019 outlook for the better,   calling for revenue of $520 million to $560 million (up $10   million from the lower end of its old range), and adjusted   earnings per share (EPS) of $3.60 to $4.85 (up $0.25 per share   from the bottom end of its previous target). And Stamps.com isn't pumping the breaks anytime soon. Just   last week, the company launched its new GlobalPost International   shipping services to address concerns and avoid disruptions   related to the United States leaving the Universal Postal Union   (UPU). \"We know customers simply can't afford disruptions to their   shipping services,\" McBride said. \"That's why we're proud to be   able to offer these GlobalPost services to our many international   shipping customers who have been concerned about the potential   USPS disruption caused by the breakdown of the UPU/U.S.   relationship.\" In the end, it's hard to blame Stamps.com for making the most   of an otherwise frustrating situation. If that helps spur its   post-USPS turnaround, and with shares still trading down nearly   70% over the past year as of this writing, I suspect Stamps.com   stock could still prove an   enticing value    for investors today.   10 stocks we like better than Stamps.com       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Stamps.com wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Steve Symington      has no position in any of the stocks mentioned. The Motley Fool     recommends Stamps.com. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   Stamps.com    (NASDAQ: STMP) climbed 34.8% in August, according to data from   S&P Global Market Intelligence    , after the beaten-down online-postage specialist announced   encouraging quarterly results and raised its full-year   outlook.",
    "Stamps.com stock soared 27% on Aug. 8, 2019 alone -- the first   trading day after the company told investors its second-quarter   revenue declined 0.6% year over year to $138.8 million,   translating to a more than 50% decline in adjusted net income to   $22.3 million, or $1.25 per share. Recall that Stamps.com's top-   and bottom-line performance is still under pressure on the heels   of management's surprise decision in February to   end the company's exclusive partnership    with the U.S. Postal Service (USPS) in order to embrace   partnerships with other carriers in the increasingly competitive   shipping industry.",
    "  IMAGE SOURCE: GETTY IMAGES.makeArticleAd(); ",
    "IMAGE SOURCE: GETTY IMAGES.",
    "To be clear, Stamps.com chairman and CEO Ken McBride noted   their second-quarter results were essentially in line with   expectations -- though even that left investors breathing a sigh   of relief considering the stock was still reeling from not only   its big drop after the February news, but also after the company   lowered its already sobering guidance in May due to the potential   fallout of the USPS renegotiating service agreements with some of   Stamps.com's reseller partners.",
    "During last month's call, however, McBride explained that   Stamps.com was seeing \"a positive shift in the USPS's negotiating   position with\" those partners -- a potential indication that the   government entity is beginning to realize the value those   resellers were bringing to the table.",
    "As such, Stamps.com revised its 2019 outlook for the better,   calling for revenue of $520 million to $560 million (up $10   million from the lower end of its old range), and adjusted   earnings per share (EPS) of $3.60 to $4.85 (up $0.25 per share   from the bottom end of its previous target).",
    "And Stamps.com isn't pumping the breaks anytime soon. Just   last week, the company launched its new GlobalPost International   shipping services to address concerns and avoid disruptions   related to the United States leaving the Universal Postal Union   (UPU).",
    "\"We know customers simply can't afford disruptions to their   shipping services,\" McBride said. \"That's why we're proud to be   able to offer these GlobalPost services to our many international   shipping customers who have been concerned about the potential   USPS disruption caused by the breakdown of the UPU/U.S.   relationship.\"",
    "In the end, it's hard to blame Stamps.com for making the most   of an otherwise frustrating situation. If that helps spur its   post-USPS turnaround, and with shares still trading down nearly   70% over the past year as of this writing, I suspect Stamps.com   stock could still prove an   enticing value    for investors today.",
    "  10 stocks we like better than Stamps.com       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Stamps.com wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Stamps.com       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Stamps.com wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Steve Symington      has no position in any of the stocks mentioned. The Motley Fool     recommends Stamps.com. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:00:00"
}