{
  "url": "https://www.nasdaq.com/article/forexeuro-pauses-before-ecb-meeting-as-trade-thaw-triggers-risk-rally-20190912-00098",
  "title": "FOREX-Euro pauses before ECB meeting as trade thaw triggers risk rally - Nasdaq.com",
  "text": [
    "    * ECB decision due at 1145 GMT, press conference 1230 GMT",
    "* Trump's delay to scheduled tariff hike boosts markets",
    "* China's offshore yuan gains 0.5%, Aussie hits 6-wk high",
    "By Tommy Wilkes",
    "LONDON, Sept 12 (Reuters) - The euro hovered near $1.10 onThursday as traders waited to see the scale of fresh stimulusexpected from the European Central Bank, while China's yuan andAustralia's dollar were buoyed by further signs of a thaw in theU.S.-China trade war.",
    "After a difficult August in which concerns about a globalrecession sparked a scramble into safer assets, investors havebeen returning to riskier markets this month, encouraged byChina and the United States making moves to ease trade tensionsand by receding fears of a no-deal Brexit.",
    "China on Wednesday exempted a basket of U.S. goods from itstariffs, while U.S. President Donald Trump said in a tweet hewould delay a scheduled tariff hike by two weeks in October.",
    "Export-driven Asian currencies from Taiwan to Australiarallied on the buoyant mood as the world's two largest economieseach granted concessions in their heated tariff dispute.",
    "The Japanese yen, the go-to safe haven currency for nervousinvestors, fell to a six-week low against the dollar. The yenbreached the 108 mark and was last at 107.98 yen per dollar,down 0.1% on the day and far from its seven-month high of 104.46plumbed last month.",
    "The Aussie hit a six-week high and the offshore Chinese yuanrose 0.5% CNH=EBS to a three-week high of 7.0737 against thedollar.",
    "Market attention now turns to the ECB, the first of a seriesof major central bank events, with the Federal Reserve and theBank of Japan meeting next week.",
    "Investors almost universally expect a rate cut at Thursday'sECB meeting as policymakers try to prop up the region's ailingeconomy.",
    "The real uncertainty is whether policymakers will restart aquantitative easing programme after some members of thegoverning council in recent weeks expressed doubt about the needto relaunch asset purchases. urn:newsml:reuters.com:*:nL5N2630ZT",
    "SEB strategist Jussi Hiljanen said he expected the ECB tocut the deposit rate by 10 basis points, extend the forwardguidance on rates by six months and announce the restart of aquantitative easing programme with monthly purchases lower thanthe market anticipated.",
    "\"Such a package of stimulus measures would be adisappointment for the market, pushing long rates higher andEUR/USD higher and steepening the curve,\" Hiljanen said.",
    "The single currency EUR=EBS has shed 3.5% since June andwas steady at $1.1017 in early European trade.",
    "The dollar was slightly lower against a basket of currenciesat 98.599 .DXY .",
    "Sterling was little changed GBP=D3EURGBP=D3 . The poundrocketed to a six-week high on Monday, reversing last week'slosses as investors welcomed the British parliament's move toblock a no-deal Brexit on Oct. 31. ",
    "Despite the more positive mood in risk assets this week,analysts expressed some caution about its sustainability.",
    "\"Just as the presidential tweet on tariffs this morning hasinjected more momentum ... we are only one social media postingaway from a thoroughly unpredictable President turning sentimenton its head,\" said Jeffrey Halley, senior market analyst forAsia Pacific at brokerage OANDA. (Additional reporting by Tom Westbrook in Sydney; Editing byHugh Lawson) ((thomas.wilkes@thomsonreuters.com))"
  ],
  "published_datetime": "2019-09-12 03:59:00"
}