{
  "url": "https://www.nasdaq.com/article/futures-higher-on-news-of-uschina-trade-talks-20190905-00355",
  "title": "Futures higher on news of U.S.-China trade talks - Nasdaq.com",
  "text": [
    "By Uday Sampath Kumar",
    "Sept 5 (Reuters) - U.S. stock index futures rose on Thursday as the United States and China agreed to hold high-level talks next month, raising hopes of a de-escalation in a trade war that has bruised global economic growth.",
    "China'sCommerce Ministry said its trade team will hold talks with their U.S. counterparts in mid-September in preparation for high level negotiations in early October.  ",
    "Industrial bellwethers Boeing Co  and Caterpillar Inc  rose over 1% each.",
    "Apple Inc  led the FAANG group of stocks higher, gaining 1.1%, while Facebook Inc , Alphabet Inc , Netflix Inc  and Amazon.com Inc  rose between 0.8% and 1%.",
    "Wall Street came under pressure at the start of the week as Beijing and Washington began slapping tariffs on each other's good as well as data that showed a contraction in U.S. factory activity in August.",
    "The trade dispute, which began over a year ago, has dented global economic activity and roiled financial markets. Investors are now pinning hopes on central banks to step in and ease monetary policy to help boost growth.",
    "Market participants are currently expecting a quarter percentage point cut in interest rates by the Federal Reserve at its mid-September meeting.",
    "At 7:05 a.m. ET, Dow e-minis  were up 249 points, or 0.94%. S&P 500 e-minis  were up 26 points, or 0.88% and Nasdaq 100 e-minis  were up 88.25 points, or 1.14%.",
    "Among other stocks, Slack Technologies Inc  fell 13.1% after the workplace messaging platform on Wednesday forecast slowing revenue growth in the second half and a bigger-than-expected third-quarter loss. ",
    "While market sentiment this week has largely been driven by global trade and political news, investors will likely shift their focus to nonfarm payrolls data due on Friday, with analysts cautioning that any weakness could be a sign of the U.S. economy slowing.",
    "The ADP national employment data, considered a precursor to the Labor Department's more comprehensive jobs report, is expected to show private payrolls increased by 149,000 jobs in August, after gaining by 156,000 jobs in July. The data is due at 8:15 a.m. ET."
  ],
  "published_datetime": "2019-09-05 07:28:00"
}