{
  "url": "https://www.nasdaq.com/article/alstom-shares-slide-as-top-shareholder-bouygues-cuts-stake-20190912-00144",
  "title": "Alstom shares slide as top shareholder Bouygues cuts stake - Nasdaq.com",
  "text": [
    "PARIS, Sept 12 (Reuters) - Shares in French train manufacturer Alstom  fell on Thursday after its leading shareholder Bouygues  shed half its stake in a business that has become less compatible with its focus on construction and telecoms.",
    "The sale follows years of setbacks and strategy shifts for the Bouygues conglomerate as Alstom's leading investor.",
    "Its ambition to create a vast nuclear and energy group when it bought into the company in 2006, taking on the French state's stake, never came to fruition, and Alstom has since narrowed its focus on the transport and rail sector.",
    "Alstom shares were down 5.2% at 0901 GMT, while Bouygues' shares were up 0.4%.",
    "\"It was a timely moment for this type of transaction,\" a spokesman for Bouygues said. \"Bouygues has exercised, and will continue to exercise, its role as the lead shareholder (in Alstom).\"",
    "He said no decision had yet been taken on what would happen to the remainder of the stake. The shares are now subject to a 180-day lock-up, meaning they cannot be sold in that period.",
    "Bouygues has been expected for months to sell out of Alstom or whittle down its stake.",
    "The group had favoured a planned deal for Germany'sSiemens  to merge its rail business with Alstom, which would have given it a way out.",
    "EU antitrust regulators blocked the Siemens-Alstom merger proposal in February, saying it would have hurt competition and pushed up prices for consumers.",
    "Family-controlled Bouygues - run by Martin Bouygues, whose father founded the business, and who spearheaded its moves into telecoms - had hoped initially to capitalise on its construction expertise in the nuclear sector and Alstom's power turbine business to create a mega-energy group, along with Areva, now known as Framatome.",
    "But Alstom was hit along with rivals in the nuclear industry by the 2011 Fukushima disaster in Japan, and its power turbine business suffered from dips in demand in other parts of the power market too.",
    "Its energy business was sold off to General Electric  in 2015.",
    "($1 = 0.9069 euros)"
  ],
  "published_datetime": "2019-09-12 05:25:00"
}