{
  "url": "https://www.nasdaq.com/article/mcdonalds-has-a-new-way-to-upsell-its-customers-cm1210307",
  "title": "McDonald’s Has a New Way to Upsell Its Customers - Nasdaq.com",
  "text": [
    " Most restaurant teach waiters and order takers to attempt to   upsell their customers. That can be a subtle line delivered   naturally like \"and would you like a beverage with your meal?\",   or clumsier attempts that seem to offer the whole menu. When properly done, upselling either subtly gives the consumer   permission to add a little something extra without shame (yes, I   would like whipped cream on that) or reminds them to order   something they do actually want. It's not an easy technique to   master, and when done wrong it can irritate customers. That's why   McDonald's    (NYSE: MCD) has found a way to take people out of the upsell   process. In April the company bought a technology company,   Dynamic Yield, that allows it to offer more dynamic menu boards   that lead customers to make bigger purchases.makeArticleAd();   McDonald's has been adapting new technologies. Image source:     McDonald's.  A new type of menu The fast-food chain quickly integrated Dynamic Yield's   technology into some of its stores after the acquisition. It   installed \"Decision Logic\" technology on digital menu boards in   drive-throughs across multiple regions in the U.S., according to   CEO Steve Easterbrook during the chain's   second-quarter earnings call    . \"Customers have responded to the point of sale suggestive   selling by adding French fries, drinks, Chicken McNuggets, and   other favorites to their orders,\" he said, \"We're already seeing   an increase in average check by improving our ability to offer   customers what they are likely to want with suggestions based on   time of day, weather and items already in customers' orders.\" This goes beyond employee training or remembering to ask   customers about add-ons. It's a data-driven approach to driving   sales that will get smarter as it gets more data, in theory   tailoring operations to each market, or even each store. McDonald's brought the Dynamic Yield technology to Australia   recently, and plans to have it in 8,000 U.S. locations in a few   weeks (up from 700 at the time of the       earnings call    ). Easterbrook expects it to be in nearly 100% of the chain's   drive-throughs by the end of the year. \" This is another example of using technology to create more   engaging experiences for our guests,\" he said. \" Digital   capabilities change by the day and impact what customers   ultimately expect from us. The technological ecosystem we're   building will enable us to meet these rising expectations,   positioning us for new opportunities to elevate and transform the   customer experience.\" Is this a smart move?  McDonald's    has shown that consumers want to order more, but there's some   shame associated with doing so. Digital orders and orders placed   on kiosks are generally larger than those place directly to   another human. This type of menu board suggestion could serve as   a sort of permission to indulge or add something to an order. Perhaps more importantly, low-level retail clerks can be   clumsy when it comes to offering an upsell. McDonald's can train   them to do something -- such as ask if a customer wants an apple   pie with their order -- but that's about the limit. This type of   artificial intelligence-driven software will allow the company to   offer dynamic suggestions that even well-trained employees would   not be able to offer, and that should lead to higher checks, as   well as more satisfied customers.   10 stocks we like better than McDonald's       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and McDonald's wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Daniel B. Kline      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Most restaurant teach waiters and order takers to attempt to   upsell their customers. That can be a subtle line delivered   naturally like \"and would you like a beverage with your meal?\",   or clumsier attempts that seem to offer the whole menu.",
    "When properly done, upselling either subtly gives the consumer   permission to add a little something extra without shame (yes, I   would like whipped cream on that) or reminds them to order   something they do actually want. It's not an easy technique to   master, and when done wrong it can irritate customers.",
    "That's why   McDonald's    (NYSE: MCD) has found a way to take people out of the upsell   process. In April the company bought a technology company,   Dynamic Yield, that allows it to offer more dynamic menu boards   that lead customers to make bigger purchases.",
    "  McDonald's has been adapting new technologies. Image source:     McDonald's. ",
    "McDonald's has been adapting new technologies. Image source:     McDonald's.",
    "The fast-food chain quickly integrated Dynamic Yield's   technology into some of its stores after the acquisition. It   installed \"Decision Logic\" technology on digital menu boards in   drive-throughs across multiple regions in the U.S., according to   CEO Steve Easterbrook during the chain's   second-quarter earnings call    .",
    "\"Customers have responded to the point of sale suggestive   selling by adding French fries, drinks, Chicken McNuggets, and   other favorites to their orders,\" he said, \"We're already seeing   an increase in average check by improving our ability to offer   customers what they are likely to want with suggestions based on   time of day, weather and items already in customers' orders.\"",
    "This goes beyond employee training or remembering to ask   customers about add-ons. It's a data-driven approach to driving   sales that will get smarter as it gets more data, in theory   tailoring operations to each market, or even each store.",
    "McDonald's brought the Dynamic Yield technology to Australia   recently, and plans to have it in 8,000 U.S. locations in a few   weeks (up from 700 at the time of the       earnings call    ). Easterbrook expects it to be in nearly 100% of the chain's   drive-throughs by the end of the year.",
    "\" This is another example of using technology to create more   engaging experiences for our guests,\" he said. \" Digital   capabilities change by the day and impact what customers   ultimately expect from us. The technological ecosystem we're   building will enable us to meet these rising expectations,   positioning us for new opportunities to elevate and transform the   customer experience.\"",
    " McDonald's    has shown that consumers want to order more, but there's some   shame associated with doing so. Digital orders and orders placed   on kiosks are generally larger than those place directly to   another human. This type of menu board suggestion could serve as   a sort of permission to indulge or add something to an order.",
    "Perhaps more importantly, low-level retail clerks can be   clumsy when it comes to offering an upsell. McDonald's can train   them to do something -- such as ask if a customer wants an apple   pie with their order -- but that's about the limit. This type of   artificial intelligence-driven software will allow the company to   offer dynamic suggestions that even well-trained employees would   not be able to offer, and that should lead to higher checks, as   well as more satisfied customers.",
    "  10 stocks we like better than McDonald's       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and McDonald's wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than McDonald's       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and McDonald's wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Daniel B. Kline      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:00:00"
}