{
  "url": "https://www.nasdaq.com/article/is-carriage-services-csv-stock-undervalued-right-now-cm1207216",
  "title": "Is Carriage Services (CSV) Stock Undervalued Right Now? - Nasdaq.com",
  "text": [
    " Here at Zacks, we focus on our proven ranking system, which places an emphasis on earnings estimates and estimate revisions, to find winning stocks. But we also understand that investors develop their own strategies, so we are constantly looking at the latest trends in value, growth, and momentum to find strong companies for our readers. Of these, perhaps no stock market trend is more popular than value investing, which is a strategy that has proven to be successful in all sorts of market environments. Value investors rely on traditional forms of analysis on key valuation metrics to find stocks that they believe are undervalued, leaving room for profits. Luckily, Zacks has developed its own Style Scores system in an effort to find stocks with specific traits. Value investors will be interested in the system's \"Value\" category. Stocks with both \"A\" grades in the Value category and high Zacks Ranks are among the strongest value stocks on the market right now. Carriage Services (CSV) is a stock many investors are watching right now. CSV is currently sporting a Zacks Rank of #2 (Buy) and an A for Value. The stock is trading with P/E ratio of 13.95 right now. For comparison, its industry sports an average P/E of 14.93. Over the last 12 months, CSV's Forward P/E has been as high as 16.76 and as low as 10.45, with a median of 13.56. Investors will also notice that CSV has a PEG ratio of 0.93. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. CSV's industry has an average PEG of 1.29 right now. CSV's PEG has been as high as 1.12 and as low as 0.70, with a median of 0.90, all within the past year. Another valuation metric that we should highlight is CSV's P/B ratio of 1.68. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. This stock's P/B looks solid versus its industry's average P/B of 3.49. Over the past 12 months, CSV's P/B has been as high as 1.89 and as low as 1.15, with a median of 1.54. These are just a handful of the figures considered in Carriage Services's great Value grade. Still, they help show that the stock is likely being undervalued at the moment. Add this to the strength of its earnings outlook, and we can clearly see that CSV is an impressive value stock right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Carriage Services, Inc. (CSV): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Here at Zacks, we focus on our proven ranking system, which places an emphasis on earnings estimates and estimate revisions, to find winning stocks. But we also understand that investors develop their own strategies, so we are constantly looking at the latest trends in value, growth, and momentum to find strong companies for our readers.",
    "Of these, perhaps no stock market trend is more popular than value investing, which is a strategy that has proven to be successful in all sorts of market environments. Value investors rely on traditional forms of analysis on key valuation metrics to find stocks that they believe are undervalued, leaving room for profits.",
    "Luckily, Zacks has developed its own Style Scores system in an effort to find stocks with specific traits. Value investors will be interested in the system's \"Value\" category. Stocks with both \"A\" grades in the Value category and high Zacks Ranks are among the strongest value stocks on the market right now.",
    "Carriage Services (CSV) is a stock many investors are watching right now. CSV is currently sporting a Zacks Rank of #2 (Buy) and an A for Value. The stock is trading with P/E ratio of 13.95 right now. For comparison, its industry sports an average P/E of 14.93. Over the last 12 months, CSV's Forward P/E has been as high as 16.76 and as low as 10.45, with a median of 13.56.",
    "Investors will also notice that CSV has a PEG ratio of 0.93. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. CSV's industry has an average PEG of 1.29 right now. CSV's PEG has been as high as 1.12 and as low as 0.70, with a median of 0.90, all within the past year.",
    "Another valuation metric that we should highlight is CSV's P/B ratio of 1.68. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. This stock's P/B looks solid versus its industry's average P/B of 3.49. Over the past 12 months, CSV's P/B has been as high as 1.89 and as low as 1.15, with a median of 1.54.",
    "These are just a handful of the figures considered in Carriage Services's great Value grade. Still, they help show that the stock is likely being undervalued at the moment. Add this to the strength of its earnings outlook, and we can clearly see that CSV is an impressive value stock right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:10:11"
}