{
  "url": "https://www.nasdaq.com/article/match-group-mtch-stock-sinks-as-market-gains-what-you-should-know-cm1210783",
  "title": "Match Group (MTCH) Stock Sinks As Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Match Group (MTCH) closed at $74.83 in the latest trading session, marking a -0.94% move from the prior day. This move lagged the S&P 500's daily gain of 0.72%. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%. Coming into today, shares of the online dating company had lost 6.28% in the past month. In that same time, the Computer and Technology sector gained 2.17%, while the S&P 500 gained 2.25%. MTCH will be looking to display strength as it nears its nex t earnings  release. On that day, MTCH is projected to report earnings of $0.47 per share, which would represent year-over-year growth of 20.51%. Our most recent consensus estimate is calling for quarterly revenue of $541.38 million, up 21.95% from the year-ago period. MTCH's full-year Zacks Consensus Estimates are calling for earnings of $1.97 per share and revenue of $2.07 billion. These results would represent year-over-year changes of +29.61% and +19.48%, respectively. Investors might also notice recent changes to analyst estimates for MTCH. These recent revisions tend to reflect the evolving nature of short-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Based on our research, we believe these estimate revisions are directly related to near-team stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Within the past 30 days, our consensus EPS projection remained stagnant. MTCH is currently sporting a Zacks Rank of #3 (Hold). Investors should also note MTCH's current valuation metrics, including its Forward P/E ratio of 38.27. For comparison, its industry has an average Forward P/E of 26.57, which means MTCH is trading at a premium to the group. Also, we should mention that MTCH has a PEG ratio of 2.29. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. MTCH's industry had an average PEG ratio of 2.38 as of yesterday's close. The Internet - Services industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 173, putting it in the bottom 33% of all 250+ industries. The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. To follow MTCH in the coming trading sessions, be sure to utilize Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Match Group, Inc. (MTCH): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Match Group (MTCH) closed at $74.83 in the latest trading session, marking a -0.94% move from the prior day. This move lagged the S&P 500's daily gain of 0.72%. Meanwhile, the Dow gained 0.85%, and the Nasdaq, a tech-heavy index, added 1.06%.",
    "Coming into today, shares of the online dating company had lost 6.28% in the past month. In that same time, the Computer and Technology sector gained 2.17%, while the S&P 500 gained 2.25%.",
    "MTCH will be looking to display strength as it nears its nex t earnings  release. On that day, MTCH is projected to report earnings of $0.47 per share, which would represent year-over-year growth of 20.51%. Our most recent consensus estimate is calling for quarterly revenue of $541.38 million, up 21.95% from the year-ago period.",
    "MTCH's full-year Zacks Consensus Estimates are calling for earnings of $1.97 per share and revenue of $2.07 billion. These results would represent year-over-year changes of +29.61% and +19.48%, respectively.",
    "Investors might also notice recent changes to analyst estimates for MTCH. These recent revisions tend to reflect the evolving nature of short-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.",
    "Based on our research, we believe these estimate revisions are directly related to near-team stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Within the past 30 days, our consensus EPS projection remained stagnant. MTCH is currently sporting a Zacks Rank of #3 (Hold).",
    "Investors should also note MTCH's current valuation metrics, including its Forward P/E ratio of 38.27. For comparison, its industry has an average Forward P/E of 26.57, which means MTCH is trading at a premium to the group.",
    "Also, we should mention that MTCH has a PEG ratio of 2.29. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. MTCH's industry had an average PEG ratio of 2.38 as of yesterday's close.",
    "The Internet - Services industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 173, putting it in the bottom 33% of all 250+ industries.",
    "The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "To follow MTCH in the coming trading sessions, be sure to utilize Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:50:10"
}