{
  "url": "https://www.nasdaq.com/article/jeff-clarks-market-minute-heres-the-biggest-mistake-new-traders-make-cm1206828",
  "title": "Jeff Clark’s Market Minute: Here’s the Biggest Mistake New Traders Make - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Most people say option trading is risky.",
    "Novice traders often don't take the time to learn the right way to use options. They jump right in - thinking, \"I got this.\"",
    "They gamble, blow up their accounts, and then walk away penniless and swearing off options forever.",
    "Even experienced traders sometimes get caught up in the allure of fast gains. They overleverage their positions - take a bigger position size than they should - and then take a hit. All the option traders I know, including myself, have blown up their accounts at least once.",
    "But it's not the option that's risky… it's the strategy. And when used the right way, options are far less risky than trading stocks.",
    "You see, most people use options the wrong way. Most people use options to increase leverage… to get more \"bang for their buck.\" In other words, most people use options to increase risk.",
    "That's wrong. That's the exact opposite of what options were designed for.",
    "The options market was created so investors could  reduce risk . Options allow investors to hedge their positions… and to risk much less money than they would buying a stock outright.",
    "Let's say you want to buy stock in Company X. It trades for $10 a share. You could put up $1,000 to buy 100 shares… But you can control the same amount of stock with one option contract. You can buy a contract for, let's say, $50… and leave the other $950 in your account.",
    "If Company X's stock goes up, you'll make money. If the stock goes down, the most you'll ever lose is that $50. That's a 100% loss… but it's a lot less than potentially losing 20% or more of the $1,000 you risked buying the stock.",
    "This is a simple example. And it's the simplicity that proves my point. Options allow you to risk much less and profit just as much as you would when buying stocks.",
    "But that benefit disappears if you overleverage the trade and take on a larger position with options than you would otherwise take with the stock.",
    "That's the biggest mistake most novice option traders make. Instead of replacing a 100-share purchase with one call option, they take the entire amount they would have allocated to the stock and buy a much larger position with the options.",
    "Rather than buying one call option for $50 and leaving the remaining $950 in the bank, novice traders take the entire $1,000 and put it into buying more call options.",
    "They end up buying 20 call options to try to get more bang for their buck. What would have been a 100-share purchase has turned into control of 2,000 shares. Instead of using options to reduce risk, they've increased their risk 20 times.",
    "Losing 100% on an overleveraged trade would be a disaster. And it's why most folks think option trading is dangerous. But it's not dangerous if you trade options the way they were originally intended…  as a way to reduce risk .",
    "Limit your option exposure to control just the number of shares you would normally purchase. Leave the rest of the money in the bank. Then it won't be so bad to lose 100% on an option trade.",
    "It will almost always turn out better than what you could have lost on the stock.",
    "Best regards and good trading,",
    "Jeff Clark",
    "P.S.  Trading options isn't inherently risky… It all depends on the strategy you use. And the strategy I recently uncovered in the gold market could make you a fortune… no matter what gold does.",
    "You see, it's one thing to make money on gold by holding long-term investments or buying bullion. And you wouldn't be wrong to consider those options. But what I've uncovered could make you up to five or 10 times more money on gold than those \"buy-and-hold\" investments.",
    "I want my  Market Minute  readers to be the first to have access to this strategy, so I'll be sharing this information later on this week. So, keep an eye on your inbox for that.",
    "America's Top Options Expert",
    "For the past 36 years, millionaire trader Jeff Clark's options strategies have helped everyday people have the chance to retire wealthy.",
    "Which is why Jeff's now offering his complete Blueprint, and a year of his guidance, for just $19.",
    "That's right… for a limited time it's all yours for less than 20 bucks.",
    "Because Jeff knows that every $1 you use on his strategies could turn into a windfall in a short amount of time.",
    "Get started here.",
    "The post Jeff Clark's Market Minute: Here's the Biggest Mistake New Traders Make appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:29:40"
}