{
  "url": "https://www.nasdaq.com/article/waste-management-wm-stock-sinks-as-market-gains-what-you-should-know-cm1210788",
  "title": "Waste Management (WM) Stock Sinks As Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Waste Management (WM) closed the most recent trading day at $112.18, moving -1.32% from the previous trading session. This change lagged the S&P 500's daily gain of 0.72%. At the same time, the Dow added 0.85%, and the tech-heavy Nasdaq gained 1.06%. Prior to today's trading, shares of the garbage and recycling hauler had lost 4.49% over the past month. This has lagged the Business Services sector's loss of 1.19% and the S&P 500's gain of 2.25% in that time. WM will be looking to display strength as it nears its nex t earnings  release. In tha t report  , analysts expect WM to post earnings of $1.15 per share. This would mark no growth from the year-ago period. Our most recent consensus estimate is calling for quarterly revenue of $4 billion, up 4.58% from the year-ago period. Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $4.33 per share and revenue of $15.63 billion. These totals would mark changes of +3.1% and +4.81%, respectively, from last year. Any recent changes to analyst estimates for WM should also be noted by investors. Recent revisions tend to reflect the latest near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model. Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. WM is currently sporting a Zacks Rank of #3 (Hold). In terms of valuation, WM is currently trading at a Forward P/E ratio of 26.27. This valuation marks a discount compared to its industry's average Forward P/E of 27.44. It is also worth noting that WM currently has a PEG ratio of 3.07. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. Waste Removal Services stocks are, on average, holding a PEG ratio of 2.93 based on yesterday's closing prices. The Waste Removal Services industry is part of the Business Services sector. This industry currently has a Zacks Industry Rank of 83, which puts it in the top 33% of all 250+ industries. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Waste Management, Inc. (WM): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Waste Management (WM) closed the most recent trading day at $112.18, moving -1.32% from the previous trading session. This change lagged the S&P 500's daily gain of 0.72%. At the same time, the Dow added 0.85%, and the tech-heavy Nasdaq gained 1.06%.",
    "Prior to today's trading, shares of the garbage and recycling hauler had lost 4.49% over the past month. This has lagged the Business Services sector's loss of 1.19% and the S&P 500's gain of 2.25% in that time.",
    "WM will be looking to display strength as it nears its nex t earnings  release. In tha t report  , analysts expect WM to post earnings of $1.15 per share. This would mark no growth from the year-ago period. Our most recent consensus estimate is calling for quarterly revenue of $4 billion, up 4.58% from the year-ago period.",
    "Looking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $4.33 per share and revenue of $15.63 billion. These totals would mark changes of +3.1% and +4.81%, respectively, from last year.",
    "Any recent changes to analyst estimates for WM should also be noted by investors. Recent revisions tend to reflect the latest near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.",
    "Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. WM is currently sporting a Zacks Rank of #3 (Hold).",
    "In terms of valuation, WM is currently trading at a Forward P/E ratio of 26.27. This valuation marks a discount compared to its industry's average Forward P/E of 27.44.",
    "It is also worth noting that WM currently has a PEG ratio of 3.07. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. Waste Removal Services stocks are, on average, holding a PEG ratio of 2.93 based on yesterday's closing prices.",
    "The Waste Removal Services industry is part of the Business Services sector. This industry currently has a Zacks Industry Rank of 83, which puts it in the top 33% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Make sure to utilize Zacks. Com to follow all of these stock-moving metrics, and more, in the coming trading sessions.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 05:45:28"
}