{
  "url": "https://www.nasdaq.com/article/venezuelas-guaido-backs-use-of-satellites-to-track-guerrillas-20190903-01029",
  "title": "Venezuela's Guaido backs use of satellites to track guerrillas - Nasdaq.com",
  "text": [
    "CARACAS, Sept 3 (Reuters) - Venezuela's opposition leader Juan Guaido on Tuesday backed the use of satellites to help locate guerrilla groups that have crossed into Venezuela from neighboring Colombia, days after dissident rebels launched a new offensive.",
    "Former FARC guerillas on Thursday announced a rearmament in a video that Colombian authorities believe was filmed in Venezuela, spurring concern of a worsening of the Colombian armed conflict and expansion of armed groups in Venezuela. ",
    "\"We are going to authorize the use of satellite technology to facilitate the location of these irregular groups, of camps within the country's borders,\" Guaido said in a televised presentation.",
    "Guaido in January invoked the constitution to assume an interim presidency after declaring President Nicolas Maduro's 2018 re-election a farce.",
    "He has been recognized by more than 50 countries, including the United States and Colombia, as Venezuela's legitimate president, but does not control state institutions.",
    "Colombian President Ivan Duque has promised to persecute the rebel group, whose leaders said they were returning to armed struggle because Duque had betrayed the 2016 peace accord that lead to the FARC's demobilization.",
    "Venezuela's information ministry did not immediately respond to a request for comment.",
    "Maduro in July said two former FARC leaders, whose whereabouts at the time where unknown, were welcome in Venezuela. The two later appeared in the video announcing rearmament.",
    "The United States, which has launched a broad set of sanctions against Maduro's government in efforts to hasten his departure, says Venezuela's government provides a safe haven to Colombian rebel groups. "
  ],
  "published_datetime": "2019-09-03 15:21:00"
}