{
  "url": "https://www.nasdaq.com/article/a-spread-of-top-dividend-growth-etfs-for-your-portfolio-cm1207297",
  "title": "A Spread of Top Dividend Growth ETFs for Your Portfolio - Nasdaq.com",
  "text": [
    " Amid the stock market chaos triggered by trade tensions, global growth concerns, inversion of the yield curve and the collapse in yields, dividend focused ETFs seem to be the perfect choice.  makeAd('4','300x250','mktsnews','vanguard','','');  This is because these products offer payouts and stability in the form of mature companies that are less susceptible to the large swings in stock prices. The dividend-paying securities are the major sources of consistent income for investors when returns from equity markets are at risk. Further, these products are proven outperformers over the long term (read: 5 ETF Zones to Take Shelter From Trade War  ).    While there are plenty of options in the dividend ETF world, zeroing in on the 'dividend aristocrats' or the 'dividend growers' could be the most beneficial way to ride out the current market volatility resulting from political and geopolitical worries.   Why Dividend Aristocrats?    Dividend aristocrats are the blue-chip dividend-paying companies that have a long history of raising dividend payments year over year. These generally act as a hedge against economic uncertainty and provide downside protection by offering outsized payouts or sizable yields on a regular basis. Additionally, aristocrats tend to skew the portfolio to less volatile sectors and mature companies.    Investors should note that the dividend aristocrat funds offer more dividend growth opportunities when compared to the other products in the space but might not necessarily have the highest yields. Further, these products lead to a healthy portfolio with a greater scope of capital appreciation as opposed to simple dividend paying stocks or those with high yields (read: Why You Should Invest in Dividend Growth ETFs Now  ).    As a result, these products provide a nice combination of annual dividend growth and capital appreciation opportunity and are mainly suitable for risk adverse long-term investors. For them, we have presented a bunch of ETFs with a solid Zacks ETF Rank #1 (Strong Buy) or #2 (Buy) that are likely to outperform in the coming weeks, especially amid the current turmoil.   Vanguard Dividend Appreciation ETF VIG     This is the largest and most-popular ETF in the dividend space with AUM of $37.5 billion and average daily volume of about 836,000 shares. The fund follows the NASDAQ US Dividend Achievers Select Index, which is composed of high quality stocks that have a record of raising dividends every year. It holds 184 securities in the basket and charges 6 basis points (bps) in annual fees. VIG has a Zacks ETF Rank #1 with a Medium risk outlook.   ProShares S&P 500 Aristocrats ETF NOBL     This product provides exposure to high-quality companies that have not just paid dividends but hiked the same for at least 25 consecutive years, with most doing so for 40 years or more. It follows the S&P 500 Dividend Aristocrats Index, holding 57 securities in its basket. NOBL has amassed $5.2 billion in its asset base and trades in a volume of around 463,000 shares a day on average. It has an expense ratio of 0.35% and has a Zacks ETF Rank #2 with a Medium risk outlook.   iShares Core Dividend Growth ETF DGRO     This fund provides exposure to companies having a history of sustained dividend growth by tracking the Morningstar US Dividend Growth Index. Holding 479 stocks in its basket, the fund has AUM of $8.1 billion and trades in good volumes of about 1.3 million shares. It charges 8 bps in fees per year and has a Zacks ETF Rank #1 with a Medium risk outlook (read: Red Hot Dividend ETFs of 2019  ).   First Trust NASDAQ Rising Dividend Achievers ETF RDVY     This fund provides exposure to a diversified portfolio of 50 companies with a history of paying dividends. It tracks the NASDAQ US Rising Dividend Achievers Index, charging investors 50 bps in annual fees. The ETF has accumulated $779.5 million in its asset base and sees a good volume of 118,000 shares a day on average. It has a Zacks ETF Rank #2 with a Medium risk outlook.   Invesco Dividend Achievers ETF PFM     With $303 million, this fund offers exposure to 260 stocks that have increased annual dividends for 10 or more consecutive fiscal years. It has expense ratio of 0.55% and average daily volume of 26,000 shares. PFM has a Zacks ETF Rank #2 with a Medium risk outlook.   First Trust SMID Cap Rising Dividend Achievers ETF SDVY     This fund offers exposure to 99 small and mid-cap companies with a history of raising dividends and are likely to continue doing so in the future by tracking the NASDAQ US Small Mid Cap Rising Dividend Achievers Index. The ETF charges 60 bps and has accumulated $6.8 million in its asset base. It has a Zacks ETF Rank #2 (read: Earn 5% Yields or More With These Dividend ETFs & Stocks  ).   DIVCON Leaders Dividend ETF LEAD     This fund invests in only the anticipated dividend growth leaders, the large-cap companies with the highest probability of increasing dividends in the next 12 months. It follows the Reality Shares DIVCON Leaders Dividend Index, holding 61 stocks in its basket. The product has amassed $34.8 million in its asset base and charges 43 bps in annual fees. It trades in average daily volume of 4,000 shares and has a Zacks ETF Rank #2.   Want key ETF info delivered straight to your inbox?    Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week. Get it free >>      Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Invesco Dividend Achievers ETF (PFM): ETF Research Reports   ProShares S&P 500 Dividend Aristocrats ETF (NOBL): ETF Research Reports   Vanguard Dividend Appreciation ETF (VIG): ETF Research Reports   Reality Shares DIVCON Leaders Dividend ETF (LEAD): ETF Research Reports   iShares Core Dividend Growth ETF (DGRO): ETF Research Reports   First Trust SMID Cap Rising Dividend Achievers ETF (SDVY): ETF Research Reports   First Trust Rising Dividend Achievers ETF (RDVY): ETF Research Reports   To read this article on Zacks.com click here. ",
    "Amid the stock market chaos triggered by trade tensions, global growth concerns, inversion of the yield curve and the collapse in yields, dividend focused ETFs seem to be the perfect choice.  makeAd('4','300x250','mktsnews','vanguard','','');  This is because these products offer payouts and stability in the form of mature companies that are less susceptible to the large swings in stock prices. The dividend-paying securities are the major sources of consistent income for investors when returns from equity markets are at risk. Further, these products are proven outperformers over the long term (read: 5 ETF Zones to Take Shelter From Trade War  ).    While there are plenty of options in the dividend ETF world, zeroing in on the 'dividend aristocrats' or the 'dividend growers' could be the most beneficial way to ride out the current market volatility resulting from political and geopolitical worries.   Why Dividend Aristocrats?    Dividend aristocrats are the blue-chip dividend-paying companies that have a long history of raising dividend payments year over year. These generally act as a hedge against economic uncertainty and provide downside protection by offering outsized payouts or sizable yields on a regular basis. Additionally, aristocrats tend to skew the portfolio to less volatile sectors and mature companies.    Investors should note that the dividend aristocrat funds offer more dividend growth opportunities when compared to the other products in the space but might not necessarily have the highest yields. Further, these products lead to a healthy portfolio with a greater scope of capital appreciation as opposed to simple dividend paying stocks or those with high yields (read: Why You Should Invest in Dividend Growth ETFs Now  ).    As a result, these products provide a nice combination of annual dividend growth and capital appreciation opportunity and are mainly suitable for risk adverse long-term investors. For them, we have presented a bunch of ETFs with a solid Zacks ETF Rank #1 (Strong Buy) or #2 (Buy) that are likely to outperform in the coming weeks, especially amid the current turmoil.   Vanguard Dividend Appreciation ETF VIG     This is the largest and most-popular ETF in the dividend space with AUM of $37.5 billion and average daily volume of about 836,000 shares. The fund follows the NASDAQ US Dividend Achievers Select Index, which is composed of high quality stocks that have a record of raising dividends every year. It holds 184 securities in the basket and charges 6 basis points (bps) in annual fees. VIG has a Zacks ETF Rank #1 with a Medium risk outlook.   ProShares S&P 500 Aristocrats ETF NOBL     This product provides exposure to high-quality companies that have not just paid dividends but hiked the same for at least 25 consecutive years, with most doing so for 40 years or more. It follows the S&P 500 Dividend Aristocrats Index, holding 57 securities in its basket. NOBL has amassed $5.2 billion in its asset base and trades in a volume of around 463,000 shares a day on average. It has an expense ratio of 0.35% and has a Zacks ETF Rank #2 with a Medium risk outlook.   iShares Core Dividend Growth ETF DGRO     This fund provides exposure to companies having a history of sustained dividend growth by tracking the Morningstar US Dividend Growth Index. Holding 479 stocks in its basket, the fund has AUM of $8.1 billion and trades in good volumes of about 1.3 million shares. It charges 8 bps in fees per year and has a Zacks ETF Rank #1 with a Medium risk outlook (read: Red Hot Dividend ETFs of 2019  ).   First Trust NASDAQ Rising Dividend Achievers ETF RDVY     This fund provides exposure to a diversified portfolio of 50 companies with a history of paying dividends. It tracks the NASDAQ US Rising Dividend Achievers Index, charging investors 50 bps in annual fees. The ETF has accumulated $779.5 million in its asset base and sees a good volume of 118,000 shares a day on average. It has a Zacks ETF Rank #2 with a Medium risk outlook.   Invesco Dividend Achievers ETF PFM     With $303 million, this fund offers exposure to 260 stocks that have increased annual dividends for 10 or more consecutive fiscal years. It has expense ratio of 0.55% and average daily volume of 26,000 shares. PFM has a Zacks ETF Rank #2 with a Medium risk outlook.   First Trust SMID Cap Rising Dividend Achievers ETF SDVY     This fund offers exposure to 99 small and mid-cap companies with a history of raising dividends and are likely to continue doing so in the future by tracking the NASDAQ US Small Mid Cap Rising Dividend Achievers Index. The ETF charges 60 bps and has accumulated $6.8 million in its asset base. It has a Zacks ETF Rank #2 (read: Earn 5% Yields or More With These Dividend ETFs & Stocks  ).   DIVCON Leaders Dividend ETF LEAD     This fund invests in only the anticipated dividend growth leaders, the large-cap companies with the highest probability of increasing dividends in the next 12 months. It follows the Reality Shares DIVCON Leaders Dividend Index, holding 61 stocks in its basket. The product has amassed $34.8 million in its asset base and charges 43 bps in annual fees. It trades in average daily volume of 4,000 shares and has a Zacks ETF Rank #2.   Want key ETF info delivered straight to your inbox?    Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week. Get it free >>   ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:05:00"
}