{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-nrg-pennymac-arbor-realty-mi-homes-and-viad-cm1207190",
  "title": "The Zacks Analyst Blog Highlights: NRG, PennyMac, Arbor Realty, M/I Homes and Viad - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 4, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: NRG Energy Inc. NRG  , PennyMac Mortgage Investment Trust. PMT  , Arbor Realty Trust Inc. ABR  , M/I Homes Inc. MHO  and Viad Corp. VVI  .  Here are highlights from Tuesday's Analyst Blog:    Fed to Determine Wall Street's Course in September: 5     Picks   After completing a choppy August, market participants are extremely cautious about an uncertain September. Volatility in August was so severe that the broad-market S&P 500 Index recorded 11 moves of more than 1% in either direction in the 22 trading days of the month. It witnessed three declines of larger than 2.6%, including a 3% fall on Aug 5, the largest daily drop of the benchmark index so far in 2019. Wall Street will start its innings in September with a series of risk factors. Renewed tariff war between the United States and China, global economic slowdown, geopolitical conflicts are the major headwinds. However, the biggest event to watch will be the Fed's upcoming FOMC meeting this month, which will likely to guide investors' decisions for the next couple of months.  Stock Market's Major Sources of Risks  The tariff war between the United States and China intensified from Sep 1, as the U.S. government imposed 15% tariff on nearly $112 billion of Chinese goods. Most of these items are consumer products and various U.S. companies have already said that they have no option but to shift higher input costs to customers. Consequently, consumer spending, which jumped 0.6% in July, is likely to suffer a setback going forward. Notably, personal consumption constitutes two-third of the U.S. GDP. Meanwhile, lingering trade war between the two largest trading nations of the world, is leading toward a global economic slowdown. Germany and Italy, the biggest two economies of the Eurozone, are facing manufacturing contraction for several months. The U.K.'s GDP shrank in the second quarter. In Asia, China is increasingly facing the heat of the trade war with the United States. Aside from China, major Asian economies like Japan, South Korea and Taiwan recently warned about a slowdown due to the trade tussle. Risk can also arise from various geopolitical conflicts. Possibility of a no-deal Brexit, political turmoil in Italy and Argentina, nationwide agitation for democracy in Hong Kong and oil-related conflict between the United States and Iran, can cause volatility as well. Growing risk of stock market is forcing investors to get rid of risky assets like equities and invest in safe-haven government bonds. Globally, more than $16 trillion has been invested so far in 2019 in bonds with negative returns compared with $8 trillion at the end of 2018. This clearly indicates worldwide recessionary fears among market participants.  Fed to Play Lead Role  Irrespective of the above-mentioned concerns, it is Fed and only Fed, which is likely to be the major source of Wall Street's risk as well as the reason for stock rally in September. The Fed will meet on Sep 17-18 for its upcoming FOMC meeting. The central bank's decision on benchmark interest rate will not only impact the market, but also determine investors' sentiment and decisions the most with its opinion on the economic situation and expectations of future economic activities. This was clearly visible when an expected rate cut of 25 basis points resulted in a stock market decline after Fed Chair Jerome Powell said that the rate cut is simply a mid-cycle correction. However, Powell later reiterated the central bank's pledge to do whatever needed to ensure the ongoing expansion of the U.S. economy. The U.S. economy is currently facing a dichotomy. The consumer and labor markets are doing extremely well while the business segment, especially manufacturing, remained tepid owing to a prolonged trade dispute. Higher input costs and inability of management to plan properly due to frequent change of government decisions resulted in a slowdown in business investment. Moreover, the PCE Price Index -- Fed's favorite gauge of inflation -- was 1.4% in July, well below the central bank's target rate of 2%. A lower interest rate means low cost of funds for both businesses and investors. This will result in higher business investment to promote growth. As of Sep 3, 100% respondents of the CME FedWatch are expecting a second rate cut in September. While 97.3% are expecting a reduction of 25 basis points, a handful 2.7% are looking for a 50 basis point rate cut.  Our Top Picks  Under these circumstances, rate-sensitive investments like utilities, REITs, home builders and business services, with strong growth potential, will be prudent. We narrowed down our search to five such stocks, each carrying a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .  NRG Energy Inc.  is the leading integrated power company in the United States, built on the strength of its diverse competitive electric generation portfolio and leading retail electricity platform. It is involved in the producing, selling and delivering electricity and related products and services residential, industrial and commercial consumers. The company has expected earnings growth of 67.6% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 4.9% over the last 30 days.  PennyMac Mortgage Investment Trust.  invests primarily in residential mortgage loans and mortgage-related assets in the United States. Its Correspondent Production segment engages in purchasing, pooling and reselling newly originated prime credit mortgage loans directly or in the form of mortgage-backed securities. The company has expected earnings growth of 11.6% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 2.8% over the last 30 days.  Arbor Realty Trust Inc.  invests in a diversified portfolio of structured finance assets in the multifamily and commercial real estate markets. The company operates in two segments, Structured Business and Agency Business. The company has expected earnings growth of 9.9% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 8.1% over the last 30 days.  M/I Homes Inc.  operates as a builder of single-family homes in different states of the United States. It operates through Midwest Homebuilding, Southern Homebuilding, Mid-Atlantic Homebuilding and Financial Services segments. The company has expected earnings growth of 15.1% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 9% over the last 60 days.  Viad Corp.  operates as an experiential services company in the United States, Canada, the United Kingdom, continental Europe, and the United Arab Emirates. It operates in two business groups, GES and Pursuit. The company has expected earnings growth of 15% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 5.1% over the last 60 days.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>   Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  NRG Energy, Inc. (NRG): Free Stock Analysis Report   Viad Corp (VVI): Free Stock Analysis Report   M/I Homes, Inc. (MHO): Free Stock Analysis Report   Arbor Realty Trust (ABR): Free Stock Analysis Report   PennyMac Mortgage Investment Trust (PMT): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 4, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: NRG Energy Inc. NRG  , PennyMac Mortgage Investment Trust. PMT  , Arbor Realty Trust Inc. ABR  , M/I Homes Inc. MHO  and Viad Corp. VVI  .",
    " Here are highlights from Tuesday's Analyst Blog: ",
    "  Fed to Determine Wall Street's Course in September: 5     Picks  ",
    "After completing a choppy August, market participants are extremely cautious about an uncertain September. Volatility in August was so severe that the broad-market S&P 500 Index recorded 11 moves of more than 1% in either direction in the 22 trading days of the month. It witnessed three declines of larger than 2.6%, including a 3% fall on Aug 5, the largest daily drop of the benchmark index so far in 2019.",
    "Wall Street will start its innings in September with a series of risk factors. Renewed tariff war between the United States and China, global economic slowdown, geopolitical conflicts are the major headwinds. However, the biggest event to watch will be the Fed's upcoming FOMC meeting this month, which will likely to guide investors' decisions for the next couple of months.",
    " Stock Market's Major Sources of Risks ",
    "The tariff war between the United States and China intensified from Sep 1, as the U.S. government imposed 15% tariff on nearly $112 billion of Chinese goods. Most of these items are consumer products and various U.S. companies have already said that they have no option but to shift higher input costs to customers. Consequently, consumer spending, which jumped 0.6% in July, is likely to suffer a setback going forward. Notably, personal consumption constitutes two-third of the U.S. GDP.",
    "Meanwhile, lingering trade war between the two largest trading nations of the world, is leading toward a global economic slowdown. Germany and Italy, the biggest two economies of the Eurozone, are facing manufacturing contraction for several months. The U.K.'s GDP shrank in the second quarter.",
    "In Asia, China is increasingly facing the heat of the trade war with the United States. Aside from China, major Asian economies like Japan, South Korea and Taiwan recently warned about a slowdown due to the trade tussle.",
    "Risk can also arise from various geopolitical conflicts. Possibility of a no-deal Brexit, political turmoil in Italy and Argentina, nationwide agitation for democracy in Hong Kong and oil-related conflict between the United States and Iran, can cause volatility as well.",
    "Growing risk of stock market is forcing investors to get rid of risky assets like equities and invest in safe-haven government bonds. Globally, more than $16 trillion has been invested so far in 2019 in bonds with negative returns compared with $8 trillion at the end of 2018. This clearly indicates worldwide recessionary fears among market participants.",
    " Fed to Play Lead Role ",
    "Irrespective of the above-mentioned concerns, it is Fed and only Fed, which is likely to be the major source of Wall Street's risk as well as the reason for stock rally in September. The Fed will meet on Sep 17-18 for its upcoming FOMC meeting.",
    "The central bank's decision on benchmark interest rate will not only impact the market, but also determine investors' sentiment and decisions the most with its opinion on the economic situation and expectations of future economic activities.",
    "This was clearly visible when an expected rate cut of 25 basis points resulted in a stock market decline after Fed Chair Jerome Powell said that the rate cut is simply a mid-cycle correction. However, Powell later reiterated the central bank's pledge to do whatever needed to ensure the ongoing expansion of the U.S. economy.",
    "The U.S. economy is currently facing a dichotomy. The consumer and labor markets are doing extremely well while the business segment, especially manufacturing, remained tepid owing to a prolonged trade dispute. Higher input costs and inability of management to plan properly due to frequent change of government decisions resulted in a slowdown in business investment.",
    "Moreover, the PCE Price Index -- Fed's favorite gauge of inflation -- was 1.4% in July, well below the central bank's target rate of 2%. A lower interest rate means low cost of funds for both businesses and investors. This will result in higher business investment to promote growth.",
    "As of Sep 3, 100% respondents of the CME FedWatch are expecting a second rate cut in September. While 97.3% are expecting a reduction of 25 basis points, a handful 2.7% are looking for a 50 basis point rate cut.",
    " Our Top Picks ",
    "Under these circumstances, rate-sensitive investments like utilities, REITs, home builders and business services, with strong growth potential, will be prudent. We narrowed down our search to five such stocks, each carrying a Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .",
    " NRG Energy Inc.  is the leading integrated power company in the United States, built on the strength of its diverse competitive electric generation portfolio and leading retail electricity platform. It is involved in the producing, selling and delivering electricity and related products and services residential, industrial and commercial consumers. The company has expected earnings growth of 67.6% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 4.9% over the last 30 days.",
    " PennyMac Mortgage Investment Trust.  invests primarily in residential mortgage loans and mortgage-related assets in the United States. Its Correspondent Production segment engages in purchasing, pooling and reselling newly originated prime credit mortgage loans directly or in the form of mortgage-backed securities. The company has expected earnings growth of 11.6% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 2.8% over the last 30 days.",
    " Arbor Realty Trust Inc.  invests in a diversified portfolio of structured finance assets in the multifamily and commercial real estate markets. The company operates in two segments, Structured Business and Agency Business. The company has expected earnings growth of 9.9% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 8.1% over the last 30 days.",
    " M/I Homes Inc.  operates as a builder of single-family homes in different states of the United States. It operates through Midwest Homebuilding, Southern Homebuilding, Mid-Atlantic Homebuilding and Financial Services segments. The company has expected earnings growth of 15.1% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 9% over the last 60 days.",
    " Viad Corp.  operates as an experiential services company in the United States, Canada, the United Kingdom, continental Europe, and the United Arab Emirates. It operates in two business groups, GES and Pursuit. The company has expected earnings growth of 15% for the current year. The Zacks Consensus Estimate for current-year earnings has moved up 5.1% over the last 60 days.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:27:00"
}