{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-kla-tencor-microsoft-alphabet-lattice-semiconductor-and-paypal-cm1206609",
  "title": "The Zacks Analyst Blog Highlights: KLA-Tencor, Microsoft, Alphabet, Lattice Semiconductor and PayPal - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 3, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: KLA-Tencor Corp. KLAC  , Microsoft Corp. MSFT  , Alphabet Inc. GOOGL  , Lattice Semiconductor Corp. LSCC  and PayPal Holdings Inc. PYPL  .  Here are highlights from Friday's Analyst Blog:    5 Top Tech Stocks on U.S.-China Trade Prospects   Wall Street has heaved a sigh of relief, at least for the time being, on the trade war front between the United States and China. U.S. stocks rallied following a hint from the Chinese government that it may not retaliate against a new set of tariffs imposed by President Donald Trump immediately. Rather, the Asian economic powerhouse will try to resolve the prolonging trade dispute calmly. The news bolstered the confidence of market participants on risky assets like equities. All three major stock indexes -- the Dow, the S&P 500 and the Nasdaq Composite -- surged 1.3%, 1.3% and 1.5%, respectively. Notably, within the broad market S&P 500 Index, the Technology Select Sector SPDR (XLK) gained 1.7%, the highest among total 11 sectors.  China Calls for \"Calm Attitude\" to Resolve Trade   Conflict  On Aug 29, Bloomberg reported that Gao Feng, spokesman for China's Ministry of Commerce, told reports in Beijing, \"We firmly reject an escalation of the trade war, and are willing to negotiate and collaborate in order to solve this problem with calm attitude.\" The statement for Chinese authority came just two days before the U.S. government is scheduled to impose new rate of tariffs on $550 billion of Chinese goods. Gao's statement clearly showed that the Asian economic giant is more eager to carry forward trade talks with its U.S. counterparts, instead of retaliating and escalating the situation further. Gao further said that the primary goal of his country is to remove new U.S. tariffs on Chinese imports. Additionally, in an interview with Fox News Radio, Donald Trump said that the United States and China are set to discuss trade dispute on Aug 29 \"at a different level.\" However, Trump stopped short of describing what \"a different level \"means. As per CNBC, a White House correspondence said \"both sides remain in communication at various levels.\" Notably, the tariff war between the two largest trading nations of the world heightened on Aug 23 after China announced that it will impose 5% to 10% tariff on another $75 billion of U.S. goods in two tranches, on Sep 1 and Dec 15. Additionally, a 25% tariff on U.S. auto products and auto parts will be imposed effective Dec 15. In retaliation, President Donald Trump decided to raise tariff to 30% from the existing 25% on $250 billion Chinese goods. Moreover, he also raised the tariff from 10% to 15%, which is to be levied on an additional $300 billion of Chinese exports effective Sep 1.  Why Trade Solution is Important for Tech Sector  China is the largest trading partner of the United States. Moreover, China plays the role of a low-cost supplier of intermediary products and other inputs to high-tech U.S. industries. In 2018, the Trump administration levied tariffs on Chinese goods worth $250 billion. Most of these products were from the high-tech industrial sectors. U.S. companies that rely on Chinese imports are unhappy about the move as it raised prices of high-tech equipment and several electronics products. On the other hand, a trade spat with the United States resulted in a significant slowdown of China's economy. However, a strong Chinese economy will give U.S. high-tech companies a solid boost as China is also the largest market for U.S. high-tech products. At this juncture, an amicable solution to the U.S.-China trade war is likely to restore Chinese and global economic growth, which in turn will create demand for high-tech U.S. products. Likewise, repeal of tariffs on Chinese intermediary goods will raise the profit margin of U.S. tech giants.  Our Top Picks  At this stage, it will be prudent to invest in technology stocks with a favorable Zacks Rank. We have narrowed down our search to five such tech stocks that have popped in the past six months despite facing trade-induced market volatility. Each of these stocks carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .  KLA-Tencor Corp.  designs, manufactures, and markets process control and yield-management solutions for the semiconductor and related nano-electronics industries worldwide. It provides advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. The company has an expected earnings growth rate of 11.4% for the current year. The Zacks Consensus Estimate for the current year has improved 3.7% over the last 30 days. The stock has jumped 26.4% in the past six months.  Microsoft Corp.  is a global software giant offering operating systems for computing devices, servers, phones, and other intelligent devices, server applications for distributed computing environments, cross-device productivity applications, business solution applications, desktop and server management tools, software development tools, video games and online advertising. The company has an expected earnings growth rate of 9.9% for the current year. The Zacks Consensus Estimate for the current year has improved 0.2% over the last 30 days. The stock has jumped 22.8% in the past six months.  Alphabet Inc.  is a global tech leader. It provides web-based search, advertisements, maps, software applications, mobile operating systems, consumer content, enterprise solutions, commerce and hardware products. The company has an expected earnings growth rate of 14.3% for the current year. The Zacks Consensus Estimate for the current year has improved 0.6% over the last 30 days. The stock has gained 3.9% in the past six months.  Lattice Semiconductor Corp  . develops and sells semiconductor technologies in Asia, Europe and the Americas. It offers field programmable gate arrays that consist of five product family lines, including the ECP, MachXO, iCE40, CrossLink, and programmable mixed signal devices. The company has an expected earnings growth rate of 72.7% for the current year. The Zacks Consensus Estimate for the current year has improved 11.8% over the last 30 days. The stock has skyrocketed 59.8% in the past six months.  PayPal Holdings Inc.  operates as a technology platform and digital payments company that enables digital and mobile payments on behalf of consumers and merchants worldwide. Its payment solutions include PayPal, PayPal Credit, Braintree, Venmo, Xoom and iZettle products. The company has an expected earnings growth rate of 29.3% for the current year. The Zacks Consensus Estimate for the current year has improved 4.7% over the last 60 days. The stock has soared 10.6% in the past six months.  Today's Best Stocks from Zacks  Would you like to see the updated picks from our best market-beating strategies? From 2017 through 2018, while the S&P 500 gained +15.8%, five of our screens returned +38.0%, +61.3%, +61.6%, +68.1% and +98.3%. This outperformance has not just been a recent phenomenon. From 2000 - 2018, while the S&P averaged +4.8% per year, our top strategies averaged up to +56.2% per year.   See their latest picks free >>   Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Alphabet Inc. (GOOGL): Free Stock Analysis Report   PayPal Holdings, Inc. (PYPL): Free Stock Analysis Report   Microsoft Corporation (MSFT): Free Stock Analysis Report   Lattice Semiconductor Corporation (LSCC): Free Stock Analysis Report   KLA-Tencor Corporation (KLAC): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 3, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: KLA-Tencor Corp. KLAC  , Microsoft Corp. MSFT  , Alphabet Inc. GOOGL  , Lattice Semiconductor Corp. LSCC  and PayPal Holdings Inc. PYPL  .",
    " Here are highlights from Friday's Analyst Blog: ",
    "  5 Top Tech Stocks on U.S.-China Trade Prospects  ",
    "Wall Street has heaved a sigh of relief, at least for the time being, on the trade war front between the United States and China. U.S. stocks rallied following a hint from the Chinese government that it may not retaliate against a new set of tariffs imposed by President Donald Trump immediately. Rather, the Asian economic powerhouse will try to resolve the prolonging trade dispute calmly.",
    "The news bolstered the confidence of market participants on risky assets like equities. All three major stock indexes -- the Dow, the S&P 500 and the Nasdaq Composite -- surged 1.3%, 1.3% and 1.5%, respectively. Notably, within the broad market S&P 500 Index, the Technology Select Sector SPDR (XLK) gained 1.7%, the highest among total 11 sectors.",
    " China Calls for \"Calm Attitude\" to Resolve Trade   Conflict ",
    "On Aug 29, Bloomberg reported that Gao Feng, spokesman for China's Ministry of Commerce, told reports in Beijing, \"We firmly reject an escalation of the trade war, and are willing to negotiate and collaborate in order to solve this problem with calm attitude.\"",
    "The statement for Chinese authority came just two days before the U.S. government is scheduled to impose new rate of tariffs on $550 billion of Chinese goods. Gao's statement clearly showed that the Asian economic giant is more eager to carry forward trade talks with its U.S. counterparts, instead of retaliating and escalating the situation further. Gao further said that the primary goal of his country is to remove new U.S. tariffs on Chinese imports.",
    "Additionally, in an interview with Fox News Radio, Donald Trump said that the United States and China are set to discuss trade dispute on Aug 29 \"at a different level.\" However, Trump stopped short of describing what \"a different level \"means. As per CNBC, a White House correspondence said \"both sides remain in communication at various levels.\"",
    "Notably, the tariff war between the two largest trading nations of the world heightened on Aug 23 after China announced that it will impose 5% to 10% tariff on another $75 billion of U.S. goods in two tranches, on Sep 1 and Dec 15. Additionally, a 25% tariff on U.S. auto products and auto parts will be imposed effective Dec 15.",
    "In retaliation, President Donald Trump decided to raise tariff to 30% from the existing 25% on $250 billion Chinese goods. Moreover, he also raised the tariff from 10% to 15%, which is to be levied on an additional $300 billion of Chinese exports effective Sep 1.",
    " Why Trade Solution is Important for Tech Sector ",
    "China is the largest trading partner of the United States. Moreover, China plays the role of a low-cost supplier of intermediary products and other inputs to high-tech U.S. industries. In 2018, the Trump administration levied tariffs on Chinese goods worth $250 billion. Most of these products were from the high-tech industrial sectors. U.S. companies that rely on Chinese imports are unhappy about the move as it raised prices of high-tech equipment and several electronics products.",
    "On the other hand, a trade spat with the United States resulted in a significant slowdown of China's economy. However, a strong Chinese economy will give U.S. high-tech companies a solid boost as China is also the largest market for U.S. high-tech products.",
    "At this juncture, an amicable solution to the U.S.-China trade war is likely to restore Chinese and global economic growth, which in turn will create demand for high-tech U.S. products. Likewise, repeal of tariffs on Chinese intermediary goods will raise the profit margin of U.S. tech giants.",
    " Our Top Picks ",
    "At this stage, it will be prudent to invest in technology stocks with a favorable Zacks Rank. We have narrowed down our search to five such tech stocks that have popped in the past six months despite facing trade-induced market volatility. Each of these stocks carries a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    " KLA-Tencor Corp.  designs, manufactures, and markets process control and yield-management solutions for the semiconductor and related nano-electronics industries worldwide. It provides advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays.",
    "The company has an expected earnings growth rate of 11.4% for the current year. The Zacks Consensus Estimate for the current year has improved 3.7% over the last 30 days. The stock has jumped 26.4% in the past six months.",
    " Microsoft Corp.  is a global software giant offering operating systems for computing devices, servers, phones, and other intelligent devices, server applications for distributed computing environments, cross-device productivity applications, business solution applications, desktop and server management tools, software development tools, video games and online advertising.",
    "The company has an expected earnings growth rate of 9.9% for the current year. The Zacks Consensus Estimate for the current year has improved 0.2% over the last 30 days. The stock has jumped 22.8% in the past six months.",
    " Alphabet Inc.  is a global tech leader. It provides web-based search, advertisements, maps, software applications, mobile operating systems, consumer content, enterprise solutions, commerce and hardware products.",
    "The company has an expected earnings growth rate of 14.3% for the current year. The Zacks Consensus Estimate for the current year has improved 0.6% over the last 30 days. The stock has gained 3.9% in the past six months.",
    " Lattice Semiconductor Corp  . develops and sells semiconductor technologies in Asia, Europe and the Americas. It offers field programmable gate arrays that consist of five product family lines, including the ECP, MachXO, iCE40, CrossLink, and programmable mixed signal devices.",
    "The company has an expected earnings growth rate of 72.7% for the current year. The Zacks Consensus Estimate for the current year has improved 11.8% over the last 30 days. The stock has skyrocketed 59.8% in the past six months.",
    " PayPal Holdings Inc.  operates as a technology platform and digital payments company that enables digital and mobile payments on behalf of consumers and merchants worldwide. Its payment solutions include PayPal, PayPal Credit, Braintree, Venmo, Xoom and iZettle products.",
    "The company has an expected earnings growth rate of 29.3% for the current year. The Zacks Consensus Estimate for the current year has improved 4.7% over the last 60 days. The stock has soared 10.6% in the past six months.",
    " Today's Best Stocks from Zacks ",
    "Would you like to see the updated picks from our best market-beating strategies? From 2017 through 2018, while the S&P 500 gained +15.8%, five of our screens returned +38.0%, +61.3%, +61.6%, +68.1% and +98.3%.",
    "This outperformance has not just been a recent phenomenon. From 2000 - 2018, while the S&P averaged +4.8% per year, our top strategies averaged up to +56.2% per year.",
    "  See their latest picks free >>  ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:08:00"
}