{
  "url": "https://www.nasdaq.com/article/sri-lanka-rupee-extends-losses-as-fund-outflow-worries-weigh-20190905-00366",
  "title": "Sri Lanka rupee extends losses as fund outflow worries weigh - Nasdaq.com",
  "text": [
    "COLOMBO, Sept 5 (Reuters) - Sri Lanka's rupee fell further on Thursday to close at its lowest level in more than seven months, due to continued foreign fund outflows from government securities after a surprise rate cut last month. ** Foreign investors sold government securities worth of 25.2 billion rupees in the two weeks ended on Aug. 28, data showed, extending the year-to-date net foreign outflow to 53.2 billion rupees, central bank data showed.",
    "** Outflows from government securities have been settling, senior deputy governor of the central bank Nandalal Weerasinghe said on Thursday.",
    "** The central bank lowered rates for the second time in four months on Aug. 23 to boost sluggish growth after tourism and investments plummeted following deadly Easter Day bomb attacks by Islamist militants.  ** The rupee  ended 0.2% weaker at 180.75/90 per dollar, its lowest since Jan. 29. It closed at 180.45/75 on Wednesday. The currency is up 1% this year. ** The rupee eased 1.5% in August as foreign investors sold government bonds in line with exit from other emerging markets. ** Central Bank Governor Indrajit Coomaraswamy after the policy rate cut on Aug. 23 said the bank was ready to cope with the outflow of total $700 million foreign funds invested in Sri Lankan government securities. Exit of some funds had resulted in some pressure on the local currency. ** The central bank in its monetary policy rate statement said the depreciation pressure was expected to be short-lived. ** Meanwhile, the main benchmark stock index  ended 0.19% weaker at 5,850.25. It fell 0.15% last week and 0.8% in August. ** Sri Lankan investors have been mainly in a wait-and-see mode since the main opposition party named a hardline former defence chief as its presidential candidate. ** The market has been awaiting details of former defence chief Gotabaya Rajapaksa's campaign as well as the identity of the ruling party's presidential candidate, who has yet to be announced, dealers said. ** So far this year, the stock index has dropped about 3.3%. ** Equity market turnover was 518.3 million rupees ($2.87 million) on Thursday, less than this year's daily average of about 650.9 million rupees so far. Last year's daily average was 834 million. ** Foreign investors sold a net 13.9 million rupees worth of shares on Thursday, extending the year to date net foreign outflow to 1.65 billion rupees worth of equities, according to index data. ** For a report on global markets, click MKTS/GLOB ** For a report on major currencies, click FRX/ ($1 = 180.75 Sri Lankan rupees)"
  ],
  "published_datetime": "2019-09-05 07:45:00"
}