{
  "url": "https://www.nasdaq.com/article/why-shares-of-zscaler-crashed-today-cm1210671",
  "title": "Why Shares of Zscaler Crashed Today - Nasdaq.com",
  "text": [
    " What happened Shares of   Zscaler    (NASDAQ: ZS) tumbled on Wednesday after the   cloud security software company    reported its fiscal fourth-quarter results. While Zscaler beat   expectations, the combination of lackluster guidance and a   sky-high valuation led to a brutal sell-off. The stock was down a   whopping 23% at 12:15 p.m. EDT. So what Zscaler reported fourth-quarter revenue of $86.1 million, up   53% year over year and about $3.3 million higher than the average   analyst estimate. Non-GAAP (adjusted) earning per share came in   at $0.07, beating analyst expectations by $0.05.   Image source: Getty Images.makeArticleAd();  Zscaler's guidance was the problem. The company expects fiscal   2020 revenue between $395 million and $405 million, representing   a growth rate of just 32%. That's down from a growth rate of 59%   in fiscal 2019. That revenue outlook was actually in line with analyst   expectations, but the company's earnings outlook was not. Zscaler   expects non-GAAP EPS between $0.12 and $0.15 for the full year,   down from fiscal 2019 and well short of the $0.20 analysts were   expecting. Now what Shares of Zscaler have fallen off a cliff since peaking in   late July. Including Wednesday's rout, the stock has shed about   46% of its value in just a couple of months. The pain could just be getting started, because Zscaler stock   remains obscenely expensive. Shares were trading for nearly 40   times trailing sales in July; that ratio has now been nearly cut   in half but is still deep into nosebleed territory. Zscaler may very well be a great company, but even the   best company    at too high a price can be a terrible investment. As Zscaler's   growth slows, the stock's stratospheric valuation is facing a   reckoning.   Find out why Zscaler, Inc. is one of the 10 best stocks to buy now  Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* Tom and David just revealed their ten top stock picks for     investors to buy right now. Zscaler, Inc.     is on the list      -- but there are nine others you may be overlooking.  Click here to get access to the full       list!     *Stock Advisor returns as of June 1, 2019       Timothy Green      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Zscaler, Inc. The Motley Fool has     a     disclosure policy      .  ",
    "Shares of   Zscaler    (NASDAQ: ZS) tumbled on Wednesday after the   cloud security software company    reported its fiscal fourth-quarter results. While Zscaler beat   expectations, the combination of lackluster guidance and a   sky-high valuation led to a brutal sell-off. The stock was down a   whopping 23% at 12:15 p.m. EDT.",
    "Zscaler reported fourth-quarter revenue of $86.1 million, up   53% year over year and about $3.3 million higher than the average   analyst estimate. Non-GAAP (adjusted) earning per share came in   at $0.07, beating analyst expectations by $0.05.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Zscaler's guidance was the problem. The company expects fiscal   2020 revenue between $395 million and $405 million, representing   a growth rate of just 32%. That's down from a growth rate of 59%   in fiscal 2019.",
    "That revenue outlook was actually in line with analyst   expectations, but the company's earnings outlook was not. Zscaler   expects non-GAAP EPS between $0.12 and $0.15 for the full year,   down from fiscal 2019 and well short of the $0.20 analysts were   expecting.",
    "Shares of Zscaler have fallen off a cliff since peaking in   late July. Including Wednesday's rout, the stock has shed about   46% of its value in just a couple of months.",
    "The pain could just be getting started, because Zscaler stock   remains obscenely expensive. Shares were trading for nearly 40   times trailing sales in July; that ratio has now been nearly cut   in half but is still deep into nosebleed territory.",
    "Zscaler may very well be a great company, but even the   best company    at too high a price can be a terrible investment. As Zscaler's   growth slows, the stock's stratospheric valuation is facing a   reckoning.",
    "  Find out why Zscaler, Inc. is one of the 10 best stocks to buy now  Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* Tom and David just revealed their ten top stock picks for     investors to buy right now. Zscaler, Inc.     is on the list      -- but there are nine others you may be overlooking.  Click here to get access to the full       list!     *Stock Advisor returns as of June 1, 2019    ",
    " Find out why Zscaler, Inc. is one of the 10 best stocks to buy now ",
    "Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "Tom and David just revealed their ten top stock picks for     investors to buy right now. Zscaler, Inc.     is on the list      -- but there are nine others you may be overlooking.",
    " Click here to get access to the full       list! ",
    " *Stock Advisor returns as of June 1, 2019 ",
    "  Timothy Green      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Zscaler, Inc. The Motley Fool has     a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:11:00"
}