{
  "url": "https://www.nasdaq.com/article/focuslowcost-fracking-offers-boon-to-oil-producers-headaches-for-suppliers-20190912-00173",
  "title": "FOCUS-Low-cost fracking offers boon to oil producers, headaches for suppliers - Nasdaq.com",
  "text": [
    "By Liz Hampton",
    "SMILEY, Texas, Sept 12 (Reuters) - At a dusty drilling site east of San Antonio, shale producer EOG Resources Inc  recently completed its latest well using a new technology developed by a small services firm that promises to slash the cost of each by $200,000.",
    "The technology, called electric fracking and powered by natural gas from EOG's own wells instead of costly diesel fuel, shows how shale producers keep finding new ways to cut costs in the face of pressures to improve their returns.",
    "But these systems can cost oilfield service companies up to twice as much to build compared to conventional frac fleets. A rapid uptake could worsen the economics for a sector already cutting staff and idling equipment as oil producers pare their spending. That leaves this potentially breakthrough technology to small providers without the means to fully exploit it.",
    "ONE-SIDED SAVINGS  Jeff Miller, chief executive of Halliburton Co , the top U.S. provider of fracking services, said his firm has tested the technology but has no desire to promote it.",
    "\"Halliburton will be really slow around frac,\" Miller said, referring to the costs of updating diesel systems to electric. Converting the industry's 500 frac fleets would cost $30 billion, he estimated, too steep a price for oilfield firms, he said.",
    "He recently advised an oil producer interested in the technology that the benefits of deploying e-fracs \"work for you, they don't work for us,\" he said at Barclays energy conference this month.",
    "Halliburton, Schlumberger NV  and others have idled scores of diesel-powered fleets this year as producers cut spending due to flat to lower oil and gas prices. Consultancy Primary Vision estimates the number of active fleets in the U.S. fell 19% since April to around 390.",
    "Halliburton cut 8% of its North American workforce and reported second-quarter profit fell 85% over the year-ago period in part because of equipment writedowns and severance costs due to weak demand for its frac service.",
    "\"Every week that goes by I get more and more negative about e-frac due to the harsh imbalance between the benefits achieved by the oil company and the costs incurred by the service company,\" said Richard Spears, a consultant to top oilfield services suppliers.",
    "Schlumberger paid $430 million in late 2017 to acquire a diesel-powered frac fleet from rival Weatherford International, hoping to expand shale services. A spokesperson declined to comment on e-frac.",
    "This month newly-named CEO Olivier Le Peuch disclosed plans to write down investments that were \"based on a much higher activity outlook with the ambition of achieving economies of scale.\"",
    "\"HARD TO JUSTIFY\"",
    "E-frac supplier Evolution Well Services, which supplied the equipment and crew for EOG's Eagle Ford shale operation, is one of a handful of smaller oilfield firms pioneering the systems.",
    "Evolution operates six e-frac fleets - mobile collections of high-pressure pumps powered by gas turbine generators - and plans to roll out a seventh next year. U.S. Well Services, another e-frac provider, has agreements with Apache Corp  and Shell. Conventional pressure pumper ProPetro Holding Corp  also announced plans to bring a handful of e-frac fleets to the market.",
    "\"We'd kind of would like to\" build more systems without firm customer contracts, said Ben Bodishbaugh, CEO of Evolution, the only purely e-frac provider in North America. \"But in this market it's hard to justify,\" he said.",
    "The reason: e-frac fleets can cost up to $60 million apiece because they rely on pricey gas turbines similar to those that run utilities to generate electricity, compared with as little as $30 million for a diesel-motor powered fleet. Evolution would not say how much its fleets cost, but noted it is below $60 million.",
    "\"It's a bad time for service companies to be ramping up very capital intensive service offerings,\" said Josh Young, chief investment officer with energy investor Bison Interests. \"People always feel pressure to invest in the next new things, but sometimes you shouldn't be investing in any of the things.\"",
    "Companies like Evolution and U.S. Well Services that already have e-frac fleets would be winners if the technology takes off, analysts from investment banker Tudor Pickering Holt & Co predict. E-frac accounts for about 3% of active fleets, and could reach between 25% and 33% in the next five years, Tudor estimated.",
    "EOG began testing Evolution's gear in late 2016, and signed a multi-year agreement about six months later. The shale company, well known for its use of cutting edge technology, runs four of Evolution's fleets and plans to add a fifth next year.",
    "The agreement with Evolution \"is an example of how we continue to find innovative solutions to both reduce our environmental footprint and improve the profitability of our business,\" said Billy Helms, EOG's chief operating officer. EOG is among the handful of top shale producers that generate more cash than they consume in drilling and shareholder dividends.",
    "NO SOOT, LESS NOISE",
    "At its Smiley, Texas, oil and gas well site, EOG's crew carried on casual conversations despite the whir of e-frac pumps. No one wears ear protection, which is common at conventional diesel fleets, and the towering white silos holding frac sand were gleaming during a visit in August. At a conventional frac site just up the road, the towers were black from diesel exhaust.",
    "Evolution's Bodishbaugh said some oil and gas firms see less polluting e-frac as improving their standing with investors who rate environmental, social and governance (ESG) attributes in their investments.",
    "\"I'd say this year we've probably had more inbounds calls on the emissions profile than the economic savings,\" he said.",
    "Paul Mecray III, a managing director for investment firm Tower Bridge Advisors who follows major service companies, said e-frac will only catch on if overall demand for oilfield services recovers.",
    "\"While it may be a good thing longer term, I think it will take a lot longer to catch on than people think,\" he said."
  ],
  "published_datetime": "2019-09-12 06:00:00"
}