{
  "url": "https://www.nasdaq.com/article/verizon-communications-vz-gains-but-lags-market-what-you-should-know-cm1207615",
  "title": "Verizon Communications (VZ) Gains But Lags Market: What You Should Know - Nasdaq.com",
  "text": [
    " Verizon Communications (VZ) closed at $58.18 in the latest trading session, marking a +0.24% move from the prior day. This change lagged the S&P 500's 1.08% gain on the day. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%. Prior to today's trading, shares of the largest U.S. cellphone carrier had gained 5.43% over the past month. This has outpaced the Computer and Technology sector's loss of 1.68% and the S&P 500's loss of 0.68% in that time. VZ will be looking to display strength as it nears its nex t earnings  release. The company is expected to report EPS of $1.24, up 1.64% from the prior-year quarter. Our most recent consensus estimate is calling for quarterly revenue of $32.73 billion, up 0.38% from the year-ago period. For the full year, our Zacks Consensus Estimates are projecting earnings of $4.80 per share and revenue of $131.37 billion, which would represent changes of +1.91% and +0.39%, respectively, from the prior year. It is also important to note the recent changes to analyst estimates for VZ. These revisions typically reflect the latest short-term business trends, which can change frequently. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.36% higher within the past month. VZ is currently sporting a Zacks Rank of #2 (Buy). Investors should also note VZ's current valuation metrics, including its Forward P/E ratio of 12.09. This represents a discount compared to its industry's average Forward P/E of 14.82. We can also see that VZ currently has a PEG ratio of 2.83. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. Wireless National stocks are, on average, holding a PEG ratio of 2.24 based on yesterday's closing prices. The Wireless National industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 101, which puts it in the top 40% of all 250+ industries. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. To follow VZ in the coming trading sessions, be sure to utilize Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Verizon Communications Inc. (VZ): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Verizon Communications (VZ) closed at $58.18 in the latest trading session, marking a +0.24% move from the prior day. This change lagged the S&P 500's 1.08% gain on the day. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%.",
    "Prior to today's trading, shares of the largest U.S. cellphone carrier had gained 5.43% over the past month. This has outpaced the Computer and Technology sector's loss of 1.68% and the S&P 500's loss of 0.68% in that time.",
    "VZ will be looking to display strength as it nears its nex t earnings  release. The company is expected to report EPS of $1.24, up 1.64% from the prior-year quarter. Our most recent consensus estimate is calling for quarterly revenue of $32.73 billion, up 0.38% from the year-ago period.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of $4.80 per share and revenue of $131.37 billion, which would represent changes of +1.91% and +0.39%, respectively, from the prior year.",
    "It is also important to note the recent changes to analyst estimates for VZ. These revisions typically reflect the latest short-term business trends, which can change frequently. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.",
    "Our research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.",
    "The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.36% higher within the past month. VZ is currently sporting a Zacks Rank of #2 (Buy).",
    "Investors should also note VZ's current valuation metrics, including its Forward P/E ratio of 12.09. This represents a discount compared to its industry's average Forward P/E of 14.82.",
    "We can also see that VZ currently has a PEG ratio of 2.83. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. Wireless National stocks are, on average, holding a PEG ratio of 2.24 based on yesterday's closing prices.",
    "The Wireless National industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 101, which puts it in the top 40% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "To follow VZ in the coming trading sessions, be sure to utilize Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:45:26"
}