{
  "url": "https://www.nasdaq.com/article/are-options-traders-betting-on-a-big-move-in-abeona-therapeutics-abeo-stock-cm1206759",
  "title": "Are Options Traders Betting on a Big Move in Abeona Therapeutics (ABEO) Stock? - Nasdaq.com",
  "text": [
    " Investors in Abeona Therapeutics Inc. ABEO  need to pay close attention to the stock based on moves in the options market lately. That is because the Sep 20, 2019 $2.50 Call had some of the highest implied volatility of all equity options today.  What is Implied Volatility?  Implied volatility shows how much movement the market is expecting in the future. Options with high levels of implied volatility suggest that investors in the underlying stocks are expecting a big move in one direction or the other. It could also mean there is an event coming up soon that may cause a big rally or a huge sell-off. However, implied volatility is only one piece of the puzzle when putting together an  options trading  strategy.  What do the Analysts Think?  Clearly, options traders are pricing in a big move for Abeona Therapeutics shares, but what is the fundamental picture for the company? Currently, Abeona Therapeutics is a Zacks Rank #3 (Hold) in the Medical - Biomedical and Genetics industry that ranks in the Top 35% of our Zacks Industry Rank. Over the last 30 days, no analysts have increased their earnings estimates for the current quarter, while three analysts have revised their estimates downward. The net effect has widened our Zacks Consensus Estimate for the current quarter from a loss of 39 cents per share to a loss of 48 cents in that period. Given the way analysts feel about Abeona Therapeutics right now, this huge implied volatility could mean there's a trade developing. Oftentimes, options traders look for options with high levels of implied volatility to sell premium. This is a strategy many seasoned traders use because it captures decay. At expiration, the hope for these traders is that the underlying stock does not move as much as originally expected.  Looking to Trade Options?  Check out the simple yet high-powered approach that Zacks Executive VP Kevin Matras has used to close recent double and triple-digit winners. In addition to impressive profit potential, these trades can actually reduce your risk.   Click to see the trades now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Abeona Therapeutics Inc. (ABEO): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors in Abeona Therapeutics Inc. ABEO  need to pay close attention to the stock based on moves in the options market lately. That is because the Sep 20, 2019 $2.50 Call had some of the highest implied volatility of all equity options today.",
    " What is Implied Volatility? ",
    "Implied volatility shows how much movement the market is expecting in the future. Options with high levels of implied volatility suggest that investors in the underlying stocks are expecting a big move in one direction or the other. It could also mean there is an event coming up soon that may cause a big rally or a huge sell-off. However, implied volatility is only one piece of the puzzle when putting together an  options trading  strategy.",
    " What do the Analysts Think? ",
    "Clearly, options traders are pricing in a big move for Abeona Therapeutics shares, but what is the fundamental picture for the company? Currently, Abeona Therapeutics is a Zacks Rank #3 (Hold) in the Medical - Biomedical and Genetics industry that ranks in the Top 35% of our Zacks Industry Rank. Over the last 30 days, no analysts have increased their earnings estimates for the current quarter, while three analysts have revised their estimates downward. The net effect has widened our Zacks Consensus Estimate for the current quarter from a loss of 39 cents per share to a loss of 48 cents in that period.",
    "Given the way analysts feel about Abeona Therapeutics right now, this huge implied volatility could mean there's a trade developing. Oftentimes, options traders look for options with high levels of implied volatility to sell premium. This is a strategy many seasoned traders use because it captures decay. At expiration, the hope for these traders is that the underlying stock does not move as much as originally expected.",
    " Looking to Trade Options? ",
    "Check out the simple yet high-powered approach that Zacks Executive VP Kevin Matras has used to close recent double and triple-digit winners. In addition to impressive profit potential, these trades can actually reduce your risk.",
    "  Click to see the trades now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:48:00"
}