{
  "url": "https://www.nasdaq.com/article/10-strong-buy-tech-stocks-to-buy-now-cm1207557",
  "title": "10 'Strong Buy' Tech Stocks to Buy Now - Nasdaq.com",
  "text": [
    "The increasingly volatile market is sending some investors into more defensive stock picks. The fearful rarely seek out tech stocks to buy when they need a safe haven - especially amid ongoing trade-war tensions - but that doesn't mean you need to avoid the technology sector entirely.",
    "Tech stocks, after all, are one of the best sources of high upside. As shaky as 2019 has been, the market is still having a better-than-average year, and technology has led the way with 28.3% gains. If the bull market continues to grind its way higher against the headwinds, tech could keep pressing higher, too.",
    "But what technology picks should you explore in this environment? We've evaluated TipRanks ratings from more than 5,200 analysts to pinpoint 10 promising stocks with a Strong Buy consensus over the past three months.",
    "Here, then, are 10 tech stocks to buy based on overwhelmingly strong recent sentiment. We'll explore the potential upside in each, as well as why these 10 companies are generating so many bullish opinions.",
    "Market value: $11.7 billion",
    "TipRanks consensus price target: $155.45 (10% upside potential)",
    "TipRanks consensus rating: Strong Buy",
    "RingCentral ( RNG , $141.13) offers an all-in-one cloud phone solution with video conferencing, team messaging and a ready-to-go contact center. RingCentral brought in $673 million in revenues last year; however, the company operates in a whopping $56 billion global unified communications (UCaaS) market, so it has immense room to grow.",
    "Oppenheimer's Brian Schwartz significantly hiked his price target from $130 to $155 following the company's second-quarter results, which showed strengthening momentum. Although the current price target implies just 10% upside, 12 analysts have sounded off on RNG over the past three months, and all of them have delivered Buy ratings. On that basis, RingCentral is one of Wall Street's favorite tech stocks to buy right now.",
    "\"We believe RingCentral is a primary beneficiary of the replatforming shift for UCaaS and customer service in the business communications market, and we are increasingly confident in the company's ability to grow its subscriptions business at Tier 1 rates (30%+), while improving operating margins with scale,\" Schwartz writes.",
    "Schwartz thinks the impressive Q2 report supports the idea that RingCentral can sustain robust growth. That's because trends such as cloud computing, mobile technology and more are pushing businesses of all sizes toward communication infrastructure providers. See what other top analysts have to say about RNG on TipRanks.",
    "Market value: $7.0 billion",
    "TipRanks consensus price target: $159.75 (14% upside potential)",
    "TipRanks consensus rating: Strong Buy",
    "Wix.com ( WIX , $140.25) makes it easy for anyone - even those without much technical knowhow - to create their own website. And given impressive metrics such as 4 million-plus paid subscribers and high gross margins north of 75%, analysts spy potential for an attractive long-term model.",
    "\"We continue to view WIX as one of the best fundamental assets in our Mid/Small Cap coverage galaxy, with the company's strength based on very sustainable and high levels of product innovation & pricing power amongst its top customers,\" RBC Capital's Zachary Schwartzman wrote on July 24, when he boosted his price target from $150 per share to $166 (18% upside potential).",
    "Most notably, the company is now focusing on new opportunities to expand its total addressable market - including attracting the very people it once sought to displace. For example, its new open-development platform Corvid (formerly Wix Code) is aimed at the more lucrative professional website designer and developer markets.",
    "\"While DIY remains the core, WIX is increasingly focused on capturing greater value by serving higher-value customers,\" writes top-rated SunTrust Robinson analyst Naved Khan, who has a $168 price target that implies 20% upside.",
    "Khan thinks the focus on higher-value customers, which started in May, is already starting to have an effect. Wix.com's company's recen t earnings revealed that average collections per new U.S. subscription has increased by 29% year-over-year to $228. What are other financial experts saying about WIX? Find out on TipRanks.",
    "Market value: $825.5 billion",
    "TipRanks consensus price target: $1,399.52 (18% upside potential)",
    "TipRanks consensus rating: Strong Buy",
    "Google parent Alphabet ( GOOGL , $1,190.53) is one of the biggest tech stocks on the market, but it still has considerable growth potential, according to Wall Street's brightest minds. Over the past quarter alone, 28 analysts have published Buy ratings on GOOGL shares, while just four have said to stay on the sidelines.",
    "Some of those Buy calls were sparked by strong second-quarter results that helped ease concerns from its disappointing Q1. For instance, Alphabet report ed a 28% year-over-year increase in paid clicks, and an 11% YoY decline in traffic acquisition costs. The company also rewarded shareholders by announcing $25 billion in newly authorized stock buybacks .",
    "Five-star Tigress Financial analyst Ivan Feinseth believes the strong quarter \"continues to illustrate the value of GOOGL's leading position in secular IT.\" The analyst writes that Alphabet is a \"Strong Buy,\" citing a re-acceleration in revenue growth thanks to advertising and cloud strength.",
    "Feinseth sees \"significant\" upside in GOOGL, which features in both Tigress' Research Focus List and its Focus Opportunity Portfolio. \"We believe GOOGL's dominant position in Search along with its innovative ability to develop greater home automation and mobile connectivity will continue to drive increasing Economic Profit and greater shareholder value creation,\" he writes. See why other top analysts are also bullish on Alphabet .",
    "Market value: $17.7 billion",
    "TipRanks consensus price target: $158.88 (22% upside potential)",
    "TipRanks consensus rating: Strong Buy",
    "Cloud communications platform Twilio ( TWLO , $130.47) has already spiked by 46% since the start of the year. The company allows software developers to programmatically make and receive phone calls and texts, and perform other communication functions using its web service interfaces.",
    "Top analysts are mostly bullish on Twilio, which Kiplinger recently highlighted as a way to \"China-proof\" your portfolio ; seven of the eight ratings registered over the past three months have been Buys. Most recently, four-star Rosenblatt Securities analyst Ryan Koontz attended Twilio's Signal user conference in San Francisco. He came away from the event \"highly confident in the company's strategy, long term market outlook, and customer following.\"",
    "Despite \"over-hyped investor interest in Flex,\" the new contact-center-as-a-service product, Koontz \"believe(s) Twilio's core API messaging and calling business has a strong pipeline as the company continues to invest in go-to-market to expand its reach to new market verticals and geographies.\" Meanwhile, new core business features, such as \"conversations,\" could vastly improve B2C relationships.",
    "\"We view Twilio as a well-established market disrupter in cloud-hosted communications,\" Koontz says. Given the stock's bright outlook and on-track integration of recently acquired SendGrid, the analyst maintains his \"high conviction\" Buy rating on TWLO. That's alongside a $167 price target that implies 28% upside potential.",
    "What are other financial experts saying about this intriguing communications stock? Find out on TipRanks.",
    "Market value: $10.5 billion",
    "TipRanks consensus price target: $49.00 (25% upside potential)",
    "TipRanks consensus rating: Strong Buy",
    "OpenText ( OTEX , $39.09), one of Canada's largest software companies, develops and sells enterprise information management (EIM) software. Although the company posted weaker earnings results than expected at the start of August, analysts are unanimously sticking to their bullish calls.",
    "\"While we believe the market could be disappointed by the headline revenue miss, we believe it was partially timing-related (i.e. fiscal Q3 stealing from Q4),\" Beacon analyst Gabriel Leung wrote shortly after the report. These delayed license deals weighed on revenues, which declined 1% year-over-year to $747 million, missing expectations for $765 million.",
    "\"We also continue to remind investors that the value of the company will ultimately be driven by its cloud revenue growth, which continues unabated, and the corresponding operating leverage,\" writes Leung, who raised his price target from $46 to $50 (28% upside) despite the letdown.",
    "Leung thinks OTEX will report EBITDA (earnings before interest, taxes, depreciation and amortization) of $1.1 billion on revenues of $2.87 billion in fiscal 2019. He sees those numbers growing to $1.16 billion and $2.99 billion, respectively, in fiscal 2020.",
    "RBC Capital's Paul Treiber also spies another source of potential upside: \"Commentary suggests that acquisitions are likely in the next year, which we see as a catalyst for the stock,\" he wrote in an Aug. 1 report. Over the past 10 years, OpenText has spent nearly $6 billion across 30 mergers and acquisitions (M&A) . Discover how the overall price target for OTEX breaks down on TipRanks here .",
    "Market value: $6.4 billion",
    "TipRanks consensus price target: $144.50 (27% upside potential)",
    "TipRanks consensus rating: Strong Buy",
    "Email, social media and mobile devices are modern-day tools of the trade ... and for cyber criminals, they're the new tools of attack. Luckily, tech stocks such as Proofpoint ( PFPT , $113.61) help customers stop malware, phishing and impersonation across email and the cloud.",
    "Wall Street is leaning heavily bullish toward this cybersecurity company. RBC Capital's Matthew Hedberg is among the optimistic analysts, recently reiterating his Buy rating following Proofpoint's strong quarterly report and upgraded 2019 guidance - guidance Hedberg thinks still might be too conservative.",
    "Hedberg - who is ranked in the Top 15 among more than 5,200 analysts tracked by TipRanks - also ramped up his price target from $141 per share to $150, implying 32% upside.",
    "\"With a reasonable valuation and several long-term drivers at its back, we continue to like the risk/reward of the stock given the growth and (free cash flow) margins,\" the analyst writes. \"Overall we found management's tone to be positive, as it believes that it has the sales structure and products in place to deliver 20%+ organic growth for several years to come.\"",
    "Hedberg says these long-term growth drivers include a healthy email spending backdrop and a total addressable market that has expanded by $6 billion, to $13 billion, as well as record results from Office 365 conversions, cross-selling opportunities and strong partner-led deals. Discover how the stock's Strong Buy consensus breaks down on TipRanks .",
    "Market value: $4.4 billion",
    "TipRanks consensus price target: $47.10 (32% upside potential)",
    "TipRanks consensus rating: Strong Buy",
    "San Francisco-based Medallia ( MDLA , $35.62) is pioneering a new type of customer analytics. By aggregating customer experience data, including both direct and indirect feedback, Medallia can analyze customer satisfaction levels, provide actionable insights and identify at-risk customers to reduce churn rates.",
    "Medallia says the total addressable market in customer experience management (XM) is nearly $70 billion.",
    "\"The XM market remains early in its adoption lifecycle, as enterprises are only beginning to value the importance of ... incorporating experience data (\"X-data\") with operational data (\"Odata\") to improve their businesses,\" Wells Fargo's Philip Winslow writes. He initiated coverage of the stock with a Buy rating and $45 price target (26% upside) after Medallia went public in July. The stock now trades above $35 - well above its initial public offering (IPO) price of $21.",
    "\"We believe Medallia is well positioned to capture the growing interest in XM with its holistic enterprise-grade solution that addresses a comprehensive set of constituents,\" he writes.",
    "A similar message comes from five-star SunTrust analyst Terry Tillman: \"Understanding the pulse of customers, why they buy and what actions can drive increased revenue represent key catalysts for growth,\" the analyst wrote Aug. 13 in his initiation note. Find out how the Street's average price target for MDLA breaks down .",
    "Market value: $14.3 billion",
    "TipRanks consensus price target: $44.00 (37% upside potential)",
    "TipRanks consensus rating: Strong Buy",
    "Sea Ltd. ( SE , $32.12) isn't a well-known name here in the U.S. But it's a leading digital game-maker in Southeast Asia and Taiwan, and it's one of the hottest tech stocks on Wall Street right now. Shares are up 184% year-to-date, and five analysts have published Buy ratings on SE over the past two weeks alone.",
    "The company's second-quarter earnings report spurred the latest round of ratings. Sea Ltd. delivered a beat-and-raise quarter, including total adjusted revenues that more than tripled to $665.4 million. However, that wasn't enough to win over investors. The company's adjusted profits widened 8% to 49 cents per share, though that still was better than the 51-cent loss analysts expected.",
    "Shares dropped 12% across the first two trading days following the report nonetheless, but the Wall Street community wasn't so easily swayed. Five-star Stifel Nicolaus analyst Scott Devitt underlined the ultimately positive nature of the earnings commentary on Aug. 20.",
    "\"We would be buyers of SE shares on weakness (on elevated expectations) on a very strong quarter across both eCommerce and gaming and view guidance as likely status quo with prior quarters in terms of conservatism,\" he writes. \"(Second-half) game billings guidance appears conservative while eCommerce marketplace monetization ramps ahead of our expectations.\"",
    "Most importantly, Devitt sees a clear path to profitability. He argues that sustained profitability trends at Sea Ltd.'s digital entertainment platform Garena, combined with slimmer losses for its Shopee e-commerce platform, could result in Sea reaching the breakeven mark for EBITDA by as early as 2020. As a result, the analyst reiterated his Buy rating while marginally hiking his price target from $44 to $45 (40% upside potential). See what other top analysts have to say about SE on TipRanks.",
    "Market value: $2.2 billion",
    "TipRanks consensus price target: $23.33 (39% upside potential)",
    "TipRanks consensus rating: Strong Buy",
    "Software company SVMK Inc. ( SVMK , $16.74) is the parent company of SurveyMonkey, which allows users to create their own online surveys. Its mission is to power curious individuals and organizations to measure and act on the opinions of others. In practice, it's a useful way for companies to gather actionable feedback from customers.",
    "According to SVMK, 98% of Fortune 500 companies rely on SurveyMonkey for \"People Powered Data.\" Indeed, the company's second-quarter results revealed strong business growth with new customers such as Wells Fargo ( WFC ) and a stronger partnership with Salesforce.com ( CRM ). Enterprise sales revenue grew 110% year-over-year and accounted for 20% of total Q2 revenues, up from 11% in the year-ago period.",
    "Five-star SunTrust analyst Youssef Squali cited this in his post-earnings Buy call. \"We reiterate our positive stance on SVMK after a strong 2Q19 ... with better than expected top/bottom lines, and positive momentum in key growth initiatives, namely Enterprise and Teams,\" the analyst writes. Squali sees shares appreciating 43% to a target of $24 over the next 12 months.",
    "UBS analyst Eric Sheridan echoes Squali's view. The analyst upgraded SVMK and boosted his price target from $18 to $24 on Aug. 2, citing another positive earnings report and robust management commentary. \"SVMK's business model continues to demonstrate pricing power, increased customer spend & higher customer retention - in our view, investors should find that dynamic very compelling,\" Sheridan writes. For further insights into this stock, check out SVMK's analyst page at TipRanks .",
    "Market value: $3.0 billion",
    "TipRanks consensus price target: $24.50 (22% downside potential)",
    "TipRanks consensus rating: Strong Buy",
    "Finally, we have cloud-based content-delivery provider Fastly ( FSLY , $31.60), which is the oddball in this list.",
    "Analysts have a consensus Strong Buy rating on the stock, but their current consensus price target implies more than 20% downside. You see, FSLY very rapidly shot by price targets recently. So investors need to watch the covering analysts to see how they react. They may upgrade their price targets to keep up - but it's possible they'll suggest investors hold off until the stock cools.",
    "So, what is Fastly? Well, users have high expectations for websites and apps alike; if they aren't fast, secure and highly personalized, users go elsewhere. Fastly addresses this need, enabling companies to deliver modern online experiences with speed, security and scale.",
    "\"On election night, we had 100,000 requests per second, and Fastly performed flawlessly -- we had no problems at all,\" New York Times CTO Nick Rockwell says about Fastly's service.",
    "The company only recently went public, with a May IPO. It has been volatile of late, too, swinging wildly in August after mixed results for its firs t earnings report . Strong enterprise customer additions (+39% year-over-year) drove a top-line beat, but investors also had to digest high capital expenditures and a significant decline in gross margins.",
    "Credit Suisse analyst Brad Zelnick sees a bright side in the recent weakness. \"We view this as a buying opportunity in a stock that is trading at a CDN (content delivery network) multiple, which should, over time, re-rate towards developer-centric peers,\" he writes. Zelnick also pointed out that gross margins expanded by a full percentage point year-over-year.",
    "\"As use cases become more pervasive we believe patient investors will be rewarded as the fundamentals compound and the stock re-rates,\" he writes. See why other top analysts are so optimistic about Fastly .",
    "Harriet Lefton is head of content at TipRanks, a comprehensive investing tool that tracks more than 5,000 Wall Street analysts as well as hedge funds and insiders. You can find more of their stock insights here.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 04:51:29"
}