{
  "url": "https://www.nasdaq.com/article/7-triple-threat-growth-stocks-to-buy-for-the-long-term-cm1206997",
  "title": "7 Triple Threat Growth Stocks to Buy for the Long Term - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "In my years of investing, I've learned that when it comes to picking high-quality stocks, everything matters. It's not just about identifying stocks with low price-to-earnings multiples, or high yields. It's not just about finding stocks that always beat Wall Street's revenue and profit expectations. Nor is it just about insider buying, or the technical indicators, or any single thing.",
    "Instead, it's about all those things. As it turns out, stock picking is a multi-dimensional analysis, and in order to be the best stock picker possible, you need to intimately understand all those dimensions.",
    "Given that, I've developed a three-pronged framework for identifying winning stocks.",
    "That framework is simple. First, and foremost, the stock needs to have favorable fundamentals, meaning the long-term fundamental growth prospects need to warrant upside in the stock from current levels. Second, the stock needs to have favorable optics, meaning that there needs to be a reason or set of reasons why investors will want to buy this stock both now and for the foreseeable future. Third, the stock needs to have favorable technicals, since good technicals provide psychological support for continued bullish investor sentiment.",
    "If a stock checks off all three of those boxes, I call it a \"Triple Threat Stock\" - and in my experience, these Triple Threat Stocks have been big winners over the long run.",
    "With that in mind, let's take a look at 7 of my favorite Triple Threat Stocks to buy for the long term.",
    "The Fundamentals:  The fundamentals supporting e-commerce solutions provider Shopify (NYSE: SHOP ) are about as good as you're going to find in the market. Shopify is powering a new era of direct decentralized commerce, enabling merchants of all shapes and sizes to successfully sell directly to their customers. This is a huge growth market, since we are migrating to a do-it-yourself economy with consumers who favor decentralized systems over centralized ones.",
    "The growth trajectory is consequently robust, with steady 50%-plus sales volume growth over the past several quarters. The long-term revenue potential is huge, as Shopify accounts for less than 2% of total e-retail sales. The long-term profit potential is also huge, because gross margins here are north of 50% and the opex rate has tremendous room to fall with scale.",
    "Net net, Shopify projects as a big revenue and profit grower for a lot longer as secular tailwinds expand the direct decentralized retail model from niche, to mainstream. All that growth firepower will inevitably push SHOP stock higher long term.",
    "The Optics:  The optics supporting SHOP stock are similarly favorable across the board. For starters, SHOP stock has been working in a flat market. Since the trade war started, the stock has more than tripled, while the market has gone nowhere. Existing investors are going to what to stick with what's working. New investors are going to want to pile into what's working.",
    "Further, Shopify is a big growth stock in a super low rate environment. That's an attractive combo since low rates help support long duration assets. Even further, Shopify's growth narrative has almost nothing to do with China and the trade war. Thus, this stock is side-stepping the market's biggest risk right now.",
    "The Technicals:  SHOP stock is up nearly 200% year-to-date, and the chart looks like a steady, straight-line up from ~$150 to ~$400. As far as charts go, they don't get much prettier than this one. SHOP is a prime stock to buy.",
    "The Fundamentals:  The fundamentals underlying Walmart (NYSE: WMT ) have been, still are, and will remain for the foreseeable future, rock-solid.",
    "Walmart is the world's biggest retailer. They got to this position for two reasons. One, they've dominated on price - that is, they have always offered the lowest prices in the market, and because consumers are always attracted to low prices, consumers have consistently been attracted to Walmart's low prices. Second, they've dominated on convenience. Walmart has an extensive real estate footprint that puts Walmart's stores within reasonable driving distance of almost every U.S. consumer. Because consumers are also always attracted to high convenience, consumers have consistently been attracted to Walmart's unparalleled convenience.",
    "Over the past several decades, dominance on these two fronts has powered big comparable sales, revenue, and profit.",
    "This dynamic will continue for the foreseeable future. Walmart's prices are still the lowest in the market - recent studies support that Walmart.com offers lower prices than even Amazon.com (NASDAQ: AMZN ). Also, Walmart's convenience is only going up, as the company is rapidly expanding its e-commerce business and its omni-channel capabilities so that consumers can shop how they want and when they want.",
    "Consequently, Walmart's comps, sales, and profits will continue to march higher for the foreseeable future. As they do, WMT stock will power higher, too.",
    "The Optics:  The optics supporting Walmart as one of are stocks to buy are favorable, led by three big things.",
    "First, the U.S. consumer is on fire right now, and Walmart is a U.S. consumer story. Pockets of the global economy are showing weakness. The U.S. consumer is not. So long as the U.S. consumer remains one of the few good things about the global economy, investors will pile into stocks which have big U.S. consumer exposure - like WMT.",
    "Second, Walmart is on fire right now. Thanks to the fact that this company has figured out the digital game and is rapidly expanding its omni-channel footprint, Walmart is firing off decade-best comparable sales and traffic growth numbers. Thus, not only is Walmart exposed to one of the few pockets of the global economy that is working, but that exposure is high-quality exposure.",
    "Third, Walmart is recession-proof. Sure, a lot of investors throw that term around a lot. But, Walmart actually is recession proof. When a recession hits, consumers migrate to low-price retailers like Walmart. As such, Walmart can actually experience growth in an economic downturn. Look no further than 2007-09. While the S&P 500 collapsed 60%, WMT stock actually rose more than a percent over that same stretch.",
    "The Technicals:  WMT stock has formed a solid uptrend over the past five years of higher lows and higher highs. That uptrend has remained in-tact in 2019. Indeed, it isn't showing any signs of breaking. As such, the technicals here point to continued secular strength.",
    "The Fundamentals:  Over at programmatic advertising leader The Trade Desk (NASDAQ: TTD ), you have similar long-term growth fundamentals as at Shopify. That is, you have a hyper-growth company with a huge opportunity in front of it, which operates at sky high margins, and has visibility towards huge profits in the long run.",
    "The narrative at The Trade Desk begins and ends with automation and data. That is, automation and data are transforming work flows and processes everywhere - making them smarter, faster, and cheaper. The Trade Desk applies automation and data to the advertising world through what is called programmatic advertising - which is just leveraging data and machine learning to automate and optimize the way companies spend their ad dollars.",
    "Companies left and right are adopting programmatic advertising in bulk. That's why The Trade Desk has rattled off multiple consecutive quarters of 40%-plus revenue growth. These big growth quarters will stick around for a lot longer. Less than 1% of global digital-ad spend went through The Trade Desk last year, meaning this company has tons of room to expand share in a secular growth market for a lot longer.",
    "Gross margins are big, too, so as scale drives positive operating leverage over time, The Trade Desk stands to produce a ton of profits in the long run. All of those profits will add up to a TTD stock price in 5 years that is way higher than today's price tag, which is key when you're looking for stocks to buy.",
    "The Optics:  The optics on TTD stock support continued strong investor demand for the foreseeable future. These favorable optics break down into two parts.",
    "First, The Trade Desk has worked in a flat market. Since the trade war started in January 2018, the major indices have gone nowhere. TTD stock has risen nearly five-fold over that same stretch. Existing investors want to stick with this beacon of strength. New investors will want to buy into it.",
    "Second, TTD stock is a big-time growth stock that derives essentially all of its value from future profits. In a low rate environment - like the one we find ourselves in today - those future profits have a higher present value. As such, today's environment is one wherein investors will continue to look for exposure to high-quality, long-duration assets. TTD stock is one of those assets.",
    "The Technicals: Over the past three years, TTD stock has formed a pattern. Rally big for a few months, and then consolidate around the 50-day moving average for a few months, all while maintaining a big spread over the 200-day moving average. Early 2019 was part one - the multi-month surge. Mid-2019 has been part two - the consolidation around the 50-day. Presumably, this ends with a repeat of part one - another multi-month surge higher towards $300.",
    "The Fundamentals:  Lather, rinse, and repeat the Shopify and Trade Desk fundamental growth narratives for the next of our Triple Threat Stocks to buy. Security giant Okta (NASDAQ: OKTA ) is a big growth company with tons of room to grow, operating at sky high margins with the potential to produce enormous profits at scale.",
    "Okta is a cloud security company. But they are a unique cloud security company. They focus on what is called identity access management. That is, as opposed to outfitting an entire enterprise ecosystem with a castle of cloud security defense, Okta outfits each individual in the enterprise ecosystem with their own personalized armor of cloud security defense.",
    "This solution is optimal, mostly because overarching security systems can be restrictive and identity-based ones are flexible, and flexibility is extremely important to dynamic enterprises who often utilize many different software applications. Consequently, Okta's Identity Cloud solution has been swiftly adopted across the enterprise world, with customer and revenue growth rates at Okta consistently hovering north of 40%.",
    "There's also plenty of room to grow here. At last count, Okta had 7,000 customers. There are over 30 million enterprises in the U.S. - all of whom could use Okta's Identity Cloud. There are several hundred million enterprises worldwide. Thus, this growth narrative is still in its first few innings.",
    "On top of it all, Okta runs at 70%-plus gross margins, so the company has visible runway to producing huge profits at scale. Over the course of the next several years, as Okta's profits do run significantly higher, OKTA stock will run significantly higher, too.",
    "The Optics:  There are three big drivers of the favorable optics supporting OKTA stock at the current moment.",
    "The first two we've already discussed in this gallery. First, the stock has been working in a flat market - up 300%-plus since the trade war started - and investors will want to stick with what has been working. Second, this is a big time growth stock supported by exceptionally low rates.",
    "The third point is a bit more unique. Okta is a cloud company. The cloud space is on fire right now. It also has minimal exposure to China and the trade war. Indeed, an economic downturn could actually help the cloud industry by accelerating the on-premise to cloud shift. After all, cloud is supposed to cheaper, and cheaper wins out when money becomes tight.",
    "The Technicals:  OKTA stock has been on fire over the past year. But every once in a while, it does go through rough patches. In those rough patches, the stock tends to consolidate around the 50-day moving average before sprinting higher - see late 2018 and February/March 2019. It appears OKTA is going through a similar consolidation right now. History says this consolidation around the 50-day will end in a big move higher.",
    "The Fundamentals:  In 2018, the core growth fundamentals underlying Facebook (NASDAQ: FB ) looked shaky. But now that the company has put those issues behind it, the long term growth fundamentals for this stock to buy look as strong ever.",
    "In a nutshell, Facebook's owns four of the world's favorite and most-used digital properties - Facebook, Instagram, Messenger, and WhatsApp. For most consumers, these applications are more than just fun apps. They are utilities digital consumers use everyday to keep in touch with friends, communicate with others, and stay up-to-date with current events. As such, consumers are hooked to these platforms and they aren't leaving anytime soon. If the 2018 Cambridge Analytica scandal didn't get people quit (and it didn't), I don't know what will.",
    "So long as users stay in the Facebook ecosystem, ad dollars from across the world will continue to flood into the ecosystem. Facebook is also pushing the envelope on commerce. Considering the ecosystem is essentially the world's largest marketplace with 2.7 billion active potential buyers, these commerce growth initiatives could produce big results.",
    "Bottom line: ad revenue growth rates will remain big for the foreseeable future, and new e-commerce revenue will supercharge the overall top-line growth trajectory. Gross margins across the board will remain healthy. The opex rate will fall as big data security investments phase out. Net profits margins will move higher. So will profits.",
    "As profits move higher, FB stock will, too. That's because, at 23-times forward earnings, this stock is still cheap relative to its long-term growth potential.",
    "The Optics:  The optics here are better than they've been in a long time. Facebook is shaking off the rust from an ugly 2018. In so doing, investors are starting to see that the company really wasn't damaged - at all - during one of the most controversial issues in corporate America in the past decade. Investors are therefore starting to realize just how sticky the Facebook ecosystem is, and how strong and healthy the long-term growth prospects are for Facebook.",
    "As they realize this, they want back in. That's why we've seen a big YTD rally in FB stock. But the stock is still well off its 2018 highs. Thus, investors will keep wanting \"in\" until the stock breaks through those highs. That gives the stock plenty of runway to keep moving higher.",
    "The Technicals:  FB stock has formed a clean uptrend in 2019 of distinct higher highs and higher lows. The stock recently tested and held the support line in this uptrend. It is now bouncing off that support line - a strong sign that the uptrend is in-tact. If so, the technicals here reasonably point towards a rally to a new higher high, or somewhere above $210.",
    "The Fundamentals:  The fundamentals for Lululemon (NASDAQ: LULU ) are exceptionally favorable in the long run for two big reasons. First, the athletic apparel market is on fire and projects to remain on fire. Second, Lululemon is the hottest brand in that athletic apparel market and should remain so for the foreseeable future.",
    "On the first point, the athletic apparel market is the shining star of the retail world. Retail sales have been moving higher at a steady pace, thanks to healthy labor conditions. But athletic apparel sales have been outpacing the crowd. This is due to secular trends, such as eating right, being fit, and staying healthy, the sum of which have pushed consumers to workout more and live healthier, more active lifestyles. A big part of that is buying the right clothes to fit that lifestyle - hence, the big surge in athletic apparel spend over the past few years.",
    "On the second point, Lululemon is the hottest and most relevant brand in the athletic apparel space. Thanks to genius marketing and merchandising, Lululemon has struck the sweet spot of controlling high prices and still driving big demand, all while maximizing brand equity. That is to say, Lululemon's clothes are expensive enough to where they are a status symbol, and yet aren't expensive enough to where they eliminate mass market demand.",
    "In striking this sweet spot, Lululemon is driving mass market demand at favorable price points. The result? Big comparable sales growth, big margin expansion, and even bigger profit growth.",
    "This dynamic projects to persist for the foreseeable future. Why? Because Lululemon is still small. They did just $3.5 billion sales over the past 12 months. Nike (NYSE: NKE ) did about $40 billion. Thus, Lululemon has plenty of runway to keep growing at a robust rate for a lot longer.",
    "The Optics:  The optics here are simple and favorable. The U.S. consumer - and to a lesser extent, the global consumer - is working right now. Many other parts of the global economy aren't working. Thus, investors today are craving consumer exposure.",
    "The highest quality form of consumer exposure is exposure to the athletic apparel industry since secular tailwinds have and will continue to promote above-trend growth across this whole space. In that athletic apparel industry, the company that stands out from the pack as the fastest grower with the most long-term potential is Lululemon.",
    "For the foreseeable future, investors will follow that same logic train to arrive at the same conclusion. In today's environment, buy LULU stock.",
    "The Technicals:  As is the case with many other stocks on this list, LULU stock has found tremendous support over the past year in its 50-day moving average. See late 2018, late March 2019, and early June 2019. Today belongs in that list, too. LULU stock is consolidating around its 50-day moving average amid trade war turbulence. The implication is that once this trade war turbulence passes, LULU stock will fly higher.",
    "The Fundamentals:  High-flying digital-education company Chegg (NASDAQ: CHGG ) is yet another growth stock supported by very favorable long-term growth fundamentals. Specifically, this is a big growth company, in a secular growth market, with very little competition, which runs at huge margins, with a ton of runway to keep growing, and the potential to produce huge profits at scale.",
    "Long story short, Chegg is the digital education company that high school and college students across America have needed for the past decade. Everything high school and college students interact with these days is all digital. The one big exception? School. The academic world has been slower to pivot to the digital revolution. Chegg is changing that. They have made a digital education companion built for students in the 21st Century, complete with digital on-demand tutoring services, e-textbooks, tutorial videos, solution manuals, writing help, citation makers, so on and so forth.",
    "Chegg bundles all these services into a subscription offering, and sells that to students across America. Demand has been robust thus far - services revenue growth has exceeded 30% in each of the past several years. The best part? Chegg is only getting started. They have about 3 million subscribers on their connected learning platform. There are 36 million high school and college students in the U.S. alone - and far, far more globally. Thus, Chegg is penetrating a very small portion of its addressable market.",
    "Over the next several years, then, Chegg will rattle off several more 20%-plus and 30%-plus revenue growth quarters. All those big growth quarters will be accompanied by big profit growth, too, since the Services business runs at ~80% gross margins.",
    "Fast forward 5 years. Chegg will have a lot more subscribers, a lot more revenues, and a lot more profits. CHGG stock price should be significantly higher, too.",
    "The Optics:  With CHGG stock, there are three components to the favorable optics underlying the stock.",
    "First, Chegg has been a shining star in a flat market. It's up 130% since the trade war began. Investors will want to stick with this strength so long as the trade war hangs around.",
    "Second, Chegg is a big growth stock with a big valuation. The stock derives a ton of its value from future profits. As mentioned earlier, those profits get a boost when rates are low. Thus, today's low rate environment is favorable for CHGG stock.",
    "Third, this is a U.S.-only growth story. While the global economy may be slipping, the U.S. economy appears to be doing just fine. Further, this is a U.S. student growth story. U.S. students will likely continue to pay for educational services regardless of the economic backdrop.",
    "The Technicals:  In 2019, CHGG stock has formed a clean uptrend of higher highs and higher lows. The stock is currently testing the support line of that uptrend. Will it hold? Given the favorable fundamentals and optics, probably. If it does, the technicals would imply a rally in CHGG stock towards a new higher high, or somewhere north of $48.",
    "As of this writing, Luke Lango was long SHOP, WMT, TTD, OKTA, FB, LULU, NKE, and CHGG. ",
    "The post 7 Triple Threat Growth Stocks to Buy for the Long Term appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 15:13:14"
}