{
  "url": "https://www.nasdaq.com/article/5-car-buying-tips-from-my-days-as-an-undercover-salesman-cm1207567",
  "title": "5 Car-Buying Tips From My Days as an Undercover Salesman - Nasdaq.com",
  "text": [
    " Some years ago, I became an undercover car salesman at two   different dealerships in Southern California, as part of an   investigative series for an automotive website. What I learned   surprised and scared me, as I described in the resulting article,   \"Confessions of a Car Salesman.\" Selling cars turned out to be the perfect training for my   current job as a consumer advocate and autos editor for   NerdWallet. While I posed as a \"green pea\" - the nickname for a   beginner car salesperson - the sales managers freely revealed   their secrets to me so that I would move the metal and, in turn,   make money for them. Here are just a few of the things I learned and how you can   safely navigate the car-buying process    .makeArticleAd();  1. Test-drive your car salesperson  Believe it or not, I felt sympathy for many of the salespeople   I worked with. They face long hours, hostility from customers and   constant pressure from managers who watch from \"the tower,\" a   raised platform overlooking the car lot. Later, as I used my   insider knowledge to buy more than 100 cars for an automotive   website, I met many honest, intelligent, helpful car salespeople.   But the work of these \"good apples\" was often spoiled by a rotten   batch of uninformed sales stereotypes - not to   mention some manipulative and even underhanded dealership   managers. I like to tell people that they should   test-drive car salespeople    before they test-drive the car. Here are a few things to ask   yourself: Are they informed about the cars they are selling? Do   they listen well and respond to your questions? Will you feel   comfortable negotiating with them?  2. Check the 'book' value  It takes only a minute to look up the current market value of   a car - and yet many shoppers wander onto the car lot without any   idea of what they should pay. This one little data point would   provide an amazing amount of protection. But as an undercover car   salesman, I had to stand by and watch trusting, ordinary buyers   overpay for their new cars. So take a moment and check a pricing guide such as Edmunds or   Kelley Blue Book for the current market value of the car you   want. Bring this information with you, or download a pricing app   to check prices on the fly.  3. Don't be a monthly-payment buyer  \"What kind of monthly payment are you folks looking for?\" This   helpful-sounding question is the favorite trick of car   salespeople everywhere. And if you answer, it can be a financial   disaster for you. While it sounds like the salesperson is   concerned about your budget, it's the opening gambit for a tactic   called \"packing payments.\" If the dealer can get you to negotiate   a monthly payment rather than the purchase price of the car, it's   easy to add in - or \"pack\" - extras and make you overpay.  Getting a preapproved car loan    and telling the salesperson you are a \"cash buyer\" is an easy way   to deflect this trick.  4. Be ready to walk  You could walk into a dealership and have the same   high-pressure experience your father had when he bought cars   decades ago. Or you could have a mellow, enjoyable shopping   experience where you get a fair deal. There's such a wide range   of sales styles and dealerships. I worked at a \"turnover house,\" meaning that if one   salesperson wasn't making progress with a customer,   the customer was turned over to a different salesperson. If   that didn't work, they brought in a \"closer\" -  an   overbearing, manipulative bully who was determined to make a deal   at any cost. If you see these warning signs, if you get a bad vibe, if you   don't like your salesperson, beat a hasty retreat - instead of   going to war, go to another dealership. For example, the second   dealership I worked at was very relaxed and didn't use closers.   But high-pressure or relaxed, whichever type of car lot you find   yourself on, never take anything at face value.  5. Beware the finance manager  While the salesperson negotiates the price of the car and   pretends to be your best friend, the real damage is done after   the customer is handed off to the finance and insurance manager.   Also called the \"F&I guy,\" this salesperson assumes the air   of a financial advisor, sort of like a friendly banker. But he or   she is really there to build even more profit into the deal by   inflating the interest rate on your loan and selling you extra   products such as extended warranties and anti-theft devices. Before you go to the dealership, spend a few minutes being   your own finance manager by using an   auto loan calculator    to set up your own deal. Bring these figures with you to the   dealership and get the dealer to match or beat them.   More From NerdWallet    Your Car-buying Cheat Sheet   Calculate How Much Car You Can Afford   Estimate Your Car's Value      Philip Reed is a writer at NerdWallet. Email:       preed@nerdwallet.com. Twitter: @AutoReed.   The article 5 Car-Buying Tips From My Days as an Undercover   Salesman originally appeared on NerdWallet. ",
    "Some years ago, I became an undercover car salesman at two   different dealerships in Southern California, as part of an   investigative series for an automotive website. What I learned   surprised and scared me, as I described in the resulting article,   \"Confessions of a Car Salesman.\"",
    "Selling cars turned out to be the perfect training for my   current job as a consumer advocate and autos editor for   NerdWallet. While I posed as a \"green pea\" - the nickname for a   beginner car salesperson - the sales managers freely revealed   their secrets to me so that I would move the metal and, in turn,   make money for them.",
    "Here are just a few of the things I learned and how you can   safely navigate the car-buying process    .",
    "Believe it or not, I felt sympathy for many of the salespeople   I worked with. They face long hours, hostility from customers and   constant pressure from managers who watch from \"the tower,\" a   raised platform overlooking the car lot. Later, as I used my   insider knowledge to buy more than 100 cars for an automotive   website, I met many honest, intelligent, helpful car salespeople.   But the work of these \"good apples\" was often spoiled by a rotten   batch of uninformed sales stereotypes - not to   mention some manipulative and even underhanded dealership   managers.",
    "I like to tell people that they should   test-drive car salespeople    before they test-drive the car. Here are a few things to ask   yourself: Are they informed about the cars they are selling? Do   they listen well and respond to your questions? Will you feel   comfortable negotiating with them?",
    "It takes only a minute to look up the current market value of   a car - and yet many shoppers wander onto the car lot without any   idea of what they should pay. This one little data point would   provide an amazing amount of protection. But as an undercover car   salesman, I had to stand by and watch trusting, ordinary buyers   overpay for their new cars.",
    "So take a moment and check a pricing guide such as Edmunds or   Kelley Blue Book for the current market value of the car you   want. Bring this information with you, or download a pricing app   to check prices on the fly.",
    "\"What kind of monthly payment are you folks looking for?\" This   helpful-sounding question is the favorite trick of car   salespeople everywhere. And if you answer, it can be a financial   disaster for you. While it sounds like the salesperson is   concerned about your budget, it's the opening gambit for a tactic   called \"packing payments.\" If the dealer can get you to negotiate   a monthly payment rather than the purchase price of the car, it's   easy to add in - or \"pack\" - extras and make you overpay.",
    " Getting a preapproved car loan    and telling the salesperson you are a \"cash buyer\" is an easy way   to deflect this trick.",
    "You could walk into a dealership and have the same   high-pressure experience your father had when he bought cars   decades ago. Or you could have a mellow, enjoyable shopping   experience where you get a fair deal. There's such a wide range   of sales styles and dealerships.",
    "I worked at a \"turnover house,\" meaning that if one   salesperson wasn't making progress with a customer,   the customer was turned over to a different salesperson. If   that didn't work, they brought in a \"closer\" -  an   overbearing, manipulative bully who was determined to make a deal   at any cost.",
    "If you see these warning signs, if you get a bad vibe, if you   don't like your salesperson, beat a hasty retreat - instead of   going to war, go to another dealership. For example, the second   dealership I worked at was very relaxed and didn't use closers.   But high-pressure or relaxed, whichever type of car lot you find   yourself on, never take anything at face value.",
    "While the salesperson negotiates the price of the car and   pretends to be your best friend, the real damage is done after   the customer is handed off to the finance and insurance manager.   Also called the \"F&I guy,\" this salesperson assumes the air   of a financial advisor, sort of like a friendly banker. But he or   she is really there to build even more profit into the deal by   inflating the interest rate on your loan and selling you extra   products such as extended warranties and anti-theft devices.",
    "Before you go to the dealership, spend a few minutes being   your own finance manager by using an   auto loan calculator    to set up your own deal. Bring these figures with you to the   dealership and get the dealer to match or beat them.",
    "  More From NerdWallet    Your Car-buying Cheat Sheet   Calculate How Much Car You Can Afford   Estimate Your Car's Value   ",
    " More From NerdWallet ",
    "  Philip Reed is a writer at NerdWallet. Email:       preed@nerdwallet.com. Twitter: @AutoReed.  ",
    " Philip Reed is a writer at NerdWallet. Email:       preed@nerdwallet.com. Twitter: @AutoReed. ",
    "Philip Reed is a writer at NerdWallet. Email:       preed@nerdwallet.com. Twitter: @AutoReed.",
    "The article 5 Car-Buying Tips From My Days as an Undercover   Salesman originally appeared on NerdWallet.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:00:59"
}