{
  "url": "https://www.nasdaq.com/article/uschina-trade-optimism-lift-latam-markets-intervention-helps-brazils-real-20190905-00744",
  "title": "U.S.-China trade optimism lift Latam markets; Intervention helps Brazil's real - Nasdaq.com",
  "text": [
    "By Agamoni Ghosh",
    "Sept 5 (Reuters) - Latin American assets moved higher on Thursday after the United States and China agreed to resume trade negotiations, raising hopes of resolving a long-standing trade dispute that has caused a global economic slowdown.",
    "MSCI's index of Latin American stocks  rose 2.4%, led by gains on Brazil's Bovespa index .",
    "\"Political-economic disruptions to global markets via the U.S-China trade dispute have pushed weakness in EM,\" TD Securities analysts said in a note.",
    "\"Until we see stabilization in growth momentum and financial market volatility, it is unlikely we can make a case for strong performance against the USD in the Latam space,\" they said.",
    "The Bovespa  rose 1.9%, aided by gains among financials and energy stocks. The real , which has lost more than 5% of its value this year, moved 0.3% higher on the day as intervention by the central bank stabilized the market.",
    "Central bank President Roberto Campos Neto said on Thursday that inflation in Brazil was well-anchored over the short-, medium- and long-term horizons, giving policymakers room to reduce interest rates further. ",
    "ARGENTINA CRISIS       ",
    "The Argentine peso  held steady, supported by capital controls imposed by Latin America's third-largest economy earlier this week, which came after the government announced its plans to \"re-profile\" some $100 billion in debt.",
    "The peso has been battered since President Mauricio Macri suffered a thumping defeat in primaries at the hands of Alberto Fernandez.",
    "Some of Argentina's largest creditors, who met informally this week according to a Financial Times report, are said to have concluded that negotiations with Macri's government would be futile if Fernandez ultimately comes to power in October.",
    "\"Any deal could be torn up by the new government, so that suggests that we're in a period of limbo until the new government comes into power,\" said Edward Glossop, Latin America economist at Capital Economics.",
    "Latin American stock indexes and currencies at 14:45 GMT"
  ],
  "published_datetime": "2019-09-05 10:46:00"
}