{
  "url": "https://www.nasdaq.com/article/cisco-stock-may-go-nowhere-for-a-while-cm1206802",
  "title": "Cisco Stock May Go Nowhere for a While - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Cisco (NASDAQ: CSCO ) stock was having a fairly good year - until a couple weeks ago. Cisco's fiscal fourth quarter earnings report had some ominous details. The result was that CSCO stock had its biggest drop in about six years - 8.6%. Cisco stock also fell ahead of earnings, for a total drop of 12.3% in two sessions.",
    "Since then, the shares have remained depressed, even though the overall markets have staged a nice rally.",
    "So let's take a look at the quarter. On the positive side of things, CSCO reported its strongest growth on the top line in about six years, with revenues up 6% to $13.4 billion. There was actually strength across all the main businesses like switches, routers and other networking equipment. The security unit also remained strong, with sales up about 14% to $714 million.",
    "In the meantime, CSCO continues to invest heavily in its M&A. The biggest deal was for Acacia Communications (NASDAQ: ACIA ), for $2.6 billion. The company is a fabless semiconductor operator that is focused on high-speed interconnect offerings. The deal certainly looks like a synergistic fit and should help with growth.",
    "There have also been a variety of smaller deals. For example, Cisco has acquired Voicea, which has a real-time transcription service for meetings. Then there was the acquisition of CloudCherry, a provider of technology for customer experience management. At the core of this is advanced predictive analytics and machine learning.",
    "Okay, so why did Wall Street sell off Cisco stock? Well, the guidance was not encouraging. The current quarter is likely to see revenue growth of 0% to 2%, while the Street was looking for 3% (the company does not provide full-year guidance). CSCO also expects earnings to be below forecasts.",
    "As the global economy has come under pressure, Oracle's sales to service providers have decelerated. Let's face it, such purchases can easily be delayed whenever there is economic uncertainty. Keep in mind that other suppliers of large technology equipment - like NetApp (NASDAQ: NTAP ) - have also reported disappointing results.",
    "For CSCO, there could be further problems as competitors like Arista Networks (NYSE: ANET ) and Hewlett Packard Enterprise (NYSE: HPE ) get more aggressive on pricing to pick up new customers In other words, Cisco's margins could be vulnerable.",
    "Next, the situation in China remains a nagging issue. On the earnings call, Cisco CEO Chuck Robbins noted that sales to providers in the country have taken a big hit (down a grueling 25%). Note that it appears that the company is not even being invited to bid on new projects!",
    "It's not clear how long this will last. But given that there has been little substantive progress on trade talks, the problems in China could persist for some time.",
    "With the drop-off in Cisco stock, the valuation is now at reasonable levels. Consider that the forward price-to-earnings ratio is at roughly 13x. The dividend is also an attractive 3%. This is actually among one of the highest in the tech industry.",
    "CSCO also should continue to generate strong cash flows. For fiscal 2019, they came to a hefty $15.8 billion, up 16% on a year-over-year basis. There is about $33.4 billion in the bank.",
    "So for now, there may be a floor on CSCO stock, as the bad news seems to be factored in.  On the other hand though, this does not mean there will be much upside either from current levels.  There are few headwinds on the horizon. Rather, with the global economy in flux, there could easily be some more negative surprises.",
    "So for the time being, there should be no rush to get into CSCO stock.",
    "Tom Taulli is the author of the book,  Artificial Intelligence Basics: A Non-Technical Introduction . Follow him on Twitter at  @ttaulli . As of this writing, he did not hold a position in any of the aforementioned securities.",
    "The post Cisco Stock May Go Nowhere for a While appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:49:49"
}