{
  "url": "https://www.nasdaq.com/article/3-stocks-warren-buffett-would-love-cm1206782",
  "title": "3 Stocks Warren Buffett Would Love - Nasdaq.com",
  "text": [
    "There's no single factor explaining Warren Buffett's long string of profitable stock investments through the years. In fact, the Oracle of Omaha's strategy has shifted over the decades, in some cases stressing deep value plays and at other times paying premiums for high-performing businesses.",
    "The good news is that Buffett has been outspoken about the key factors he considers when shopping for stocks, including high returns on invested capital, brand strength, and customer loyalty. Yet he doesn't necessarily invest in every single stock that meets those criteria. Below we'll look at a few stocks that investors can buy today that boast one or more of these crucial characteristics.",
    "Image source: Getty Images.",
    "A sure way to lose money investing in stocks is to buy companies that destroy shareholder value, or require increasing amounts of cash simply to compete in their industries. The best businesses, on the other hand, generate lots of excess cash and consistently find ways to invest in high-return initiatives.",
    "Home Depot 's (NYSE: HD) stellar return on invested capital, a favorite Buffett metric, fits squarely in the latter category. It trounces peers like Lowe's (NYSE: LOW) . Yet at over 40%, the efficiency figure is also one of the highest on the entire stock market.",
    "HD Return on Invested Capital (TTM) data by YCharts. TTM = trailing 12 months.",
    "That market-thumping result is partly due to the retailer's steady market-share gains and above-average profitability. Other important factors have been smart investments in building its e-commerce infrastructure in recent years, while upgrading the shopping experience for professional contractors and DIY shoppers, and buying back shares. These moves, and the financial wins that they produced, suggest the management team has the desire -- and ability -- to be good stewards of whatever capital the company generates.",
    "Buffett seeks companies with above-average levels of customer loyalty, since that factor supports steadier growth and strong pricing power. TJX Companies (NYSE: TJX) , the retailer behind the T.J. Maxx, Marshalls, and Home Goods brands, easily meets this standard.",
    "The seller of off-price apparel and home goods has notched higher sales at its network of existing locations in each of the last 23 years, which is a record that traditional retailing peers like Walmart and Target just can't match. Following a strong second-quarter report, highlighted by customer traffic gains across its brands, the chain in mid-August affirmed its prediction of modest growth in both the top and bottom lines this year following a banner 2018.",
    "TJX Companies can build on that positive momentum by using its dominant industry position to secure quality merchandise at deep discounts. Its track record over the last two decades suggests a knack for finding these products, and for marketing them to customers through its flexible store layout. These are a few of the biggest reasons CEO Ernie Herrman and his team believe they can expand their base to as many as 6,000 locations over the long term from the current footprint of 4,400.",
    "McDonald's (NYSE: MCD) has stumbled at times in keeping fans happy over the past few decades. Yet it has always found its way back to market leadership through whatever turn that consumers take in their tastes for fast food. That persistent customer loyalty is a major indicator that Buffett looks for in stocks, and it helps make Mickey D's an attractive investment.",
    "The latest results show that its menu changes, like switching to cage-free eggs and never-frozen beef, are resonating with customers. Its massive capital investment plan, meanwhile, is helping CEO Steve Easterbrook lift sales growth in McDonald's home country closer to the market-thumping pace it enjoys in places like Australia and France.",
    "The best news is that there's room to further improve on its growth rate while still generating the type of profitability that rivals can only dream about. Its operating margin is rising toward the mid-40% range, versus 33% for Yum! Brands  and 8% for Chipotle Mexican Grill . That performance gap would likely jump out to Buffett, and it's a sign that investors who buy the stock today won't be disappointed in their long-term returns.",
    "10 stocks we like better than Home Depot\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Home Depot wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Demitrios Kalogeropoulos owns shares of Chipotle Mexican Grill, Home Depot, and McDonald's. The Motley Fool owns shares of and recommends Chipotle Mexican Grill. The Motley Fool has the following options: long January 2021 $120 calls on Home Depot. The Motley Fool recommends Home Depot, Lowe's, and The TJX Companies. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:29:00"
}