{
  "url": "https://www.nasdaq.com/article/notable-wednesday-option-activity-psa-uri-algn-cm1210648",
  "title": "Notable Wednesday Option Activity: PSA, URI, ALGN - Nasdaq.com",
  "text": [
    "Looking at  options trading  activity among components of the S&P 500 index, there is noteworthy activity today in Public Storage (Symbol: PSA), where a total volume of 6,635 contracts has been traded thus far today, a contract volume which is representative of approximately 663,500 underlying shares (given that every 1 contract represents 100 underlying shares). That number works out to 78.5% of PSA's average daily trading volume over the past month, of 844,930 shares. Especially high volume was seen for the $230 strike call option expiring September 20, 2019  , with 1,874 contracts trading so far today, representing approximately 187,400 underlying shares of PSA. Below is a chart showing PSA's trailing twelve month trading history, with the $230 strike highlighted in orange:       makeArticleAd();    United Rentals Inc (Symbol: URI) options are showing a volume of 8,852 contracts thus far today. That number of contracts represents approximately 885,200 underlying shares, working out to a sizeable 68.3% of URI's average daily trading volume over the past month, of 1.3 million shares. Especially high volume was seen for the $99 strike put option expiring September 20, 2019  , with 721 contracts trading so far today, representing approximately 72,100 underlying shares of URI. Below is a chart showing URI's trailing twelve month trading history, with the $99 strike highlighted in orange:       And Align Technology Inc (Symbol: ALGN) options are showing a volume of 7,946 contracts thus far today. That number of contracts represents approximately 794,600 underlying shares, working out to a sizeable 66.4% of ALGN's average daily trading volume over the past month, of 1.2 million shares. Especially high volume was seen for the $185 strike call option expiring September 20, 2019  , with 1,706 contracts trading so far today, representing approximately 170,600 underlying shares of ALGN. Below is a chart showing ALGN's trailing twelve month trading history, with the $185 strike highlighted in orange:         For the various different available expirations for PSA options  , URI options  , or ALGN options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:17:58"
}