{
  "url": "https://www.nasdaq.com/article/mcdonalds-apprente-buyout-to-boost-technology-offerings-cm1210534",
  "title": "McDonald's Apprente Buyout to Boost Technology Offerings - Nasdaq.com",
  "text": [
    " In a bid to improve technological offerings and customer experience, McDonald's Corporation MCD  has announced its plan to acquire Apprente, a voice-based conversational system startup. However, the value of the deal has been kept under wraps. This technology will make the order process faster, simpler and more accurate order taking at the Drive Thru. The company has already tested this technology at its restaurants. McDonald's president and chief executive officer, Steve Easterbrook, stated that \"Apprente's gifted team, and the technology they have developed, will form McD Tech Labs, a new group integrated in our Global Technology team that will take our culture of innovation one step further.\"  makeArticleAd(); Technological Capabilities to Drive Growth    The Apprente buyout is the company's third tech acquisition this year. In March, McDonald's had signed an acquisition agreement with Dynamic Yield Ltd. After testing Dynamic Yield in several U.S. restaurants, the company plans to expand this facility in other national and international restaurants in 2019. McDonald's will start integrating this technology into self-order kiosks and Global Mobile App.    By acquiring Dynamic Yield, McDonald's can utilize the decision technology to provide personalized customer experience. With the help of this technology, the restaurant can have displayed Drive-Thru menus, depending on time, weather, restaurant traffic and popular items. The technology will also enable customers to view preferred menus from their personal choice algorithm.    The company has also invested in Plexure, a mobile app vendor, for the advance development of McDonald's Global Mobile App.    These strategic acquisitions will benefit McDonald's to fortify technological capabilities.    McDonald's continues to deliver positive results across the majority of its high-growth markets by focusing on new products alongside delivery growth, value and breakfast platforms' enhancement. In the past six months, the stock has gained 15.3% compared with the industry  's 20.8% rally.     Zacks Rank & Key Picks  McDonald's has a Zacks Rank #3 (Hold). Better-ranked stocks worth considering in the same space include Chuy's Holdings, Inc. CHUY  , YUM! Brands, Inc. (YUM), and Shake Shack Inc. SHAK  . Chuy's Holdings sports a Zacks Rank #1 (Strong Buy), whereas YUM! Brands and Shake Shack carry a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here.     Chuy's Holdings, YUM! Brands and Shake Shack have an impressive long-term earnings growth rate of 17.5%, 12.3% and 22.5%, respectively.   Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana. Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   McDonald's Corporation (MCD): Free Stock Analysis Report   Shake Shack, Inc. (SHAK): Free Stock Analysis Report   Chuy's Holdings, Inc. (CHUY): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "In a bid to improve technological offerings and customer experience, McDonald's Corporation MCD  has announced its plan to acquire Apprente, a voice-based conversational system startup. However, the value of the deal has been kept under wraps.",
    "This technology will make the order process faster, simpler and more accurate order taking at the Drive Thru. The company has already tested this technology at its restaurants. McDonald's president and chief executive officer, Steve Easterbrook, stated that \"Apprente's gifted team, and the technology they have developed, will form McD Tech Labs, a new group integrated in our Global Technology team that will take our culture of innovation one step further.\"  makeArticleAd(); Technological Capabilities to Drive Growth    The Apprente buyout is the company's third tech acquisition this year. In March, McDonald's had signed an acquisition agreement with Dynamic Yield Ltd. After testing Dynamic Yield in several U.S. restaurants, the company plans to expand this facility in other national and international restaurants in 2019. McDonald's will start integrating this technology into self-order kiosks and Global Mobile App.    By acquiring Dynamic Yield, McDonald's can utilize the decision technology to provide personalized customer experience. With the help of this technology, the restaurant can have displayed Drive-Thru menus, depending on time, weather, restaurant traffic and popular items. The technology will also enable customers to view preferred menus from their personal choice algorithm.    The company has also invested in Plexure, a mobile app vendor, for the advance development of McDonald's Global Mobile App.    These strategic acquisitions will benefit McDonald's to fortify technological capabilities.    McDonald's continues to deliver positive results across the majority of its high-growth markets by focusing on new products alongside delivery growth, value and breakfast platforms' enhancement. In the past six months, the stock has gained 15.3% compared with the industry  's 20.8% rally.",
    "    Zacks Rank & Key Picks ",
    "McDonald's has a Zacks Rank #3 (Hold). Better-ranked stocks worth considering in the same space include Chuy's Holdings, Inc. CHUY  , YUM! Brands, Inc. (YUM), and Shake Shack Inc. SHAK  . Chuy's Holdings sports a Zacks Rank #1 (Strong Buy), whereas YUM! Brands and Shake Shack carry a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here.     Chuy's Holdings, YUM! Brands and Shake Shack have an impressive long-term earnings growth rate of 17.5%, 12.3% and 22.5%, respectively.   Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:48:00"
}