{
  "url": "https://www.nasdaq.com/article/surprise-fall-in-brazil-industrial-output-questions-strength-of-economic-rebound-20190903-00560",
  "title": "Surprise fall in Brazil industrial output questions strength of economic rebound - Nasdaq.com",
  "text": [
    "By Jamie McGeever",
    "BRASILIA, Sept 3 (Reuters) - Industrial production in Brazil fell in July for a third month in a row, official figures showed on Tuesday, an unexpected decline that suggested the country's economic recovery might not be as solid as other recent data has indicated.",
    "Industrial output fell 0.3% in July from June on a seasonally adjusted basis  and fell 2.5% from a year earlier on a non seasonally-adjusted basis , government statistics agency IBGE said.",
    "The figures follow survey data for August which pointed to a firmer rebound in Brazilian manufacturing and industry. The IHS Markit manufacturing purchasing managers index for August, for example, hit a five-month high and posted its biggest month-on-month increase since March last year. ",
    "\"It's pretty bad, well below expectations. And bear in mind that there was a pretty strong contribution from the mining sector as iron ore output has started to recover,\" said William Jackson, chief emerging markets economist at Capital Economics.",
    "\"The good news is that the surveys suggest August was better. But even so, it highlights that the recovery is very bumpy and makes a 50 basis point cut in interest rates later this month very likely,\" he said, referring to the central bank's next policy meeting on Sept. 17-18.",
    "Output of intermediate goods fell 0.5% on the month and 5.4% on the year, IBGE said, the main driver of the overall decline. Production of capital goods fell 0.3% on the month, but rose 6.6% on the year.",
    "Production of consumer, durable, semi-durable and non-durable goods all rose on the month and the year, IBGE said.",
    "So far this year, industrial production is down 1.7% on the first seven months of last year, while the accumulated decline over the last 12 months is 1.3% compared with a year earlier.",
    "Official figures last week showed that manufacturing and industrial production were major contributors to a surprisingly strong 0.4% expansion of gross domestic product in the second quarter. "
  ],
  "published_datetime": "2019-09-03 08:44:00"
}