{
  "url": "https://www.nasdaq.com/article/florida-braces-for-hurricane-dorian-utilities-in-focus-cm1206619",
  "title": "Florida Braces for Hurricane Dorian: Utilities in Focus - Nasdaq.com",
  "text": [
    " Hurricane Dorian continued to batter the coasts of Bahamas on Sep 1 and 2, bringing in heavy rains and wind gusts exceeding 200 miles an hour (per The Wallstreet Journal). It hit the Bahamas as a category 5 hurricane but has now weakened to a category 4 storm per the U.S. National Hurricane Center's (NHC) latest update. The hurricane - deemed as the strongest this year so far in the world - is projected to make landfall in Florida on late Tuesday and then in Georgia, North and South Carolina in the following days.  Impact on Utilities  In times of natural calamities like hurricanes, the Utility  sector tends to suffer. The rampage caused by heavy winds and catastrophic flooding affects transmission lines, forcing thousands to deal with power cuts. Notably, the National Weather Service has warned of hurricane-strength winds, several feet of storm surges and the risk of dangerous flash floods along much of the Florida coastline in the coming days. No doubt, once the catastrophic storm hits the coast of Florida, utilities' operations in the state will suffer, resulting in widespread power outage. Considering the fact that Florida is the third most populated city of the United States, demand and subsequently consumption of electricity is also high. Therefore, some of the top utility players of the United States have significant operations in this state.   Dorian's estimated impact on the state's properties is expected to hamper the smooth flow of electricity through the transmission lines.  Utilities in Focus  We have handpicked a few Utility players that have operations in Dorian's expected pathway and are thus expected to bear the brunt of the storm. In fact, a few of these utilities have announced their emergency infrastructure strengthening initiatives. These utilities carry a Zacks Rank #3 (Hold), which makes them worthy of retention in investors' portfolio. You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .  Duke Energy DUK  : This electricity provider expects Dorian to bring tropical force winds that will cause significant damage to its infrastructure and widespread power outages due to flying debris, fallen trees, downed poles and lines. Thus, the company has put nearly 6,500 transmission and distribution personnel in place to support power restoration in Florida, which is nearly three times the typical number of crew in the state.  NextEra Energy NEE  : Its subsidiary, Florida Power & Light Company, expects that a large portion of its service area will be impacted by Dorian and may experience power outages for potentially prolonged periods. Thus, it has arranged for nearly 16,000 personnel to work on restoration and is working to get more resources from across the country before the storm's landfall.  Dominion Energy D  : This Zacks Rank #3 stock has extensive operations in the Carolinas. Per media sources, it has arranged for 40 tree contractors and plans to bring in extra line workers to help with the storm's aftermath.  Southern Company SO  : This company's largest electric subsidiary, Georgia Power, is reportedly monitoring the storm, adjusting plans for response and coordinating with emergency partners, including the Georgia Emergency Management Agency and the National Weather Service. It has already activated its storm command center in Atlanta, GA.  Bottom Line  There's no doubt that utilities in Dorian's expected pathway are doing their best to restore power in the event of an outage and taking necessary infrastructural initiatives to weather storm effects. However, restoring power after a massive storm can be extremely challenging due to strong winds and widespread flooding. Thus, the infrastructural strength of these utilities will be put to test when the hurricane actually hits. Their share price may also take a hit.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Dominion Energy Inc. (D): Free Stock Analysis Report   NextEra Energy, Inc. (NEE): Free Stock Analysis Report   Duke Energy Corporation (DUK): Free Stock Analysis Report   Southern Company (The) (SO): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Hurricane Dorian continued to batter the coasts of Bahamas on Sep 1 and 2, bringing in heavy rains and wind gusts exceeding 200 miles an hour (per The Wallstreet Journal). It hit the Bahamas as a category 5 hurricane but has now weakened to a category 4 storm per the U.S. National Hurricane Center's (NHC) latest update.",
    "The hurricane - deemed as the strongest this year so far in the world - is projected to make landfall in Florida on late Tuesday and then in Georgia, North and South Carolina in the following days.",
    " Impact on Utilities ",
    "In times of natural calamities like hurricanes, the Utility  sector tends to suffer. The rampage caused by heavy winds and catastrophic flooding affects transmission lines, forcing thousands to deal with power cuts. Notably, the National Weather Service has warned of hurricane-strength winds, several feet of storm surges and the risk of dangerous flash floods along much of the Florida coastline in the coming days.",
    "No doubt, once the catastrophic storm hits the coast of Florida, utilities' operations in the state will suffer, resulting in widespread power outage. Considering the fact that Florida is the third most populated city of the United States, demand and subsequently consumption of electricity is also high. Therefore, some of the top utility players of the United States have significant operations in this state.  ",
    "Dorian's estimated impact on the state's properties is expected to hamper the smooth flow of electricity through the transmission lines.",
    " Utilities in Focus ",
    "We have handpicked a few Utility players that have operations in Dorian's expected pathway and are thus expected to bear the brunt of the storm. In fact, a few of these utilities have announced their emergency infrastructure strengthening initiatives. These utilities carry a Zacks Rank #3 (Hold), which makes them worthy of retention in investors' portfolio. You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    " Duke Energy DUK  : This electricity provider expects Dorian to bring tropical force winds that will cause significant damage to its infrastructure and widespread power outages due to flying debris, fallen trees, downed poles and lines. Thus, the company has put nearly 6,500 transmission and distribution personnel in place to support power restoration in Florida, which is nearly three times the typical number of crew in the state.",
    " NextEra Energy NEE  : Its subsidiary, Florida Power & Light Company, expects that a large portion of its service area will be impacted by Dorian and may experience power outages for potentially prolonged periods. Thus, it has arranged for nearly 16,000 personnel to work on restoration and is working to get more resources from across the country before the storm's landfall.",
    " Dominion Energy D  : This Zacks Rank #3 stock has extensive operations in the Carolinas. Per media sources, it has arranged for 40 tree contractors and plans to bring in extra line workers to help with the storm's aftermath.",
    " Southern Company SO  : This company's largest electric subsidiary, Georgia Power, is reportedly monitoring the storm, adjusting plans for response and coordinating with emergency partners, including the Georgia Emergency Management Agency and the National Weather Service. It has already activated its storm command center in Atlanta, GA.",
    " Bottom Line ",
    "There's no doubt that utilities in Dorian's expected pathway are doing their best to restore power in the event of an outage and taking necessary infrastructural initiatives to weather storm effects. However, restoring power after a massive storm can be extremely challenging due to strong winds and widespread flooding. Thus, the infrastructural strength of these utilities will be put to test when the hurricane actually hits. Their share price may also take a hit.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:54:00"
}